[
    {
        "post_id": "iovum5",
        "author": "zeromig",
        "title": "Skip on a high school senior tradition? Never, but how about a double-serving of malicious compliance instead?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/iovum5/skip_on_a_high_school_senior_tradition_never_but/",
        "score": 14586,
        "num_comments": 346,
        "created_utc": 1599579599.0,
        "selftext": "This isn't my story, but it happened to some high school classmates of mine in the late 1990s. Unfortunately, I wasn't smart enough to be part of it. \n\nThe AP Calculus class teacher had a tradition that held up for at least a decade, where, if you brought your college acceptance letter, you'd be invited to his Breakfast Club: essentially, instead of taking the math final exam for the year, he'd provide transportation to the local IHOP, buy everyone breakfast, and shoot the breeze together. \n\nThe gesture was a popular and welcome one-- after all, these were the brightest kids in the school, the top 10%, including the valedictorian and the salutatorian, the captain of the debate team, and others. Taking a final exam when they were already assured their places in Ivy-league schools was a pointless formality, after all.\n\nThe year this story happened, however, there was a new teacher who made a big deal about how unfair the Breakfast Club was (funnily enough, her name was Karen). The school's vice principal came in and told the class that they would stay in the school with everyone else, and take the final exam, or else they'd face in-school suspension.\n\nThe AP Calculus teacher had his hands tied. So, on the day of the test, a Friday, the whole class came in and took their test, which consisted of a single question: What's your name? The students looked up to see a shit-eating grin on the teacher's face, and they quickly caught on: everyone filled in their papers, submitted them, and then they went off to IHOP. Perfect test scores for everyone!\n\nBy the time the weekend was over, the whole school knew the story, and Karen must've complained to the vice-principal once more, because he came and gave in-school suspension tickets for the entire class. \n\nIt was truly an odd sight to see the school's geniuses file into the ISS room-- only to find their AP Calc teacher, who had volunteered for monitor duties, or swapped with the normal monitor, or something. And he had brought bags of bagels, cream cheese, whitefish spread, and butter for everyone serving suspension that day.\n\nMr Buckley, you're a legend!\n\nEDIT : Forgot a detail.\n\nEDIT2: Thanks for the awards, everyone! Hope you all have a great day!",
        "permalink": "/r/MaliciousCompliance/comments/iovum5/skip_on_a_high_school_senior_tradition_never_but/",
        "comments": [
            "Personally if I  were the teacher I  be complaining about the principal undermining me in front of my class to the union.  By punishing the class you make the teacher look like they were wrong which makes it harder for them to trust the teacher.",
            "Particularly stupid because everybody knows the only important score from an AP class is the AP test score.  Lol.",
            "Why would the class get suspended for something the teacher did?",
            "you really got me wondering if this is the same incredibly awesome mr. buckley we had in school;  i can definitely see him doing something like this.  assuming you're in the US based on your usage of \"ISS\", would you happen to know what state this was in?  (i totally understand if you're wanting to keep your friend anonymous)",
            "When I had AP calculus, we had no final exam: the AP test was 2 weeks before final exams anyway, and it was harder, and it was what really counted.",
            "[deleted]",
            "I was was an AP student... It pisses me off when we got something nice for once and it was deemed \"unfair\"... I busted my ass to get those grades. \n\nFootball/Basketball/Whatever team getting excused from class so they could ride a bus... Totally fair!\n\nShow choir getting excused from Monday because they spent the entire weekend at some thing or another... Totally fair!\n\nAP students getting excused final tests? Even if we failed (0%) them, we'd still get passing grades... HOW COULD YOU THINK OF SUCH HORRIBLE ATROCITIES!!!",
            "Unrelated, but the end of your story made me crave my great-uncle's whitefish dip that he used to make for family gatherings. I think the recipe died with him, unfortunately. I miss him and his amazing dip.",
            "Geez. At my school, basically all AP classes followed this structure:\n\nAny 'Final Exams' happened before the AP Exam\n\nAfter the AP Exam, all AP classes are basically movies and board games. AP teachers would regularly give hall passes to let students go visit friends in other AP classes.\n\nYour score on the AP exam can override your existing grade - 4's ensure B's, 5's give A's.\n\nSeveral (but not all) AP teachers would do similar rewards for students - In N Out, Krispy Kreme, etc. \n\nMr. Buckley sounds like a real MVP!",
            "The test should’ve gone like this \n\n“What is your name” \n\n“What is your quest” \n\n“What is the air speed velocity of an unladen swallow?”",
            "My high school Calculus teacher had a better tradition. At the end of the year she wrote a letter to the head of the local university's math department asking them to give us credit for Calculus 1 and they did! It was great to get to skip it. She was a local legend, about 10 years beyond when anyone else would have retired, and nobody messed with her.",
            "Why would the principal give students ISS for something a teacher did? As a parent I would have been to the school board pretty quick on that one.",
            "Collective punishment is a violation of the Geneva Conventions.\n\nYes, I know the Geneva Conventions don’t apply.  These are children, not enemy soldiers.",
            "Karen and the vice-principal thought it was a game of checkers.\n\nNo, it was a game of 4D chess. And Mr Buckley had them in checkmate since the first move.",
            "I got caught at the bagel shop about 1/4 mile from the school after school had started by one of my teachers.  In mutual understanding, my punishment (I offered) was to buy him his coffee and bagel.  All was good!",
            "This is the most American thing I've ever read lmao. Had to look up half these terms and I'm still at a loss.",
            "Its wild that the VP punished the students for something that at that point they couldn't control. I suppose they couldn't do much to the teacher but its just wild.",
            "We pranked our Calc teacher for a senior prank. Our AP English teacher had a skeleton key and let us in while all of the teachers were in their weekly staff meeting. \nWe destroyed his classroom in an easily repairable way. Desks turned upside down and backwards with plastic wrap weaved through so you couldn't just turn them over, whiteboard was sticky noted, chalk board with classroom rules was made so every rule was opposite, all items on his desk plastic wrapped, then wrapped againin foil.\nHe loved the gesture so much he emailed all of our parents telling them we were all his best students and asking if we had pictures of the havoc we reaped upon his classroom. Lol",
            "Wtf, I'm not doing ISS or taking any punishment for something my teacher did.  Principal can get fucked.",
            "[deleted]",
            "This story is both sweet (pancakes) and savory (bagels) and I loved every bite of it!",
            "That's a great story. 20 years ago when I was in high school, the unwritten rule was that anyone taking an AP exam didn't have to go to other classes that day. We could leave after the exam if it was a morning one or show up late if it was an afternoon one. I remember our grade level principal watching about 75 of us go to our cars after the Calc exam; I guess just to make sure it was only the AP Calc students leaving.",
            "This is a great tradition, but I sort of wish it was for all of the kids who applied to colleges, not just those who got in. But the fact that he has to do this all on a teacher’s salary means it’s super understandable why the trip could be limited.\n\nWhat a great guy, very big brain move.",
            "We had “English Club” in high school. Where we would go to Mr. Riley’s room (he was an English teacher) during lunch, someone would jump out of his window to their car and get Wendy’s or BK from around the block, and we’d have a two-sentence English lesson while they were gone. I remember one where my friend went to the board, wrote “fricative” and basically said “a fricative is X”. Hung out for a few minutes and then another friend was shortly shoving the lunch bags through the window they would then jump back into. He was a great teacher. Was never mean, made things interesting, and, I mean, let us climb through his window while he was covering for us.",
            "Hate how rewarding someone for being good at something is deemed unfair by mediocre people. Really paints the image of the school system only existing to conform everyone to the standard factory worker",
            "Whitefish salad!",
            "Legendary teachers like that are a rare and dying breed.",
            "til there is a thing called whitefish spread.",
            ">\tTaking a final exam when they were already assured their places in Ivy-league schools was a pointless formality, after all.\n\nThis is basically why, in my school, if any senior had at least a C going into any final, they didn't have to take it. Our graduation ceremony actually happened before finals were over for everyone else.",
            "Those who can, do.\n\nThose who can't, Karen.",
            "Fucking Karen always has to try and ruin things doesn't she? Thankfully that teacher is an absolute legend and worked his way around it all. If I were the parents of those kids though, I'd be rightfully chewing someone out over that pointless suspension.",
            "Why did only 10% of your class go to college. That seems like an extremely low number. Pretty sure my school was like 75%",
            "Hope revenge was taking out on Karen.",
            "Amazing!",
            "This was right under [this post](https://www.reddit.com/r/oddlyspecific/comments/iossel/clearcut_instructions/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)  and I feel like it fits well",
            "hell yea. Supposed to be doing home work for algebra 1 but this is way better",
            "So, did Mr. Buckley continue the tradition after that year?",
            "I went to a Catholic all boys high school.  My Sophomore English teacher discovered me in detention one day and told the proctor that hed supervise me whilst in detention.  We went grocery shopping for the Brothers residence.  He told me to tell him when I'd gotten detentions from then on and hed come and get me.  I returned tapes to Blockbuster with him, picked up $1200 worth of top shelf booze, went shoe shopping, \"cleaned\" the weight room, etc.   RIP Br. H...you were the best!",
            "Whitefish spread just sounds gross but sounds like he was a good teacher who saw students as people!",
            "Whitefish spread? I threw up in my mouth a little!",
            "Imagine punishing a whole class of students for the teacher's transgression?",
            "*O Captain, my Captain!*",
            "I'm not one to brag--too many braggarts in my life drove me up the proverbial wall-- but in Senior Year of HS, my Gym Teacher told the class **'Today we're not running track, we're not** ***walking*** **around the track. Today we're walking home with Yume! We'll follow her route she takes when school is a half day!'** Needless to say I decided to be a bitch with gym teacher's blessing and took them the LONG way home. Needless to say when I got to my front door my late grandmother was standing there laughing her freaking ass off and said **'Why are you all so winded? Surely it wasn't THAT long a walk!'** so then I decided to walk them back to school again, the LONG way and made a stop at my mom's house to find out my younger step-sister had again skipped school, found her coming out of an empty house pulling down her skirt while stuffing her undies in to her purse. Big sis marched her perky ass home then proceeded to walk back to High School. By the time we got back to school whelp it was time for lunch. No one was hungry as they were all exhausted and asked **'Where the hell did you get the energy for that walk?'** Dunno, when I'm pissed or on a mission, I walk and walk.. can careless where I end up. I've walked so far that I've ended up at the Cemetery and walked home again.",
            "Whitefish spread.. I can only imagine you live in Michigan or the great lakes haha... and this is the first time ive seen someone share my name! That teacher Rocks!",
            "Never gonna make you cry",
            "Everybody knows teenagers go crazy for... smoked whitefish.",
            "what an innocent and inspiring story 👏",
            "I had a teacher in HS who was also awesome and was also named Buckley. This wouldn't happen to have been in PA, would it?",
            "I’m just glad seniors don’t have to take end of year exams at my Highschool. Their last day is about a week or two before ours.",
            "Now hold on, they actually punished the kids, the best and brightest amongst them, because the teacher decided to say 'fuck the principal' and set a one question paper? What the Christ did he expect the kids to do there, sit in silence and wait out the whole hour+? Most schools allow you to quietly leave if you finish a paper early.",
            "Tales of legend.\n\nAwesome!",
            "I really don’t understand some administrators. At my school, we had chapel once a week since we were a private Christian school and since chapel was in the morning- most kids were like zombies and not really awake. I had a teacher that would sort of dance up and down the aisles to get us to react more to the songs. She got in trouble. Fortunately not fired, but reprimanded and chapel was definitely much less fun afterwards. I was floored. \n\nThe parents at my school did have a malicious compliance though when they announced that we couldn’t have the banquet (our version of prom) due to in compliance to the ridiculous dress code. However, the parents knew how difficult it was to find such clothing without spending a fortune in the catalogs so they decided that since we were seniors they were like okay, no banquet- then planned a prom instead.",
            "something something terry pratchet",
            "Like a theory of time travel ramifications, tradition corrects the depth charge blast from a petty bitch",
            "Reason number 32781 public school is an outdated and archaic concept",
            "I see a wall of chatter I'm liking but this teacher is a god like Holly cow the students desirve to be treated to skiping something they can lose garenteed and even if punished the teacher knew just how to make the day good XD wish the teacher has a good retirement or still teaches and knows how to get students to become good ones.",
            "> whitefish spread\n\nmini soda?",
            "Some ppl just have no joy in life. Usually jealous ignorant peasants.",
            "What about the kids without the money to go to college? What about the kids who planned to join the armed forces? What about the kids who had to go to work to help feed their younger siblings. What about the kids who were going to a trade school? What about the kids who just plain did not want to go to college? What about the kids who couldn't match up to others intellectually? \n\nIt's like letting the 2 most popular kids in gym class choose their teams. Horrible ideas.",
            "Ah, bagels."
        ]
    },
    {
        "post_id": "cfty7k",
        "author": "rissilly",
        "title": "Want to be called by your formal name? No problem, however, you must do the same.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cfty7k/want_to_be_called_by_your_formal_name_no_problem/",
        "score": 14577,
        "num_comments": 850,
        "created_utc": 1563674979.0,
        "selftext": "Years ago, I was working for a university as a secretary for a rather large department.  I was told by the chair to call everyone by their first name rather than the formal Dr. SoandSo.  I complied  and life went on with me using informal names and them doing the same for me.  However, about a year later, I called to Dr. Soandso in the next room to ask a question.  It was benign enough and still respectful using his first name.  Not long after, I received an email.  He addressed it to Rissilly and stated that I needed to call him Dr. Soandso and not to use his first name.  I knew this was a way to establish his superiority over me but I would not have it.  I may have been the secretary but I was still a human being who deserved respect too.\n\nHere is where the malicious compliance came into play.  I wrote him an email back addressing him as Dr. Soandso.  I agreed to call him by his formal name but I insisted that he do the same to me.  I am no longer Rissilly but Mrs. Doe.  I copied the department chair and executive aide so all were in the loop.  He went to the chair to complain but she sided with me.  And so it began.  From then on out, it was Dr. Soandso on every correspondence and when I spoke to him.  If he addressed me as Rissilly, I would remind him that I wanted to be addressed as Mrs. Doe and would not answer until he addressed me as such.  This really got on his nerve.  He did not want to be the only one to call me by the formal as it messed with his need for superiority over a peon.  \n\nIt only took less than a week before he wrote me again.  This time, it was to say to please call him Paul instead of Dr. Soandso.  No apology to me just a resounding white flag surrender.  I took it as a small win for the peons and proceeded to call him Paul. I worked in that department for 8 years and we never had another problem like this.\n\n**On a side note, I always called him Dr. Soandso in front of and to the students, as most wanted to be addressed as such in their classes.\n\n**Edit:  Several are stating that I am being petty and should have addressed him as Dr since he earned that title.  While I totally agree that he earned that title, he did not earn the right to treat me differently than others in the office staff just because I was low man on the office totem pole.  If all the others can address him by first name, I should have had the same courtesy.  If he insisted on the formal, so did I.",
        "permalink": "/r/MaliciousCompliance/comments/cfty7k/want_to_be_called_by_your_formal_name_no_problem/",
        "comments": [
            "I know a story like this where a student was arguing with their landlord, along the lines of\n\nStudent: Look, Phil...\n\nLandlord: *interrupting* That’s Mr Bennett to you, James\n\nStudent: Then that’s Lord Stafford to you!\n\n(The student wasn’t kidding, he had a title, although I’ve changed all the names here)",
            "I had kind of a reverse thing happen.  Sometimes, you forget that Dr.'s and Prof.'s have personal lives.\n\nI did side typing once for a very well known and respected economist.  He was much older than I was, and although I called my own boss, also a well know professor by his first name in private, I always spoke the the economist as Prof. As this was in Israel I will use an Anglo name, so that you really get the gist.  Let us say that his name was Prof. Thomas Smith.  \n\nI call his home, and his wife answers.  I ask very politely for Prof.  Smith.  She then yells to him, Tommikins, telephone.   😂",
            "Another way around that is when the \"peon\" is overeducated.                \n\"You want to use academic titles? OK professor... but remember that I have a graduate degree myself, so you can call me Master Platypus Dreams.\"",
            "Worked a place that was chock full of Ph.Ds.. The engineers, the owner, even the receptionist (owner's wife) had them. \n\nThe only guy that insisted I call him Doctor was the sales critter with a theology degree from some bible college I'd never heard of, and that shit got stopped quick when he tried to bitch me out in front of the owner.",
            ">It only took less than a week before he wrote me again. This time, it was to say to please call him Paul instead of Dr. Soandso. No apology to me just a resounding white flag surrender. I took it as a small win for the peons and proceeded to call him Paul. I worked in that department for 8 years and we never had another problem like this.\n\nNo problem Paul.  Don't forget I'm Mrs. Doe though.",
            "My friend did something similar.  He’s a teacher in a public high school, and happily answers to Mr. So-and-so.  But whenever someone calls the school principal Mr., the principal corrects them and says, “it’s DOCTOR so-and-so.”\n\nWell, my friend has his doctorate as well. And decided to go one better and got himself ordained online.  One of those websites that knows the U.S. government can’t discriminate against any one religion, so it created a new “religion” and you can get ordained for free by filling out a form.\n\nSo now, whenever the principal (and my friend only does this to the principal) calls my friend Dr. Friend, friend corrects him. “It’s the REVEREND doctor Friend.”    And makes the principal call him Reverend Doctor all the time.\n\nOf course it helps that some years back, my friend won teacher of the year for the entire state, so not a chance he’s getting fired for this.",
            "On a related note formal titles are actually a hindrance when an emergency happens - and not knowing people names!\n\nThere was an OR that gave all the staff personalized caps (one of the few things that are visible and easily seen) and it helped tremendously with communication.\n\nAnecdotally I've totally had issues because I don't know who people are (years ago I actually barked orders at the fire chief on a chaotic scene with a department we didn't normally run with.  He did what he was instructed but I got a phone call after that) It was time critical and he was the closest person I could make eye contact with.  If you're ever in a situation where things are going badly eye contact or singling somebody out to do tasks is the way to go.  You've committed to running the emergency at that point but at least things get done",
            "It's academics like this that make the rest of academia look bad.  It's such a simple concept to respect others as you do.",
            "Reminds me, tangentially, of someone I was speaking to the other day. I was going through their qualifications and had the following exchange:\n\n>”I see you have a doctorate.”  \n>”No! I did a PhD! God everything you have about me is wrong!”\n\nI was left rather stunned.",
            "I once had a soft PhD correct me for using his first name. \n\n\"Call me Doctor\" \n\n\\*shrug\\*\n\n\"Call me Master\"",
            "Sometimes you just have to demand respect. When my mother was a nurse, many many years ago, the doctors called all the nurses by their first names.\n\nExcept my mother. She was Miz LASTNAME. (It wasn't Miss, because they knew she was married, not Mrs., or even Ms because I'm not sure that had even been coined. It was the Southern US pronunciation.)\n\nPart of it was her age. She came into nursing kind of late, after having four kids. But part of it was because she would accept nothing less.",
            "When i just had started my last job as a research coordinator, i got a shared desk and computer on a ward in the hospital i worked at. I also got work clothes from facility management, but for some reason doctors get white pants, everybody else get blue pants, administrative staff gets to wear whatever. So obviously i got confused with the nurses (no big deal, i‘m just not a trained nurse and not employed in a way that has direct patient care involved, my research participants aside).\n\nI tried my best to get to know everyone on a first name basis (since around here, adressing someone formally in a normal work setting can be seen as arrogant and even hostile). But shift work meant after months i would still get to meet new people on the ward.\n\nOne day, one of the nurses who knew i was doing  research but not that i was in fact a doctor, called me half annoyed, half friendly bantering out:“hey study nurse, if you have time to sit on your arse, maybe come over here and help us with washing this patient!“\n\nI just yelled back „that‘s still Doctor Study Nurse, for you, Julia!“\nShe went pale and looked at her superior who was sitting at her desk, just nodding, holding her laughter in. \n\nWe‘re all good friends now, all the nurses keep asking when i‘ll finally switch to an orthopedic residency at their department (mostly because i brew some real good coffee, i assume).",
            "My country also have honorific titles for people who have contributed to the country. successful business people likes purchase these titles as the titles help in business deals.\n\nUsually the rich people i know they insist on just calling them by name. Especially friends. Usually the titles will only mentioned in formal occasions. We usually still call him by their title, though.",
            "When I was in the military one of the civilian contractors I worked with passed me an email chain that had been forwarded to him.  In it, a newly minted ensign was getting ready to transfer to a job working for an Admiral, which can open a lot of doors if you manage to impress them.  \n  \nAs part of the preparation the flag officer's secretary, a civilian, was emailing the ensign with some questions and forms. In her interactions, the secretary usually addressed people by first name to set a friendly tone, and did so in this correspondence (having worked at commands with large civilian work forces, this is not uncommon).  The ensign took umbrage to this and sent back a response ranting that she had worked too hard for her title to be demeaned by the secretary not using it.  All further correspondence with her should address her as Ensign Arrogant.  \n  \nThe secretary sent back a polite reply (using the requested Ensign Arrogant) apologizing for the offence and explaining that she was just trying to be friendly. In this reply the secretary Cc:'d the Admiral's chief of staff, an O-6 Captain.  \n  \nChief of staff saw this and told the secretary that she could stop processing the Ensign's paperwork & that the Ensign was far too new to have a chip on her shoulder that big.  He continued that there were plenty of commands getting ready to go on deployment that could use the Ensign's help more than the Admiral.",
            "In my job so many people invent titles. If you work hard and earn a title like doctor or what ever and you want me to call you that, fine.\nBut in my job we get these tird or second officers that go to an office job and suddenly they become \"captain\". Not only is it a rank and not a title. But it's also irrelevant since he's not on a ship. And most of them never sailed as a captain. Some are even junior engineers that think themselves a captain just because they are in an office now.\n/rant",
            "The only time I insist people use my title is when they insist that I use theirs. Most people don't know I hold a Ph.D. and are surprised when they discover it.\n\nI do get annoyed when people e-mail me as \"Mr. PayatTheDoor.\" If you're going to use the honorific, make sure it's the correct one. It's right there in my e-mail signature.",
            "I insist everyone call me Maestro.",
            "Good for you. I'm allergic to acadamianuts. I have nothing against increasing human understanding but title and pomp only leads to subjugation and eventual tyranny.",
            "Ugh, I swear I’d never do that to you. Sorry other So and So’s are giving us all a bad name.",
            "I've dealt with many stuffed shirt like that and a line I learned from my father usually knocks them down a couple pegs:\n\n&#x200B;\n\n\"just because you smell like ape shit, don't think you're Tarzan\".",
            "I had a client like that. I work in the trades and to be honest we put our expertise above grovelling customer service. If a customer attempts to establish some sort of superiority just because they're a PhD and I'm just a worker then my attitude is that they don't really need me if they are so smart. Go ahead and do your own electrical work. (They may be a neurosurgeon but half the time they can't even change a light bulb, ffs.)\n\nI'm always polite and courteous, I'll refer to them as Sir or Ma'am. I had one pensioner correct me when I called him \"Sir\":\n\n\"You may call me doctor, son. That is my proper title.\"\n\nI had been a Marine. I, too, had worked hard to earn a title.\n\"Very well, doctor. And you may call me Sargent, as that is my proper title.\"\n\nHe just kinda looked me at for a moment and I went back to fixing his shit.",
            ">\"It only took less than a week before he wrote me again. This time, it was to say to please call him Paul instead of Dr. Soandso. \n\n\nFor some reason, I want to believe \"Paul\" isn't his name either, but a title or something else. LOL",
            "We had a teacher in High School who insisted on be called Doctor ___. He called all the students Mister/Miss ___, though.",
            "I’ve been having an argument with my boss over something similar. We work in healthcare and the rule is, unless you’re an MD or DO, you aren’t called doctor in front of the patients. Well, we have some folks with PhDs in nursing that she insists should be called Dr. Soandso. I told her that was incorrect and confusing to the patients, but if she demanded that then I was gonna need her to call me Master Kiwita.",
            "My mother worked with one of those PhDs. Her response was \"That's fine, and you can call me Master\" in reference to her masters degree.",
            "I introduce myself as Dr. Huron to patients and trainees in the hospital. \n\nBut have never corrected anyone who used my first name. And nurses, administrative staff,  etc. I EXPECT to use my first name after we develop any sort of relationship, and eventually say \"please just call me Lake.\"",
            "You should have accepted his offer to call him Paul but still insisted that he call you Mrs. Doe.",
            "The professors that insisted on being addressed as \"Your Excellency\" because they were former ambassadors were a trip. Thankfully, they seemed to accept \"Professor\" as sufficient.",
            "After he let up, did you keep having him call you Mrs. Rissilly?",
            "One of our surgeons pulled a staff member into the hall just to tell her not to use her first name.",
            "I can confirm, I've worked in academics and some of them had sticks so far up their butts they can pick their teeth with them.\n\nThe only place that it mattered was when I worked for the military. Everyone had a rank and it was used.",
            "Maybe it’s different here in NZ, but I worked in a university department for over a decade and never once had anyone get snippy about their title. It would generally be, say, Joe if talking to him, or about him with other staff; only Dr. Bloggs if talking about him with students.",
            "My mom has over 10 years of experience as a teacher and has a masters degree in something psychology/counseling related (don't know exactly what the degree is called). When we moved, she got a job she was definitely overqualified for, answering phones for a physiotherapy clinic. Part of her job was answering emails relating to people's benefits and health insurance and whatever else and she found that everyone who emailed her would sign off with their big fancy titles and she felt like they were definitely flexing so she flexed back and started adding her masters to her name in all her emails as well.",
            "My favorite professor went by Doctor Dave, which I think is a perfect mix. He gets his title, still informal and connects with the students, and alliteration as a bonus! Super nice guy",
            "I would have been tempted to tell him that this was a one way decision and kept on calling him Doctor.",
            "When I was growing up a new guy started coming to our church and insisted everyone call I'm Dr. Hisname.  He had a PhD in communications and got kind of embarrassed when all the medical doctors started doctoring each other.",
            "I am also a secretary for a department at a university. The professors get on my case (playfully) for using Dr. or Professor when I just call down the hall to them or it’s just us. When students or others outside our department are present, I strive to always always use their formal titles. \n\nThis includes if say, the dean drops by. It’s more respectful to him if I not only call him Dr. Johnson, but if I say to him that “I will let Professor Holland know you’re here.” I am on a lower level than them, and am happy to pay respect and to show that with action and word. Just as I expect the students to call me Mrs. Williams and not by my first name. Though that gap is smaller so less of a big deal, and if I first knew them outside of that realm (or have become acquainted with them) I certainly want them using my first name.\n\nEdit: Probably worth noting/making it clear that this university has not only a culture of strenuous academics, but maintains just as high a level of respect between faculty, staff, and students. I wouldn’t be as eager and happy to use formal titles if faculty and administration looked down on me, but it’s quite the opposite. I am made to feel very appreciated and valued in this community, even on the bottom of the chain as a “lowly secretary.” I’m certain I would be given grace from any department if I accidentally used an improper title/someone’s first name instead of their preferred formalities.",
            "My BIL has his PHD in nursing. That makes him Dr. X and he refers to himself that way. He isn’t a medical doctor though and works in the healthcare industry. \n\n\nIt really pisses me off because patients think he’s an MD when he isn’t.",
            "This shit always pissed me off as well. My eldest daughters KINDERGARTEN teacher insisted that the children address her as \"Dr. SoAndSo\" as she held a PhD. During our orientation she smugly made this known. Well, my very young daughter spent quite a bit of time in the hospital earlier in life and was pretty traumatized by the experience. She couldn't (and shouldn't have been expected to at age 5) differentiate between \"Dr\" and \"Physician\" and was totally terrified about going to a new place, without her parents, then this...When I mentioned it to Dr Smug, she didn't budge...I went a little off the rails and yelled at her in front of everyone in the room that if she was so small as to need her giant ego massaged by a room full of  5 and 6 year olds then she was truly the most pathetic human being I had ever had the displeasure of meeting.\n\n&#x200B;\n\nSome of the other parents who weren't as (probably obnoxious -hey, I learned it in the military ok lol) also finally stood up and started complaining. Needless to say, the \"Dr\" shit stopped there (the principal of the school had heard the commotion by that time and got involved). There's a lot of stupid that I'll put up with in this world, until my children get hung up in it...the pappa bear comes out, and no one likes that.",
            "It annoys me that at the local health centre when you complete the automated check-in procedure and it comes up with the name of the person you are seeing, if it is a doctor the screen says \"Dr Smith\" or whatever, but if it is a nurse you are seeing it just says \"Brenda\" or \"John\".\nI think this is disrespectful of the nurses as it demeans them in contrast to the way the doctors are respected.",
            "I’m in university and we call everyone by their first names. I do feel a bit disrespectful some times, but it’s what everyone does.",
            "Favourite is my prof in first year hands out syllabus and i see he has like two pHds and masters. \"Hey guys please call me matt\"",
            ">No apology\n\nOf coooooouuurse not~ that would've been too much for his *fragile*ego.",
            "Well he didn’t go to Evil Medical school just to be called Mister.",
            "Hell most professors at university ask us to just call them by their first name.",
            "If one finds formal address important, then one should use it without fail.  Wanting to only be on the receiving end of  the respect thus conferred makes one a hypocrite, as well as disrespectful.  OP was entirely correct in this response.",
            "Reminds me of my time in school. \"Hello I am Misses Krüger. What is your name?\" \n\"I am Mr. XYZ\"\n\"No, I meant your first name.\"\n\"Oh. Ok. Whats your first name?\"\n\n\"No, you call me Misses Krüger.\"\n\n\"Why?\n\n\"Because thats respect\"\n\n\"Wheres the respect for me?\"\n\n\"Youre a child.\"\n\n\"So you dont respect me?\"\n\nShe didnt answer and sent me to the head of school. He said I have to call her Misses. I tell her she has to call me Mister then.\n\nLater she read my first name on the list and adressed me like that all day. I argued a few times, but she screamed at me after getting upset once. I called her by her first name as I heard a teacher call her.\n\nWent on a few weeks, then everyone called her by her first name. \n\nShe fucking lost her superiority to a class of 8 years olds. Lmao",
            "¹+",
            "I'm confused by the number of people in this thread who hated calling their college professors Dr. I think academia is the appropriate place to use the title.\n Maybe I'm super formal? I call my medical doctor  \"Dr. So and so\" and I call my pastor \"Pastor so and so.\" If given the chance I would call a judge \"Your Honor.\" I'm a PhD so there's definitely a bias here.  But at my university the students call professors either \"Dr.\" Or \"Professor so and so\" and no one is a jerk about it at all. I understand OPs issue bc it seems like that guy was being purposely jerky. But why is it pretentious for a professor to ask people, students especially, to use the title? Especially in the workplace?",
            "This will be buried, but this is why I love my boss. I work in a church and he has a PhD, so technically, his title is Rev. Dr. Last Name. I just call him Mark. He doesn't even like the parishioners to use his full title. To them, he's just Pastor Mark (which is what I use to address him when we're not alone in the office).\n\nEdit: wrong degree (a little high rn 😂)",
            "We had a gym teacher who got a PHD in 'physical education'  (I wasnt aware they accept thesis' in crayon)  He formally demanded all his students call him Dr because he had earned it.   He was adamant.  So...one of the last pick type kids happened to be a competitive chess player.  He informed the teacher that he has just achieved the rank of '\nCandidate Master' and demanded his honorific be used as well.  You want me to call you Dr.?  than I wont reply to you unless you call me Candidate Master",
            "This is exactly what I would have done. Well done OP",
            "Took .e the whole story to realise his name wasn't real since it was Dr.so and so, I would say I need sleep but its midday",
            "What exactly did he say when he initially went to complain to the chair? “She should address me formally but I shouldn’t have to?” The nerve of this guy.",
            "This is amazing. Applause to you! This Paul sounds similar to a PI in my old department when I was in graduate school who also is named Paul. Hmmm wonder if it’s the same guy 🤔",
            "Seems to me that your earned your Mrs too.",
            "You're absolutely in the right here. Earning a doctor title entitles you to being adressed as Doctor GivenName, while reaching a certain age entitles you to being adressed as Mr./Mrs. GivenName. That shit's a birthright."
        ]
    },
    {
        "post_id": "e85wcf",
        "author": "Hip-hop-rhino",
        "title": "Why do I need to watch your kids at a convention?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/e85wcf/why_do_i_need_to_watch_your_kids_at_a_convention/",
        "score": 14576,
        "num_comments": 522,
        "created_utc": 1575870931.0,
        "selftext": "Reminded by this story: [https://www.reddit.com/r/MaliciousCompliance/comments/e7nzpp/watch\\_your\\_6\\_year\\_old\\_without\\_being\\_asked/](https://www.reddit.com/r/MaliciousCompliance/comments/e7nzpp/watch_your_6_year_old_without_being_asked/)\n\nEdit 2:  Wow, this exploded!  Please no more awards, give the money to a good charity instead.\n\nI'm a big wargames player, and a local store used to buy tickets and rent a bus to bring people to a Games Workshop convention in Baltimore (Games Day).\n\nThe cost they charge covers the bus, and a one day ticket.  The only caveat is that kids under 18 (16 with a note and an older buddy) had to have at least one adult with them, who was also paying full entry, on the idea that the parent would stay with their child.  This was made explicit in following years.\n\nNow the convention was located in the prime shopping area of the Baltimore waterfront, so every year there are a few parents who come to go shopping.  Usually though they have a few other parents who agree to watch the younger ones though.\n\nThe year this took place, my friend Hal and I ended up going.  Keep in mind that we're both in our mid 20's.\n\nSo as we go through our morning at the convention, we noticed that a familiar group of boys were following us.  When asked we were told:\n\n\"We should stay with you two because you're responsible\"\n\nNone of their parents were in sight.  Or on the site as it turns out.  Most of them were cool, at least as cool as a 10 year old can be to someone in their mid twenties.  (Ages were from 8-16).  We ended up grouping them up with an older kid as an 'assistant buddy', and took them with us.  It's not like their parents were around for us to give them back after all, and we knew most of them from the shop.  Made sure they got turns at the different events (nothing at the convention could be called inappropriate), and generally made the best of it.  But hey, we were still a bit angry at having them foisted on us without being asked.\n\nWell, it turns out none of them were given enough money for lunch.  They had their own money, which they spent on swag, but the cash their parents gave them wasn't enough to cover an actual lunch at the convention all.  It averaged about $3 per kid, when that was the price of a soda.\n\nSo, Hal and I took all of their lunch cash...and took them to Hooters.\n\nUsed that money, and some of our own to make sure the waitresses were extra attentive, and had them at their own table.  (We sat nearby to keep an eye on them)  Had them order whatever they wanted (that a kid could legally get, no booze of course), and between the restaurant being mostly dead, and the fact that Hal and I were tipping well, meant there were buxom scantly clad women around constantly, Almost a 2/1 ratio (kid to waitress).  They must have eaten five platters of wings before they were through, not including the ones they ordered but didn't like (usually because it was too spicy), those got bagged up into a cooler bag.  Told them it wasn't an issue, just order something they did like.\n\nAt the end we picked up the tab, but not before calling the trip organizer, Jim, to let him know what happened.  Was told it wouldn't be an issue, get him a receipt.  So we get the group scrubbed up, helped by the 'assistant buddies', and back to the convention, and finished the afternoon.\n\nSo we got back to the bus, and gave Jim the receipt for lunch, as well as any other necessary items, mostly beverages (gotta keep hydrated) that we bought them afterwards.   Just for them, not our bills.  (We paid for our lunch separately for example.)\n\nThe bus was set to leave at 6PM, and we were told be back for 5PM just in case, because the trip would leave, full or not.  So around 5:30 the parents start coming back in, only to meet Jim at the front.  He refused to let them on until they paid us back for watching their kids.  Told them that if they didn't pay by six, the bus would be leaving *and that they would still owe the tab*.\n\nOne parent asked for a delay to hit an ATM, and was granted permission to go.  Jim told the rest that the bus would leave when that dad got back.  A few other parents asked to see the bill, which is where they discovered that we took their 'precious angels' to Hooters...never mind the fact that we were at a convention about a game where people kill aliens with chainswords.  Jim informed them that if they had spoken to Hal and I before the convention started, then maybe they would have learned about our lunch plans, and could have watched their kids themselves.  Didn't shut up the few Karens in the group, but it reduced most of it to grumbling.\n\nAbout this point the 1st dad came back, and asked his share, was told, and left most of the parents in shock.  They apparently didn't have that much cash still on them, and Jim wasn't going to give them any more time.  Pay up and board, or stay behind and pay later.  The 1st dad offered to lend money to the rest, (not a guy you want to owe money to from what I gather) with some accepting, the rest 'finding' the cash in purses and wallets.\n\nJim ended up handing us five hundred dollars.  Almost $200 for the chicken, the rest he charged them as a 'kid-taiment' fee.\n\n&#x200B;\n\n&#x200B;\n\nEdit: thanks for the great conversations, and the piece of silver (four more and I'll have a whole electrum!).  Hitting bed now, but I'll try to answer any replies when I get up.\n\n&#x200B;\n\nEdit 2:  Wow, this exploded!  Please no more awards, give the money to a good charity instead.",
        "permalink": "/r/MaliciousCompliance/comments/e85wcf/why_do_i_need_to_watch_your_kids_at_a_convention/",
        "comments": [
            "Jim is an amazing dude.  Using his position of authority allowed him to break the news.  If you guys had explained it, even with the same words, there is no way parents like these would have taken it as well.\n\nAlso as a sidenote, I hate when people magically find money.  You just know that those are the kinds of people who were gonna promise to pay you back later, but never do it.  Jim's plan was perfect.",
            "Glad  you got paid for the \"babysitting\" too.",
            "During college I was, let’s call it a “camp counselor,,” for a summer program at Johns Hopkins. It was a three-week residential program for smart kids; they qualified by taking the SAT as sixth or seventh graders, and they came from all over the country to study. Mostly STEM classes were offered, but also philosophy, creative writing, and some fine arts IIRC. (Which i probably don’t, because it’s been awhile).  Very bright, although usually not quite as clever as they thought they were. \n\nAnyway, the kids got a day trip to the Inner Harbor as part of the program. I went along to supervise my kids—about a dozen boys, ages 12-14–and so I let them pick where they wanted to eat. They picked Hooters, so that’s where we went.  They ordered wings, drank soda, and some good clean fun. \n\nI wasn’t invited back to work the next year.",
            "You could probably cross-post this to r/entitledparents. Would be a good fit there.",
            "This is one of the best story I read on this sub. You seem to be cool.",
            "On the plus side, y'all probably made those kids' year right there.",
            "So, were the kids instructed to just follow you two around? Or were they left to their own devices, and they naturally clung to you two? \n\nEither way, the important thing is, you made those boys’ day!",
            "The kids sound WAY more responsible than their respective grown ups. Like, I'm sure it was annoying, but good on them for being like\"okay, we're on our own, we don't know where we are, that's a familiar adult we can kind of trust, let's just stick with them.\"\n\nI guess if your parents are that entitled and irresponsible, you start to figure out how to compensate for them by yourself--and unfortunately for you on that day, that included knowing their own limitations as children, and recognizing that they needed an adult.",
            "Man you did well, and sound like great dudes. \n\nReally glad you got some profit out of the situation, I have been a Scout leader for the younger end you got there and honestly impromptu being made responsible would be terrible, especially at something like a con where I usually have a rather full checklist of stuff I want to do myself.\n\nAlso you probably cemented their future plastic crack addiction for years to come, that would probably do it for me if I had any interest at the time.  \nThankfully I only play MtG, which isn't expensive at all. /s",
            "So, I'm a little confused. Did you know the parents of these kids? It seems super irresponsible for parents to thrust their kids on a stranger at a convention. I would think this could be considered neglect. It's a little different if they knew you two of you, though it's still super rude. Great story though. :-)",
            "\"We should stay with you two because you're responsible and our parents aren't\"",
            "You know, you gave those kids the best damn day of their lives though. I bet they still are talking about it.",
            "Karen - you went where you wanted to for lunch instead of someplace *I* deem appropriate for my child even though i didn't coordinate anything with you??  surprised pikachu face.",
            "You did end up being pretty responsible in the end, and it got you paid!\n\nIf I'd been in your position I'd have taught those kids every swear word I know (even the ones in other languages); bought them all non-alcoholic beer and told them not to specify when telling mother dearest; and tipped extra in Hooters for them to put on some Wu Tang.",
            "My immediate thought was find whoever is in charge and give them the \"abandoned minors\". That shit would get serious real fast for the parents. You know the kids though, and that would be a bad time for them, so your approach was likely a lot better, certainly nicer. Good job all round.",
            "The Ruinous Powers would be pleased.",
            "You're good people. Also, Hooters was a great touch.",
            "The best part of this is that you didn't at all take it out on the kids. You showed them a great time and also showed that you truly were the \"responsible\" ones.",
            "I'm glad you guys were responsible and well-mannered. That could have turned into a bad situation.\n\nDuring the days of retailing at the Radio Shack, some parents would drop their kids off there, and they would play with the display stuff. (During the holiday season, we would have a TON of radio-controlled rides and robotics, all with batteries naturally.)  One manager had a bellyfull of the parents using his store as a day care facility and threatened to call the police more than a few times for child abandonment. Naturally the parents (mostly were mothers) would go ballistic or Karen on the manager, but they would acquiesce, taking their kids elsewhere, most likely to the local TILT arcade and give them a 20 to burn on games.\n\nI tell ya, the days of malls and retail. I'm sad the former is dying, but the latter has not let up on the pace or the pressure.",
            "What the heck is wrong with some parents!? It was really kind of you to take the kids under your wing. The world is full of people who will do harm especially to children. So much bad could have happened to the kiddos. I’m sorry you had to babysit but I’m glad you got your money back. And good job taking them to Hooters!",
            "The working model of \"Children left unattended will be given espresso and a puppy\"....",
            "Sounds like you gave some whipper snappers something to remember.  Hooter girls are great. People bring kids to Hooters all the time.",
            "I would venture a guess that the kids learned a LOT that day. \n\nalso, boobs. but mainly how to not be shitty.",
            "Yeah a lot of parents think that just because its a game with tiny soldiers that its for kids.\n\nI'm currently building a chaos ultramarine predator tank where the barrel has been modified so it can point straight up and act as a stripper pole for a daemonette. Also I'm planning on mounting two 3rd party slave girls on the hull.\n\nI call it \"The Sexual Predator\"",
            "i think im in love with Jim.  PS you did awesome those little guys are going to remember the cool  guys from the convention for the rest of their lives haha",
            "Nice.",
            "This is amazing. You guys really did the kids a solid.",
            ">GW Convention  \n>\"nothing too inappropriate\"  \n\n\nSlaanesh cultist: \"hey kids, how'd you like to make some holes and smoke Krokodil\"",
            "Sounds like you two were very responsible.  I have been to a Hooters once.  Yes the Servers are cute.  But at least they are always covered.  (well mostly covered... ;) ) \n\nPersonally you are way more responsible than the parents involved.  Of course If anything should have happened that was a life threatening emergency neither of you could be held legally responsible as you didn't have formal permission to care for the kids.    I will put money on the kids thinking you were awesome. (as do I. )",
            "I was going to say \"I would have called the cops\" about child neglect but then I remembered I'm old enough that my folks used to let me go out on my own when I was 11 or 12 pretty much anywhere I wanted. Of course, this was the 60s and times were different.",
            "One of my first conventions I was 18(important to the story) and went to an 'after-hours' panel where you were carded before being let in. In the middle of the panel(around 1AM) they ask for everyone's attention because someone had left their young kids in the hall.\n\nThe woman who ran the panel at the time was super chill but she was PISSED.",
            "[deleted]",
            "I know the Baltimore convention center well - all the best food options really *are* Hooters and other bars.",
            "Wow. You were pretty cool about the unexpected chores; good for you. And good for Jim, getting you paid for your expenses. And I'm sure the kids loved Hooters!",
            "I suspect those kids had the time of their lives and will reminisce for years to come about the rollicking great day they had sans parents and wings at Hooters, no less.  Good on you OP for taking on the task and having the wherewithal to use it to the advantage of all (except the wayward parents!). You’re a good man, Charlie Brown",
            "Absolutely fantastic.",
            "this is awesome! the fact that you guys were responsible with the kids and kept them out of trouble\\\\danger and even managed to keep them fed while still serving the parents a nice hot plate of grow-the-fuck-up is amazing. As a parent of 2, I totally approve of your methods.",
            "I hang at a game shop and have a few gamer acquaintances that are much younger (maybe late teens/early 20s at the youngest where I am 45).  It is cool how games can bring together a bunch of different folks for a common interest, but it sucks when parents take advantage of it.  Glad to see the trip organizer wasn't about to take any shit.",
            "Unattended children will be left in the inner harbor to fend for themselves.",
            "I like Jim.",
            "Damn i miss games day.  Fest is amazing but the roche arenas not the same as the NEC in Birmingham. Still cant complain roche has an amazing hotel onsite (last 2 years ive had free upgrades)",
            "Yay for Jim.",
            "You're doing Tzeentch's work there, friend. Good on you.\n\n(I might have to check out that convention, if they still do it)",
            "> ...and took them to Hooters.\n\nThank you, OP, for the first belly laugh of the day.",
            "I’m impressed that you and Hal made the best of the situation in such a generous and kind-hearted way. I bet those kids will always remember the day. And, I’m glad the EPs had to pay the bitch tax.",
            "Why the fuck would you leave your kids with total strangers at the Baltimore Convention Center. Morons.",
            "200 bucks for chicken wings? Jfc",
            "Damn dude, as somebody who worked with kids for the better part of 5 years, I got respect for you and Jim. It definitely would have put a massive damper on my trip to the con, bring back to many bad memories. Nice one! Those kids will remember this story for a while.",
            "That Hooters is a place all convention goers frequent. All different conventions. My wife wanted to get a beer after dinner nearby and it was super convenient. Had a our small daughters with us but they advertise as a \"family\" place.  Waitresses were all over our table cooing over them. Much to the chagrin of all the tables full of guys.",
            "You should crosspost this to r/HobbyDrama, they'd love this.",
            "Out of curiosity which faction do you play.",
            "You, Hal, and Jim are legends.",
            "Used to live in SW Florida.  The clientele would be more scantily clad than the waitresses.",
            "The emperor protects",
            "And people are terrified of pedophiles and murders around their kids? HA, it's the smart responsible young adults they should look out for. Good job.",
            "Good on ya! You guys made those kids day, and that’s the most important thing.  Well, that and compensation for you and your bro. Well played!",
            "You should have left the kids with Grandfather Nürgle. He loves all his children.",
            "“Not a guy you want to owe money to from what I gather” what. Was he. Was he in the mob or something.",
            "You gave those kids an experience. :) Hell yeah you deserved to get paid.",
            "[deleted]",
            "That worked out way better than my last surprise-you're-babysitting issue...",
            "Glad you got paid and glad you stepped up. Not everyone would have done that.",
            "Best possible way to handle this situation. Get my upvote.",
            "Do you and your friend play as Salamanders by any chance?",
            "Fucking Karens. Not once.\n\nSeriously, men out there, stop fucking the Karens of the world. Karens don't deserve kids",
            "Excellent, I rate this 5/5",
            "I'm from baltimore, and just want to say thanks for looking after the kids. The area you were in was nice, but only a few buildings separated yall from the not-so-nice areas.",
            "[deleted]",
            "The utter nerve of some people! I'm glad you got comped for it and that you and the kids had a good time.",
            "200$ in chicken? holy f",
            "Jim is a great guy.",
            "> Almost $200 for the chicken\n\nDamn, that's a lot of chicken...",
            "These kids didn't have a way to contact their parents?  Surely anyone over 12 has a phone.",
            "yeah man, shits weird. I'm an American that just moved to France. I have a kid and I was watching him but then all of a sudden I had 3 other kids hanging out and I was watching the parents out smoking or hanging out with all the other people.. like wtf, I didn't go there to babysit.  Maybe that's how France is though? Maybe they just assume everyone is responsible for the kids well being.. I didn't spend money but im not sure how I feel about this idea quite yet.",
            "Nice",
            "GREAT job!",
            "[deleted]",
            "For being that cool guy, have a silver for your electrum collection",
            "Everything about this story is fantastic. Jim is a fukin G.",
            "This is how you became heroes to allot of young lads lol.",
            "Another gem of a story.",
            "You're a much better person than I am",
            "I'm an Eldar player, but I feel like we could be friends.",
            "Your story (and you and the kids) went exactly where I wanted it to go.",
            "Ugh fucking electrum, haven't thought about that since I first read the 5e PHB",
            "That's some expensive chicken...",
            "I haven’t been to a games day in years! Thanks for reminding me",
            "I wish my parents had foisted me off on you and your friends.",
            "I’m glad you guys were good sports about the whole thing and didn’t take it out on the kids. You need $10-20 to get anything resembling food at a convention. I’ve been to B’more Comic Con a few times so I know where you’re talking about.",
            "I work in that area of Baltimore, and “going shopping” is one of the worst excuses I can think of for them. The inner harbor has a very short, small mall, an H&M, and a gift shop. They definitely went to a bar.\n\nAlso, don’t blame you for the Hooters... it’s a very convenient location relative to the convention center.",
            "I can picture the conversation that dad had with their kid.\n\n\"Son, hopefully one day in the future you will be in my shoes having this same conversation with your own son or daughter. On that day you will understand why I'm begging you now to please not tell your mother about having lunch at Hooters.\"",
            "This is so wholesome and yet so exquisitely vengeful.\n\nBravo!",
            "Okay, aside from letting your kids play *Warhammer* of all things, these parents really need to get their heads out of their asses. If they think it's okay to just dump their kids on a random stranger at a packed convention, then they should maybe not be allowed to be parents. Just imagining how bad that could have gone?\n\n\"Oh you're leaving me alone with your kids? No questions asked? Hehehe we're gonna gave fuuun\"",
            "[deleted]",
            "Foisted 😁",
            "The only place I run aground is that there was a gaming event and the Hooters was mostly empty?!  Really?!  What kind of nerds you got in Baltimore? \n\nThe story those kids are gonna have when they get back with their friends.....",
            "How expensive are wings there? Or did they order a lot?",
            "Just curious what Jim told the EPs to let them know they would still owe you the money if they didn’t get on the bus? Did you guys have any power to collect the money short of taking it to small claims?",
            " 2/1 ratio (kid to waitress). \n\nThat's 1/1 ratio of boobs to kids.",
            "Now, this is amazing, but I do wanna say, at least the kids above like, 14, is letting a 14 year old - or at least a 16 year old - and few friends walk around a convention a super bad idea somehow?  I'm kinda worried you guys got deceived by those kids into doing almost exactly what you did in fact do - like, I've had this happen with kids who think I'm marginally cool or useful, that they'll glom onto you as a presence to show them cool stuff, even if what their parents actually told them to do was to explore the convenion THEMSELVES - \n\nThat said, 8 years old is way too young, of course, but I don't know much about this group - if there was a 16 year old walking his 8 year old sibling around the convention, that's pretty much no worries in my book, man, and if my 16 year old tried to glom onto you and then you took him and my 8 year old to Hooters for 200$ worth of wings, I ain't gonna lie, I would be PISSED.\n\nI think there's every reason to believe your version of events exactly as you wrote in, man, I just want to express that there's a solid possibility that you got manipulated by the kids into getting them good times and 200$ worth of Hooters wings - just an alternative take on things there.",
            "You wanna drop your kids on us? Fine but be prepared to pay the bill #swag 😎 well played guys well played",
            "Electrum. Heh. Someone plays D&D.",
            "Why does the title have an emoji script of awards? How old am I.... I thought there was only gold, silver and bronze?",
            "I'd have called the cops and told them about abandoned kids and asked them to call CPS.  That's outrageous.",
            "I'd have just taken them all to the nearest police station, told the police that their parents have abandoned them all, and let them all sort it out amongst themselves.",
            "So, did any of the younger kids suddenly hit puberty?",
            "Hmm then my knights charge hard while bowmen and trebuchet throws fire power",
            "A dozen kids for a full day's worth of babysitting between 2 people...Jim should have asked for more.  \n\nAnd 12 adults together couldn't come up with 500 bucks? If so, they shouldn't be doing any shopping in the first place.",
            "Okay, wtf happened? This is weird. At least you did the responsible thing and took them to Hooters.",
            "Good story aside, who in their right mind would take kids to Hooters",
            "Those kids must have been so embarrassed; thinking they willingly spent the day with the cool older gamers only to watch their parents get extorted later.",
            "  \n\nI can’t be the only one thinking “why the fuck did you take a six year old to hooters?”\n\nLike, they’re going to be soaking up all of this information that it’s totally cool to sexualise and objectify women.\n\nGiven that Games Workshops are generally very misogynistic environments (I’m a trans man, used to go, yeeeeeeeah), I’m really worried about the people these kids are gonna grow up to be."
        ]
    },
    {
        "post_id": "e5drv9",
        "author": "r4tch3t_",
        "title": "Poured water on a girl at school, teacher saw and sent me to the principal, wrote an essay and she got detention.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/e5drv9/poured_water_on_a_girl_at_school_teacher_saw_and/",
        "score": 14573,
        "num_comments": 661,
        "created_utc": 1575359414.0,
        "selftext": "Happened like 15 years ago at high school.\n\nDuring breaks at school I'd be hanging around with my mates and there was this girl, nicknamed flea because she was small and annoying. She was quite the annoyance but we largely ignored her. One day it got too much and I poured my water bottle over her. Unfortunately there was a teacher course and she saw what happened. Cue me being sent to the principals office.\n\nPrincipal was naturally rather unimpressed by my behaviour and told me to write an essay on what I'd done and why it was inappropriate indicating that I'd receive detention at the end of it. \n\nNow the MC instead of writing the one page essay requested, I wrote 3 pages, detailing the months of annoyance and abuse and how we were constantly trying to avoid her, even moving locations where we hung out. I detailed how she would jump on our backs trying to knock us off balance (causing us to fall several times), pull our hair and the pièce de résistance of the essay the dozens of times she tried to grab and kick our nuts. (I got really good at catching approaching feet with my thighs) \n\nI handed in my essay and waited for them to tell me how much detention I'd get. The principal came out of his office, said I was free to go and told the teacher to bring the girl in. She ended up getting detention, a call to her parents and she didn't bother us again.\n\nBonus story.\n\nSimilar vein. Another girl I poured drink on, this time red fizzy on white school uniform.\n\nShe was constantly stealing our hacky sack, so one day I saw her run for it as it fell. Stepped on it so she couldn't get it. She was trying to wrench it out from under my foot so I poured most of my can of red mirinda *slowly* on her back. Poured half my drink out before she ran away. Nothing came of that one. (although I figured out years later she actually liked me so screwed that one up)",
        "permalink": "/r/MaliciousCompliance/comments/e5drv9/poured_water_on_a_girl_at_school_teacher_saw_and/",
        "comments": [
            "I had a girl who had a super huge crush on me constantly stealing my backpack and moving it into the girls locker room because she had a fantasy where I would ask around and she would “find” my bag for me and I would fall in love with her. \n\nMiddle school humans are incredibly weird.",
            "This reminds me of the time I was on crutches at school. A kid tried to kick one out from under me and I turned around and whacked him with one of my crutches. He went to a teacher saying I'd hit him. The teacher asked what he'd done to me to deserve it. I was well known for being calm and putting up with crap.",
            "First two paragraphs: wow this guy is kind of a dick\n\nThird paragraph: actually yeah all those things are annoying",
            ">(although I figured out years later she actually liked me so screwed that one up)\n\nUpvote for that fuck-up.\nI hear you brother.",
            "[deleted]",
            "“...red fizzy on a white school uniform...”\n\nAustralian? I read that and was like yeeeeeep.",
            "Had a girl in high school that kept touching my ass in the lunch line. Like, it didn't feel like it was a \"I like him\" thing, it felt more like \"he is smaller than me, I am dominant\" thing (not that it matters, sexual harassment is sexual harassment, no matter the context or way it's carried out). One day after I had enough, I yelled at her to stop touching my ass, she replied with the oh so mature \"What are you? Gay?\" so I snapped back with \"No, I just don't fancy farm animals\". She got ultra red pissed off and began to yell shit at me but I just ignored it and started singing Old McDonalds Farm. Eventually half the lunch line joined in. She stormed off and had to deal with people asking her how old McDonald was doing for a couple months.\n\nShe thankfully didn't harass me again. A very small part of me sometimes feels bad but I mostly feel that she deserved it. If you can't take it, don't dish it out.",
            "Yo this reminds me of a time I got suspended for punching a guy in the face in middle school.\n\n It was right after we got off the bus and we were heading to class. A teacher saw me punch him in the face and she ran out and broke us up. Later that day we were called to the office. Our principal was a bit shocked to see that I was the perpetrator because I was a twig of a girl and this guy was fairly tall. The principal was cross with me at first until I explained that the kid had been bullying me for months, the teachers were informed and they did nothing to stop this guy from hurting me, and that I had punched him in the face right after he took my (very expensive) flute and dumped it out of its case and onto the concrete outside. \nI still got suspended because of a zero tolerance policy at my school, but the principal picked a day where we only had to attend for half of a day (to make up for snow days) so I got to sleep in and play video games all day. The other guy got a black eye and a month of after school detention.",
            "I learned much too late about what girls do when they like you. I completely sympathize with that last bit there.",
            "I didn't realize girls did the \"pulling on pigtails\" thing",
            "Moral or the story is pouring water on people makes them like you /s",
            "Sounds like you got a thing for pouring liquid on girls. Are you ok?",
            "i got in trouble in 4th grade for smacking a girls hair off my desk. we had gotten back from a field trip to a dairy and i wasn't feeling good. we were doing some pop quiz about the field trip and the girl sitting at the desk in front of me kept leaning back and covering my desk with her hair when i was trying to put my head on my desk since i didn't feel well. so i smacked her hair off my desk. she tells teacher. teacher yells at me, i tell her i am not feeling well and want to put my head on my desk but her hair is the way, teacher doesn't believe me so i have to do an extra essay as punishment. \n\nsince i couldn't put my head down i just started to feel worse and worse. i start feeling really bad and violently lurch forward... and proceed to projectile vomit straight in front me... all over the back of her head and in her hair on my desk. \n\ni have never seen someone freak out like that before or since. i felt so bad. at least the teacher let me out of that essay.",
            "Anytime I had a problem I just poured liquid on her,  BOOM! Right away, I had a different problem.",
            "I'm gonna go against the grain here. I think the real moral of this story is that the whole thing could've been stopped long before the water bottle incident had you just spoke up and told the principal about the girl physically assaulting you.",
            "Civilians in danger: Someone help! We’re being robbed!!\nOP: *cracks open a can of Coke* I got this",
            "Stop pouring drinks on people you weirdo",
            "Have you grown out of this or are you to this day pouring out your office water on to Karen from accounting's back when she gives you that annoying chat at the water cooler?",
            "> Now the MC instead of writing the one page essay requested, I wrote 3 pages, detailing the months of annoyance and abuse [...]\n\nThat's not really MC.  That's just regular C.  The principal was trying to do his/her job by seeing things from your perspective, and that was presumably one of the reasons for having you write the essay in the first place.  The process worked as it was designed to do.",
            "You both seem like dicks to me",
            "Stop pouring your drinks on people I think.",
            "You sound like a right cunt.",
            "Pro tip: if a pretty girl is constantly trying to grab your sack, she probably likes you.",
            "You didn't screw that up, why the fuck would you want to date a girl who does that to people she likes? This ain't an anime, miss me with that tsundere shit...",
            "~~Damp~~ Damn OP was a playa' in High School. He made all the girls wet.",
            "Sometimes you just gotta salt the snail",
            "Kids, don’t do this. Why bother potentially get in trouble when you can just skip to writing the essay",
            ">although I figured out years later she actually liked me so screwed that one up\n\n>She was constantly stealing our hacky sack\n\nDoes not compute. She is incapable of showing real human affection.",
            "Reminds me of one of my friends who had a crush on this girl (who later became my best friend). He would steal her hat in class every day, even right off her head. She would report it to the teacher because she got so fed up with it and made it clear how much she despised him for it. Regardless, he was absolutely convinced she liked him back for some reason.\n\nFast forward to his grad party, he thought she didnt show up because she was too shy. In reality, she still hated him for the hat thing and also now had a boyfriend. I actually saw the moment his heart stopped after telling him this. He truly thought he was gonna get asked out at that party.",
            "Thanks for using \"cue\" correctly.",
            "With the drink pour being your main weapon here you sound like an antifa member haha",
            "There was this one kid in my high school who wanted to be friends with our group, but he didn’t have any idea how to get positive attention, so he’d just act like a little shit to get our attention. One thing he liked to do was sneak up behind you and clap your ears with his palms.\n\nTo give context, this guy was like 5’3” at age 15, and he was a total coward, so he’d run away immediately after whatever douchey thing he’d done. Meanwhile, I’m a big guy, and was already 6’ tall at 15.\n\nOne winter day, he snuck up behind me and clapped my ears so hard it triggered my tinnitus. I chased him halfway across the school, losing both of my boots and my backpack in the process. I finally caught him, and rather than hit him, I pushed him over, grabbed his ankle, and proceeded to bodily drag him back the way we came, collecting my boots and bag on the way. Then, just for good measure, I dragged him up a flight of stairs and wedged him into his own locker.\n\nHe never clapped my ears again.",
            "Doesn't sound like you've grown up in the past 15 years..",
            "Fizzy? Mirinda? Kia ora my kiwi bro! I miss orange Mirinda so damn much. That stuff was brilliant.",
            "Upvoted for a perfect French spelling.",
            "I love how your go to move is pouring water on people lol",
            "You're a pretty big ass in the bonus story",
            "Still kind of a dick tho",
            "Hey bud, and to anyone else who’s had or having a similar experience...that’s the girl that’ll give you that good head. She was trying to strike your sex organs because she didn’t know how to properly ask you to place them in her mouth.\n\nYou’re welcome.",
            "And then the teacher and principal started to slow clap.",
            "So you had been sexually assaulted several times and did something to stop it. Good on you there",
            "Post this to /r/AmItheAsshole",
            "*Cue\n\n*Vein",
            "Either this was like super \"pick on you because I like you\" bullshit\n\nOr\n\nShe had some serious daddy issues (maybe abuse) and was taking it out on anyone she could (the ball kicking especially)",
            "Oof. Really effed that one up",
            "Whats a Hacky Sack?",
            "Good story about the girl getting detention but I think the girl stealing the hacky sack had a crush on one of you and tried to get your attention.",
            "Wish my stories were this cool. This chick poured water on me in middle school and when I took the water bottle and dumped it on her she hit me so I hit her with that haymaker to the face. God that felt good.\n\nEnded up switching schools because of it. Teachers and principals thought I was some kind of woman-beater-in-training even though that bitch would do shit to me all the time; gum in the hair, dead legs, sit next to me and push me up against the bus wall.",
            "As a fellow foot with thigh catcher, i salute you",
            "Honestly, I'm upvoting just because you used the word \"cue\" correctly on reddit instead of \"que\" or \"queue\"",
            "> instead of writing the one page essay requested, I wrote 3 pages\n\nCalm down Mr Hamilton",
            "I was nicknamed Flea when I was younger, too! But it was because I didn’t wear pants most of the time.",
            "In elementary school there was this girl who had this huge crush on me, it was bad.  I had zero interest in her at all.  This girl literally stalked me. What sucked was that the school staff separated her from me and she had to sit in the office until the pickup bus came at the end of each day for several weeks.  I was the one responsible to go and get her.  If I had any modicum of the brain back then, I should have left her. Now that I think about it, the staff was probably hoping I would, lol.  \n\nThen there was the time just down the street from my house she tackled me and started kissing me... In hindsight, I wish I would have decked her.    I would later learn that her mom had once been married to my uncle (she was not my uncle's child).",
            "Anyone else thinking that girl had a crush on one of the guys in the group?  Like pulling pig tails at recess...",
            "It would be way better of a nickname if it was because she slapped bass shirtless.",
            "OP has a thing for pour drinks on people they don’t like",
            "the last fucking sentence was an eye opener",
            "I wish they would do this at my sons school. We’ve had a similar issue with a girl, but add in social media. She shoved my son’s (male) friend and laughed. He (naive 13 year old goofball) pushed her back, she did an exaggerated and on purpose fall into the lockers. After that she was gone for the day, no one thought anything of it. Her mother returned to the office threatening and screaming at everyone over her daughter’s assault. The girl had called her mom, was taken to the doctor and faked concussion symptoms. They were talking about police action. The boy was questioned, video showed her push him and his response which seemed appropriate, the fall was obviously exaggerated. The boy still got multiple days of suspension and a write up for assault. \n\nThe week before that she tried to turn my son in for selling Xanax at school. I got a call from the principal where he was apologetically letting me know that they searched him and his locker publicly based on this unfounded claim. \n\nBefore that she told multiple of the other boys on my son’s football team that he is gay and he likes them. She did this while leading them on promising “things” trying to get them to turn on him. Real weird \n\nI have screen shots where she admits to making up a story about a group of boys online bullying her over the summer. They were super close to being in huge trouble based on her word. \n\nShe changed schools at the beginning of last year saying that all the kids at her previous school bullied and harassed her. I’ve been trying to figure out what she did there and have uncovered one story where she accused a boy of throwing a rock at her head giving her a concussion. Editing to add that the parents requested very specific information about the location and time knowing that they could get video. It never happened.\n\nThe school won’t confront her, won’t punish her. At this point there are several kids who will be attending a different high school because the parents don’t want their children in her path for the next 4 years.",
            "Sometimes girls do crazy stuff just to get attention.",
            "There was a girl at my highschool everyone called “The Nutcracker” or “The Tittyterror”. She basically sexually harassed everyone. Oddly she is very similar to the girl depicted here, short and annoying.\n\nShe would kick guys in the balls, pull the elastic straps on girl’s bras, twist nipples, spank people, grab crotches of both men and women, and jumped on people. \n\nEveryone hated her, but she left before we graduated, so no one knows where she ended up.",
            "What is it with you and wasting drinks, tut tut",
            "In my opinion, it does not matter if a girl likes you, she should not f@$& with your stuff.",
            "This isn't relevant to the story so much, but just reminded me of how my brother met my best mate. We still talk, they don't. When they were knee high to ducks they got into some sort of argument and my brother squeezed his juicebox on him. Instantly was told he was telling the teacher on him, so my brother poured his own juicebox over his head. When the teacher came over and asked what was going on my brother said \"He poured my juice over me, so I sprayed him back!\" and instantly got a recess detention. I don't know how this translated to them being friends? I doubt they remember as it was 27 years ago now. How time flies...",
            "Two wrongs making a right? Nah, it makes karma apparently lol",
            "So this girl literally bullied and sexually harassed you, I had similar and didn’t realize at the time, cuz she was a girl, but looking back it’s messed up to think it was written of as “girls tease you” and kinda praised by the boys, but was actually sexual abuse",
            "ESH",
            "It's hardly a punishment though, writing an essay that the teacher will thoroughly review out of regular class time. That's free education, it's why you are at school in the first place. A better punishment would be pulling you from English classes so you fall behind on your lifelong path in mastering your language.",
            "> Nicknamed flea because she was small and annoying\n\nAhaha. Also had a girl in school who was small and annoying called Lauren. Us group of friends played this game a lot on breaks where we’d try to flick each other’s coins off a table, kinda like Crokinole. We’d have preferences and argue which finger used to flick the coin was the best. From the index, middle, ring and pinky fingers. We nicknamed the pinky finger flick the Lauren flick accordingly. Over time, it just turned into just the Lauren. As such, we’d argue whether the Lauren, although had little power, boosted greater accuracy and feel over the other fingers. A teacher overheard us talking intently about Lauren and strange upsides and downsides to using it. Obviously they misunderstand and got mad, took us a while to explain our way out of that one.",
            "Sounds like bullying all around",
            "[deleted]",
            "Probably both liked you, honestly. I don't know why but youngsters tend to be dicks to the people they have unrequited feelings for. Any attention is better than none, I guess.",
            "The first chick probably liked you too,  my dude.",
            "Wait, this isn't AITA. (ESH BTW)",
            "Ah, reminds me that time I poured a drink on a friend, that ended... thinking of it, anything I did with my friends or something we never got a detention, even when deserved.",
            "Ah, the missed opportunities of youth.",
            "The nick name reminded me of mucha lucha. Hehe the fleeeeeeaaaa",
            "You're basically aqua man",
            "Never touch OP's sacks. He'll pour liquid on you",
            "What country is this? Sounds like UK, but theres the odd americanism that's throwing me off",
            "A kid 3 or 4 years younger than 11 year old me would press my buttons but I would get in trouble for \"picking on him.\" Every Sunday after church everyone would stay for potluck and all us kids would mingle and hang around until the food was ready. So one day, he's beating me and another with his elastic suspenders laughing as his aim is getting better slingshotting the buckles at my face. I see stars when he zings me on the lips and I push him away as he's drawing back for another. I don't know my own strength, it's too much, he falls backwards, cries and tells mommy. She hates me. Other mothers chide me for being cruel and question my salvation. Years later, I see him at a wedding and he's all remember when we were kids and you used to beat me up all the time? Haha yeah, those were the days.",
            "She def liked you in that second story. You messed that up.",
            "So basically, don’t annoy you when you have a drink in your hand",
            "I hope your school's administration was fired.",
            "Holy shit this freaked me out. My nickname in high school was flea, but I never got a bottle of water poured on me, not to mention I was shy and socially awkward af and would never dream of doing any of that.",
            "You could also call her epsilon. Small and depricable.",
            "Mirinda...was this middle east or Africa ? I will miss mirinda when I go back to Canada, coca cola's Fanta sucks (compare to mirinda).",
            "Do you watch RandomGaminginHD on YouTube?",
            "I guess people around you always bring a set of dry clothes",
            "Was she hot?",
            "So you are a serial drink pourer?",
            "Was stealin' the hackey sack for attention and instead got drink poured on her by her crush.\n\nDamn, thats rough.",
            "\n>(although I figured out years later she actually liked me so screwed that one up)\n\nWait. Is that a ***thing***? 'boys throw rocks at girls they lile, girls steal things from the boys they like'?",
            "I was waiting for OP to end the story with they’ve been happily married for 10 years now",
            "Yeah if a girl is bugging you that much I'd say it's a 50 50 chance she simply has a crush",
            "It’s always the small girls, I swear to god. \nDon’t think the other girl deserved that though",
            "> (although I figured out years later she actually liked me so screwed that one up) \n\nSo classic.  Humans are weird.",
            "Nothing malicious about this compliance. Just honest and just",
            "Playing with hacky sack at school is no joke. One time my classmates kept throwing one around the class. One stray hacky sack later and a friend (at the time just sitting next to me) got hit in the eye. Spent two weeks in a hospital, almost lost sight.",
            "One time a kid in my class was sitting on a one legged chair, he tried to trip me as I walked by, so I kicked the leg of his chair and he fell pretty hard. The teacher saw everything and I had to apologize. \n\nOne legged chair \n\nhttps://www.especialneeds.com/shop/special-needs-seating-positioning/bailey-height-adjustable-t-stool.html",
            "Sounds like BOTH girls liked you (or one of your friends).",
            "+marks for spelling and prose structure. I can see how a three page Essay would be convincing",
            "Salt would have also worked, get out of here Snail!",
            "We ppl have so many issues we don't know how to deal with while this dude just combats his issues by pouring drinks on them.",
            "Bet she was like ha ha when he was called away but then was wtf when she was called in! Lol wonder how the talk went of so u pull their hair, jump on them falling even, follow to do so and aim to kick them in their privates? Cue her gulping like uhh im just joking around with them? And then him going to letter of how they avoid, find her annoying and even move away from her so not friends messing with each other type relationship. Like i really wanna know how that went down cause im sure shitty excuses from her were made",
            "I don't know why parents just don't teach their daughters \"if you like him, tell him and you can be around him more potentially if he likes you back\".\n\nNah they just make kids figure this shit out. Even as an adult male it's infuriating and stupid to deal with women the same age as me. Had a few girls fuck with me during school and it got worse during high school when signals can actually be mixed signals.\n\nUgh.",
            "Red mirinda 😂😂😂",
            "Shit. Post.",
            "was bonus story girl cute though",
            "Oh, my goodness.  That alone is another story.\n\nI caught a student videorecording me teaching his class. I had been a victim of stalking (the crazy sometimes had other people record me) and I most certainly didn't want anyone recording me without my permission. Plus there are all kinds of stories of students editing videos or photos of their teachers and posting them. Cell phones had already been banned, but middle school students can be rather sly. The students objected strenuously to being recorded because I wouldn't let them record me and without administrative and parental support, that wasn't going to work.",
            "I did this once. We were at a festival and a girl in our group was a few drinks down and she had acquired a whistle. Well you can guess what she did for the next hour.\n\nAnyway it got to the point of the night where the whistle became too much. So I asked her to put it away. \n\nAnyway she came up and blew it as hard as she could in my face. She then continued for another 10 or so minutes just constantly being a pain with the whistle and making comments to me about her new toy.\n\nI then said if you don’t put the whistle away I’ll empty this can of beer on the top of your head. To which she replied do your worst and blew the whistle in my face again.\n\nWell...I proceeded to empty the can of beer on the top of her head. Which ended up in her crying and me and everyone else in the group being like “well he did warn you. And we have all asked for you to put it away”",
            "\\> She was constantly stealing our hacky sack\n\nThat was a very young, immature girl's way of flirting with you.  I'm guessing junior high / high school age.",
            "I was a very good child and a good student.  I just had a creep for a teacher."
        ]
    },
    {
        "post_id": "mie513",
        "author": "StareyedInLA",
        "title": "Tell my mom to speak English? Okay!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mie513/tell_my_mom_to_speak_english_okay/",
        "score": 14570,
        "num_comments": 710,
        "created_utc": 1617343084.0,
        "selftext": "This is a story that was recently brought up again by my mom when she was recounting some really shitty racism she encountered when she first came to the United States.  I've heard this story a few times before but didn't think to share it anywhere else.  That is until I was made aware of this subreddit.  Enjoy.\n\nIt was the late 1980s in Los Angeles, California.  By this time my mom, a Japanese immigrant, had been living in the United States for ten years.  Although she could speak English well, she wasn’t fluent and preferred to speak Japanese with others from the local Japanese-American community.\n\nOne day, she and a friend were waiting to be seated at a restaurant on Beverly Boulevard.  As they chattered away in Japanese, a large shadow cast down upon them.  Looking up, they found Karen’s 1989 counterpart leering down at them.  \n\nMom couldn’t remember how the woman looked except for the look of pure contempt trying to work its way across facial muscles frozen by Botox.  \n\n“You two,” Karen barked, “this is America!  Speak English.”\n\nStartled, my mom and her friend made eye contact, unsure of what to do.  Encounters like this were, sadly, ones they had run into many times since they came to live in the USA.  They were not ones for confrontation.  Before, they couldn’t do anything while their bullies marched off, unpunished.  But then, as they made eye contact, a brilliant thing happened.\n\nMom likened the moment to their thought processes coming in sync together.  They had a shared idea that didn’t need any further elaboration or explanation.\n\n“Masami, my dear, I do think the waiter ought to have shown up to escort us to our table by now,” Mom chimed in the poshest British accent she could muster.  “It’s frightfully rude to keep us waiting like this!”\n\n“Yes, darling,” her friend replied, invoking her best impersonation of the Princess of Wales, “it is frightfully rude indeed!”  \n\nAs they continued to twitter away in their fake English accents, Karen began to slowly back away.  Her Botox face reddened and twisted itself in a visage as hideous as the Furies.  Realizing that she had just been outsmarted by two young women obsessed with British culture and celebrity, all she could do was storm off down Beverly Boulevard a defeated bully.\n\nWhile there was no direct punishment, it was a story that my mom would continue to retell thirty years later.  It has always made me chuckle to myself, and I hope you enjoyed it too.\n\nEdit: So there was a massive error on my part.  What I thought was Botox paralyzing Karen 1989's facial muscles would have most likely been a botched face lift.  For some reason, when I first heard my mom's story, I just immediately thought her face was that way due to a bad Botox injection.  \n\nAnd holy shit this post blew up. I thought this was going to get buried.  Thank you everyone for your comments and awards.  But seriously, if you have money to burn please use your funds for a worthy cause.  This edit is coming in too late, but in the future even a small donation to organisations working to stop Asian hate crimes goes a long way.  Thank you.",
        "permalink": "/r/MaliciousCompliance/comments/mie513/tell_my_mom_to_speak_english_okay/",
        "comments": [
            "The great tactic of just weirding your bullies out.",
            "> “You two,” Karen barked, “this is America!  Speak English.”\n\n\"So, as I was saying, that bitch in the red shirt? Can you believe she thinks she's thin enough to wear a shirt like that? And that hair color? Remind me to stay away from whatever brand she's using.\"",
            "I like the irony your mother slapped in Karen’s face: English is not American.",
            "[deleted]",
            "Speak English!!! In a place called “ Los Angeles “.",
            "I have groups of friends who speak Spanish and groups of friends who speak Arabic. I sometimes remind them when they are conversing in their first languages, \"Guys, this is America: speak Navajo!\"",
            "After thirty years, the story still holds up! If it was the 80s, she must've been an obatarian. ;-p\n\nThe sad thing is that these idiots are the same ones who don't bother to learn even the most basic phrases if/when they travel. ...while also complaining when the natives/residents don't speak English. SMH",
            "Language stories are always my favorites. They always have such cathartic ends.",
            "America: the stolen land where literally everyone is an immigrant but they get mad when you’re not the right type of immigrant",
            "[relevant xkcd](https://xkcd.com/84/)\n\n(There's *always* a relevant xkcd)",
            "I'm a Scottish person, I have had Americans try to correct my English to American English, so I replied to them in a Glaswegian accent and they accused me of inventing a new language.  Their exact words were \"That's not a real language.\"  I said \"Glaswegians have been speaking English longer than you, pal.\" in a Glaswegian accent.",
            "Maybe it's the troll in me, bit I would have busted out the loudest \"'Ello Govn-uh!!!!\" Cockney English accent.",
            "Great story!\n\nMy daughter goes to a Japanese immersion school (she’s Canadian). She can effortlessly switch between English and japanese right now. So cool to watch. She just uses whichever language she wants without any work.  Wish I could do it half as easily. Kids’ minds are amazing.\n\nEveryone should have the benefit of a second language.",
            "I never understand people who yell at others to speak English. Why? So you can eavesdrop on their conversation? They aren’t talking to you. Mind your business.",
            "Botox in 1989?",
            "I've heard of people replying in Navajo or other indiginous languages that since it's their land, they should speak their language.",
            "That is the magic with accents, you can say what you want and it may come out distorted not as you want it, but if you impersonate another it comes out fine.",
            "I always believed diversity is what makes America what it is! The whole world lives here. \n\nYour mom sounds hilarious.",
            "I have always had the attitude that in America, we have freedom of speech, and no official language. Therefore, we can tell Karen what to do with herself in whatever language we choose.",
            "hahahah please tell your Mum, this Canadian thinks she is AWESOME!!!!!!!!",
            "I will never understand people who care which language other people use to communicate with each other",
            "My wife and I will speak to each other in Japanese (I'm a white guy, by the way, she's Japanese) someone said that to us once. I just looked at the (older)guy and asked if he was having a stroke or something because we were speaking English, and then carried on in Japanese as if nothing had happened....He looked very confused.",
            "Always amuses me when I hear these stories as my country has many official languages, plus many others are spoken that are not official. Nobody would dream of just randomly telling someone to speak English...",
            "I would love to hear a story about Karen demanding that others speak English, only for them to respond,  \n\n\"This is Dinétah! Speak Navajo!\"",
            "India is kinda similar that way tbh. Only half the country speaks a common language. The rest of us speak a bunch of different languages based on our region.\n\nYou get kinda used to people telling you to learn their language. Just shrug it off and walk away.",
            "That is the best comeback to that form of bullying I’ve ever heard. As an American who’s read far too much English lit, tell her tinker-tonk and good show from me.",
            "Ah yes. America. The most racialy and culturally diverse country in the world.\n\nAlso America: you're speaking a language that is not english? Get the fuck out.\n\n&#x200B;\n\nAre you ok in there? Do you need help? Blink twice if you're being brainwashed into racism.",
            "It infuriates me when I hear such linguistic xenophobia. I actually enjoy hearing other languages spoken. I also enjoy hearing other accents. To me, it adds a bit of spice to life. I am an anglophone who wants to improve my Spanish skills and I enjoy practicing it with waiters and other customer service people. Sometimes I get dirty looks from xenophobic customers when I do. Pisses me off. I despise bigotry in all of its ugly forms.",
            "Stories like these always piss me off cuz 1) ignorance and racism and 2) THE USA DOESN'T HAVE AN OFFICIAL FUCKING LANGUAGE.\n\nI want to make a t shirt that says \"This is America! We speak *Swahili, Arabic, Spanish, German, Japanese* and just list a shit ton of languages.",
            "> Mom likened the moment to their thought processes coming in sync together.\n\nI just love those moments, all teh sweeter for being so rare. THough we did get good at it at University with a particular friend, got her to the stage where she really couldn't tell when we were being serious and when we were winding her up. Fortunately, she took it all in very good spirit.\n\nI think I rather like your Mom, and Masami, too!",
            "Perfect reply:  In Perfect English:  So sorry that your eavesdropping on another persons conversation wasn't understood by you.",
            "if i ever encounter someone like this i have a perfect response ready  \nno bitch this is america! you speak miwok you colonial shit!",
            "Brilliant!",
            "Stories like this make me realize that I probably couldn't make it in a non-Englinsh speaking country... Doesn't matter what I do, I cannot for the life of me comprehend speaking other languages. I can read and understand bits and pieces of a few different languages, but I'll be damned if I could respond!",
            "I was having dinner with two women from Columbia. Each spoke 3 languages including their own. Some fat ass yelled at them to \"speak English\" to which they responded by shifting to French. Then to English. Then one said to the other woman, \"isn't it sad he only knows how to speak one language. Uneducated..\"",
            "Next time Cajun English for another one!",
            "An 80s Karen. I just imagine her having slicked back blonde hair and inexplicably glitching when she speaks.",
            "I would have responded [like this.](https://www.youtube.com/watch?v=YfzTcyIDHqg)",
            "I'm not from the US and even I know English isn't the USA official language. There are actually no official language in the US",
            "Your mom is diamonds.",
            "This warms my little British heart",
            "\"This Is America!  Speak Lakotah or go back where you came from!\"",
            "🤣🤣 something similar like this happened to one of my deaf friends when we were hanging out at a mall. \nWe were chatting away (using ASL, obviously) and a woman looked at my friend not so nicely asking her to \"not make gang signs and laugh\" my friend, confused, looked at me and I repeated what was said in sign, I got the same demanding question. \n\nI then proceeded to take five seconds to explain to the woman my friend was deaf, and we were using ASL. I tell you, I just about died laughing when she said \"I thought deaf people were made up. Like vaccines.\" \nNot only this lady was an abelist (I told my friend about it, she was laughing too), lady was an antivaxer as well. 🤣",
            "[removed]",
            "Pip Pip!",
            "Your Mom and her friend are badass!",
            "One of my coworkers who is a native english speaker but also speaks hmong because her parents were Laotian refugees recounted a story of a similar encounter. She retorted with \"I don't have to, I know hmong\" and went back to her conversation, basically telling the guy that being obligate monolingual isn't a point of pride.",
            "Masami. My best friend is married to Masumi 🙂\nGreat story btw.",
            "She did not specify American or Queens English. Haha.",
            "This story inspires me to begin teaching courses for immigrants to speak like pirates.",
            "Can confirm. This was largely my strategy growing up.\n\n\nWarning: weirdness can become a way of life",
            "This is America so you better speak native American. Not english. Also America doesn't have a official language still so get fucked",
            "After all this time, people still act like that... There is no official language in the USA... I'd speak Spanish or something else, just to piss them off... What a shame",
            "Botox was invented in 2002. She was not botoxed in 1989 lol",
            "**Why helloooooooooo!!!**\n\nMoms goin’ Mary Poppins on Karen’s ass!!!",
            "\"This is America, speak English\" always makes me smile. I bet there are plenty of Americans who really hate having to say that.",
            "How long has botox been around?",
            "Tell me this is real",
            "Same woman that, if in another country, would EXPECT them to speak English to her.",
            "They also could have replied: \"You're in Los Angeles. Speak Tongva.\"",
            "Yeah my ancestors from Germany were treated the same way. Get this...by people who looked just like them but spoke a different language. Weird.",
            "Speak American in America.. ok what’s your language my dear, ‘British  English‘?? \n\nHang on!!",
            "No amount of surgery can fix a face twisted by hatred",
            "[deleted]",
            "That is AWESOME!\n\nIt is sooo stupid when people say that!  No matter where you are in the world, if you are with “your peeps” you are naturally going to speak your love language.  And it’s more than just fluency.\n\nAfter six years of studying Spanish, I got to the point where I no longer had to do Spanish to English conversions in my head. My thoughts were in Spanish.  My instructor said “That’s when you know you’re fluent”.\n\nI say love language because some cultures are naturally bi-lingual.  This one woman was saying that she thought and spoke in both languages equally each day.  But this one question stuck with me “What language do you and your husband argue in?  THAT’S your love language.”  \n\nUnless I am attempting language immersion, if I am visiting Africa, France, Taiwan, Sweden, etc., with someone or a group who speaks the same language ... naturally we are going to speak it.  \n\nSo why some Americans are so freaking high and mighty to say this when someone is not speaking English is BEYOND OBNOXIOUS.  \n\nI live on the Canadian border, about 90 minutes from Quebec.  So we have (had, I should say prior to COVID) a lot of French Canadians shopping state-side.  Years back, I heard this uttered a few times to someone speaking in French.  If I heard it nowadays said to ANYONE, I would not be silent. \n\nWe also have a growing Hispanic population (mainly undocumented) due to so many large farms roundabout.  I have acquaintances in the loop who used to give them rides and do their shopping when our border patrol presence was very strong with checkpoints set up randomly.  But now, things have eased, and many have started to do their own shopping.  \n\nMost of the guys are identifiable by their dress and farm odor, and I feel oddly protective.  Somehow I end up shopping when they do.  I am legit waiting for some jerk in the store to step out of line and say something just so I can tell them off.",
            "[removed]",
            "Funny thing is, nowadays, even if there was no foreign language incident and the women in question were upper class British ladies speaking in their natural accent, Karen would still get pissed off over the accents and yell something along the lines of \"We're in America, speak American! No one here can understand you!\" \n\nMan, things in North America have gotten a hell of a lot worse for the \"wrong\" people in the last 30 years...",
            "That reminds me of the beginning of 'Crazy Rich Asians' where the young Chinese mother arrived in London with her children ahead of her husband in a pouring rainstorm, after a lengthy, exhausting trip. They finally arrive at their hotel only for their registration to mysteriously disappear when the manager sees that they are Asian. He wouldn't even let the children wait in the lobby while she went out in the rain to make a call (of course she wasn't allowed to use the house phone). Five minutes later they're back at the hotel and the manager starts to throw them out when the owner comes downstairs and welcomes them with open arms. The manager tries to subtly inquire as to how much ass kissing will be required to fix his racist error, and is informed that as of a few minutes ago the hotel has a new owner: the Chinese woman he's been treating so terribly. The manager looks at her, and she smiles. \n\nYour mom's story is better, because it's real, but the story from the CRA book/movie is one of my all-time favorite 'racist bastard gets what's coming to him' stories. She bought a hotel on impulse, like it was a candy bar, because the manager was a racist dick, and now she's his boss. It's beautiful.",
            "On behalf of the vast majority of the US population, sincere apologies to your mom and her friend.  \n\nIt may come of interest to some, but there is no official US language.  We have borrowed from a European nation something named for that nation.  It’s not official. \n\nIronically, most all the immigrants entering from Central and South America speak another language from a European country.  No, not named for the nation they desperate seek to escape.",
            "[deleted]",
            "Nice idea. If you are told to speak english just do the most ridiculously incomprehensible accent possible. Tell them you're from Karenia, Wales or something and this is in fact english lol",
            "Your mom and her friend are bad asses!! Please give her a big hug.",
            "Fun fact: we don't actually have an official language in the USA. I can hear it now: I'd LOVE to learn your official language, but YOU have to actually PICK one.",
            "Botox didn't even come out until after 2000.",
            "This is beautiful",
            "Japanese moms ❤️",
            "Hey settle down ok",
            "\"Karen's 1989 counterpart\" - still a Karen tbh"
        ]
    },
    {
        "post_id": "5yz6l4",
        "author": "Youse_a_choosername",
        "title": "Sir, may I see your authority to enter?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/5yz6l4/sir_may_i_see_your_authority_to_enter/",
        "score": 14545,
        "num_comments": 501,
        "created_utc": 1489332743.0,
        "selftext": "Many years ago I had succumbed to a patriotic fever and enlisted in the Air National Guard. As such I went to basic training. Yes, it's the same basic training the \"Real Air Force\" goes to. Anyway... \n\nOne of the first bits of training they try to hammer into your skull is the importance of the Dorm Guard (DG). DG is responsible for controlling who has access to the dormitories, reporting headcount to nightwatch, and making sure nobody is slitting their wrists in the shitter or starting fires. It is a very easy job but trainees regularly fuck it up because they can't think straight in a military training environment. \nIf someone knocks on the door the DG has to verify their ID against a list on the back of the door. No ID? No entry. If ID is presented but there is no matching name on the list? No entry. There are only two exceptions. If the person requesting entry has a key and uses the key in the lock (because holding it up to the window to show you are a key holder isn't good enough. Yes, one trainee learned this the hard way.) Or the person requesting entry can use a known code word, but this will only happen in an actual emergency and isn't part of the training experience. To quote my MTL (Military Training Leader) \"If Osama bin Laden shows up to the door armed with an RPG and wrapped head to toe in dynamite and he gives you the code word, let the fucker in and stay out of his way.\" \n\nEveryone will do DG duty and you should expect to be tested. They will yell and threaten, try to trick you, intimate you and beat on the door mercilessly, but the protocol is gospel. Break from the rules and you'll find yourself writing letters to the families of your fellow trainees, explaining that they were killed because you couldn't remember how to guard a fucking door. (Looking at you, Trainee \"Oh I see you have a key, let me open the door for you\"). \nBasic is a headgame. They aren't allowed to physically touch you so you are never in any actual danger. All danger is simulated by big bald Sargents yelling. I had the advantage of being almost 10 years older than the average trainee (I celebrated my 28th birthday during BMT.) I've been yelled at before. It doesn't bother me.\n\nIt's the middle of the night and I'm on duty. I do a head count. 51 people present, 50 people assigned. This means either I miscounted, or someone is here that isn't assigned to be here, not to mention whoever did the count before me has been fucking it up. I recount, 51/50, and call it in to the MTL on duty (not our regular MTL) via the loud ass squawk box intercom on the wall which everyone in the dorm can hear. \n\nMe: Sir, trainee Youse reports as ordered. Blah blah blah other shit I had to report... Headcount, 50 assigned, 51 accounted for. \n\nMTL: \"WHAT WAS THAT HEADCOUNT AGAIN?\" \n\nME: Sir, 50 assigned, 51 accounted for. \n\nMTL: WRONG. COUNT THEM AGAIN. \n\nNow I've already checked and double checked and I have already assumed that this was a paperwork error and not my error but they want me to follow orders and procedures so that is what I will do. I recount and report.\n\n\"Sir, 50 assigned, 51 accounted for. \"\n\nSO HELP ME TRAINEE IF I HAVE TO COME UP THERE BECAUSE YOU CAN'T COUNT I WILL CHOKE YOU TO DEATH WITH YOUR REFLECTIVE BELT AND BURY YOU IN THE PARADE GROUND WITH THE FLAGPOLE UP YOUR ASS. NOW GET EVERYBODY UP. SOUND OFF ONE BY ONE SO I CAN FUCKING HEAR IT. \n\nBy now almost everyone is awake anyway so everyone begins to sound off. \n\n\"One sir, Two sir, Three sir..... Fourty nine sir, Fifty sir... Cut to the last guy, shaking his head because he's scared of what he knows is coming next... Fifty one sir. \"\n\nGODAMNIT! ONEOFYOUUSELESSFUCKSISGOINGTODIETONIGHT! I'M FUCKING COMING UP THERE! \n\nThe dorm is a 2 minute walk from CQ. He was there in about 9 seconds banging on the door. But, being as mad as he was, he stormed over without his key, his ID, and had apparently forgotten the fact that there was a single word that would open the door instantly. He was focused on fixing whatever was jacked up with my headcount. \n\nBanging on the door. OPEN UP! \n\n\"Sir, may I see your authority to enter? \"\n\nI JUST GOT OFF THE COM WITH YOU LET ME THE FUCK IN!\n\n\"Sir, without valid ID I am forced to refer you to CQ for authorization.\" \n\nARE YOU FUCKING SHITTING ME? I AM THE CQ! CUT YOUR SHIT AND OPEN THE FUCKING DOOR! \n\n\"Sir, without valid ID I cannot allow you access to the dorm. Please contact CQ for authorization. \"\n\nBy now the other trainees are nervous, and some are telling me to open the door while others are insisting I keep it shut, perhaps indefinitely because the Sgt. sounds like he may actually end someone's life tonight. I stick to the program and we go back and forth like this a few more times. I've honestly never had anyone this angry with me in my life, but all my replies are literally written on the back of the door so I keep reading them to him, which only makes him madder and madder each time. By now it's been 20 minutes since first count and he's used up every threat and insult at his disposal and is forced to stop and think. He remembers the code word. \n\nCODE WORD\n\nI opened the door immediately. He bolts passed me with only the slightest pause for some direct eye contact which sent the message that he would be back shortly to harvest my flesh for a new suit he was going to make, and he begins to count. \n\n51\n\nWHO OF YOU IS NOT SUPPOSED TO BE HERE? \n\nSilence. \n\nThen from the last bunk \"Umm, sir?\" \nIt's a guy we don't recognize. All our counting thus far took place in the dark. Until the Sgt was in the room and he turned the lights on we had no idea. It turns out this kid had graduated the day before but needed to be warehoused for a few weeks while he waited for his next training assignment to begin. He was supposed to be there, but since he wasn't on our roster, he was not included in the headcount. Promises of extreme punishment were issued and we were told that this wasn't over and that the morning would be terrible for all of us, especially me. \n\nAt 0530 I was called on the carpet to explain why I refused to allow the Sgt to perform his duties. I stated plainly and simply that there were protocols and procedures in place for me to follow. I had been told never to deviate and that I would be tested. I had performed my duties to the best of my abilities. They could find no fault with this and I was never punished. \nMy MTL (not the one from night watch) later quietly congratulated me for sticking to the protocol. Ultimately it reflected well on both of us. \n\nTl;Dr: Fix your attention span and learn to read a page or two of text. This post may or may not be worth it but someday one will be.",
        "permalink": "/r/MaliciousCompliance/comments/5yz6l4/sir_may_i_see_your_authority_to_enter/",
        "comments": [
            "Thoroughly enjoyed, thank you.",
            "I went through in 2000.  This was definitely a ridiculous game.  Thing is, they would totally try their hardest to get you to break the script and open the door.  I wonder if they still do this there?\n\nI switched to Army and had to go through their bootcamp at Jackson.  There wasn't any game like this...",
            ">intimate you\n\nIt's probable that you meant to say \"intimidate\" but maybe your experience of basic was different from my brother's.",
            "Ah, the feeling when you know you are 100% in the right and untouchable",
            "I clearly remember the \"Authority to Enter\".\n\nI also remember being refused entry (appropriately), keying in, writing my name on the board of \"Authorized\" stepping back outside the door, and then being allowed in.  \n\nThere's a lot of \"surface Whacky\" shit in the military, that's fun to mess with and will be criticized soundly by those that have no fucking clue, but is there in all it's wackiness to teach much deeper habits, responsibility, attention to detail.",
            "Guy I was with pulled main gate guard duty. Come morning, at 05H50 the RSM drives up to the gate. He stops and this guy marches over with rifle, and calmly asks for ID. This was the morning the RSM had left his Military ID at home, and after 5 minutes of yelling , and having a rifle levelled at him, he reversed, and drove back ( at a speed that might or might not have been considered as inappropriate for formula 1 vehicles)to his house to collect it. \n\nHe arrived back at 07H10, with an entire platoon of the rest of us waiting in front of his locked office looking at him at parade rest. Sweet FA he could do, though the guy never again pulled gate duty, instead he was assigned the coldest furtherest posts instead for his next duty a month later.\n\nwhat probably Peed off the RSM was the stream of cars driving in through the other gate, with a guard letting them through without question, but that gate had no road to the RSM's preferred parking area without going all the way around the base, and through another 2 security points that only opened after 07H00 in any case.",
            "Haha I had two similar events in Army basic. Not quite as funny as yours though.\n\nOnce, while we were still in reception waiting to go to basic we had a guy fall into our formation by mistake. So obviously when we went to count off... We were +1.\n\nWe must have counted off a dozen times, the guy refusing to admit his mistake (we didn't really know each other at that time), the drill sergeant getting madder and madder... Many pushups were had before that goober admitted his fuckup.\n\nThe second time, while we were actually in basic, some guy went to sleep after his assigned fire guard shift (like your door guard) in the wrong bunk for whatever stupid reason. One or two fire guard shifts later, someone realized that his bunk was empty and reported a soldier missing. \n\nInitially the drill sergeants were in a rage at the fireguard because they thought fire guard had let a soldier go AWOL, and then they were in a rage at the guy who wasn't in his assigned bunk. It was not a good night for that kid... But he was the platoon fuckup anyways, he had lots of bad times in basic.\n\nMoral of the story... Drill sergeants HATE it when they think they've misplaced a soldier.",
            "I was on submarines during the 80s and each boat had an access control list while in port.  If youre on the list you get on , if not you are barred , if you challenge it hard enough - terminal force is authorized.  I was on Tridents the last half of my time in.   My boat was new and our Captain was original nuclear navy. He had been XO of the Nautilus SSN-571 when it was in service.  He had turned down Commodore to be in command of the submarine.  \n\nOne of his buddies was Admiral Hyman Rickover - the father of naval nuclear power.  This was about a year before he died.  85-ish(he was 85 too).  He was invited to come down for a test ride on what was at the time the most powerful weapon of destruction on the face of the planet.  1296 Megatons of nuclear destructive capability. \n\nThe list of things to do or not do was like a rock stars list.  Do not address the Admiral even if spoken to.  White grapes peeled in the wardroom and all times.  A one page list of protocol for the old man.  Food, temperature, music.  the whole thing. \n\nSo anyways he and his staff came down (even retired he had a staff) Along with people from squadron.  And he just walks down the plank on board and starts to go down the hatch before topside watch can get there.  The topside pulls his shotgun racks it and points it right at his head in the hatch.   His staff goes crazy.  The watch hits the alarm and orders him out of the hatch.   \n\nYou would think the Father of Naval Nuclear Power would be on every single access list for every nuclear powered vessel in the US Navy.  \n\nBut he wasnt.   \n\nThe watch was dressed down for pointing a shotgun at what was considered to most powerful and feared person in the pentagon.   \n\nBut the old man,  sincerely apologized for violating a protocol he developed and was escorted down.    It was kind sad as you watched this 85 year old man sitting there.  Enjoying what would be his last ride on something he was responsible for.  He died a few months later.  And there stories passed since almost anyone in naval nuclear power had at some point been the target of his wrath.   He wasnt a bad person but knew first hand the cost of failure having lost 2 submarines in the 60s.  And perfect was the only standard in his life. ",
            "CQ KNOWS ONE SIMPLE WORD TO GET IN! Dorm guards hate him!",
            "Ha ha, nice one.\n\nMy Dad told me a similar story from Vietnam. Forgive me I don't know all the military terms, but I've been told the story a million times. He was a lowly technician, not a combat role, and one of his jobs when was within cooee of the front was guard duty.\n\nHe said one time he was one duty and a patrol came in, so he called out the code word, and because they were battle hardened tough and rough warriors they ignored the kid on guard duty calling out the code. So my Dad called it out again, and they ignored him again. These people were obviously Aussie soldiers, but rules are rules and at this point he's ordered to start shooting at these men.\n\nHe didn't shoot at them, but he did storm up to the patrol, go straight to the boss and start shouting at him \"What the bloody hell do you think you're doing?! I was about to SHOOT you! Why didn't you call the code word? You stupid bastard!\"\n\nAnd the officer he was yelling at started yelling back at him, and an argument was breaking out, when an even higher officer came up to find out what was going on. The other bloke started talking, but my Dad, probably only 21 at the time, cut him off and was all like \"I'll tell you what's up! I nearly shot this idiot right here because he didn't say the code word. It's YOUR job to train these people, if YOU can't do your job someone's going to DIE!\"\n\nAnd the senior officer turned to the patrolling officer and said \"He's right you know. You have to say the code words.\" And my Dad yelled \"Too bloody right I'm right. Next time, I'm just going to SHOOT you.\" and he stormed off.\n\nAnyway, he says it wasn't until about 5 minutes later, when he was walking away, that he realised he just totally yelled at two officers and threatened to shoot one of them. Nothing ever came of it, but he was shitting himself.",
            "[deleted]",
            "I went through Air Force basic a while ago, we called it Entry Controller (EC) or Fire Guard. We had an MTI (Military Training Instructor, MTL's were in tech school when I went through) come up through the back door super quiet while one kid was on EC duty. The MTI snuck around the dorm making noise and then hiding so the EC couldn't find him. He brought a red pen and drew a line across certain trainees necks to show that they were dead.\n\nThere was another time when my EC battle buddy and I decided to take turns napping, because fuck sleeping for two hours waking up for an hour or 2 and sleeping for another hour or two. He took first nap shift, everything was uneventful. When I slept it was close to 3:30 am and I lay down on the bench in the shower. About 5 or 10 minutes later the latrine door was booted open, I have no idea how I moved so quickly but I was up, uniform perfect, flashlight on and fake weapon shouldered in less then a second. Our main MTI turns and sees me, looks for a second or two then asks me what the fuck I was doing in the latrine. I didn't know what to say because my brain was still asleep, but I managed to reply, \"The latrine is secure sir.\" He stared for another second then said, \"Carry on Trainee Slixem...\" and I sped out of the bathroom. I find my EC battle buddy and ask him why he didn't warn me that our MTI was here and his answer was, \"I was ruffling the papers really loud, you should have heard.\"",
            "You write well, and this was fun to read.  If you have any similar stories, please consider posting them!",
            "Upvote for the tl;dr",
            "> Tl;Dr: Fix your attention span and learn to read a page or two of text. This post may or may not be worth it but someday one will be.\n\nWell, since you were nice enough to use paragraph breaks and appropriate punctuation, I guess I'll make an exception just this once.",
            "\"One white middle finger, checking. One white middle finger, no\". \n  \nThose were the days. ",
            "> The dorm is a 2 minute walk from CQ. He was there in about 9 seconds banging on the door.\n\nUnderrated line of a fantastic post ",
            "As somebody who was never in the military, and doesn't ever want to, and doesn't have much interest in military books/movies/fiction, I have to say that I loved this.",
            "As a veteran I just want to say 1)The military is may be the only place where malicious compliance may actually get you a promotion, if not a medal. And 2) I went to boot camp at 17. I can't imagine how hilarious it word have been with 10 years life experience and the knowledge that boot was all a head game would have made it. Might have even been enjoyable!\n",
            "> DG is responsible for controlling who has access to the dormitories, reporting headcount to nightwatch, and making sure nobody is slitting their wrists in the shitter or starting fires.\n\nSo you were this guy? \n\n>  Sir, it is the private's duty to inform the senior drill instructor that Private Pyle has a full magazine that is locked and loaded, Sir!",
            "[deleted]",
            "More like \"well intentioned compliance\" because you knew you and the MTL could get in trouble for violating protocol. ",
            "[deleted]",
            "I got my ass kicked once for doing this.  At the start of our FTX I was assigned to guard the gate (vehicle and pedestrian) that led to our \"FOB.\"  I stopped all of the drill sergeants and asked for ID.  All of them except one had their IDs out and were showing them before I even opened my mouth, but one of them copped an attitude.  I was asking myself whether this was the right thing to do -- we'd never been explicitly told that screening people for proper ID was part of the \"game\" -- when I heard the guy behind me rack his .50.  It's amazing how that one sound can say so much: I've got your back buddy, you're doing the right thing, and P.S. whoever is trying to get in, you'd better fucking do as he says.\n\nTo be clear, we were not issued any live ammunition and we didn't even have any blanks for the .50 cal.  I'm not even sure such things are made.  I knew this, the gunner knew this, and the DS knew it.  Everyone knew it, but somehow it was still enough to get him to fish out his ID.  We let him in and I thought that was the last of it.\n\nToward the end of the week, my platoon was OPFOR and another platoon was sent to search our \"village\" (MOUT training site) for an insurgent.  We'd done the searching before and knew how it was supposed to go: they would come in, form a security perimeter, move tactically, ask us predetermined questions, etc. etc.  We were all given roles and were supposed to ask for different things like MREs, money, and some other stuff I don't remember that they weren't allowed to give us because of Geneva Conventions or something.  Anyway, these guys roll in and just start beating the shit out of everyone.  They're in full battle rattle (bulletproof vests with plates, helmets, and a rifle) and we're just in the cloth BDUs with no weapons so there was no contest.  I personally got shoved facefirst in the dirt, had gravel shoved into my mouth, and got kicked in the gut.  They weren't fucking around.\n\nOur DS rolled up about two minutes into this ass kicking, waved his hands to turn us from hadji into CIA Special Agents, and instructed us to arrest everyone in the platoon for war crimes.  Afterward he pulled us aside and said he had no idea they were going to do that and they were going to get smoked for it, but also take this as a lesson on how not to treat people when we deploy.\n\nAnyway, I found out later that the other guys had been specifically instructed to \"rough us up a bit\" by their DS, who was the one who got mad when I asked for his ID.  I have no idea what happened to him or his platoon, but I didn't see him around from then until we graduated a week later.\n\nIt was worth it.",
            "> Tl;Dr: Fix your attention span and learn to read a page or two of text. This post may or may not be worth it but someday one will be.\n\nEpic story, but don't listen to him, kids. I'm about to turn 40 and haven't had to pay attention a single day in my life. So today's moral is: Don't join the military! ",
            "Ahh DG duties. We used to get Mickey mouse IDs and the stupid shits let them in.",
            "TL;DR: Just to piggyback off of what Top said, I'd like to reiterate...",
            "Pfft, Guardsmen. Says MTL when he meant MTI and doesn't bother explaining what CQ means. Lazy. /s\n\nObviously kidding. I'm Guard, too but did 4 years active. Hearing the MTIs get creative for the guys on EC duty was some of the best moments of BMT.",
            ">Tl;Dr: Fix your attention span and learn to read a page or two of text. \n\nthis guy right here",
            "I like your story and I like your tl;dr even more.",
            "This is fucking glorious. Take my upvote you bastard!",
            "Had the same thing happen in the verbal abuse to get inside vein. Only difference is he was drunk as shit and there was no emergency, just his required checks as CQ. Never did let him in since he never used the password.",
            "\"The dorm is a 2 minute walk from CQ. He was there in about 9 seconds banging on the door. But, being as mad as he was, he stormed over without his key, his ID, and had apparently forgotten the fact that there was a single word that would open the door instantly. He was focused on fixing whatever was jacked up with my headcount.\"\n\nI smiled wide after reading this because I knew exactly what was coming. Good on you sir! Great read. ",
            ">dormitory \n\nFucking Air Force",
            "I'll be honest, having gone through USAF BMT as well. I laughed really hard. You can see your life ending, but you stuck to it. I'm proud of you.",
            "I worked as a delivery driver for a bit, and got a bit of an eyeful at just how *bad* most people are at security. Thanks for keeping shit secure.",
            "The TL;DR was very on point. This was a good reason to read 1000+ words.",
            "[Reminds me of these stories](http://everything2.com/title/Two+stories+of+the+pistol)\n\n\n",
            "Seeing all these comments and all I see is [removed] where the story used to be.",
            "OPEN THIS GODDAMN DOOR OR I WILL RIP OPEN AND SHIT DOWN YOUR NECK FOR YOUR INOBEDIANCE YOU LITTLE WORMFUCKER!\n\n\"Sir, may I see your authority to enter?\" \n\n\n\n\n\n\nMust have felt so good. ",
            "That TL:DR is exactly the type of shit I have to say whenever someone complains cause I've *literally* made a 4-5 sentence comment. I like to be concise with what I say, but I feel like that doesn't really matter as **its 1 fucking paragraph**! I've made comments on YouTube to find the typical \"Dude, bro, hahaha, you spent all that time typing that out?? Lmao I ain't readin that shit\" **whenever it wasn't even directed to them or anyone specific**. \n\n\nIt's fucking ridiculous. It makes me wonder if people like this *always* existed and the internet just allows these people to be seen, or if there's more fucking idiots today..",
            "Awesome job. I went to Navy bootcamp (also had my 28th birthday there). We had a rover and Petty officer of the watch (POOW). One night while on watch an RDC from another division came in, grabbed the POOW's gun and started throwing the ammo (fake) on the floor. I pointed my fake gun at him and told him to stop. He started screaming at me but I kept my gun on him. Eventually he stopped and took me aside and we had a casual conversation about where I was from. Never heard about what happend from anyone.  ",
            "I was on Dorm Guard with an element leader(one step below dorm leader in chain of command). The element leader let my brother flight's MTI in because he had the ornament from our guidon. \n\nElement leader blamed me because I didn't tell him to not let the MTI in. ",
            "I fucking love the way US Sgts talk. My country has a 2 year conscription and my BMT Sgts were those 1year+ conscriptees. That part of training was disappointing.\n\nIs the code word code word because it was a stuoid technicality or because you can't tell us the actual code word?",
            "\"ONE, WHITE COMMON ACCESS CARD, TECHNICAL SERGEANT BUTTHOLE MCPENIS.\" *checks list, sees a penciled in name dated and initialed by our MTI* \"TECHNICAL SERGEANT BUTTHOLE MCPENIS VERIFIED\"\n\nI tried so hard to keep a straight face. \n\nDidn't work.\n\nEnded up running flights and tossing sandbags the next day for some trainees laughing.\n\nStill hilarious.",
            "I was DG monitor in basic.  We moved dorms, and changed TIs. The CSMGT came to test, but actually also needed to get in the office. But, he didn't have keys to the new dorm with him. Those keys were at home,or somewhere else.\n\nHe tried the fake ID. Rejected per protocol. \nHe tried his real ID. Rejected per protocol. That made him very angry because his name was supposed to be on the entry list, but someone had not updated the list since we moved. The list had a bunch of names of people I didn't recognize. I stuck to protocol, as cooly as possible. Enraged, he left.  45 minutes later, he let himself in, challenged me to my face to explain himself, looking violent. \nI did. \nThe cursing woke everyone, and he kicked the shit out of a metal trash can until it was a crumpled mess. \nHe woke everyone. Said some short thing about security, protocol, and adherence, and to follow my example. \n\nSound awesome? No - almost the entire flight completely despised me after that. ",
            "[deleted]",
            "You did well.",
            "This is glorious.",
            "I laughed so much, nice writeup!",
            "Disneyland? ",
            "Checking one yellow banana... negative... may I refer you to our mtl?\n\nThat was a long day...",
            "And sometimes that shit just gets real.  Buddy was assigned pay phone duty when the base went on pre-mission lockdown, or whatever it is called (I'm not military, my friend is.). His duty was to prevent the use of the payphone.  No off-base communication allowed.  He was armed with m-16 and a sidearm.  Officer tried to use the payphone, my friend told him he could not, officer insisted, friend pulled the receiver on his rifle to check that a round was chambered ... In an obvious fashion so this officer could see it, then pointed the rifle and said he had orders to shoot if necessary.  Friend was not court martialed for threatening an officer ... But that officer was totally pissed at my friend, tough spot to be in I think.",
            "And this is why I could never hope to cut it in any military.  60 seconds of dealing with that sergeant (or really anybody yelling at me) and I would probably end up trying to out-shout and out-insult him. Both of which I'm pretty sure are shooting offenses.",
            "OP, I upvoted you specifically for your TL;DR!",
            "Great story! Throughly enjoyed it. I had several moments like these as an 0481. You're told to practice and enforce \"don't confuse my rank with my authority\" as long as it was it tact. Since you're herding Marines in the airfield, or granting access, many wanted to pull rank. A couple of times I was shitting myself in the inside as on the outside I was respectfully telling some highly motivated master guns to fuck off. Haha. Good times. ",
            "Haha I graduated BMT 11 months ago. I could TOTALLY picture every word and interaction in this post. Since then (maybe even because of your experience) a new rule was added. Entry is allowed either with an ID backed up with the roster, if the person seeking entry has a key,with the code word, or if CQ verbally clears them over the wall intercom.\n\nWhen I was in BMT, there was a one star not directly in our chain of command that wanted to tour our room in the early evening. Our MTI was in our brother flight's MTI's carpet, and the general was unaccompanied. Props to the trainees pulling DG at the time, they had the balls to deny entry to a Brig. General. After a minute though our MTI came back and gave the gen a tour, and bitched out the DGs for following protocol. Sweet times. ",
            "This is the best, love the TLDR",
            "Quality tldr",
            "This is great.  TL;DR is awesome too.",
            ">Same basic training as the real air force\n\n so literally not much lol   ",
            "God, I hated EC. The shitty part was I memorized that entire fucking book better than the EC monitor so I got shafted with way more EC shifts than anyone else in case someone came to test us. Besides that basic training was a lot of fun. ",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/airforce] [Sir, may I see your authority to enter? x-post from \\/r\\/MaliciousCompliance](https://np.reddit.com/r/AirForce/comments/5z0pqy/sir_may_i_see_your_authority_to_enter_xpost_from/)\n\n- [/r/bestoftldr] [TL;DR Fix your attention span and learn to read a page or two of text.](https://np.reddit.com/r/bestofTLDR/comments/5z2nt1/tldr_fix_your_attention_span_and_learn_to_read_a/)\n\n- [/r/bestoftldr] [Tl;Dr: Fix your attention span and learn to read a page or two of text. This post may or may not be worth it but someday one will be.](https://np.reddit.com/r/bestofTLDR/comments/6lx6q2/tldr_fix_your_attention_span_and_learn_to_read_a/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)",
            "That was a good story. Wish I could have joined the military but I can't pass psych evals and I'm a shitty liar. ",
            "Not even malicious compliance.  You did right.",
            "Can I have a TL;DR for the TL;DR?",
            "Pretty sure this is a physiological test administered to every flight. Same thing happened to our flight in BMT and I was in 2004-2008 ",
            "When you want to upvote but [OCD](http://imgur.com/KB0a5xR) prevents you. ",
            "I remember I memorized the damn phrase you are supposed to say when they show the ID card, even though they tell you not to memorize it.  I felt like I was doing push ups for a good hour. I do not miss dorm guard.",
            "They are MTI at basic. ... MTL are at tech school",
            "I'm saving this shit. It was too funny!",
            "Good fucking times. Good shit.. I can visualize the dorm and the disgusting exactly as it happened from my time at lackland.\n\n\nGlad it was you and not a young trainee who may have relented.  ",
            "Love your tl;dr you magnificent bastard ",
            "Get rest Sgt ",
            "Late to the party (just found this sub) but I loved this post, loved the \"ONEOFYOUUSELESSFUCKSISGOINGTODIETONIGHT,\" and loved your Tl;Dr.",
            "This is what I go on reddit on to read. congrats. ",
            "I come to subs like this specifically to read. Good story that brings back fond memories of Basic. I joined the Army the day after I turned 19, but everyone in my family was prior service, so I knew what I was in for. \n\nI didn't expect to miss my dog so much though. That part was painful. ",
            "your tldr is cancer and arrogant.",
            "Chow runners go",
            "Better than any of my boot camp stories that I could remember anyways and I went to parris island ",
            "cool story, but seriously, upvoted for the tl;dr. i feel like some people should have it tattooed on the backs of their eyelids.",
            "[deleted]",
            "That was great, also nice touch on the tldr. ",
            "Best Tl;Dr ever!",
            "> Tl;Dr: Fix your attention span and learn to read a page or two of text. This post may or may not be worth it but someday one will be.\n\nThank you. I normally don't inlcude TL;DR in my posts because of this exact reason. If you don't want to read, don't come to the comments section. ",
            "The tl: dr was the best part. Skip all off it and just go there. ",
            "/r/bestofTLDR",
            "tl;dr: national guard. 1 extra guy at roll call. doesn't open door for superior because superior doesn't have ID, Key, and doesn't use code word (as is protocol). 20 minutes later, superior uses code word. extra was supposed to be there. ",
            "Great story but that tldr left a sour taste in my mouth, seemed kinda unnecessary and pretentious. If you disagree with them then don't put one?",
            "[deleted]",
            "Some people check out the TLDR to see if it's worth reading all that text. Being a douche about it really doesn't help your cause and makes you seem really pretentious. ",
            "Well done. ",
            "I would like to know if there is a place where I can fead more stories like these.",
            "This was great. Thanks for this post!",
            "This is so cool",
            "Ha, I knew what was happening when I saw that title - I remember that dorm guard line way too well lol. \n\nFunny thing is you probably would have gotten in real trouble if you hadn't followed the letter of the law...",
            "One of the best posts I've read in this sub.\n\nGlorious.",
            ">The dorm is a 2 minute walk from CQ. He was there in about 9 seconds banging on the door.  \n  \nI've no idea why, but I found this part extremely funny.",
            "Coming from a military household this nearly made me choke of laughter",
            "I went through in '06. I miss it. Looking back, all that stuff was pretty fun actually",
            "Dorm guard duty, what a time! Thanks for the flashback!",
            "Ahh, the joys of dorm guard.  I went through in '96 and remember that particular duty fondly.  ",
            "good shit. technically right is the best kind of right. good on u ",
            "But you were never promoted?",
            "What's an example of a fake code word?\n\n\"Banana 541\" or something like that?",
            "^How ^do ^you ^do ^a ^head ^count ^in ^the ^dark? ",
            "Laughed out loud. Nice one. ",
            "I don't know when you did this but I went thru being DG in 1991.  It was THE EXACT FUCKING SAME 26 years ago.  Amazing.  ",
            "The thing I don't get is why you wouldn't have turned the lights on sooner. Once you realized there was a person in the dorm who \"shouldn't\" be there, I'd think switching the lights on would be on the short list of next steps. But I've never served in the military so I can't speak from experience.",
            "Your title gave me flash backs... *shudders*",
            "Great story, thank you.",
            "Very nice",
            "Expected Crimson Tide ending where you're both wrong.",
            "God I hated DG. Getting the shift rigut before everyone has to get up always sucked..",
            "Ahhh memories of lackland and lackland lasers!",
            "Outstanding.",
            "This is gold ",
            "Oh man that was a great story, thanks for sharing",
            "> Fix your attention span and learn to read a page or two of text. \n\nMaybe one day, but not today.",
            "Thank you for giving me some nice and not so nice memories. ",
            "That's what happens when you count ALL the dinosaurs in Jurassic Park.",
            "Dang i saved this to read this morning and it's gone",
            "Gave me flashbacks to my time in Basic. :-)",
            "I've read too many long winded boring posts to not at least check the tldr before I read the whole thing",
            "\"Tl;Dr: Fix your attention span and learn to read a page or two of text. This post may or may not be worth it but someday one will be.\"\n\nSo here's the thing. When I read a post, I read all the way down until my brain registers the Tl;Dr at the bottom. At that point, it steals focus. Nothing I can do will let me finish reading the post until I've read the Tl. It's annoying as fuck. Part of what happens during this process, is my brain reconciling the details in the post with the Tl. The file clerk in my brain stamps those details which made the Tl as important, highlights the appropriate lines, files unimportant details away... It's a weird thing. Your Tl really screwed me up. Damn near got a mental Blue Screen of Death. ",
            "I was picturing characters out of the Police Academy movies while reading. Bloody hilarious!",
            "I never went through anything nearly as awesome as this, but I could never figure out how to fuck up dorm-guard. Seriously, if they have an ID, they get in. If they don't have an ID, they can fuck off.\n\nThe only question I had to ask was \"can I be ordered to open the door?\" and the answer is \"no.\"",
            "How many roving dorm murderers are lurking that people are killed by dorm intruders in basic training?",
            "The TLDR is beautiful. Loved reading your story. Thanks for sharing.  :)",
            "Love your TL/DR",
            "Just found this and I actually burst out laughing",
            "I know I'm coming across this late, but what a great read. The bin Laden line cracked me up.\n\nI'm going to be honest, no way I would have been up for that.",
            "Just dont put a fucking TLDR then man",
            "I take it less malicious compliance would involve reminding him that a code word existed at some point, or would that also break protocol?",
            "Did you ever get to answer in a high pitched \"ladies\" voice, \"Who is it?\"",
            "I remember my 1 bad experience. ti came in and walked around then looked dead at me and said. \"I smell gas.\" My first was to sniff the air. I thought hmm I don't smell anything. Then remembered it was a test. So I yelled \"Gas, gas, gas!\" And around the dorm. After saying that I didn't know what to do. He of course ripped me and said \"give me a 341\" with such malice. Lol. Will never forget that.",
            "Takes me back!\n\nOne Ohio state drivers license, checking, one Ohio state drivers licence, no. One white middle finger, checking...",
            "If it's this long I won't read it ",
            "This is great. ",
            "I was going to read this but then the tldr made me not read it out of spite.",
            "This was worth it wtf, awesome story",
            "Thanks for the story, what is TLDR?",
            "I like what you've done here! You deserve every single one of your 30,000 upvotes! Thank you.\n\n👍👍👍  \n\nCongratulations, you've made it to [my Top 10 List](https://www.reddit.com/r/lists/comments/6skuwd/swimmingjohns_top_100_maliciouscompliance_stories/).",
            "Though honestly fuck fire guard (army here)",
            "Loved the story. Very well written.",
            "[deleted]",
            "TLDR: Commanding officer forgot the rules and OP followed them, which slowed commanding officer down. He was mad, nothing happened to OP. OP is also a self-righteous doucher.",
            "If I had read the TLDR before I read the post I would've ignored it out of spite.",
            "If you provide a TL;DR, don't comment on why you should read the whole thing. If you want people to read it, don't put a TD;LR, you're not obligated to add it.",
            "I was with you 'til the snotty TL;DR.  Fuck yourself.",
            "Oh boy.  You sure showed him /s",
            "\n\nTl;Dr: Fix your attention span and learn to read a page or two of text. This post may or may not be worth it but someday one will be.\n\nFix your inability to write a concise story that doesn't drone on with unnecessary​ shit.\n\n",
            "Hardly malicious but still a great read "
        ]
    },
    {
        "post_id": "iehxws",
        "author": "Shimakaze4",
        "title": "Don't ask a question you might not want to hear an answer too.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/iehxws/dont_ask_a_question_you_might_not_want_to_hear_an/",
        "score": 14544,
        "num_comments": 527,
        "created_utc": 1598100955.0,
        "selftext": "This one comes from my old man. He use to work at Ford Motor Company for many years and has many stories to tell of how insane it was to work there. However this one is short and sweet and I found it hilarious.\n\nAnyways, as you might imagine, there were many hundreds of workers onsite and most drove to work in a variety of cars. Management and HR decided that it would be best for the company if as many people as possible drove a Ford. So they printed off a shit load of flyers that said \"Why isn't this a Ford?\" on it and put them on the windscreens of all the employee cars that were not Ford's. \n\nQue hundreds of flyers coming back to HR and management with the statement; \"Because you don't fucking pay us enough\" and various other offensive words written on them. Management decided that they didn't care what car their employees drove after that.",
        "permalink": "/r/MaliciousCompliance/comments/iehxws/dont_ask_a_question_you_might_not_want_to_hear_an/",
        "comments": [
            "This reminds me of that one Thanksgiving where Walmart made the news because their own employees couldn't afford a turkey from Walmart.",
            "Once when I had a job as a high priced consultant I was put on the job of handling a large regional bank chain (which has since been eaten by BankAmerica). I attended a meeting with a number of our people and some of their executives, gave comments, and was getting ready to go home. an exec from their bank (I think he was a VP) was talking to me, and got around to asking if I had an account with them.\n\nHe did not want to pursue this particular line of discussion, but he did.\n\nSo I honestly replied \"no\". He was foolish enough to ask why. \n\nAs it happened, I had switched banks like 2 weeks prior. In the intervening time, the horrible bank that I was getting away from had been acquired by the one I was at. Also, I had in fact checked them out as a potential \"new bank\", and had picked another (a small local bank chain with only half a dozen locations) who offered better interest, *much* better fees, better customer service, and better locations close to my home and office. \n\nSo I told him in detail what I was getting and from whom and said \"can you beat that?\" His smile disappeared and, looking defeated, he said \"no.\" I walked away smiling. \n\n(The meeting was to discuss that my colleague had just designed new ATM screens for them. He had done extensive user research and designed attractive screens. In another example of \"don't ask if you aren't prepared for the answer' at the same meeting, a different exec piped up to vomit doubt all over him and demand \"what *exactly* does your 'user research' say our customers *want*?\" My colleague replied \"They want a big red button labeled 'give me large amounts of somebody else's money', but I assumed you don't actually want to provide that.\")",
            "In business school I learned that one of the car manufacturers allowed only their brand to park in the closest lot while other makes had to park in the farther lots.  Also employees got a discount from the company so there was a financial incentive to buy from their employer.  \n\nAnother story.  When Disneyworld France opened, an American from HQ was touring the site and wondered why all these Mercedes and BMWs were parked in front of the economy hotel.  He thought the staff were being lax in getting people to stay in the more expensive one.  He had to be told that while the US get the more expensive models of those cars, in Europe those car makers produce cars also for those with lower incomes.",
            "Just throw a pizza party and BOOM! Workforce moral 100!",
            "The perfect example of manglement!\n\nEDIT: Holy crap this is now my most upvoted comment ever. Thanks Reddit",
            "I had a friend that worked at a Ford plant. Drove a Nissan pickup made in Tennessee. When his co-workers gave him a hard time he replied with: \"this truck was made by Americans, sold to me by an American salesman, and is going to maintained by an American mechanic. So the only person that you should bitch to is some Ford idiot in a Detroit office that can't figure out what Americans really want to buy.\" This was way back when smaller Japanese trucks were hot sellers and US manufacturers did have anything but full-size trucks.",
            "Is this the same Ford where Henry Ford supposedly paid his employees twice the market wages to increase his sales?",
            "My father and uncle also worked at Ford, and I have heard tons of stories that are fucking hilarious. That union was so powerful that it was damn near impossible to fire people once they passed probation.\n\nMy absolute favourite story is the guy who would drink while working on the line and somehow never got caught by management. Well, one day management hears he's drinking again, so he grabs some security and heads to the guys work station. This guy hears they are coming (workers would yell out and warn when bosses are coming around), and he just leaves his work station and takes off running. Manager sees him and the chase is on. This guy runs all through the plant with manager and security chasing after him.\n\nSomehow he managed to lose them, so the manager radios ahead to the security gate to tell them about this guy and make sure he doesn't get out. They really wanted to nail him with drunk on the job. SOMEHOW this guy gets out of the plant and went home to sleep it off. Nobody knows if he snuck through security, or jumped a fence somewhere. And the funniest part about it is that because they didn't *actually* catch him drinking, all they could write him up for was leaving his work station, which is clearly not nearly as bad.\n\nMy second favourite story was the guy who got divorced and kicked out of his house, so he started living in the plant. He found a quiet little area that nobody used and brought a cot and lived there a few weeks. He only got caught because he was stupid and ordered a pizza delivered on a Saturday when the plant was supposed to be empty.",
            "I had an owner of a dealer I worked at question everyone who didn’t drive a Ford or in any case a newish Ford.  I told him because you don’t pay me enough and you won’t give us a good deal on a car.  \n\nYes he was dick after that, or I should say more of a dick because he always was one.",
            "If you really want to dive down the rabbit hole, there’s a book called “A Savage Factory” by Robert Dewar that I recommend. He was a former worker at a Ford factory where they made the C-Series transmissions (I believe it was the C-4 3 speed automatic from the 70’s and 80’s). It really depicted the factory as an awful place to work with poor quality control, sociopathic managers, and constant labor disputes. One of the points they talked about was how they really pushed for people to buy Ford cars and anyone that drove a foreign brand got their windows smashed and tires slashed.",
            "I know the employee discounts are (or were), really good.  like 40% off msrp...  \n\nI worked at a company that did a lot of business w/ the big 3, &  my boss got a company car... I got to look thru the build codes and prices.",
            "A friend's uncle complied to this request by dropping a big block chevy engine into into a Ford. Don't remember what model.",
            "My grandfather ran a company that did business with the Big Three, and back in the 60's is when thinking like this started getting big. \n\nService people would take one of the Econolines to a GM plant and come back with a dent from a forklift. The Chevy Rampsides, when sent to a Ford plant, spontaneously developed four flat tires. And on and on. \n\nThey were all replaced with Grumman vans, which seemed to be acceptable to employees of all three companies as they weren't seen as a competitor. \n\nSalespeople and executives driving whatever they liked lasted a little longer. Those folks didn't visit plants. It wasn't until an executive driving a Continental was told he'd have to street park by an overzealous security guard in the early 70's that there had been any trouble.\n\nCoupled with a Ford employee crushing the hood and fenders of another executive's Jaguar, they had to do something. \n\nThe company ended up buying a few extra company fleet cars, so if you owned a Caddy and were visiting Ford HQ, you could grab a Lincoln.",
            "Fix or Repair Daily",
            "I worked part time for a main dealer for a few car brands while I was in school and college. They offered staff purchases on new cars that they sold for full time staff. And you weren’t allowed to trade in a car as part of the purchase. \n\nIt generally could work out that you could get a new car every year and sell the one from the previous year privately for around the cost of the new car with the staff discount. Some years you might lose €500, other years you could be up €500. \n\nTheir goal was to encourage staff to drive their brand of cars, and almost all of the long term staff there did, mainly due to the staff discount they could get. \n\nSome staff bought the new car at the staff discount and changed it every year, others bought the new car and kept it for 10 or more years.",
            "Completely unsurprised but still disapppinted that they decided not to care instead of giving them a raise.",
            "Funny bit is, back when Ford started the production of the Model T, one of his big initiatives was to make sure the employees were paid enough that they could afford to own a Ford car. (Although, from what I understand, this was a cover story; he was just sick of people \"slacking\"/costing him money with downtime.)  \n\n\nFriend of mine is also a retired Ford regional technician. The shit he's told me jives with your story. (Sure the same can be said for any of them. And how about Tesla? I can see Elon waltzing into the room wielding a Boring Co. Flamethrower.)",
            "If my answers frighten you, Vincent, then you should cease asking scary questions.\n\n-Jules",
            "My father was a mechanic at a Chevy dealership. He bought a pink Lincoln convertible, and the first day he drove it to work the general manager was storming around the place demanding to know \"Who owns the G&# D@#\\*&ed Lincoln out in the employee lot.\" My father told him he did, and the GM asked \"Why didn't you use your employee discount to get a new Chevy?\"  \n\nHe got fired when he answered: \"I wouldn't buy one of these pieces of sh$% if you gave me one.\"",
            ">Que hundreds...\n\n¿Qué?",
            "I used to work as an IT subcontractor at the Ford plant outside Cleveland (I think it's gone now). I was only there for a few weeks (covering for someone) and was warned my first day to park my Honda at the far edge of the parking lot or someone might fuck with it. Was a weird place to work. Like I'm generally pro union but some of these UAW dudes gamed the system so badly...",
            "I am old enough to remember when American made cars were not as reliable, because of course their (male) owners would want to work on them on the weekends. Now, I’m on my fourth Toyota, going strong with over 200,000 miles on it. \n\nMy impression is that quality of American cars is much better now. But you can’t tempt me. When I was a 5’4” young woman in my twenties, afraid of getting stuck someplace in the dark, I wasn’t a priority.",
            "I was able to buy my own first car (ford aspire....it aspired to be a real car but it was mine to beat up) for $50 over invoice because my step-mom worked for Ford mortgage company.  $195 a month.  \n\nI even got $400 on my trade in, my dad's beat up old Nissan, which my dad said I'd only get $50 for.  \n\nThe dealership didn't see the huge hitch hole in the bed because of the cab.",
            "Near the Ford plant I grew up around, they had separate employee parking lots for Fords and non-Fords. They said it was to protect the non-Ford cars from being vandalized by other employees, but the non-Ford lot was a farther walk. Maybe the idea that other employees would vandalize each other’s cars was another myth by management to prevent greater unity among the workers.",
            "I live in SE Michigan, the land of car makers. There are many locations of car manufacturing where the cars made by that manufacturer park on the same side of the road as the building. Foreign cars, including other US manufacturers, park across the road and the people get bussed in to work. \n\nAlso, I know of at least one yacht club that only lets people who drive a car made by the big three to park near the building-it’s all valet. Foreign cars have to be parked on the other side of the bridge, and they can’t be valeted.",
            "When Ford UK had a massive plant in Dagenham, Essex in the 70s/80s, they offered staff huge reductions on staff purchases of cars. For a long time pretty much every car you saw in Essex was a Ford. Things certainly changed though as the years went on.",
            "Which is ironic, since Ford wanted his employees to earn enough to buy his cars.",
            "[deleted]",
            "That’s really sad considering ford built his business on building a car his employees could afford.",
            "The Ford plant where I'm from has Ford parking across the street from the factory with a covered walkway to get across the road.\n\nNon Ford parking is half a block away and you walk on the sidewalk like a peasant no matter how deep the snow is or how hard it's raining.",
            "Your father should have found which manager was responsible for that idea and make  a sign for his car.\n\n&#x200B;\n\n>Five asses kissed for pay raised needed for down payment  \n>  \n>11 more asses kissed for 2nd raise needed for early loan pay-off  \n>  \n>One promise of a blowjob for the All-Wheel-Drive option",
            "HR and Management should’ve known the answers that they were going to get",
            "\"Because I fix enough of them at work, I'd like a reliable car for myself\"",
            "I had an experience in a union where the employer wanted EVERY PERSON to clock in and out. This is an entertainment gig, so most shifts are less than the minimum anyway. They set up a fingerprint scanner to be sure each person was only clocking in and out for themselves. Trouble was, massive turnover. Constant new hires and you wouldn't necessarily have the same people week to week. The only way you could be sure that every employee had a print on file was to staff every shift with someone who could enter them into the system, at the time of their shift... which was by naturally after hours for all office workers. Also, they set up one reader for 100-200 people so you had massive queues and thus most of the collected data was inaccurate anyway. And that is before you have trouble with the reader or you come across that rare occasion when we do go past the minimum and then have to pay another half hour because they are waiting in line so long that the clock ticks over.",
            "Why? Because they couldn’t afFORD it!",
            "The local Ford plant gives preferred parking spots to employees that drive Ford cars and trucks. For anyone else, they have to park far away from the entrance (per my friend that used to work on the assembly line).\n\n\nI'm glad the employees of your story fought back against Management!",
            "You do get preferential parking at the plants if you drive a Ford. Non Ford's have to park in the back. Only applies to the plants though.",
            "Did you want \"cue\" or \"queue\"?",
            "Um, as blue collar work goes...  They are paid very very well.",
            "An old co worker of mine worked at a Ducati dealership. Most of the guys rode Yamahas, Honda's and Suzuki bikes. The offered every employee a Ducati at like 15% off their cost which brought the price down to nearly Japanese bike prices. My buddy got a 1098 for like 10k USD.",
            "OP should have gone out and found the most piece of shit Ford that he could (I'm thinking old rusted out Ford Maverick, man those things rusted away in one year) and drive it to work everyday, leaving rust spots all over the parking lot.",
            "Oh wow. Because the original Ford was the first car employer to *make sure* to pay his employees enough to own a Ford. He got in a LOT of trouble with his robber baron car manufacturer friends for that.\n\nThat's so sad his descendants destroyed Ford's commitment to the workers.",
            "Companies that really want their employers to use their products, offer a hefty discount -- direct sale from the factory, wholesale pricing, all that.   I get that a car company doesn't want to take business from its dealers, but ways of handling this through dealerships could be found (permanent employee rebate, and like that.)",
            "At almost every Ford property I’ve worked at, there were designated spots for non-ford products, and at plants the UAW would have even more restricted spots for non union built cars.",
            "My father-in-law used to work at a ford factory and they did the same sort of thing -- except they'd actually trade your car for it's equivalent ford model free of charge.",
            "\"I can't help about the shape I'm in, \n\nI can't sing, I ain't pretty and my legs are thin.\n\nBut don't ask me what I think of you,\n\nI might not give the answer that you want me to.\"",
            "What the actual fuck?!  This is a wildly rude and inappropriate thing to do!  Shame on them for even thinking that bullying their employees was ok!",
            "Can’t afford a Ford!",
            "When we worked at chrysler many many years ago, if you drove a foreign car on the lot someone would come by with a fork truck or a lull and place it outside of the plant property on the service rd. That was the nicest thing they would do. Before i worked there they would slash tires, stack cars on top of each other, outright steal them, key them or break out all of the windows.",
            "Ironic really - wasn't Ford the man who wanted to make cars cheap enough for his employees to buy?",
            "Kind of ironic as Henry Ford paid his original employees triple the then standard rate, specifically so that they COULD the cars they were making.",
            "At least nowadays they have one of the best plans for employees (and their immediate family) to buy a vehicle.",
            "Which is a crying shame considering that Henry Ford believed workers should earn enough to buy the company's products.",
            "Solution: give them hefty employee discounts on Ford cars to reward them AND promote the brand.",
            "¿Que?",
            "I remember going to a Tesla “store” (I don’t know what to call them, they’re not really dealerships) with my father back when the Model S was their only product. He always finds the worst possible question to ask, like smiling and saying “how’s business doing?” at a family owned business that’s clearly struggling to survive.\n\nSo he’s looking around and someone asks if they can help him, he says that he’s just curious and not really in the market for a new car. Then he asks “so do you have one of these yourself?” and the Tesla employee literally laughed out loud and said something along the lines of “no, none of us could afford one, they’re way too expensive”.",
            "They should offer low interest loans that could be paid back through the wages. That's what my company did!",
            "There was a Ford plant in my hometown. The close parking lot was nicely paved, fenced and gated, and only Fords were allowed to park. All other parked in a pot-holed unsecured lot in the boondocks.",
            "I used to (in the mid-90s) work for a company that supplied parts to a local Chrysler plant. We got word through the grapevine once about a guy at Chrysler who had just gotten promoted to an upper management job. To celebrate, he finally bought the car he had wanted for a long time — a brand new BMW. When he got to the work the next day, he bragged about his new pride and joy. Only to come out at the end of the day to find it had been keyed and the tires were slashed. Oops. He should have kept his car choices in the Daimler-Chrysler family.",
            "\"If my answers frighten you Vincent then you should should cease asking scary questions.\"",
            "Don't ask me what I think of you, I might not give the answer that you want me to..\n\n[https://www.youtube.com/watch?v=AcHsrjctdLg](https://www.youtube.com/watch?v=AcHsrjctdLg)",
            "I would've sent them a list of all things that were wrong with my last Ford and pointed out that my Toyota is running great after over 20 years. \n\nAlso, some of the things I hear about y'alls jobs make me feel grateful for the company I work for. My job just pushes charity, health and college related things on us and want us to constantly be trying to get into higher paying positions. They send out a lot of emails for Weight Watchers and Fit Bit discounts but have never said anything about me not using them. They have a free mental health hotline for employees and they offer college tuition reimbursement. I wish I could name drop them because they're always hiring but I don't want to dox myself lol.",
            "LOL! My great uncle worked on the line at Ford for many many years. I have heard some of the stories.",
            "My Dad knew a guy that worked at a Ford plant back in the 80's, he drove a Chevy Suburban, the asked him when he'll trade it in for a Ford, his reply was always \"when they build something strong enough to tow my race car to the track and take my family camping\"\n\n&#x200B;\n\nThis was obviously way before the Excursion ever came out.",
            "*to",
            "That’s not malicious compliance, it’s noncompliance. Malicious compliance would be if they bought ford cars and then couldn’t come to work because their cars broke down.",
            "Henry Ford, the founder of that very company, made a point of paying his workers enough so they could afford to buy their own products.",
            ">Don't ask a question you might not want to hear an answer **to**.\n\n> He **used** to work at Ford Motor Company [...]\n\n> **Cue** hundreds of flyers [...]",
            "pretty funny!",
            "I was reading a biography or Harley Earl and it mentioned how many executive's kids drove Ferraris, etc back in the 50s.  The President of GM took one of Earl's prototypes and gave it to his kid so at least he was driving a GM product.",
            "The A plan is whatever the dealer pays for it so they are still making a very decent amount above costs from employees. Anyone can get that price if they haggle enough. Employees probably just buy them for the zero interest loans.",
            "I worked at a Chrysler plant about 20 years ago. They had close parking for those who drove a Chrysler, Dodge, etc. The next closest parking was for American cars in general. The shitty far away parking was for anything foreign. That’s ok, I needed the exorcise.",
            "\"Because to all of us, we can't afFORD them!\"",
            "[deleted]",
            "Sister used to work as a contract employee for a car maker. Anyone with that car brand got to park close to the building where it could be seen from the street and all others had to use a back lot.",
            "Ironically, there’s the tale that Henry Ford increased sales back in the day by paying employees enough to buy his cars.",
            "workers can’t even afford the value they produce .... so fucked up",
            "Interesting follow up from now: They still have close up parking lots at the factories for Ford Cars and farther off ones for non-fords.  Manager was asked why the Ford lots were so empty and he said essentially the same thing, \"Most of the workforce are younger guys who don't make enough to buy a good American car.\"",
            "I work for an energy company and we were once asked if we were supplied at home by the company and if not, why? We got similar answers back, ranging from \"because you are too fucking expensive\", \"I'm not stupid\" to \"pay me more and I will\"",
            "Most of the big three plants that I know of have parking up from for the big three cars. If your driving a “foreign “ car you have to park in the farther away lot. This is from the UAW not management.\nI work at a Toyota plant and they don’t care what you get to work in, as long as you’re not late.\nWe do get a discount on Toyota and Lexus vehicles though .",
            "„I wish we built cars like this“",
            "Que. Hmm.",
            "good lord what do they expect?!",
            "If you have a full time job you can afford a Ford. They're still one of the cheapest brands around.",
            "I worked for a chain gas station/convenience store as an assistant manager in the mid 1980’s.  I applied for the company credit card and was turned down because I didn’t make enough money...\n\nNo problem, quit to go to college and get a degree.  The sad part is that some of the people I worked with are still there, as assistant managers.",
            "I’m 17, and trying to save up enough to rent a place once I’m 18 and I relate so much to this. I work at a Kroger affiliated place, and I get 9.25 an hour. Meanwhile, the hotel down the road is paying starters 11.00.\n\nI get that I’m a minor and stuff, and I’ll probably quit soon, but really? I also once got a temporary raise to ten, due to me working during *the thing*, but they dropped it down again.",
            "Some employers use “salary bands” which depending on your level and title you make in the same ballpark as everyone else. It’s a good question to ask HR if they use salary bands during the interview process because it helps bring pay equity and keeps from unintentional unethical behavior.",
            "To be honest, I always wondered about that when I would go to a dealership. Why are the staff driving other cars? Is that just because they like it, because they aren't being paid enough, or because the brand isn't trusted by the employees even. When I saw the junker kind of cars or just older cars in general I didn't really think much of it, maybe they just liked it or they were saving money or what not, but when I would see a brand new vehicle of another brand or raised some questions in me. We aren't taking about sports cars or anything, just a regular vehicle. I went to the Hyundai dealership about 1-1.5 hours away and saw two brands new Fords, one was a focus and one was a Taurus, on the staff parking",
            "Somebody probably wrote back saying they couldn't af\"ford\" the cars.",
            "There would be no excuse for this entitlement regardless, but there's especially no excuse for *the Ford company* given their own founder's solution to this very same issue.",
            "Especially if the question is \"is it 'to' or 'too'?\"",
            "To*"
        ]
    },
    {
        "post_id": "10p2pdt",
        "author": "Normal_Plantain_123",
        "title": "WFH means PTO, guess we're off then",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10p2pdt/wfh_means_pto_guess_were_off_then/",
        "score": 14525,
        "num_comments": 549,
        "created_utc": 1675086545.0,
        "selftext": "We have a hybrid policy, 2 day on site, 3 days WFH. We can't pick the day we work from office (this changes every month). \n\nMost of us are on salary so work can go on till late night or end after an hr. On days that I have a heavy workload I prefer to wfh and go to office on another day \n\nOne day all members from my team(3 of us) decided to work from home(Heavy workload). Only time this has happened since the office open a year ago. Manager got pissed off. She sent a patronizing email. In her mail to us she said that she would count this as us not working that day. Decided to ignore her until we got a mail from upper management parroting my manager's words\n\nTurns out most people have a heavy workload and whole teams with their managers are working from home. My manager wouldn't know since she delegates her work. Anyways she escalated the matter and upper management decided to agree with her. \n\nMy team had a meeting and decided if we're loosing our PTO, we're using our PTO. We sent a mail to our manager stating the same, including a list of things she needs to do since we're off. We spoke to other teams who did the same with the upper management.\n\nWe logged off and switched off our work phone.\nManager had to do the work herself\n\nUpdate: \n\nWork policy: The WFH =PTO policy was removed.  Unfortunately we still have to go to office twice a week but we can select the days. There is no official punishment for not going.\n\nManager: She had to do the work herself and work through the night to do so. She still thinks she did nothing wrong. She's been trying to \"punish\" us by giving completely unreasonable deadlines in the name of accommodating the client. It's like she's on a mission to get people to hate her. Other team managers already avoid her (mostly cause we made sure to let them know who caused this mess)",
        "permalink": "/r/MaliciousCompliance/comments/10p2pdt/wfh_means_pto_guess_were_off_then/",
        "comments": [
            "I never understand this shit. If your team is productive, then get out of their way. \n\nGet them the tools they need to succeed and work with them to be efficient.",
            "I wonder how stubborn she ended up being about it, knowing that there was no way she was doing all that work herself, but also being arrogant enough to not admit fault  \n\n\nIt is satisfying when people do this to themselves, though. Hopefully you get to stick to your guns",
            "Loving it! I quit a job (web dev) because frequent OT with no extra payment for those hours (several hours a month), half of the team quitted right there once management shared the news leaving only 8 people handling the workload for 16 and we were already overworked while all this happened during Nov - Dec, peak season for marketers and alike... It was fun to watch it burn.",
            "I really like the phrase,  \"people don't quit bad jobs,  they quit bad managers.\"",
            "[deleted]",
            "My team is 100% work-from-home, and we kick ass 100% of the time.  We're dedicated to the company because the company takes care of us very nicely on every level.\n\nIf companies aren't seeing this from their employees...well, it's not because of the *employees*.  Better start looking in the mirror...",
            "Lol yeah. Your manager seems like a bitch.",
            "I've never understood this kind of nonsense...\n\nI'm a shift supervisor. Our workload changes daily and sometimes even changes during the shift. Depending on what breaks. When I took over this team I clearly set out my expectations. They know what is expected of them - we reach an agreement as to who will do what, in what order and they know what needs to be delivered. I don't need to micromanage them, or hand out work - they pick what they're going to do. If the work is done early then they get to do whatever. If the shit hits the fan after the work is done and they need to pick up any extra work - then they do so because they know that they have to take the rough with the smooth. I prefer the hands off approach, it worked with my old shift and it works with my new shift. Why stress yourself out micromanaging a team? What it does mean is that if there is a team member who isn't where I expect them to be - I can afford to focus on that individual. They feel supported, I get a chap back to where they need to be - everyone is a winner! :-)",
            "Please post an update. I’m dying to see the response from manager and upper management.",
            "Who changes the WFO days every month? I don't know if you have kids but with kids and their school and spouse working I have to always not be available during their meetings. Either fix the days or expect such rebuttable.",
            "I will never understand why people think they can bully others by doing something like this. If there is anything I have learned from reddit its that 1. People hate being screwed over and will likely find a way to get you back. 2. If someone asks for something in writing you should really stop and think about what your doing. This manager tried to punish ppl by marking them absent from work and expected everyone to just deal. Wth would have done the same if it were me.",
            "Working from home really shouldn't mean working overtime, though. You're still compensating for the company refusing to staff properly.",
            "If your work can be done efficiently from outside the office, why be there? I’ve been WFH for almost 3yrs solid now. We work as well or better than we did in the office. All our metrics show it. Our director noted early on that the one thing he took away after we got over our comfort issues using our various communication tools was that we spend less time having meetings and even less time meeting about the meetings we’re going to have. My whole group is now permanent optimal WFH now. My whole building got repurposed. A few people — mostly managers — still come into the office a couple days a week. Nobody else does. We also hire from all over the country without even thinking about it now. We had a guy move across the country and, since he doesn’t really talk about it much, nobody even noticed.\n\nUnless you have some sort of task that physically cannot be done outside the office, I fully believe that the office is an artifact and a relic of a time best left dead and buried.",
            "Sometimes the tree has to be shaken for the fruit to fall. In this case the fruit is to teach a manager that what she did was......not acceptable.",
            "I never have understood the micromanagement of WFH. I work in a department where if you’ve been there maybe a month you’re offered the opportunity for WFH. Even my supervisor does it 2x a week. There’s other departments where supervisors make the decision if you are eligible by looking at your productivity and other things that I have no idea about. I don’t get it.",
            "Be sure to keep track of what percentage of the day you did work before upper-management sent down this edict. You're still entitled to this PTO in the future.",
            "At 50 I’m clear that half the problems in my life (career, romance, all of it) were me not getting out of my own way… sad when you see so many managers botching it",
            "Poor leaders micro-manage.",
            "I don't care where my team is, or how they spend their time. As long as the work gets done and we are moving forward as a company.\n\nMore people are coming to this understanding, but change happens slowly.",
            "If you're taking my PAID TIME OFF, I'm not working. Those things are not the same.",
            "She should win the Miss Management of the year award.",
            "Salaried worker doesn’t mean you work any given hours. It should still be attached to a weekly contracted amount. Well, in 1st world countries at least",
            "It's not enough that you do quality work and deliver on time; you also have to be on the shortest chain.",
            "I'm now a full time home worker. I am given work to do and as long as it is done by the deadline, I get to manage the hours I work to get it completed. My manager touches base when he wants to know how I am or when he wants some advice or help with something. \n\nIt works well for all involved. I even get to go swimming a couple of afternoons a wekk and had Brunch with my wife in a nice local bar this week.\n\nI spoke to former colleagues at the place I left last year and they've been ordered back into the office 4 days a week. It's safe to say morale there has hit rock bottom.",
            "Aren't you supposed to post after the fallout? Meaning did the policy change? Are they stubbornly sticking to it? Is the Manager changing anything?",
            "Can't wait to see the reply from upper management (that you're not going to see until the next day because you're off) that tries to either backpedal or place blame.",
            "This just proves how useless middle management is",
            "I would just quit and find another job.\n\nThis hybrid policy nonsense is stupid. Unless there is a reason for you to physically be there, like you have to help move a desk or something, there's no reason to go in.",
            "If your work gives you provision to work from home. Regardless of company policy, if they have allowed you on numerous occasions to WFH on a flexible basis to manage work, they can't make you take a PTO unless they tell you before a 'shift'. If you've worked even 10 seconds on that day, they can't say they're not logging it as a work day, but instead a PTO. That, in many countries (YMMV) is wage theft (albeit a more convoluted one).",
            "Lol how do people this stupid get into positions of power? You didn’t really give any food fallout for this. What happened after? Did she complete the work? Did she get in trouble?\n\nMore details please!!",
            "As someone who also works from home I am always hearing these micromanaging stories of other companies WFH policies and am so thankful my organization isn't so asinine. I'm fully remote as if half my department, some are hybrid, but in all our CEO always reminds everyone that he don't like working clocks. We have our roles and regular duties and are expected to complete those and meet our goals. Provided we do that nobody is tied to a desk or clock. We still average a 40hr week usually, but you can work to your schedule and needs. I usually work longer hours during the week so I can take a half day on Fridays. If I need some time Monday to run some errands I just put in longer hours that evening, or later in the week. None of that checking behind each other or micromanaging. By",
            "So? Then what happened?",
            "My wife used to share an office with a woman whose manager did this. I kept telling my wife to tell her just not to work if she’s going to be forced to take PTO.",
            "Rule failure, no description of the fallout.\n\nWe want to hear about your manager's pain!",
            "LOL.  Outstanding!",
            "Sounds like your manager wants to work at a daycare, not in industry. \n\n\n\n\nManagers like this suck and bring down the entire company. Keeping people under your thumb over arbitrary bullshit like this is a great way to drive away good employees.",
            "I need more info...story is only half finished, don't leave us hanging!\n\nWhat happened when you went back to work, what were repercussions, changes, etc?",
            "Lmao lesson taught hopefully it is learned",
            "Not much of a manager. Good for all of you.",
            "\"Just to confirm that you are taking eight hours of my paid time off, therefore committing wage theft. Please confirm this in writing thank you.\"",
            "*Losing.",
            "[deleted]",
            "Follow up... What were the consequences?",
            "What is this trend of considering work from home to be PTo on this side of the pandemic???",
            "Just middle management proving their worthlessness once again.",
            "I want to know the outcome, please.\n\nDid she attempt to do any work or leave it for you to do?\n\nIf she attempted to do the work, did she screw it up? If so, how bad?\n\nDid upper management reverse their opinion and have the good sense to let you do your jobs as you see fit or rake you over the coals?",
            "Why would you even bother telling your manager how to do her own job? Or was the last of things to do in order to cover your own work while on leave?",
            "bro company I work in now is returning to office but people in other countries can still wfh. \n\nthe catch is. people wfh, are NOT allowed to work anywhere but their set home address. like...... what the fuck is this policy. you're already remote why would you need to force where I work",
            "Some thing similar happened with me during onset of COVID. It was in 2020 April. \nI had already requested my manager to allow me to work from home as my laptop was configured, tested and ready to go. I was and associate then and used to take inbound calls.\n\nThis was the day when government all over the world were starting shut down and even Indian govt had started taking strong actions.\n\nWhen my manager refused despite pleading with her that my parents are over 60 with my mum having multiple health issues and very prone to such infectious disease. \n\nThe next day my manager called me asking me if I'm gonna show up to work, i politely refused stating i had this conversation yesterday and you refused, so i will not be coming. However I've got my laptop and can take calls working from home. She told me management does not approve yada yada. So i stayed.\n\nTurns out same night, the office was raided by cops with company being penalized due to breaking norms. And even before people could finish half thier shift, everyone had to logout and carry laptops/full desktops home. What a way to switch to WFH. It was full chaos. Majorly cuz due to new COVID laws being introduced we were bombarded with calls non stop. Something like 200+ calls waiting in queue at any give time.\n\nI got a time off on this hellish day, no work done by those who did go to office and penalties for doing so.",
            "Excellent and concise. Thank you.",
            "loosing <> losing",
            "You know this only happens when you have a bad manager who either feels they can't control their own staff, or is trying to hide something themselves.",
            "Did they correct their fuck-up? Brilliant response, by the way!",
            "Fallout appears to be the manager having to do three people's heavier than usual workload in one day.",
            "Be interesting to see how this plays out",
            "Updateme!",
            "losing*",
            "And then?",
            "Was it your day scheduled with the 3 in office? Did you not tell anyone?",
            "Leadership like this sucks and doesn’t deserve good employees.",
            "Wish I could find a WFH 100% of the time job",
            "When WFH was brought up 2 yrs ago at my company, I was told if we went to mandatory WFH due to covid, I would have to use my own computer because due to dropping revenues, the company did not have the funds to provide one. No big deal except I did not have one at that time. My boss basically said if WFH became mandatory, then only those who had capability to WFH would be receiving paychecks. Since I live in a right to work state, guess who had to buy a new laptop? ugh  and I still work here and although it came in handy a few times, we never went to mandatory WFH. I was told by higher up bosses believe WFH is basically the biggest avenue of employee theft out there because no one actually WORKS from home unless they are on salary. That let me know real quick where I stood because although I am on salary and considered part of management, I am no higher than any other hourly staff.",
            "FedEx is cutting 10% of their managers to help boost profits. Maybe this company should consider doing the same.",
            "Losing\\*",
            "I’ve only had one job that was WFH and although I was productive and got all my work done every day, I ended up quitting the job due to unfortunate circumstances with the office manager who let “power” and dollar signs cloud her vision. Not to mention that we were friends and it really changed everything. She was a manager that said, “I do things my own way. I break the rules for myself but you, meaning me, had to follow policy. I don’t deal with double standards. I called the boss /owner and told him I quit. \n\nSeveral months later the boss /owner called me and wanted me back, but as the manager!! I negotiated a pretty good deal for myself but then I found out that the owners were raging alcoholics. I never knew if my paycheck was going to bounce and some of the ways they wanted me to do things were not ok with me. It was basically stealing. We’d bill for things we hadn’t yet done or weren’t even going to do. Just before Christmas that year, (10+ years ago) I had a migraine from hell brought on by the stress of them constantly cheating to make it look better than it actually was, I quit and never looked back!!",
            "I would document everything and send it to upper management. If that doesn't work there's always social media.",
            "Have me use p.t.o on this, then double the work for you manager.",
            "For the love of all that is holy, it's losing, not loosing! Why do I see that every day?",
            "[deleted]",
            "So the WFH days are chosen by your company (as I understand - per the company's policy/your contracts), you disregard that and then you're pissed you get consequences of your actions? How about acting like grown ups?",
            "What's the fallout? Manager doing the work herself is rather anticlimactic.",
            "Horrible thing to have to do so you didn't \"lose\" PTO.",
            "Without knowing more details of the work you and your team is doing, is there no way to show status updates of the work being done?  \n\n\nIf your manager doesnt know what you are doing when you are in the office or WFH, then they are a pretty shitty manager",
            "That’s called wage theft",
            "The mark of a good manager is someone who understands the final goal at the end of the day and doesn’t get in the way of work being done.\n\nThat being said I have yet to ever encounter a good manager or hear about one haha, I seriously think every workplace on this planet would be better without managers.",
            ">we're loosing\n\n\\*we're losing",
            "Fallout?",
            "This post gives me hope.",
            "You ever wonder if these guys are worried that if we get used to running companies from home, we'll figure out how to run government the same way?",
            "I smell something…I think it’s BS",
            "Universally speaking, Managers are good at two things:\n\n1- Not having a clue how much work you have, much less how to do it.\n\n2- Finding problems with the work you have been doing flawlessly, so they can deny you a raise. \n\nGreat job at showing them! I am taking notes.",
            "That was utter perfection! I hope the manager had a nervous breakdown.",
            "God I love this...for sticking it too her .",
            "Updateme!",
            "Updateme!",
            "What's pto?6 yy",
            "As opposed to tightening your PTO?",
            "Who does the work? The people do the work. Not the managers, not the supervisors, not the CEOs. Don't pay, don't appreciate? Welcome to the people screwing your whole day up. Now, YOU, can do the work... only you don't know how to, you just know how to supervise. Welcome to your entire business shutting down.",
            "She is terrible with authority and needs to not be in her current position.",
            "Can we get an update on whether there’s an apology or policy change? Are you all working from home every day now?",
            "My family \"excused\" me from most board games; Life, Clue, Risk, etc. because I always won. But Uno or games completely based on chance were OK."
        ]
    },
    {
        "post_id": "dvmjzl",
        "author": "masterjabbadad",
        "title": "Ok Mr lawyer i will!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dvmjzl/ok_mr_lawyer_i_will/",
        "score": 14525,
        "num_comments": 353,
        "created_utc": 1573620270.0,
        "selftext": "TLDR: lawyer tried to hardball my client, i proved his client committed a statutory offense and got what i wanted plus damages and dobbed his client in.\n\nSo i work as a specialist property valuer. A few years ago a real estate agent friend approached me on behalf of his client. His client was a book seller who operated a specialist book shop on the 7th floor of a City building. A one man band small business. Nice bloke.\n\nUnfortunately nice bloke had decided to renew his lease for 5 years and signed the new lease without getting advice. His new building owner enacted the market rent review clause and jacked up his rent by something like 50%. Tells nice bloke, your new rent for the next 5 years is x. \n\nNice bloke is distraught! He cant afford it. So he asks nicely to rescind the lease and he will move elsewhere. Estate agent friend has found a cheaper space for him. Denied by building owner. Building owner says he will also sue if he breaks the lease.\n\nSo the agents asks me to review the case. I look through the case. Nice bloke is stuffed. The lease is lock tight and they are justified in jacking up the rent. I think our only hope is to appeal to the mercy of the building owners lawyer. So i call him and ask for release, penalty free, for my client. Mr Lawyer says \"stiff cheddar, you need to comply with the law, try reading the lease\". A real arrogant a-hole. Cue malicious compliance \"ok, i will\".\n\nI read through the lease and note that all references to the Retail Leases Act have been crossed out. Fair enough. The act only applies to retail tenancies IF they are below the 3rd floor of a building. Nice bloke is on level 7. Act should not apply. But hold up imma gonna check that. \n\nI call the small business commission who administer the act, and they advise that, if you retail a good (like books) it doesn't matter what floor you are on the act applies. You could be on the friggen roof if you want. The level 3 provision only applies if you retail a service. This means the building owner has breached the act and failed to comply with the law (theres certain things they have to provide before signing a lease and timing they have to follow). A breach is no small thing. I get a ruling from the commission.\n\nI call for mediation with Mr Lawyer. Present are Mr Lawyer, building owner and their agent and nice bloke and me. I again plead for a penalty free release. No dice and they threaten to sue. I gently slide the ruling accross the table to Mr Lawyer. \n\nMe:\"Ok. Well as per your suggestion i read the lease. We have a ruling that proves the act applies to the lease. Your clients failed to comply with the act and committed a statutory offense \"\n\nLawyer: (reads ruling)....\"um ok. We will grant you a penalty free release\"\n\nMe: \"oh. We dont need that. We enact our right under the act to terminate the lease, penalty free, and to seek damages for the landlords breach of their statutory obligations and ill be reporting the breach to the commission \"\n\nLawyer: \"no need for all that, lets just tear up the lease\"\n\nMe: \"sorry, that wouldn't be complying with the law would it?\"\n\nUPDATE 1: I just spoke with the agent on our side, we are still good mates. He cant remember the outcome off the top of his head but he thinks he might have leveraged a waiver of nice blokes make good obligations (requirement to replace carpets, paint walls and remove fitout etc) and he did move nice bloke to a cheaper space. He thinks he might still have a file on it so he will ring me back when he gets into the office.\n\nUPDATE 2: so i spoke to the agent today and he doesn't have the file anympre but his recollection is that he negotiated a waiver on the make good obligations,  got 60 or 90 days rent free and relocation as a deal for nice bloke. We canremember if anything happened from the dob in.",
        "permalink": "/r/MaliciousCompliance/comments/dvmjzl/ok_mr_lawyer_i_will/",
        "comments": [
            ">Me: \"sorry, that wouldn't be complying with the law would it?\"\n\nWell done. That must have been extremely satisfying to tell them.",
            "Justice boner engorged!",
            "So what was the fall out?",
            "Boom! Lawyered! :)\nVery nice.",
            "As I said previously:\n\nALWAYS. Read. The. Lease.\n\nEvery damn word. Don't just TLDR to the bottom and sign.",
            "Well done!!!!",
            "Years ago my wife had a one person landlord/tenant law practice here in the US. It was basically a one person show, so if my wife had to go to court, the office was empty. Not usually a big deal as this was the type of practice that was mostly cell phone and laptop. Technically it was a two person partnership law practice, but my participation was limited to reviewing contracts and going to court once in  a while if she two cases at the same time.\n\nSo, there was one tenant client who had a dispute with her deposit and damages. Long story short, not only would her landlord not give the deposit back but claimed there were extra damages. Our case was weak as our client didn't have proof that the damages in the apartment were preexisting or caused by external forces (a window was allegedly cracked by a tree branch from the outside).\n\nNow, in my state, if the landlord does not provide a detailed list of damages or the the deposit, automatically the landlord has statutorily failed his or her role and now owes double the deposit. Guess who didn't comply with the statute? The now double deposit amount exceeded what the landlord was demanding so were willing to settle for the difference. Nope. Mediation fails and we go to the judge.\n\nNow, before I continue, this landlord was an arrogant SOB who didn't know the law.  He was a computer engineer who thought his shiat didn't smell and the rental was just a second investment property. We (I got involved at one point) tried to explain the law when offering the deal, but no dice. He thought a law firm that didn't even have regular office hours during the business day (not really required in our line of work -- really only needed the office as a space nicer than Starbucks to meet with clients) was too far beneath him.\n\nNow the way LT court works is that you have two rounds of meditation before you see a judge. Most cases settle before you get to the judge so if it gets that far, the judge is looking to see who is being unreasonable.  The judge rules for the landlord, though he disagrees with some of the cost estimates and awards him a bit less money, but reminds the LL that he owes double the deposit so he needs to give T some money (more than what we would have had to pay if he just accepted our offer).\n\nLL doesn't agree with the judges findings and appeals (larger court fees). When my wife gets the paperwork she sees he screwed up the appeal. Since she wasn't his lawyer she didn't have to tell him he screwed up. She didn't even have to respond to the court. Instead she quietly put a lien on the property for the judgment, added a fee for the extra paper work involving the fee, and went on her merry way.\n\nYears go by. One day, we get an email from the email the LL asking us to remove the lien as he is selling the property. Gladly, just pay the judgement and fees. LL refuses and hires his own lawyer to fight us. This time we have the strong case. We simply show the attorney the paper work and how everything was proper on our end and it's not our fault LL tried to play lawyer without seeking legal advice.\n\nLong story short, our client gets her money, we get our legal fee, and LL gets a bill from the attorney that he hired that probably negated whatever the judge awarded LL.\n\ntl;tr - mess with the horns, get the bull even if it takes awhile",
            "Suits material right there!",
            "“Read the Transcript!”: Australian Edition",
            "Beautifully done",
            "Amazing. Well done!",
            "Ah the Victorian Retail Leases Act, always trips a few people up with the commissioner rulings! Personally I think the Act needs an overhaul to fix some of its ambiguities. Well done!",
            "Why does the law care what floor a business is on? How did that bit even get written in there? I realize it's not exactly the point of your story but I'm so confused. Who wrote that law?",
            "[deleted]",
            "This makes me happy. I've seen so many small shops close because the owners got greedy and forced them out of business with excessive rent demands. Then the building sits empty for months while the owner awaits his big payoff.",
            "Can you update us on how the report to the commission went? :D",
            "Lmao I love that he was all for fucking you over by following the letter of the law riiiight up until it ended up fucking him and his client over, at which point he was all for just tearing up the lease. Fuck yea for reporting him on that, scummy fucks. Some landlords and their lawyers are the lowest of the low, so seeing them get boned puts a smile on my face.\n\nNice research OP! Hope (well I'm sure) the client was super thankful you were called in!",
            ">Me: \"sorry, that wouldn't be complying with the law would it?\"\n\nToo bad you can't take a picture and post it up here; I would love to see that 'surprised pikachu' face on the opposing lawyer!",
            "Attorneys like him are why people hate attorneys like me for no reason. Fuck that guy.",
            "[removed]",
            "Nice! Justice served through malicious compliance!\n\nJust curious, in your TL;DR, you said, \n\n> TLDR: lawyer tried to hardball my client, i proved his client committed a statutory offense and got what i wanted plus damages and dobbed his client in.\n\nWhat do you mean by \"dobbed his client in\"? Not familiar with that.",
            ">ill be reporting the breach to the commission\n\nDid you report the breach?\nThey must have screwed other tenants as well.",
            "I hope nice bloke went to all of the neighbors and told them about this little issue.",
            "I'm not smiling, I'm *smirking*.",
            "Nothing like imagining his smug face turn to an expression of shock",
            "Denny Crane would be  proud",
            "[Lawyered!](https://media.tenor.com/images/72f4c350fdd0cd5594106e7f7c9d3101/tenor.gif)\n\nI love this. I hope to take the jerk over the coals.",
            "Almost make me fail no nut November . You sly dog",
            "Lawyers and Military always have the best MC.  Just waiting on a military lawyer.",
            "Ok. I read this yesterday. Repost?",
            "Read the ~~transcript~~ lease!",
            "...don't forget to update us now...",
            "Way to stick it to the man, man!",
            "In the end what did the damages amount to? And what happened after they were reported to the commission?",
            "That lawyer is gonna get fired lol",
            "This deserves a xpost to r/prorevenge. Well played indeed!",
            "> bloke is stuffed. \n\n> stiff cheddar\n\nI love these phrases so much",
            "Beautifully played sir, you two deserve that win",
            "This is some real life Suits type shit right here.",
            "Get those damages, baby!",
            "Lawyered!",
            "You are beyond epic I love it.",
            "Your hired!!!! Not that you were looking in the first place. But I assume you know what I mean.......(great job)!",
            "Dang, thats awesome. I'm sure the book guy must have been completely over his head with stress. Kudos to you for kicking butt on his behalf.",
            "Stiff cheddar is my new favourite saying",
            "Justice has been served. Must feel damn good.",
            "Bada bing, bada bang, bada BOOM.",
            "So....what happened?Tells us the details of the results.",
            "God iv got a raging justice right now",
            "Are you Australian? What does “dobbed” mean",
            "Care you able to discuss how much was won? And the repercussions the ahole faced.",
            "Keep holding them to it!",
            "..., bitch! I love a good revenge story!! Congrats!",
            "Next level justice! Love it!",
            "This lawyer loves it.  Well played.",
            "Amazing. Lawyer and owner had it coming. You let them dig their own grave. This was a satisfying read, thank you.",
            "That's excellent.  Good work!",
            "That was kinda hard to follow (at no fault of your own) but I absolutely loved it! You gave them one final chance and then they back pedal so hard when shit his the fan. \n\nThank you for sharing!",
            "Epic mic drop. Well done. Glad the nice bloke got out of the lease. I hate dickish property owners.",
            "You saved a soul, thank you for that",
            "Loved reading this. Intensely satisfying.  Like a John Grisham book 👏",
            "tell us how this worked out in terms of reparations to Mr. Nice Bloke bookseller.",
            "This is one of my favorite MC posts I have seen. Bravo!",
            "Please have a poor woman's gold, good sir. 🏅🏅🏅",
            "Very satisfying. Just got a dopamine hit!",
            "WOULD IT!?!",
            "I just fell in love...\n\nGood job, lowly valuer.",
            "Love it. Once got told by an opposing counsel with significantly more experience, when I was still a brand new attorney, to go back and read the relevant act, because I clearly didn't know what I was talking about. \n\nSo, I did. And it turns out I didn't, but neither did he, and his failure to comply with the requirements of the act on behalf of his clients cost them the case and got him to humiliate himself in front of the judge.",
            "Oh this is better than anything at my job but shitting on people who threaten with legal action is my favorite thing.. I'm the end of the line when people call my company about an issue. There's no one left to be transfered to and I have the holy grail of perks.. I can and do hang up on people.. Dead calls, calls where its clear there will be no action moving forward just people who want to scream, I can hang up on. But my favorite are people, doctors and lawyers who call and think that if they threaten to sue that surely will get them what they want right away! No.. Our trained response and means of handling that is \" if you feel you need to bring legal action you are welcome to do as you feel is right, and I cannot offer any legal advise in this situation.\" oh wow. The best is that I go out of my way to sounds gleefully chipper when I deliver that line. I love it, as they always respond\" I don't think you hear me, we will sue! \" and the\" yep, you want to do that, do that. \" absolutely makes them bonkers and I get to hang up.",
            "LAWYERED!",
            "Nice",
            "Nice. How much is that stupidity going to cost the lawyer's landlord?",
            "Struck him right by his words.",
            "Are you allowed to speak about cases on the internet? Honestly asking.",
            "So client renewed lease, then ll jacked up the price? Seems grimey to me.",
            "r/talesfromthelaw",
            "[noice.](https://i.kym-cdn.com/photos/images/original/000/967/326/252.gif)",
            "How did they react?",
            "I usually just skim long entries, but you putting the tl;dr at the top got me really intrigued and I read the entire thing. \n\nYou have earned a poor man’s gold 🏅",
            "Was asked to review a lease. Did a poor job. Got told off. Went back and did the job you'd been asked to do in the first place. Congrats?",
            "law is such fuckery, I don't understand it D:",
            "I hope you did a happy little dance after that.",
            "I got the pleasure to write down \"Mr X can't even do hus job properly. As the kaw reads ...\" and other \"almost an insult thing\" in my conclusions.\n\nThe lawyer replies was all about fear and he asked that I was dismissed.\n\nI was so confident I would win this that I didn't even go to the trial. The judge and my binder was enough!\n\nNot a lawyer and had to study relevant laws while I had no heat at home during winter. I went to various bars to be able to read all these laws in a good working conditions.\n\nIt was in appeal because when we had a lawyer, we lost. I decided to ditch him and do this on my own. Judge was surprised twice, at that time and when I sent my conclusions. My friend living next to didn't tought I would go through and our neighbour neither did.\n\nThe other party lawyer was really fearing me and it was readable in its conclusions!\n\nI have to admit that when I read him, it gave me a boner and more willingness to crush him. So I did.\n\nMorale: don't fuck with people having more brain juice, it tends to end poorly!",
            "So it took the other lawyer telling you to read the lease for you to actually do it?  Shouldn't that have been where you started?",
            "And the tl;dr is at the top. Put this guy in the Hall of Legends with the others that do it that way.",
            "I’m not a lawyer.m but isn’t severability a thing in leases? Just because one thing is illegal doesn’t mean it invalidates the entire lease?",
            "This story is confusing. They told you that the act only takes what floor he's on into consideration if he's selling a service and not \"goods\" (could be on the friggen roof) so what statutory offence did the building owner commit?",
            "I find anyone who doesn't capitalise I and uses \"dobbed in\" unlikely to be more educated than a lawyer.",
            "Putting tldr made me not read the story."
        ]
    },
    {
        "post_id": "pv87sb",
        "author": "RumBunBun",
        "title": "Must Give 48 Hour Notice!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pv87sb/must_give_48_hour_notice/",
        "score": 14514,
        "num_comments": 519,
        "created_utc": 1632581484.0,
        "selftext": "It is NOT okay to print or record this content for use elsewhere. That means you, [**u/A\\_I\\_Reader**](https://click.redditmail.com/CL0/https:%2F%2Fwww.reddit.com%2Fuser%2FA_I_Reader%2F%3F$deep_link=true%26correlation_id=a39fb207-c6d3-4548-b3a0-6930d869674b%26ref=email_post_reply%26ref_campaign=email_post_reply%26ref_source=email/2/0100017c578395f5-e92adb4a-7bd9-48a3-b52c-28c0f6adeaf0-000000/cxVdA-NqsrfiPN4k_cjhWPW2YurFq3hqwsHJkCF50RY=218)\n\nWe’ve moved several times for my husband’s career, so I haven’t really had a career of my own, just a series of jobs. Some were great, some were crappy. This happened at one of the crappy places where I worked as a lowly customer service rep. I was late 40s, very dependable, and my manager Ann called me her ideal employee. Never had any customer complaints, never tardy, sick once in 3 years, submitted many time and money saving ideas, always worked late when asked. I  worked 32 hours a week, Monday through Thursday, so I was typically the one she asked to work late since everyone else was full-time and no overtime was involved if I worked a few extra hours.\n\nI was having migraines and my doctor could see me the next afternoon. I asked Ann if I could leave two hours early the next day to go to the doctor. She said work was slow that week and no one else was off, so yes. But since I was giving less than 48 hours notice, it counted as unexcused and I would get a written warning. I said that I was giving 24 hours notice and we were slow and fully staffed, so I just didn’t get why there would be a warning. (Four warnings in 6 months and you were  terminated. They didn’t care if you had a doctor’s excuse. Tardies were a warning, calling in sick, returning late from lunch. It was not difficult to get four in 6 months.)  Ann said that it was a matter of her having to shift the schedule around. It was inconsiderate to not plan ahead and she didn’t want to set a precedent and be taken advantage of.\n\nI went to the appointment, got the warning, and was ticked off about it. But I decided I would be happy to comply with their petty policy in my own malicious way. I didn’t have to wait very long.\n\nA couple weeks later, Ann came to me an hour before closing and said she had a stack of orders that had come in via Amazon and they needed to be put in that day. The phones had been busy, so the reps who normally entered orders didn’t get to them. Could I stay and put them in? I said I really had no other plans, but I’d been thinking about what she’d said about giving 48 hours notice when asking someone to change their schedule, and she was right; it does lead to them taking advantage of you. So I would be willing to stay late two days from now, but I can no longer stay late on such short notice. ”But, I didn’t know that I’d need you until just now!” “Oh, I totally understand. It’s like when I was having migraines and needed to get into the doctor as soon as possible. I think I deserve the same consideration that you deserve. If you give me 48 hours notice, I am happy to stay.” She was speechless. She had to pay someone else overtime to stay.\n\nA couple days later she thought she’d get back at me when she told me that I could not remain part time and would have to start working Fridays the following week. I calmly told her that the following Thursday would be my last day then. By that afternoon she changed her mind and I could stay on my current schedule.",
        "permalink": "/r/MaliciousCompliance/comments/pv87sb/must_give_48_hour_notice/",
        "comments": [
            "Sounds like a shitty boss who doesn't value people over  toeing the corporate line. It's really not that hard to be respectful and get the same in return.",
            "What’s with companies and stupid rules that have no flexibility. For some reason we love dumbing things down instead of holding the manager accountable to critically think about the nuance in each situation. That company doesn’t deserve you.",
            "No joke, this is seriously one of the best malicious complaint stories I've heard on this sub! This is so perfect, good on you for standing up for yourself! I love every single part of this lol!",
            "I love it! It's like she thought she held all the cards, until you lay down your hand and she had absolutely nothing.",
            "Honestly my hackles started to raise at “sick once in 3 years”.\n\nI’m not sure why attendance policies are legally allowed to punish people for being sick and it’s one of the harsh realities of labor abuse that makes me hate being an adult in the US.\n\nGood on you for turning her bullshit around on her",
            "[removed]",
            "Nice!  What a crappy boss - any \"manager\" who flouts authority because of legitimate health problems is simply a piece of shit.  Good on ya for standing up for yourself",
            "Yes! *This is so satisfying* ! I LOVE that she tried to punish you AND THEN YOU GOT HER *AGAIN* ! HAhaHAhaHAhaHAhaHA!!!",
            "Oh man, I just love the 'you have to come in Fridays.  Fine, Thursday is my last day' move!",
            "I had a job that tried to tell me if you were going to be sick, you had to tell them the day before.\n\nI laughed and ignored them. How the hell am I going to know I will be sick the next day?\n\nAnother time they told me that if I was going to be 10 minutes late, they would take an hour off my pay.\n\nI told them that if they're going to do that, then when I'm 20 minutes late I just won't come in instead. I don't work for free.\n\nThey changed their minds.",
            "\"since I was giving less than 48 hours notice, it counted as unexcused and I would get a written warning.\"\n\nStupid manager and a very stupid person. She had no reason to do that beside \"my authority\" and \"rules are rules\"  No humanity in her managing.",
            "Crosspost this to r/antiwork lol this is sooo satisfying. I love when managers realize that they can't bully you into doing their bidding, and that if you're unhappy with your job, you can just... leave lol.",
            "In my past I was a waitress at a top hotel serving breakfast/lunch. I got a call during my shift that my daughter was on her way to the ER. I told my manager that I had to leave quickly. She threatened my job but we were a union shop so I was able to look at her and say we will see HR when I get back. I left instructions for my tables and left. It was so satisfying. I never heard from HR.",
            "I’ve done something similar with a resignation threat. \n\nAdmittedly in hospo, but I was the only one front of house that had kids (all others were late teens, early 20s, except for one woman in her late 50s). \n\nIt was a second job (worked during the week) and my wife also worked during the week. I was asking for an average of one weekend off a month. \n\nAnyway, submitted a time off request weeks in advance. Made the mistake of assuming it not being declined (normally they are quickly if there’s an issue) meant it was approved. So I went and booked accomodation for the weekend. \n\nGetting closer to the date, I ask about it, passed around between managers a bit. Eventually one tells me that I’ve had too much time off recently. A few weeks back I would’ve accepted that and organised another time, but I had booked accommodation now. \n\nI promptly handed in my resignation and all of a sudden they were ok with me taking time off. \n\nToo often businesses/managers love playing the power game and treating staff as disposable, so it’s always nice to have times in your life when you can give it right back to them.",
            "I have actually had this type of issue with a doctors office.  They had a policy that there was a $40 dollar charge if you canceled an appointment with less than 24 hours notice.  There was a big sign on the wall in their waiting area about it.  So one day their office called me about an hour before our appointment to reschedule because the doctor had to run to their child's school to deal with an issue.  \n\nI had already taken time off in order to be at the appointment, and I remembered their policy.  I wasn't actually mad at the doctor, I understand that these things happen.  But if that was their policy, it should go both ways.  So when I came in for the rescheduled appointment and asked them how were going to pay me the $40 fee.  They looked really confused and I had to point out their policy that was prominently posted on their wall and remind them that they had canceled my appointment with only 1 hour notice. The receptionist finally told me that they would have to ask the office manager about it and they would get back to me later.  \n\nStrangely enough, they never did get back to me.",
            "I especially like that you told her you had no other plans, but wouldn’t stay anyway.",
            "Training your shitty boss is hard work.  She didn't learn as fast as some of them, but good work.",
            "I'm surprised you stayed.  People like that never change.  You might have got one up on her, but she'll mark your cards, bide her time, and treat you badly again.",
            "If they're just following the rules then they aren't managers. They're merely implementing what someone else thought up. A manager (possibly) paid more than me should be able to take my situation, advice or information and mull it over and make a decision.\n\nA computer program can implement rules and won't cost as much per hour.",
            "It's weird how all the managers on reddit proclaim themselves to be great managers and believe that they are loved or respected by their team.\n \nYou might well be the best manager in the world, but any time I've spoken to a manager who made such claims about their management abilities in the past, they were usually woefully unaware of how badly they were actually perceived by their team and were bordering on delusional.  Think about David Brent in The Office.  \n\nA quick anecdote - A now-retired manager, who was universally despised and ridiculed, often told me how wonderful he was and how much his team respected him.  I knew that he was a tosser but it was easier just to nod and smile whenever he started speaking to me and to look for my escape.  Eventually, two members of his team made accusations of bullying against him. When he sat down with the investigating officer, he immediately started babbling on about how he would be happy to give evidence against some unrelated party who was misbehaving.  The investigating officer had to stop him in his tracks and explain that he was the one who was being accused by his team members.  He was seemingly dumbstruck. \n\nSelf-praise is no praise at all.",
            "I'm sorry. I still can't get over merica work laws.\nWe just past a law for 10days sick leave a year. No questions.\nSeveral years ago we went from 15 to 20 days annual leave. We get about 11 stat days as well.\nIf they make you work on stats you get time and a half and a day off in lieu.\nIm sorry you have a shitty manager. I employ 2 woman in the trade. Plumbers. They work there asses off all the time.\nI give them all the time they want off. If their sick they better stay home. I don't want to get sick. I give them bonuses all the time for working above and beyond.\nThey could not work for 4 months and I still make money for 8 months.\nYou are only a shitty boss if you let yourself be a shitty boss.",
            "Fantastic.  Good for you for calling her bluff about Fridays as well.  It's funny how when you start to push back you find they will back down.",
            "Whenever I read something like this it makes me appreciate being Australian. My employer actively discourages any one coming to work if they are sick, even pre-pandemic. They take the view that you will recover quicker if you rest & they don’t want you spreading whatever you’ve got to other employees.",
            "you get a warning for being sick? wtf, ok Ann I'll come have diarrhea on the sales floor then",
            "Perfect using their shitty policy of requiring 48 hour notice against them.  \n\nAlso, policies like that are why overtime is counted per day, not just per week in my state.  Although I have also been unaware and a manager used that against me as at the time I worked Tuesday-Friday, so also 32 hours a week.  I didn't get overtime until a change in managers to one who followed the law.",
            "Yas this was perfect I loved every second of it ❤",
            "Yet another awesome boss cluelessly demoralizing their own workers. The fact that she tried to get back at you just shows her lack of remorse and I suspect gained little understanding from the experience. I really wonder what will make bosses like these realizing things. If you treat people like automatons, they will inevitably resent you, regret working for you, and look for ways to sabotage you and your plans, i.e. if they haven't left you already. And if you're a boss who didn't care, good luck.",
            "This one is really good because you were explicit in telling your boss the standard does in fact apply to her as well. And she backed down. 10/10 MC",
            "Good job stick to your guns give her the same treatment that she gives you because it is right\n☺👐🤗☺👐🤗",
            "Congrats!  You made it suck to be Ann!!  \n\n\nI hate people like Ann.  The working world is full of them, and they all need to be taught lessons in humility and consequences.",
            "48 hours of notice for a sick day is just ludicrously unreasonable.  \n\n\nMy employer lets you call in as late as 2 hours AFTER your shift begins, because they understand that a sick person, or a person in some other crisis, might not have time to call in the moment, might need time to address the issue at hand before worrying about work.",
            "That is a shitty way to run a business.",
            "I hope you still get out as soon as you can.  She sounds like a sorry boss and a worse person.",
            "> I calmly told her that the following Thursday would be my last day then\n\nYou pulled out her last tooth! Good one! LOL",
            "Indeed, warnings for sick days, let's further normalize going to work sick. FFS.",
            "You really should have quit anyway.",
            ">Calling in sick, even excused, four (4) times in six (6) months will get you fired\n\n\nSounds like something that should be illegal…",
            "That made me smile. Nice one OP 👍",
            "Amazing! Good for you, that story was supremely satisfying to read!",
            "You are my own personal hero.",
            "You are a great employee and you get treated like shit. Sounds like customer service.",
            "What a shitty company.  Policies like that are designed to make all workers' lives more unstable, to make all workers' wages lower, to make all workers suffer.",
            "Stands, applauds",
            "sounds like a someone doesn't like getting a taste of their own medicine. i love some pettiness",
            "And this is why I love being a unionized employee. That is such BS. Way to go.",
            "Hit them with their own BS hypocrisy.",
            "Good for you. You’re a role model to everyone around you.",
            "I asked to be scheduled for an early shift one day for a schedule had not yet been written. My request was declined. I went to my doctor and requested a note for 1 week off of work. \n\nBitch all I wanted was an early shift. But the manager always scheduled herself early shift.",
            "Hey boss, I’m gonna be sick on May 20th and November 12th.",
            "These are the kind of power dynamics that should exist in all work environments. If we want to maxmise the result of our work in general.\n\nSo many employers are able to hold their employees over the pit cause they know they've got all the leverage, thanks to legal environments and socio-economic circumstances.",
            "I think I love you",
            "Seems like a terrible manager and workplace.  What matters is getting the job done.  The manager is bad, and the company seems even worse.",
            "This is beautiful. Thank you for doing this and sharing this. And she thought she could make you work more. She is something else!",
            "Ahh! Malicious compliance in all of it's beauty. I loved this",
            "Sounds like another story of know your worth.\n\nKudos",
            "She tried to fire you too? So petty. Hope you found better op.",
            ">. I calmly told her that the following Thursday would be my last day then. By that afternoon she changed her mind and I could stay on my current schedule.\n\nOh no, what *ever* will you do without that job??\n\nSounds like they need you *wayyyyy* more than you need them.",
            "Dang girl, your so smooth.  Glad they boss knew not to mess with you anymore.",
            "Lmfao good for you! I hate when managers at silly customer service jobs take advantage of people like that and then make it even harder to work there.",
            "Life is truly beautiful when you don't need your job. I've been lucky enough to be in that position twice. I think if I was ever rich enough to never need to work again, I'd just make it my mission to find jobs like this and make the lives of shitty managers hell. Go on, write me up. I'll start pushing for unions and then just quit.",
            "I have said this before and I will say it again...Crappy companies do not deserve to survive!!",
            "i am old and comfortably independently poor. i work when i feel like it. it makes all the difference knowing that if i'm not having fun at work i can just walk.",
            "Similar thing happened to me; I was called in to the manager’s office and told that I need to give more notice for calling in sick (I get occasional migraines, and I had to take time off from work a handful of times in the past few months). I explained that I can’t give more notice because the migraines come on very suddenly (15 minutes or so) and last the whole day. She said something along the lines of ‘of course, that sounds horrible, I totally understand . . . but you still need to give more notice or come in anyway (when I get migraines I usually vomit, do you really want to get a health code violation just to spite me? (I work in a grocery store))’.\n\nWhen I told my boyfriend he said I should call up and tell her that I was planning on getting a migraine next Saturday, so I wouldn’t be able to work.",
            "You're her ideal employee, easily taken advantage of and doesn't stand up for yourself. Good on you for flipping it on her and sticking to your conviction when she tried to petty and take revenge. Guaranteed she internally lost her shit when you said that would be your last day.",
            "What a wanker of a boss.",
            "The last part of the story tells me that she didn't learn anything from your MC. Not only she didn't realise the policy suck, she tried to take revenge on you for following said policy.",
            "So this is how she treats her \"ideal employee?\" It's a paradox that employers are happy to exploit the good employees because they're the least likely to give them a hard time back.",
            "For anyone reading this days after it was posted: the trick is you ask for time off for medical appointments in 48h every day and then if you don't need the time off on the day of, you let your boss know you can work anyway. \n\nMonday: \"Hey boss, I'm going to need to see a doctor Wednesday afternoon, so I won't be in\".\n\nTuesday: \"Hey boss, I'm going to need to see a doctor Thursday afternoon, so I won't be in\".\n\nWednesday: \"Hey boss, I'm going to need to see a doctor Friday afternoon, so I won't be in. Also, I feel fine today so I won't be going to the doctor's this afternoon after all. I'll stay and work.\"\n\nThursday....",
            "And then they wonder why nOBoDy wANtS tO WorK",
            "Wait, if you take 4 sick days in 6 months you get fired? Where I live all employees get 10 paid sick days per year, by law.",
            "How can they give you a warning for calling in sick? If you call sick 4 times in 6 months they fire you? That’s not only petty but illegal and less than the standard sick leave (10 days/year) you’re entitled to anyway!",
            "I didn't give a shit about quitting I quit with email. Fuck that two week crap if the employer is treating you like crap",
            "This is pretty funny . But , I'm just curious,  why not submit a complaint about this boss to her higher ups? Would that not work? Idk.",
            "As the owner of a company, this is hilarious and sad. At least it reminds me to keep encouraging managers to use their brains instead of a protocol/algorithm for everything.",
            "I wish there was a sub for entitled bosses just so I can witness the thought process.",
            "Wow. And they wonder why people don't want to work these crappy jobs anymore",
            "This is point system. Points mean a place that uses them sucks and is basically encouraging turnover.",
            "Ghahahaha, that's great!!! \nWhat the fuck is so hard about respecting your employees?? Seeing and treating them as humans with their own lives??",
            "I wonder if I did that with my boss, in a third world country where I live, what would happen to me lol",
            "I hope you were able to find a better job than that crappy job with the crappy boss.",
            "One time, my ex asked to have a 5 minute talk with me about our daughter at the coffee shop connected to my office. I asked my boss because she was a major jerk, and she said no problem. I went, we talked briefly, and I went back to work (mind you, this was a desk job in a cubicle. I wasn't waiting on anyone - just computer work all day.)\nThe next day I got a written warning from the same boss, for going to talk with him.",
            "I loved my minimum wage job ngl. My deli manager was awesome and so were my staff, but the store manager has absolutely no respect and bc of this, so many people have left now. And respect is so easy to give, if anything, he goes out of his way to disrespect everyone. So strange, I'll never understand.",
            "\"she didn't want to set a precedent and be taken advantage of\"... Sounds like what they/you did to you...",
            "I sincerely hope you made that following Thursday your last day anyway.",
            "You shoulda call in sick for the whole day when you went to you doctors appointment. It wouldn't have gotten you any more written up lol",
            "I was smiling with glee as I read this. Thanks @op",
            "Huh is there anyone above Ann as I would reported this to her superior and see what trouble she can get into.",
            "Well played",
            "How the fuck is that not illegal in the US?",
            "You executed that beautifully.",
            "I used to work in the public service and we had a policy that declared all sick/medical leave as an unplanned absence. Even if you gave two month’s notice for elective surgery, it was unplanned leave. Even the initial leave for a birth was “unplanned”.\n\nManagers were marked down if they had a lot of unplanned leave in their staff because it was lumped in with people taking sickies and this was seen as poor management.\n\nIt was eventually changed, but some policies are just dumb.",
            "First time I've ever seen a boss tell an employee that they had to become full time. Most places try to keep their workers from even thinking the phrase much less saying it. I know it was mostly to get a rise out if OP but still could you imagine how it could be played out: \"Hey OP I can't keep you as part time so I'm making you full time.\" \"So you're gonna pay me more in hours/pay raise that normally attributes a status change and pay me overtime when you come to me for the extra work that's great! And when will my full time benefits go in?\" \"....nevermind\"",
            "This is a public forum. You can't just not consent to someone referencing your post...",
            "You should have said sure, but I am going to have to give the company a warning for not giving me 48 hours notice and that after 4 warnings in 6 months that you would quit.  See if they like their own policy in reverse.",
            "You should find a new employer. That behavior is unacceptable to have to deal with. Fuck that employer.",
            "a series of jobs is a career.",
            "If you an excellent employee, don’t piss them off!",
            "[deleted]",
            "power struggle much?\n\nif this was a bloke, I'd say \"pissing match\".\n\nthing is, with her backing down so you can stay on your current schedule, she has implicitly admitted that *you* have the power in the situation. If there *really* was a (new?) policy that you could not remain part-time, then she would accepted your \"last day\", and that would have been the end of it.\n\nI will say though, while you now have the power, your manager is going to go to extreme lengths to get rid of you - either by several more write-ups to terminate, or making you so uncomfortable as to quit.\n\nAnd 'tardies'? what the hey? are you in school?",
            "You should be a socialist. Seriously.  What you describe is their beliefs. Please read their ideology.  It contains such appalling ideas as universal healthcare.  For free. Like every other western country except the US. Weird thing is our healthcare is cheaper than yours (don't yanks love cheap) but better and for everyone.  For  Free. We pay a bit of tax.  You don't but your healthcare, not that it covers the poor ( those poor folk who wash your car, tend your garden, look after your CHILDREN)  You know those people you think you own because Americans love slaves. Literally or economically.  \n\n\n\n\nIf you are a Republican then hahahahahahaha  ha ha ha ha. \nIf you can find Donald's dick,  here is a microscope, ha ha ha.",
            "BaZingGAAA!!!",
            "Don’t worry, managers like this rarely last long. They can’t keep anyone on-side and end up turning minor issues into huge losses because no-one will help them. \n\nAnd they crash and burn so sweetly when their own bullshit lands at their own doorstep.",
            "I get phone calls from employees telling me they're going to feel sick next week from a shot they haven't had yet.",
            "Excellent.",
            "You're a star.",
            "Ann was a cu++ theres no two ways about it.",
            "😂🤣😂🤣 beautiful stuff here, thank you",
            "Yea Ann sucks",
            "Awesome. Love the ending where they try to get back at you & u just say \"fine i quit\"",
            "When will these managers realize they don't own you?",
            "I used to work at a 24/7 operation. You could do staff exchanges to get days off which is often the only way to get time off. I was scheduled for a double one Saturday. Friday night my toddler was up all night throwing up. I called in and said that I would miss the first half of my first shift so that I could get some sleep. The overnight supervisor even heard my little girl. When I get to work I was surprised that they would not sign my sick slip but that it would be considered an unpaid and unexcused tardy.\n\nSo much for being a team player. Never again.",
            "Scheduling is difficult. Don’t get me wrong.  But sometimes you just have to work through it.  People need to handle their affairs  and it’s not worth fighting people over it.  Migraines are one of those things that will sideline you from anywhere between an hour to a whole day, or longer.  Prodrome symptoms, in my experience have been mainly hindsight, and do not give warning \n\nI have only had to turn down time off when it was really, particularly unreasonable.  And even then I tried to be flexible and ask them which days they need off the most and which days they can do a half day, etc.  I know it may not be popular to say that around here but 99% of the time you can honor time off, but there will always be a 1% where you just can’t",
            "What kind of stupidity is that? Telling someone who knows better that they can't remain at the position of their choice because YOU say otherwise? Like they get to dictate whether or not you stay in your position regardless of your opinions like you're some 16 year old that brainwashes themselves into thinking that they HAVE to do it."
        ]
    }
]