[
    {
        "post_id": "9lb0iu",
        "author": "enjybanjy",
        "title": "Want to squeeze every penny? Go ahead, but it'll cost you.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9lb0iu/want_to_squeeze_every_penny_go_ahead_but_itll/",
        "score": 14517,
        "num_comments": 580,
        "created_utc": 1538652404.0,
        "selftext": "I'd like to preface this post by saying that both my ex and child are in a very comfortable situation - money has never been an issue and my kid is well looked after, fed and generally very well cared for. At no risk whatsoever.  I have also never missed a child support payment, nor do I intend to.\n\n&#x200B;\n\nHowever...\n\n&#x200B;\n\nMy ex and I have been at odds for a couple of years now about the custody of our kid. She's repeatedly lied to the court, made fake reports to the police, filed for restraining orders, the whole 9. None of this has worked - I've been battling it by being consistent and defending myself.\n\nOne of her tactics has been to set her lawyer after me to demand every penny for every little thing.\n\nI started a new job back in January, with which came a nice pay rise. I told my ex of this, she did nothing - she would have received the increased child support payment following the next tax return anyway, so no bother. However, in the most recent conflict we had, her lawyer picked up on my \"change in circumstances\" and demanded that I adjust the child support payable with immediate effect, as opposed to at the end of the tax year. I am not legally obliged  to do this, however I comply - like I said, I'm happy to pay child support and it'll reduce conflict.\n\nNow here's the kicker. I've just received my annual pay rise: 2.1%.\n\nGiven my ex's stance that I absolutely must inform her of any change in circumstances, I have sent these details over. However this equates to roughly only $2 a month difference. What this has done, however, is cost her about an hour's worth of time with her lawyer to calculate the difference, at roughly $300/hr.\n\nThe time to recoup this legal cost with increased child support?\n\n12 and a half years.\n\n\nEdit: a lot of comments about 2% being only $2 so I only pay $100. No. My annual salary has been increased by 2%, not my child support payments. It just so happens to work out to a $2 difference. Believe me, I pay a LOT more than $100 a month!",
        "permalink": "/r/MaliciousCompliance/comments/9lb0iu/want_to_squeeze_every_penny_go_ahead_but_itll/",
        "comments": [
            "My ex is the same. She got a letter from her lawyer to avoid paying $30 towards a musical instrument for our son. They exchanged 3 e-mails plus he wrote the letter. He also charges well over $350/hour. ",
            "I'd like to ad a similar story\n\nSo for a while I was dating a girl who had a child and her baby daddy was a real jerk about child support.  From what I remember, support is calculated based on the difference in pay between the two parents.  It was a simple formula the court used there was no arguing what the amount should be.  She got a new job that came with a small raise.  This got him excited thinking he would get to pay less in support.  To get any change in support both parties share the last few pay stubs and support is recalculated.  When he takes her to court because of her raise he failed to realize that he had also got a raise since that last calculation and his support payment went up not down.  ",
            "The real MC is the lawyer. He's making all kinds of bank",
            "I just got divorced. I told my ex if he just gave me the house, which we had about $80k in equity in, I wouldn't ask for child support. I didn't want to deal with it. We put a clause into the divorce settlement that any large expenses for our daughter over $100 would be split in half, but other than that we could just part ways. ",
            "So much yes! My uncle's ex was like this. Wanted EVERYTHING split, and even took him to court to get him to pay half on a car FOR HER because \"the girls will drive it someday\". The local family court had to finally tell her to stop filing for everything and grow the fuck up. I mean the lady would send receipts for vacations her and her new husband took the kids on, groceries, etc. Expecting him to pay half, since their divorce decree said that since they had 50/50 custody, they would split expenses related solely to the girls. \n\n&#x200B;\n\nIt was a long 20 years for my uncle, and he's so far behind in his own life with his wife and kids because of this woman.",
            "[deleted]",
            "This reminds of a story English football coach Harry Redknapp told in his book *It shouldn't happen to a football manager* about his attempt at fining Neil \"Razor\" Ruddock while manager of West Ham United\n\n\n***There were reports Neil Ruddock had been in a fight with Mike Newell at Gleneagles golf club. The issue was that he was supposed to be ill, or having treatment, and not playing golf before going out drinking.***\n\n***\"So I fined him a fortnight's wages. I thought that would be straight forward enough but he appealed and we all ended up having to go to an FA tribunal.***\n\n***\"Razor turned up with some Australian barrister, who looked like a film star and was the cleverest boy I've ever met. Within minutes, he had us tied up in knots.***\n\n***It was embarrassing. Razor won the case and the club was forced to reimburse him.***\n\n***\"Then the barrister turned to Dave Richards, who was chairman of the Premier League and on the FA's board and said: 'Thank you Mr Richards, I'm afraid I don't come cheap' and he handed over a bill for £30,000 to Dave Richards, who said: 'This is not a court of law, we don't cover costs.'***\n\n***\"Razor's face was a picture. He had to pay, and his barrister was charging him more than the fine, £30,000 instead of £20,000 fine. Unlucky, Razor.***\n\n\n\n\n",
            "This would fit in /r/pettyrevenge also",
            "My dad recently passed away and I been thinking about some things lately. I lived with both parents off and on after their divorce, I was passed between them and used as a bargaining chip so they could manipulate each other and try to get more money out of the others. I moved away when I was 16, went and lived with a friends family two towns over and commuted to school every day. I was lucky I got out when I did. My mom, she’s a child - still at 52 she’s a kid. She’s never grown up, it’s all about her. My dad was a tool, chain smoker, big man but weak minded and can’t say no. I remember vividly when I was 7 after a Christmas play, they stood apart from each other and made me choose which one I wanted to live with. I picked my dad, and my mom got into crack and got an abusive husband, he put me in the hospital one evening when I was visiting - he cracked my head open by smashing it into the corner of a windowsill. I still have the dent in my head, I’ll forever have the headaches. I don’t talk to my mom much, my dads family hasn’t contacted me in 18 years. Ugh, parents who only use the kid as a way to attempt to make life difficult for the ex is the saddest thing - you never realize who the REAL victim is.",
            "Lol that's pretty good! ",
            "I'm not gonna comment on your choices or situation but it definitely rings a bell with me, too.  Ex cares more about screwing me out of visitation and kids no matter the cost.  I've always paid, I've paid when I was going to school and I paid when I got out.  I paid more, I paid more often, anything that needed to happen.  All she cares about is trying to screw the kids out of their father.  I did the \"malicious compliance\" and fighting thing one time when we were getting a divorce.  It cost us both tens of thousands of dollars we didn't have.  Now I'm all done with all that bullshit.  Be as petty as you want, I literally don't care about you.  Just my kids.  Helps me focus on the days where it seems like nothing is going anywhere with her.  Do what you can, stay strong.",
            "Hahahahahahahahaha!!!\n\nThis is soooo petty I love it!",
            "[deleted]",
            "Penny wise and pound foolish! ",
            "Based on your willingness to give child support and their extreme pettiness to exttact money from you, something tells me their desire for money isn't to spend it on the kid.",
            "My ex and I divorced with two daughters in 2015. 50/50 custody, week on week off style, holidays are alternating except i get all christmas eves and she gets all christmas days after 10am.\n\nNo child support either way, we make similar amounts, within 3k a year or so. My only requirement is to carry the girls on my health insurance and we 50/50 medical bills and basically everything else.\n\nI was an awful piece of shit husband at the end, and she was an awful piece of shit wife, but we are good parents who love our children.",
            "When I got divorced, I used our state's online guide for calculating my support payments. I included my annual bonus and came up with a number. Their online calculator also said to not count what I paid for the child's medical insurance. It even had field where you filled in what you paid and it deducted it from the payment automatically. I talked to my HR department and they told me how much it was to cover just her. I pay a little over $400 a month for both of us and her part was like $230. So I said I was only paying $230 on their calculator. I took this amount and started paying.\n\nFast forward a couple of months and my ex's friends tell her that medical insurance shouldn't be included (even though everyone I talked to at the state and their website as well as websites of local divorce lawyers say it is). She kicks off an automatic re-calculation of child support with the state.\n\nI have no input in this process other than to try to dispute the results at the end. So the state contacts my company and they send over what the state asks for. My monthly wages and my insurance payments. But my bonus isn't part of my monthly wages (it's a fluctuating annual, non guaranteed bonus). And they ask for my total insurance, so they get the total that includes me (which is over $400 paid). \n\nSo my payments dropped a couple hundred bucks a month because she didn't think she was getting enough and her friends tried to tell her something that wasn't correct. I could've contested the results at the end, but I had tried to pay the other amount once and the state said otherwise. Who am to argue with what they found? \n\nBesides, that letter from the state saying \"support order contains a valid order for medical insurance coverage\" to prove her wrong after months of arguing that insurance is part of support was worth more than the financial savings. ",
            "> must inform her of any change in circumstances\n\nThat's an awfully broad statement. I'd send her lawyer the deets anytime I started buying a fancier brand of toilet paper",
            "I could be wrong about this as it was a long time ago and 5000 miles away, but I recall my brother was paying child support to his ex \"under the table\" for awhile. She, being one of the least likable people I've ever encountered, was demanding more. When she \"threatened\" to get the courts to rule on it, my brother was all for it - because it turned out he was paying her *more* than she was legally entitled to. Didn't work out how she'd planned.\n\n",
            "Reminds me of my friend's deadbeat dad not wanting to pay child support so he takes his mother to court and wins.  However, during the proceedings he notices that he owed about 10K in not paid child support. \n\nMy friend was 17, I'm pretty sure it wouldn't have amounted to that much even without lawyer fees.",
            "I worked in family law and dealt with a man who's ex girlfriend would file as many motions as she could come up with in hopes of raising his attorneys fees so high that he would just give up and give her what she wanted. (she wanted full custody and about 90% of his paycheck for child support.) It got to the point where she paid people to lie and say they saw him assault her to try to gain sympathy from a judge. In the end, her friends decided $100 wasn't worth the potential perjury charge and admitted they lied, she went to jail and dad wound up with full custody. He ended up racking in nearly $1,000,000 in attorneys fees. He didn't have to pay it all back as we gave him lots of discounts and he traded construction labor with the attorney and remodeled her house. \n\nAll these years later the mother has started up again. The child is ten now, hadn't seen his mother in years before she demanded visitation.  She showed up three times before flaking out and he(the child) is furious with her for doing this to him.",
            "It's a bait and she took it, brilliant. Fully her fault. Did you already predict this when you told her about the raise?",
            "Never stick your dick in crazy, kids ",
            "A friend of mine doesn’t have that much money. \n\nHe had an outside arrangement with his ex wife that he would pay her however much he could, seeing that he wanted to provide for his son. Even so, the wife would every so often request  more money for a new sneaker(suspiciously expensive). And even so, my friend would oblige.\nBecause of exchange rates, let’s just say he gave her 200$, sometimes 400$, sometimes 200$ with 50$ for school material.\n\nNow he doesn’t have a regular job, since he is a house painter. Whenever he had a productive month,  he would give what he considered excess to his son, \n\nThe ex, however, got greedy and wanted even more, so she got a lawyer and went after him.\n\nNow my friend has to pay 200$ legally because he doesn’t have a steady job, and rarely pays that “extra”",
            "One of my ex girlfriends was going through boot camp.  We had been dating for 4 years prior.  I went up for her graduation and we spent the day together.  She had told me that she will \"reward\" me for waiting the 3 months or what ever it was.  She rewarded me quite well.  Through the rest of the day she kept hanging out with her battle buddy and conversing with him more then me.  Being the naive moron I was, I thought it was just a bond they had formed.  Turns out it was a different bond.  I didn't find this out until I broke it off like 2 months later.  She had been a complete ass recently and I said fuck it, I ain't gonna be yelled at over the phone because I didn't call her the night before after working a 16 hour shift.  A week later she's engaged and pregnant.  A lawyer gave me a ring calling for child support, claiming that I had gotten her pregnant that day during graduation.  I got my own lawyer and fought it.  She continued to fight it for about a year.  Now, my lawyer was a close friend of mine, practically a family member so he was fighting this pro bono.  About a year into it after the kid was born, she requested a DNA test.  Test came back and proved she was having an affair with me while in the military.  She spent every penny she had, and proved that she had been cheating on me, in a court room full of both families, after a year of being full of herself.  My lawyer friend told me the outcome was better then paying what it should have cost me.  I'm actually now dating her ex best friend.  We had met during the court battles and hit it off when she bought me an apology beer.",
            "I used to do family law, and exes like yours are a chunk of why I stopped. So much pedantic shit like this plagues that field. It's important work and it's good work, especially in situations with a deadbeat parent. But damn does that get hard to see after a while of dealing with people like that.",
            "if youre friends with your boss, you should ask for a 1% raise next month and a 2% pay cut the next and a 1% raise again the next.",
            "Ex wife of my brother in law has done similar.\n\nHe is a pot head who cant function without believing the mary jane will solve all of life’s issues.\n\nHowever, she cheated on him, and had two sons. No paternity test has been taken for these two. They got a divorce. My BIL never fought the paternity issue, and paid child support. He loves his kids. She married the other guy, “ex”-gangsta coke dealer from CA.\n\nShe has gotten restraining orders, she lied in court documents about his income so he had to paid more, took away all visitation, had the two oldest (daughters) both get emancipated, she refused to show up to court hearings if he was present, and claimed all four children on taxes(against court orders for 21 years total from when the oldest were children to the two youngest who are still in  high school). Essentially with the tax claims and child support over payment and the rights she stripped away illegally with visitation and the false restraining orders, my BIL has now overpaid by $150,000 or so. She now is calling for a truce and for bygones to be bygones.\n\nAnd yesterday one of the sons filed for emancipation!",
            "This isn't a material change in circumstances. In most states (presuming US, but you say \"rise\" so maybe UK), only the judge can order a change in support, not a lawyer. She'd have to drag you back in front of the judge to make a change (or try to make you arbitrate, to which you refuse) then you'd go to court and the judge would ammend the order if they chose to do that.\n\nEdit: I only say this to suggest you not be bullied by her lawyer. Make him work. He wants that because all he cares about is getting paid, and you want that because you don't have to interact with her directly, usually.",
            "These are the things that make me deathly afraid of getting married. It honestly seems like a death trap of pain and regret and burden and financial ruin",
            "This is genius and I love it. Especially since it will probably happen again next year.",
            "Women who use children as weapons to hurt the father should not have them, really hate it when they pull shit like that",
            "How is that not proof enough for a judge to hand you custody?  If a person doesn't have the sense to do basic math they probably shouldn't have custody of a child.",
            "Ask your employer for any and all raises to be split amongst 12 months... you'll get a marginal raise and she'll get a major bill",
            "My first marriage I had no kids. And no money. No savings. Just a mortgage. \n\nI called a lawyer and he said we’d be dumb if either of us lawyered up. I let her take anything she wanted. But she still tied the divorce up for two years (she initiated the divorce to date a new guy). During that two years, I got a promotion and started investing in a 401k. I think I had like $6,000 or something. She got half. But with tax penalties she only got like $1,000 or less.\n\nHer lawyer I’m sure cost $5,000 if not more. I had the cheapest divorce lawyer in the county and I paid like $3k. ",
            "Friend of a friend and spouse elected to go through financial separation. The one spouse was using an attorney and to be safe the other spouse got a different attorney.\n\nEntire process was actually relatively smooth and amicable except for the second attorney. When finally told he was being fired, he insisted \"No,\" he'd be putting more associates on the case to get more money from the other spouse.\n\nThey finally had to sue that guy to get him off the case.",
            "Here are some wise old quotes you may / may not have heard before that I think should be reminded:\n\n\"Hell hath no fury like a woman scorned.\"\n\n\"Stupid hurts.\" (... And an erect penis [or youth] isn't exactly very smart.)\n\n\"Children will ALWAYS screw up your love life.\"\n\n\"A vengeful woman who is filled with hate will drag you to hell if for no other reason than to have some company.\"\n\nQuotes were approximately paraphrased (without credits).\n\nNow, maybe, you can put it all together and make some sort of sense out of it all. Maybe not.\n",
            "My mom recieved child support payment and spent them all on booze for herself. Kind of wish that the courts had just let my dad keep the money saved in a college fund for me.",
            "Your ex sounds like the malicious one.",
            "I love it - entirely her choice as to whether to get petty or not - if she does, it'll cost her!",
            "Nice. Though you know that extra money you’re giving her probably isn’t going to the kids right?",
            "LPT - forever alone has huge benefits",
            "Alright, I can share one of these.  My ex was, as the rest say, a piece of work.  (Thank the goddess she finally calmed down.  This was years ago.)  She was a stay-at-home mom so it's only fair she gets half of everything.  Split the 401K: we each get $25K.  \n\nSo after the divorce she forces the split.  But I took a loan from that account to pay for my lawyer.  I borrowed half.  (Lawyer was only $5K, the rest was for expenses like furniture for my new house, etc.)  She ended up with half the **available balance** (and I have no idea how much her lawyer cost).  She got $15K.  If she waited another 6 years for me to repay the loan she would have gotten another $10K and it wouldn't have cost her a lawyer.",
            "Unfortunately, some people get more invested in fighting their ex than thinking about their kids. My ex insisted on fighting over everything and my kids would say, \"It seems like Dad doesn't want us there, he just wants you not to have us.\"",
            "My ex and I have actually never consulted a lawyer. We've always managed to work it out. Winning has never been part of the equation (for more than a few minutes). As such we have a well adjusted child and have managed to remain friends after a fashion.",
            "/r/talesfromthelaw might like this one too",
            "2.1% = $2 per month? ",
            "Coming from a mom who was shafted by the ex who skimped on work AND from a wife who saw my husband robbed blind by his ex (she got 50% of everything he made), I say Bravo! I mean you're paying more than your fair share. She wants to be spiteful and squeeze you dry? Let her feel the burn for once.",
            "I hope my life never becomes so petty. ",
            "12 1/2 years to recoup the cost. Will the child be 18 before than making it a partial loss?",
            "While I generally agree and applaud this, I do have experience with vindictive people. She is going to pay for her lawyer out of child support. So everything you cost her will only take away from your child. At least, that’s what I see happening. ",
            "Joke's on you. It's not about getting money. It's about hurting you, and burning money if necessary to do it. ",
            "My ex (I'm the male) has yet to pay any child support in 17 years. A man would be in jail without a license etc etc but the state has no issue with it. \n\nFunny how that works.",
            "Hey OP. I’m a divorce child whose parents went through much the same situation as you. My mom through everything she can think of at my dad to try to get him out of our lives. From pushing her down the stairs (the minutae changes every time, once it was when she was pregnant with little sis, then it was when holding little sis, etc) to sexual assaulting me and my sisters. Please don’t stop fighting, my dad is everything i want to be as a man and im so glad that he never stopped fighting to be involved in our lives. even when it meant driving hours both ways to pick us up for the weekend or even just to have dinner with us every week. ",
            "Penny wise and pound stupid.",
            "This is like having some tasty sauce on a dogshit sandwich.",
            "All this quarreling is making me glad my dad died and i got left with one parent, shit i though i had rough. I hope you figure things out, sounds very emotionally draining.",
            "I agree - I’m not going to tell my daughter any of the details. As far as she’s concerned, me and her mother aren’t together any more, that’s the end of it. Hopefully by the time she’s old enough to ask, everything will have settled down.",
            "How does a raise of 2.1% only net you $2 a month? Are you making $100 a month??",
            "After 25 years I called time on my marriage. Left everything as I had a house I was renting out with an 80k mortgage.  I never took anything. We agreed i would have my old home and he would keep the current one. I just wanted out. Managed to stay friends although it was hard at first. Met and married although my ex hasn't. It's a shame when couples start slinging the mud you should remember happy times together and not dwell on the not so happy times. Life moves on. I hope we will always be friends, and I'm glad I've got a chance  of being happy again. I feel blessed and very grateful for a second chance. ",
            "Perhaps she was hoping you’d ignore the letter and then she’d have reason to drag you into court for failing to respond.",
            "I really wonder how some people be like \"Hey let's make everything I can to be a bitch even if it doesn't gain me anything\" \n\nWonder of the world..",
            "[deleted]",
            "For some people it's not about the money, it's about \"winning\" ",
            "Apparently there’s one sucker in this relationship and it isn’t you.",
            "Take her back for more time with your son. Represent yourself. No need to have  lawyer in this regard. ",
            "I tried squeezing a penny and it bruised my hand, thanks",
            "This thread has made it click in my head my mothers a bit of a dick towards people...... No wonder i dont like being around her much. Band mouths my sisters dad my dad and our step dad when he's not in the room...... No wondor i was planning on asking him if i could couch surf over the breaks frow uni when i go instead of the spare  room at my mums",
            "Yeaaaah...\n\nThis seems less like she wanted more money, and more that she wanted to attack you and \"win\".",
            "Ok. I have just seen a lot of vindictive mothers misuse child support and as a child of one, I don’t like seeing it. ",
            "/r/NOMAAM",
            "I love this. My mom did similar things to my dad. He would have killed for the chance to do something like this. Good on you! ",
            "Marge, it happened again!",
            "I thought this was going to be a story about people literally squeezing pennies and I'm actually a little dissapointed",
            "You must’ve really pissed her off AND she’s the kind of person to hold a grudge. Question? Has your taste in women changed for real? Or has the pendulum swung opposite destined to swing back someday. Signed, truly interested. ",
            "I love it. Haven't read all of the comments yet, but you aren't even accounting for the time value of money yet. If we assume $24/yr period (without that annoying monthly compounding interest) we can take a simplified perpetuity formula where present value = cash flow/interest rate. If we assume an interest rate of 10%, then she will only effectively receive $240. More reasonably, if we assume an interest rate of 5% then the most she will effectively receive is $480, with the lawyer receiving 2/3 of that.",
            "...seems pretty clear why you're no longer with her, if she's like that. What a *bitch*.",
            "Whats the problem with people. \nafter break up you dont have to be an asshole\n",
            "Kinda similar story with my mom.. I have a sibling who has a different dad. My mom was married to this man and they eventually got divorced. He was my step-dad for a long time but I never liked him. My mom’s lawyer discovered my sibling’s dad had been paying less in child support than what he was supposed to for all these years (his calculations were 32k less or something.). My mom tells him and he says he’ll give my mom 20k, and give my sister 10k who is going to college. My mom says no and takes him to court. Well their calculations were off and he only owed her 16k. And now my mom has to pay court fees. ",
            "I wonder if you shouldn't fire back a bit with that information. I mean, ultimately that $298 could have gone to the kid.",
            "May god be on your side, Sir",
            "Not all heros wear capes.",
            "[deleted]",
            "A situation in which you both feel as though you won! ",
            "These titles are always so corny"
        ]
    },
    {
        "post_id": "ua2gbt",
        "author": "DistrictEquivalent79",
        "title": "You want to talk to MY manager? OK...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ua2gbt/you_want_to_talk_to_my_manager_ok/",
        "score": 14517,
        "num_comments": 705,
        "created_utc": 1650709621.0,
        "selftext": "  \n\nThis happened about 13 years ago. I was a field service engineer for a national retail chain. Basically, I was the IT guy who drove around in a company vehicle, servicing the computer networks in the stores. The way the company was organized, there were “corporate” employees and then there were “retail” employees. Being a “corporate” employee, I received corporate stock as a small part of my salary. And my starting pay was three times the rate of any store manager. Because I was always “putting out fires” I often found myself in the awkward position of dealing with store managers who honestly thought that they were the store owners, and that I was just the hired help…\n\n(This was truly ironic, as I actually did own a very small piece of the corporation, whereas the average store manager did not.)\n\nOne day, I got orders to replace a server in a store not too far from my house (I worked out of my house, but kept parts in the truck...and also the back room of another store nearby). So I show up to the store where the server needed to be replaced. It was my 2nd stop of three scheduled that day. I walk in the store wearing my very obvious corporate uniform and name tag with logo. The store owner (errrr…retail manager) instantly DEMANDS to know WTF I am doing in “her” store. I get this all the time, nothing new. I calmly explain that my boss wants me to upgrade one of the store servers (hardware replacement) and I even show her where it is that I will be working. I explain that it will take about an hour, and that the (POS) registers might go offline for about 5 minutes. \n\nShe isn’t happy, but she reluctantly allows me into the room where the server is and I start working. When I’m just about done, the (POS) registers go down as I am switching them to the new server, which is not fully hooked up yet. It was at this point where I realize I have forgotten to bring in a couple of cables that I need to finish hooking the new server into the store network. So I RUN out to the truck to get the required cables. I’m gone about 2 minutes.\n\nWhen I get back the store manager is sitting at the table in front of the server, and she’s got food spread out all over the table. The server is under the table. I tell the store manager I need to finish hooking up the server (gesturing under the table). The store manager tells me I’ll have to come back in an hour, after her lunch break. I’m shocked into total silence. Then a cashier bursts into the room, panicked that the registers aren’t working…and the checkout lines are getting backed up.\n\nI explain to the manager that I have to fix the server now, or the registers will not work. The manager tells me I should have thought of THAT before I started working in her lunch break area…\n\nI calmly tell the store manager that she’ll have to take a break later, or find somewhere else to eat her lunch. She tells me I’m rude and incompetent and DEMANDS to speak to MY MANAGER, immediately.\n\nHokey Dokey…\n\nI call up my manager using my corporate-issue iPhone, and quickly explain the situation, and then walk into the server room to hand the iPhone to the store manager. While she’s on the phone with my manager, I head out to the front of the store to explain (and apologize) that the registers are going to be down for a few more minutes. I can’t hear exactly what the store manager is telling to my manager, but I can tell that it’s a heated conversation and I clearly hear the word “fired” mentioned a few times. It’s clear that the store owner (errrr, retail manager) wants me to be fired for daring to try to interrupt her lunch break. Unfortunately for her, my direct supervisor was about 5-6 levels above the retail district manager. So the store manager was complaining loudly about \\*interrupting my work\\* to the manager of her manager’s manager’s manager’s manager’s manager’s manager.\n\nA few minutes later the store manager walks out of the room awkwardly balancing bits and pieces of her lunch spread. I immediately go back to work getting the new server up and running and re-booting the POS registers so that they will sync on the new server and cashiers can get back to work! Everyone is happy now except the store “owner”, because her lunch break was ruined. \n\nThe main part of my task is done now, but it takes me about another 15 minutes to clean up my mess and re-organize my truck to get ready for my next stop which will be about a one-hour drive from my current location. As I’m doing this, I see the retail district manager (I’ve met her before) going into the store. She walks back out of the store with the former store manager, who is carrying a box of her personal items.",
        "permalink": "/r/MaliciousCompliance/comments/ua2gbt/you_want_to_talk_to_my_manager_ok/",
        "comments": [
            "I've learned that if a company trusts someone with their servers, they are much farther up the ladder than me or at the very least, much less replaceable",
            "So let me get this straight... the store manager actually prioritised her lunch over getting the cash register online? No wonder she got the sack 🤦🏻‍♂️",
            "I am very fond of my lunch breaks. But I definitely would not use it to peevishly keep someone else from getting a job done while screwing over my staff and customers.    I bet you grinned the rest of the day. Haha",
            "There's an important question that hasn't been answered... did someone go 'wa wa waaaa' on a trumpet while she was carrying her personal items?",
            "Wow, imagine how much shit would have hit the fan if you actually left while POS was down so she could finish her lunch.\n\nAnd not to mention if anything spilled off the table and onto the server.",
            "Only way this story could have been better is if you very sweetly offered to help carry the box to her car.  \n\nLove this mate.",
            "There is something about retail store managers, deputy managers, floor managers, section leaders, etc that plays on their ego and lulls them into thinking they are the Senior Leadership Team.  No! Your job is to merchandise the way HO tells you to, sell the stock HO sends you, wear the uniform HO gives you….  \n\nI have done my time in retail! 🤯",
            "What a great MC story. Don't you just love it when people get high on their perceived 'power' and destroy themselves? Beautiful dumpster fire.",
            "My question is why did the store manager have no idea that you were coming /that a server needed replaced. It seems like that should have been communicated down the chain at some point.",
            "I'm curious as to your management structure. Most corporations have issues if your bottom employee is more than 6-7 rungs from the top boss. More rungs than that usually means you just have fat in the system and are paying people to hold a title that doesn't need to exist.",
            "My favorite part of your story is her being escorted out the door for being a Karen.\n\nYou reminded me of a personal story:\n\nEarly in my career, while coding in a (my employer's own) proprietary scripting language that is remarkably related to Java, I failed to include a closing tag on a script.\n\nIt created an endless loop on a service that literally ran constantly, never allowing it to complete its scan and move on to the next one: frozen in place.\n\nRedundancy is a good thing, so when that server popped, of course, load balancing, etc., kicks in, no interruption of service.\n\nUntil my accidental endless loop stopped an entire room of 100 racks dead in its tracks.\n\nMeanwhile, I had long since checked in my code, moved on to the next task, ended my day and gone home.\n\nAt 11pm, I received a phone call from the company CIO.  \n\nMind you, I was an entry level developer doing the most mundane and least dangerous types of work, and I suddenly found myself on the phone with (follow the bouncing ball) my manager's> manager's>  executive director's> Vice President's> President's> CEO's> Chief Information Officer.\n\nLaughing like a madman, he informed me I had accidentally \"discovered\" an error in the primary System that allowed my little missing closing tag to not only get checked in, but deployed...exactly as it was.  *Of course bad code should not even be permitted to be deployed, right?* In the end, the endless loop shut down production for the entire company for a total of 12 hours until my missing closing statement was discovered.\n\nThe fact that a guy fresh out of school had the capability to literally shut down the company amused him no end.\n\nStrangely enough, I ended up working there six years and reaching management level myself before moving on.",
            "Never. Mess. With. The IT guy. \n\nShe got fired by thinking less of someone she might have considered a nerd at school. She straight up lost her job because of snobbery. Add a dash of pride and gluttony. Bon appetite, Karen.",
            "My first thought was why the server wasn’t replaced when the store was closed or during a less busy time to avoid backed up register lines and angry customers.",
            "There are entirely too many managers in this world. Corporate structuring is such an expensive joke.",
            "When freshly installed as a supervisor I had my entire labeling and inventory tracking systems go down at 3:30am on a weekend. I wasn't familiar with the \"movers and shakers\" associated with IT at the time, and my production floor was getting a bit beat up with parts(around 25k parts per shift, 30-ish operators) so I hail-Mary'ed the IT group email.\n\nGot a response from CORPORATE CEO the SEE-E-OH of it all. A billion dollar company. He explained that the outage was from Mt. Olympus and I should have been informed of it by my managers and things would be back before 6:00am. When I saw who he copied in the email I just about shit myself. My plant manager, HR manager and my direct manager....none of which were terribly happy that I had poked the biggest bear of them all.\n\nI met said CEO a little later and he was a sweetheart and got a good chuckle out of my description of my reaction when I saw his email back to me. I think he likes to rattle the cages of the despotic manager types at his companies. I now have a direct manager that will answer the phone at any time, any day when he sees my name pop up. I don't know what the CEO said but it sure left an impression.",
            "She demanded that someone get fired and got her wish.",
            "That last line turned this story from a pouty manager sulking into a giant mic drop.",
            "How did this manager not know her store would have a service interruption during the business day? Does IT just show up with no warning and take down a store? Sounds like failed communication processes followed by shitty entitled manager tantrum",
            ">manager of her manager’s manager’s manager’s manager’s manager’s manager.\n\nIt's a wonder you guys manage to get anything done.",
            "Imagine being so arrogant that you make yourself lose your job because you're trying to flex your 'power'. I'm assuming that some, if not most, of the workers in that store were happy to see her go.",
            "Not sure if you realize this, but she was probably a terror for everyone who worked at that store, and you're probably a local hero for saving the rest of the employees from continuing to have to deal with her.",
            "I realize it's a massive time waste for someone that much higher up the ladder, but firing her for one screw up (however obnoxious)? I get the feeling this was not the first issue to come about with her.",
            "I can’t thank you enough for telling this story without using the word “Karen”.",
            "Who gets a one hour lunch break in retail?",
            "Funny how I read POS very differently than intended in this story",
            "I can't believe the district manager was: A. Close enough to the store that they could drop everything they were doing and get there within 15 minutes and B. That they were able to fire the store manager and walk them out within that same 15 minutes. You sure it was only 15 minutes?",
            "Always take your lunch break.\n\nNever take it in someone else's work area.",
            "Wow -- harsh! But former ~~store owner~~ retail manager showed disregard not just for you and the proper operation of the store, but her own cashiers! Tried a power play, but without the actual power.",
            "It sounds like the store manager didn't know you were coming to work on the server. That's a big fail. I wouldn't have let someone I don't know near the server without confirming the service call, no matter how they were dressed or what ID they showed.",
            "The real question is, why was the server under a table where people ate?",
            "Did she do anything to the corporate iphone?",
            "Where I work we have a dedicated server room, but something is overheated or broken constantly and it always has an alarm going off 24/7. Building tech dept is on another floor and doesn't have access (they are in charge of AV and laptops), the IT dept in charge of it have their own building across town and never come to our building unless something stops working. So it just sits in there and wails for attention in the dark.",
            "[deleted]",
            "I seriously don’t get people like that. I would be DELIGHTED to have someone show up unprompted and give my branch new hardware. \nLess chance of breakdowns during a rush. \n“Oh! NEW server?? Only down 2 minutes?? Right this way! Can I get you a soda??”",
            "What's most impressive about this story is the fact that it took all of 15 minutes for the district manager to show up and fire the store manager.",
            "I worked in a grocery store for six months. In our chain anything preventing sales was the number one crisis, and I'm guessing it's that way in most retail environments. Our manager would have done anything possible to keep out of the techs way.",
            "I would have struck up a conversation with the two of them. \n\n“ Sorry it took me so long to get the point-of-sale systems back in order I hope everything’s all right now.”",
            "This sounds more like a fuck around and find out  I don’t see where the malicious compliance is. Yes taking to the manager but malicious ..?",
            "I don’t feel bad for her at all. If she would have just been reasonable this never would have happened.",
            "\"LET ME SHOW YOU HOW IMPORTANT I AM\"\n\n\"*no! not like that*\"",
            "I missed it. Where's the malicious compliance?",
            "Why they keep servers under the table?",
            "Last part sounds like bs but the rest was good.",
            "Why would you kill The POS during operating hours? \n\nThat makes no sense for routine maintenance",
            "I wonder how she tried to spin this story for her friends and family when she told them she got fired.",
            "This made me think of: *Quem Iuppiter vult perdere, dementat prius* - Those whom Jupiter wishes to destroy, he first deprives of reason",
            "... why was she eating in the server room ?",
            "13 years ago was 2009 btw, for anyone thinking it was mid 90s.",
            "the server room however small or big isnt meant to be eating lunches - if you spill something over etc ,for this reason it will always be marked as no food ,drinks -no exceptions .\n\nA choosing beggar who just took it to the extreme ,to abuse someone who was just doing his job",
            "I used to do this type of work for a large retail chain. We normally did server swaps over night. I was the field guy for the Southeast. Must have been a smaller retail chain to have you do it in the middle of the day. But yeah I have seen that level of incompetence. It is their personal fiefdom.",
            "The audacity of that manager.  Holy hell.  Glad she got fired.  If she was treating you like that, I can only imagine how badly she treated the rest of the staff.",
            "Well, at least she’s getting that break she wanted.",
            "Nothing says exploiting workers like firing them for stupid shit like this.",
            "Wait so your saying that the manager got fired 15 minutes later?",
            "Important lesson to all you store managers out there.\n\nNever\n\nEver\n\nEver\n\nEver\n\nEVER\n\nFuck \n\nWith\n\nCorporate",
            "That had better have been some AMAZING food she was having for lunch, if she was so adamant about it that she threw an epic toddler tantrum and lost her job for it. #dipshidiot",
            "this sounds like a specific retailer that begins with B and ends with Y",
            "Ace King and a Queen on the flop. Chip leader goes all in and this bitch calls with a 7 and a 2.. smh.",
            "Idk what POS stands for but read it as Piece of Shit the entire time\n\nPOS register",
            "I can't believe you didn't take a picture of the picnic and send it to your manager.  It would be worth a thousand words!",
            "I just don't believe this happened, that she was upset you'd be booting down her POS but then set up her lunch in two minutes and refused to let you get the POS working again, despite customers being upset. None of it makes sense, and you write the situation like she was trying to get fired for unemployment benefits or something",
            "End is a lm unnecessary elaboration. Even if she had been fired there is no way in hell it happens that fast. Why do people lie on here?",
            "I'm curious what the terms of that many levels of managers are. Above store manager you have district manager, and then my mind immediately goes to next level being ceo.\n\nWhat's the actual progression?",
            "Yeah the manager here was way out of line,\n\nBut mostly this story makes me sad for the way that corporations treat their retail operations.\n\nIf retail is where your money is made, the people there should be given a lot more respect.\n\nAnybody from corporate showing up at the store, the person running the shift at the store it should be notified in advance and treated with respect, even if that person barely qualifies as a supervisor. \n\nRetail people are the ones who make corporate paychecks possible, not the other way around.",
            "I was mostly with you until you got greedy at the end.  That this single incident would lead to her firing without any formal report or investigation is not believable - corporations like this have specific procedures in place to minimize liability when an employee is terminated, and those procedures wouldn’t be circumvented because she pissed off one manager, no matter how far up the corporate chain they are. Even if this was a fireable offense - which for most companies it wouldn’t be - the turnaround simply wouldn’t be this quick.\n\nTo say nothing of the fact that the odds that her district manager was able to drop everything in the middle of the day *and* was within a half hour or so of the store are pretty slim to begin with.",
            "Meh you sound like a pain. Who even says ‘I actually did own piece of the corporation’ by being just a measly stock holder, and stocks that are given as part of employment. I’m sure the store manager was wrong but I bet your im better than you attitude didn’t help the situation",
            "I'm impressed that the district manager got right on this and sacked that fool.",
            "LOL, I love how she hanged herself :D",
            "What a nightmare. The only thing I saw from her POV was someone she didn't know coming in to work on her servers (because people can get official looking uniforms), but I'm willing to bet she got an email about the visit and/or a manager under her knew about it.",
            "u/DistrictEquivalent79 this definitely also belongs in r/TalesFromTechSupport! Love the comeuppance at the end!",
            "It costs nothing to show and receive respect.",
            "This is just asinine, I’ve managed stores for years and at no time did I consider them mine. My corporate overlords made it clear I was just there making them money. They loved I was good at it, and didn’t do stupid shit like screw with our HR and IT; I treated IT like gold, and all my shit got fixed or replaced with no fuss or delay. Occasionally I did things that irked my boss, but when those decisions work out and make your boss look good, suddenly they become best practices lol.",
            "Why would a person so high up in corporate level would even bother with that shit, be there in under a few minutes to personally fire some random storeowner just to have the privilege of escorting him out just in time for you to witness. How fast did that person pack their personal belongings? Did that last part of the story really happen?",
            "I mean... I don't get it. Power to OP for not having to deal with her anymore...but like seriously if ya know the stuff the IT guy is working on is IN your office...don't take your lunch there.",
            "I cant believe you get treated like that upon showing your face to a store. Why in the world do they hate you? I have never in my life had someone ask me \"what the hell are you doing here?\" But it sounds fucking awful. Ever thought of wearing a bodycam upon arrival to these locations?",
            "I would've laughed in her stupid fucking face. One of those posh Disney villain laughs, too. You're a bigger man than me.",
            "“You should have thought of that before working in my lunch break area.”\n\nLady, it’s your store! The inconvenience is all yours! I’m sorry but my mind is blown at this stupidity.",
            "Pro tip: It helps to know POS is Point-of-Sale and not Piece of Shit while reading this. Both kinda work though",
            "“Manager” honestly doesn’t even look like a word anymore after this.\n\nAnd hell yeah my dude, well done. That is an absolute W on your side. 👌",
            "Goodness. There are some people who learned inconvenience and accept that life will at the very least sometimes have it, and there are some who learn inconvenience and then try to obliterate it the moment they have an ounce of authority.",
            "That is many levels of management.",
            "Are they even allowed to have a food spread or take lunch breaks in server rooms. From what I understand, server rooms are meant to be completely isolated and air conditioned.",
            "Why are some people so distant from reality?",
            "It anazes.me that the manager thought it was ok to eat in the damn server toom!",
            "I mean I get it that she was rude and unpleasant but you seem to be the kind of guy that doesn’t respect anyone in a lower position than you. Just because “you make three times her salary” and she’s “just a retail manager” doesn’t mean you automatically get to be all high and mighty either",
            "8.3",
            "I’m not sure why corporate doesn’t notify stores when they have someone coming to work on their computer system, which handles highly proprietary information - not only the store’s/company’s, but credit and account information of customers.  If I were the manager and some stranger came in wanting access to anything containing store data, I don’t care if they have the store logo tattooed on their forehead, I would be on the phone to corporate in a hot second while a trusted employee babysits the stranger, not letting them out of their sight. I would always give corporate a piece of my mind for their sloppy security procedures.  I would want your name, employee number and your company photo texted or e-mailed to me, which should have been done when setting up the appointment for your work.  Without that, you would not get within 30 feet of accessing anything in “my” store.  Anyone can steal a uniform and have credentials printed up.  \nIn my opinion, you have an overblown sense of your importance.  You’re a hired hand, a cowboy riding the line, assessing the herd, mending fence and making sure things are kept up the way the owner/corporate wants it.  You are no more an owner than a store manager is (if they are employees rather than franchisees), who very well may be getting profit sharing and stock options.  \nThe main fault lies in corporate’s sloppy management and your hubris.  The manager was also a dick for getting in a pissing contest with a hired hand trying to do their job, but prior notice and scheduling a time for the work would probably alleviated most problems.",
            "With you on 98% of the story and happy to see the entitled idiot was dealt with but…shouldn’t anything that takes down the POS system be done after hours, or at least at a slow time of day, and certainly not during the lunch time rush. Sounds like the whole company is a little lax on prioritizing customer service. And dude, have the cables with you when you’re about to essentially shut the business down for a while.",
            "Hate to lose a hard worker like that.  At least she can enjoy her future lunch breaks in peace, just her and her 7 cats.",
            "The problem here was performing server work in a retail outlet during retail hours. Terrible scheduling.",
            "I’m surprised they’d schedule your time to bring down systems during sales hours and not tell the store manager. You don’t deserve to work under those conditions. Sounds poorly run. I hope you’re somewhere else now.",
            "If it was me the second time she said I would have to wait till her lunch break was over, I would of just went “ok” and sat in my truck (or went to another job) for an hour. See how well ‘her’ store does with no cash registers.\n\n(And if after that hour she demanded I quickly fix it I would of said “well now I’m on my lunch break’ and make her wait another hour."
        ]
    },
    {
        "post_id": "ixz70s",
        "author": "GreenEggPage",
        "title": "You must actually teach on the last day before Christmas break",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ixz70s/you_must_actually_teach_on_the_last_day_before/",
        "score": 14484,
        "num_comments": 467,
        "created_utc": 1600818614.0,
        "selftext": "This story comes from my favorite teacher in high school, Charlie. The time was the 80s. He was a chemistry teacher. Mild, short man. But devious. If you tried to take a nap during his class he would just keep talking, walk over to the ammonia bottle, wet a rag, and drop it beside your head. All while acting like nothing was going on.\n\nCharlie, for quite some time, would let students have fun on the last day before break - until the principal told him that he HAD to teach the kids something. So he complied. He set up an experiment for that day. The ingredients included: sucrose, glucose (in solution), protein pellets, and (I had to look it up) 4-hydroxy-3-methoxy-benzaldehyde.\n\nAs the students happily performing their experiment, the principal sticks his head in the door to ensure that Charlie is actually having them do something productive and is happily surprised. Charlie fills him in on the experiment (in big scientific words). As the principal is about to leave, he remarks, \"why does it smell like peanut brittle in here?\"\n\nAnd every year after that, we made peanut brittle on the last day of class for the semester.",
        "permalink": "/r/MaliciousCompliance/comments/ixz70s/you_must_actually_teach_on_the_last_day_before/",
        "comments": [
            "My almost retired chemistry teacher would teach us about:\n\n-How skiing works\n\n-How to establish a still\n\n-Is it flammable? And how?\n\n-How explosives kill people and what the dead bodies are like afterwards\n\n-How many people would sniff a rag with butyric acid hung in the hallway with a sign \"do not smell\"\n\nAh yes. Mr. McCoy was an interesting old coot.",
            "Nice.  I was expecting something more like \"OK, today they'll learn about nitrogen triiodide.\"",
            "Your experiment came from this paper: \n\nPARTIAL THERMAL DEGRADATION OF MIXED SACCHARIDES WITH PROTEIN INCLUSIONS ©1973, Revised 1991 \n\nWhich I think was inspired by a paper written at MIT.\n\nYou can find this document using Google. It's a fun read.",
            "r/deliciouscompliance",
            "[deleted]",
            "I've done this experiment many many times. My lesson came from a 1954 textbook by esteemed chemist Betty Crocker. The first time was small (2 batches), the last year I conducted the experiment it was something to the tune 125lbs (50 batches). Would give it as gifts, take it to work for both shifts, even would drop off about 10 lbs at my dentists office (big hit there). I had to stop due to carpel tunnel, too painful to properly agitate the solution.",
            "My AP teachers in high school did something similar. All of them figured that if you took the AP test, that was like a final for their class. The administration said the HAD to give us a final. \n\nMy AP physics final was building a popsicle, glue, and rubber band catapult. We spent the last day of class launching whatever we could find. My AP chem final was a very easy quiz and each student had to bring in one item for the final group experiment (pre-determined by the teacher). Some of the items were milk, chocolate chips, sprinkles, cocoa powder, etc. We made liquid nitrogen ice cream.",
            "Don't forget the sodium hydrogen carbonate. It's important for the final texture (highly recommend, but not always included).\n\n> glucose (in solution)\n\nModern procedure calls for fructose, glucose 55:45 aq. (80~85° Brix) due to availability.",
            "We used to make hokey pokey at the end of term in both physics and chemistry.",
            "Protein pellets. HHahahah",
            "In history class, the last week before high school graduation, we learned about every event in Billy Joel’s “We Didn’t Start the Fire.”  Still one of my favorite school memories.",
            "Hahahha awesome! When I was in school the last day was always reserved for fun. In elementary , santa would go round and hand out lovely big candy canes to each kid and we would make a Christmas craft.  Jr High, we were free to roam from class to class playing board games we brought to school and sharing Christmas treats. High school was just pure freedom. Board games, extra treats in the cafeteria, a movie in the gym.",
            "You left out a few ingredients, but here is the entire protocol.\n\n[http://ccchemteach.com/wp-content/uploads/2013/12/PeanutBrit.pdf](http://ccchemteach.com/wp-content/uploads/2013/12/PeanutBrit.pdf)",
            "My fourth grade teacher was a lot like your principal. At the beginning of the year she gave us a booklet and a calendar that she had printed.\n\nThe booklet contained classwork that she expected us to do EVERYDAY, including during holidays and SATURDAYS in EVERY SUBJECT.\n\nIn other words, she had us do class work six days a week and even if there were snow days, we were expected to do homework. We had to take all of our school books home every day during the winter months to make sure that we didn't miss anything, whether we had homework in that class or not to make sure we didn't miss out. That year, we had nearly a month of snow days and didn't get to enjoy much of it at all.",
            "Your teacher was Mr. Dude from recess",
            "A few years ago our district said our class parties in elementary had to include core learning...sounded daunting until we realized how many basic skills could be turned into a game, treat, craft, etc.",
            "My school tried to pull that shit one year, it must have been when I was in year 10. Every single teacher for the day picked movies and used the most roundabout justification for why we were watching it. We had to take notes home if the movies were over a G or PG rating for our parents to sign. I remember my religion teacher saying we were watching Ferris Bueller's Day Off to learn not to lie. In history we watched Gladiator to find anachronisms. I don't remember it happening in year 11, so the school night have learnt it's lesson from the barrage of permission slips they had to print and sort through.",
            "I was expecting a big boom.\n\nI still liked the story",
            "My chemistry teacher did the same thing but with making icecream (using salt to make it cold)",
            "Was expecting him to give a lesson on how to look productive whole being lazy, this is better",
            "[Where's the kaboom? There was supposed to be an earth-shattering kaboom!](https://www.youtube.com/watch?v=t9wmWZbr_wQ)",
            "Our chemistry teacher always had one day where we learned about the properties of NaCl and how it lowered the freezing temperature of water, and so he brought in an old fashioned ice cream churn, the kind you hand-churn and you surround the main container with salted ice, and we made homemade strawberry jam with fresh cream and fresh strawberries.  He was a great old-fashioned dude but that was a lesson none of us forget haha!",
            "I wish I knew what peanut brittle was before arriving to the conclusion.",
            "What Johnny thought was H2O, was H2SO4. Now all that’s left of Johnny is a spot upon the floor.",
            "Same deal. We made ice cream.",
            "This is like if Breaking Bad was about peanut brittle instead",
            "My Chemistry teacher did the same thing.",
            "Ahh pre y2k were the days...hit the top...and now the Rollercoaster down for fun in school...",
            "My Dad was a chemistry teacher too. We made ice cream to study the effects of temperature on a solution.",
            "I had a great chemistry teacher like this. On the last day of school, we would tie-dye shirts and make ice cream. He was the best.",
            "My Chem teacher had us make fudge for the very same reason!",
            "My chemistry teacher in high school had us make candy canes on the last day of class before break. It was great.",
            "This can probably also fit in r/deliciouscompliance perhaps?",
            "My chemistry teacher does the same but with sherbet. Damn chemistry teachers are amazing",
            "Nice. One of our \"experiements\" in Chemistry was making s'mores!",
            "Cooking is chemistry. I'm all for this.",
            "Seems like a “win” for everyone, including the principal. Creative Compliance?",
            "Our chem teacher use to use a small bottle of formaldehyde and tun it under your nose if you fell a sleep in his class. I told him never to use it on me as i am allergic to it, makes me projectile vomit... he did not believe me until i fell a sleep in his class, he found out the hard way i was not lieing, he was covered in vomit and i mean head to toe!!! After that no more vials of that shit!!",
            "What a legend",
            "For us it was pulling taffy in the typing class.",
            "“Protein pellets.”",
            "Eyyyy awesome chem teachers! Mine let us make s'mores for an experiment, make ice cream, and brought in liquid nitrogen",
            "On last day before christmas break my chem teacher made gunpowder in a mortar and set it on fire... Boom.  \nThree classes had to evacuate for half an hour while the smoke dissipated. That was a fun day.",
            "That’s an awesome teacher",
            "More wholesome compliance rather than malicious, but still awesome",
            "At one point my highschool chemistry teacher had us running around with hypodermic needles full of a cyanide solution.  Technically it was so we could inject them through rubber stoppers into sealed environments for some experiment, but mostly it was idiots waving deadly weapons near each other.\n\nShe also had us put balloons over beakers that had reactions that released hydrogen gas, then lit the balloons on fire taped to the end of a yardstick.  With the lights off, 3 foot wide ball of fire.\n\nI don’t think Ms. Kirkpatrick cared much about the administration or what we were officially supposed to be learning, but her class sure was a blast.",
            "Ours had us make laughing gas. Funniest day of my life.",
            "Mans a genius.",
            "My HS chem teacher wasn’t the same brand of awesome, but I remember having watched a movie at that time where they mixed x & y and it exploded. So I asked her if that would actually happen with those chemicals.\n\nShe said, “I don’t know; let’s find out,” and immediately pulled the appropriate bottles from the shelves.\n\nIt didn’t, sadly, but I’ll always remember her readiness to blow stuff up in the name of science.",
            "Would have done meth. Put blue dye in it.",
            "I don't trust my cleaning skills enough to be willing to eat that peanut brittle from school equipment.",
            "[deleted]",
            "It's great to see traditions kept up.  My teacher would have us make peanut brittle on the last day of school.",
            "An old science teacher used to let us make hokey pokey (honeycomb toffee type stuff) on the last day of each term. So good.",
            "We had a very small group in the college partnership high school chemistry class during my senior year, maybe 6 kids. The teacher would go through the lessons that the college sent over and then we would do cool stuff in the labs, like make ice cream with salt & ice, tie-dye, mix certain esters to smell like cola, and make soap.\n\nShe had us present an experiment to the younger grades as a major project. Every single one of us picked an experiment that we could somehow light on fire. I made sterno and used a pH indicator so it turned pink when it solidified. Then I tested it and got to set it on fire in front of the class.  Good times!",
            "Brings back memories of the weird \"flame tests\" we got to do in Chem during the final few days before a break (i.e. will it burn and what color and does it give off 'fun' smoke). \n\nSomeone thought to \"try\" a desk \"covered\" in Hexanol later in the year during the hydrocarbons module.",
            "My chem teacher had us measure how fast snow melted one time.",
            "My chemistry teacher was also the forensic science teacher. If you volunteered to be a dead body you got extra credit.",
            "When I was in eleventh or twelfth grade (are that junior and senior year?) my chemistry course consisted of for students who needed the subject but not the grade. The teacher knew that and we had a lot of fun. On the last day before Christmas break he brought some red wine and built a small distillery for demonstration, while the wine distilled we watched a movie and I then sadly had to leave for our Christmas volleyball tournament in town but word is every student got to taste a small sample of what had transpired.",
            "My high school chemistry teacher did the same thing but with candy canes.  I remember them being much more malleable and honestly liked them more than the real thing.",
            "In my high school chemistry class, we polymerized a disaccharide the last day before winter break. (Made hard candy.)",
            "All my chemistry teacher accomplished was get fired by burning a bunch of kids in an experiment",
            "I'm jealous, our teachers made us clean out the classroom on the last day of the year!",
            "Really cool and clever of him. \n\nPeanut brittle FTW",
            "Sounds like a Christmas elf",
            "Unexpectedly wholesome.",
            "Thought that he would teach how to make N-methyl-1-phenylpropan-2-amine.",
            "Not gonna lie, was expecting motherland style - produce alcohol.",
            "Haha, I had a teacher who would so fun experiments as well like creating (and testing) napalm or dropping a big chunk of natrium in a nearby river 😆",
            "Ah yes the 80s. When peanuts weren't classified as biological weapons in schools.",
            "Is there a sub for Delicious Compliance? Cause this sounds like Delicious Compliance.",
            "Reminds me of making Honeycomb Toffee on the last day of term with our Chemistry teacher every year.",
            "We made that our first day of high school chemistry.  Needless to say,  every class after that was a disappointment. \n\nI'm a teacher now and I never use my most fun lesson first.",
            "We did that in chemistry too, but it was just near the end of the year, not as malicious compliance!\n\nThe last step just said \"come to my desk for the last item, and don't tell anyone what it is.\" It was peanuts.",
            "This is more like r/wholesomecompliance",
            "I thought it was going to involve measuring colligative properties of an aqueous solution of sucrose as a function of the solute mole fraction, and the properties of menthyl acetate and related terpenes.",
            "'Protein pellets' -- I like that. \n\n:)",
            "Our chemistry teacher let us make peanut brittle on one lab before holidays and ice cream when it was getting super warm and near end of year. She was awesome.",
            "My chemistry teacher, back in 1973, had us make candy canes!",
            "Now that's a teacher.",
            "You guys are lucky, mine just showed us how to make Meth",
            "What's that last thing in the list?",
            "We made peanut brittle on the last day of chem in 2001 :)",
            "That'll teach him the importance of seat belts.",
            "Ö4u4ö",
            "That was so cool!! I was expecting it to be something foul, like a stink bomb!!",
            "Let's make mnt!",
            "Our fun lesson was Fe2O3 + 2 Al → 2 Fe + Al2O3",
            ")-,",
            "Principal wins this one.  Looks like not only did the teacher teach you something, you still know it today!",
            "Maybe she can eat that chip on her shoulder",
            "I had not thought about chloroforming them...intriguing",
            "What's malicious about this? He just taught kids how to make peanut brittle... I don't see the maliciousness here."
        ]
    },
    {
        "post_id": "ztw07r",
        "author": "Ok_Present_6508",
        "title": "Started doing less work because my foreman made it clear he wanted “quality” over quantity.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ztw07r/started_doing_less_work_because_my_foreman_made/",
        "score": 14469,
        "num_comments": 416,
        "created_utc": 1671838601.0,
        "selftext": "I was working in a metal fabrication shop and we were repairing a bunch of parts that came off the robot. Basically there was quite a bit of work that went in to each part but there was about 12” of weld that the robot couldn’t do that we had to do by hand, and they had to pass ultrasonic testing. \n\nSo I was getting 10 parts done in a shift as well as 120” of weld. While they guy I was working with would get two parts done and 24” of weld. \n\nOne Friday the foreman comes over and asked the other guy if he wanted to work Saturday but not me. I asked if he could use my help too and he said, “No. I’d rather have guys working Saturday that can pass their UTs 100%”\n\nI pointed out that not only did I do 5x the work but I passed about 99% of the time. I would fail about 1” of weld per 120”. AND I’d have it repaired and passed before the end of the shift.  This still wasn’t good enough and basically told me it doesn’t matter since I’m still failing. \n\nSo come Monday I only started completely finishing 2 parts a day and got my passing rate up to 100%. Foreman comes over frantically in the middle of the week trying to find out why my productivity has decreased so dramatically. And I said, “Sorry boss. I was trying to work on my pass rate.”\n\nHis face got so fucking red it was hard to keep a straight face. But I started getting Saturday work after that.",
        "permalink": "/r/MaliciousCompliance/comments/ztw07r/started_doing_less_work_because_my_foreman_made/",
        "comments": [
            "Same thing is happening with me atm, I'm in a call centre. I do about 300 less calls per month than I used to but all my targets are green so they think im doing well. \n\nJust got 'best in the team' 3 months in a row.\n\nUnethical life pro tip: become good at the one job everyone hates doing and then you can fuck around for the rest of the day cause people think you're a major asset.",
            "Just curious, but if I was the foreman, I think I'd be having you doing 11 parts a day and getting Slowy McSlowman to fix the 1 part that failed per shift... more productive.",
            "I worked at a place that did electronic assembly, this was back in the through hole days when things were wave soldered.  If you have never seen this the boards ride on a metal belt in frames and they pass through a few tunnels with heating elements to pre warm them, than go over a flow of liquid flux, and than go over a flow of solder.  After they are soldered they go through a couple more heat tunnels to control the cool down and someone takes them off the end to wash the flux off and they are on the way to QA and test and troubleshoot.  When the system was well tuned it worked quite well considering how low tech it was.  The conveyor had knob on it to control the speed, the heat tunnels, and waves had simple thermostats on them.  We had one guy who could really get it running well and turn out nice looking pieces.\n\nWhenever he would be out sick for a day, or god forbid, go on vacation for a couple of weeks, the production manager who had the brains of a ferret would start optimizing the process.  He would crank the temps on everything up and speed the conveyor up.  He would be happy as a pig in sh\\*\\* until QA had a look at the boards,  Normally most of them would be fine and a few would get little red arrow stickers pointing at things the folks in re touch would have to fix.  And most of the boards would pass test and troubleshoot.  Not after he tuned it though.  Every board would have tens of things that needed to be cleaned up by hand and many of them would fail on test and troubleshoot, and they sucked because most of the time it was not component failures, but solder splashes, some of which could take a long time to find.\n\nHe got 20% more boards over the wave and he had like a 70% failure rate that cost much more than just doing it right the first time.",
            "I only mow grass as part of my job, not rocket science. Spring came around after a long winter. Every time I was going to mow, it rained and I had to wait for it to dry out. The grass kept growing on the sunny week-ends I wasn't there.\n\nIt normally take four days to mow the entire place, but...that's when the grass is normal height. It was now a jungle. A monday finally arrives when the grass is dry, and I am slated to mow until the entire facility is done. Three times that morning my boss said \"I'm really gonna need you to hustle today\", as if I normally pick my nose and scratch my ass every day. \n\nI'm the best they ever had at this because I'm not trying to impress him, I want to impress his boss, who is a cool guy. I felt insulted.\n\nSo anyways, I mow faster than I normally do (riding mower) and it jostles a lot when I'm riding over bumps and dips. The first day I mow around the main building because that's the one thing most people see if they stop by. At the end of the day, he chews me out for the low quality. I know that it will look better the second and third time I mow that year, but he had specifically emphasized that he needed it done as fast as possible.\n\nI'm familiar with the ol' bait and switch. Also the \"I never said that\" routine. Well, guess what? this May, I'm going to pre-emptively tell him that I clearly remember how much I disappointed him last year, and this year its going to be all quality all the time.\n\nHe gave zero f\\*cks about my sore back, so this year I give zero f\\*cks about going fast.",
            "From original post.\n\n“ I would fail about 1” of weld per 120”. AND I’d have it repaired and passed before the end of the shift.”\n\nWhat am I missing? I see a 100% pass rate.",
            "Tangentially related http://theoryofconstraints.blogspot.com/2007/06/toc-stories-2-blue-light-creating.html?m=1",
            "Reminds me of working customer support and getting lectured because my quality was considered around 85% (this is a job where you have to deny people service so yeah you get knocked down pretty easy) but had a quantity that was higher than anyone in the entire company. (I also got investigated for cheating somehow for several months >.>)\n\nManager started in on me that I need to take training by a person thats been there for two months has a 100% quality but does 1/8th my productivity. \n\nUltimately just told the manager that if I barely did any work I would also have much higher quality and he went back to his office.",
            "Is it easier for you to focus on passing rate like your coworker, then your more productive methods?",
            "Did the Boss do anything to the Foreman?",
            "Reminds me of an old post where a welder applied for a job at a new company. He did two welds as examples of his work. The first was sloppy and amateurish. The second was pristine.\n\nThe boss looked at them and asked, \"What is *this?* Why is that one better?\"\n\n\"The first one is $19 @ hr. The second is $28 @ hr.\"\n\n.... one way to negotiate a salary. ;-)",
            "I would be willing to bet the guy doing only 24\" of weld a day would have a lot more failures at 120\" than OP",
            "TBF, if you're not compensated for the extra work you do, then the bare minimum seems like an appropriate response for bare minimum pay.",
            "Is failing a UT particularly costly? If it is, then I could see a problem, but you make it sound like you just fix it and send it on its way again.\n\nLet's do some quick math. Assume a part takes 1 hour. If it fails UT scan, it takes you some amount of time (x) to fix. Other guy works at 1/5th the speed, meaning one part takes 5 hours, but he never has errors.\n\nWith a 1 in 10 failure rate, that means on average 9 parts take 1 hour and the 10th takes x hours. Your partner, to make 10 parts, takes 50 hours. That means that, for you to be equally efficient to your partner, each error would have to cost you 41 hours of work to fix.\n\nUnless there's some expensive material cost or something, I can only imagine your boss might be trying to flex numbers (\"my workshop's error rate is less than so and so percent\") or something.",
            "[deleted]",
            "Correct me if I'm wrong - if they've been checking the welding with UT, that means it's not some metal fence, right? I'm not an expert in welding, but from where I come from there are specific welders with certification (NAKS or something) and when they weld they also put their own seal on every place they weld as a guarantee that it won't break and doesn't have problems. So that's basically 10 out of 10 perfect welds or you're not working with that level of responsibility. What's wrong with doing everything good from the first run, if you actually can do it? It's still manual labour, so eventually you'll get up to speed, but this time without placing people who will use these parts in risk by your \"fast\" approach. Just raise the price for your work",
            "Sounds like you need to find another workplace that’ll appreciate your skill and pay more. Don’t waste time with people who abuse your skill and dump more work on you without paying you proper for it",
            "The problem with chasing performance metrics is that too often they measure the wrong thing, or they get interpreted incorrectly.  \n  \nA great example is Abraham Wald, who against conventional wisdom, recommended they armor returning planes in places where they had no bullet holes.",
            "Goddamn a boss who sees weekend work as some kind of fuckin privilege.",
            "Salaried vs hourly trade offs are crazy, are there salaried positions in your field? If so, that might be an option where your skill would be valued more than just the number of hours put in.\n\nSalaried: get paid the same amount regardless of hours (although still expected to work a minimum # of hours), incentives based on meeting performance metrics not hours. Downsides: if you need to work more hours to meet the metrics, you don't get paid more. Upsides: stability, valued for skill over seat-filling (in theory anyway).\n\nHourly: get paid the same per hour regardless of effort (although still expected to produce a minimum quality), incentives based on number of hours worked. Downsides: less stability, may have required overtime, situations like this post happen all the time. Upsides: overtime pay. \n\nEither one can get exploited - in a salaried position you can get told 'produce X results, by next week' and if that means that you end up working an 80 hour week that's tough shit. Vs hourly where like in this post you have to work through the weekend to get more money even if you produced more. \n\nTL;DR: capitalism has downsides, thanks for coming to my ted talk.",
            "The other guy sounds like he was working smarter not harder",
            "I guess what I see is the fact that he said he's repairing things coming off the robot. That means he's repairing welds that the robot is failing. Management would save a lot more labor if they got the robot to weld correctly.",
            "Boss got mad when he got what he wanted? Never work harder than everyone else. The Boss will not appreciate it and will expect even more work out of you. But you and the slow workers will still make the same pay.",
            "as someone else who works in a metal shop, I feel ya. though I've only worked in two, I have about 3 years experience (I'm the painter, the driver, and I do a bit of grinding sometimes or use the Iron worker when needed)\n\nfirst company, they would want things done as fast as possible while maintaining some sort of quality (quality for structural, not so much for things like hand rails) where more often then not, it became a 'We need to get this done before we leave today' then it does get done and sits for SEVERAL weeks before it gets delivered\n\nthe other one simply doesn't have enough work but because of that, we go a bit slower and try and maintain some quality (I've seen better welds at the first shop but that shop owner had the IQ of room temp)",
            "You can clearly tell who's doing their job and who's giving a B job... Hence the favoritism. 🤣",
            "While I do love this story, and it fits it still bothers me.",
            "The hospital likes to using JIT supply’s . Before the pandemic, I would use a face mask rarely. But I had three boxes of masks stashed in a closet “ just in case “. I was told by my lead we had to reuse one mask for a whole week because they had a supply shortage. They couldn’t get any masks in . And we must use our supplies careful. I didn’t had the good masks just the regular paper ones . I did have enough masks to wear a fresh one every day . I has now a small stock pile of both kinds of masks and gloves for “ next time “.  I am not going to reuse a disposable mask one whole week . It will protect no one .",
            "I work remote for a certain bank. (Can’t say unfortunately) there are SOOOO many stats they keep track of, and you get rated for EVERY call, they expect you to stay perfect for every single call, they want you to make a complaint for every call even if they ask for a balance, you HAVE to ask about a survey even if the call is only a minute long etc. I’ve been there for half a year now and it’s getting really annoying. It’s extremely easy to get fired, that’s why they always hiring 😂",
            "Hey maybe the other guy was at over 10 per shift once, but learned it wasn't worth it ;)",
            "“No no, you’re right. Let’s do it the dumbest way possible, because it’s easier for you.” - Rick Sanchez, Rick & Morty",
            "My sister told me years ago when I started working,\n\nYou don’t have to give 100%. Just do a bit more than the current #1 person and you’ll take their place.\n\nNo reason to burn yourself out.",
            "Human error rate is ~2% - 99% pass rate is amazing - they wany robots not workers",
            "I dont want to come off like a cocky fuck and my assumption is that theres clearly more to do then just the weld or that it sounds more complicated then just a foot string bead lol.  So 100% props on the MC lol. Post just got me curious as someone who welded for a good while as to what you are doing if youre able to give details. Im in a very rural place and never been involved with robotic production of any kind for manufacturing so quite curious! Your post peaked my interest! Feel free to pm me would love to hear more!",
            "You were giving the illusion of cooperation...",
            "🍻😂👌My man.",
            "You showed the boss what's what by just doing what he told you to do. That was well played.",
            "I had this when I started out in email support 20 odd years ago.  I had by far the best count of outgoing, correct, mails.  And I had the same error rate as everyone else, per hundred.  But per shift, I had more errors, and this upset my manager enormously.  \n\nNow I'm at the point in my career where I'm hiring those managers, and this is the kind of question I now know needs to be asked to weed these guys out...",
            "You aren't faster than your coworkers. They can go faster, but choose not to. Going slow leaves more work, which means more employment. By outperforming them by 500%, you're showing them up, exposing the fact that the company is overemployed, and putting your coworkers at risk of termination. Slow down, relax, and collect your paycheck.",
            "what you are doing is a slippery slope to a justified firing. i've been in your situation countless times and usually when the whole quality vs quantity thing comes up, most managers are shitty and say \" I WANT BOTH\". well, you're not getting both. pick one. and then after i've accumulated a bit of on the job experience, i find a way to get both. what then? do both and demand a raise while being prepared to walk when they balk. but you have to place yourself into a position of absolute worth. you must become indispensable to your boss first. and for the time being that might mean eating some of his shit. but the look on his face and backbabbling when he realizes you really are walking out the fucking door is well worth it.  but if you get what you demand, rest assured your boss will hold you to the new standard you have created every day with no excuses.  they will apply your new standard of production numbers and hit you with bad performance reviews through hr to justify a firing just in case. this is how they control you. that bad review will come fast and they will hold it over your head for as long as they can to keep you in line.",
            "Why are some of your welds failing? Wouldn’t it be better to take your time and not fail at all?",
            "Pass rate beats speed, i’m glad its working out for you. Really this is how it should be, light quality work man. Take your time, do a good job and not be stressed. You get paid the same either way.",
            "HAHAHA. Nice.\n\nFuck that guy.",
            "When I was in construction, I'd always take the \"high pressure\" shit jobs because once I was done for the day, I was done.  It became a known commodity that I was the guy who could/would/should do certain  things and I'd get put on certain projects in case they needed me.  I've a strong work ethic and am not good sitting still but it was nice getting OT on certain jobs and only doing things like folding laundry, organizing tools, or sitting on a pontoon boat during the summer just in case they needed me lol.",
            "Fuck all that. You should be getting paid per piece.",
            "u/Dra5iel, why are you only doing your job instead of cleaning up stories?!?",
            "Going to get down votes, but maybe the middle ground is right. Maybe you have more mistakes than you're thinking about and the boss gets tired of it, exaggerates the rate a bit. If you took just a little more time, it could go a long way. If someone else is quality control, you have to count your time + the time they take to inspect all your work as the total time (and cost).",
            "Weird flex.\n\nI'm actively trying to slow my production down. To just above median.\nI've been over performing.",
            "Yeah, he’s a fucking hero because he is so fast… If you fail an inch out of every 10’ of weld, you’re a shit welder. If you’re burning “that” much wire and still fucking up your UT’s you need to fucking pay attention.",
            "Bro, this isn't malicious compliance, more petty revenge then anything. But receiving Saturday work isn't the win you think it is.",
            "As a foreman I'm going to side with the foreman. We have no idea what kind of crap that guy has to deal with. I usually choose people for Saturday work that I like to be around. I have also heard the \"I do way more work than this other guy\" story a thousand times, when in fact this guy sucks super bad and you would fire him if you didn't have such a hard time finding replacements.",
            "I was getting 14 parts and 144\" of weld with 99.5% efficiency so I can come down on you because my boss is asking for that .5% and I am throwing you under the bus!\n\n\"You just dropped my numbers to 4 parts and 24\" with 100%? I'm fucked. Why would you throw me under the bus like that? *Surprised pikachu face*.",
            "Has that other guy been there longer? If not, he could have been offered that OT to get more experience. Just a thought. Some of us who are lead operators in other industries started out slowly and got better over time and experience.",
            "[deleted]",
            "Question: why wouldn’t you rather take the time to do like say, 5 perfectly done parts that needed zero re-work or instead of doing 10 parts where every one of them needs re-work of some kind and especially if the rework is something that easily could’ve been prevented if attention to detail was paid? Do you get paid by  the part or paid by the hour? \n\nSerious question, I’m not trying to be a smart ass",
            "Surely you could have found a middle ground instead of being petty?",
            "Yep. That is how things are supposed to be ran. Learn to do it right. Then learn to do it faster. \n\nKind of like.. life 101.",
            "As a welder myself, only having to weld 12” x 10 times definitely shouldn’t take that long and I’m not surprised that your foreman was complying and your colleague is able to do double the work. You should be more focused on improve quality and quantity and ask yourself why your coworkers are able to do so much better than you",
            "I'll. Be was be😄",
            "I read that as \"forearm\" initially and, wow, does that completely change the meaning of the title.",
            "how could there be such a huge discrepancy of you doing almost 5 times more work than someone? Never heard of such a work imbalance in process flow",
            "Did you still just do 2 a day though?",
            "I first read mental fabrication shop...",
            "e\n9l9",
            "How annoying. \n\nThe best metal shop I ever worked in paid an hourly wage AND an admitably small peace rate.\n\nDo you only want to make 25 bucks an hour? Only do 5 parts. Do you want to get more? Do more. The sales guys over quoted all the time. One day, I made 150 an hour... company made like 1k an hour, so everyone was happy",
            "This story made its way around notalwaysright from the boss' pov at the same time, even down to the 120\" number, except it ended with the worker being fired for spending most of the shift goofing off (and not actually improving accuracy)."
        ]
    },
    {
        "post_id": "paxs60",
        "author": "None",
        "title": "Turning wage theft into time theft by... showing up on time.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/paxs60/turning_wage_theft_into_time_theft_by_showing_up/",
        "score": 14480,
        "num_comments": 547,
        "created_utc": 1629843734.0,
        "selftext": "My job is 12 hour shifts with a flexible start time. You must show up before 7, but you can start as early as 6 if you want, and most people opt to show up before 6:30. The last person is usually in before 6:45. We let people go home at the end of shift on a first-in-first-out basis. In theory you should be able to go home after you've worked your 12 hours, but in practice there is usually a disparity of arrival times between the outgoing shift and the oncoming shift. For example, I may have started at 6:15 as the 4th person in, and I'm relieved by the 4th person in on the next shift, but that person might show up at 6:45, making me stay 30 minutes late. I can't complain to that person because it's their right to show up at 6:45.\n\nI talked to my supervisor about this because it had been happening pretty frequently. She said the company won't pay me for the extra time because, according to her, it's my choice to arrive earlier than 7 and that's just the risk I take in being early. She also said she's not willing to move any people around to cover my role to get me out on time, even though they regularly do that to let people take unscheduled bathroom breaks and do training. She said it'd be different if I wasn't relieved by 7 because someone is really late, but before 7 they don't care.\n\nSolution? I show up at 6:59 now. I'm always the last one in. I leave later than everyone, but I'm also guaranteed never to work a single extra, unpaid minute. It also means that the person I relieve is having to stay late because again, the last person usually shows up before 6:45. It *also* means I usually get relieved earlier than 12 hours. I still have to stay in the building until I reach 12 hours (tracked with badge cards), but ultimately they're still paying me for 10-15 minutes of wandering hallways or reading a book.\n\nSo basically they went from regularly stiffing me 15-30 minutes of pay to regularly having to pay me to do 15-30 minutes of nothing.  \n\n[edit] a lot of people are asking about the unscheduled bathroom breaks. Probably sounds worse than it is. So we get 15 minute breaks every 90 minutes, and generally if you have to use the bathroom, that’s when you go. You have about 8 opportunities throughout the shift to do it. And then on top of that, you can still go between breaks if you really need it. That’s what I mean by unscheduled. We get paid on these breaks, it doesnt deduct from the 12 hour time card.",
        "permalink": "/r/MaliciousCompliance/comments/paxs60/turning_wage_theft_into_time_theft_by_showing_up/",
        "comments": [
            "Yeah, your management is a bunch of chiselers.  Might be time to check out some of your state's employment laws.    \n\n\nBasically, you need to be paid for the time you're clocked in.  If they're not doing that, and you confront them, they'll either push back with some bullshit excuse, or blow you off some other way.  They probably won't cave until you have massive documentation that they're in the wrong.",
            "How- does that system even work. Isn’t it, like, corrupt in a sense? And why does no one else have an issue with it?   \n  What... 😟\n\nDoesn’t anyone else realise they’re being exploited by putting up with it\n\nEdit - I have some more questions.   \n  Why would you arrive early in the first place knowing that you can’t leave early and that you’re not being paid for over time.  \n\nWhy didn’t the co workers / colleagues come together and have a chat for an agreed time to arrive? So that it’s beneficial for everyone.",
            "Damn, you lost me at \"unscheduled bathroom breaks\"",
            "[removed]",
            "Had a similar situation years back.  The company insisted on a 40 hour work week which usually turned into 44 or so but no extra pay.  They then said they needed people to work those extra hours free for the good of the company because they couldn't pay for those hours (it didn't stop ridiculous exec salaries and perks though).  They then got me pissed off because of how they had treated me because of wanting to give someone some of my role to their friends.   (there was a lot of nepotism)\n\nI checked the Queensland labour laws and full time was actually legally 38.5 hours a week which was 7.6 hours a day.  I started working exactly 7 hours and 36 minutes every day and maintained that for years.  The people gunning for me, couldn't do a damned thing about it.  Thankfully those people are long gone and after a corporate takeover and then spin off, it's a much better world.",
            "Wage theft is illegal, no matter how they justify it (unless you're salary, in which case you're just expected to work more). An anonymous tip to the appropriate government agency will straighten them out.",
            "None of the comments even mention the malicious compliance because no one can get past an employer having a system like this in place.",
            "I did the same at my factory job when they docked me 15 minutes time because I clocked out....26 seconds early.\n\n\"But I clock in 15 minutes early every day, do I get paid for that?\" I asked. Nope. Of course not.\n\nSo I clocked in and out exactly on time, and they lost 15 minutes of work, 6 days a week, for a total of 6hrs a month I'm no longer making them product for free. That had to hurt XD",
            "Are you in the U.S.?  If so, your supervisor and company are violating the law!  You can’t work off the clock for a for profit business.  Turn them in!",
            "It sounds like your company is doing something illegal.  Mandatory unpaid work?  Doesn't sound right.",
            "That's amazing that your employer has gotten away with this blatant abuse of people's time for so long. They can milk a few hours at least a day out of every shift and people think that it's to their benefit. I'm just amazed it took so long for someone to catch on.",
            "\"unscheduled bathroom breaks\" \n... what the fuck? where do you work?",
            "Beyond everything everyone else here has said, if anyone on the other shift starts getting pissy with you, explain it to them like you explained it to us. Maybe you'll get someone else to start coming in at 659. I'd rather know I'm gonna be there for 12 hours every day than sometimes have to work 12.5 hours.",
            "If the person relieving you turns up no later than 6:45 then why don't just show up at 6:45, leave at 6:45 straight away without wandering the halls, and therefore do your 12 hours.\n\nYes it's a silly system but deliberately arriving at 6:59 doesn't harm the company, it just harms the person on the next shift taking over from you.",
            "Call the IRS they will fuck this company sideways as this is tax evasion. Happen at one of my former employers and you get up to 10% of the fine/backpay/interest if you call it in (up to I believe 10 million dollars) \n\nLook up IRS whistle blowing.",
            "The sad part about this is, that your MC has no effect on the company/management whatsoever. They're not paying anyone a single cent more - and they're also not losing any work, since your shift-counterpart is taking over your 15 minutes of doing nothing.\n\nIn the long run, it'll most likely create an equilibrium, where every worker is arriving precisely on time",
            "As an Australian the phrase “unscheduled bathroom breaks” makes my skin crawl.\n\nLike what the fuck? You piss when you've got to piss.",
            "Last few places I worked there was a somewhat similar system in place where we didn't have to \"officially\" clock in/out.  \n\nIf you showed up a few minutes early to give relief, and that person came back next shift a few minutes late there was, technically, not much you could do about it except return the courtesy at a later date ;)",
            "Are you working 12 hour shifts a whole week?! You just go to work, go to home to sleep and go to work. How can you have social life by working so much? I work 8 hours a day and still feel like I don't have enough time at home. wtf?",
            "If you are in the US, this is illegal.",
            "If this is in the US then it is totally illegal. Some lawyers would love to talk to you.",
            "Hire an employment attorney.  Time required to be there is paid unless you chose to take an unpaid break.",
            "Shit sounds like slavery",
            "Or work 12.0 hrs while coming in early; then notify your mgr for him to fill-in, right? He \"obviously\" knows how to run every station, right? ;-)",
            "A little exercise in game theory, over time this will keep occurring until one by one everyone starts arriving at 7am and thus reaches equilibrium",
            "I’d call the labor board. This stinks of illegality.",
            ">unscheduled bathroom breaks\n\nWhat the fuck is a *scheduled* bathroom break? If I have to shit, I'm getting up to go take a shit....",
            "There is no way in fuck this is legal. If you're clocked in, and working hourly, they have to pay you. Period.\n\nI would make sure your local labor board knows about this.",
            "Why do most people opt to be 30 minutes early? There's barely any benefit and it's all risk.",
            "The fuck kind of weird ass job is this? Scheduled bathroom breaks? Forced to stay in the building for 12 hours?",
            "\"unscheduled bathroom breaks\".... What? You need to inform in advance that you are gonna take a piss? What?",
            "This policy is a walking FLSA lawsuit, and any HR professional worth their weight would break into a cold sweat upon learning of its existence. \n\nOP should take the opposite strategy: arrive early, stay late. Document the unpaid overtime. Sue for double damages plus attorneys fees.",
            "Unless you are management or on a salary, this sounds illegal as fuck.",
            "Solution is tell her she's breaking the law and if she doesn't pay you, you'll go to the labor board.  She doesn't get to overlook the law because she doesn't like it.  Go to your Human Resources person and tell them what's going on.  Make sure you document your true time and what she's trying to screw you out of.  If you complain to the labor board and she retaliates, guess what, you have one hell of a lawsuit.   Plus, all the other people she is screwing out of overtime will make you their hero if they get all their back wages too",
            "Yeah if you’re in the US and hourly non exempt, they have to pay you for all of the time you’re clocked in.  They can’t turn the clock off at exactly 12 hours. \n\nIf you have pay stubs and timesheets from before you switched to coming in last, shoot them over to the state DOL.",
            "I would do the same - and so should all of your co-workers.\n\nEveryone arrive at 6.59 and not a minute more.",
            "Unscheduled bathroom breaks? If I need a piss I'm going for a piss.\n\nJesus even slaves were allowed take piss breaks when they needed.",
            "Your workplace is almost the epitome of the prisoner's dilemma",
            "Is this even legal? What country are you at, OP?",
            "Yeah, that's straight up illegal (if you're in America anyways). They can have whatever bullshit \"you can't leave until relieved\" rule they want, but they do have to pay you for that time, full stop no qualifiers.",
            "This is the way.",
            "Yet another example of wage-theft (most likely here in the US).... :-(",
            "At my job we are expected to get to work at least 5-10 minutes early to \"prep for the day\". Used to put up with it but a year in I said screw it and started showing up right on time for my shift.",
            "Working off the clock is usually illegal .",
            "This literally sounds like wage theft. I'd be calling your state.",
            "I would never show up before 659…like why? It’s unpaid labor",
            "You aren't gaming the system if you're doing what you're supposed to. The employer hasn't lost anything here.",
            "Never heard of a flexible work time that was only flexible if you decide to go in and work for free an hour earlier than scheduled. \n\nThat's not flexible, it's letting yourself get taken advantage of.",
            "If this is in CA,  you are required  to get overtime pay after 8 hours in a work day or 40 hours in a work week. and double time after 12 hrs in a work day.",
            "Totally illegal for you to work for free, are you guys union?  You definitely have a law suit on your hands for any time they forced you to work off the clock if you want it.  Had a similar situation where I work\nAnd we ended up receiving back pay for the previous 5 years they did that.",
            "Worked on a production line in late 1970's. \n\nOlder long term guy told me to remember the 2 golden rules:-\n\n1. Never use the bathroom in your own time\n2. Never leave the factory empty handed",
            "Love it",
            "That.. That’s beautiful",
            "Are you a dispatcher?  Lol. Sounds like petty shit we used to do.",
            "That's called an uno reverse card",
            "Here is another thing that doesn't make sense. If someone leaves when you show up their clock stops and yours starts. Your clock should run until you are relieved. You should be paid for the entire time because no one else is being paid for that same time. Now they are are. Sounds like your company should budget for a 10 minute overlap in time and everyone hits the clock 10 minutes before you leave.",
            "Okay but it seems like your coworkers are the ones losing out here. Your employer doesn't care either way.",
            "Federal contractor? You have an easy case for a lawyer, and the company would be forced to not only pay up, but there are likely substantial penalties at play as well. I went through something similar a few years back, and won a sizeable chunk of money for us in a class action suit. Your employer knows that what they are doing is wrong, and because of the federal contractor part and the specific laws pertaining to that, it could help everyone in the long run.",
            "Your bathroom breaks are scheduled??",
            "Yep. This is the way to do it! \n\nI had a job where we had time cards and we went to a clock in/clock out system. Obviously because wage theft there were some stupid if you're x minutes past an hour then it went forward 30 or whatever. Basically it meant you were screwed. I arrived 10 minutes early everyday when we were on timecards because I knew it didn't matter if I took a long lunch here and there. \n\nOnce we got the system and I noticed the disparities I brought it up to my boss who was like \"well it's easy just do x x x.\" At that point I got to work exactly at 9, left exactly at 6 and took exactly 1 hour lunch from 1-2 regardless of what was going on. That way I knew they weren't going to screw me out of wages.",
            "What the fuck is unscheduled bathroom break?",
            "I'm sorry, but unscheduled toilet breaks.... Where do you work that you have to schedule taking a piss or a shit, and not just going when you need to?",
            "If in NY state you have a definite lawsuit. A similar thing occurred to the CNAs I worked with and they won a 7 figure settlement.",
            "Illegal to not get paid for your work.",
            "\"unscheduled bathroom breaks\" excuse me, what?",
            "Unscheduled bathroom breaks...",
            "What in the actual fuck? What educated idiot came up with that shit dipped lollipop of a work schedulel? How can it even be efficient? More importantly, what is your turn over rate?",
            "What do you do that has such a convoluted time system?",
            "[deleted]",
            "> Solution? I show up at 6:59 now. I'm always the last one in. I leave later than everyone, but I'm also guaranteed never to work a single extra, unpaid minute. It also means that the person I relieve is having to stay late because again, the last person usually shows up before 6:45. It also means I usually get relieved earlier than 12 hours. I still have to stay in the building until I reach 12 hours (tracked with badge cards), but ultimately they're still paying me for 10-15 minutes of wandering hallways or reading a book.\n\nHmm... so, the next shift’s person arrives well before 7, and replaces you ?? This sounds wrong. The next shift’s person should hang around idly until 7, and then replace you. So far, you stop working earlier at the expense of the previous shift person.",
            "Scheduled toilet break? Is that a thing? When I have to go I’m bloody going",
            "[deleted]",
            "12 hour shifts?  Wtf kind of shithole are you from? North Korea?!",
            "Same thing happened to me. \n\nPrevious job, I was a supervisor, and not technically allowed to \"work\". So I'd come in an hour or two early, punch in, get everything shipshape and organized for the day, and then when my staff came in I'd revert to my supervisory duties. I also never took breaks as I found they interfered with my day.\n\nStarted a new job, and started doing the same thing, but I noticed I wasn't getting paid for it. I was in shipping, so the extra hour or two early meant that we could have our freight at customers' doors right when then opened, as they often requested. We'd also have trucks call and ask if I could wait around an hour or two after hours because they'd been held up at the border or whatever. Otherwise, we'd be paying them to sit overnight in the yard until we came in the next day.  Did this for about a year, and eventually went in and asked if I could be compensated for the extra hours I was putting in. I didn't mind the extra hours, but it was pretty irritating to be surrendering time with my family for free. \n\nThey told me it was my choice to stay beyond my scheduled hours (even though I was saving them a ton of money by doing so), and that they wouldn't compensate me for it. \n\nSo, from then on every single punch card I had read 7:59 am - 4:30 pm and I took every single break available to me, whether I wanted it or not. There were plenty of times where our service team would call and ask if I could stay 15 minutes extra to wait for a truck or get a load out because a customer was dying for it *right now*, and my answer was always, nope, you do it - my day ends at 4:30. Quite a few times I walked away as trucks were backing up to the door at 4:30, and many times customers were SOL on early morning deliveries.\n\nWhy? Is it because I have a bad attitude, or don't care about customer service? Hell no - I've always gone above and beyond at every job I've had. \n\nIt's because I'm not a goddamn slave and I'm not giving up time with my kids to work for free. \n\nHappy to say I don't work there anymore. I handed them notice and now I'm a stay at home dad with all the time in the world for my kids :)",
            "Your plight sounds a lot like years past in my job. Fire department dispatcher, working 12 hr shifts, 2 days (6a-6p), 2 nights (6p-6a), 4 off. So if my first day was Monday, I'd work Mon 6a-6p, Tue 6a-6p, Wed 6p-Thu 6a, Thu 6p-Fri 6a, and then not have to be back to work until the next Tue at 6a.\n\nBecause of the fact there were 4 teams doing this shift work, most of the time you would relieve the person who would ultimately be coming back to relieve you in 12 hours (or vice versa). Yes, the first-in-first-out rule was a thing, but sometimes you'd encounter a situation where you relieved someone at 5:30-5:40 to \"be nice to them\", and you'd pay for it 12 hours later when the person you were being relieved by (who may not have *always* been the same person you relieved) had the philosophy of getting in at 5:57. It got to be frustrating, and some of us eventually got a little petty about it; if we were relieved \"late\", we'd pointedly say \"*See you in 12 hours*\", and make sure that we didn't show up until precisely 12 hours had elapsed. That often didn't work because someone else would end up relieving our counterpart, and their behavior of arriving \"late\" and getting to leave early would just be reinforced. Sigh.",
            "Imagine going to work earlier to work for free",
            "Given the electronic badges, if the board of wages and earning did an audit you employer would be issuing a lot of unpaid wages.",
            "Sorry dude i think your malicious compliance story has been overshadowed by reddit's unforgiving nature towards the more shady private sectors of industry. We kill these cheap suckas for breakfast didnt you know? \n\nI hope for your sake you are at least only working 4 days a week. I dont even want to ask about overtime pay, it really does not sound like a good place to work at :/",
            "12 hours shifts ??",
            "Now what of everyone shows up at 6:59, and the next shift also shows up at 6:59.... Then no one works more than they should and no one does the \"extra 15min\" to prepare.... Production will drop as right now nearly everyone is working an extra 15-30 min....",
            "Roughly 260 working days in a year.  \nLet's say you punch in and work an extra 15 minutes each day.  \nIf you're not getting paid for those extra 15 minutes, that's a little over a full work week(*~65 hours*) that you're just giving them per year",
            "Wanna really mess with their heads?\n\nThe next week show up exactly at 6:00 on the dot.\nAnd remember if you’re not first, you’re last, lol.",
            "Your solution fucks over the previous shift employee though, does it not? I mean sure you got yours and get to stick it to the man by getting some paid free time, but doesn't that mean the poor worker that showed up latest from the prior shift has to wait for you? That's shitty.\n\nTake this up with the proper authorities. End this unfair employment practice and wage theft. But fuck man, don't fuck over your fellow man. That's you, twelve hours shifted.",
            "This sounds like I'm watching Brazil. What a stupidly insulting way to treat your employees.",
            "You’re just passing the problem to some other poor bloke who has to work late because of you.\n\nBe a man, and leave when your shift is up whether the person shows or not.",
            "12 hours? You need a different job",
            "Is that malicious compliance though? I mean you're now doing exactly what they are asking you to do, unlike before where you were doing more than they were asking of you. From your employer's perspective I don't see anything malicious about that.",
            "[deleted]",
            "While in law enforcement we used to have to show up 15 early for a shift brief. No time clock as the supervisors did it manually on paper. 3rd shift didn't usually have a brief so us 2nd shifters would get relieved 15 minutes or more early. It all balanced out.\n\nThen folks complained to the Labor Board and a time clock was installed. Wr also were all given a check to cover those 15 mins we had been coming in early all those years. That ended any shift briefs because you couldn't clock in more than 5 mins before start of shift. The lack of shift briefs led to info not getting passed along and things began to fall apart rather quickly.\n\nSo, the state paid who knows how much in back pay, plus the cost of the Kronos time clock system and what they got in return were disorganized shifts and low morale.\n\nSome suggested the whiners who complained and started it all should be taken out back a be vigorously beaten about the head and shoulders.",
            "I know I'm late but hopefully OP sees this:\n\nThe 15-30 minutes they pay you to do nothing is 15-30 minutes they're not paying the guy you relieve.\n\nThe company doesn't care, because in the end, the shop runs 24h a day, and they pay everyone 12h regardless. Paying you to do nothing changes nothing to their budget. You're not screwing them, you're screwing your co-worker.",
            "Why would you bother working more than one shift at that place when they don't pay overtime?",
            "Why don't you just... show up at 6:45?",
            "Hahaha. You don't even understand who you really steal that 15-30 minutes from.\n\nIf I was your employer, I'd be laughing at this post so hard.",
            "Some am/pm would have been helpful for clarity but overall good MC",
            "Unscheduled bathroom breaks? What?",
            "In Hobby Lobby we would all leave the store at once so if the stockman feels like making an hour overtime mopping the floors when he wasn't supposed to, we all end up with it too.\n\nSometimes rules in life just simply aren't the best choice to follow.",
            "This is the most insane schedule I’ve ever heard of. It sounds illegal and is definitely Inconvenient for everyone involved. Why do they allow this madness?",
            "Sounds like amazon",
            "time to talk to a lawyer",
            "You need a union.",
            "Not sure what you do, but having shifts overlapping and running 3 of them seems like a better option.",
            "Wouldn't be legal in the UK.",
            "Yer doun the right thing son",
            "I don't see how this is \"malicious\" compliance. Sounds like a social structure rather than your employer expecting you to show up so early. It's honestly your fault for expecting to get something extra out of showing up early to relieve other people at a different time than the already set time of 7.",
            "You think your sticking it to the management but your really fucking over your shiftmates.",
            "*ultimately they're still paying me for 10-15 minutes of wandering hallways or reading a book.*\n\nThe company doesn't care because they aren't losing anything, they're just paying the wrong person for that 10-15 minutes.  That's why this is happening, from their perspective everything lines up:  Total hours worked = total hours paid.  \n\nOther commenters' assertion the company was stealing from you is wrong, it didn't benefit at all.  You just went from a net contributor to your coworkers to a net taker from your coworkers.  If you push this it the company will respond by making the start times mandatory, but it won't change their cost at all.",
            "[removed]",
            "Imagine having to schedule your bowel movements...",
            "What a moronic policy From crappy management.",
            "This isn’t malicious not to the company anyway. The company could give a shit what you do. As long as you’re there before 7. The only person you’re screwing is your coworker if they start their shift early. This is just dumb. It’s just you showing up on time and leaving on time.",
            "Who in the hell would ever set things up like that? \n\nIt's madness.",
            "My guess is ATC supervisor",
            ">[edit] a lot of people are asking about the unscheduled bathroom breaks. Probably sounds worse than it is.\n\nlmfao. America really must be an absolute shithole towork in if anybody is concerned about 'unscheduled' bathroom breaks. oh noooooo you '''stole''' like 10 minutes of time out of 12 fucking hours.",
            "Yeah, I haven't read through the comments and sure this has been pointed out, but that isn't legal. This goes for everyone else, you don't work time you aren't paid for. If your shift is 12 hours, then it's 12 hours, not 12 hours and a few minutes. If your employer is requiring this, find another job and encourage your soon-to-be former co-workers to do the same, if there is enough of you, form a union. But at the very least, under no circumstances, you should never work without being paid. I say this because this shit adds up. Those few minutes everyday turn into a full work week every year. That's a full week your employer is making money and you are not. Also, poop on the clock",
            "That's a shit system. If you have flexible starting time time but rely on being relieved and that person also has flexible then this is bound to happen. Flexible starting time works if you have single shift because you show up, do your work for required time and go home. I have trouble believing this would be even implemented and if it were why would people even show up before 7.",
            "Wage theft is highly illegal, if you are in the U.S. You could take them to the cleaners for that.",
            "You’ve won. Great work doing the math. Look out for yourself, because no one else will.",
            "In situations like this, it's barely even malicious. If everyone wanted to minimize their workload, they'd all do it your way, and you'd have equal 12 hour shifts for everyone. It's weird to me that anyone would actually show up nearly an hour before their shift starts, banking that someone else will do the same next time. \n\nSeems like everyone should just agree to show up at 6 or 7, or narrow it to a 30 or even 15 minute window.",
            "This doesn't seem like a happy ending. What sort of dystopian nightmare are we living in?\n\nAnd why are managers like yours such ****s?",
            "That's definitely illegal. If you're in a union contact their lawyers, otherwise I guess your \"solution\" is good enough, for you, personally.",
            "I posted this reply to a couple people who were asking about knowing if they were required to be paid for overtime. Here's a general rule of thumb for everyone. \n\n\n\nIf you're paid salary you are usually classified as \"exempt\" meaning you are exempt from overtime laws. It's *supposed to be* a mutual understanding that that means you may be required to work overtime and you may not be, but that you're compensated fairly to cover the occasions where you need to stay late. \n\nHourly employees are classified as \"non-exempt\" meaning they are subject to overtime laws, and anything that they do over 40 hours, or more than 8 hours in a day depending on the state they are in, they are to be paid additional wages.\n\nNow there is a loophole here: if it's the company's policy that anything over your scheduled shifts won't be paid accordingly, and it's written down in either your offer letter or in the handbook that you received, then your basically SOL because they made the policy known prior to your employment and you agreed to those terms when you onboarded. \n\nThis is just a layman's explanation to give people a general understanding of their rights. It varies by state, county, city/town, and company. However, this should be enough information for people to at least know what questions to ask and what to look for when they start a new job.",
            "Unless you’re an exempt, salary employee (and one that is actually eligible for that designation), this is illegal (at least in the US).",
            "Is this Amazon?  It sounds like something Amazon would do.",
            "I feel like you are worrying on others people’s behalf. If you want to turn up on time and leave on time then that’s absolutely cool (and what I would do FYI). But if others are cool with it then you can’t really argue on their behalf if they are fine with the “flexibility” it gives. \n\nUnless I’m missing something important / obvious.\n\nEdit: Just to clarify I’m not trying to condone the shitty business practices though. Just that if other people are happy you might end up actually making things worse for people who like the “flexibility”.",
            "Sounds like you work for Amazon.",
            "This sounds like how it was working for the prison except you get only one 30min break and if you have to \"go\" then you basically have to beg someone to take your spot while you're gone. And when I say beg I mean... usually the person you were begging was holding the key to the door you were locked behind.",
            "You should have contacted your local labor control board instead.",
            "Dear lord get out of that job.",
            "Geez. 12 hour shifts? What country are you in? How many days per week?",
            "15 minute breaks every 90 minutes in a 12 hour shift? That's not bad. What are lunch breaks like or do you get any?\n\nWhere I work we get the minimum required by law, which is 60 minutes total over a 12 hour shift. Most of us take a single, 60 minute break.",
            "Unscheduled bathroom breaks? What the fuck? You have to schedule a time to go pee? They must be paying you a fucking fortune",
            "What do you you for work?",
            "What would happen if the entire shift showed up between 6:59 and 7:00?",
            "Always poop on company time.",
            "  Q. Q",
            "Legally, the company owes you money if they allow you to workfor that time. If they didnt want you to work the extra hours, they should staff appropriately and tell you when you've hit the max amount.",
            "If you’re in the USA it’s literally illegal to not pay you for time you are working. Personally I would go back to my original schedule and start tracking the unpaid time and then sue the shit out of them",
            "Where I work it’s a paid working lunch. So it’s a straight 8 hours. I work from the time I go in until I leave. The ppl I supervise have basically from 11:15-1:00 as they’re working lunch. However they work on sitting around and gossiping. I’ve tried to enforce the fact that they need to be working during this break. But I’m a new supervisor and it’s been overlooked for years before me. Meanwhile all the ppl I supervise but 1 make more than me and complain if their break doesn’t start at 11:15. I’m so done with state workers",
            "[removed]",
            "Lam?",
            "A 12 hour day sounds horrible, especially with the employer penny pinching you like that. Is it a call center?",
            "Every time mgt makes people work to the clock, employees do exactly that.  Result is that the co. as a whole gets less work processed.",
            "Do you work at a tire manufacturing place? Sounds exactly like the schedule I had at one.",
            "I recently had an issue where the person I was reliving demanded I show up 20 minutes early for work. She apparently had to leave early and it was important. So we changed the schedule and we all shifted ahead one hour so I started an hour earlier and finished an hour earlier. Only problem was after a few months she against started demanding I be at work 20 minutes early because she had to \"catch the bus\". \n\nThing is, we work in a bad part of town and she doesn't feel safe at night and doesn't want to miss the bus. I get that, but I work two jobs so that I can afford a car so that I don't take the bus. 20 minutes is apparently nothing to her but it really adds up. I'm basically working for free for something like 80 hours per year. \n\nI tried to tell her this but she wouldn't listen. I show up about 5-10 mins before my shift and she pouts and hates me for it but too bad. I don't work for free. I'd happily show up earlier if I was paid to show up earlier but she wants to leave early but still get paid for a full shift. But like I said, I don't work for free."
        ]
    },
    {
        "post_id": "kmkfmo",
        "author": "Maheu",
        "title": "Dissolve my department, demote me and expect the same output ? You got it boss",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/kmkfmo/dissolve_my_department_demote_me_and_expect_the/",
        "score": 14471,
        "num_comments": 278,
        "created_utc": 1609268290.0,
        "selftext": "I work in a highly specialised field, where it's very difficult to find and train suitable personal. By pinching pennies and not holding his promises about pay grade changes, my boss successively drove away the three specialists working in the department I led. Right before the last one put in her notice, he argued that a 2 person department didn't justify a leadership position and demoted me, and we were integrated (on paper) to another department. This was done outside of any legal framework and with a one week notice, which is illegal.\nDuring the reorganisation, the manager of the department we joined was assigned to R&D, and another manager and his deputy promoted to lead the department's daily business. We effectively had no less than 3 supervisors, all of them lacking managerial training and technical knowledge about the duties of our now defunct department (and only one of them can read the language in which 50% of our reports are written).  \nRight after the reorganisation, I was granted one last meeting with the boss, where I pointed out that several of my duties cannot be bestowed upon the mere foot soldier I had become, nor taken over by the new leadership. He answered that his decision was final, I was to revert to my previous job description and take up any future matter with my new supervisors.\n\nI did just that, and some more : I read the state law and ordinance about state and university employees (should have done it earlier, in hindsight). I discovered that :  \n- the illegal move by my boss doesn't carry any penalty, so there's fuck all I can do legally  \n- I'm allowed to take on private mandates for anything that is not explicitly mentioned in my job description (it's a gift normally meant for professors)  \n- I get to take up to **15 days of additional paid leave** per year to hold a public office  \n- the pay grade I reverted to doesn't match my responsibilities today, even excluding the absence of leadership position, and there's an independent procedure with state HR to reevaluate the pay grade  \n  \nThe kicker ? My old job description that dates back to 7 years before is short, to say the least : 3 lines that don't even cover 50% of what my duties in the last seven years consisted of. And I have a side gig as a retained firefighter and fire instructor for which I used to take vacation days. This counts as a public office according to state law.  \n  \n*The fallout*  \nMy new managers both signed the authorisation to take on private mandates and public office without understanding the implications. I used all of the 15 days, where I legally get paid by the FD and my employer at the same time. I took on several private mandates totalling nearly an additional month of salary for 4 days of work. And the pay grade reevaluation has brought me back to the same income as with the previous leadership position. Oh, and since my speciality now has a bus factor of one and my new supervisors have been unable to staff the open positions, it was very unlucky that I fell ill at the time where I had to submit paperwork for a research grant, costing the institution 30'000$ in lost research funds.  \n  \nTL:DR : my boss demotes me and dissolves my team. I find several legal loopholes that allow me to work less and get more income, without my boss even noticing and with the naive blessing of my new leadership.\n\nEdit : I used the expression \"private mandate\", which is a direct translation of the state law legalese and seems to confuse a lot of you. Think of it as taking the contract in my name, as opposed to in the institution's name, and working on it outside of my regular hours. It's not exactly like a contractor though, because as a  member of the institution, I'm still bound by some rules that don't apply to contractors.  It is very weird and would not be possible if the transition had been planned and managed properly, with an update of my job description for example. /u/Dif3r explained it well :  \n>Faculty at universities will sometimes consult on the side. I've heard of engineering and marketing professors doing design or doing research and writing internal white papers for companies before. Or collaborating on a research project under their own name/lab as opposed to the universitys \"brand\". \n\nEdit 2: some of you were hung up on the lost research fund, so I want to clarify 2 things :  \n1) this was no part of the MC and I really caught a potentially serious disease. But since I had been warning for months about the lack of substitution or cross training, this came as a vindication  \n2) no grad student or junior researcher were impacted. It just erased part of what the institution gained in not staffing the open positions",
        "permalink": "/r/MaliciousCompliance/comments/kmkfmo/dissolve_my_department_demote_me_and_expect_the/",
        "comments": [
            "When you leave, I hope you submit a list to their bosses of what your bosses choices cost the company after you notified them of the problems.",
            "I worked with a guy like you as a student at a public college. I got paid pretty decently for a student at $11 to basically run errands for the Environmental, Health, and Safety office of faculty management.\n\nThis guy I worked with ate up every single certification he could, getting in trained in how to train people in just about everything. He would then get paid his normal salary in addition to fees for holding the classes. Since there are a lot of laws that govern how these offices are run I'm pretty confident he made a concerted effort to know them and take advantage of them where he could. He certainly knew them better than the head of the department. In a pretty chaotic office he was a steady dude who knew how to play the game.",
            "Good for you for doing research and making the most out of it!!",
            "You need to flee! There'll be a target on your back and it sounds like the company you work for sucks.",
            "Ha! Karma strikes another asshat!",
            "Explain it to me like I'm 5, what does \"Private Mandates\" mean? And what's the whole public office thing about too?",
            "I once worked for a company that had three product lines where I was product line manager for one of them.  Another product line was sold and now there were two with three managers.  I was convinced to become manager of sales support because I had sales experience.  Find.  Same salary, etc.  However.... I was reporting to the guy who took over my product line.  Strange because in the past, sales support managers reported to the vp of sales.  OK.\n\nThings went along and I started getting more and more work piled in on me - work that was supposed to be done by the product manager.  I kept on keeping on.\n\nOne day, my new \"boss\" came into my office and sat down and told me I needed to clean my desk off at the end of every day.  \n\nThat was it.  I quit on the spot.  At the end of the week, I was escorted from the building by a security guard.  \n\nA month later, I returned to the company for some reason or other and the guy who replaced me greeted me with  kiss on the lips.  (I'm a woman...)  Two months later, he took a job at another country.\n\nDespite having a mortgage and single mother to three kids, I left the corporate world and never looked back.  Fuck that shit.",
            "[deleted]",
            "In my 51 years , I’ve learned that management is not leadership and management is not necessarily the smartest person out there.  I’ve had my time teaching managers how to manage teams. You must decide what’s most important at the moment. The cash or your sanity.  I’ve lost a little of both over the years.",
            "Good on you!\n\nMy husband was once in a similar situation. The large across-country company was downsizing. He was what I called the “Staples of this company”. Anything that had their logo/letterhead on it, he shipped out. His department also did the internal mail for their national headquarters. They laid off 2/3 of his department, told him and the other employees that in 4-6 months they would all be laid off, and said no more overtime. He and his department worked exactly what they should and not a minute more. Funny thing is that after a couple of months someone from the international office flew to his office just to ask him what his job was. When he finally got laid off, he started work at a company right across the street that was contracted to do the job he was doing for the original company. The new company had him doing exactly the same job with more pay and benefits while allowing him to have much more flexibility. This was because he was the only person in the company who knew the job.",
            "When the stars align and you get a bunch of idiots to hand you time and money.\n\nNoice!",
            "I'm not a university employee (I took one look at their IT pay scale at the time and laughed all the way back to working pantsless from home) but half my friends are so this so totally believable.",
            "How's the boss handling what's happened so far?",
            "From what you said I would have to say that the organization has done as what some may call FUBAR. I wish you all the luck",
            "Sounds like your handling this situation really well, your tactical prowess is the be admired. Make sure you have contingencies in place for your departure, sounds like they would make it very difficult for you if they put their minds to it. Don’t under estimate them, plan and execute and you will win no doubt.",
            "This is uncanny currently going through a similar situation. Highly specialised field getting stripped of resources (myself as manager and three scientific staff). I had to fight tooth and nail to keep my staff just before xmas but I fear writing is on the wall and I will be looking elsewhere in the near future as I would volunteer redundancy before they make my staff redundant (as most have dependants or are older). I am glad you found peace in what you do now. I don't have the avenues you do as basically working conditions have been federally eroded over the years thanks to the right side of politics.",
            "Just FYI, I think part of the private mandate confusion comes from not understanding your workplace. \n\nI thought at first you were in a company,  then government, then a university, then I just had no idea.\n\nI get the malicious compliance part more or less, but the context was just too vague to really appreciate.",
            "I have only one thing to say \"WELL-PLAYED\"",
            "Regardless of your individual pay and benefits bump, it sounds like the overall organization is happy to invest less and focus less on that specialization (moving from multiple employees to 1, not caring about research funding, side of the desk on multiple supervisors). Probably should start thinking about what’s next if you’re not tenure track/secure.",
            "You’re like a loophole wizard",
            "What is your specific job and what country or stage is this in?",
            "I would really like to hear more about the aftermath. How has the management attempted to wrangle the department to do what it used to when they don't know what they're doing? Lol",
            "Check if you can get your vacation days back retroactively.",
            "Impressive and I especially liked so there’s fuck all I can do legally 😃",
            "Seems like the \"private mandate\" in this case would translate to a \"private contract job\" in English, but others should feel free to correct me there",
            "Time to move on...........and get a new job.  \n\nThey do NOT value your input.",
            "I barely understood any of that, and I'd definitely hire that one.",
            "I have no idea what you just said",
            ">the illegal move by my boss doesn't carry any penalty, so there's fuck all I can do legally\n\nI'm not a lawyer but doesn't that make it not fucking illegal?  \n\n(I assume the fault here is with whoever made the rule and not with OP, didn't want that to come across the wrong way.)",
            "The TL:DR sounds great. Your crazy British English makes the story pretty difficult to follow for us lowly Americans. Glad you’re getting paid more and could stick it to the man though!",
            "Bus factor is such a great descriptor",
            "Not a very good ending. Let’s hear how it bit that boss that caused all this. What’s the fallout?  Gov institution doesn’t care about 30k lol.",
            "Its cool that you've done all that against your old boss, but seeing \"university employees\", I just want to spare a thought to the grad students who will now bear the brunt of your boss as well as, since losing the research funds, some poor grad student losing their stipend.",
            "This is the military in a nutshell lol",
            "You get *paid* to attend fire calls ?\n\nHere in NZ, volunteer (which I assume is what retained means here) FF's can apply for reimbursement if they suffered a demonstrable financial loss due to attending a call, but they certainly can't claim it if their employer paid them during the time they were at the call.  I've never used the process, as my employer finds it easier for me to just make up the time later.",
            "nice...",
            "I hope you enjoyed your private man date seeing as how you went to several of them.",
            "I would love to know which university you work for bc fuuuuuuckkkkkkk I feel you.",
            ">Think of it as taking the mandate in my name, as opposed to in the institution's name.\n\nThat provides zero clarification.",
            "Amazing! I love this!",
            "What the hell do you do or a living?",
            "Even with the edit, I'm still confused about the \"private mandate\". Do you just declare \"I am on Private Mandate time, and therefore get contractor rate for whatever I'm doing!\"",
            "I understood little to nothing about this, but I'm still happy for you.",
            "When I saw “authorisation,” I thought “ah, must be British.” Then I saw 30’000$ and thought “this person is in every country at the same time.”",
            "Wait, if his illegal action carried no penalty then why was there even a law for it? At the very least it's something that you could have taken him to court over, no?\n\nWill need updates as this progresses, if you'd be so kind.",
            "As a researcher- I hate this. \n\"where I had to submit paperwork for a research grant, costing the institution 30'000$ in lost research funds.\"\n\nYou just screwed over someone else. In academia, our research funding directly pays salaries for grad students, postdocs, lab techs, whatever. It is a huge issue when something goes wrong and funds are delayed.\n\nI 1000% emphasize with you about the boss. But that line, I can't get past. This compliance is the wrong kind of \"malacious\" the people it actually hurts have no involvement at all, they're innocent bystanders.  It's like screwing over fire fighters and then saying \"they couldn't respond to a house fire later\" - dramatic hyberbole on my part but same concept.",
            "[deleted]",
            "Someone thinks very highly of themselves.  I think you overestimate your value to your employer.",
            "What kind of psycho writes $30,000 like this: 30’000$ ?  I’m seeing this shit all over reddit.  What’s behind this weirdness?  Public education?  I’ve clearly missed the memo on how to denote USD.",
            "Hearing from workers outside of the US always makes me so mad that I'm stuck in this stupid country.",
            "So you work for a public university where you go out of your way to cost the institution more money because your boss is a prick? This is why college costs so much and why privatization will always be a better option for taxpayers.",
            "Why not just get a new job?? Jeez.",
            "Submit your list on your way out the door.  Find a job n give no notice",
            "Wow. In the US we just want a mask and not have our vacation stolen just because it’s inconvenient for the employer.",
            "[removed]",
            "[deleted]",
            " Excellent",
            "From a fellow firefighter who got screwed over time after time by their employer, good for you for sticking it to the man!",
            "I read the title as dissolve my apartment and thought, this should be interesting!",
            "Love the context, and outcome!",
            " >the illegal move by my boss doesn't carry any penalty\n\nBrilliant plan, legislators",
            "Just do more with less.",
            "This is why university is so expensive.",
            "I don't think the word \"private\" caused the confusion. At first, I thought the context of private mandate meant some kind of intern or trainee. Someone you would mandate or delegate work to... But then you implied the private mandate increased your personal income, so I realized my first assumption was wrong, but had no clue what to replace my assumption with.",
            "This link might help you: https://www.merriam-webster.com/dictionary/mandate",
            "I was with you until the 30’000$."
        ]
    },
    {
        "post_id": "8k78o3",
        "author": "DaveyJones317",
        "title": "Operation Undershirts: A dress code policy strictly enforced and hilariously complied with.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8k78o3/operation_undershirts_a_dress_code_policy/",
        "score": 14456,
        "num_comments": 335,
        "created_utc": 1526587148.0,
        "selftext": "So in my early 20s (21) I start working as a Phlebotomist (I drew blood in a large hospital). I had just moved and knew no one and also just didn’t know the area/city. I worked evening shift 1300-2130. After completing the training I was put on my normal shift with my fellow workers who to my surprise were all my age or younger. We became fast friends! Great peeps!\n\nFast forward a year, our shift is the busiest shift for STAT draws and Traumas in ER, the pace is tough but we’re great friends and we handle it and help each other out a lot. All the hospital staff for the most part know us and love us for our hard work and professionalism. \n\nOur boss let’s call her Karen, solely works day shifts and has no idea really what it’s like on our shift. She loves to nit pick about silly things and she doesn’t feel like she is accomplishing anything unless she is telling you where you’re wrong and how you can improve. \n\nOur shift is 3 guys and 1 girl, we all dress in scrubs with a T-shirt underneath. We usually wear any kind of T-shirt as long as you can only see a solid color and it matches/ looks ok. \n\nKaren one day notices and reminds us all that the handbook specifically says that our undershirts have to be white, and that with colored undershirts we are very unprofessional. \n\nI make a remark about all of crazy colored/printed/ graphics of the scrub tops on dayshift( who are all female) and how I don’t think having our undershirts are any more unprofessional than a spongebob scrub top. She explicitly says they are permitted in the handbook but our undershirts were not and we better fix it ASAP and the next person to show up to work without a white undershirt will be sent home to change. \n\nSo later that night I have a solid idea and propose it to my awesome evening shift cohorts, let’s all go out and buy white undershirts, along with the most outrageous and ridiculous scrub tops we can find. My idea is praised and we all go shopping after work. \n\nThe next day me meet in parking lot and all walk in together, my buddy Jonas is sporting a black scrub top covered in vivid red smooching lips, Will is looking very professional in a white top with strawberry shortcake cartoon images all over, and I’m wearing a baby blue and pink Dora the Explorer scrub top, all with white undershirts. \n\nWe walk in and there is lots of laughing and yelling and we draw a crowd in the lab, in walks Karen. Her face turns red as we proudly display our commitment to professionalism and our 100% handbook dress code compliant outfits. She mutters a thank you and scurries off to consult the director who is awesome, the director laughed and said “well, you won Karen, they’re compliant” \n\nWe became famous all across the hospital for our Malicious Compliance and occasionally wore our fun scrubs to work for the rest of our time together.  Great times!",
        "permalink": "/r/MaliciousCompliance/comments/8k78o3/operation_undershirts_a_dress_code_policy/",
        "comments": [
            "I used to work as a CNA and I found the patients preferred my blue scrubs with Olaf all over them over my regular scrubs\n",
            "My mom was a home care nurse and her patients loved her outlandish scrubs she would wear.",
            "That’s an awesome story. Also awesome is the fact that Strawberry Shortcake is still recognized enough to be featured on scrub tops. I used to love me some Rainbow Brite and Strawberry Shortcake!",
            "When I worked as a CNA a few years ago I did something similar. I ended up finding a scrubtop which had a depiction of a zoo all across it. It had close to like 30 different animals on it. The residents absolutely loved it!",
            "Outlandish scrubs with white undershirts are the hospital equivalent to the crazy socks with normal business suit",
            "Karen got what she needed that day. Good work!",
            "I actually prefer nurses and other staff in more fun scrubs, but I've spent more than enough time in the hospital and know my blood pressure tanks when I see normal scrubs because I associate them with bad memories.",
            "I think she was just bored and honestly felt like she was doing her job well by being so nit picky. She was a poor manager, great case of someone being promoted to a level of incompetence.",
            "This is a rather wholesome example of MC. Well done you. ",
            "I was surprised to find out scrub tops with a print was a thing\n\nGreat story :)",
            "I'll never understand why the men's scrubs are so boring but I think y'all should wear the women's prints too. ",
            "I've lived my life by the 'Fuck Karen' ideaology. Fuck Karen.",
            "Love the director! He gets it!",
            "Hey well at least bonus points to Karen for not being a psycho about it, and accepting that you were technically compliant.",
            "/u/Fuck_You_Karen_",
            "I immediately pictured a slow motion entrance full of finger guns and winking in the  music of Party Up by DMX.",
            "If only they made a custom scrub with Karen all over it.",
            "Are cartoon-printed scrub tops really a thing? Where would you even buy something like that?",
            "This story r/mademesmile",
            "I'd love to see a photo if you have one!",
            "For some reason I imagined you as Chris Pratt in this story. And one of your friends as Turk from Scrubs.",
            "I imagine you and your coworkers slow mo walking in, movie style. Door busts open, and in pops 3 dudes in goofy scrubs wearing Aviators. ",
            "I hate these stories because I’d be Karen.\nI hate these stories because under Karen, I’d do the same thing. \nLOL",
            "Back when my mom worked in scrubs at an assisted living facility everybody affectionately called her Patches because she liked cutting squares out of her scrubs on the joints or pockets and replacing it with bits of extra material from her hobby of sewing. They were some pretty unique scrubs.",
            "I love this story - so much fun to picture the day of the Great Reveal!",
            ":)",
            "Such a great story! You guys rock",
            "They are like professional pajamas 😁",
            "My shopaholic/pediatric nurse wife owns more than 120 kid oriented scrubs. A lot more. I quit counting. A few weeks ago she organized them into tubs according to season and holiday. The sad/funny part, she is now on a major diet. In a few months they will all be too large which means, yes, more shopping. ",
            "As long as it’s clean and you’re helping me not die I’m good with it. ",
            "Did anybody else have their \"walk-in\" playing in slow-mo, because I had their walk-in playing in slow-mo. ",
            "As a nurse who worked in a level 3 trauma center and was on the trauma team, phlebotomist are like wizards when it comes to blood draws. \n\nPatient in their early thirties, ejected after a car accident, really in trouble, we need type and cross for the OR but they have no veins. Phlebotomist walks in, hands wave in the air, puff of smoke, and they are off to the lab with a handful of vials. \n\nLove you guys ",
            "Wow. Your coworkers and friends sound like fantastic people. You got yourself a good group of friends there.",
            "If I ever get rolled into the ED, I hope to see your compliant scrubs, I'll feel better, promise!",
            "It's so gratifying that the boss of your boss is on your side.",
            "I never understood how your clothes can make you look \"professional\". A banker in a Disney T-Shirt with tatoos all over his arms doesn't look less professional to me than one in a business suit. It makes no sense.\n\nApparently, I'm lucky to have a job where I can wear whatever I want, and my colleagues, boss and customers think it's funny.",
            "I was sure that you were going to say that you put a white undershirt one the just wore your normal shirt over that, so when she bitched at you you could just show her that you're wearing a white undershirt like she asked...but also wearing a normal short too.",
            "I absolutely prefer seeing someone with designed scrubs like that than plain scrubs lol Show me some humanity in a dreary place!",
            "[deleted]",
            "Karen sounds like a cunt with a stick up her ass.  Why are people like that...",
            "Thank you ",
            "Killed her with compliance. I love it!",
            "Peter?",
            "I think this is my favorite story on MC. Definitely made me giggle. Nice job, OP!",
            "I didnt know scrub pattern tops was a thing.",
            "This totally reminds me of the story of a guy in a Call Center who complied with the Handbook by wearing Hawaiian Shirts only\n\nhttps://www.reddit.com/r/MaliciousCompliance/comments/7hz7a1/my_boss_was_a_tuck_your_shirt_in_nazi_among_other/?ref=share&ref_source=link",
            "Having spent the last few weeks trying to get executives to act more like your hospital director (and less like Karen) I may need to send here to see what best practice looks like in action. Thanks!",
            "Fun scrubs make me kinda sorta wanna work in the medical field. Kinda. Still probably not though I can’t even handle vomit. But at least there are scrubs!",
            "\"Let's call her Karen\" because it's her name.",
            "It’s all about the kids. Need to build up that trust and comfort before shoving a needle into their arms. :)",
            "I would like to believe that director knew Karen was a pain in the ass and backed you just to knock her down a few pegs.",
            "[deleted]",
            "Why is Karen always such a bitch?",
            "Ugh, Karens are the worst. Good win!",
            "This is the most overwhelmingly wholesome story.",
            ":D Nice!",
            "Great story.  This is my new favorite subreddit :\\).",
            ">I worked evening shift 1300-2130. \n\nThat's 1 PM to 9:30 PM, if that's confusing to anyone.",
            "[deleted]",
            "I'm an idiot about hopsital stuff, what's a scrub top?  Is that like a hat or something?",
            "Hah, this is a great story, thanks for sharing! ",
            "What are scrubs? \n\nIs only find the series :s",
            "And then the hospital cheered",
            "Change Karen to Kathy and you have the C U Next Tuesday that I used to work for. Best day of my life was when I told her I quit. She tells me \"but you'll lose everything\" I laughed and said OK by me. \n\nBy everything I thinks she meant the 3 weeks of vacation I was never allowed to use and didn't carry over to the next year. Or maybe it was the daily belittling by tech of how worthless us phlebes were. \n\nThat woman made that place so toxic every one hates working there.",
            "having a supervisor who tries to continuously improve you seems like a pain in the ass until you get one that lets you stagnate and you realize 5 years later that you aren't at the level you coulda shoulda been at and are getting passed over for promotions.",
            "Are we not doing tldr anymore?"
        ]
    },
    {
        "post_id": "n78uit",
        "author": "SinfulPanda",
        "title": "Ice cream shop server tells me that I can't buy a gallon of ice cream.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/n78uit/ice_cream_shop_server_tells_me_that_i_cant_buy_a/",
        "score": 14442,
        "num_comments": 1459,
        "created_utc": 1620421196.0,
        "selftext": "This happened a while ago. The free donut story reminded me of this.\n\nI was going to a family event and stopped at a local farm fresh ice cream shop on my way there.\n\nMy bf gets out to get a gallon of ice cream. He comes back all exasperated telling me that the girl at the counter won't sell him a gallon of ice cream.\n\nI get out of the car and go up to the window and asked for a gallon of ice cream.\n\nIce cream shop server: We can't sell you a gallon of that flavor.\n\nMe: Are you out of that flavor?\n\nIce cream shop server: No. We just don't sell it in a gallon.\n\nMe: It doesn't matter what size the container is in, I just want to purchase a gallon of it.\n\nIce cream shop server: We can't sell you a gallon.\n\nMe: OK, I will have 2 half gallons.\n\nIce cream shop server: We can't sell you a half gallon.\n\nMe: (getting frustrated) What size container do you sell this flavor in?\n\nIce cream shop server: We have it in a quart, pint, cup or cone.\n\nMe: Great! I would like 4 quarts please.\n\nIce cream shop server: (Hand packs 4 quarts, puts them on the counter with snark and ignorance) You can't just buy a gallon of any flavor and we only have half gallons of vanilla and chocolate.\n\nMe: (Blank stare) 4 quarts IS a gallon.\n\nIce cream shop server: (confused look) Really?\n\nMe: Yeah. 2 pints are a quart, 4 quarts are a gallon.\n\nIce cream shop server takes my money then goes to talk to another server. I don't even want to know that conversation.\n\nEDIT: my bad for not explaining US liquid measures.\nA cup is 8 fluid ounces, a pint is 16 fluid ounces, a quart is 32 fluid ounces, a half gallon is 64 fluid ounces, a gallon is 128 fluid ounces.\n\nAlso this was a large dairy farm but the sign isn't like a menu. First there's a list of standard flavors, then hand written are the seasonal and special flavors, followed by a list of prices. I think that the half gallon price says 'when available' and 'brick packed' all other sizes are hand packed.\n\nThere's not a limit to how much a person can buy and I've seen people order insanely large amounts.\n\nIt wasn't busy when I ordered and I told her to take her time, emphasizing that I was not in a hurry as I realize that hand packing takes a while. At this particular place they prided themselves on really packing a lot into a container so it was totally worth buying 4 quarts. I would have ordered it that way if I had known it would be an issue for her. I wasn't looking for special treatment just a gallon of awesome ice cream for a gathering of people, pre-covid.",
        "permalink": "/r/MaliciousCompliance/comments/n78uit/ice_cream_shop_server_tells_me_that_i_cant_buy_a/",
        "comments": [
            "I went to buy some ribbon from a market stall, we were decorating our store for Christmas so the manager asked me to get a full roll of ribbon.\n\nGo to the market stall and ask for a roll of red ribbon.\n\n\"we don't sell entire rolls, only lengths, how many metres do you want.\"\n\n\"how much ribbon is on a roll?\"\n\n\"25 Metres\"\n\n\"I'll take 25 metres of red ribbon.\"\n\nThe look she gave me as she grabbed a full roll of ribbon from under the counter was great, she was so annoyed.",
            "My husband told me this story about his dad getting some pick and mix sweets at the cinema (not sure if it’s a thing in the US, you get a paper bag/ cup and fill with a wide range of loose sweets for an incredibly inflated price or occasionally cheaper for items that come packed in smaller packs normally, weight or size of bag being charged)\n\nHe filled a bag of chocolate covered Brazil nuts and the guy at the counter must have watched him as he weirdly told him he couldn’t buy all chocolate brazil. Dad asks why not, guy insists it has to be a mix. So my FIL goes back to the selection, picks one cube of fudge and in front of the guy, puts it in the bag and ‘mixes’ it in with one finger.\n\nThe guy looked dumbfounded, pissed off then took the payment",
            "I've got a friend that ordered a \"half-dozen gizzards\" once and the waitress responded \"They only come in 6's\".  \"...Okay, I'll take that then...\"",
            "I suspect 4 quarts costs far more than 1 gallon, and what the rule was intended to do was limit gallon discount pricing to just chocolate and vanilla.  \n\nReminds me of the bad old days of calling the DC area Metro transit information line to find out how to get from point A to point B on a Sunday.  \"Oh no, we don't have service for that.\". \"OK, how do I get from Point A to Metro Center?\". (answered). \"And now how do I get from Metro Center to Point B?' (answered).  \"Ok, you've just told me how to get from Point A to Point B.\"",
            "[removed]",
            "I used to work in a creamery that sold cones or cups by the scoop, prepackaged half gallons, or hand packed pints and quarts.\n\nIt always annoyed me when people purchased by the pint or quart, because hand packing hard ice cream is torture on my wrists. Also, it took a long time and held up the line that was mostly people wanting 2 scoops on a cone.\n\nMost of the time, people who purchased pints or quarts were requesting unpopular flavors that didn't come in half gallons, but we had one repeat customer who swore she got more ice cream in 2 quarts than she would get in a half gallon, because we hand pack it.\n\nI tried packing her quarts as loosely as possible so when she opened the quarts at home she'd be disappointed and finally buy half gallons, but it just made her come back sooner and insist that we pack it better.\n\nOne day I told her my opinion and begged her to just buy a half gallon. I pointed out it was literally cheaper to buy a half gallon than a single quart, so she was wasting her money. She explained that was because the half gallons were filled by a machine but the quarts were filled by me, so I should be happy she's paying me instead of the machine.\n\nI said, \"I get paid by the hour regardless of what you order, even on days that you don't come here. Either way, I collect your money, put it in the register, and the owner of the company gets the profits. Not me. If you want to pay me directly, I have a tip jar right there.\" She argued that the more time it took me to fulfill her order, the more I'd get paid. I had to explain that my shift begins and ends based on a schedule, not how long I spend on each order.\n\nOh, did I mention she never tipped? Before nor after that conversation.",
            "I might have the EXACT numbers wrong, but it was pretty much this. \n\nI went to a KFC here in Australia and I was like \"can I have five zinger fillets, just by themselves, not in a burger.\" \n\nCashier: \"Sorry, we can't do that. They don't come in five packs, only packs of four or single fillets by themselves.\" \n\nMe: -blank stare - no worries. Can I grab a four pack of singer fillets.\"\n\nCashier: \"of course. Anything else?\"\n\nMe: \"And one single zinger fillet.\"\n\nTo be fair, she was very polite and so was I and it was clear that she felt a bit stupid straight afterward.",
            "\"Ill take a gil of vanilla please\"\n\n\"We dont sell it in that size\"\n\n\"A Hogshead then\"",
            "QUARTer gallon is what a Quart is. \n\nSad how often people don’t know this.",
            "What flavor were you buying OP?",
            "“Well gee, we don’t have gallon containers but I could sell you 4-5 quarts of any flavor, Mr Customer!”\nWhat their manager wishes they would say as he/she face-palms.",
            "\"I'd like to order 768 teaspoons of ice cream, please.\"",
            "Maybe you needed to order 3.785 liters.",
            "Never thought this would come in handy but I worked at an ice cream place in HS/college and had similar requests. The ice cream was made in batches and frozen in 3-5 gallon metal containers. You could get them for parties and stuff but not by just going to the window and placing an order. They needed atleast some notice to prepare/pack as ice cream wasn't made everyday. You also needed to return the metal containers or you'd lose your deposit. \n\nI assume the place you went splits basic flavors into single gallons when making the ice cream to avoid the scooper having to pack a gallon by hand which could be brutal for them and time consuming during a rush. You order that stuff ahead of time and we'd throw in the cups/spoons/cones and maybe even some sprinkles...\n\nAlso, despite being technically correct four hand-packed quarts likely sells for more than a gallon would. We could also pack them light or heavy depending on the customer interaction. Our large ice cream cup (to-go) was a 16oz drink cup with a lid. 16oz is a pint, but a pint was way more expensive (and packed heavier).",
            "To be fair, it was probably what she was trained to do. And 4 quarts probably costs more than an individual gallon or 2 half gallons. \n\nJust saying, you make it sound like she did you dirty.\n\nEdit: Some of you either haven't had a job or don't have a boss you need to respect and follow orders of lol, acting so entitled honestly lol",
            "Am I the only one amused that while OP smug about \"owing\" the employee, she is also highlighting that her bf also failed to make that conversion?",
            "I mean did they sell anything in a gallon? I’ve never asked at like a baskin robins or one of the local ice cream joints for that.",
            "Most of the time this is due to inventory regulations (don't sell out of the harder to get from vendors), pricing (smaller sizes tend to cost more per oz), or inventory assessment.",
            "As someone who worked in an ice cream shop all throughout high school and college, I can attest that we could only sell in “pint” and “quart” quantities because those were the only sizes available. If somebody had asked me for a gallon, I would have given the same response. Much easier to buy a gallon at the grocery store than spend $6-$8 for one quart and then get four of them hand packed at an ice cream shop.",
            "Given how stupid a system imperial is, I don’t blame anyone for not knowing the magic formulas it takes to get from whatever to whatever.",
            "What is happening to this sub? There is no malicious COMPLIANCE here. OP was told no and then did something anyway. The opposite of compliance. What foreseeable negative did OP attempt to prevent but was told to do anyway? Where is the malice? This sub is becoming r/howigotmyway",
            "This reminds me of the Kitchen Nightmares episode when the owner was absolutely shocked when Gordon told her, that soup of the day means new soup every day. And not just the soup they are having for literal years.",
            "I went to a bar with a friend and she ordered whisky on the rocks. The server asked if she wanted a mixer, and my friend said no. The server looked confused and he poured a WHOLE GLASS of whisky for the price of a shot. She quietly paid for her drink and we left the counter in a silent fit of giggles.",
            "That isn’t malicious, it’s fucking stupid. In actuality you paid what probably amounted to twice as much as you would have otherwise. \n\nYou really stuck it to the man by giving that place a ton of extra money in an attempt to make a point to a high schooler that doesn’t give a shit.",
            "I think most of us who have worked these types of jobs have done this before. We’re so used to our script and repetition that we don’t always recognise a request as being doable when it’s asked in a different way. Not to mention the few times we do try to sling something together someone freaks out and screams that they wanted in “all in the same container” or some bullshit. \n\nImo it’s dumb to not laugh this off as a server and be like “oh yeah, duh you can have a gallon but it’ll be in four containers”. \n\n\nThe first time this happened to me I was 16 and working at a cinema. Someone asked for mixed popcorn and I instantly told them we don’t sell that. We had a 30 second standoff before I was like “oh I can make that up” and got it for him. Ever since I’ve learned to laugh it off when I need a moment to connect some dots during a 10 hour shift.",
            "The opposite of this happened to me as a teenager, kind of. I had just started working at Taco Bell and a guy came in and ordered 3 crunchy tacos and a large drink.\n\nThat's a specific meal, but I didn't know that, and we had separate computer options for meals and separate menu items. So I rang him up for 3 tacos and a large drink individually. He paid, got his food, then finally looked at his receipt and got pissed off at me for not giving him the meal.",
            "So... I worked at a Dairy Queen and people would ask for gallons of soft serve all the time. We didn’t serve them because it would use all our mix and the machines would take another 15 minutes to freeze and everyone else would have to wait. If someone threw that big of a fit over ice cream, we would just do it. People get bizarrely angry about ice cream.",
            "Reminds me of calling a store to find out what side of the street they were on (I live in L.A., we have a lot of very wide,divided streets, this matters).  \n\nme: Are you on the west or east side of the street?\n\nthem: (in a \"how would I know something that weird\" tone of voice) I don't know.\n\nme: Um... so, are you on the side that would be closest to the ocean?  or the side closest to, like, Las Vegas?\n\nthem: I don't know! \n\nMe: Okay, so, say, I get off the freeway, and I'm driving down towards the store.  Are you on the left or the right? \n\nthem: On the left. \n\nme: Great!  (trying to be helpful): so, that would mean, for the future, you're on the east side. \n\nthem: (snotty): That depends what direction you're coming from.  \n\nme: no, it doesn't. \n\nthem: um, yes it does.\n\nI gave up.",
            "In her defense (not of not know measurements, but of not selling the half) she probably both wasn't allowed and didn't know what to price it at. Servers don't usually have the ability or authority to ring in Open items, and not to mention a lot of ice cream places (especially smaller ones) wash and reuse the ice cream serving containers. Just giving you what you wanted because it makes more sense to you could've gotten her in trouble. I've worked at many places with nonsense rules that I have to follow or risk my job, and no amount of logicking by the guest can change that.\n\nYes, the 4 quarts was a good solution and a seemingly foolish loophole, but you're doing a lot of projecting of \"snark\" onto a presumably young woman just doing her job.",
            "All this tells me is OP has never worked in customer service. It’s not malicious compliance.",
            "To be honest this smacks of the same self righteousness of going to starbucks and arguing over a large vs a venti.  The employee didnt setup the store policy on gallons vs 4 pints, and since you knew you could ask for 4 pints why not make someone elses life a little more pleasant.",
            "Does this person think only half gallons can be added to make a gallon? Like, a gallon is some paracausal form of measurement only reachable by the mythical half-gallon?",
            "Haha you sure showed that...most likely minimum wage employee who was just following company policy. Haha got her good by...definitely paying more for 4 quarts rather than one gallon. Good one\n\n\n\n/s\n\nYou got played and you sound like a Karen even from your own POV",
            "My mom once hired a carpenter to build an elevated bed platform with a bookcase at the foot of the bed that worked as stairs to get into the bed. The carpenter said he couldn't build a bookcase that you could walk on. So she told him to build stairs you can store books under. Which he was able to do.",
            "You should have ordered a “butt load of ice cream”. (There are 126 gallons in a Butt. Yes a butt is a unit of measurement. So go forth and drink a butt load of water.)",
            "In her defense, there is most likely a customer out there, who when asking for a gallon is confronted with four quart containers \"But I don't want four quarts, I want a gallon!\"",
            "Reminds me when I worked at McDonalds and someone came through the drive thru and wanted a half ponder and the lady in drive thru said we don’t have a half ponder lol I was like we do it’s called the double quarter lol",
            "It's called a quart literally because it's a quarter gallon.",
            "I get your frustration OP... Sounds like miscommunication from all parties. \n\nYou wanted 1 gallon TOTAL of ice cream. What was ordered was technically not on the menu. \n\nConfusion also comes from the pricing, as traditionally the more you order the cheaper the price per volume/weight. \n\nSince the flavor you wanted only came in quarts you had to order 4x 1 quart containers and pay 4x the 1 quart price. \n\nServer didn't now normal math (conversion) bit was advising you most likely thinking you wanted a 1 gallon container at the 1 gallon price.",
            "I don’t blame the ice cream worker whatsoever.. every unit of measurement in America is stupid as fuck.",
            "As someone who used to work at a family owned ice cream shop that seems very similar to this, I feel for this girl. It is extremely time consuming to pack 4 individual quarts, and while I do not agree with how she went about it with her snarky tone, she was probably having a bad day. The shop I used to work at only allowed pints to be sold, and I would be more than happy to pack pints, but I would prefer a call ahead instead, so I can make sure we even have enough ice cream to provide. Calling ahead makes this much more convenient, so you can tell her what you want, and she can give you a run down on what they have and how much they have. That way she won’t be flustered when you come in and ask for that much ice cream. You could even give her a time when you could come in and pick it up and pay, which would be even more appreciated. Thank you for supporting local businesses!",
            "When did malicious compliance become “people being dicks to the service industry and posting in the internet for points about it later?”",
            "Hot dog vendor sold hot dogs for 2.45 each and 5.00 for two. Tried to explain it to her that it was more expensive that way but they couldn't wrap their head around it. I bought one then bought a second one after I scarfed down the first.",
            "I don’t know how OP thought this made them look good. I’ve worked at at ice cream shop before. Sure the server didn’t know the conversion, but it’s not like she was being malicious because she’s listening to store policy and doesn’t get paid enough to care to explain it to every customer that asked for a gallon. I can get how it could be annoying that she  didn’t specifically tell you to just buy four of the size she’s allowed to sell it in, but I can’t imagine being angry over that.\n\nCertain flavors are made in much smaller batches compared to staples like vanilla and chocolate (which there are tons of in the back freezer if they’re being offered in half-gallons). The store probably gives a slight savings on the half-gallon containers of the popular flavors, and it’s worth it to get employees to pre-pack since people will actually buy them.\n\nAt my store the largest we sold was a quart and we only pre-packed the most popular flavors. Anything else had to be hand packed at the counter because if we couldn’t guarantee it would sell, it would be in the freezer for too long to maintain top product quality.",
            "At sonic, I wanted a route 44 chocolate shake, but we don't sell 44 oz chocolate shakes. Ok give me a 32 oz a 12 oz and a route 44 empty cup. Got it.",
            "Could you slice the pizza in 4 slices? 8 is too much for me.",
            "Reminds me of Super Troopers and a Liter of cola.",
            "When I was in high school, I worked on a dairy farm milking cows.  I had a female high school acquaintance convinced that I milked ducks after school (They were Guernsies) for a living.  I think that lady must be the mother of your ice cream server.",
            "to be fair i live in the us and have completely given up attempting to understand imperial measurements. i do almost everything i can in metric and its far easier. why the US doesnt just convert ill never understand",
            "Huh and there was me thinking that US measures made zero logical sense, but it's just like how metric uses powers of 10, us imperial uses powers of 2 at least when it comes to volume",
            "Next try ordering a \"liter cola\". [https://www.youtube.com/watch?v=S8LtffE5mU8](https://www.youtube.com/watch?v=S8LtffE5mU8)",
            "I had a guy ask how many slices of pizza come on a pizza? I asked him how many do you want? He got angry so I told him 8. Then I gave him his pizza with 6 slices.",
            "I don’t think the worker should be mocked in this scenario. At a nice cream shop, people usually aren’t coming in to but gallons of ice cream. They’re serving smaller sizes. This should be under r/amitheasshole",
            "You fucked with someone who doesn't set the rules for the store. Epic.",
            "Friend in a bar once ordered a double scotch, neat. \n\nGot told \"we don't do doubles, and we have to do it on the rocks\"\n\nHe tried explaining that no, it was easy... The way you pour one shot? Just do it a second time! And don't add ice!\n\nNope, no can do.\n\nHe ordered two on the rocks, and before he paid, looked the guy in the eye, took the ice out of one glass into the other, then poured the scotch into the now iceless glass, handed the ice glass back and paid.",
            "Stories like this are so hard for me to believe. Not saying this one is made up, but so many times they are just to make the writer look like they just absolutely OWNED somebody by being smarter than them. I know people like this do exist out there, but I can honestly say that I’ve never encountered one personally. Yeah sometimes they’d have a brain fart, but someone who would act genuinely surprised to find out that 4 quarts make a gallon? Just seems wild to me.",
            "Just more reasons to go metric",
            "A local sandwich shop sells 'sandwich kits', which is bread, deli meat, toppings and dressing all on the side. I sometimes would get 1 and take it to work so the sandwich wouldn't get soggy being left in the fridge all morning. \n\nOne time I went in to just buy a few loaves of their amazingly soft bread. They said they don't sell bread. So I ordered 2 veggie sandwich kits with only lettuce. Threw the lettuce out as I walked out the door. They charged me like $10 for 2 loaves of bread but it was worth it",
            "Life would be so much easier for you if you would just shift to the metric system like the rest of the world.",
            "Thank you for being shitty to someone working a cash register who doesn't make the rules to begin with. Enjoy your internet points.",
            "Why didn’t you just look at the menu and order what they’re configured to deliver?\n\nDo you go to McDonalds and say “gimme a burger”? No you tell them the number or what you want OFF THE MENU. \n\nYou honestly come off as a straight up Karen.",
            "Massive face palm 😂😂",
            "That's.... incredibly depressing. \n\nI hope they were new.",
            "Not so malicious, but plain stupidity of the server.",
            "“Six of one, half a dozen of another.”",
            "Lmao bet that was a pricey gallon",
            "Went to McDonald's soon after they started 24hr service late at night and ordered a 10 piece chicken mcnuggets. Was told they only sell it in 5 piece, so I said give me 2 orders of the 5 piece.",
            "That’s okay “1/2 and 1/3 makes a whole”... some adults didn’t pass the 4th grade.",
            "Our school system at work because heaven forbid we teach people any knowledge or skills that might help them in life or with a job. But we are really worried about which bathroom they can use.",
            "I once went to subway and asked for a foot long. They said they didn’t have them bc they already cut all the bread.... I was like can’t you just give me two halves?? They said I would have to pay for both, it was the absolute dumbest argument I’ve ever had.",
            "One fourth is a quarter. One fourth of a gallon is a “quart”. I was in my 40s when I realized.",
            "I like metric.",
            "I'm from the metric part of the world, and the ONLY weird U.S. measurement unit that makes sense to me is the \"quart\", because it's literally a \"quart\"er of a gallon.\n\n(No idea how big a gallon is though)",
            "Whaaaaaaaaaaaaaaaaaat?",
            "She is probably from outside the USA... you guys know everyone else in the world uses metric right? I have no idea what a quart or gallon is. I do know pints though, for some reason our pubs still sell those!!",
            "An old man running an ice cream shop can be a real douche.",
            "The real villain of this story is the imperial system",
            "I love how you explained the US system to the metrics by adding oz to the equation.",
            "Ooh ooh I had this with nuggets at McDonald's! I wanted 12 nuggets for me and my daughter to share, and she told me, we don't sell them in 12.. So I asked can I have two 6s then? Yes.. Eyeroll",
            "Jesus, Americans are some of the only people to use imperial and they still don’t get it.",
            "I was about ten years old when I knew that there were four quarters to a gallon. It was just another in a series of conversions I had been taught - two cups is a pint, two pints is a quart, four quarts is a gallon.\n\nI was in my thirties before I realized that \"quart\" was derived from \"quarter\", so of course it's a quarter gallon.",
            "This has real \"liter of cola\" vibes",
            "Blame the person that trained her. She is told what sizes come in what flavors. That is what she was going by. Whoever runs that place should put up a measurement chart. This reminds me of when I briefly worked at a Starbucks kiosk in a grocery store. This older lady, had to be close to 60, comes over asking \"How do you sell the ice cream?\" I was confused by the question and asked her what did she mean. She just repeated that question. I told her, \"A customer orders it and we sell it to them.\" She gets mad and repeats her question again. I told her I don't understand what she is asking me. After the fourth round of this she finally asks, \"Is it in a cup or a cone?\" I had never had anyone ask me about the ice cream containers like that before. I also wasn't the only one working the counter, and none of the other employees said a word.",
            "'let me explain measurements' proceeds to use more nonsense measurements.",
            "This doesn't really feel like malicious compliance, just an ignorant server",
            "Not US measures. It’s the imperial system!",
            "This is more about the quality of the persons primary school education.\n\nIf you really want to have fun, If it isn't busy, ask any clerk if  know how to count change if the register isn't working and watch them try and do math in their head, as opposed to counting up.",
            "40 rods to the hogsheads….. am I right Abe Simpson.",
            "Quart, as in quarter. That should be the easiest one to remember!",
            "Reminds me of the time that the grocery store I worked at had Ritz crackers on sell. Customer asked if all the 1 lb boxes were on the sale, I told her yes. She then asked if that included the 16 Oz boxes.",
            "What a ridiculous measurement system."
        ]
    },
    {
        "post_id": "wrlv03",
        "author": "Mr-Mando",
        "title": "I was told I needed to “smile more”, ok then",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wrlv03/i_was_told_i_needed_to_smile_more_ok_then/",
        "score": 14442,
        "num_comments": 565,
        "created_utc": 1660835005.0,
        "selftext": "I worked as a tech support for a global insurance company with three big letters.  Our old manager retired, cool guy, not a micromanager.  We get this new one who was, right away very confrontational, he was a my way or the highway kind of guy, even when we explained the bureaucracy of our company and processes.  For whatever reason he had it in for me, went as far as make comments in front of everybody about replacing me.\n\nAt one of our employee review meetings he said he was getting complaints of me “not smiling enough”, which i fond very odd because I consider myself a likable person and I’m always joking with other users and employees, which I’ve found helps with the job.\n\nSo he continues and even goes as far as to show me how to smile 🤣🤣🤣.\n\nCue the malicious compliance\n\nI proceed to give out the most forced, creepy smile humanly possible every time i interact with a user, every single time.  People asked me what was wrong and i always answered “Following an employee review I was instructed to smile more, so I’m smiling”.  I was doing this for like a couple of days and after an interaction providing support for Human Resources, with the smile and explanation, I went back to my desk, couple of minutes later I see HR lady go to  my bosses office, they were there for like half an hour.  After she leaves boss calls me in, and telms me I don’t have to smile anymore.\n\nI respond sarcastically with “aww do I really have to stop?”\n\nHe looks at me and tells me that’s all.\n\nHe left like a year later, no one, not even the other managers liked him.",
        "permalink": "/r/MaliciousCompliance/comments/wrlv03/i_was_told_i_needed_to_smile_more_ok_then/",
        "comments": [
            "I hated when people told me to smile more when I worked at my night shift coffee drive thru. One guy said “you know, if you smile more, you’ll get better tips.”\nAt the time I was going to college during the day, freshly lost my mother to cancer, and working nights full time. \nI replied with, “you know, you should say that to your wife and have her make your coffee then.” He never said anything about me smiling again, and he started tipping the night shift staff.",
            "About a decade ago I worked as a Security guard at a big name British supermarket. The company actually had two types of guards, their own internal security who manned the CCTV out the back and did LP in the store and, uniformed Security guards (Contractors), like me. who stood at the entrances whose basic job was to be visible, check receipts when the anti theft scanners went off, and occaisionly stop shoplifters as they exited when the CCTV had caught them.\n\nThey used to insist we had to do the same internal training courses as their own staff. One of these was a customer service course, where one of the suggested activities would be for everyone on the course to go to the main entrance and stand outside waving and smiling to people as they entered.\n\nI pointed out we were ALL noticeably wearing uniforms with Security written all over them and that personally if I went to a Shop and saw about 10 Security guards waiting outside the entrance smiling and waving would turn around and leave thinking something major was about to go down",
            "\"Gosh, I'd love to stop, but my mom was right about making faces and now it's stuck this way.\"",
            "When I was working customer service at a grocery store, I absolutely hated when people told me, \"You need to smile more\" or \"you'd look so much more beautiful if you smiled\". A few times during covid when masks were mandatory customers still said, \"I don't see you smiling\". So what did I do? I closed my eyes, tilted my head a bit, and drew an imaginary smile over my mask. \n\nDo I have a resting bitch face? Yes. Does that mean that most times I'm in a bad mood? Depends. Am I going to work on fixing my resting bitch face? No. Because it keeps most strangers from approaching me when I'm out in public.",
            " I like to either look them in the eye and say \"I AM smiling' and maintain eye contact until they go away or do the \"murder\" smile.",
            "Good one, you should post this in r/mademesmile :)",
            "I have RBF. I’m also constantly cracking jokes to friends and laughing. As a female, the number of times I’ve had a male tell me something along the lines of “you have a beautiful smile, you should use it more often” is countless. And there’s no good response to it. What, do you want my now VERY awkward smile? Do you want me to thank you for your backhanded compliment? Should I throw myself at your feet sobbing in silent gratitude that you’ve acknowledged my existence so you feel you’ve done a good deed? \n\nI started responding. \n\n“Well, give me something to smile about, then.”  Deadpan. Dead look in My eyes. Not even an eye twitch. NOW who’s smiling awkwardly?  Stammering? Or they get indignant and then I just laugh and say something like “rude, isn’t it?” \n\nNo regrets. 😈",
            "We had a family member that had some kind of nerve damage in her mouth/face, and she could NOT smile.  People could be so rude - was she supposed to wear a sign???",
            "I was working in a large office with a ton of people and this one older guy was OBSESSED with me smiling more. He wasn't my boss, nor even a colleague. He was essentially a client that worked within the office. He complained and complained about me smiling constantly. My boss caved to this mans demands and was always telling me I needed to smile.\n\nThis pissed me off for two reasons\n\n1. I was in the middle of having major dental problems and was having a major procedure or surgery on my mouth about once a month or so at that point. I had very limited movement there and my boss knew that.\n2. He was one client out of 300. Not one other client ever mentioned it at all.\n\nWell I did smile at him after while, creepy just like you did. But one day I was distracted and didn't notice him walk in and he went full on lecture about me smiling. One of his favorite points was \"It is just rude and unbecoming of a young lady to not smile\" The owner (my big boss) happen to walk in behind him and he didn't notice because he was to busy being a dick. She let him finish then made herself known and said \"I find men trying to control a woman a third of their age really unbecoming and rude.\" He never spoke another word about the smile. I work there for another year and never once smiled at him again and I could just see how much it killed him not to say anything. Eventually he just avoided me and I was A-ok with that!",
            "Godddd so one of my old jobs gave mirrors to the technical support team as a reminder that they should be smiling while on calls (no video, it was literally about \"you'll have a better tone with the customer\").",
            "I've always hated this, 'you should smile more.'  'Smile, it's not that bad.' 'won't kill you to smile.'  \n\nA few times my response was, why!? Look around you whooo tf is smiling right now? No one. No one walks around smiling all the time, it's creepy. Find me one, right now and I will smile all you want.",
            "I have a naturaly dour face and when I smile people worry that I'm up to mischief.\n\nIn public I look like a psyco apparently lolo",
            "I get told to smile more all the time.. but honestly after my son died three years ago, I find it really hard to smile anymore... so people who tell strangers this, please stop! It may be a nice gesture in your world, but for some of us who struggle just to get up every day and do the basic functions to exist, we don't care for it..I'm sure there are very good intentions behind them saying that, but please just let me be angry with the world in peace, thank you 😊",
            "My favorite is when old white men tell me “you’d be prettier if you smile”. \n\nI always tell them that they would look smarter with their mouth shut",
            "My coworkers tell me that as well. I still don’t instead I stare at them. My right eye is dead and has that milky clouded look to it and it unnerved ppl. The person who first told me that is still working here and I get enjoyment making him uncomfortable during team meeting and such bc I always sit near or stand near him. I never say a word either.",
            "A few weeks ago at work I was moving some heavy tool boxes around and a man came up to me and said \"you should smile,  it would increase your face value\". Like wtf does that even mean you asshat",
            "I had a boss complain about my \"tone\" after he woke me up at 2 am w/a work question.  I was just like 'Dude i just woke up. '  He did it to another coworker who also couldn't go from sleepy to chipper-happy in < 1 second.",
            "My favorite TShirt is one I was given when volunteering for a charitable event:  “ Be kind when yelling at me, I’m a volunteer!”",
            "This reminds of the guy who was told during his annual review that he needed to be 'more visible'. So he started to wear a high vis jacket to his desk job.",
            "You know what's weird? I'm a guy and had another guy (not manager, peer) tell me to smile more. I was so angry. I can't even imagine how it makes women feel when it comes from their managers. I only got 1% of that energy.",
            "I would have responded maybe I would smile more if my boss didn’t threaten to fire me so much and berate me in-front of colleagues. What an absolute asshat.",
            "Whenever someone tells me to smile more I tell them to just become a more enjoyable person to be with, and I totally will.\n\nSame thing whenever someone tells me that I'm too quiet. Oh really? Well why don't you learn to fuckin entertain yourself then, huh?\n\nI don't speak when I don't have anything to say. Buy a damn radio if you need constant blabbering.\n\nGrrrrw I hate extroverts who think there's a minimum for how pushy and annoying and obstrusively boring everyone should be at all times.",
            "If anyone, especially a boss of a different sex or gender to me, tells me to smile, I'm taking that shit right to the top for sexual harassment. lol",
            "One time a supervisor told me I needed to be more jovial so I got my nails done and painted them in the color “jovial”",
            "I love it. I’m picturing the creepiest, most over-the-top smile and I’m absolutely dying 😂",
            "I was picturing like the Jim Carrie smile from the mask some reason. Lol good for you, can't get mad for doing as your told.\n\nI also hate when people say 'if you smiled more you would be so much prettier. When they say that I also think like 'Ma'am I have rbf and I want to live in a swamp like Shrek, let me be...lol\"",
            "Glad he ended up leaving, the \"talking about getting rid of you in front of others\" bit would have been enough for me to open a case with HR about him.",
            "You how little kids when they don't really know how to smile kinda look insane?  Smile like that.",
            "Reminds me of the time my department head at a former job told us to smile when answering the phone because \"the caller can hear the smile in your voice.\" They did nothing to foster a work experience that was conducive to smiling.",
            "Gotta love when idiots feel it’s socially acceptable to tell another adult what to do with their face….",
            "Lord, I hate these self-satisfied, egocentric bozos who think that the people around them are merely decorations for their own lives.",
            "I hope part of this played out like [that scene in Terminator 2](https://youtu.be/1ANUP5-aW4E).",
            "I had a brand new coworker tell me I should smile.  I told him \"it's not appropriate to tell women how their faces should look\" and he tried to say I just didn't look happy. I said \"I look like I'm focused on my work, because I'm focused on my work. It's what the company pays me  to do\". Jerk. He didn't last very long, thank goodness. Even the guys in our team thought he was creepy.",
            "The whole time I'm reading, I have thoughts of the smiling and interactions with clients to be like scenes with Jim Carrey. \n\n\"Alllllrighty, then!\"",
            "People like this think they are so smart with their mythical \"complaints\" that suddenly manifest from nothingness and have absolutely no legitimate paper trail. I'd rake them over HR coals and piss lighter fluid all over it to drive the point.\n\n>At one of our employee review meetings he said he was getting complaints of me “not smiling enough”\n\n\"Oh, really? May I see them, please?\"\n\n\"Uhh, uhh, uhh, you see... it was all in passing and not written...\"\n\n\"So not *actually documented* complaints? So why are you bringing this up? Let's go chat with your manager...\"\n\nAct like a manager to everyone, even the other managers. More often than not, you're talking to a middle manager who \"failed\" their way into the position, have no idea how to deal with it, and eventually - rightfully - exit the position one way or another.",
            "“And don’t forget to smile…” - [John Waters (“Do the Creep” song)](https://youtu.be/tLPZmPaHme0)",
            "Reminds me of a time where a co-worker, who was very popular with the customers, was given a negative review because their signature was to large. You just can't make this stuff up",
            "I once got in trouble for laughing, then got in trouble after for not smiling enough... lol",
            "I have pretty bad anxiety and a naturally nervous expression. I also took the \"I'ma make Joker look normal\" approach to being told to smile more.\n\nNever had anyone tell me that a second time. Just different people.",
            "Instead of telling you to smile, why can't they just ask (in a concerned voice) if you're ok? Oh, yeah, bc then they might have to take on the \"burden\" of listening to your story and trying to make you feel better, rsther than blaming you for not meeting their \"make me happy\" standards.",
            "I got written up because my smile was not sincere enough. I had depression and my grandmom had cancer. What more do you want?",
            "Telling someone else that they should smile more is a passive aggressive way of passing judgement.  These are Karens and should be treated as such.",
            "Hey, OP, are you a woman because that can be considered sexual harassment\n\nEdit: Someone made a good point. Doesn't matter the gender, OP can still make sexual harassment claim.",
            "Everyone who has ever asked me to smile has gotten spammed with memes like \"smiling gives you wrinkles.  Resting b**ch face keeps you pretty\" they eventually stopped. \n\nPsychologically,  men want females to smile so they're less scary and more approachable. <sarcasm>So of course women everywhere are lining up to be Malibu Barbie.",
            "I got told that yesterday at work and said “No. I don’t do that.” First time I ever stood up for myself and I’m semi proud of it.",
            "Can I safely assume you are a woman?",
            "I was recently told by a boss, \"I want you to be happy at work.\" That sounds kind, except it was part of a conversation about how it would be best for me to leave.\n\nI didn't leave, and I am now over-the-top happy all day. My boss is thrilled with my transformation, but my colleagues all know what's up. At some point, my boss has got to realize, too. It's going to be an interesting year...",
            "Toxic leadership really does fuck up a workplace. Hell, come to think of it, it will fuck up an entire society if given half a chance.",
            "I worked at Disney backstage in the costuming area and my poor coworker gotten written up for “having a mean look to her face”. Disney had a HUGE policy around not ruining the magic and a lot of possible writeups fell under that umbrella.\n\nI felt bad for my coworker as most of us who worked with her knew that’s just her face and she was probably focused on processing some orders.",
            "\"you should smile more\"\n\n\"you should mind your own fucking business\"",
            "The relevant Dilbert:\n\n[https://dilbert.com/strip/1993-11-18](https://dilbert.com/strip/1993-11-18)\n\nThese comments also remind me of the Monty Python skit on Happy Valley, where anyone who was in any way depressed or unhappy or had any difficult personal problems was prosecuted under the Happiness Act.",
            "Im a trucker. Im a woman. I work with men. Very little of my interactions are with women.\n\nBeen told to smile more... Youll bw prettier if you do... Youll be more likeable... More bees with honey than vinegar... Etc. Etc. Etc.\n\nPregnancy, shit genetics and bad hygiene brought me to missing teeth. Used to be just the molars. Now ive got the left front tooth missing.\n\nSmile more.... I just literally show my teeth. Clench my jaw and GRIN.\n\nNobody likes it. Nobody asks me to smile anymore.",
            "I'd be willing to put money on OP being female.  This \"smile more\" shit needs to be flagged as sexism if it hasn't already been",
            "As someone with rbf I hate being told to smile. The muscles at round my mouth don’t work properly so I look terrible when I smile.",
            "I imagine you look like the T800 when John Connor was teaching him to smile.",
            "Every time I’m asked how I’m doing and I say fantastic, I am always told the same thing..”better tell your face” 😂😂😂 But seriously fuck you.",
            "Widen your eyes a bit to get a little white around them. Smile with teeth. Mentally think like Wednesday and wood chippers. Don't use the 'please don't hurt me smile'. Use the 'you would look good in pieces' one.",
            "My only question is are you female. It always seems to be women who are policed for not smiling. And especially by men. It is part of our job to appear pleasant. I’m really glad you were able to make pleasant as unpleasant as possible",
            "I had a supervisor tell me to smile at work one time and even asked me to smile for her, when  I did she told me to stop as I was making her nervous. I have been told that I get a VERY devious look when I smile and it scares people, think Cesar Romero's 1960s \"Joker\" but with a closed mouth.",
            ">I see HR lady go to my bosses office, they were there for like half an hour.\n\nHeh, half an hour means she was trying to pinpoint exactly what the problem was, and ultimately decided the boss was full of shit and told him to reverse the decision.",
            "Wow, HR sided with the employee and not the manager? That doesn't happen everyday!\n\nOP, did you have a good rapport with the HR person in question? I'm still shocked they took the initiative, without you formally complaining, to have your back on this one.",
            "I never get this, am I supposed to walk around looking like Jack Nicholson’s joker?",
            "I want to see the smile so bad.",
            "I'll smile when you (the obnoxious manager) get fired 😂",
            "What I always think of when people say to smile more. \n\n\nhttps://youtu.be/ABxH-NTF0SM",
            "Some people just aren't made for management. Sounded like a big 🍑 to me.",
            ">I proceed to give out the most forced, creepy smile humanly possible...\n\nshades of [Sheldon Cooper](https://www.youtube.com/watch?v=x6rio-NabKw) :)",
            "I swear I want to punch people in the face when they tell me to smile then say \"smile! no excuses!\"",
            "You are amazing!! Chances are his stupidity would not have been realized by HR had it not been for your smiling demeanor. Great job!",
            "Why hasn’t smiling lost it’s appeal yet? Everyone knows that every employee is smiling because they’re forced to, so doesn’t that diminish the value of a smile?",
            "Please take a photo of the smile. I we have to see it. You can clue your eyes and any other identifying features lol",
            "\"Smile like you're in a 'proof of life' photo\"",
            "\"You're here to support users, not kill Batman!\"\n\n-with apologies to Big Bang Theory\n\nEdit: bazinga!",
            "Was it a Wednesday Addams smile?",
            "I struggle  with crippling anxiety,  depression and bpd,  pretty sure I'd explode if I was told to smile more. Like mofo if you made me happy, I'd smile, leave it at that.",
            "I had a bitch of a boss tell me I was \"too jovial.\"",
            "“There is no war in Ba Sing Se,” job description type of smile?",
            "I don't get the idea of new managers joining and immediately trying to change stuff, give it a week or two to figure out any large issues you need to deal with immediately, work those out with your employees, then keep listening, learn policies, the office politics and slowly introduce changes to combat the issues your see together with your team",
            "I never got that because it’s like we’re not face to face with people unless they’re in front of us or on video. Like companies do the most without even putting more effort in employees.",
            "was it like a Sheldon Cooper smile?  those are my favorite",
            "Are you - and I'm just guessing - a woman?",
            "If I'm told to smile, I'll just mask up.",
            "Man I’m glad I read this. I’m Gen X, and I have told women to smile. I’ve not done this to be creepy but because I really was trying to brighten someone’s day as sometimes you can just tell someone is having a bad day. It never occurred to me why they were having a bad day. 🥺\n\nThe chances of anyone I’ve ever said that to actually reading this is probably slim to none.   But I am going to publicly apologize here just in case. So ladies, I apologize for not being sensitive and being unintentionally creepy. I at least know enough now to do better.",
            "I used to lead worship at church. One morning, in between services, I was joking around with my friends and laughing. This lady came up to me smiling from ear to ear and told me, “You have a beautiful smile.” I said, “Thank you.” Then she said, “You should use it more when you’re up there,” pointing to the stage. Still think about that 10 years later. I can’t think of anything less authentic and irreverent than approaching God in worship with a shit-eating grin. How beyond creepy is that? Anyhoo, I don’t sing in front of people anymore. Still love God, but I’m super annoyed by most of his followers.",
            "# AIG",
            "\"I have been diagnosed with major depression. I don't like talking about it because it has led to people treating me different in the past. Dealing with a chronic disability is a pain, and I don't expect everyone to walk on eggshells around me because of it. Speak with him politely and I'll be willing to chalk this up to ignorance. Anything further will be viewed as harassing an employee with a disability and will be responded to appropriately.\"",
            "This is me with eye contact lol. Thanks for the laugh OP.",
            "\"don't *have* to\"\n\nShould have continued until actually told to stop.",
            "I've never experienced the \"smile more\" comment but I think my response would that I would smile like I'm about to go for their throat.",
            "Not sure how smiling more makes your tech support any better, so it seems like a stupid thing for the supervisor to get bugged about anyway.  I also highly doubt the report that he even had complaints about you not smiling enough, whatever enough is.  Probably just power-tripping because he thought he could get away with it.",
            "[Relevant Dilbert.](https://dilbert.com/strip/2001-02-14)",
            "Smile and wave boys, smile and wave\n\nHaha I love it!",
            "As a teacher, I was told this. When I did smile, one of my kids said, \"Uhhh, Miss? You look like you're about to bite somebody...\" \n\nAre you doing the Mr. Burns hunched shoulders and clasped hands with your creepy smile?",
            "Usually, telling a person to smile is said from a male to a woman. I am glad the idiot left the company. He made comments about replacing you in front of other workers? I already hate him. Your malicious compliance was golden. Sarcasm is my second language, too.",
            "I worked at a fast food restaurant and the shift leader told me to smile more and to think of it as acting (I can’t remember but it could be because I used to do theatre that he said that). I explained to him that I’ve actually been taught that a smile would be as a response to an impulse given by the person you were acting against and/or the situation and not something that you just plaster on. I still smiled plenty because I’m fucking delightful but I was apparently not in the mood to put on a show that day… \nIn other words: I support your creepy smiles 100 %, OP.",
            "I absolutely hate being told to smile by random people.",
            "I worked for the same company. Oh my. They were not a good employer",
            "theres a wkuk skit where a tv director keeps making the actors redo the scene \"happier and with your mouth open\" to the point where they cant form words\n\n\ntry that, its hilarious XD",
            "That's so awesome",
            "That's so hilarious.\n\nAll you have to do to succeed in this role is let everyone tell you how they do their job, and then make sure they're doing that.\n\nThat's it.\n\nThat's all you have to do.",
            "I had a manager once ask me why I didn't smile more. (I tend to have an RBF.)\n\nI told him I'd rather have an RBF than walk around like a grinning idiot.\n\nHe left me alone after that.",
            "This is the best MC, well done to you!! Gonna take a leaf out of your book if this ever happens to me!",
            "I'm just imagining if someone told me I needed to smile more... I'd be so sorely tempted to smack them with the kind of mood I've been in lately.",
            "Glad that they went and not you. So many times in MC it seems to be that OP is always the one to go.",
            "Funny thing about managers...they don't seem to last as long as employees.",
            "I love when people tell me to smile and with a perfectly straight face look at them and say: I am smiling.",
            "An employee at a grocery store told me to smile more when I was stressed out and worried about my wife that had been diagnosed with stage 4 pancreatic cancer a few weeks ago. Fuck that girl. I was in no state to smile.",
            "Funny how they never tell men to smile more. Such sexist bullshit",
            "Was offered a position with your company, liked the team. The HR hiring manager was crazy though, low ball offer which I rejected. Was labeled unruly for trying to negotiate an appropriate salary for the expected amount of work (this is a business and client focuses position in NYC). Oddest experience of my life.",
            "There's a movie coming out titled \"Smile\". I wonder if your smile was like those possessed victims (you can find the trailer).",
            "Let me guess, you're a woman...",
            "I  tell men to smile more all the time some of them get so angry and confused but the women understand and we all laugh.",
            "While reading this I thought of a situation about 30 years ago where I was told a similar thing. At times I remember it  and think that if im not smiling I must look awful. Funny how that sort of derogatory comment is never forgotten.",
            "Weird question: Are you a woman?\n\nIf so that makes so much sense.",
            "I understand the whole, \"you should smile more,\" as it does help with customer service, and no one wants to be served by a mopey person.\n\nAll that said, I would never tell someone to smile more, as that's kinda rude, and also, I want to believe that most people know how to act in a customer service position (of course I also know that a decent amount of people do not know, and they do need to be told)",
            "Classic!\n\nSeriously, I am with you, OP. I am SO sick and tired of people telling me to \"smile more\".\n\nSometimes, I'm tempted to give them a sickly sweet smile in return and give them the good ol' one finger salute.\n\nBut you were only obeying orders.\n\nIt's good that this boss is gone.",
            "are you a woman ?",
            "I’m of two minds with this one… on one hand: customer service in my native country of the US is absolutely PALTRY compared to other countries like Japan. The straight up attitudes you get from some workers for no reason takes me by surprise whenever I come home from a Japan trip. \n\nOn the other hand, I feel like people shouldn’t be forced to smile if they’re not happy. \n\nWhat comes to mind is that I wish it were a natural, generally accepted thing that you smile when you greet customers, at the very least.\n\nEdit: Guess not many people agree lol.",
            "I didn’t get a job once - fairly high up in my former profession - and was told it was because I didn’t smile enough during the interview.",
            "I’m laughing for real after reading that. Brilliantly played.",
            "Time to start carrying a blood capsule in my cheek just in case.",
            "Brilliant.",
            "You did exactly what I do when people tell me to \"smile more,\" and with the same result.  But you did it at a pro level.  Well played.",
            "Talk less, smile more, don't let people know what you're against or what you're for",
            "Crying now, smiling later!",
            "Thank you for the laugh.",
            "Thank you for sharing! This made my day.",
            "CZN Burak, lol.",
            "[look happier with your mouth open](https://youtu.be/ABxH-NTF0SM)",
            "[Data Smile](https://c.tenor.com/gzglRUk9YpAAAAAC/dance-startrek.gif)",
            "[That reminds me of Dwight](https://www.reddit.com/r/DunderMifflin/comments/13qjyi/a_little_smile_and_a_nod_shows_that_i_hear_you/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "Anyone else get the Marshawn Lynch \"I'm only here so I don't get fined. \" vibe?",
            "Reminds me did a summer program at a YMCA camp once and one of the activity reviews was literally \"Did not give enough high fives\" -demerit. So I gave out more high fives. Kids asked me what the heck I was doing and all I could say on why I was giving high fives when literally no one wanted one was because that's what the counselors said. Got so many demerits for not doing things the kids hated, hindsight it's no surprise the CA's snapped.",
            "IBM?",
            "Ha my neighbor and good friend is employees by tht same three letter insurance company. She deals with the bigger corporate insurance gigs. Does very well and is on the rise it seems",
            "had idiot management tell me to smile. i suffer from a tmj (jaw) disorder. and i have no teeth. i smiled and he told me it didn't look right. sorry... this is the only way i can. he told me to forget it...... some people you can't please, huh....",
            "Be like [Bob.](https://static.wikia.nocookie.net/p__/images/e/e9/Smilingbob.jpg/revision/latest?cb=20170208205900&path-prefix=protagonist)"
        ]
    },
    {
        "post_id": "loyek3",
        "author": "dmgt83",
        "title": "When taking a dive on a test worked out better for everyone",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/loyek3/when_taking_a_dive_on_a_test_worked_out_better/",
        "score": 14428,
        "num_comments": 666,
        "created_utc": 1613918527.0,
        "selftext": "When I was in college I took a class with this gem of a professor. On the first day of class he asked how many people thought they would make an A. This being a tough engineering school where a C actually was average, something like 5 students out of a class of 60 raised their hands. He then announced that's how many A's he would give out that semester.\n\nAll of our tests for that class were multiple choice exams we took online. We were allowed to refer to our notes during the test and we were allowed to study from old tests as long as we didn't refer to the old tests during the exam. Fair enough.\n\nI studied for the first test but didn't have access to any old exams so I did fine but not great. By the time the second exam rolled around I had made a friend who was in a fraternity that had multiple copies of old exams from this professor. We and a couple of others took advantage of the rule allowing us to study from old tests. We quickly discovered that on these 50-question tests the professor had a repertoire of about 75 questions he pulled from. On the first copy of the test we studied from we took the time to work through the answers to make sure we understood. By the time we got to the 4th copy we could answer before we even finished reading the question.\n\nExam time rolls around and, just as with previous years, he pulled from the same pile of questions. I think it took me 12 minutes to answer everything correctly. In hindsight I probably should have let the clock run for a bit (we had an hour) but I went ahead and submitted it because I had other things to do. I checked in with the others I studied with the next day and all of them had gotten 90%+. Sweet, definitely using that plan for test 3 and the final!\n\nThe next day we all received an email from the professor letting us know we were being reported to the Dean for an honor code violation. He claimed he had never had anyone make better than an 80 on one of his tests before, so the fact we all made 90%+ was clear proof in his mind that we cheated.\n\nThis being an engineering school we were all nerds who were pretty scared about receiving such an email, but we agreed the best course of action was to talk to the professor before he went to the Dean to tell our side of the story and see if we could sort things out. We reached out to him and he agreed to meet with us after class.\n\nWhen we met with him and laid out our case he was surprisingly receptive to our explanation; I think in reality he didn't want to go through with the hassle of reporting us to the Dean. So we left the meeting feeling pretty good and agreed within our study group we would keep studying from the old tests.\n\nWell, about a week before test #3, this guy announces to the class that because some of us had found the previous test so easy, the next one would have twice as many questions in the same amount of time. Being the cheeky SOB I am, I asked him as I was leaving class what would happen if someone made a 100 on this test. \"God help you on the final\" was his response.\n\nSo we used the same approach in studying for the test and found the same pattern of a limited set of questions. Of course, in addition to the extra questions he had promised all of the questions on this test would be new. So while we again got to the point we had the questions and answers memorized, we tried to make sure we understood the concepts as much as possible to deal with what we expected to be his wrath.\n\nTest day comes around and lo and behold 87 of the questions are pulled directly from old tests. 10 are from a guest lecture where he basically pulled the question and answer directly from the slides, and 3 were filler questions like \"1 + 1 =\" and \"The Earth revolves around the Sun, True or False.\" I knew I had everything right. I also knew I didn't want to screw myself and everyone else for the final. I purposely answered the filler questions incorrectly so if he looked at the results he would know what I had done. I got my 97. I never heard from the professor about that third test, but I like to think of him rage scrolling through the results.\n\nI don't remember details about the final, but do remember the format being the same as what had been announced at the beginning of the semester. My study group also worked together on a group project which we also made A's on, so if he really only gave out 5 A's that semester, we received them all.\n\nEdit: 1 hour in and this is by far my most upvoted post and my first awards. Thanks all!",
        "permalink": "/r/MaliciousCompliance/comments/loyek3/when_taking_a_dive_on_a_test_worked_out_better/",
        "comments": [
            "[deleted]",
            "I hate teachers who teach like this. So fucking lazy. It’s why a college degree doesnt seem worth as much as it used to.",
            "[deleted]",
            ">So while we again got to the point we had the questions and answers memorized, we tried to make sure we understood the concepts as much as possible to deal with what we expected to be his wrath.\n\nYou studied? :)",
            "How is this malicious compliance?",
            "An alternative point of view is that he riled everyone up on day 1 with the \"only 5 people will get As\" bit, and as a result you all spent the semester \"memorizing old tests but making sure you understood the concepts in case he changed the questions\".\n\nThat's just studying with extra steps. (Actually it might just be studying).",
            "Very well done! Loved reading your story.",
            "> When I was in college I took a class with this gem of a professor. On the first day of class he asked how many people thought they would make an A. This being a tough engineering school where a C actually was average, something like 5 students out of a class of 60 raised their hands. He then announced that's how many A's he would give out that semester.\n\n\"Hi, I'm a character out of a bad late 1980s rom-com.  Maybe by the end of the semester I will have met my love interest outside of the college who will help me soften my heart.  Maybe it will happen, maybe not yet... guess you students all get to find out.\"",
            "This is actually really fascinating story about the interaction between hard work, privilege, and broken systems.\n\nLike, the fact is that OP and his friends were extremely smart, competent, diligent people. He humbly tells the story like he found an exploit, but the fact is they spent an incredible amount of time studying and learning the material and working together and memorizing hundreds of questions. Most people would likely not have been able to pull this off even with the previous tests.\n\nOn the other hand, they were able to use their personal connections to get access to a study guide that was essentially 5x better than any other study guide.  Why TF did this happen??  Is previous tests were fair hand, couldn't the professor just have made them available??  Why does a random subset of the class get access to a monumentally better guide for essentially no reason?\n\nThen there's the fact that the grading system is shot to begin with.  \n\nSo OP & friends needed BOTH hard work AND privilege to win at this 'impossible to ace' class.\n\nIt's like, I dunno.. an especially sharp example / microcosm of his this dynamic works.",
            "I strongly dislike that fraternities keep records of tests.  I was a female in engineering school in the 80s.  The only people that got access to the fraternity tests were members of the fraternity and the women that slept with them.  Hopefully, sororities are keeping track of historical engineering tests, but I doubt it.",
            "I still don't understand why so many posts like this are getting upvotes in this sub. What about this is malicious? What's even being complied with? It's a decent story, sure, but intentionally missing a few questions because of an implied threat isn't malicious compliance.",
            "I had a Calculus teacher in high school who was the complete opposite. She wanted everyone to get As in her class and helped us prep for AP exams so that we could receive college level Math credit.\n\nIn a similar study style to OPs, our teacher would not only go through lesson plans but had us review previous AP exams. She made sure that we knew the concepts so even if some of the questions were new/different, we could figure it out.\n\nHer final exam was pretty much setup as the AP exam (timed sections, extra white paper if we needed the extra space, ect). She graded us in the same style (1 - 5 with 5 being the highest, 3 as passing, and 1 as failure). I was the only student with a 4 with everyone else at 5.\n\nIt freaked me out a bit when I actually took the AP test, but push come to shove, I received a 5. I can't thank that teacher enough.",
            "May I mention here that I experienced this in all the engineering classes I took in college?  \n\nCertain males (frat boys) had old exams to refer to. Females didn’t have access. \n\nEvery grade I got was based on my work and ability. Frat boys were not obliged to study. Tests were reused. How would those boys do as actual engineers?  Think about it. \n\nI went to discuss this with the department head. They don’t give a minute’s attention to the situation. This was in the late 1970’s. \n\nIt is a shame now they have the STEM acronym and are doing no better.",
            "[removed]",
            "omg. teachers who are somehow PROUD of their low class averages or \"only give out a single A\"  or say things like their students \"never get better than 80%\" should be fucking fired and never be allowed to teach again.",
            "Lol if I had a lecturer like that at my uni I'd be reporting them not the other way round. American college sounds wild... glad you did well!!!",
            "I'm spending how much tuition for this arbitrary grading system?",
            "Tldr: we studied for the tests and aced it",
            "Same situation when I took Physical Chemistry classes in college. The department only offers class 1 in the fall, class 2 in the spring, and you need to pass both class 1+2 to take the senior project class next year. There are rumors that people changed major after failing class 1. \n\nThe teacher would curve the overall grade so top 10% (2-3 students out of 20) got A. Professor is a weird guy. He held the final a week ahead of the schedule and use the university assigned final time slot to discuss grade with students. It is his tradition and he has it on syllabus on day 1. Basically, students line up outside his office, come in for a 1-on-1 session where he asks everyone the same question \"here is your grade, you are at the borderline of 2 letter grades, tell me why you deserve the higher letter grade\". Students hate him because they thought he enjoyed playing with their minds.\n\nI made above 90% for class 1 without the curve so my session with him went well but 4 people didn't make it to the second class. There was a guy who failed the class the previous year and barely made a D in our class. We were in the study group together and he couldn't get the subject as fast as us. Final time came and we worried for our friend so we hatched a plan. We gathered the average of our class, simulated the final grade, and realized that the top people need to not perform so there would be a larger curve that benefit people with lower grade like my friend. With that, I purposely left the answer for question 1 blank and ended up with the overall grade of 85.6%.\n\nThe grade discussion date came and I asked to be the first one to talk with the Professor. He asked whether I see the page with question 1 on exam date and gave me 5 minutes to solve it for half of the credits. I declined the offer, showed him our grade simulation and our proposed letter grade cut so it followed a Cauchy-Lorentz distribution. The professor laughed hard at the end of the presentation and asked me to email the grade simulation to him on the spot. Later, I was informed (by my study group) that everyone got the proposed grade on the simulation. My friend made a C and graduated next year with us.",
            "Yea this professor was a bad professor. His job is to teach the material to everyone and get them all to a level of comprehension. What a piece of shit",
            "I had a middle school teacher who was amazing. Day one of a special computer class they had set up for 7 of us, someone asks if he's grading on a curve. \"Yea, a bell curve. One A, one D. Everyone else a B-.\" It was a rolling joke all semester of \"who's got the D now?\" \n\nI now realize how weird a \"cool middle school teacher\" likely is, and how \"who's getting the D?\" may not have been a great phrase.",
            "Terrible teacher.",
            "Teachers who openly try to make their class as hard as possible are pretty shit at their job",
            "I took a Statistics class. This was a small college where I was working on my Associates Degree. The teacher was the only teacher teaching the class. The first day he was discussing cheating and what would happen if we were caught cheating. He said at the time he rotated his exams. He told us about a student that made a 100 on the first exam. As he looked over the test he realized the students name looked familiar. After looking at his records he realized the student had been in the previous semesters class, had taken the first exam flunked it and dropped his class. So he used the same test just changed the order of the questions. He gave the test as a pop quiz. LO and behold the same student flunked the test and dropped the class. He realized instead of studying the subject she had memorized the answer key from the first time she took the class.",
            "My physical chemistry prof said that the averages on his exams were usually around 50%, and he was right. Easy to make a B in that class but almost impossible to make an A",
            "Prof tricked you all into being better students.",
            "I had a chemistry class that was supposed to be hard. Day one an older guy shows up. He says the original teacher took another job at the last minute and even though he had not taught this class in 5 years he would be our teacher. I immediately went to the science library and looked for older classes. They kept a log of older classes including syllabuses, homework, tests, etc. but only from a couple years back and only if the teachers opened it up. This guy had. I got all the Marie rials and copied them. He gave the exact same class so I got an A without learning a thing. \n\nUnlike OP I made sure to only get like 95% on any test. No need to kill the golden goose.",
            "If you suspect that people who got every question right have cheated then maybe you didn’t teach everything they needed",
            "Teacher sounds like a lazy prick",
            "I don't understand how if students are paying for a class why the teacher has to make it so difficult that they can't have a complete score. I understand you need to understand your curriculum, but if a student is going to be in a considerable amount of debt to do this, why do teachers get a pass on being sadistic in teaching/testing?",
            "If professors dont want their tests going around, collect them all at the end of the test and cut them up. But they should at least do a review lecture the next class. When I did my undergrad, the majority of profs let us keep the tests (and they went over them). Only 1 prof didnt let us keep the test, and his style was multiple choice but it was like a, b, c, at least 2 of the above, or none/all of the above. Which is really fucked up if you’re between 2 answers. I hated him with a passion. \n\nMost of my classmates and i were passing around our stuff. I was even give pdf of books. another prof asked me where I got X lab book pdf, I just gave her a look and she understood and never asked me again.",
            "that is a teacher that is working against the students. he has falsely equated \"a class that is hard to pass\" with the idea of \"Good Teaching\" one does NOT equal the other but many teachers THINK is does.",
            "I was going to give you an upvote in the first 12 minutes, but decided to let the clock run a bit.",
            "I’m a 25 year veteran teacher and it’s completely ignorant to say “Nobody is perfect, so nobody get 100%.” If a person answers everything correctly, they earned 100%. What a load of shit otherwise.",
            "At uni our engineering lecturer was one of those 40 years in industry and now wants to teach to chill out types. We figured the same thing as OP did, and told him about it. He told us \"great work\" and that it was a great real world experience, and said not to worry as Bell Curve™ would take care of everyone else who didn't attend and not realise it. \n\nBest lecturer ever, ironically probably learnt the most from him as we all listened to his lectures, and even now 20+ years still keep in contact with him.",
            "Sounds like Georgia Tech to me.  \n\nHere was my strategy... \n\nMany professors used the 4 tests and a final exam model, which was pretty straight forward.  I would skip the 4th test and negotiate that the final exam grade should count additionally for the 4th test.  Saving the study time on exam 4 and doubling down on my final exam prep.  These were usually pretty good outcomes since so much was riding on it.  \n\nAlmost every professor with the 4 test + final model would agree to this.",
            "I thought teachers were supposed to want to help people learn. This guy seems to want everyone to know how important he is. What a douche!!",
            "Back in uni (15 years ago) I had a visual basic course with a final practical exam. I hated VB but it was a core module so I had to take the class.\n\nI went to the first lecture and the tutor said \"If you attend every lecture you will pass this class with flying colours\". I took it to heart and attended every lecture and took notes, part of the lectures or course we're practical tests which we couldn't do in a lecture theatre but the tutor went through everything and set us work based on what she had gone through.\n\nWhen it came to the practical test I made sure I knew those practical examples inside out.\n\nI started the test and sure enough the questions were based exactly on those examples given to us in the lectures, I finished in less than 10 minutes when I think we had a limit of 90. \n\nThere were a lot of amazed looks when I walked out that door and having finished myself I think I gave a couple of others the confidence to admit that they had also finished and came out too.\n\nI got my first and only 100% in that class. A few friends also got 100% because they too took those words in the first lecture to heart. \n\nMy \"worst\" subject became my \"best\" subject! \n\nI never used VB again until this year when writing some macros in Excel and I had to look up online tutorials!",
            "The professor sounds so full of himself I'm sad for him and his students",
            "What kind of engineering prof gives 100 question exams? I can barely finish with 5 questions.",
            "You’ll find 90% of engineering professors are pretentious dicks that like to give bad grades. Doesn’t really effect your job options as long as you don’t flunk out.",
            "You put in the work. Period !",
            "His job is to impart knowledge to his students, not try and F them over on the grading.",
            "Professors play stupid games, smart students get good grades!",
            "Wouldn't the teacher be happy that his students are doing well",
            "We had a professor that applied the same rules, however, there were SO MANY old tests, and all of them had original questions that it was easier to study from the book because then you got context.  \nThis man was a proper legend.",
            "Ugh, as a teacher, this is embarrassing. Lazy and vindictive is no way to help your students learn the skills they need to succeed in any given job or career, or life, for that matter. Glad you figured it out!",
            "Is it an American thing to have exam questions at higher education levels be multiple choice? Do you actually have proper exams where you have to read a question and write your own answer, show your working etc?",
            "In what parallel universe would restricting the number of As result in an improvement in the quality of education?",
            "Shouldn't the professor want everyone to get an A? I mean, in a perfect world, everyone would complete all the work and understand the lessons, right?",
            "I think there are better things to do",
            "I'm taking organic chemistry right now and our professor gave us all prior tests and keys from 2004-$(LastTerm). None of the questions repeat or anything, so you can tell he isn't using a bank. There is no homework. The grade is the exams + lab reports.\n\nThe theory is that if you do all prior exams \\*and take the time to understand why you missed questions\\* that you will do pretty well. I kinda like the approach.",
            "I had a chemistry professor in college that did something similar. His tests were just old tests recycled, so we just studies the tests. He realized no one was doing the problems from the book and got pissed, but didn't tell us. Third test was all problems from the book that he had recommended we do and not one question from the old test. I bombed that exam.",
            "Pretty sure it's against every university's professor code of conduct to limit the amount of high grades they \"give\" because it effectively descriminated against students whos initials are from the latter half of the alphabet. All students should have equal opportunity to obtain 100%/perfect grades if they are so inclined.\n\nI'd have reported him to the dean and to the board of learning. I'm a nerd but who is argumentative and also not fond of sadistic/unethical teachers.\n\nI'd have questioned his effectiveness anyway, if only 5 out of 60 people are being taught well enough to get a perfect grade. Clearly there's something wrong with his teaching method and he should reflect on that.",
            "My Dad (RIP) would laugh at this.  He was a lecturer and had to set regular exams.  He had great musical/historical/lingual knowledge.  It was fairly easy for him to write new, original exam papers.",
            "Where was the MC?",
            "For the life of me I could never understand the logic of an educational system where the higher you go and more complex the material, the less qualified your instructors become.",
            "When Tammy had brown hair.",
            "Many years ago in my year 11 exams, I needed a %95 in my Chemistry final for a pass.\n(Due to change of teacher, personality clash etc I stuffed around way too much during the last 2/3rds of the year and I still remember the teacher telling me I’d be no chance)\nActually studied.\n%100 in the exam,  which 6 other kids in the state also did, so I got my name in the newspapers.\n\nSadly, my other marks for that year were all fairly meh, no doubt due to all the effort into",
            "If a teacher puts an exam online, there are absolutely no rules for what you can use to help imo. You want students to only use certain resources? Cool, proctor our test in person.",
            "STEM degrees always have that one filter class where the teacher ends up not giving that many top grades:\n\n&#x200B;\n\nCell biology, Organic Chemistry, Statics & Dynamics, Physics 2/Electromagnetic Theory, Calculus 2 (when you start to see integration application), Differential Equations, Linear Circuits, Thermodynamics... Basically classes you end up taking during your second year or early in your third year.",
            "I agree, my Microeconomics professor in PSEOP program did the same thing (fine I guess for the other people in the class) but I had applied to Yale so his average of a D in the class was ridiculous.  I received a B- o4 something.  He said I should be thrilled.  I told him why this was unacceptable and lhk EXACTLY why teachers that do that are incompetent at best.  I was 15 or 16 at the time. He sat there mouth agape.  He was an a$&!   He didn’t pull the tests from the book nor lectures and expected us to take the tests.",
            "What a story. Good job m8 [+]",
            "In the 90's FAU offered proctored, taped, software engineering classes for us at our Ft Lauderdale workplace; originating from Carnegie Mellon University. For some reason I decided to take one final at FAU. My recollection was that everyone taking the proctored test at our workplace got B's while I got an A. I had a feeling that taking the final at our place of work cost everyone one letter grade. \n\nIn one other case, high school biology, we got a long term substitute that asked for our opinions on his teaching in a questionaire very close to the end of the year. I honestly gave a scathing opinion since he taught off of index cards, but while turning the paper in down the row a fellow student signed my name to mine. I asked why he was laughing and he told me. The teacher made a comment about my honesty filling out the questionaire preceding the next class. It cost me a letter grade, or two, as I had virtually memorized the book.",
            "She does what you'd expect from a congressional?",
            "If a professor teaches a class knowingly using old test questions that are easily accessible, without the need to show work, do they really have a right to act like this?",
            "Nergasm",
            "Good for you, OP!  I don't like it when professors make these pronouncements at the beginning.  I am in my second semester of teaching an intro computer programming class at a junior college, and my background as a homeschool mom really comes through.  I would rather they learn the concepts than punish them for not getting it right the first time, and I give do-overs on programs.",
            "That’s some weapons grade BS allowing for old tests to be studied from, recycling nearly all the old questions, and not providing those old tests to the class.",
            "Grades always annoyed me. I got straight As, but it was always frustrating. School should always be about demonstrating that you finally grasp the idea or concept that is being presented. If you fail the first time, keep trying until you get it. You shouldn’t be punished for not getting it right the first time. A lot of our biggest technological and scientific advances were the result of accidents or multiple attempts prior to success. Learning is directly correlated to failure. Teachers should be proud of how many students they’ve passed rather than failed.",
            "I hated your type. While the rest of us had to study from notes and read the book, you got to skate through by cheating off the old tests that the rest of us weren't privy to, and ruining the curve for the rest of us. I now work for one such engineer who can't make a decision to save his life, can't outside the box, and has to rely on the real engineers to do all the work that HE gets credit for from his fraternity brothers who run the company. I am praying for karma to strike him, and the rest of his brothers, hard.",
            "I think OP acted reasonably, using all resources he had to the best of his ability\n\nI also think this shows institutional inequality. Professors do not supply their old tests as a study guide, but they do assume students have access to them, and adjust difficulty and grading accordingly. Students who are not part of that fraternity get the harder tests, but not the specialized study materials, then likely suffer lower grades. \n\nFraternities set their own entry criteria, often involving a pledge term, typically charge extra money, and at least at the college I went to have incredible independence from school oversight because frat alums are on the school board of directors\n\nNot a criticism of OP, just trying to highlight entrenched institutional unfairness",
            "Those who can, do, those who can't, teach.",
            "Grading based on a curve scares me! I never have been in a class like that but it just means guaranteed some people are going to fail even if you got a passing grade. Makes you fight against each other like they are the problem it looks like!",
            "Op later went on to design a dam that failed killing 1800 innocents 😍😍😍",
            "I had a stats professor in college do the same thing.   Although for him every question was the same all the time.   He tells on day 1. No midterms no final no quizzes just 4 tests that are open book open note.  There were about 40 kids in the class.  Myself and my fraternity brother and 3 guys from another fraternity were who I knew on day 1.   Well as we are about a week away from test 1., we went to our fraternity archives.  We found a test from two years ago from a Roger who was our bar manager.  Not our brightest brother.  We looked at the questions first and were worried since we didn’t even understand the questions.  We open up the blue book answer sheet and he got a 100.   In fact, he got a 100 on all 4 tests.  We go back farther and there is another set of exams from 2 years before that and another and another.  We found 4 sets of identical exams over a 13 year period.   So on next class we ask the other fraternity guys if they know what the tests are like.  They laughed and said we just found out last night and we’re going to tell you guys.  So we take the test. Exactly as we expected.  So 10 minutes into test, someone gets up and asks a question. The professor tells everyone an explanation of what question 1 is looking for.  So everyone in class starts writing that down.  Everyone but us 5 in fraternities.  Same thing for each question.  So next class he gives out the results.  First kid got a 20, the next a 25 then a 15 all grades woefully failing.  Then he gets to us 100, 100, 100,100,100.  After the first test we get to know more people in class.  By the second test over half the class has the old exams. So over half the class gets a 100 and the rest fail miserably.  The third test comes but I have something going on at work.  I ask the professor if I can take test in his morning class about a week before test.  Turns out no one in morning class knows about his tests. I walk in get my 100 then leave half way through the test.  Turns out he changed the questions for afternoon class and everyone fails miserably.  Now we are all panicked.  Turns out fir 4th test he gives us old test and we all get 100.  I’m only person that semester to get a 100 average.  Lol",
            "This reminds me when I was taking my IB final exams. For history there’s only so many questions you can really ask, so eventually the questions are recycled but slightly adjusted. Previous years exams were publicly available online so I went through and realized that every year they asked some version of the same question. Describe shared sociological (or economic) impacts of 2 main countries in WW2 so I learned everything for Russia and the US of course. I go to take my exam and the question I had prepared for was on it! The question was the same except this time it said for 2 countries EXCEPT the US. I was able to bs an answer but I will never forget that.",
            "I had a teacher in college, first thing he said when he came in the door, I haven’t given out a single ‘A’ in my class in my 35 years of teaching. He said it because he wanted to see how many of us would try to prove him stupid and get an ‘A’. As he was about to finish the final class for the semester he explained that it was a lie about the ‘A’ grade and he wanted to see how far we would push ourselves. This was in a master’s level class. He wanted us to challenge ourselves to attempt to prove him wrong to prove to ourselves that we could do anything we wanted",
            "Wow, my optimistic ass was suddenly bewildered by the comments.\n\nWhen I was reading this, I thought the point was only 5 had the goal to get an A, therefore, only those who had that mindset will get it.\n\nI thought this question was meant for the \"if you think it, then it will be true\" mindset. My thinking was, if more hands had been raised, then more A's would have been given.\n\nEven If you’ve only got a 1% chance of winning, but you convince yourself you’re gonna lose, that 1% becomes 0%.",
            "So he still only handed out 5 As, fuck everyone not in a frat?",
            "Memorizing old test answers is cheating. This is nothing to be proud of.",
            "Uhh... where's the malicious compliance?\n\n'Complying with the letter but not the spirit of a request.'\n\nDon't see it, sorry.",
            "This come with a tldr damn",
            "Once you figure out the format of tests/exams based on the textbook it's pretty easy to knock a 100% out just by memorizing only the questions and answers. Sometimes the words and order get mixed up but overall it remains the same.",
            "I had a teacher that said in the first lesson that her grades will never go past 16 out of 20 because that institution didn’t allow oral exams but she had to take oral exams to be able to achieve more than 16. \n\nWe highlighted to her that because it was maths and University, her power over the grades was tiny and if she really wanted to fulfil that personal requirement we (200 odd students nearing the end of the bachelor degree) would happily take her on and request all our final grades to be revised by another teacher. \n\nLo and behold, it was a record year in grades and number of passes. She handed out a 19 out of 20 that year. And obviously, no oral exams.",
            "Was this a school in New Jersey? I've heard of the same exact thing from a friend that went to an engineering school here.",
            "One of my physics professors got all his questions from text books that weren't the one we were using. However most of the pdfs of these text books could be found by copying and pasting the question into google. He didn't even change the numbers. He ALWAYS chose problems that either had the answer in the back or was one of those practice problems where they show you all the steps. It made me think HE didn't understand how to do the problems. He did tell us all that his real passion was piano and that he hadn't taught our specific class in over ten years (Advanced Mechanics). He normally taught computer science courses even though his phD was in physics. I think he was just incredibly rusty and didn't want to admit it.",
            "My red seal was mostly like this. Like we had a bunch of practise tests, then the official government test to get my trade certification that allows me to work anywhere in the country and recognized in other countries as well and it was easy as fuck. Makes me feel bad that so many of my brothers took this test multiple times.",
            "The only time I was okay with a professor like this was psych statistics that all psych majors had to take. One out 3 of us would fail. But out of multiple classes of hundred students he knew our names and faces. We only used a couple formulas for the whole semester. It was not hard if you paid attention. It was just tedious. You either ended up with an A or B or you failed. He was a good professor and had no problem making sure we knew the formulas, but if you slacked, it showed.",
            "Ring the bell, tell us what it said. We live for this shit.\n\nEpic failure by NASCAR and some of the best regional announcers I’ve always hated when bosses don’t have two wins in a row, and I FUCKING HELPED!\"-Caleb",
            "School of Mines?",
            "Wait, he didn’t even change the numbers?",
            "God damn. He shoulda been happy y’all were learning.",
            "Well ACK-shully the earth and sun both revolve around their common center of gravity, so checkmate engineers!",
            "I had a professor who did something similar.  When I talked to him later, he said he wanted us to fully the learn the concepts. He did everything on purpose.",
            "And he still would have been better?",
            "Why was this story even removed for?",
            "Old file exams were a life saver.",
            "that sounds more like benevolent non-compliance",
            "How many schools have an explicit honor code construct?",
            "Hawaii if it wasn't for those pesky regulations!",
            "You know I once got a .875/1 for health class that literally had 1 assignment all year so it messed up my straight A’s for the semester.",
            "I hate professors that have such an attitude like that. I had a history professor who would put stuff on his tests that he never covered in class. I would take my notebook filled with almost word for word notes of every class to him and ask him to show me where he covered what I was failing. All he would state was that I wasn’t doing the proper extracurricular stuff he expected me to do. Basically he wanted me to go and self learn stuff. I was not a history major in the slightest and had no interest in it. Just teach me what I need to get my degree and shut up.",
            "As a teacher I never cared what grade any student got. I only cared that they understood the concepts and demonstrating that on tests, projects and outside assignments. \n\nAs long as they do it fairly without cheating then power to them. The better they do the better it reflected on me.",
            "America?",
            "This is exactly what an Engineering college experience is like.",
            "Sounds like he knew exactly how to get his students to learn the material well! Great and sly style the prof had. Assuming without scrolling through hundreds of comments this has been said before!",
            "Who study for multiple choice exams and you can also look at your notes? Like what type of school it is?\n\n&#x200B;\n\nIn my college we have test when you need to write answer and you write on like min. 2-4 pages.",
            "My first online class, I freaked out because my first test (worth 1/4th of my grade) I only got a 57% on (I was a straight-A student).  I made an in person appointment with my professor, who was all \"Why are you worried?  I grade on a curve, and you have an A in the class so far.\"  Hated, hated, HATED that class.",
            "Lol, so to prove the teacher wrong, you studied hard to understand the material? 😂I think you're the one getting played. Haha",
            "Multiple choice exams are bullshit anyway. They are the worst way of finding out someone actually understood the concept of anything."
        ]
    }
]