[
    {
        "post_id": "8zqpy1",
        "author": "thefilmer",
        "title": "When following the rules gets really shitty.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8zqpy1/when_following_the_rules_gets_really_shitty/",
        "score": 14415,
        "num_comments": 335,
        "created_utc": 1531874046.0,
        "selftext": "I want to state there are no good people in this story. Only pure, 100% unadulterated malicious compliance. \n\nI'm at Costco trying to order a pair of glasses. If you've never been to Costco, the optical department is usually either next to the entrance or next to the Membership desk on the way to the exit. If it's the latter, the entire area is pandemonium from people trying to exit/return things/get memberships/order optical lenses. My local Costco is the latter. \n\nI'm standing there with my ticket waiting to be called. My ticket is like 54 and they're on number 48 and there are only 3 guys so this is taking a while. I notice a woman in the area hold a fussy toddler, I suppose just on the verge of being able to talk, looking for the first available employee. It just so happens that one of the optical guys was done with a customer, so the woman goes up to him and they have an exchange like this.\n\nWoman (W): \"Excuse me, I--\"\n\nOptical Guy (OG): \"Ma'am, you need to take a ticket and wait.\"\n\nW: \"But I just--\"\n\nOG: \"Ma'am, take a ticket. There were other people in front of you,\"\n\nW: \"Yeah but I just wanted to--\n\nOG: \"Ma'am! Take. A. Ticket. That's the last time I'm going to tell you. You can wait in line like everyone else.\"\n\nAt this point, the woman accepts \"defeat\" and her toddler is getting fussy. She grabs a ticket and puts her child on the ground. The kid is crying at this point loudly but I have my headphones in, just trying to wait for my turn.\n\nAnd then it happens.\n\nThis kid unleashes a torrent of shit that basically explodes his pants and gets all over the AC display shit they try to sell you on the way out. I'm amazed that much poop came out of this little boy. He's crying up a storm and his mom is trying to comfort him but it just keeps coming and coming. At the same time, he's waddling around and getting it all over the place. The entire area, myself included, jumps back and is giving this lady some space. \n\nFinally, after what seems like an eternity, it stops. The kid is crying, his mom holding him, shit running down her arms. There is fecal matter in about a ten foot radius everywhere. All traffic to the exit has stopped as horrified shoppers look on. The optical department, including OG stare at this woman. She marches herself, son in tow, up to the man.\n\nW: \"I was wondering if you could tell me where the bathroom was.\"\n\nOG sheepishly points to an area behind the registers and W walks away. I decide to come back later when the area doesn't smell like a raccoon fucking died, trying to stifle my laughter the whole way through.\n\nTL;DR: Lady took a number and it happened to be 2. \n\nP.S. Before you ask, there is no big sign pointing to the bathrooms visible from the Optical Department at my Costco. I imagine that will be changing soon. \n\n",
        "permalink": "/r/MaliciousCompliance/comments/8zqpy1/when_following_the_rules_gets_really_shitty/",
        "comments": [
            "You'll find no heroes here... just defeat.",
            "Shitrockets man, it comes out like a goddamn spaceship taking off. ",
            "Upvote for that TLDR 👍🏽",
            "This definitely belongs in r/bestofTLDR.",
            "First time something has literally made me laugh out loud in a long time. Hilarious, OP.\n\nI think it’s extra funny because I’ve been that horrified woman before. Not so funny when it happens to you.",
            "I think in that situation it’s acceptable to loudly speak over the employee to say “TOILET, I NEED A TOILET”,",
            "> there are no good people in this story.\n\n> I'm\n\nBravo on the self-awareness!\n\n\nGreat story though!",
            "The shit hit the fan right?",
            "> I decide to come back later when the area doesn't smell like a raccoon fucking died\n\n\n\nThis sentence got me laughing like an idiot",
            ">TL;DR: Lady took a number and it happened to be 2.\n\nBest TL;DR I've ever seen, OP. Well played!",
            "Surprised but glad you stuck around for that Shit Show. The play by play was excellent. ",
            "A similar toddler butt bomb happened to me. In the FBI building. After an FBI agent and I got in a fender bender. Yep. At least it was contained in his diaper. That poor woman and poor kiddo, no wonder he was crying!",
            "Why don't people just yell \"BATHROOM\" in such a scenario? I'm just upset because it was the kid that suffered in this scenario. ",
            "pretty much only washroom sign at my costco is at the washrooms which is tucked in a corner ",
            "After a couple of attempts at being polite, why wouldn't she just go \"WHERE ARE THE TOILETS!?\"",
            "\"At the same time, he's waddling around and getting it all over the place. The entire area, myself included\"\n\nFor a second I thought this story was about to get a lot worse :P",
            "I feel really terrible for the kid in this story :/",
            "I'm laughing so hard I can barely breathe",
            "I fucking loved this shitty story! Thank you!",
            "was optical guy still there when you got back?",
            "Bog volcanoes like that are known as a Number Three",
            "when it got on the AC unit did it......HIT THE FAN??",
            "Great shitpost.",
            "As a parent, I weep for the poor mom.\n\nF",
            "If someone’s holding a crying toddler, shut your mouth and see if you can help. If it’s going to take a long time, then you can make a judgement call. If I see someone with a crying toddler (and I don’t have a crying toddler with me) they go first every time. It’s the unwritten “I’m going to help you try to avoid throwing that kid out the window” rule.",
            "r/talesfromthecustomer would love this. POS employee who doesn't wait to listen.",
            "One time I went with my husband to the doctor and he got sent for x rays. We walked to the x ray department and there was literally no one waiting. Went to the desk and the receptionist was texting and wouldn’t even look at us and told us to take a number. Grabbed a number and kept standing there since as I said, no one else was waiting and she was on her cell phone. She told us to take a seat and wait for the number to be called. We confusedly sat down and then she immediately hit the button that displayed our number on the little tv saying it’s our turn...",
            "I would have stayed but not with a straight face lol ",
            "One hero. One small, smelly, crying fucking hero. That kid deserves a bath, a lollipop and a cuddle.",
            "Amazing.\n\nOut of everyone grossed out by toddler poop she had to be the one to care the least. \n  Win for her IMHO",
            "Good advice in these situations is to just launch into the question.\n\nWhen someone approaches me \"Excuse me sir do you have just a minute of time...\" I'm gonna book it, I don't want to give some stranger money. But if they just say \"Hey do you know how to get to x street?\" I have no problem helping.",
            "Now *that* is a lose/lose situation",
            "I once contracted dysentery at Costco also.",
            "I dunno, that lady isn't a bad person in this.  She just sounds exhausted from dealing with a toddler.\n\nOptical guy, fuck him. ",
            "That’s what (some of) we parents call a “poosplosion”. \n\nI remember having one at the supermarket when my youngest was in the seat of the trolley. It went right up the back, but was contained by her onsie.\n\n\nWe finished the shop, though.",
            "Am I the only one that thinks the mom should've been more assertive and simply blurt out \"Excuse me, where is the bathroom?\" without any regards for interruptions?",
            "> P.S. Before you ask, there is no big sign pointing to the bathrooms visible from the Optical Department at my Costco\n\nAlso it's the optical department, possible people may not see it.",
            "You were right, no hero’s, only pain and shit...  this story makes me laugh and hurt on the inside",
            "I would've hollored through the entire store in the loudest voice I possess:  **can anyone tell me where to find the bathroom please?** ",
            "LPT: If you want to know where a bathroom is, just say \"Bathroom?\" instead of starting with \"Excuse me, I was wondering if you could tell me where the nearest...",
            "I have difficulty believing this story. The toddler shots so hard his pants just fall off? The mom's reaction is weird. People would start throwing tantrums. ",
            "Sounds like a sequel to the [Swamps of Dagobah](https://www.reddit.com/r/AskReddit/comments/xo41d/doctorsnursesredditors_what_has_been_your_most/c5o66p2/) ",
            "Wouldn't she have just asked someone else where the bathroom was. ",
            "This story is great and you told it really well!",
            "I feel so bad for that lady. Like how do you even deal with that now",
            "If I were her, I would have finished my sentence, with an even louder voice, to talk over him trying to tell me to take a number. Something like that, you just SAY IT. Dumb...",
            "This is absolutely hilarious and revolting at the same time. I love it.",
            "Zennioptical.com to avoid further shittiness.",
            "Best TL;DR I've seen haha",
            "Why can’t people just finish asking. No excuse me. Just where is the bathroom. It’s 4 words. Don’t let someone interrupt you for that. Just talk over them. They are the ones being shitty. People should have the right to request where the fucking bathroom is!",
            "r/childfree material",
            "Man, what a shitty thing to do.",
            "The mother was so calm. Like she knew exactly what to expect out of her son. As if this has happened before. Hmmm.",
            ">I want to state there are no good people in this story.\n\nWhat about you OP?",
            "Upvoted for punny title ",
            "Everyone was stupid. Listen to your customer. Speak up if your son is about to explode in public. Fuck. \n\n",
            "Best Tl;DR line ever",
            "[removed]",
            "There was no hero of this story; but I feel like the Optical Guy was in the right for the most part. If it's a big deal, just talk over him with the keywords of your emergency. There must be a lot of people who come up to them on a daily basis wanting to skip the line because 'My issue is easy, it'll only take a second'. If you need a bathroom that bad, either walk up and ask while they're talking to another customer, or ask someone not busy (IE: the person who checks recites as you walk out of the store).\n\nRegardless, still a funny story.",
            "That's the best tl;dr I've ever seen",
            "I work at a science center in Canada. We have these big blue blocks called an Imagination Playground that are placed out in our main atrium for kids to play on/with.\n\nYesterday, some kid had the same problem... all over and around the big blue foam blocks. It was gross. Parent and kid bailed pretty fast. ",
            "Up vote for your tldr",
            "That tl;dr lol",
            "> there is no big sign pointing to the bathrooms visible from the Optical Department at my Costco. I imagine that will be changing soon. \n\nThat's not the only thing that needed changing.",
            "This is why I eschew the courtesy markers \"Excuse me ...\" and so on, and just make eye contact, hold my hand up in ASL for 'bathroom', while asking 'bathroom?'  It's harder to interrupt, and people are understanding.",
            "This was GLORIOUS.",
            "This is why you listen before you speak. Don’t be like Optical Guy. ",
            "Great story. On the other hand, it's really easy to find the restrooms at Costco. Just walk along the back wall after the registers until you find them. So the employee was a jerk, but the mother wasn't being very proactive either. Or maybe it was her first time in a Costco.",
            "I can understand the sentiment of the doctor.  Customers all think they are the most important person in the world.  \n\nI work self checkout sometimes.  There are 9 registers that I have to babysit people on.  Sometimes it's legit stuff like they're buying beer and I have to override them.  Usually it's stupid stuff like telling them for the third time \"no, you can't scan an item and simultaneously remove an item from the bagging area before putting the item you scanned into a bag first\".  Occasionally it's a void and it takes about 10 seconds per void because of how shitty the software is (not a hardware issue, it's got a bad Interface). \n\nSo of course while I'm helping one person with a void, in that ten seconds it takes, people will begin surrounding me in so I can't escape and take a second to think to see who has priority for the next fix that I have to do (for example, in the five seconds it takes to do one ID override, or to explain to a customer that \"you didn't hit the card button to let it know you want to use your credit card, yeah I know you think you hit the button, but just humor me and press it 'again'\", I could throw in two or three overrides for \"customer removed bags from bagging area\" so that three people are done by the time I've helped the one beer person (or finished debating the intricacies of whether they hit the card button or not - spoilers, they didn't.  I've watched people multiple times go from scanning items to hitting \"pay\" to sliding their card and then just staring at the machine and then claiming they also hit \"card\" when I clearly saw they didn't). \n\nSo yeah, it's gotten to the point where when I finish a customer, I take a deep breath, wince, and then slowly turn around and immediately say \"yes, I'll be with you in a moment\" almost before the first \"SIR SIR I NEED HELP\" can even be formulated.  Like, holy shit, give me a chance to get to my podium so I can see what the other 8 people are up to so I can see if your emergency is truly life threatening or not.  \n\nI probably would have \"HOLD ON\"'d that lady as well if she was one of mine, just because of how my customers are.  After all, the problem is that if you don't train the customers right, it teaches them that it's ok to skip the line or whatever.  \n\n\nLike today I had to tell a customer six times \"please go to the line because your turn will take longer if you don't get in now\" after she skipped the self checkout line that I was managing and thought she gets special privileges because she wanted cigarettes.  I told her I'd get the cigarettes, but she'd have to wait her turn on a self check out register so I could sell them to her.  Instead, she followed me around as I was looking for the keys to the cigarette case (my coworkers have a habjt of leaving them in one of four places, so I often have to play where's Waldo with them), as I kept insisting she stop doing that and get in line.  After like the sixth time, she was like \"oh I go line for self check?\". Yeah, no shit.  That's what I told you five times, and now what would have been a 15 second wait is now like 3 minutes.  Gg",
            "thank fuck that wasn't at my old costco, the optical was right before the polish dog heaven, which was right before the exit.",
            "Why not just ask a cashier, though?",
            "Number 3",
            "Fucking love that tldr.",
            "TL;DR was spot on.",
            "A true shitshow, but not a shitpost!",
            "This story is the sh*t",
            "Honestly, I was impressed by the writing alone.",
            "My point was that eyes are specialised ",
            "Oh my god. Ew. It runs down her arms? Oh my fucjing god. Id puke all over!",
            "Now this is a shitty situation for all parties involved",
            "Oh shit",
            "you should have filmed it and put it on worldstar and gone WORRRRLLDDD STTTARRRR!",
            "This story gave me a shit-eating grin.",
            "My son did this at steak and shake the other day. Luckily they are helpful there. ",
            "Why do I get the feeling I was just Dad Joked with that TL;DR?  Well done, OP.\n\nFor some reason, I imagine that kid like an Oatmeal drawing.",
            "👌",
            "This wasn't even malicious compliance, just a poor mother trying to take care of her baby.",
            "Tis mayhaps the greatest tome I've ever had the pleasure of reading. ",
            "r/greentext ?",
            "As someone who works cleaning at a hospital this makes me furious...\n\nI wish with all my heart that they got to clean that up themselves. ",
            "You could crosspost every post on this sub to /r/iamverybadass  so easily.",
            "All she had to do was look for the bathroom or get assistance from someone else, employee or not.",
            "Sure wish you  had offered to help. I must have been horrible for her. Oh well, you were probably too busy, and she wasn’t family so......"
        ]
    },
    {
        "post_id": "7ynav0",
        "author": "zeromig",
        "title": "No phone calls when on the train? You got it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7ynav0/no_phone_calls_when_on_the_train_you_got_it/",
        "score": 14396,
        "num_comments": 574,
        "created_utc": 1519053414.0,
        "selftext": "This didn't happen to me, but to a coworker, whom we'll call Alex. We worked for a chain of English-language schools in Japan, and, if you're a sub, you're likely to be dispatched in many different directions, to various schools.\n\nOne day, Alex was riding the train, when he received an international call from his family. The call lasted only a moment, but he didn't realize there was a student on the same train who recognized him, and was offended by the conversation. It's not illegal to talk on your phones while on trains, but it's considered bad form and a faux pas. Anyway, the student complained to school staff (without saying anything to Alex himself), and word eventually made its way back to Personnel at HQ.\n\nNow, the personnel coordinator at the time was a dick, and he decided to flex his managerial muscles. Rather than sending a simple email asking Alex to refrain from using the phone, he called Alex in on his day off, talked to him for a great deal longer than was necessary, and made Alex write two statements-- one, a letter to the (unknown) student apologizing for the incident, and a promise that would go into his personnel file saying he'd never answer his phone on the train again. \n\nFast forward a couple of months, and Alex, working as a substitute teacher, takes the train to his base school, where he'd be stationed in case of emergencies. The train arrives, and he steps aboard-- but then gets a call. Caller ID shows it's personnel, and the only reason they'd call at this time is if an emergency arose, and he needs to get to another school ASAP. \n\nAlex ignores the call, and enjoys the 40-minute train ride to his base school (while on the clock) with a nap. When he gets off the train, he calls back personnel, who's livid and demands to know why he wasn't answering his phone.\n\n\"Why, Mr. Coordinator, you told me to *never* answer my phone on the train, and I would *never* think of contradicting you. You made me promise, after all,\" Alex says.\n\nThere's an angry silence and a gnashing of teeth on the other end of the call, with the coordinator probably holding back an angry tirade. \"Just get on the damn train and get back here; we need you at [another school location],\" he says, and hangs up.  (This was 40 minutes back the way Alex came from, plus a good 20 minutes further)\n\nAlex shrugged, and grabbed the next returning train, where I like to imagine he enjoyed another good nap (while still on the company clock).",
        "permalink": "/r/MaliciousCompliance/comments/7ynav0/no_phone_calls_when_on_the_train_you_got_it/",
        "comments": [
            "This post represents the very definition of this sub.",
            "Managers love to swing their dicks, don't they? Until their swinging dicks start knocking important shit over.\n\nEdit: gold puts a spring in my ~~step~~ swinging dick",
            "I hope he wrote both letters in English with lots of idiom.",
            "[deleted]",
            "What business does a school have telling you that you can't take a call on the train?   ",
            "My husband has worked for 2 companies like this. One student gave him a low rating in class because my husband didn't talk to him on the train. My husband hadn't seen him, the guy didn't try to talk to him to begin with and they didn't even have class that day.",
            "Alex is my hero",
            "Just follow the damn train CJ",
            "I think I would be fired before writing 2 letters.",
            ">  if you're a sub, you're likely to be dispatched in many different directions\n\nWhereever your dom tells you to, right?",
            "I have lived this story.\n\nWhat's strange to me is how unnecessary it is. Sending a text or email is a much better way to deal with an emergency when you are (or should be) well aware that the teacher is likely on a train.",
            "I'm starting college next month with plans to visit Japan for a bit to help teach English, I'm pretty nervous for stuff like this to happen even though I'm about 4 years away from even going there ",
            "Fuck that little shit that ratted your friend out. What kind of person goes out of their way to get someone in trouble and doesn't even have the balls to confront said person themself",
            "[deleted]",
            "Was this GEOS? It sounds like GEOS. Of course it also sounds like every other eikaiwa I know of.",
            "Could say this one is the textbook definition of malicious compliance ",
            "Japanese English schools are notorious for being run by managers with little man syndrome (no matter their size, but usually foreign).  \n\nOn the other hand, I know enough gaijin here who somehow are always the victim (usually by Japan not conforming to their ways), I kind of have to wonder just how loud and long that phone call actually was.  ",
            "Why is it that big of a deal that you need to apologize and your employer gets involved????",
            "I'm gonna guess... ECC",
            "We have a quiet zone upstairs on our commuter trains.  We WILL fucking shit on you if your conversation is any longer than \"sorry, I'm on the train. I will call you back in a bit\".l!!!\n\n",
            "I'm not sorry to say that that is an absurd cultural expectation. There is no reason why you can't answer the phone and have a quiet succinct conversation. You shouldn't be shouting and spitting on the people around you, but you should be able to have a quiet conversation",
            "Stories like this make me never want to visit Japan.  Different customs ok - but that is ridiculous.",
            "[deleted]",
            "Reminds me of this:\n\nhttp://reddit.com/r/PublicFreakout/comments/5ks8ih/bitch_hang_up_the_fuckin_phone_bitch_rinse_and/",
            "I’ve watched expat videos of Americans living in Japan. Apparently this is the kind of thing that makes them hate Japan.",
            "Recently, the more I hear about Japan, the more disappointed I get. The culture seems to be very uptight and suffocating, and I'm Asian so i know this firsthand. ",
            "I'm a Japanese student and just lost all will to work there",
            "Another settlement needs your help.",
            "As someone who has taught abroad (Korea) this post is basically a fantasy for me. Unf. Just enough sass while still being right. ",
            "This is so fucking perfect.",
            "Some got offended somebody talked on a the phone on a train? Was an opera being performed on the train at the same time or something? Or is that student just a little bitch ",
            "I think Japan needs to get over itself. If I wanna talk on my goddamn phone to my goddamn authentic 'Murcian family, then I shall do so with impunity. Freakin' weirdos. ",
            "Why would you write a letter like that. I’d tell him to pound sand ",
            "Nova?",
            "Well then, looks like I need to answer a call while on the train in Japan. ",
            "Just talk on the phone as you and 23 other guys beat off on a near by pixelated sluts face. Culturally fine!",
            "[deleted]",
            "ITT : people not understanding another culture\n\n",
            "Ah, Japan. I have had my share of such 'dob-ins'. Fucking glad I am not no longer working there.",
            "You should put a \\ in front of the “(“. We can’t see a part of your comment on mobile",
            "Lmao. Perfect compliance ",
            "Did something similar while I was in Japan. Taught at a small, private school in the countryside. I was told by other teachers that there was mandatory training coming up on my day off - a Monday (did a Tues-Sat shift), but the manager suspiciously didn't say anything to me about it in person probably because they knew I was going to be pissed. We only had home phones in our apartments and mine had a message blinking on it but no one had explained how to access it. Rather than waste time trying to figure out how, I went on a day trip that Monday, never had to do the training and they personally came to my apartment to show me how to access my messages. ",
            "i have to ask, why would he go in on his day off?",
            "> It's not illegal to talk on your phones while on trains, but it's considered bad form and a faux pas. \n\n...What? Why on Earth would anyone care if you talk on the phone on a train?? It's not like you're meeting with the people around you.",
            "I feel like everyone in Japan would be better off if they spent one year in China. And vice versa.",
            "Are good teachers really treated that badly in Japan? I've only worked in (Central) Russia but here a school wouldn't dream of treating you like that. Maybe it's because native teachers are such a rarity, but schools are always trying to retain anyone they've managed to find. I lucked out with my first school and have never had to change, but it's not unusual for me to be turning down job offers almost weekly; if someone abuses their native, they're going to lose them pretty easily..\n\n\nI guess more people go for Japan and finding a westerner just isn't all that hard?",
            "What the hell? For talking on the phone? Japan is fucked!",
            "/r/Alex"
        ]
    },
    {
        "post_id": "a2bszm",
        "author": "ITSupportZombie",
        "title": "Creative problem solving with Kilts",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a2bszm/creative_problem_solving_with_kilts/",
        "score": 14404,
        "num_comments": 492,
        "created_utc": 1543741033.0,
        "selftext": "Several years ago at my first IT job, I worked in a pretty great office.  Well, great except for one coworker.  Everyone in this office had the same job, we worked desk side IT support.  This required a lot of walking, crawling under desks and carrying equipment. Each of my coworkers had an assigned area that they were responsible for and pulled their weight.  All except for $blondie.\n\n&#x200B;\n\nOne day at work, we had a large project.  My manager required everyone to pitch in to get this done by the deadline.  Everyone, except $blondie.  Every time there was work to do she would say she couldn't because of her heels or skirt.  Someone else would have to do her share.  Normally I do not care what she (or anyone else) does or does not do.  I do my work, she does hers.  On this day, I was tasked to do the work she was assigned.  I was not happy.  The next day another coworker of mine (also female) was assigned the work $blondie could not do because of her wardrobe choices.\n\n&#x200B;\n\nThat day at lunch we come up with a plan.  We will wear kilts the next day and the other 2 women will wear skirts and heels to work.\n\n&#x200B;\n\nThe next day at work, we show up to our morning huddle to get our assignments for the day.  My boss is visibly uncomfortable, half of his team is in skirts or kilts.\n\n&#x200B;\n\nI get my assignments for the day and immediately tell my boss I can't due to my wearing a kilt.  The rest follow my lead.  I feel bad for my remaining coworkers having to pull my weight but they think what we are doing is funny.  This day was amazingly unproductive.  No one can say anything about it because they have let $blondie do this for literally years.\n\n&#x200B;\n\nDay 2 my boss is even more frustrated and pulls me aside.  I hand him a well written dress code policy that another office uses that has already been approved by legal.  He spends the day fast tracking the approval this policy.  At the end of another horribly unproductive day, we have a surprise team meeting.  There is now a dress code that requires long pants and closed toe shoes for \"safety\" reasons.  $blondie's look of rage directed at me made no mistake that she knew I was responsible for this.\n\n&#x200B;\n\nNote:  I do not care who you are, what you look like or what gender you are.  I care about the quality and quantity of your work.  If you are hiding from pulling your weight intentionally, I will put a stop to it.\n\n&#x200B;\n\nEdit: I hope I tagged everyone that asked.",
        "permalink": "/r/MaliciousCompliance/comments/a2bszm/creative_problem_solving_with_kilts/",
        "comments": [
            "Female former IT person here. I didn't do a lot of deskside work (mainly help desk), but I always kept a pair of leggings in my desk in case I needed to. I didn't wear dresses or skirts much, but there's always a backup plan. ",
            "I mean this is great and all, but you screwed yourself out of getting to wear kilts to work. ",
            "I'm a woman in desk side IT support and occasionally wear dresses. People apologize that I need to crawl under desks no matter what I'm wearing and I cheerfully tell them I know it's part of the job, I dress accordingly, and I'm just fine.\n\nI would've told Blondie off so much.\n\n\nEdit: my male co-workers tell me they've had the same thing of users apologizing\n\nEdit2: My weird phrasing didn't make it clear that people have apologized to me about crawling under desks even when I've been wearing pants. Both my pants and my dresses are fine for the work I need to do.",
            "I'm the tech support assistant at my job. That means that if a desk has to be crawled under, or a printer has to be carried to the other end off the building, I'm the one that gets called. \n\nI'm also a woman who likes wearing skirts and heels. So I wear my longer skirts and my chunkier heels for better balance. And I crawl under those damn desks just like that. Fuck \"Blondie.\" She's the reason I have to fight end users every day because the 50 year old cubiclegrunt thinks that he should carry a computer for a \"girl.\" Fuck that, this is literally my job to move tech. We don't want the liability of you dropping it. \n\nOne of my coworkers in my dept asked me at the beginning when I'm \"going to start dressing like a tech assistant.\" I responded with \"who says this isn't how a tech assistant dresses?\" And now my whole department defends me to end users before I can even open my mouth. ",
            "I work IT. I'm 4'9\". I wear skirts. I crawl over/under desks with the best of them! I've pulled cable, set up blades, carried old school monitors around,  etc. Women like this make me exceptionally angry. ",
            "Fucking dresscodes...\n\nWomen: Skirts, Capris, Dresses, Pants.\n\nMen: Pants. Even if it's 500° in the office and outside.\n\n\nI'm gonna start a religion called Common Sensism which mandates shorts must be worn in the summer.  And instead of church, we'll hold gatherings on the 2nd Monday of every month.",
            "When I started working IT, I had to fight like hell to be allowed to wear pants and shoes appropriate to the work. Our business-wide dress code required women to wear dresses or skirts.\n\nIt was not fun running a data center and print shop in a skirt and heels. I had just gotten out of a work environment where women had recently been allowed to wear pants, but wearing them was a serious political statement and required meetings with a supervisor.\n\nSo I switched to dressing like my department coworkers and supervisors, who were required to wear business clothing and wore jeans anyway. Cue six fucking months of department-wide meetings about why I wasn’t conforming to dress code.\n\nNow, maybe my coworkers came in so drunk they were insensible. Maybe they ignored jobs to openly read hardcore pornographic magazines. And maybe they’d lied about their qualifications for the job and were barely literate.\n\nBut every one of them threatened to quit in solidarity if the company decided the dress code was more important than the work just because they’d finally hired a woman.\n\nAhh, IT in the year 2000. I don’t miss those days. Blondie should be grateful for the common sense.",
            "How did Blondie get away with this for years?",
            "Ladies and gentlemen, we got em",
            "Super glad you posted this - I saw your comment in the other thread and wanted to know more!\n\nAlso want to say, as former first line tech support, I have clambered around under deals in a pencil skirt and heels. The saving grace was the combination of knee length skirt, no slit, and 50 denier tights. Never wore a skirt* to a client site after that though. \n\n*Initially autocorrected to short. Then shirt. Very glad I caught that. 😂",
            "I used to have to deskdive. But I was lucky enough to be able to wear jeans. \nOn the odd occasion I was wearing a skirt I still did it.  Fuck playing the whole 'oooh but I'm a lady' card\n\nWomen threw themselves under horses to be taken seriously.  The hell am I going to avoid throwing myself under a damn desk. Smh.",
            "Were you wearing the kilts the way they should be worn?",
            "Before I started reading this I had in my head that you had to wear business casual but the AC in the workplace didn’t work, so you all wore kilts to maintain the dress code whilst working comfortably due to updraft... ",
            "> $blondie's look of rage directed at me made no mistake that she knew I was responsible for this.\n\nshe deserved it.  if she is going to leech of other people then she shouldn't be able to get away with it.  ",
            "Yes! Raised by two strong women who would have called this lady out the first time and said “I’ll go buy you some proper pants for your work!”",
            "I would of done the work anyway, they wouldve ended the kilts as soon as i bent under a desk!",
            "I always wear shorts, not for cooling reasons, but because I don't like my legs to feel constricted. They not only went and banned shorts at my work but forced us to wear a suit - but the dress code allowed for \"cultural dress\" so I wore my full kilt, sporran, jacket, etc, until they backtracked and said you just had to be \"smart\"· I now wear tailored slim fit dress shorts with my shirt and tie.",
            "I have carried SAN switches in 4\" stilettos and a skirt with a slit above my knee. I've run fiber cables in a pencil skirt under a raised floor. Good on you for making her do her job. My choice to wear what I wear and I'm not getting out of any work because of my wardrobe choices. ",
            "r/prorevenge would love tbis.",
            "I work at a fancy hair salon run by an old-fashioned owner. I’m required to dress nicely (a lot of specific rules for that one), always have hair styled, makeup, pleasant face, etc...  I’m also the only person there who knows how to do more than post to Instagram or send the occasional email (which is still difficult for some of them sometimes). \n\nSo you best believe I’m constantly crawling around under their dusty desks, moving large things (I’m 5’1” and 110 lbs), climbing the “big ladder,” untangling cords... all while wearing nice slacks/skirts/dresses, blouses, heels/nice shoes, with curled hair and a smile on my face (while simultaneously doing my “real” job: answering the phone, greeting clients, and getting them beverages with a pleasant voice, face, and demeanor). \n\nAnd I fucking nail it. People like your blondie are the reason why I get asked if I need help carrying things every single time, or not even considered when there’s something dirty or taxing to do, or have to prove myself again and again that I know how to “computer” when a man will get asked to do something they have no idea how to do. I can’t stand when people perpetuate stereotypes because it just makes it so much harder for the rest of us. \n\nEXCEPT I can’t seem to not get a run in my tights every day...",
            "Yeah, when I was an IT contractor, just about the only thing I could do was refreshes, so I followed the male dress code.  Blondie should have been talked to long before what you did.",
            "Probably my favorite story on here so far. I like how the “target” isn’t the boss, and love that you got all your co-workers to follow along!",
            "Love this! Brilliant way of managing up and helping the uplones do their damn job. \n\nIT female here. Yes I migrated to more software related tasks and I wore skirts some days, but always, always had a pair of clean pants and shirt to change into if I had a hardware assignment. Plus I didn’t wear microminis to work. ",
            "Hey here's an idea: if a wardrobe choice is preventing you from doing ur job, maybe u should consider wearing something else.  ",
            "Somewhat related, when I worked as an associate engineer I was frequently called on to make modifications to our engineering laboratory, which sometimes called for me to install test installations for the security systems we developed.  These were installed on our roof, and wire was routed to our labs.\n\nNot a problem, I could do it.  But our dress code called for slacks and business shirts.\n\nAfter ruining the second pair of slacks, I went to HR and asked for an exemption.  They said I could wear \"dark colored\" pants - but not blue jeans.\n\nSo, I went with black Levis.  And upgraded my dressy shoes for much more sturdy leather shoes.  As for a \"dress shirt\" - Work World sells dressy enough shirts that can withstand the abuse I was putting them through.\n\nI certainly stood out in a \"Which one of these is not like the others\" sort of way.  But I met the dress code perfectly. ",
            "I would totally have a shot of scotch with you.",
            "Can't work deskside IT with a skirt? That's grade-A, prime bullshit. I used to wear a utiliskirt to work, think a kneehigh belted skirt made from tough cargopants material with enough pockets to carry a serious doomsday-prepper’s EDC kit with pockets to spare. \n\nI wore that utiliskirt until it was essentially the Skirt of Theseus and consisted of 95+% fixes and patches. ",
            "I actually thought of doing something similar, but out of different reasons.\nI worked for a chain providing hearing aids with 2-4 employees per place. There was a dress code in place that allowed skirts but no shorts. I think that's reasonable, considering we were seeing patients all day. But the place I worked at had no AC and the IT, the equipment we used as well as the lighting emitted quite a significant amount of heat. In summer we regularly had above 30° C in our offices. Due to our customers being mostly elderly, we canceled a lot of appointments since ambulances picking up patients with a heatstroke really aren't good publicity. There weren't many people coming in these days anyway and nobody would have bothered if I had been wearing short chinos and docksiders. That was forbidden though.\nHaving to sit in this sauna for a whole day wasn't pleasant, wearing long trousers made it worse. I was sick of it.\nI've asked HQ for an AC multiple times and it was always denied. I didn't get it. They were losing money because we had to send people away. But since that obviously wasn't enough I decided to take it one step further. I wrote an email saying I'm just informing them I'll be wearing a skirt on the next warm day since the temperatures inside the store were unbearable wearing long trousers.  If they would prefer me wearing shorts they should say so and if they want neither they should reconsider their decision not installing an AC.\nI didn't have to deliver on my threat, 2 weeks later they installed an AC.\n\nTL-DR Blackmailed my employer into installing an AC by threatening to show up in a skirt (I'm a guy)",
            "Awesome!",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/scotland] [Problem solving using national dress](https://www.reddit.com/r/Scotland/comments/a2dfb4/problem_solving_using_national_dress/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "I think men (amd women) need to do more to allow clothing ewuality. Women fought for the right to wear pants, now it is pas time that men should also be able to wear all types of clothing. We don't bat an eye when a woman wears a men's business suit, but if a man wears a skirt, dress or leggings he is mocked and his sexuality and masculinity are questioned. ",
            "I love that you maliciously complied, but you also handed your boss the solution to the problem by giving him the updated dress code. 100% class. ",
            "Lol, female engineering assistant here. I spend a lot of time with testing equipment and crawling around on the floor. The first month I was there I wore dresses, then just said fuck it, there’s no way I can look nice and do what I do at the same time. A year later, it’s jeans every day. Good on you for giving that bitch what she deserves. She knew exactly what she was doing. ",
            "You shouldn’t treat women like $objects",
            "Reminds me of the story of the IT contractor that worked in a factory. His superiors from the IT company started issuing dress code requirements in line with corporate, which involved slacks, business shoes and shirt & toe. OP worked in a factory, his dress was work pants and vest, steel-tipped boots, hearing and eye protection and the likes, mandated by Health & Safety (H&S for short), which goes above company policy. OP's IT boss threatened to dock his wage if he wouldn't comply.\n\nOP told them to come over and discuss dress code, and coordinated this appointment with the factory H&S officer. When the IT guy showed up, dressed up in compliance with corporate IT dress code, he was promptly barred from the site by H&S because his clothing was completely out of compliance with what was acceptable in the factory.\n\nThat was the last OP heard from that guy about dress code.",
            "0/10 no picture of you in a kilt. Not that I wanna see that. ",
            "I work in IT. I'm a woman. I don't wear skirts or dresses or heels because that's extremely unsensible, and possibly asking for trouble. Nobody doing front-end work should be wearing anything but closed toed shoes and pants, regardless of gender. Dropping equipment directly on your cute wittle toesies sounds incredibly unfun, and not at all like a workman's comp plea. I've never met a woman in IT who was both serious about her job, and decided she needed to wear skirts to work. Anyone who decides that looking cute is more important than the actual job they are there for, needs to sort out their priorities.\nEdit: Also, fuck yeah, kilts! Thanks for this read! ",
            "Woman in IT here. I do occasionally wear dresses and skirts and high heels to work because I like it and also I love to look professional when we meet some clients.  \n\nMost of our maintanence and setups are scheduled in advance so I know when to come with jeans and sneakers or whatever is suitable for some crawling, lifting or climbing. However, I have a spare pair of clothes at work in case we have unplanned maintanence.\n",
            "Not all heros wear capes",
            "All these dress code stories make me glad I work in the construction industry. T-shirt and cargo slacks/shorts or jeans. ",
            ">If you are hiding from pulling your weight intentionally, I will put a stop to it.\n\nWhen I was involved in boy scouts, I would \"conveniently\" have to go to the bathroom just before/after we started to work. (unload, clean up, etc.) Since then, I've become much less of an asshole, and will gladly pull my own weight, and anyone else's that needs pulling, within reason.",
            "Any problem solved with (or in) kilts is a problem solved well. Praise be the Bravehearts.",
            "Jesus what a twat, I wore dresses to work and I stilled crawled under tables, climb ladders and carried heavy duty printers.  \n\nShe shouldn't be working in this field if she doesn't want to get herself dirty or doing hard work. ",
            "Everyone had a kilt? Kilts are expensive.",
            ">Note: I do not care who you are, what you look like or what gender you are. I care about the quality and quantity of your work. If you are hiding from pulling your weight intentionally, I will put a stop to it.\n\nFuckin A",
            "[r/CheckmateMotherfucker](https://www.reddit.com/r/CheckmateMotherfucker/)",
            "I love this so much",
            "kinda lame you guys didn't all come in heels and skirts, would've made the message even more clear",
            "Wouldn't an ankle length skirt have solved the problem just as easily?  Not as easy to crawl in but I'm reading this that the issue was exposure not ease of movement.\n\nAlso, should've ordered some Persian Cavalry heels for the gents, take it to the extreme!\n\nEdit: multilingual G-Board derp mode fixed",
            "Nice...i cant believe her lack of work ethic slid by for so long.",
            "Beautifully done.  \n\nWhat was the aftermath of your coup?  Did $blondie pull her weight or find other reasons she just couldn't do the job?  ",
            "This is r/prorevenge worthy. Good work!",
            "Bonus points if you went fully traditional and didn't wear underwear. Nobody needs to see that crawling under the desks.",
            "As a woman, I approve. Well done sir!",
            ">I do not care who you are, what you look like or what gender you are. I care about the quality and quantity of your work. If you are hiding from pulling your weight intentionally, I will put a stop to it.\n\nI heard Liam Neeson's voice when I read this.",
            "> $blondie's look of rage directed at me made no mistake that she knew I was responsible for this.\n\nNo, no... *She* was responsible for that.",
            "I just love the look on someones face when they realise they can't get away with their bullshit anymore",
            "Are you guys not allowed to wear jeans or even to change into them if needed? \n\nCould also wear like a doctor's coat which is quite long.",
            "I love this. I wish I could have seen her face.",
            "When I worked in a few companies, it service had a dress code. For the school district it was a polo and blue jeans. When I was at AT&T we had the option of business attire, or dress slacks with a approved uniform shirt. I opted for the polo because you most of my jobs required one. As far as the heels thing, most non desk jobs or jobs that had a chance of not sitting at a desk all day closed toed shoes with heels no greater than like a inch or two were required. And at the school when had to wear steel toed shoes.",
            "You sound like management material. Here is more work to do!",
            "Who has kilts sitting in draw...",
            "r/justiceserved ",
            "I don't get this. I did desk side IT for a long time in a company that had a horribly outdated dress code policy, so IT had to 'dress nice,' even crawling under desks. I used to make sure my skirts were long enough and usually wore leggings. It is not that hard, just super annoying.",
            "$blondie is an asshole. I hope she pulls her weight from now on.",
            "The real question is did you wear anything underneath your kilt?",
            "Yeah I blame the boss for not addressing this sooner since it was obvious skirt and open shoes aren't appropriate for the job. ",
            "u/ThymoNL u/NoHaxJustPi u/wotmate",
            "You know why they call it a kilt? Because I kilt the last guy who called it a skirt.",
            "r/pussypassdenied",
            "u/blackbat24 u/manualgg u/njdeems",
            "I love the note section.\n\nI really like equality, in its purest form. Not everything is perfect, but you should strive for the equal solution.\n\nOne of the biggest problems is the “SJW and feminist” movement. The idea is fine, but the vocal people advocate that women and men are unequal, with society leaning towards men, when in actuality it’s a very grey and complex issue, including legal punishment (one of the points that most surprise me) and sexual abuse.\n\nI understand that not everyone in a group is a horrible person. But the point is, we shouldn’t care what a person looks like or identifies as. We should be judging them by who they are as people. If not, then what was the point of MLK’s “I Have A Dream” speech?",
            "That's awesome!",
            "Maybe $blondie was hoping for a promotion!",
            "I think r/talesfromtechsupport might appreciate this",
            "This is amazing, good job!",
            "I'm about to pull this at my work.",
            "I dislike people like that.  I love to get things done and don't mind getting dirty to do it.",
            "Nice ",
            "I'm surprised she hasn't sued you for making her do the job she's paid to do. You've cost her a lot of hours of filing her nails, don't you know!",
            "Where do you work that half your team all could come up with a kilt with less than 24 hours notice?",
            "You sir, are an expert operator.",
            "Related: https://www.google.co.uk/amp/s/amp.theguardian.com/education/2017/jun/22/teenage-boys-wear-skirts-to-school-protest-no-shorts-uniform-policy",
            "I love men in kilts.  There’s something about the way they hug a mans bottom that is very sexy.",
            "I work with severe special needs kids.  A typical day for me involves running to catch a kid that's trying to elope, picking them off the tops of bookcases or hauling them out from underneath desks, stepping into the middle of fistfights and blocking them with my body.\n\nIf I can do this shit daily in a dress and heels, $blondie can do her job too.",
            "Brilliant. I have similar plans for next summer even if I have to go full drag.",
            "She's a women so therefore weak and delicate.",
            "You are my hero ",
            "She's wearing heels? Okay, take the shoes off. Work can be done just as well, especially inside, without shoes on.",
            "Absofuckinglutely fantastic! This is equality, no bones about it. ",
            "My aunt would have bitchslapped $Blondie with a wrench!   \n(She ran the grease pit at a gas station when she was 17. )   \nMy mother, in addition to have worked it clothes manufacturing, have worked as a painter at a furniture factory and welder at a shipyard.   \nCome to work in skirts or heels at any of those places, and they'd send you home instantly. \n",
            "Easily corrected at my place of work, No desktop is allowed to be placed on the floor as it restricts access to the computer and is an environment that allows more dust/debris to enter the tower, which requires additional PM(preventative maintenance) along with shortened service life.",
            "So much respect!",
            "Wouldn't it been easier to just talk to her or your boss instead of all this passive aggression. ",
            "And this is why Jada Pinkett Smith is triggered by blond white women. \n\n#understandable ",
            "[removed]",
            "Well played, OP! Did she reject your advances? :-p"
        ]
    },
    {
        "post_id": "yfmfpl",
        "author": "None",
        "title": "No OT but you won’t swap me to day shift? Ok, boss.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/yfmfpl/no_ot_but_you_wont_swap_me_to_day_shift_ok_boss/",
        "score": 14384,
        "num_comments": 199,
        "created_utc": 1666958905.0,
        "selftext": "This was originally posted as a comment to another thread but some said it needs to be its own post so, here ya go: \n\nMy work (aviation) was on a no OT at all rut for awhile in 2021. No biggie to most of us but the bosses were strict with every single minute because the higher ups were watching the time charging as well to make sure no OT was being clocked. \n\nI got a new job within my company that was requiring me to move. I was working second shift (1400-2300 M-F) at the time so when I’d get to work and answer all the HR emails, I would be behind on the check list I’d have to complete prior to moving. So I did the logical thing and emailed my then supervisor and asked to be transferred to day shift so I could be in the building during the day time to talk to HR otherwise I was going to miss my transfer date. My supervisor emails me back and says “you have a company laptop now, answer those emails from your house. I’m not swapping you to day shift.” I responded “ok.” \n\nSo I began my day at 0900 so I could email and Teams chat with various HR reps during the day and then go to work in the afternoon. I logged every minute and being that I had a company laptop I know they can see my login activity so I would have back up if they tried to claim I was stealing time. \n\nFast forward a week and the site manager (supervisors boss) pulls me into his off and wants to know why I have almost 20 hours of OT for the previous week when we aren’t allowed any OT. I explain to him I was given permission from the supervisor. Site manager calls the supervisor in. Supervisor says he gave no such permission. I tell them both about the email response, offer to send it to them and print it up should they need. My supervisor got as red as fire truck, site manger said your OT is approved and kicked me out of the office asking me to close the door as I left. I received a text message two hours later informing me I was to start day shift immediately. \n\nFuck em all.\n\nEdit: to clarify some things for those who are questioning the 20 hours of OT dealing with HR. I was being transferred to an international site with my company. So it wasn’t just HR I was dealing with. Some of the time was HR because I was swapping from hourly to salary, some of the time was with was legal (briefing on trade agreements), some of that time was the tax consultant briefings, some of that time was the moving company and coordinating with them a time to come survey my house for pack up, some of that time was spent reviewing documents for my new job as it was a different contract and I needed to be familiar with it since I was dealing with an international customer now. And some of that time was filling out the work visa info to return it to my company so they could process that shit because that takes a lot of time so the quicker you get done the faster you can get a visa. I didn’t want to drag out the story with this info and make a super long post so I simplified it with “HR”. \n\nAdditionally, and lastly; my company has a rule for hourly employees (which I was at the time) that if you required to do any work outside of your normally scheduled shift, you charge four hours minimum. So even if it’s answering an email outside of that second shift hours I was on, that was four extra hours on the day right there. (Some have mentioned to me that this rule could be a state law and I’m not sure if it was or not tbh nor do I care to look into it right now because I’m not in that state anymore lol. I just know it worked to my benefit greatly and in doing so I got to “stick it to the man”)",
        "permalink": "/r/MaliciousCompliance/comments/yfmfpl/no_ot_but_you_wont_swap_me_to_day_shift_ok_boss/",
        "comments": [
            "\"Asking me to close the door as I left\", hahahahahahahahaaaaah.\n\nThat did not end as your supervisor imagined.",
            "Yup, “use your work laptop to answer these emails at home” == start your work day from home. Supervisor needs to think before they speak lol. Don’t ask me to work extra and then expect not to pay me for it.",
            "Proper policy for companies that don't want OT is to say \"No OT unless approved or an emergency pops up\", which means justification and authorization will always be present. This also requires no detriments to OT (stupidity like docking bonuses) and making sure there are enough people on staff to do the work",
            "What did he expect? Answer the emails off the clock, I assume?",
            "I used to work part time on a railway. It was one of the few places that also had the signal box so it was a joint role, customer service and signalling.\n\nNow. There was a hiring freeze, so whilst employed part time I was doing a full time roster, and as it was a union job the rules were \"x many hours your shift was extended, a part timer is paid OT for all extra hours\".\n\nThe barrier was... two hours over IIRC. My contract has 5.5 hour shifts (part time) but I'm regularly working eight, ten, sometimes twelve hour shifts - hiring freeze.\n\nSo it'd be 2.5 hours OT for every eight hour shift.\n\nI'm logged into the signal panel, on OT as per usual. Only qualified person on duty (there was a non panel qualified station officer doing customer service). I get this call from a functionary in HR who castigated me for the OT and says \"I'm not gonna pay it it\".\n\nRemember, I'm on the line. So I log out, call train control as to why, they won't pay me, better organise buses for the line.\n\nControl asks when. \"Now, as I'm already three hours into OT\"\n\n\"Please, wait.\" Some big controller on six figures has just asked part time person to wait. \"Who said that?\"\n\nI told him.\n\n\"Is there someone else there?\"\n\n\"Yes.... but they're not panel qualified yet. They want to be, but, training freeze, remember?\"\n\nPanic. I go and make a cup of coffee. Phone rings, my OT is authorised.\n\n\"Old mate at HR called me on a recorded line, his exact words were 'what the fuck are you doing accruing this overtime?' I want an apology from him.\"\n\nThirty seconds. HR rings me. \"I apologise for my previous.\"\n\nI graciously accept, but I told him, \"I want it in my inbox and on the fax, that it IS authorised, otherwise tomorrow, 5.5 is what you're getting, or are we going to have the same problem?\"\n\nI then contacted the union and.told them.\n\nTL;DR railway, hiring freeze, OT freeze threatens me for working, finds consequences.",
            "This why documentation is so important. Everyone needs to keep a work journal and diary and no matter how irrelevant always have back ups and printouts! Date and time everything",
            "Totally worth its own post.  So much so that I've given you Gold for it  :D",
            "He was actually surprised that you wouldn't work for free.",
            "Red as a fire truck!!!! 🤣🤣🤣\n\nI love when bosses tell you what to do, you do exactly what they say, and…they get mad when they realize how dumb their idea was! 🤣🤣🤣",
            "Good job. F them",
            "Ferengi rule of Acquisition #13\n\n\"Anything worth doing is worth doing for money.\"",
            "DON’T WORK FOR FREE! Good job OP",
            "Nothing makes me happier than having a paper trail to back me up.",
            "See, when he said \"answer those emails from your house\", he meant \"do it when you're not getting paid\"",
            "What he meant \"Do it on your time, work for free.\"\n\nYou pulled an overtime reverse card, haha. Good for you!",
            "This story happened years ago. While I was working a 4pm to midnight shift at a TV station, management distributed a notice to all employees requiring them to attend a staff meeting, held, of course, during the day, at like 11AM. Which I did, coming in outside my schedule, and then put one hour of OT on my time sheet. Wow, did that hurt their feelings! In fact, the general manager, asked by a friend why he looked so sad, responded by actually naming me and complaining that I had asked for OT (to which his assistant GM quickly chided, \"Talk about a team player!\"). This was in the TV studio while preparing for a taping, with about forty people there who came from outside the station. Being pretty far down the authority structure, I was amazed that something I did could be so important that he would blame me so freely.\n\nI eventually backed down, IIRC, because it seemed petty to get HR (a completely separate department, which usually only came around during union negotiations) involved over one hour. But c'mon, you managers watch TV at night, right? You know you have second shift workers required to be there. Why schedule something for the whole staff without considering the guy who doesn't work a daytime schedule?\n\nI actually should have claimed 3 hours of OT, because that meeting really should have been counted as a callback. I don't recall asking the union steward about it, which I should have at the time. I continued to work there for years, in various capacities, until I retired a few years ago. But how this made me feel is not something I've forgotten.\n\nEdited to change \"totem pole\" to \"authority structure.\"",
            "I want you do do this. That's not what I meant. I know what I said but that's not what I ....",
            "Any decently intelligent person would see that a few hours of overtime a week is better then hiring a whole extra person.",
            "Never work for free!  Never!",
            "Man I would have been super worried they just would have called me out for not working between 9 and 14 haha. Unless you actually woke up at 9am and worked until you had to head into the office",
            "> Fuck em all.\n\nBAM!  \nWhy prevent them from ramming headfirst into their own consequences?",
            "Glad you posted it here. You played their game excellently. This is how you do it, to the ‘t’.",
            "Here from the other OT post on this sub",
            "This is fantastically malicious.",
            "Bahahahahhahahaaaa, amazing",
            "Your supervisor was a fool, you never leave a paper trail! \n\nGood on you",
            "and you got extra money too!!",
            "Well played my good sir.",
            "[deleted]",
            "Honestly, in my limited experience, non-salary jobs do tend to be better in the being clocked in when you're working aspect. That's only recent I know with the only reason companies giving the smallest shit being the threat of fines, but between the two family companies I worked and the two bigger chain supermarkets I've tried after COVID, the supermarkets were every bit as strict about clocking in for 10 minutes to talk to a manager as they were about coming back from break on time. Again, it was a CYA measure for them so they couldn't be accused of asking for unpaid labor, but I like that the threats of real consequences are at least getting to bigger companies a little bit even if it's still happening at some locations I imagine. One of the family owned businesses was a smaller grocery store just before COVID and in the 2 months I made it there, twice they asked me to take 10 minutes to help lift something in back cause they were under scheduled when I just happened to be in shopping on a day off, and I was just recovering from a psyche ward stay and was way too worried about being in trouble to say no.",
            "I started wearing pants and socks so now they bite my arms and sometimes go for my face.",
            "Currently at work on my day off. Was supposed to work tomorrow as well but I’m only allowed 20 hours of OT a week lol. They’re currently scrambling to find someone to fill in tomorrow. I said I’d work and get the 72 hours but policy is fun.",
            "Beautifully played!",
            "Though how is telling you to answer emails from home classified as OT?",
            "It took you 20 hours to arrange moving logistics? I think you might be the real life cliche of government inefficiency!",
            "I don’t think I follow this. \n\nIt takes you 4 hours *every* day to answer emails from HR concerning your transfer\n\nIf you were on day shift, HR would not have 4 hours worth of questions? Also I’m kind of amazed they had so many things to talk about. Usually it’s a few emails and the rest is lining up a place to live",
            "I  up ip you on it you uu the kutv",
            "Either you also work at Boeing or every aviation company is like this lmao",
            "If you were starting your day at home and then commuting to the office, it's possible you could have submitted those miles for reimbursement"
        ]
    },
    {
        "post_id": "qn6rpj",
        "author": "No_Sweet4190",
        "title": "You should have counted before you left",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/qn6rpj/you_should_have_counted_before_you_left/",
        "score": 14375,
        "num_comments": 787,
        "created_utc": 1636102050.0,
        "selftext": "My dad was a tire builder and union organizer in Detroit.  At our local bank there was always a sort of conscious condescension by the tellers for blue collar workers.  My dad was in weekly to deposit his check and take cash for the week. He finished one visit, and turned away and walked a few steps, then turned back to tell her he got the wrong amount of cash.  Before he could say a word, she snootily said \"You should have counted before you left my window. I can't do anything for you now.\"  He smiled and nodded and walked out with his extra $50.  That was a good week for us.  As  a reference, gas was 19 cents a gallon at the time. The next week he went to a different teller and waved casually in response at the former teller's frantic motions to see her.",
        "permalink": "/r/MaliciousCompliance/comments/qn6rpj/you_should_have_counted_before_you_left/",
        "comments": [
            "When \"$50 Bank error in your favor\" really meant something.",
            "Many years ago the same thing happened to me at a bank drive through window. I counted the money then and there and told the teller that her count was off. She assumed that I was trying to claim that I was short but in fact I was trying to tell her that she had given me $10 too much. Her reply was “I don’t make mistakes!!”  Okay then ... I just drove away.",
            "I once went back to a teller to return the $30 extra that she'd accidentally given me, her boss overheard and fired her on the spot. It was the first week of the first polymer note to go into circulation in Australia. Several brand new, sequential notes had stuck together.    \nI ended up speaking to her union representative and the state H.R. boss. She kept her job. Her branch manager was demoted.    \nThose notes were later considered a failure and taken out of circulation. The next version was far superior.",
            "Reminds of when I went to a pet store to buy supplies, and the total got to around $93. I paid with a $100 bill, and somehow got $93 back in change. I stared at the cashier's hands confused, took it and left with my girlfriend. I told her as we were in the parking lot and my conscience was eating away at me. I essentially paid $7 for $93 worth of cat pet supplies. \nWhat made me go back was my realization that the cashier would've been in some amount of trouble if I didn't correct this. I showed him the mistake he made and his eyes went wide open. He was super thankful that I came back and fixed it.\nI did feel better about my decision. I think if I kept the money, my guilt would've ate away at me for days.",
            "I used to handle deposits for work, and exchange cash for rolled coin every day. Despite going several hundred times, the teller gave me too much cash twice, and the second time contacted us about it before I noticed it. Over four hundred trips, less than three errors? Seems good to me. 99.5% accuracy is great for anything other than a machine.",
            "cashed an expense check at bank and teller gave me $1,500 too much…I had stepped to the side of the window to count and stepped right back to tell her…manager walked up to see what the problem was and was very grateful for my honesty…well, I was thinking they would eventually figure out the shortage and I’d be liable for taking something that was not mine nor entitled to…it was a mistake.",
            "Blue collar with the extra greenbacks. Nice.",
            "The teller would have had to stay back hours if her drawer didn't tally. Source: sister was a bank teller",
            "When I was in my mid-twenties I worked for a large law firm in the city. One of the tasks was to go to the home office branch of the bank at the ground floor of the building to get petty cash. learned I could sign a piece of paper and walk with a quarter million dollars cash, ( I admit I was momentarily tempted, but realized that at my age, if I was to commit such a crime it would have to be min 10 Million: end of temptation) But the relevant part was the cashier counted the money in front of me, then I counted the money in front of her/him, if we both matched all was good.",
            "I have experienced bank tellers making mistakes, but NEVER ever experienced a casino cashier of dealer making a count mistake.\n\nNo saying it never happens, but I do think its interesting....",
            "Back in the 80s I played in a band and took the cash pay at the end of the night. I needed smaller bills to divide the money up for all the band members. I went up to the bartender, who normally would have counted the bills, made the change, then counted it out to me. Instead, the club owner stepped up, grabbed my cash as I was handing it to the bartender, and said he would change it in his office. He brought back my smaller bills and handed them to me, then disappeared. I counted the money, and he shorted me. I found him and told him he made a mistake, and he said he would go check. He came back and said he didn't. I ended up taking the hit for the missing cash--didn't seem fair to make everyone pay for my (understandable) mistake. What a miserable POS that guy was!",
            "[deleted]",
            "Years ago I returned a few items and bought some other items. This store you would just drop your returns to one of the checkouts. I walked in, stopped at the checkout and dropped off the returns, told the clerk I  was going to pick up some items and we could straighten it out then. When I get back I knew my returns were roughly $25 and my purchases were roughly $50 so I would owe $25. She runs the items through and says I owe $5 and change. I question her so she does it again, and comes with $6 and change. I question it again, saying the return is $25 and the purchase is $50 so I should owe $25, all rough numbers of course. She does the math for a third time comes up with $6 again, I look at her funny, she blows up, I pay the $6  and leave.",
            "Similar thing happened to my dad back in the 80’s. One of the bank VPs kids got a job as a teller and would short people whenever he could get away with it. Caught my dad a couple of times but my dad just started counting it out before he left the window because the guy would always say “No adjustments after you leave the window!”\n\nMy dad went in one day for a few thousand dollars in cash for something to do with the business. I don’t remember what. My dad tried to avoid the teller, because the guy had started trying really hard to get my dad because he kept correcting him but he was the only teller available. Long line of people before and after my dad. Bunch of them grumbling about how the guy had shorted them 5 or 10 dollars. When my dad gave him the slip for the withdrawal he asked how he wanted it back and my dad told him hundreds, twenties, tens and, fives. He got into a huge production of stacking the different denominations and moving them around but my dad noticed he had screwed up and counted out way too many hundreds. But he didn’t say anything. Just idly glanced that way way every now and then to make sure that stack didn’t change. It didn’t. The teller finally stacked the money up with the smallest denominations on top and my dad had noticed he had shorted him a ten dollar bill while he was moving the money around. But he didn’t say anything. The guy slid the stack of money to my dad and he took it and walked away, counting it as he went and a new customer went to the window. My dad got about 15 feet away and turned back and said loudly that the teller had made a mistake. The teller sneered at him and said “No adjustments after you leave the window”. My dad said even more loudly “But it’s a BIG mistake!” The teller said “I told you NO ADJUSTMENTS AFTER YOU LEAVE THE WINDOW!” My dad then replied “Are you SURE?” And the teller told him that was sure. My dad then said “Well, if that’s your policy, than thank you for the extra thousand bucks you gave me while you stole my ten bucks!”\n\nThere was dead silence and then the teller and a couple bank officers were very interested in correcting the error. My dad told them “No corrections after you leave the window!” He got handed a bunch of business cards from witnesses who all told him they had been shorted by the guy before and they all said they would testify. My dad kept the money. \n\nThen he had an interesting visit the next time where they had to put that amount back in his account because they took it out and didn’t have any paperwork authorizing the withdrawal. Then paid my dad a hefty loyalty bonus (bribe?) for not reporting it too the bank examiners.\n\nNever saw that teller again at the bank…",
            "My wife was a teller in the early 2000s, if she were off by <$2 she'd be written up, if it happened again or was over $20 to begin with, she'd be fired.  Curious how a bank before that would allow a $50 go like that.",
            "Didn’t count on that.",
            "Bank error in your favor. Collect $50",
            "You never count your money when you're sittin' at the teller...",
            "Definitely needed to count before leaving 🤣",
            "Banks do make mistakes and they will catch the mistakes. I received an extra $50 when cashing a check via drive through teller once and didn't catch it until after driving away. \n\nThe bank called me a day later and asked me if I had gotten extra.  Given that there were already cameras everywhere, I decided honesty was the best policy and told them I did. They gave me the option of returning it or taking it out of one of my accounts. \n\nPerhaps I could have gotten away with it, but I figured it was not worth the risk.",
            "I once called U-Haul for a van and was on hold for 15 minutes before hanging up and calling back. This time, I was on hold for 20 minutes before somebody picked up the phone and helped me out. I was about to ask for the amount and how to pay when they hung up on me mid-sentence. I went in the next morning and got my truck, still pissed off from the day before.\n\nI used the truck to move to a new apartment and took it back the following day. The employees behind the counter were yakking it up and seemed to be having a ball, even though the lobby was full. I wasn't the only customer who was angry at how casually they conducted their business.\n\nFinally, I was at the counter and they took my key. I waited patiently for the guy to tell me how much I owed when he walked back and gave me $118 in change. I was inclined to tell him that he'd made a mistake but he turned away without so much as a \"Have a good day. Thank you for using U-Haul\", so I just put the money in my pocket and walked out. They didn't get a credit card number and hadn't taken a cash deposit. I don't even think they had my phone number because it wasn't on my receipt. Never heard about it again.\n\nSince then, I've had a few occasions when people gave me $10-$100 since then and I've always made them aware of their error, but that's because they weren't customer-trolling turds like my buds at U-Haul.",
            "What I dont get is now a day the bank makes a mistake and we end up with a couple extra bucks and we don't give it back it's stealing. They fuck up and the bank loses our money its usually our problem",
            "Hey everybody, teller 3 is giving out free money!",
            "Several years ago England changed their £20 notes. When they were still brand new and didn't have finger prints and drug residue on them they would stick together in the ATMs, so if you were very lucky you could make a nice little profit for the day.",
            "Surprised she was even there the next week. I hear banks take drawer shortages pretty seriously",
            "Not money, but gas.  In the mid '90's, I was a teen and worked at a full service gas station.  Didn't have my own vehicle, and had never pumped gas before.  Was a fairly easy job though.  \n\nOne day, I was pumping gas for someone.  She wanted only a specific dollar amount.  I was looking at the gallons, instead of the dollar amount.  Couldn't figure out why it was taking so damn long to reach the dollar amount.  I was well over it when I realized my mistake.  I had to eat the screw up.",
            "Back in the good ole 80s, a friend of mine got $40 too much back from cashing her paycheck during lunch. She was somewhat frantic through out the day, wondering whether to return it or ?$?$?$? by the time she got home after school they had called her home. Apparently they had the technology to figure it out. We were a small town, it probably wasn't that hard to find the missing money.",
            "I recount everything in front of the customer as sim giving it to them in full sight of the cameras so that way if there is ever an issue the cameras can see what I did or didn’t do! I don’t want something to be blamed on me!",
            "Love it 😂 what do you reckon the equivalent that $50 was back then would be today? Prob close to $500 I’m guessing",
            "My husband got an extra $100 from Western Union under similar circumstances. His dad had wired him $1500 to get some stuff for him and the woman working at the counter was awful. He tried to correct her but she kept telling him off so he left with $1600.",
            "I once made a deposit and they used my bank account number for the amount in error. For at least an hour or so I was a multi-millionaire.",
            "Once, I had been at a new job for a few weeks, when they had a problem with the punch clock for a day or two, and made a bunch of manual corrections to people's timesheets by hand.\n\nWhen I got my check, I had been given credit for 8 hours that I hadn't worked. Being a somewhat honest sort of feller, I went to my boss and said, \"Roy, there's a problem with my paycheck. I got...\" He assumed I was complaining about being shorted, immediately cut me off, and curtly and rudely told me to go see his accountant if I thought I'd been short-changed.\n\nOh hell fucking no.",
            "Similar thing happened to my cousin when he was a teenager and started mowing lawns for the guy across the road’s father, he was overpaid with an extra hundred in his first week and when he went to correct him the smarmy guy (who was paying cash in hand) cut him off, assuming a complaint and said “that’s all you get, work harder next time.” He believes the guy intended to short him a hundred and just glitched out when counting. He dodged his phone calls and never went back to work for the guy afterwards saying he’d shown his true colours…",
            "When I was in college in the 80's, I deposited my $87 paycheck and asked for $10 back. I got $870 back. That would have paid a third of my next semesters tuition. I had to argue at the drive thru for about 5 minutes before the teller understood what I was telling her. Then she tearfully thanked me.",
            "I guess your dad was just too blue collar to understand that she needed to talk to him? Oh well.",
            "Happened to me in the ‘80s but it was $200. They tried to call me at home. Didn’t happen.",
            ">The next week he went to a different teller and waved casually in response at the former teller's frantic motions to see her.\"\n\n\"You should have counted before I left\".",
            "What could she have done? He already made the transaction and she declined the attempt to correct it, and it was also a week too late. The most she would have gotten would have maybe been a short lecture about not treating people as inferiors and those type of things might not happen often.",
            ">gas was 19 cents a gallon at the time\n\n\n\nIsn't that like 5 US cent per liter?\n\n\n\nHow many decades ago was that?",
            "Father got shorted $100 at the drive through, he went inside. Then things got really interesting.  Comes the teller was skimming cash off of withdrawals.  He didn't count on Dad to count his cash before leaving.  One less teller, he went to jail too.",
            "Next visit, whilst still at the counter.\n\n1.......2......3........4",
            "That teller likely was disciplined or fired since the extra money wasn't returned",
            "My bank has the tellers count the cash as obviously as possible.  They count out loud while laying each bill down on the counter.  Different denominations of bills go in separate stacks.  Watching it happen makes it seem extremely effective at preventing mistakes.  Apparently that was not the way in the days of $0.19 gas.",
            "I recall many years ago in our town someone had reversed the $20 notes and $50 notes when they loaded the ATM. So if you asked for $20 you would get a $50 note instead. But, your receipt said you only got $20. Word got around pretty quickly and there was a line forty people long waiting to use the ATM. This caused a bit of a stir, and the staff inside eventually figured out what was going on and shut the machine down.  That bank tracked down every single user and got their money back....",
            "I reckon that $50 then was $500 or more today.  Teller must have been in deep shit.",
            "Imagine a bank teller telling you that they aren't going to give you the money you worked for and legally own... What the fuck did she think would happen? She could cheat someone of fifty bucks and they'd just shrug and go \"oh well\"?",
            "Winner winner, roast chicken dinner? Happy compliance :)",
            "I once cashed a paycheck at the bank drive through .. we were going on vacation. And she gave me twice the amount.\n\nI parked, went in , and gave it back. She was very thankful.\n\nMe ? I knew they would have just taken it from my account as soon as they figured it out.",
            "This is hilarious.",
            "If I’m off $5 in any direction I’m in trouble. I couldn’t imagine $50",
            "[deleted]",
            "If possible, I would do a quick balance on the spot.   If that wasn't possible  I  would take their name and number and call them when I closed.  Personally,  I  WANTED to be over so they wouldn't think I pocketed the money myself.  I don't think anyone ever got ugly if I had shorted them as I always apologized profusely.   \n\nBut if I balanced to the penny it could go downhill fast.  The chance that I could have made TWO mistakes for that exact dollar amount, one over and one under, was extremely unlikely.   One guy glared at me for weeks until another teller that he liked chewed him out.",
            "I once had a bank teller (in 1992) deposit my account number into my account, which gave me a 12 digit deposit!",
            "Wow! That was a LONG time ago. I never noticed the price of gas until my dad handed me a gallon gas can and a quarter and told me to walk to the gas station and fill the can. He needed gas for the lawn mower. Gas was 24 cents a gallon. I was 11 years old. Now I'm on Social Security.\n\nAnyway, as gratifying as that story is to read, it would never happen today. Banks have no obligation to allow you to keep the money if they make a mistake. For a small amount they'll just claw it back from your account. For a larger amount you'll be saddled with a debt you can't discharge through bankruptcy, and may even be charged with theft.",
            "And he [ran off cackling into the night with his new found fortune](https://www.reddit.com/r/MaliciousCompliance/comments/qnkt9l/oh_we_dont_make_mistakes/)",
            "the bank teller gave me an extra $1000 in a deposit. I told her and she was embarrassed. I never saw her working there again.",
            "I had a teller once loudly announce the amount in my checking account when I went in to change bills into coins. \n\nYup, pretty sure that’s illegal. \nHence why I don’t bank with those shits anymore.",
            "Taking correction is hard, but sometimes you have to realize that life has a board for every behind.",
            "\"You should have counted before you left my window. I can't do anything for you now.\"\n\n\n\"Wow! Ok, thanks!\"",
            "Looks like meat’s back on the menu, boys!",
            "Years ago I worked at May Company (yes a long time ago!). It was only like a week before they had me taking in the money from all the store registers at the end of the day, counting it all, and putting it in the vault. I'm sure they had cameras and all that, and I never would have tried to steal money, but it was astounding that they just gave me that job like it was nothing.",
            "I once went to deposit $10,000 \n\nThe teller counted it credited it to my account and handed the cash back to me!\n\n(I gave it straight back almost immediately and she was grateful - In hindsight it was too big an amount to get away with even if I had walked off with it!)",
            "I once got a $140 Norelco shaver for free by just chatting with the cashier as she rang.  No deception / slight of hand. When my bill was $30 not $170 I paid and calmly left. Thinking if I set off the loss prevention alarm I’d just go back and pay for it.  Turns out I didn’t set the alarm off.  Cashier had done everything right including remove the anti theft device on the box when they scanned. The computer just didn’t register what scanned.  It made the noise  like normal and the rest of my order did too.  Still use that Norelco today.",
            "My first day at a grocery store as a cashier. I was 16, this terrible woman ( nasty mean thing) . She made me so flustered I gave her back her check instead of putting it in my drawer. Not lots of money and a mistake on my part of course. She complained, I apologized and they decided I’d be better trained for the deli and bakery. So I got a raise and a better position. It was just an off day, i’d worked at a concession stand before and hadn’t had probs making change. Thank goodness, I was better at deli and bakery.",
            "Served her right!",
            "I went to Panera a week ago, my bill was $11.55. I gave the cashier $20.00. She said my change was $14.45 and she handed me $19.45. It took a moment for it to sink in just how much she messed that up. I did correct her and give her the overage back, and after I ate I had a word with the manager. He thanked me, but the look on his face told me that wasn’t the first time she had messed up. I haven’t been back so I don’t know if she’s still there or not, but I wouldn’t be surprised if I never saw her there again.",
            "Managed a gas station 40 years ago, and hired a guy who not only couldn't make change correctly (the registers didn't do it for you back then), but almost always gave back too much. Couldn't figure out who it was, until one of my regulars started to feel guilty and told me, because he always waited until this guy was available to pump his gas.",
            "I had an ATM give me extra cash once. I went to the bank the next day, told them, and authorised them to pull it from my account. They had no procedure for it; it had never happened before that someone came to say too much cash had been dispensed.",
            "I once changed £5 at an Swiss bank en route to Italy. This was in the days before the EU when liras were silly money. I did warn the teller that it was easy to get the rate wrong (it had happened to me before) so to be careful. When we arrived in Italy it was my turn to pay for the petrol so I gave my friend what I assumed was the correct change but apparently was far too much. I started the journey with £50, I had just been handed another £50. ( yes I know that this sound unbelievable but this was 1971 in the UK all the way to Kabul. Good times sleeping under our land rover when it was wet. There were any thing from 6 to 8 of us depending.)",
            "19 cents a gallon, so this happened in the mid 1940s-ish? $50 bucks back then was almost a grand that teller gave away. Woops.",
            "This ended too soon",
            "I've always been under the impression that that would be considered theft. You know that you got extra money and that it actually belongs to the bank. People have gotten money that wasn't theirs before, spent it, then spent time in court after they couldn't pay back the money. No such thing as a bank error that works in your favor.\n\nHowever, I've been in a situation before where the atm shorted us 40 dollars on a 200 dollar withdrawal. Called the bank, they took a look at the atm and said it dispensed the correct amount. Never did get that money back."
        ]
    },
    {
        "post_id": "w0zze1",
        "author": "Strikeronima",
        "title": "Costing a company Millions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/w0zze1/costing_a_company_millions/",
        "score": 14356,
        "num_comments": 383,
        "created_utc": 1658035977.0,
        "selftext": "So I worked as a QA ( Quality Assurance) at a factory I'll call ida-ore. To get started I'll explain their report process, when something goes wrong in the factory that's directly tied to quality ( such as bad coloring or defects) I as a QA lead would have to write a report. These reports were very detailed and extremely time consuming. Now when something went wrong that wasn't directly tied to quality but effected it ( such as a machine breaking or foreign material getting in the machines ) the lead in charge of the machines were supposed to write the report. Somehow all the reports ended up being written by me even though I had my own time consuming job to do. I had been fighting to not do others reports for months and my boss told me to remind other leads when a report was needed.\n\nOne day I'm doing my reports plus my data analysis duties and I hear over the radio that a refrigerator unit has gone out and all the product was coming out as boiled mush instead of frozen, so I call refrigeration and tell them \"you need to do a report on this I'll send out an email counting how many pallets of product we lost\". So I send the email and continue on with my day, two weeks later my boss calls me into her office and asks me why I didn't write a report on the incident, I say \" you told me to remind the other leads to do it and not write their reports\". She responded \" well if you have time to send an email you have to to write a report\" then she makes me sign a write up for failure to do my duties (which I did placidly cause she had written up everyone else in my department and had been looking for something to write me up for, so I decided to let her have it and get it out of the way).\n\nWell a couple months later and the exact same thing happens and all I do is tell refrigeration over the radio to write a report. I did nothing else knowing that refrigeration wouldn't write it. Because there was no report or helpful emails the product was almost shipped out two months later but it was caught by one of my QAs who mentioned the incident to my boss. Boss calls me to her office and tells me \"this incident is going to cost the company Millions in storage fee's for the time it was already stored, disposal fee's, lost product and a fine from Walmart for not meeting contract. Why didn't you email me about this\" me \" I didn't have the time but I did tell refrigeration to write a report\".\n\nShe couldn't write me up for it cause I had emails from her telling me how to handle these situations.",
        "permalink": "/r/MaliciousCompliance/comments/w0zze1/costing_a_company_millions/",
        "comments": [
            "Wow.  'If you have time to tell someone to do their job, then you had time to do their job, ergo it's your fault they didn't do their job.'\n\nThat is messed up.",
            "Sounds like those reports are a real hot potato at your factory",
            "Incompetent management couldn't (or wouldn't) make the right people do their jobs and just relied on you doing an unfair share of the work. They're idiots for not recognizing the risks of such a policy.",
            "This is why you should never leave tots in charge of your taters.",
            "This was a very satisfying read. Well done 🙌",
            "If you're writing detailed technical reports you are much more than a \"lead\"",
            "[deleted]",
            "Pay one more person a salary to handle the reports (costing them 40-70k a year) or pay millions in costs, defects, storage and disposal fees.\n\nThey choose the waste and fees every fucking time.",
            "That's beautiful, and how is she not fired?",
            "QA stands for \"Quality Assurance\"",
            "It's the same way at the pasta plant I work at",
            "Hey OP, my father worked for the same company from the early 1980's - late 2000's and I can just feel him laughing his ass off and giving you two big thumbs up",
            "I wish this were unusual. I worked as QA lead in a very different industry; I found that many bean counters in my organization and those I applied to believe that QA adds no value, and is best gotten rid of as soon as you can prevail on production to produce…perfectly. \n\nI suspect they’ve all been reading Jack Welch’s biography. I’m also sure they are absolutely right, just like I’m sure pink fluffy unicorns are out there washing my car right now.",
            "Reeks off tps reports in office space lol",
            "That is as good as the cake factory that switched from cream cakes to cream pastries but someone forgot to turn the fan in the shock froster down a notch or three. After the product took a suspiciously long time to come through... They found the freezer happily churning it all into a giant iceberg of (previously) creamy goodness besides the cooling line. It was a bloody long shift I've been told. \n\nYour (or their, rather) doing cost a lot more money though, the cake gore at least was fixed right quick. Well, as quick as you can hope for with half a run of very frozen carnage.",
            "\"well if you have time to send an email you have to to write a report\"\n\nSounds like someone who has never written or read a report.",
            "I imagine that after that, you two weren't best spuds.",
            "dont ever agree to BS write ups, especially with vindictive managers",
            "I know what company you work for. And, I applaud the petty. LOL",
            "It’s all-righta. I couldn’t help myself.",
            "I think I have the exact same job except in a different company (even down to the products I suspect are being made). There is no way that being made to write the reports the responsibility of other departments would be expected or required. I feel the pain of ever increasing responsibility heaped on me though. My company has a tendency to say \"Oh we need someone to do this job, QA can do it, since they can't be that busy.\" It's annoying but at least they make it our job officially rather than expecting us to pick up the slack when Packaging or Production has shirked their job. If Packaging was supposed to get a report done, it will be the Pack lead taking the fire if they don't do it, not me.",
            "Are you the reason I haven't been able to have hash browns for the last 2 years?",
            "Managers like that are trying to make up for their inadequacies by finding fault in others.  When they fail they’ll say it’s because of all of the bad employees, and use the write ups to make their case.  Document everything, and encourage everyone else to also, it will be helpful one day.",
            "Shit rolls down hill in the corporate world. Learning to play the game is key even in stupid situations like this.",
            "What an absolute fucking bitch you have as a boss.",
            "Mismanagement, its her fault",
            "Never sign a write up if it’s NOT your fault",
            "I truly don't understand managers that go out of their way to write people up. I've put team members on improvement plans with the genuine desire to give whatever training and support is necessary to bring that person up to the skill level I know they're capable of, but I have not once ever \"written someone up.\" \nIt makes me feel shitty, it makes them feel shitty, and it has an absolutely garbage effect on workplace morale. Why even do it?",
            "Are you me? My last job looked for any reason to write me up and would tell me to do things in person wrong while I was being trained (didn’t get a real training) then email me a different way to do it then write me up no matter what way I did things. A coworker thought one of the reasons I was being targeted is because I’m 6’ and a girl and my boss was about 5’1 and a guy",
            "So that’s why I couldn’t get my tots from Wally World 😂😂",
            "Small nitpick…. QA and QC are not actually interchangeable. Most people use them that way, but they are not the same.",
            "Write up = me immediately searching for a new job.\n\nIf you're not happy with me, I'm sure some other company will be.",
            "Surrounded...by idiots",
            "In a nutshell, this is corporate/office toxicity.\n\nIt's a very costly thing to have in a company, I suggest you notify your boss's higher ups to look into it.",
            "Sounds like a top down problem with the quality structure. Yike",
            "As a fellow QA, YESSSS!!!! I was in charge of 6S for a manufacturing floor once, and despite PPE being necessary all over the floor, no one used it properly/enough. Despite me bringing up to Quality Eng, our 1 environmental dude and the Manufacturing director, nothing ever changed. There were plenty of other issues such as the SDS sheets weren't updated, walkways weren't ever clear, the correct receptacles weren't used for solvents etc. So eventually someone got hurt soldering and all I did was stare at supervision as they had their emergency meeting then clock out early and go home just for every plan I ever wrote to be approved down the board and implemented by Monday.",
            "I swear these toxic managers bet that their workers would just take it and not jump through hoops just to settle things.  Those are the types you need to cc hr on so they can't try shit.",
            "I had some experience as a QA at an ida-ore. And it was our fault for everything. If the hashbrowns had more black than white it was somehow our fault that we told them to stop bagging cause it was rotten. I had a lead look at me and speak loudly \"you didn't know a defect before you came in here\" like I nor the millions of people who would be expected to eat this couldn't see it was rotten.",
            "Here in Canada we have a cookie called Puffs. Similar to a Malamar but with jam or caramel under the marshmallow. My Mum worked in their factory for 3 days before she quit back in the 60s. The “quality control “ would have made OP run screaming. Rats and bugs running across the floor . Open vats of jam and chocolate with flies. Mums job - no word of a lie! - was to watch the conveyor belt , if a cookie fell off , she was to pick it up off the floor , BRUSH OFF THE DIRT AND RAT SHIT - and put it back on the conveyor belt!! Ya she lasted 3 days before the stink of the open vats and the filth got to her and she quit.",
            "I work in QA and had a temperature excursion too!  I'm now writing the report :(",
            "She’s is one of the many people who do not deserve to be in charge of anyone but some how they are.",
            "\"at a factory I'll call Ida-Ore\" **😆**",
            "Why do so many companies act like quality is responsible for the paperwork?! That’s not how this works.",
            "That’s why it’s better to stay in your lane and not go above and beyond",
            "Time for HR",
            "So that's why the morning hashbrowns were mush for awhile. We thought we were doing something wrong during storage and or preparation.",
            "People like this just want to DOMINATE YOU, like all narcissists. They don't give any fuck because it's not their money and usually no consequences on them, either.",
            "Some people are expected to do every job to perfection while others are just accepted for doing less than the bare minimum smh",
            "I’m so sorry, I saw the first line and instantly thought of Creed from the Office saying “quabity ashuetts”.",
            "Was this in a town named for a Canadian province, by chance?",
            "So...Are you the reason I couldn't find any hash browns at Walmart for, like, ever?",
            "The plural of \"fee\" is \"fees\"",
            "Since you’re writing reports, make sure you use the correct word affect or effect. There are exceptions but in most cases affect/affected/affects is a verb and effect is a noun. Example: ‘The effects on my evaluations of these failures affect my bonuses.’",
            "Nope valley fine foods",
            "Best one I’ve seen in a minute. What goes around comes around.",
            "So, Ore-Ida?",
            "I wouldn't want you writing my reports anyway.\n\nhttps://www.merriam-webster.com/words-at-play/affect-vs-effect-usage-difference\n\nYes I'm having a bad day.",
            "New job time",
            "I'd have fired you on the spot. You don't compromise food safety over a pissing match about whose job something is. People could have died due to your petulance.",
            "[removed]",
            "how is this MC?  i thought you were going to show her a report about how you had emails telling you not to do a report that another manager should write.  \n\nyou just literally didn't do what she asked, because you had prior auth to not do extra reports.",
            "Need TLTR",
            "Gonna best this is a newly acquired firm that is known for coolers. In Tx.",
            "Is it OP's fault that Taco Bell is out of seasoned fries?!?!?!?!?!",
            "Making me rethink who I buy my frozen potatoes from.",
            "Sounds like she's the type to never take blame and always place it on someone else.... It's sad but alot of corporate management is like that (in my experience) just do as you did and cover your bases ☺️",
            "I applaud this, 100%.  However, my advice is that you should start looking for a new job.",
            "Well done.",
            "Ida-ore 🤣🤣🤣🤣",
            "This is the way.",
            "  B",
            "i Totally Forgot About Thīss Sub, Thīss Wuz A Gr8 Read, ....",
            "My sympathies for being part of big manure."
        ]
    },
    {
        "post_id": "17chkc0",
        "author": "WhiteCherryRose",
        "title": "You want proof that my fiancé is sick? You got it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/17chkc0/you_want_proof_that_my_fiancé_is_sick_you_got_it/",
        "score": 14347,
        "num_comments": 518,
        "created_utc": 1697825325.0,
        "selftext": "I (25F) am engaged to my fiancé Joey (26M). He recently had surgery on his leg and hip, but there were complications, and he has been sick and weak since. We try not to ask for help, but this has put a big financial strain on us, to the point where we’ve spent our wedding savings on his recovery. We are fine with this because if we need to have a courthouse wedding, we’re cool with it. We just want him to be healthy. But we did set up a temporary donation page to help with some of the expenses.\n\nA friend of mine, Karla (25F) donated $10 about a month ago, and I reached out to her to thank her. Last week we posted an update, not asking for more money, but just to let people know that Joey has had another setback and the doctors are creating an all new treatment plan for him. Karla commented publicly and said the following: “I’m beginning to question if he has actually been sick this long or if y’all are just trying to get more money for your wedding. Who takes this long to recover from surgery especially when you’re an athlete?”\n\nI said, “I am very offended and appalled that you would accuse us of faking anything. Maybe you’re just having a bad day or a moment of bad judgement, but how shamefully low of you.\"\n\nShe replied, “I want my donation back unless you can show proof that he’s sick. In a hospital bed or sitting in a doctors office… anything?”\n\nI sent her $10 to get her off our backs, but I also sent her a video (with Joey’s approval), the proof she asked for. One of the concerns Joey has had is that he will get severely nauseous if he eats protein (which is what he’s supposed to be doing) and when he over-exerts himself (which he does sometimes). I sent her a video of him dry-heaving into an emesis bag in the middle of PT. Now, one of his doctors asked us to record his PT so they can see the progression of him not feeling well to hopefully make some adjustments, so I didn’t take this video just to send to Karla, but to me it seemed like solid proof since she was asking for it.\n\nShe said, “WTH? I have emetephobia [I didn’t know this] and this just triggered me so bad. I hope you’re happy with yourself, I feel like I’ve been traumatized.”\n\nI said, “So now you have ten more dollars to process this trauma in therapy.”",
        "permalink": "/r/MaliciousCompliance/comments/17chkc0/you_want_proof_that_my_fiancé_is_sick_you_got_it/",
        "comments": [
            "\"Oh, you have emetephobia? Where's your proof? Either a written diagnosis or a testimonial from your primary care provider will be enough. Otherwise, you're just doing this for attention and sympathy.\"",
            "I wouldn’t call Karla a friend. If Karla is a standard friend sounds like you have some shit friends. I hope your fiancés recovery goes well and you both have a happy life.",
            "If she has emetephobia, why would she ask for proof that someone is sick? I really hope she uses that $10 for therapy.",
            "Well, does Karla have any proof of this emetephobia?   😭",
            "Karla sounds pretty ignorant. Most people take their health for granted and don’t understand how easily it can be taken away. Even without catastrophic results complications can arise from even the most mundane things. I had a friend who wasn’t healing from surgery because he was allergic to the sutures. He had to go for two follow up surgeries just to clean it out and fix everything up. He was on crutches/scooter for nearly 9 months. After “routine” surgery after an accident that should have healed in 6 weeks.",
            "She literally demanded proof of his sickness, so what on earth did she expect?",
            "Look at it this way: it cost you a $10 donation and a video to keep Karla away from you for the rest of your life.\n\nBargain!",
            "Her phobia is her problem. She wants to play doctor then she can deal with the results. Kick this hag to the curb and ignore her stupidity. She's not worth having in your life.\nIt was only ten dollars, it's not like she took out a huge loan to help you.",
            "Coming from someone who has pretty severe emetophobia, I seriously doubt she’s telling the truth. There’s no way that I would ask someone for “proof” of being sick, much less hit play on a video of what appears to be someone vomiting in the still.\n\nShe’s a double AH for being a terrible friend and trying to weaponize phobias — which are legitimate mental health issues that lots of people struggle with — to gain sympathy for her attitude and poor behavior.",
            "Karla's a real piece of work. Dump this \"friendship\" fast.\n And WHO TF asks for their donation back? And a paltry 10 bucks at that?   I'd have handed her a solid $20 bill and said 'here.  apparently you need it more than we do, ya piece of shit. Buh-bye!'",
            "Oh! Your friend is a sympathetic puker! This is a prime opportunity to conduct some Pavlovian conditioning. Condition her to vomit every time she gets an email, text, or phone call from you. I double dog dare you.",
            "Karla sounds like a garbage \"friend.\"",
            "r/traumatizeThemBack",
            "I have a crazy idea, why not just have a system in place so people don't have to have Go Fund Mes, Spaghetti dinners, pancake breakfasts etc.. to cover the cost of health care.\n\nImagine living in a society where people feel sympathy for people who are having health problems, rather than thinking that a person is grifting to get wedding money.",
            "Any donation with strings attached isn't a donation. And any friend who requests proof of the need for a donation isn't a friend.\n\nIf money is given without the context of a loan. It should be considered lost. And all this over 10$ is pretty trashy on her part.\n\nI hope your Fiancé gets/is better. Only good vibes.",
            ">WTH? I have emetephobia [I didn’t know this] and this just triggered me so bad.\n\nProve it",
            "Emetophobe here. Yeah seeing a video like that would be upsetting, but she LITERALLY ASKED TO SEE PROOF HE WAS SICK. Her behavior was awful and she shouldn't use emetophobia as a shield from consequences.",
            "I had emergency surgery for blood clots which were almost fatal, and for a lot of people, especially other 18 year olds, it could have been a couple months of recovery. But for me, that was the physical trauma catalyst event for my autoimmune diseases to kick into overdrive and start trying to shut down half of my organs, and as a result I will *never* recover from that illness. Healthy people never really understand how lucky they are until it happens to them.\n\nAlso, please spam her videos of cats hacking up hairballs until she blocks you and leaves you alone. She's not a person worth keeping around.",
            "You should have asked her to send you proof!",
            "karla can take her $10 and shove it where the sun doesn’t shine, so rude and she should never be called anyone’s friend!",
            "Fuck that Karen.  Make a 'you're not invited' card written in calligraphy and send it to her.",
            "Looks like someone got herself uninvited from the wedding. She doesn’t sound like a very good friend. I hope Joey feels better soon!",
            "Your 'friend' does not have emetephobia. She's a shit. Nicely done.",
            "To add on the donation site:\n\nTop donation of the month:\nKarla - 10$ \"I want my donation back..\"",
            "What a careless bitch, you did well OP. am proud.",
            "Aggressively asks for proof... Complains when proof is too proofy for their now delicate constitution .... 🙄",
            "This is fucking beautiful. Are you still running that go fund me? Because if you are dm the link and I’ll give you 15$. 😂",
            "Tell her... \"you literally asked for this. I was nice by giving you the proof you asked for and also your money back. Don't contact me or any of my family or friends ever again. You can't play victim after being this big of a cuntasaurus.\"",
            "The important thing is that she managed to make your fiancé's poor health about herself.",
            "Best 10 bucks spent on learning that you have been awarding the \"friend\" title too easily to the unworthy, and hopefully to correct that error with \"Karla\".\n\nI blame Facebook for starting the misuse of \"friend\". You can be polite or even friendly with lots of people, including coworkers and a loaaaaad of acquaintances, but friends true to the definition are maybe a handful in your life, and those deep, trust-based relationships take a lifetime to develop.",
            "Saying this as someone who suffers with Emetophobia… that woman just learned that her actions have consequences and it’s glorious.",
            "She asked for proof and you gave it to her. Her reaction to it is on her.",
            "She’s playing the victim card hard",
            ">She said, “WTH? I have emetephobia [I didn’t know this] and this just triggered me so bad. I hope you’re happy with yourself, I feel like I’ve been traumatized.”\n\nGood! Hope she is tbh.\n\n\n>I said, “So now you have ten more dollars to process this trauma in therapy.”\n\nGreat Clap back. \n\nReal friends would care, visit, help, even cook a casserole or something. \n\nI hope hubby recovers soon.",
            "You should say the same thing about her phobia that she said about his recovery.",
            "Don't ask questions you don't want the answer to 🤣🤣",
            "10 dollars is the old 1$, basically its petty to ask for that back because it really does nothing but get a meal or maybe an icepack for recovery or a bottle of acetaminophen. I would have done what a reddittor said and ask for proof of her condition, but that's cause I'm petty. This is beautiful and I hope you didn't get more shit for it.",
            "You wanted proof, you got it",
            "Karla sounds like a bitch",
            "I approve of this MC!\n\nShe fucked around and found out!",
            "Karla is a tw@.\nI'm concerned that your fiance became septic? That would cause an entire cascading suite of horrific side effects. Regardless, I can understand and terribly sorry for all that you are both going through🤙🏻",
            "That last line is *chef’s kiss*",
            "Tell Karla to go fuck herself. As a chronically\nIll woman with a partner who is chronically ill and bed bound, this is the last kind of stress you two need right now.",
            "Karla sounds like she's just leveraging everything she can to get attention. In other words, she sounds like piece of fucking shit, also known as 'not actually your friend'",
            "She wanted all that for 10 dollars? Karla is a lousy friend.",
            "Gurl I have emetophobia too but nah she deserved that",
            "What a nasty person she is.  Such a terrible thing to assume about you, as her friends, and demanding a donation back is trashy.  \n\nShe got what she asked for. Demanded proof of illness, got proof of illness. If that’s a problem for her, she invited it.\n\nAmazing clap back!  I hope your fiancé is doing better and recovering well!",
            "Why are you friends with such a vile bitch? All that over $10?",
            "Your response is flawless. You started out tactful by calling her ass out and then to end it with using the $10 for therapy is just *chefs kiss*",
            "Tell her play stupid games, like 10 dollars and a vomit video.",
            "OP, cut Karla off from your life forever.",
            "Karla sounds like one of those people who just wants to make everything about themselves and play the victim.\n\nShe’s the type of person who would comment on recipes for gluten free foods saying things like “not everyone is allergic to gluten”",
            "America really has got to be a third world country.",
            "Karla is a Kunt",
            "What are the odds she actually has emetephobia and didn’t just decide she has it because she gags (like a lot of people) when someone pukes?",
            "The clapback to her \"trauma\" 🤝🏾 *chef's kiss*",
            "As a recovered emetophobe, ask and ye shall receive. Nice one.",
            "BAM!  MaliciousCompliance drops mic, exits stage right.",
            "I dunno. But I’m glad you made her vomit.",
            "Soon as she's called out on her bullshit, she's suddenly and conveniently The Victim.",
            "Over ten fukkin dollars.  She’s a bitch.  I hope you block her from your life 100%+",
            "Karla doesn’t sound like a friend and has OBVIOUSLY never had surgery - A PHYSICAL ALTERATION OF THE BODY, KARLA.  THATS WHY THEY MAKE YOU SIGN WAIVERS BC EVERY BODY HANDLES IT DIFFERENTLY. Sorry she has a phobia of puking but she ASKED for proof and you gave it to her. @$$hole.",
            "You should send her more videos via email titled Puppies and Butterflies but its just videos of Joey dry heaving.",
            "Which source of protein?  If beef it could be a lone star tick bite caused an allergy.",
            "She ASKED, even DEMANDED proof, which you so kindly provided!  She has NO ONE to blame BUT herself and I hope you put her ON BLAST for her accusatory response to your progress update!\n\nHopefully, she's now your EX-friend!  What a beeotch!  And I'm extremely curious how she could even THINK something so awful (crowd-funding for your wedding), perhaps SHE'S thought of doing something fraudulently!?\n\nLMAO  Plus, she's not MUCH of a \"friend\" anyway if she only sent you $10.  I mean, I KNOW every little bit helps, but then to accuse you basically of \"stealing\" her paltry tenner!  Again, what a beeotch!\n\nHoping your fiance gets the correct treatment plan and recovers more quickly and completely!  Best wishes and many Blessings, especially for your future wedding and marriage!",
            "she asked for it... pretty lame to complain about the proof she requested. maybe you should ask her for proof she has emetephobia",
            "The amount of people who claim they have been traumatized due to minor inconveniences.",
            "I'd say, \"I'm so glad to hear this upset you and made you sick, kind of like how we felt when you accused us of scamming people you noxious bitch.\"",
            "Sounds like a narcissist. Narcs tend to be parasitic. She sent you $10 to beat herself off about how good of a person she was, and then when she got an opportunity, she trotted right into the narcissist's victim complex while trying to reinforce her own superiority.\n\n\nAnd when you provided what she asked for, she went and played the victim again.\n\n\nMight be worth looking up DARVO (Deny, Attack, and Reverse Victim and Offender) and other narcissist communication habits.",
            "I don’t know where you are located but if you are anywhere he might have been bitten by a tick, I would have him tested. Certain tick bites can trigger a reaction that makes you “allergic” to red meat.",
            "/r/traumatizethemback",
            "Well if you have a fear of throwing up, maybe don’t ask for proof from a sick person. What an ugly way to be. I’m glad you sent the $10 back, you’re free from that nonsense. Best $10 spent, if you ask me! \n\nI hope everyone is feeling better soon, being a caregiver to someone you love is hard. Hugs, internet stranger.",
            "Damn, asking for donation back from people you don't know is understandable if they seem untrustworthy, but asking 10 whole dollars back from your friends is a low standard move.\n\nEdit: at least now you know who not to invite to your future wedding.",
            "Poor baby that she was \"triggered\", lol. She asked for it, lol.",
            "Let her go. She has issues you don't need to deal with, she does!!",
            "\"Show me proof.... anything\" \n\n\"why would you send me that!!?\"",
            "She’s not a friend but a jealous bitch. NEXT!\n\nI’m praying he recovers and you have a long happy life together.",
            "Karla needs a swift blocking",
            "She’s lying about the emetephobia",
            "NTA, it was ten freaking bucks. Karla was being obnoxious",
            "Too bad  you had to ask for donations\n\nHope the DH to be gets better.\n\n>We just want him to be healthy. But we did set up a temporary donation page to help with some of the expenses.",
            "Why do you have such vile people as friends?",
            "Google Amanda C. Riley, she scammed a quarter of a million dollars faking cancer.",
            "She sounds like a sociopath",
            "Karla isn’t a friend. And her measly $10 was a slap in the face. Demanding to see if he was really sick or not was rude and she deserves to see him dry heaving.",
            "Karla the k***",
            "I would Traumatize her and screenshot the Goddamn Scars",
            "All this over 10 bucks",
            "If you don't want to see someone vomiting, don't ask for proof that someone is sick.  She fucked around and found out.",
            "Karla is a drama monger who loves to soap box and play victim. She asked for proof, and she got it, but she had to backpedal because said proof absolutely proves she's a POS. So she pulled a DARVO when she was the aggressor from the start.\n\nShe's really just a huge waste of energy. You could get the same level of friendship picking fights once a week in the lobby of a mental hospital.",
            "She's ignorant if she thinks people just recover from surgery as if it's a little scratch.",
            "I need proof of this emetephobia or else she needs to stuff it.",
            "I hope your fiance is feeling better soon. \n\nNC that \"friend\" ASAP.",
            "She's not your friend",
            "Please tell me other people called her out too since she posted this publicly",
            "One wonders what happens to an emmetophobe when exposed to triggers of emmesis? Do they projectile vomit, and then get triggered again by their own vomit? Which progresses into a loop.",
            "Ten more dollars for therapy! That's hilarious also if she didn't want proof then maybe she should've thought that before saying anything.",
            "Lmfao this is the best petty revenge you can do 👏👏👏👏",
            "I'm so sorry you and your BF are going through this. I sucks no matter how you slice it and people will always find ways to say the dubmsest shit just to stroke their tiny insecure egos. \n\n&#x200B;\n\nBtw when you responded “So now you have ten more dollars to process this trauma in therapy.” Amazing come back. You made my day! \n\n&#x200B;\n\nStay strong and keeping you in my thoughts and prayers for a speedy recovery!!",
            "Too bad she got her 10 bucks back, sounds like she got her money's worth.",
            "Not your friend",
            ">> “Emetophobia is a phobia that causes overwhelming, intense anxiety pertaining to vomit. “\n\nAnd she has it, really ? what are the odds ?\n\nI’d d say block and move on. No amount of money could compensate for having this person commenting on your fiancé’s future progress.",
            "Fuck Karla. You didn't need her condescending help anyway",
            "Boy, \"with friends like these...\" 🤑  How incredibly vulgar of Karla.\n\nGod bless and keep you and your fiancé, and here's hoping the rest of his recovery goes smoothly 💐",
            "So she has a fear of vomiting and asks for evidence that someone was sick?\n\nAnd acts like $10 means she is entitled to proof?",
            "Cut her out ASAP. Who acts like that",
            "She got what she asked for, but bad friendships aside, my best wishes to you and your fiancé, I hope he recovers soon",
            "love how she made it about her. people have setbacks and you were providing an update. she's not a friend to you. I hope that your fiance is doing better though.",
            "Karla sounds like a real c*nt",
            "I like you!",
            "Shes not a friend.",
            "She sounds like a terrible person.",
            "Sorry (not really), but what a bitch",
            "With friends like Kara, who needs emetophobia?\n\nNTA.",
            "I assume Kare-, sorry, Karla, is no longer a friend? \nGo on you OP, hope your fiancé gets well soon!",
            "Karla sounds....lovely",
            "Good job! Love it.",
            "Never accept money from a Karla with a K",
            "So glad this is here. I read the original and love that you brought it over.",
            "She's not your friend.",
            "What a shitty phobia",
            "What kind of friend only donates $10 in the first place. Talk about cheap ass… and then to ask for a refund?? What the hell.",
            "I have always thoight Karlas are the evil version of Carlas and here is proof yet again.",
            "Good, I’m glad you “triggered” her. She’s sounds like an awful person who’s negative energy you don’t need in your life. What an absolute garbage person she is. I hope your fiancé gets better soon 👍🏻",
            "That is not a friend and never was. Block and move on.",
            "If someone is going to vomit, give them concord grape juice (not grape drink) to drink.  It will not stop them from vomiting, but it will taste better!\n\nDo NOT give this to small children unless you want a really big mess.",
            ">A friend of mine, Karla\n\nThis statement is wrong, this person is not your friend",
            "Wow, that's a really intense situation! It's unfortunate that Karla questioned their sincerity, but the video definitely provided solid proof of Joey's illness\n\nHopefully, Karla will understand and move forward.",
            "I thibk emetiphobia is the fear of vomiting or something, because anti-emetics prevent vomiting",
            "I don’t know if you should be calling her “friend” anymore lmao, who does that. Best of wishes on his continued recovery.",
            "If you’re gonna ask someone for proof that they’re sick you gotta expect a vomit pic/video. That’s not out of the realm of expected lol.",
            "Asks for proof and then gets mad when it's provided? Yeah, that's not your friend.",
            "All this over $10?  Good grief, glad you gave it back to her!",
            "wonder what sub i'll see this in next",
            "Did you say her name was Karla or Karen?",
            "Should have saved the bag as a gift for Karla Karen!",
            "Rage bait",
            "Is this what Reddit has become? This sounds like some Facebook drama. This is a lame anecdote to read on Reddit. Low  quality post.",
            "You fools are just trolling each other. Her emetephobia quip was very well done. I don’t know how you will beat it. Do let us know.",
            "Hmmm… I’ve read this same story before…",
            "The same thing happened to my spouse. They had mast cell issues. Try an anti allergy med like 24 hr claritin. Also see if cannabis is available. Also,  he could have refeeding issues and may need gut support. \n\nMy spouse uses these https://www.amazon.com/Formulated-Probiotics-Prebiotics-Protection-Supplement/dp/B084YZZ5Y9\n\nI don't mind sending you an Amazon gift card to pay for them and some other meds that helped them.  They threw up for months before they finally said duck the doctors in gonna research.  They did and they are much better. \n\nTake care!",
            "How many times are you going to post the same story? This is the third time I’ve read this. It’s all starting to sound like bullshit.",
            "It would be a shame if her phone number was posted and thousands of people sent her videos of them dry heaving 😂",
            "How many subs did you post this story to?!",
            "Did Joey have any issues with protein before the surgery? In the US, there are ticks that can cause a reaction to protein and people get sick after eating meat, dairy or eggs.",
            "Losers all around",
            "You and this Karla chick sound super toxic to and for each other. Get new friends and be better toward them.",
            "TBH, I don't think responding to them at all was actually worthwhile in the first place.",
            "Emetephobia sounds like the most made up shit I ever heard.",
            ">I am very offended and appalled.\n\n>How shamefully low of you.\n\nYou clapped back way too hard. Her messaging you with her suspicions was pretty tactless, but your response escalated it big time. As the recipient of others' good will, you gotta dial it back a bit. Where you could have mitigated a misunderstanding with a few keystrokes, you decided to blow the whole thing up.",
            "Beautiful!  I hope Karla learned to be careful what she asks for.",
            "Lol post to r/traumatizethemback this is great",
            "🤷🏻‍♀️ serves her right for asking for proof, you didn’t know but she’s the one who asked for the proof?\n\nIf she had emetephobia, then I’m sure she would have told you along time ago, just in case.\n\nSounds like she just wanted pity from the other readers/posters.",
            "I hope she doesn’t sleep well for months from being so triggered.",
            "Karla is full of shit",
            "Nice to puke up that ex-friend.",
            "I’m sorry about your fiancé! That’s so sad. Recovery from any medical setback is hard, but I know athletes can sometimes get depressed when it takes a while to get back in the groove. \n\nWishing him a healthy recovery.",
            "NTA when people want to cross boundaries it's just funny to play along",
            "Karla is no friend.\n\nNTA.",
            "Karla needs to be blocked. You don’t need that pointless drama in your life.",
            "Cross her off the friend list.",
            "Karla can suck it. F her. She’s no friend, cut her off yesterday.",
            "I bow before the Queen of Petty.  I aspire to your greatness.",
            "Cut her off. NOW. This is not your friend. Sorry for your troubles.",
            "Your friend is not your friend and sounds like a bitch , hope you cut her off",
            "\"I have B-phobia, I am getting better, but I am sure you understand why I will avoid contact in the future. Best wishes....smh",
            "Hope he gets well soon! I had some patients who didn’t react to all kinds of medication for nausea and vomiting but reacted great on acupuncture ( weird ? True since I can’t explain it as a regular doc, but thankfully there are more ways that are getting accepted in western medicine)",
            "America, fuck yeah! 👍",
            "The drama !!!",
            "Please call her and curse her out. Please.",
            "NTA",
            "Sounds like Karla is the new Karen",
            "I really hope you did mention to her that this was the proof she wanted before the therapy bit.",
            "Friend??? NOT.",
            "Karen sounds like a nightmare. Leave up her comments so any mutuals can see what an awful person she is. Then block her. I'm so sorry y'all are going through this and hope he gets feeling better soon. It's tough to be hurt/sick and it's hard to be the support for that person. Know it means everything to have you there.",
            "I bet she doesn't even have emetephobia, it's just an easy turn around to make herself the center of attention, having been caught out in her own bullshit.",
            "Haha. It’s wild seeing this story in AITA and then a day later here. Anyway, good job!",
            "Karla is absolutely TA",
            "FAFO. If you’re triggered by the sight of nausea, maybe don’t demand proof of a sick person experiencing symptoms. \n\nI hope your fiancé has a speedy recovery!",
            "Arguably she invited that! Get fucked Karla. Hope your fiancé feels better soon",
            "Newsflash...Karla is not your \"friend\".",
            "Hahaha well, she asked for it!!! Hope your partner gets well soon!",
            "Is that how she spelled it? Someone with emetOphobia would know how to spell it.",
            "Life in the world of TMI.",
            "My dad (60s) fell of his bike at speed, early July, 2022, and busted up his shoulder. I had several complications, which resulted in a partial shoulder replacement (not the only surgery) July 2023. He is *just now* starting to feel better, and is up to a 3lb lift limit!!\n\nI am sorry your fiancé and you are going through this. Compounding, long term, and \"mystery\" medical things can not only be scary, but emotionally (and financially) draining. \n\nFingers crossed that he is on his way to better health soon, and you guys can close this chapter, and move onto the next, much happier one! \n\n(OH, and forget that person who decided to make a public stink about not believing you. She probably had a bad day, or wanted some attention shined on her. Or maybe she honestly doesn't believe you. Either way, I don't know if you should consider her a friend. Maybe an acquaintance. And, if she doesn't believe you, then she has had the fortunate reality of not knowing anyone who has gone through a long illness/injury.)",
            "Good for you. She is sound like a horrible friend to have",
            "Brilliant response. Thank you.",
            "I guess that friendship was worth about $5",
            "Wow, that's really unfortunate\n\nIt's disheartening when people question your honesty during difficult times.",
            "So, let’s be clear - Karla is no friend of yours - ever! Friends don’t react like this - especially over $10. Send her a little kiss emoji goodbye and block.",
            "What a complete loser to use a public forum to question your integrity in the face of medical hardship. That person has mental health issues obviously, she needs help, glad you mentioned therapy.",
            "sorry \\[not\\] woman, you asked for it and you got  it",
            "Wow, it's disappointing to see how judgmental people can be\n\nYour video evidence should definitely put an end to any doubt.",
            "I had an in-law try to shame me for not donating my one of her many gofundmes… like how do you even have time to notice that my unemployed self, who just had a baby, didn’t kick in a few dollars? (This was like an aunt of my husband, who lived hours away, not someone close to us.) People can just be so laser focused on pettiness.",
            "The US healthcare system is so messed up that being sick for a period of time can bankrupt you, in some cases, almost for life.  \n\n\nDear US, please grow up and get a proper welfare system - like the rest of the civilized world.",
            "Well sucks to be your friend for asking for proof that your husband to be is actually sick… serves her right, good for you for sending that video… I would send her an extra dollar interest on the $10 she sent … well done - cut her loose you have too much on your plate to worry about her and her emetephobia…",
            "NTA. Your ex friend is weak.",
            "What an absolutely insane human, ESPECIALLY over 10 dollars. Some people want the world to burn",
            "Sounds like you lost yourself a friend that needed to never be found again….",
            "I love your response telling her to go spend that $$ on therapy. I’d be sending her endless puke videos for eternity. I’d rent her neighbors front lawn and set up a projector of the puke video on loop. The worlds not ready for me to have an endless supply of $$.",
            "I hope you dropped this friend, or at the very least, whacked her from your wedding guest list. Congrats to you guys btw and hope Joey makes tremendous strides in his recovery.",
            "Why do you even have a friend like that?  \nI feel people just collect and trash they can find sometimes.  \n\n\n\\+1 for the story.",
            "10$\n\nHow generous",
            "And how your donation paged looked like? If it was just plain text, she might have been just careful - there are a lot of scammers out of there. Even friend or someone who you know can turn into one. I don't think she is that bad because she pointed out there could be some proof.\n\nAlso: “I’m beginning to question if he has actually been sick this long or if y’all are just trying to get more money for your wedding. Who takes this long to recover from surgery especially when you’re an athlete?” doesn't sounds that wrong. She is not worried to point out something, while others are quiet, but maybe saying it to you privately instead of publicitly would be more preferable.\n\nSo I don't think Karla is outright bad and in that case putting this story here publicitly isn't a right thing either... I won't comment on the rest, because the others here already done that."
        ]
    },
    {
        "post_id": "jk7f9l",
        "author": "beerbellybegone",
        "title": "Update to: Boss: Think about whether you want to keep working here. Me: OK. I don’t",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jk7f9l/update_to_boss_think_about_whether_you_want_to/",
        "score": 14325,
        "num_comments": 550,
        "created_utc": 1603966539.0,
        "selftext": "This is part 2 and the conclusion to this post: https://www.reddit.com/r/MaliciousCompliance/comments/hjuqha/boss_think_about_whether_you_want_to_keep_working/. Also, I never thought I'd ever be one of those people, but due to the response on my previous post, no one has permission to recreate or retell this story on any medium whatsoever. Please do not bother me about it. Also, once again apologizing for the English, I'm not a native speaker.\n\ntl;dr if you didn't read the last post or are looking for a refresher: Boss is most likely bi-polar, or has some crazy anger management issues. Boss flips his lid on me after I make a simple mistake (remedied within a few hours) and tells me \"Pack your things up and go home. Think about whether you want to keep working here” - which is in essence an illegal termination. After asking for a raise for nearly a year and not receiving one, I decide that No, I don't want to keep working there.\n\nAnd now the story continues. \n\nWhere I left off, I was waiting for his pre-dismissal hearing, after he tried backtracking from his illegal termination. I decided to play along, because the longer I was there the longer I had to stay on his payroll and keep collecting salary. \n\nTHE HEARING \n\nThey originally tried to schedule the hearing immediately (against the law, hearings require giving the employee a minimum of 24 hours to prepare), I told them to bite me. They tried to schedule for the next morning (still illegal), I told them to get bent. Finally agreed for the morning after. Fuckup 1: My direct manager (the CEO) wasn't present in the hearing. Fuckup 2: The HR lady who held the hearing belonged to another company owned by the CEO, but held at arm's length (legal term?) from my company. She was not eligible to hold the hearing. Fuckup 3: The dismissal needs to have at least 2 people from the company's side - the direct manager (who was not present) and a witness to the meeting to record and create a written record/protocol of the meeting. I was met only by the HR lady. Fuckups 4 & 5: No recording or protocol was taken of the meeting, and I was not provided a protocol of the meeting to sign and verify authenticity (this is probably the biggest fuckup on their part). \n\nThe hearing went as expected, the HR lady really had no idea why I was there (in two years never had any disciplinary issues), and I read out a prepared statement outlining the CEO's illegal and verbally and almost physically violent behavior. I told them that by law I considered myself to have been illegally terminated and was at the hearing to hear what they had to say for themselves, not to defend my own actions. \n\nA few hours after the hearing I received an email saying they were terminating my employment. This is Fuckup 6: It shows they did not give me a fair hearing and had determined the outcome ahead of time. I took all of this and went straight to my lawyer, who (at least in my telling of this story) lit up with a nasty grin on his face. He was working commission and he said their actions during the hearing pretty much quadrupled the amount he was now going to demand from them. He immediately prepared everything, with all the legal statutes backing him up, and sent it off to the CEO. \n\n<Insert SpongeBob Three Months Later> \n\nTHE FALLOUT \n\nWe never made it to court, but only because they realized I had them over a barrel and going to court meant the judge could potentially award me with even MORE than what I was asking for. I was eventually paid out for the entire 30-days notification period they were required by law to give me (without having worked a day during that period), and all my vacation and sick days were paid out at 100% (another month's salary right there). They agreed to pay me one year's salary, at pre-tax rates, in order to keep this out of court. They even covered my attorney's fees! Finally, CEO was prohibited from giving me a negative review if called for a reference about me. In turn, I agreed to not mention the lawsuit to any potential employees of the company (I checked with my lawyer who went over this post, it's OK), and to not take them to court now or in the future. For the money I got, it was worth it. \n\nFollowing this entire fiasco, two other people also left, essentially shutting down their departments as well. They left and weren't fired, so things went smoothly for them. \n\nIt took CEO 2.5 months to find a replacement for me, and since I was a one-man department, nearly all of the activity (aside from tasks I had automated to execute before the blowup) ceased, including at least one event with one of the world's largest tech companies. Being that my field is a specialized one, I'm still in touch with many of my vendors, and they all tell me my replacement is nowhere near up to the task, which feels good on a professional level, but on a personal level, I shudder to think how she is dealing with CEO. \n\nMy new position is very similar to my old one, but I'm now making nearly double what I made (pre-tax). \n\ntl;dr, the second - living in a country with employee's rights is awesome, CEO had to pay out my fair share and another 12 months' salary to stay out of court, I found a job doing the same exact thing at almost double the salary. Life is fairly good, all things considered.",
        "permalink": "/r/MaliciousCompliance/comments/jk7f9l/update_to_boss_think_about_whether_you_want_to/",
        "comments": [
            "In some European countries (at least in Germany), the work contract can even expand the notice period. It is mutual, so if you want to quit, you have to wait for that same time, but in general it is an advantage for the employee. In my last company the period was 3 month(!). So when I quit, I was employed for another 3 month before I could start my new job. The thing is: They assumed I found a job at a direct competitor, which I did neither confirm nor deny. Due to confidentiality and protection of IP, they decided to give me 3 month paid vacation, instead of letting me work another day in the office.",
            "Does this qualify for r/prorevenge?",
            "Next step: recruit that replacement as your trainee",
            "Lesson to all employers out there. It is cheaper to keep your employees happy that to find new ones",
            "Fuck yeah dude get your money!",
            "Isn't it great living in a country with workers rights?",
            "Boundaries are good. Well done.",
            "Well played, and it clearly pays to know your rights.",
            "*chef's kiss*",
            "I used to think I was lucky to live in America... as I get older I see that is not even remotely true. After working in Germany for 6 years (for an American company - paying American taxes, yadda yadda) my eyes are really opened to how much everyday (non wealthy, non-business owners) Americans are screwed by our system and laws. Our laws protect the wealthy. Our laws protect business owners. They do not protect workers. And we won't rise up either. You want to know why? Because our medical insurance and wellbeing is directly tied to our employment. They hold all the cards. We hold none.",
            "Can you imagine these kinda protections in America? Good on you, OP!",
            "How can you be apologizing for your English with your perfect grammar and quips like this:\n\n>\\<Insert SpongeBob Three Months Later> \n\nYou get the language, OP. You _get_ it.",
            "Good on you for standing up for yourself and getting what you're owed.\n\nAs someone who is bipolar myself I just want to point out that the explosive anger issues you describe are not bipolar. Sounds far more like borderline personality disorder or a CPTSD fight type, where mood swings happen instantly and anger goes from 0 to 100 in a split second. Bipolar mood swings happen over days or weeks or longer. And while there can be irritability with bipolar, that is not the same as the anger management problems your former boss clearly had.",
            "Wow working in a country with rights like that sounds nice. -American",
            "Shit like this makes me hate the US even more. You show up to work wearing a shirt the boss doesn't like? Get fucked, you're fired, you have no protection and you just lost access to health care. What a fucking moronic system.",
            "I had a boss ask me that once. She thought I was just going to bend because I'm quiet and shy. NOPE. I looked her straight in the eye and said, \"I'm not so sure about that right now.\" I think I could have knocked her over with a feather. Ask a stupid question....",
            "What country are you?? Do you have a good education system too??",
            "What we wish America was like, instead you can be terminated with no recourse at any moment.",
            "If only nations who are poor, regressive, and backwards about the rights of individuals when it comes to work like my own country (the United States) could someday find a way to give us these rights too",
            "Fuck Up 7: They decided to fuck with you.",
            "Thanks for the update!",
            "As someone in the US where workers essentially have no rights, I am so jealous of your ability to fight what happened to you. \n\nI’m glad you were able to get some payback after bad treatment. Good for you!",
            "[deleted]",
            "[deleted]",
            "The only problem this will cause the op is if they're on the UK. We have a system routinely employed by large employers which is a yes/no question of \"Have you ever began legal action against an employer or former employer?\" which if the answer is yes, you ain't likely to be hired.\n\nI'm not saying it's right or wrong, only that employment law needs to change to prevent that question being asked as it has prevented many people I know enforcing their rights at risk of tanking their careers.",
            "Question: what happened in the first post that made you decide to not allow anyone else to show it on another platform?",
            "If bet your old boss really wishes he'd just given you the raise for which you had asked.",
            "Jesus, what country do you live in? Because I wanna move there! Employee rights here are a joke!",
            "I read that line about the lawyers grin and thought \"That is one cold hearted bastard, I hope OP makes sure to keep his number on file\".",
            ">and to not take them to court now or in the future\n\nFor only this incident, or for any other crimes they may commit in future?",
            "From your first post, it kinda sounds like they would have had a good case for saying you quit, if they hadn’t tried so hard to cover their ass.\n\nBoss could argue he asked you to go home for the day and come back when you were ready to work, and then you said, “no, I will not come back”, so it sounds like you quit, not that you were fired.",
            "In America employee’s rights vary wildly from state to state. I lived in Missouri for over 15 years, which is an at-will work state, and I was let go from job after job because I suffer from severe migraine headaches. Move to upstate New York, and it’s the exact opposite. I’m a disabled veteran, which for some reason in the supposedly super patriotic state of Missouri doesn’t mean Jack. But in New York, I’m a protected individual, which from what I understand, I literally can’t be fired for anything short of a felony or theft from the company. You take the good with the bad in America.",
            "Oh man, this was a great read, OP!\n\nMy justice quota has been fulfilled today.",
            "I really have nothing to add except to tell you that your English is actually very good. Better than most native English speakers.  \n\n\nCongratulations on your victory as well.",
            "Sounds like France. And incidentally the plot of Emily in France (Netflix) only with less oh my god look at her shoes and garlic.",
            "What country are you in I want to move there! ASAP!",
            "Good job, most bosses have statistically extremly more mental issues then any other position - psychopaths especially are very rare in the population, but damm near common and default in CEO positions.",
            "What country do you live in OP?\n\nEdit: WHAT COUNTRY DO YOU LIVE IN?!?!\nI NEED TO KNOW. I CAN’T SLEEP IF I DON’T SOLVE THIS MYSTERY.",
            "This comes off as worker’s rights porn. I love it! Wish my country had the same protections.",
            "Wish I lived in a country that cares about employee rights. I had to sign a document that for a job that basically said I had no rights beyond what is on state and federal law and I was an at will employee who can be terminated at any time for any reason.",
            "This is an epic story. I had a very similar experience working for a CEO who was also the owner of the company. Reading though your first post, I initially wondered if it was the same guy lol.",
            "For a non native English speaker, you’re story telling is fantastic. “Get bent” haha I’ve never even heard that before",
            "Where I live in the United States, you can be fired at will.    If you are a member of a union then you usually have more rights.",
            "This is so good, congrats!",
            ">no one has permission to recreate or retell this story on any medium whatsoever.  \n  \nGood luck enforcing that rofl",
            "[deleted]",
            "What magical, progressive, worker’s rights utopia is this country you speak of? Somewhere in Western Europe I presume?",
            "\"Living in a country with employees' Rights is awesome\" (weeping, in america)",
            "Employee's rights? Must be nice\n\n*Cries in American*",
            "Reading these make me loathe being an American slave.",
            "Please don't assume people have mental illnesses. This creates huge stigma for people like me who are actually bipolar and not at all terrible people like your CEO. He has anger problems and is an abusive [twat]. That is all you can assume. Otherwise you're holding on to stereotypes that are severely damaging.\n\n***edited because I hypocritically used the word narc, which is also a horrible mental illness that does not deserve to be stigmatized",
            "Good story but honestly you can't \"not\" give people the right to retell your story. By posting it here, it has become public domain.^*\n\n*Free public use and reuse for non-commercial purposes",
            "[deleted]",
            "[removed]",
            "So this is why that game got delayed again?",
            "Nobody has permission to retell the story? Why?",
            ">Also, I never thought I'd ever be one of those people, but due to the response on my previous post, no one has permission to recreate or retell this story on any medium whatsoever\n\nJust for what it's worth, they don't really need it. You put this story out in the public domain, it is now public domain.",
            "> Also, I never thought I'd ever be one of those people, but due to the response on my previous post, no one has permission to recreate or retell this story on any medium whatsoever. \n\nCan I copy-paste both your posts to r/BestofRedditorUpdates ? I'm sure they would love it, as I have.",
            "[deleted]",
            "Why can \"Pack your things up and go home. Think about whether your want to keep working here.\" be considered a form of termination? Is it that it's considered a threat and makes you fear for your job or something? I'm bad with this kind of stuff.",
            "Over here in the US going, awww we need that...",
            "> living in a country with employee's rights is awesome\n\nThis. USAsians, take a look at Europe and Despair. Get organized.",
            "*cries in American* because we don’t really have employee rights 😭",
            "Why did you take the money instead of going to court if it was in your favor that much? This fails to discourage them from doing it again, why do you think they were so happy to throw you buckets of money instead of going to court?\n\nLooks like they got the better end of the deal.",
            "Christ where in the hellnis this?! Couldnt possibly be usa since you talk about worker rights lol",
            "Does anyone else feel like they're reading science fiction?",
            "You think you own the content you post in a public sub?  Not very bright are you.",
            "I'm glad you're ok but your country's labour laws sound insane.   \n\n\n\"go home and consider whether you want to work here\" in no way could be considered termination.  \n\n\nHow? Is there zero precedent of a single person in your country being given the afternoon off for having a rough day?   \nDon't get me wrong, fuck your boss, but I'm shocked this held up in court at all.",
            "You can't actually tell people that they can't reproduce this story. You posted it on Reddit, and you asked people not to reproduce, which means it's *definitely* going to be reproduced.",
            "It seems like in every single one of these stories the employee is always an absolute asset and the literal lifeblood of the company. This sub is basically just porn. Fun to look at, but not realistic.",
            "[removed]",
            ">Also, I never thought I'd ever be one of those people, but due to the response on my previous post, no one has permission to recreate or retell this story on any medium whatsoever. Please do not bother me about it.\n\nBad news, bud.\n\nReddit's TOS:\n\n>By submitting user content to reddit, you grant us a royalty-free, perpetual, irrevocable, non-exclusive, unrestricted, worldwide license to reproduce, prepare derivative works, distribute copies, perform, or publicly display your user content in any medium and for any purpose, including commercial purposes, and to authorize others to do so.",
            "/r/JusticeServed",
            "\\+1 for the good guys",
            "> but I'm now making nearly double what I made (pre-tax).\n\nCongrats, welcome to a new tax bracket.",
            "\" Also, I never thought I'd ever be one of those people, but due to the  response on my previous post, no one has permission to recreate or  retell this story on any medium whatsoever. \"\n\nIf you don't want it recreated or retold, don't put it on Reddit.",
            "In a country with real employment laws, you'd have gotten years of salary for being treated that badly. Or, rather, you never would have been treated that badly, thanks to the laws.",
            "FYI, putting your can’t reuse this without my permission does not mean anything at all.",
            "\\>  “Pack your things up and go home. Think about whether you want to keep working here” \n\nTo me, this doesn't sound like a firing. Him telling you to go home doesn't negate your employment. Him telling you to consider if you want to continue working there also is not a direct statement firing you.\n\nI'm glad it turned out in your favor, but it appears you were on very shaky ground from the outset.",
            "This was EPIC! Definitely worthy of a two-parter!\n\nI work for a site called Not Always Right and our readers LOVE stories like this. Would we be able to publish your epic story on our site? We can link our post here on reddit so you can keep tabs on it. Please let me know!\n\nThanks again for the amazing read!",
            "Did this happen in the US? Just wondering.",
            "We don’t have permission to retell this story?? Good luck with that rule OP.",
            "Your lawyer was working on commission but you had your fees paid?\n\nLol...ok",
            "Demanding or expecting a pay rise in just a few months is unrealistic and unreasonable. In the real world people get annual pay reviews. You sound like a tool.",
            ">Also, I never thought I'd ever be one of those people, but due to the response on my previous post, no one has permission to recreate or retell this story on any medium whatsoever. \n\nLol, you posted it to a content aggregation site, good luck enforcing this.",
            "What world do you live on? I'd like to live where this is how stuff works out for jobs. So your job just can't fire you? Must be in a state that doesn't have at will employment or something crazy.",
            "[removed]",
            "I don’t see how this is malicious compliance at all. \n\nAlso, Americans have plenty of work protection. Especially when it comes to positions like yours where you make so much money. \n\nIt sounds like a nightmare to run a company there. You made a mistake (that you won’t elaborate on) and got yelled at. Big deal. You make 8k a month and can’t handle getting yelled at? I was in the military and got yelled at for $900 a month. Then you sue them for a year salary after YOU quit! And you call that fair?!\n\nIf you can’t take the heat stay out of the kitchen. The CEO is running a company handling millions of dollars and you are his direct report. If you are too soft for that type of position then don’t take a position with such high stakes. I think what you did was dishonest and Abuse of workers protections. And it only worked out for you because you are decently wealthy. You think a minimum wage job can afford that lawyer? You think they win that lawsuit? No way. \n\nI find you greedy and soft. I feel bad for any employer you dupe into hiring you.",
            "[deleted]",
            "Great post and update. I’m rooting for you",
            "I hope mine goes as well. The tribunal for me was held today but I have not heard any results.",
            "I'm happy for you, fuck your old boss! Good for you :)",
            "Fantastic story....Loved it.....Bravo for you",
            "Lol at the lawyer getting excited at the opportunity to sue the fuck out of someone.",
            "I am reassured there is somewhat of a happy ending in this and I’m sorry to hear you had to go through all the grief with a horrible employer\n\nStay safe, 2020 is a challenging year",
            "May i ask where do you live (country)?",
            "I hope that one day I'm as smart as you are",
            "This is amazing!!! I'm thrilled you got all that payout! Did you already receive the year's worth of pay?? What will you do with all that extra money?? awesome!!! F that old boss of yours. Did you get a new job somewhere way better with better pay and better boss?",
            "As soon as you posted this to the Internet you lost all rights to it",
            "This. Is. Amazing.",
            "“*insert sponge bob” I’m dying!",
            "Dang. It almost makes me wonder if what he said about the guy before you was a similar situation... Did it cost the company over a million dollars because of lawsuits between the prior employee and the business?",
            "I am starting to feel like just because I was born in my country dosnt make it great",
            "This sounds like you got very lucky with their handling of it. It states very clearly in your story that he told you to think about whether or not you wanted to continue working there and you decided that you didn’t. That’s not a termination. That’s you opting to quit. You’re lucky they acted as they did, because if they hadn’t mishandled themselves, you would have lost. Deciding you don’t want to work somewhere is QUITTING, not termination.",
            "Nice.  I do enjoy happy endings.",
            "I can’t imagine having that level of worker’s rights.",
            "Wow! What a ride! Glad the CEO got what was comin for him and for you to take all the benefits of that already satisfying prize. All the best in the future OP",
            "Wow. Where do you live and how can I move there?",
            "Now this is a feel good story!",
            "Pro Malicious Compliance",
            "As someone who use dto be in a very abusive work situation, this was close to an erotic read. Thanks for sharing! I was hapopy just to get out of there and to get a new, better job without having to use the shit CEO as a reference.\n\nGood on you! Hope your next CEO is a better one :)",
            "I’ll be sharing this at some point in the unknown future, after I bother to read it",
            "Couldn't you have forced it to go to court?  Sounds like you and your lawyer missed out on some good money lol",
            "This is so beautiful.",
            "So, @OP\n\nlast with last story i have a *slight* suspicion where you might work. Central europe?",
            "Side note reddit and these permitted by reddit have permission to retell or recreate your story..as a small OT.  \n\n\nCool story.",
            ">I took all of this and went straight to my lawyer, who (at least in my telling of this story) lit up with a nasty grin on his face.\n\nI loved this line. Thanks for writing"
        ]
    },
    {
        "post_id": "c0cu54",
        "author": "Orlanth_thunderous",
        "title": "Sorry, you won't be getting the supervisor position. Why arnt you doing the supervisor work?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c0cu54/sorry_you_wont_be_getting_the_supervisor_position/",
        "score": 14326,
        "num_comments": 390,
        "created_utc": 1560467566.0,
        "selftext": "So I worked for a company for a few years, got turned down for every promotion but was still expected to do the extra work because they stopped scheduling anyone to do it and I though it would make me look better if I just did it, covering breaks, checking logs, safety walks ect. \n\n We had 3 Department managers who only work during the day and a supervisor for the mid shift but no management at night, a position opened up for the job and I put in for it but then was closed because of \"labor and budget issues\" and \"lack of applications\"\n A few weeks later they complained I wasn't doing enough production and needed to focus more on my work, so eventually I just stopped doing the extra work and let the department fall to shit. \nWe got pinged from the regional manager for missing too many safety walks, we got pinged by health and safety for not having properly filled logs, customers complained about lack of service due to employees being on breaks.\nManagement flipped shit and said this would probably prevent me from getting a promotion in the future, when I asked why they told me that these were part of my job duties.\n\nMe-\"But you told me to focus on productivity not any extra duties, these are part of a Supervisor role not mine\"\n\nMgmt-\"You have been doing them for months now, why did you just stop?\"\n\nMe-\"You told me to focus on production\"\n\nMgmt- \"Well until we fine someone to work at night they have to be covered\"\n\nMe- \"Wow so one of the managers will have to close every night, that's rough\"\n\nMgmt- \"Come on were all a team, you can help us out right\"\n\nMe- \"Sorry, I'm not comfortable doing extra duties beyond my role without proper training and compensation\"\n\nEdit: Thanks for Silver",
        "permalink": "/r/MaliciousCompliance/comments/c0cu54/sorry_you_wont_be_getting_the_supervisor_position/",
        "comments": [
            "Sounds like a reason to get a new job.",
            ">\"Come on were all a team, you can help us out right\"\n\n\"Oh, you gonna be helping out my paycheck, then? In advance?\"",
            "A few years ago I had an okay job that I was planning to stay at for a while, when my boss announced that he was leaving. In my field (computer programming) this is a bad thing and usually means \"the company will hire an idiot and the department will go to hell.\" All of my coworkers told me that if I took the job, they'd stay. I was qualified for the job, as I'd had it before at other companies, so I thought about it and decided I'd take it - IF they compensated me for it. I did my research and found out that it \\*should\\* come with a $35,000 (or more) raise. \n\nSo I applied for the job, interviewed, and at the final interview they asked me what I wanted to earn. I presented my research, showing that I should be getting a raise of about $35k if I got the job. \n\nThe next day they offered me the job... with a $6k raise. So I turned it down. This was shocking to the boss who offered it to me, his jaw actually dropped. I said \"no thank you,\" and turned to leave. He said \"what are you doing?\" I said \"I'm going back to my desk to do my job. I'm still a senior programmer, I've got work to do. I want things to be in good order for the new manager when you hire one.\" And I went back to my desk.\n\nI had a new offer with a $35k raise on my desk within the hour.",
            "I like the \"without proper training\" line. Well done.",
            "I feel ya man. I'm in the same boat now. Expect me to do everything a supervisor does, plus my normal job. But, they just hired a super for my shift... didn't even give me the decency of an interview. New guy has already told the day shift that \"I'm useless, and don't do anything\"...after being here a week, and not even on my shift yet. Needless to say, I'm looking.",
            "You're too nice.  The proper response was \"if you don't want to pay me as a Supervisor, I'm not going to do supervisory duties.  It's your call.\"",
            "Good. Don't do anything more than your contract says you should do.",
            "Beautiful. Good for you for sticking up for yourself.\n\nWhen I got out of college, I went above and beyond in my first few jobs because it's what I loved doing, I knew I needed to prove myself and I wanted to show I had skills so I could go elsewhere.\n\nNow that I'm a decade in, I still do what I do great but I long ago stopped putting the company first. My attitude, which you've shown here, is quite simple: Fuck you, pay me. \n\n#FYPM",
            "Hey dude I'm in this exact position, any advice? I'm still doing all the supervisor work but it's getting a bit exhausting",
            "I ended up leaving a job for something like this. I was a senior adjuster with one of the big car insurance companies for years. Eventually our supervisor quit and I was tasked with all of his duties on top of my regular duties. It wore me out, it was physically wrecking me but I was getting so much overtime. Eventually I was told I couldn’t have overtime and I brought up just how much work I actually had. \n\nTheir response? Manage your time better, you can do it - you’re the best! I inquired about being a supervisor since I had already been managing the largest team in the region for months, why not just promote me and hire another adjuster? Nope, they got some jackwagon off the street that knew NOTHING about the job and didn’t care to know. Instead I got written up for messing up paperwork I was never trained on because it was supervisor level responsibility and I had been filling in for months.\n\nI left my company car and all my gear at a partner shop. Years later I’m still salty about that whole situation. Not a word of gratitude for the work just a write-up for something that wasn’t in my job description. All so execs of the “save $15 or more” company could get the warm fuzzy of not having to hire a guy to handle the area for months. Everyone on my entire team quit a few months later. No happy ending for anyone.",
            "Key word \"compensation\"\n\nI bet the conversation ended right there.",
            "I have a saying at my job, \"never make exceptions, because exceptions become expectations.\"",
            "I would have given this reason:  because of \"labor and budget issues\" ;-)",
            "Lol. Sounds like the citrus smock company",
            "The ole' do your job right and you get to do everyone else's job for them. I'm proud of you dude.",
            "Unfortunately, going the extra mile will often NOT get you the promotion if Management isn't all that bright (which based on the chaos appears to be the case).  Why would they promote you and give you a raise, when you're already doing all of it for \"free\"?",
            "If you have it in writing and the company has a HR department I'm sure HR would love to hear about their \"expectations\" \n\nThe reason your bosses teach you to hate HR is because hr is your best friend when these bosses ask you to be unreasonable. It won't make you any friends for sure but if you only want the management position for the sake of a transfer, then it could fast track you going through HR. \n\nHR doesn't care about budget the same way a boss does. HR cares about not being sued and bad publicity.\n\nE: clarification for the people repeating themselves in the comments, when your boss breaks labour laws or expects you to do something unlawful HR is your best friend because they want to stop that stupidity for the sake of the company. You can often fineness then for some perks if you have a little tact, but judging from the responses maybe this doesn't apply in your guys situations.",
            "> Mgmt- \"Come on were all a team, you can help us out right\" \n\nAlways seems to translate to, \"do more work for us that we don't want to compensate you for.\"  \n\nThis reminds me of an incident where I was working as a graphic designer for the local daily newspaper. This was way back in the day before Photoshop became a verb. Besides my day job, I was also teaching Adobe Photoshop and Illustrator at our community college two nights a week. Inevitably management found out \\[it's not like I was trying to hide it\\] and they came up with this brilliant idea, which they announced out of the blue in a staff meeting, that they would order in pizzas for long lunches, and I could teach the rest of the design staff during these lunches. \n\nReally? And are you going to pay me what the college pays me during those times? I was also the curriculum developer for my classes so I was getting substantially more than my pay at the newspaper and in any case, pizza is not an acceptable form of currency. \n\nNeedless to say, the matter was never brought up again.",
            "\"Why aren't you doing the job we're not giving you? This will severely hinder your chances of getting the job we're not going to give you anyway.\"",
            "Sounds like what the grocery store my daughter works at is doing to her.",
            "Funny how \"we're all a team\" when it comes to being overworked, but \"you're on your own\" when it comes to being properly paid for it.",
            "The fact that so many people have similar experiences makes me think this is a feature of capitalism rather than a bug",
            "This is exactly why I left my last job. They fired the previous supervisor, and left the position vacant for a while, and my coworker and I picked up some extra duties in the meantime, as each of us were vying for the promotion. It was eventually offered to me, along with the raise ... \"to be started soon.\" But soon never arrived. Meanwhile, they made no moves to replace my position, and shit got super busy. So while I was balls to the wall on my current position, still waiting on official word of my new job description, word came down that they were revoking the promotion because I had not shown them satisfactory performance *on the job I did not yet have.* Fast forward a few months, and the position has completely disappeared, with all its duties spread to my coworker and I, and zero raises. He left, and I inherited his, mine, and supervisor duties. I asked them to reevaluate my salary and job description. They stalled, I put in my notice. And they had the audacity to ask me \"Can you stay long enough to train your replacement?\" I laughed and reminded them that they needed to hire 3 replacements, which would take 3 - 6 months to find, hire and train. \n\nIt's going to cost them at least 10x as much to replace me vs the raise I requested to keep me. Good riddance.",
            "Had to learn that lesson the hard way too.  \n*Work now, compensation ~~later~~ never.*  \nYeaaah... I think I'll pass, thanks.  \n*But it's an opportunity for you, we're a team.*  \nYeah, now you're just insulting my intellect and not respecting me. Better be carefull if you don't want me to just quit on you, I have zero problem finding work.  \n\n>Sorry, I'm not comfortable doing extra duties beyond my role without proper training and compensation\n\nGolden line.  \nTake care OP.",
            "You probably didn't get a promotion because you were doing the extra work. It does make you look good, but it doesn't make them more likely to promote you; it makes you too good to promote, or gets rid of the need for a higher position altogether.\n\nYou don't promote your best salesman, because the supervisor doesn't make sales; he supervises. \n\nThere's such a thing as being too good at your job; you need to be good enough to keep it, but not so good that they can't replace you - including when you move up the ladder.",
            "My job has been doing this to me for two years, I’m so sorry and I’m so glad you stuck up for yourself!",
            "Me at this point omg",
            "Where I currently work (Government), before I started, there was a guy acting in the supervisor position while it was empty.  They had a competition, he applied, as well as a few other people, and noone got the position, so it was still unfilled.  So they asked him to keep acting in that position.   He laughed and said no thanks. \nTLDR - Friend was not good enought to get the job, but wanted him to do the job until they found someone who was.",
            "I feel like this is so common - employers setting up loads of unpaid additional work, then using promotions as a carrot to make people do it.   Then you say you will do the work if you're compensated fairly for it, and they act like you're the one being unreasonable.  \n\n\nIt'd be very hard to quantify, but I wonder how much money corporations save by milking unpaid labor from employees in this manner.",
            "You probably gonna get fired, but they definitely need to hire a supervisor.",
            "Update of this MC?",
            "Good for you, sticking up for yourself.  You want a supervisor? Pay one.",
            "Sounds very familiar. Please stick to doing your given role or they will never learn.",
            "Good for you. You have now given them your expectations and they can do with them what they want. They can promote you or not but you know that “giving” more didn’t help them want to give it to you. At least now they can see how much you actually were doing for them.\n\nGood luck.",
            "Similar thing happened to me. I was putting in extra hours, taking on extra responsibilities but when it came to a management role I was told that I wasn’t qualified. To make things worse I was told I wasn’t being trained to move into a management role because it’s to expensive to pay me for higher duties during training shifts. \n\nI decided to move countries, for the hell of it I applied for a couple of management roles with the same company overseas and was offered both! I took one and stayed with that company for another three and a half years, during which I held four different management positions across different stores and received additional salary raises outside of my promotions. \nWith that experience I ended up being head hunted by a competitor company. \n\nSometimes it simply pays to take your skills elsewhere and find a work place that will actually value your work and experience.",
            "Reminds me of the job I just left. Entire management team gone in a 6 week period and the owner's solution is to just divvy up those managerial duties among remaining staff for minimal or no additional compensation. Good luck with that strategy, asshole.",
            "[deleted]",
            "My wife has been going through a similar situation in her work and I really want her to do something similar, she's too damn nice and friendly with some of her colleagues though and doesn't want to leave them in the shit. Hopefully she'll learn one day.",
            "Management makes me sick",
            "Now this. This is interesting to be honest.",
            "> come on, we're a team. Help us out. \n\nCome on, we're a team. Pay me more.",
            "Kinda reminds me of a girl I worked with... she applied for Manager spot... didn't get it... but got assigned to train the girl they gave the spot on how to do the manager job...",
            "Companies really milk people of their abilities without the pay. They wouldn’t promote me but I had to do things beyond my job title. I was doing interviews when only assistants were suppose to do them and they got paid double of a shift. I was a shift. 😑",
            "I went though the same Shit too. I quit and then the same thing happenedin my next job... I quit this one, but it was more the bullying from my general manager.\n\nI was then un-employed and in really bad depression. After a number of months I got a work and then got fired for the first time in my life... For being off sick.\n\nSomehow I stumbled in to working in the first part of my dream job.",
            "I was a store manager at a pizza joint and after too many write ups for not flowing procedure, which I was never taught in the 4 days of training I had, they wanted me to step down to csr but still open the store and stay late and do all the manager things I had been doing for 6 months. I laughed in their faces, spun on my heels and left them to drown in Friday night pizza rush",
            "Lived that one too. Repeatedly denied, will not do extras, and told HR to never expect me to step up like that ever again.",
            "This sounds like costco",
            "I had the same kind of scenario:\n\nMe: do extra, management-level work\n\nBoss: Let's promote you\n\nMe: sounds good!\n\nBoss: HR says no on the promotion for reasons known only to them\n\nMe: Bummer\n\nBoss: You're still going to do the extra though, right?\n\nMe: No thanks",
            "Taking initiative in the work place?\n\nThat’s a real TIFU. Never take on more unless they pay you for it.",
            "WFM?",
            "Fuck.  That.  Shit.",
            "[deleted]",
            "My dad has been repeatedly done work that's meant for managers two to three steps above his position, himself never promoted because \"he doesn't have a degree\". My mom and I keep trying to tell him to just fucking say 'no' to these requests, but he accepts them anyway. His small bit of payback is that he frequently takes a sudden day off for extra sleep.",
            "I was and currently am going through a similar situation right now. I spent four years in a grocery store chain learning the insides and outs and eventually got to the point where I was doing assistant manager of the store duties, but still technically considered a stock person. I was opening and closing and ordering 75% of the departments in the store as well as going to other locations and not once did I get an official promotion. They ended up bringing in the store managers sister to do it and still had me doing her duties and I said fuck it I’m gone. Now I’m currently in another situation where I was offered a promotion after being there two weeks and because I was new the other staff retaliated and rioted till they said nvm forget it then it’s too much drama and I’m fucking livid, can’t seem to get out of this cycle of shitty job bullshit.",
            "I got taken on as a supervisor,  after 4 months I was told I won't be paid anymore than the operators,  I won't be in charge of them but I'll still be responsible for their jobs and their mistakes plus filling in every bit of paperwork that other workers could do,  plus cleaning the area,  plus doing half of my manager's job,  plus noting everyone working hours,  overtime, and holiday requests... Despite not being in charge of anyone. \n\nFiled for a request to transfer to a different department.  Fuck that job.",
            "/r/choosingbeggars would like this",
            "Some years ago, I worked for a similar company. They just kept adding things to my job description; I worked weekends, so we had to do whatever came up. \n\nFast forward a few years, I apply for a job which paid better. They initially said I wasn't qualified, but I pulled out my job description. The new job was doing things already in my current job description.\n\nI still didn't get the job (it went to one of the daughter of one of the managers), and I quit shortly thereafter.",
            "Do you work at Safeway? This smells like Safeway to me.\n\nSource: 3.5 years in :-/",
            "Nice, glad to see BestBuy hasn't changed.",
            "Yes that would be worse I suppose",
            "Yes that would be worse?",
            "I'm curious, what would be worse?",
            "Uhhhh going through the comments this sounds like a retail job? Kind of interesting how different departments can be framed to sound like sales/accounting, instead of electronics/outdoor.",
            "Damn sounds like my job. I tried to go above and beyond but after getting beaten out of the promotion I want 4 times by people who don’t kow a damn thing about my department is really disheartening and makes me completely loose all motivation to better the department.",
            ">Mgmt- \"Come on were all a team, you can help us out right\"\n\nHAHAHAHAHAAHHAHAHAHA!\n\nOh god I used to be young and dumb enough to actually believe this nonsense.",
            "That was very succinct.  Well done.  8)",
            "Damn dude",
            "This is Wal-Mart. Or one if its family chains. Dealt with this and it's why I left.",
            "I got dumped with extra duties myself a few months back. My supervisor wants me to do first shifts work cause and I quote, “Roger and Wally are really old now and can’t keep up anymore. So you and the the other custodians need to help them out for now on.”\n\nFuck that, one guy just stands around all shift nursing out of his styrofoam coffee cup. It’s the joke in the whole department.",
            "\"Come on, we're all a team, you can help us out, right?\"\n\nAnyone who feeds you that line that hasn't been promoting it's own members is absoLUTELY trying to cover their own ass more than anyone else. Y'know, like a team player! /s",
            "You carried them and they thought it was because you wanted to. The people above you are pretty greedy. Hope they’re not friends of yours",
            "Take heed of OPs story! \n\nI made the same mistake as them although after several years of doing supervisory duties my employer finally promoted me to supervisor. \n\nWithin a year of having my official supervisor title my manager went on a long term leave of absence and now I’m a supervisor doing manager duties on top of my own. Lol fml...",
            "I  feel you man, I was in your position for over a year, luckily the old assistant quit (read: fired) so I was able to take his spot. Year and a half later I realized I'm still doing more than what im being paid so im transfering. I'd rather just move stores than lose my time at this shit company",
            "This similar situation happened to a girlfriend of mine. We work in a corporate office. She works in a part of HR and I work for accounting. Anyway, the guy she worked for, who I had always gotten a SUPERB impression from -turns out he's evil. She was doing the extra work, vying for that promotion as a supervisor.  He actually hires the guy that was the best man in his wedding. The kicker? He wants HER to train him as HER supervisor.  You can bet he got a similar statement, and her moving departments pretty quickly. And we secretly all band together and know about Management.",
            "Arnt",
            "This sounds alll too familiar.\n\n*cough*cough* lowes *cough*",
            "You don’t work for target do you??",
            "this sounds EXACTLY like Lowes lol do you work at Lowes??",
            "you can always apply for a supervisory role in another store, more paperwork for your managers on the back end but by that point it won't be your problem anyways.",
            "\\- \"labor and budget issues\" -> No money to hire because they gave it as bonuses to high directors due to them all being friends.  \n\\- \"lack of applications\" -> Either didn't put any out (which mine did), or they wanted a very discounted super 90% below pay grade so they can keep said bonuses (which also mine did).\n\nHad that exact run-around for 5 years. 12-15 hour shifts. At the end my productivity dropped 70% because of doing double shifts (you read that,18-24 hour shifts quarter of the time on a 4-5 day). Then the only other guy was not even Jr. level, so I was doing his job too because he would come to me asking me to fix his shit.\n\nIt's a longer story that actually ends up in my favor, but fuck. Nothing I could have done, company was all employed by friends of the CEO.",
            "\"Come on, we are all a team, can't YOU pitch in to help?\"  \n\n\nIt's not much of a team if one person is expected to shoulder the load.",
            "Same shit happened to me. I was working Grave shift as an hourly employee but doing the duties of a super because we didnt have one. I applied to the supervisor position but was passed over for an hourly on Day shift.  After his promotion he never moved to Grave!!  He stayed on Days, leaving me to keep doing the Supervisor duties on Grave.  When shift bids came up again, my seniority gave me a chance to get off Graves. They created a midshift position to keep me on Graves for half my shift!!  I quit soon after.",
            "This speaks to me on so many levels as a bread baker. Not only do they want huge productions and management duties taken care of, they also try to tell you how to do the job - despite not being anywhere near qualified in the field.",
            "Best answer ever is the one you gave. I feel uncomfortable doing the work without training and a compensation increase.",
            "Do you work in a kitchen?"
        ]
    },
    {
        "post_id": "c11doa",
        "author": "Absurd-n-Nihilistic",
        "title": "Close all of your accounts? Sure thing!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c11doa/close_all_of_your_accounts_sure_thing/",
        "score": 14329,
        "num_comments": 427,
        "created_utc": 1560628410.0,
        "selftext": "Hey everyone. Long time lurker, first time poster. This MC comes from my time working at a bank, in their contact centre. I literally have hundreds of stories about that place and its customer’s, but today I’d like to share a story that has always bought a smile to many a suffering customer service co-worker’s face about the time we got one back for the good guys. \n\nBackstory: I was employed as Customer Service Officer. I’d been with the bank for about 18 months at this point, mostly working afternoon shifts, but recently the bank had moved to a 24 hour customer service model, so while most of the bank would be closed (Head office, Complaints, Credit etc) — we were still open. \n\nCast: Me, Night Manager, Customer, Head of Customer Relations and Retentions\n\nLet me set the scene: ~10pm, midweek, fluorescent lights flicker overhead, the call board empty and I’m literally counting the seconds left in my shift, ready to go home.\n\n*phone call pops onto my screen*\n\nI think ‘Shit! I always get a call just before I finish’\n\nMe (mustering my best customer service voice): “Hi, thanks for calling (bank), you’re speaking with u/Absurd-n-Nihilistic, how can I help you?”\n\nI hear nothing but dead air, so I start to repeat myself. \n\n“Hi, you’re speaking wi—“\n\nWhen I hear the tone of voice and words every contact centre worker has heard at some point. It just lets you know you’re in for a great call (not!). \n\nCustomer: *loud sigh* “Yes! I’m here! God, what takes YOU people so long to answer?! What are you doing?”\n\nAs noted before, there was no calls on the board, this customer didn’t wait in queue. He would have dialled, gone through to the IVR to enter his customer number and pin before being put through to me. Max 60 seconds. \n\nMe (trying to not provoke any further and get this customer off the phone as quickly as I can so I can go home)\n“Oh, I’m sorry about that. Our system doesn’t show a queue, but I’m sorry that you had to wait. What can I do for you this evening?”\n\nCustomer seems to settle down and starts explaining that the reason for the call was the interest charges on the most recent credit card bill. He was sure they were a mistake because “I always pay my bills on time” and “I don’t like paying you blood suckers anymore than I have to”. Charming, I know. So I place him on hold to look at his account. I started looking at the payment history, when payments were due/received, what the balances were etc. Then, I quickly looked at the customer’s interaction notes. This is where the bank records any contact with the customer as well as, any fee waivers, special interest rates etc. and I see an interesting series of notes from colleagues of mine stating things like “customer advised interest was charged due to full payment not received by due date. Customer threatened to close all accounts with bank. Manager approved interest waiver”. Notes like this went on for months, until there was a note from the head of customer relations and retentions stating “if customer threatens to close accounts to seek waiver of fees, interest or other charges, please process immediately. No retention authorised”\n\nI was a bit shocked because usually the bank would do a lot to keep existing customers, like they told us in training, ‘it’s cheaper to keep a customer, than it’s to gain a new one’. So I call over my night manager to read the notes and give him a heads up I’ve got a feeling the customer is going to be demanding another interest waiver. My cool night manager said “well if he does, do what the note says”. \n\nTotal hold time: maybe 2 minutes. \n\nI take the customer off hold and thank him for waiting. \n\nCustomer: “About time! My time is very valuable, you know. So have you fixed it yet?”\n\nI start explaining that the interest charges are valid because he didn’t pay off his balance before the due date. \n\nHe goes ballistic!\n\nHe starts calling me every conceivable name under the sun and mid sentence stops, he plays it like he’s just had an idea “fine. If the interest charges are valid, I’m going to close my accounts. I want to close my accounts with you now!”\n\nAt this point I’m excited about putting him in his place but I also want to cover my ass, so I ask:\n\nMe: “So, just to be certain. You are instructing me to close all of your accounts with us, including your credit card, savings account and transactional account?”\n\nCustomer: “Are you stupid? That’s what I said!”\n\nLady’s and Gentlemen: We got him!\n\nMe (Grinning my ass off): “Okay no problems. I’ll just place you on hold to do that for you.”\n\nI hit the hold button fast just as I heard him say  “no I—“\n\nWith my night manager’s help we close his accounts. His savings account was a term deposit so by breaking the term early he had to pay an early access fee of 10% of the balance. We used the money in his transactional account to cover the outstanding balance in his credit card (including the interest) and sent a request for a cheque to be issued for the remaining money. \n\nI took the customer off hold. \n\nMe: “again thank you for your patience. As requested your accounts are now closed. Was there anything else I can help with tonight?”\n\nIf I thought the customer went ballistic before, oh boy! There was talk of suing the bank, suing me, suing my night manager, suing head of customer relations and retentions. That we were guilty of discrimination. That I didn’t have the authority to do what I did. He’s going to call the police. We’re thieves. Some other ways of telling me how useless I am and how I can kill myself. You get the picture. \n\nMe (still smiling because I know I nor anyone else at my bank will have to deal with this asshole again): “sir I understand you are upset. However, on a recorded phone call you instructed me to close your accounts. I’ve complied with your wishes. As there is nothing else for us to speak about tonight. Thank you for calling (bank) have a good night!” And hung up on him before he could say another word. \n\nMy night manager created a incident report and sent it to head of customer relations and retentions with an attached a copy of the call recording. I later found out head of customer relations and retentions sent the customer a letter telling him he was banned from our bank for life due to the “vile and disgusting” way he had spoken to me! We would never do business with him ever again and if he called or visited a branch, we would be the ones calling the police. \n\nDo you want to know what the total interest charges were that started all this? ~$30. \n\nHis term deposit had $20,000 in it. He cost himself $2000 in early exit fees because he thought he could bully his way out of ~$30 in interest.\n\nEdit: Wow! Thank you to everyone, the response has been amazing. My god! Thank you for the Gold and Silver! I just wanted to blanket answer some questions/assumptions made in the comments. \n\n1. I’m Australian, not American. Our banking laws/code of practice/terminology are a bit different. \n2. Normally no, I wouldn’t close an account or a suite of accounts. That’s something customer relations and retentions would do, but it was outside of their hours of operation and  with the note from the head of the department stating not to retain the customer, I was authorised in the situation to close the accounts. I needed my manager to approve the closures with his RSA passkey. \n3. If you close an account with any bank and you owe the bank money best believe, if you have another account with money in it with the same bank, you have authorised them to use those funds to clear your debt. Check your terms and conditions. \n4. I can’t remember why the exit fees on the term deposit came out of the principal balance rather than the interest earned. I do remember if the bank created a tailored term deposit for a customer (usually an unusual length of term, higher interest rate or pays interest before term) it can come with added conditions from the bank. I’m guessing that’s what happened in this case. \n5. I say “long time lurker” because I’ve read Reddit stories for years without an account and finally created one to contribute instead of just consume. \n6. I’ve removed a lot of the acronyms seeing as it annoys sooo many of you. \n7. Thank you everyone for suggesting I should cross post this to other subreddits.",
        "permalink": "/r/MaliciousCompliance/comments/c11doa/close_all_of_your_accounts_sure_thing/",
        "comments": [
            "If ever there was a classic asshole tax this it. Sweet justice!",
            "That's a hilarious story! I especially love how you hit the hold button extra quickly, so he couldn't backtrack anymore.   \nBut he absolutely deserved it, people who insult CSOs are jerks.   \nAnd I am glad to hear NM and HCRR were on your side. You hear many stories in which some ignorant upper management guy decides to overlook the most unacceptable customer transgressions, because \"the customer is always right\".",
            "YES YES YES YES YES YES! Best punishment ever. Especially with the check being issued for the remainder. Now the ex-customer has no access to the funds until the check shows up in the mail.",
            "I’ve worked in the banking industry for over ten years. This gave me SUCH GREAT JOY!\n\nI used to work for Washington mutual years ago, and was allowed to say a lot more than you’re allowed to now.\n\nCustomer: what do you mean you need to see my ID? I’ve been a customer for 25 years!\n\nMe: would you like me to put a note on your account requesting we refrain from checking ID for all withdrawal requests?\n\nCustomer: no, don’t be ridiculous\n\nMe: then let’s see it, ma’am",
            "I've read a lot of MC stories, but this has BY FAR been my favorite one to read. This customer had it coming, and I would have done the exact same thing if I had been in OP's shoes. Great job! You should definitely post more stories.",
            "People who think that they can use the poor guy trying to help them as a verbal punchbag because they think they can't be punched back are scum. I enjoyed reading that a lot, and I hope that he takes his $2000 lesson to heart.",
            "Magnificent MC, OP. Bravo!",
            "The whole \"used his transactional account to cover his outstanding balance on his credit card\"  ...let's just pause to appreciate all the checks being returned for NSF or\"Closed Account\".   woooosh there goes another one.  Gonna cost him way more than that 2k when the dust settles.",
            "This is the kind of nightmare that keeps me from being an asshole to anyone with a service-oriented job...\n\nWell, that and not being a shitty human being in general",
            "Deleted post:\n \n> Hey everyone. Long time lurker, first time poster. This MC comes from my time working at a bank, in their contact centre. I literally have hundreds of stories about that place and its customer’s, but today I’d like to share a story that has always bought a smile to many a suffering customer service co-worker’s face about the time we got one back for the good guys.\n\n> Backstory: I was employed as Customer Service Officer (CSO). I’d been with the bank for about 18 months, mostly working afternoon shifts, but recently the bank had moved to a 24 hour customer service model, so while most of the bank would be closed (Head office, Complaints, Credit etc) — we were still open.\n\n> Cast: Me, Night Manager (NM), Asshole Customer (AC), Head of Customer Relations and Retentions (HCRR)\n\n> Let me set the scene: ~10pm, midweek, fluorescent lights flicker overhead, the call board empty and I’m literally counting the seconds left in my shift, ready to go home.\n\n> phone call pops onto my screen\n\n> I think ‘Shit! I always get a call just before I finish’\nMe (mustering my best customer service voice): “Hi, thanks for calling (bank), you’re speaking with u/Absurd-n-Nihilistic, how can I help you?”\n\n> I hear nothing but dead air, so I start to repeat myself.\n“Hi, you’re speaking wi—“\n\n> When I hear the tone of voice and words every contact centre worker has heard at some point. It just lets you know you’re in for a great call (not!).\nAC: loud sigh “Yes! I’m here! God, what takes YOU people so long to answer?! What are you doing?”\n\n> As noted before, there was no calls on the board, this customer didn’t wait in queue. He would have dialled, gone through to the IVR to enter his customer number and pin before being put through to me. Max 60 seconds.\n\n> Me (trying to not provoke any further and get this customer off the phone as quickly as I can so I can go home) “Oh, I’m sorry about that. Our system doesn’t show a queue, but I’m sorry that you had to wait. What can I do for you this evening?”\n\n> AC seems to settle down and starts explaining that the reason for the call was the interest charges on the most recent credit card bill. AC was sure they were a mistake because “I always pay my bills on time” and “I don’t like paying you blood suckers anymore than I have to”. Charming, I know. So I place AC on hold to look at his account. I started looking at the payment history, when payments were due/received, what the balances were etc. Then, I quickly looked at the customer’s interaction notes. This is where the bank records any contact with the customer as well as, any fee waivers, special interest rates etc. and I see an interesting series of notes from colleagues of mine stating things like “customer advised interest was charged due to full payment not received by due date. Customer threatened to close all accounts with bank. Manager approved interest waiver”. Notes like this went on for months, until there was a note from HCRR stating “if customer threatens to close accounts to seek waiver of fees, interest or other charges, please process immediately. No retention authorised”\n\n> I was a bit shocked because usually the bank would do a lot to keep existing customers, like they told us in training, ‘it’s cheaper to keep a customer, than it’s to gain a new one’. So I call over my NM to read the notes and give him a heads up I’ve got a feeling the customer is going to be demanding another interest waiver. My cool NM said “well if he does, do what the note says”.\n\n> Total hold time: maybe 2 minutes.\n\n> I take AC off hold and thank him for waiting.\nAC: “About time! My time is very valuable, you know. So have you fixed it yet?”\n\n> I start explaining that the interest charges are valid because he didn’t pay off his balance before the due date.\n\n> AC goes ballistic!\n\n>He starts calling me every conceivable name under the sun and mid sentence stops, he plays it like he’s just had an idea “fine. If the interest charges are valid, I’m going to close my accounts. I want to close my accounts with you now!”\n\n> At this point I’m excited about putting AC in his place but I also want to cover my ass, so I ask:\n\n> Me: “So, just to be certain. You are instructing me to close all of your accounts with us, including your credit card, savings account and transactional account?”\n\n> AC: “Are you stupid? That’s what I said!”\n\n> Lady’s and Gentlemen: We got him!\n\n> Me (Grinning my ass off): “Okay no problems. I’ll just place you on hold to do that for you.”\n\n> I hit the hold button fast just as I heard AC say “no I—“\n\n> With NM help we close his accounts. His savings account was a term deposit so by breaking the term early he had to pay an early access fee of 10% of the balance. We used the money in his transactional account to cover the outstanding balance in his credit card (including the interest) and sent a request for a cheque to be issued for the remaining money.\nI took AC off hold.\n\n> Me: “again thank you for your patience. As requested your accounts are now closed. Was there anything else I can help with tonight?”\n\n> If I thought AC went ballistic before, oh boy! There was talk of suing the bank, suing me, suing NM, suing HCRR. That we were guilty of discrimination. That I didn’t have the authority to do what I did. He’s going to call the police. We’re thieves. Some other ways of telling me how useless I am and how I can kill myself. You get the picture.\n\n> Me (still smiling because I know I nor anyone else at my bank will have to deal with this asshole again): “AC I understand you are upset. However, on a recorded phone call you instructed me to close your accounts. I’ve complied with your wishes. As there is nothing else for us to speak about tonight. Thank you for calling (bank) have a good night!” And hung up on him before he could say another word.\n\n> My NM created a incident report and sent it to HCRR with an attached a copy of the call recording. I later found out HRCC sent AC a letter telling him he was banned from our bank for life due to the “vile and disgusting” way he had spoken to me! We would never do business with him ever again and if he called or visited a branch, we would be the ones calling the police.\n\n> Do you want to know what the total interest charges were that started all this? ~$30.\n\n> His term deposit had $20,000 in it. He cost himself $2000 in early exit fees because he thought he could bully his way out of ~$30 in interest.",
            "That guy really had it coming. It is also a good reminder not to issue threats, you are not prepared to follow through (and not to be an asshole).",
            "Win Win!\n\nLove it!",
            "So.much.win.",
            "To everyone questioning this story's validity, you all bring up good points. However, from someone who spent over 10 years in the branches in the United States, I can tell you that this story sounds a lot more legit than you believe:\n\n&#x200B;\n\n1) Regarding that CD penalty rate: I don't know much about Australian term deposits, but with US Certificates of Deposit, that's not quite as crazy as you'd think. It IS a bit high for American standards, but the concept behind it is the same. It depends on the Annual Percentage Yield and the term. A 5 year CD, for example, might have something like 3 years' interest as a penalty. The interest is forfeited and then the principal is eaten into to cover the rest. For those saying that CDs in the United States are guaranteed and that you would only forfeit interest, that is simply not true.\n\n&#x200B;\n\n2) Regaring disclosures and dissent: This one is a bit of a grey area. People are saying that the customer in this story has grounds to sue the bank because the employee never read the disclosures regarding fees and because the employee clearly heard the customer withdraw consent for the accounts to be closed. And this skepticism is not unfounded.\n\nHowever, the customer's standing to sue, as far as I can tell, may not be as strong as everyone imagines.   First, consent. On a recorded line, assuming the OP's story is true, the customer would have given explicit instructions and authorization for the representative to close all accounts. And not just once, but on a minimum of two separate occasions. A \"no I--\" may not simply be enough to override this, especially if the employee can maintain that he didn't catch the customer saying that. Especially if the customer is using a ton of extraneous verbiage in his answers (when the OP confirmed the customer's instructions to close the accounts, the customer's reply was  “Are you stupid? That’s what I said!”. It's not unreasonable for the employee and the bank to argue that they were legitimately unaware that the customer was withdrawing his consent).\n\nAs far as disclosures go, that's a tough one. Disclosures are supposed to be read in situations regarding account closures, and that apparently wasn't done here. That said--and I'm no lawyer--the bank might be able to make the argument that it would have been improper for the employee to have engaged the customer further given the intense verbal abuse he was enduring. Between that and the multiple instructions from the customer to close the accounts, and it could fairly reasonably be argued that this customer understood and accepted all risks and consequences of the closures. If I were a judge or jury in a case like this, I would accept this line of reasoning from the bank as reasonable.\n\nAnd ultimately, it may not have mattered. Given the manner in which the customer was allegedly abusing a bank employee, virtually every bank in America would fully close these accounts and permanently end the customer relationship. Trust me, I've witnessed this personally. If you curse out an employee, most managers WILL have all your accounts closed. Yes, branch managers do have that authority, and I imagine the call center managers do too.\n\n&#x200B;\n\nSo all in all, is this a true story? No idea, I wasn't there. But it sounds plausible enough and, more importantly, it's cathartic. So enjoy!\n\nI left my own story after reading this. Enjoy it here:   [https://www.reddit.com/r/MaliciousCompliance/comments/c16m30/let\\_me\\_fix\\_that\\_landlordtenant\\_account\\_for\\_you/](https://www.reddit.com/r/MaliciousCompliance/comments/c16m30/let_me_fix_that_landlordtenant_account_for_you/) \n\nSincerely,\n\nARB--Angry Retail Banker\n\nangryretailbanker.com",
            "Haha! Thank you for the giggles. What a story! Well played.",
            "This reminds me of when I closed my internet service account. \n\nI called because my building had a special deal posted if paid for the whole year up front, and I’d been vaguely annoyed for a while that my sister was paying less than me from the same ISP for better service. I thought I’d see if they could give me the posted deal on a month-to-month basis (we rent and weren’t sure at the time if we’d be here another year). \n\nBut my plan had also just jumped up after another promo rate ended and they had told me I could call and renew the rate I already had after 6 months, so I figured if all else failed, no problem, I would just do that. \n\nI had a friendly chat with the customer service rep and he said he couldn’t do the special deal at all by himself because it’s not one of their regular ones, so he’d transfer me to a customer retention rep. No problem. \n\nQueue customer retention rep. He can’t do what I was hoping for so I ask if I can renew my current plan instead as I’f been promised. \n\nBut he has a special deal for me: instead of paying $35 per month like I have been, he’s authorized to offer me 6 months for only $246! Great savings according to him! He actually quoted me some random amount of savings too, like “you’ll save $48” or something. This was years ago and I don’t remember his exact phrasing (or the exact values, these are all examples) but he was telling me an outright lie. \n\nI confirmed the monthly amount with him, then basically said “you’re telling me that your $41/mo plan is cheaper than my $35/mo plan.” \n\nI was so angry he would lie outright in an attempt to trick me into a more expensive plan that I closed my account on the spot. \n\nThe part that reminded me was OP’s “just to confirm, you’d like to close all your accounts...” \n\nThis guy put me on hold for nearly 40 minutes. I threw it on speakerphone in the background, fully aware he was doing it out of spite. Doesn’t matter, I found a better ISP that doesn't force me to call in every six months for a decent rate, so I won.",
            "Something I don't get about his thinking:  This guy is clearly well-off, and also in the habit of paying his credit card bills late every month, then calling to get the interest fees waived.  What could he possibly be doing with his money in the extra few days he gets that's worth the cost to him in time of calling to get the fees waived?",
            "Haha you’ve got a typo in there with \"cool night mango\" which I’m sure you mean manager but now all I can imagine is a mango in a suit.",
            "Good you got rid of the problem customer, but the real problem is still there, which is your managment, who teach customers like him the bad behaviour to get advantages over nice customers.",
            "In my first job out of college, I had a coworker who used to do something similar. Whenever he wanted a raise, he'd threaten to quit (he was a COBOL programmer and was the only person who really understood how our payroll system worked). And it worked for awhile - he'd threaten to quit and he'd get his raise. That is, until it didn't work. Instead of giving him a raise, they just  said okay and wished him luck.\n\n&#x200B;\n\nHe didn't quit and he didn't get his raise.\n\n&#x200B;\n\nMoral: Don't make threats you aren't prepared to carry out.",
            "[deleted]",
            "How does malicious compliance not have a ban on acronyms yet? It’s crazy. I’m sure I’m not the only one confused with HCRR and HRCC",
            "[deleted]",
            "I swear I've read this before...",
            "[deleted]",
            "Hey, it's deleted; any way to read it or was it violating some rules or something?",
            "It’s back up now. Still don’t know what happened",
            "That's *incredibly* satisfying.",
            "What back has a10% early close fee on their CDs?  Sounds excessive.",
            "I'll never understand this mentality. I try to be as nice as possible to every person over the phone when I'm trying to get something. I do have a habit of not taking no for an answer when I know it is reasonable and within bounds. I will repeatedly ask for a higher up supervisor, \"no that's perfectly ok. If you can't approve it, could you please transfer me to your supervisor?\" I even go the point of wishing each person a wonderful day before they transfer me.",
            ">no I—\n\n#NO U",
            "I had the pleasure of doing this in person many times. The client never knew what I was doing until I handed them a check.\n\n\"What's this?\" They would ask.\n\n\"That's you funds from your accounts, you requested to closing your account, so I did. Have a good day.\" The best part is, if it was a large amount the new bank would put a hold on the check.",
            "How many charges has he bullied his way out of before? Would it have been anywhere close to $2000 worth?",
            " people like that really poison it for the humans who genuinely need help and call centre people who are interested in helping- how he got away with it for so long encouraged him to keep doing it- you closing it down was the first time was well overdue - great work",
            "Jesus christ.  He had 20k in his savings and couldn't pay his fucking credit card bill on time?",
            "From all past, present and future customer service FI employees, THANK YOU for this satisfying story. This keeps me going.",
            "The only service I tried the 'please close my account then' tactic with was my SiriusXM subscription (dear God that company is ruthless, you can't even cancel without speaking to someone) and I really didn't care either way whether I kept the service or not. But even still, despite the company sucking you don't treat the phone reps like that.",
            "You know what they say, play stupid games, win stupid prizes. And oh lordy he a winner 😂",
            "Oh god, I need a cigarette after this one. Thank you.",
            "I don't think banks can ever be the \"good guys\" but someone being abusive like that 100% is the badie.",
            "Man, I wish I could get out of interest. I don't owe anything now, but back in the day I had a large credit card balance at 0%, and I was making minimum payments. I somehow misread the last digit of the minimum payment due as a 0 instead of an 8. The credit card company counted it as a missed payment, I lost my 0%, and my minimum payments shot up over $100 monthly. They didn't budge an inch when I called.\n\n$8 ending up costing me a couple thousand in interest.",
            "This was such a fucking satisfying read. Take my upvote, and my blessing.",
            "I worked as a head teller in a bank for several years, and I was always shocked at how people treated us. You’d think people would be kinder to those who can literally see everything you do in your life via your account history, but no... you truly won one for the good guys, many blessings on you and yours",
            "Brilliant! Screw that guy.\n\nAlso, screw the folks here who complained about the story for whatever reasons they felt were necessary (in reference to that, I particularly like your response #6 above).\n\nPlease keep up your tales, they're great!",
            "Great story! I'd put the edit at the bottom though. Kinda weird having to skip that then come back to read it.",
            "As a Personal Banker, reading this sent chills of pleasure down my spine. I love when customers  don’t get away with acting like assholes.",
            "It says removed for meh, is it on another sub or was it found to be false?",
            "This is simply beautiful. Love that your coworkers set them up and you expertly knocked them down! A true team malicious compliance!",
            "Thank you for your service.",
            "If ever there was a classic asshole tax this it. Sweet justice!",
            "Dude what was the term of the CD? The penalty is so steep..",
            "Spend a few years in that role myself. The justice is sweet.",
            "I bow to your skill",
            "I have a question. Would the fees of 10% be valid since he could claim he didn't understand or wasn't advised of the 10% fee?",
            "Im torn between my hatred of banks and my hatred of customers... But overall I gotta say good job",
            "That's insane. I've overdrafted before and all it took was a polite phone call where I respectfully asked to be elevated to the next level of authority and the charges were eventually reversed. Well done OP.",
            "I love this story. It is stupid simple and costly as all heck. Hope you don't get any more like that!",
            "I had the same job for a large national bank here in america.\n\nIt was a horrible job, but it did have its perks. It beat standing over a hot grill during the hottest parts of summer.\n\nWe were rarely slow enough where we had no calls, but our bank was smart. But also a bit evil. When you are a business lowering costs is always important, in conjuction with products and good customer service, but sometimes there are people who call their bank every day, or every 3 days, all the time every week. We were the frequent callers center, so we spoke with the people who knew what to say because theyve been saying it several times a week forever, it was hard emotionally to know there wasnt much i could do during hard circumstances, i mean a bank wont just give you money if they dont think they will get it back. But we would have all kinds of Notes from the other departments before they would get to us.\n\nThere was a guy that kept calling and got our center, in one day he called us 8 times, and by the last time one of our site managers took the call after the first escalation and told the guy to stop calling, and that if he calls one more time about x problem that he would personally close out the accounts and send the check.\n\nA few differences in american banking. When you close your accounts you dont have to pay off your debts like a credit card immediately, i mean, i guess its the banks right to do so, but generally from a customer service stand point we would ask, but i believe legally they have to at least get their bill before being required to pay the unbilled portion, but we would just submit the closure and the customer can work it out.\n\nNow if it was a regular checking account most banks have their terms and conditions and inside is what is called the right to offset, and that is where if a savings or checking account has a shared owner the money is considered equal for each owner, and say if your spouse has a negative balance checking or savings account, and a shared account has money in it, the bank can and will transfer the money over to cover the negative balance from the shared account, now if the accounts are seperately owned they cannot. And the bank will move the money before they tell you they are moving the money, most of the time the bank will have already tried to let you know.\n\nI would always feel bad for the legal orders that get placed. Took between 3-5 days after you squared away with whatever govt agency got a judge to screw you, to then get your money released. I mean one big part of bank indoctrination is the brainwashing that it is essentially these peoples fault, but in some ways everyone is being ground and chewed through the machine that was built to keep us poor and them rich why give the billion dollar bank the benefit of the doubt that mayne they do charge too many fees.",
            "You are a legend 😂😂😂",
            "Thank you for this story. It was very satisfying to read :-))",
            "Sweet, sweet justice.",
            "As a call center worker\n\n&#x200B;\n\nyour story gives me life",
            "[removed]",
            "As a bank employee myself: I came a little.\n\nGood job, you compliant bastard.",
            "Upvoted before reading because I *knew* it would be great! Thank you for this amazing compliance!",
            "Oh man, this story gives me such satisfaction. Possibly the best, most satisfying MC I've ever read.\n\nCongratulations, OP! Score one for the good guys!",
            "So satisfying. Well done!",
            "Ahhhhh that was so good",
            "Aww shit dude played himself. That must have been so satisfying to close all his accounts!",
            "What a retarded cunt.",
            "Oh, this story made me so so happy! I needed this, today, thank you!",
            "Beautiful.",
            "Beautiful",
            "Now I will have nightmares about cso not telling me the cost of my decisions.",
            "It's the classic MC, but the classic never gets old. Infinite diversity in infinite combinations.",
            "You've actually gotten to experience the fantasy so many of us have dreamed of!",
            "This was professional. Amazing job, hope this happens to AC again.",
            "This is beautiful",
            "Wow lol who has 20k+ saved up and doesn't just turn on auto pay... Good on you OP, you deserved this one for being patient from the start",
            "I just want you to know that I'm saving this story. I've been out of call centres for years but oh boy was I right there with you in my heart. <3",
            "I would have loved to have seen the look on AC's face when he realized that not only did you comply with his wishes to close the accounts but he was going to get dinged to the tune of $2000.",
            "This made me shiver with satisfaction.",
            "You are a god among the workers that keeps this existence alive.\n\n&#x200B;\n\nThank you for sharing <3",
            "#BURN!",
            "Why do people always go the discrimination route, I have no idea what race or whatever you are and what exactly makes you think you are special good on you for doing this and fuck these types of people.",
            "Beautiful MC baby!",
            "It worked for him before so he thought it would keep working forever. Nope sorry bub lmao. As someone that works in a similar field currently, this brought a huge smile to my face.",
            "As a bank teller, this is absolutely beautiful. This is so satisfying. I love when it's all threats because they think we'll bend over backwards, but instead the customer/member shoots themself in the foot. \n\nPlease crosspost this to /r/talesfromyourbank",
            "This is one of the best Asshole Tax stories I have ever read. Well done!",
            "Dat’s beautiful.",
            "Holy fuck, that was great story telling, and moreover, it was extremely satisfying at the end. Please do not be a lurker anymore :)",
            "I work in the credit department of a large, global bank and occasionally when customers call in asking about credit limit decreases or whatever we did to their account due to delinquencies or credit bureau report reasons, they threaten to close their accounts with us unless we reverse the decision! Oh no! I tell them quickly that \"as a consumer, closing your accounts is your prerogative, I'd be happy to get you over to customer service so we can complete that for you!\" They usually get indignant, flip out, and ask how I have the nerve because their gambit obviously backfired but my bank gives me authority to say it because they don't want delinquent account holders. It warms my heart.",
            "I would have loved if you said to him, \"You want to sue us? Alright I'll have to transfer you to our legal department. Goodbye.\"",
            "Oh god that was good. People always think pulling the “I’ll go somewhere else” will mean customer relations just fawn over trying to keep them it’s great when it blows up in their faces.",
            "My justice boner is rock hard.",
            "If the interest is paid out regularly during the term the penalty could come off the principle, but it's really a penalty on the interest you were already paid",
            "As someone who worked as a CSR for a credit card company, this gave me the chills.",
            "Where does the money go that was in the bank accounts?",
            "I had a very abusive customer when I worked in a bank call center. I was the third rep he called that day and spoke down to. I reached out to a manager all calls were listened to, sent to corporate security and he got a cease and desist letter along with a check for his funds and his multiple accounts closed. It was glorious. How I wish I could have been around when he discovered his accounts were closed.",
            "I love how you say \"put him in his place\" clearly this guy was an absolute wanker but in my experience, most banks would view any customer, good or bad in this manner.",
            "Good for you. \n\nI wish we could tell people to leave and never come back in my business, but, we can't.\n\nI'm glad you had a good experience with the head of departments, too. Yea, you!",
            "[deleted]",
            "Great story ! And to be told without acronyms makes it so much better, thanks for the effort!",
            "Strange. It took me multiple attempts to close an account with one of the big 3 Australian Banks. The request had to be in written form in the correct format.....",
            "Nice!",
            "Nooo not my accronyms! I have a good deal of fun picking new names for them! Then again the stories do end up making much less sense.",
            "I think I’ve read this story before lol",
            "So what happened to the rest of the money in his account? I'm not at all knowledgeable about banking - other than 'can accrue interest on savings' and 'one of the most reliable and safest investment options' - so I'm guessing he was allowed to withdraw the rest of his money and deposit it into another account at another bank?",
            "I should’ve known he was an Aussie lol.",
            "I recall one month not paying my wife's credit card on time. It resulted in $120 of interest and a late fee. I got my wife to ring the credit card department of our bank also an Australian, (Which Bank?). We had said that we realised we had paid our card late and that the interest and the fee were valid but asked could they waive it as we have always paid our account on time and had meant to. We mentioned we knew they didn't have to do this but would appreciate it if they did.\n\nThey responded by saying they would, the interest and the late fee was refunded in the next months bill.",
            "How tf are you a long time lurker when your account was made 5 hours ago?",
            ">I literally have hundreds of stories about that place and its customer’s\n\n/r/talesfromcallcenters",
            "[deleted]",
            "[deleted]",
            "Um, a bank that charges 10% fee for getting your money is a pretty shitty bank to be fair. \n\nI'll take a guess that the savings interest rate is less than 1% return. smh",
            "I'd never bank with you guys.",
            "what the hell is wrong with your bank? if the guy has 20k in the account why would you charge him interest fees? just take it from that account. and you lose 10% for closing the account? what? your bank really are blood suckers.",
            "I\nY\n>of",
            "Oh, come on. You’re an asshole and you did an asshole thing to another asshole. This doesn’t make you a hero. There are two pieces of shit floating in one toilet.",
            "This is so satisfying."
        ]
    }
]