[
    {
        "post_id": "166b7ff",
        "author": "WritesForDough42",
        "title": "Ignore the time difference in the evening? I'll ignore it in the morning.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/166b7ff/ignore_the_time_difference_in_the_evening_ill/",
        "score": 14328,
        "num_comments": 397,
        "created_utc": 1693488539.0,
        "selftext": "Not me, but my father-in-law's story.\n\nIn the 1970s (before email and faxes), my father-in-law, Carl, worked as a trust agent for a bank in the Midwest, which is on Eastern time (ET). He handled trusts and estates for bank customers, including one older lady. Her son-in-law, Brewton, lived in California, which is on Pacific time (PT), three hours behind Carl, and managed his mother-in-law's estate on her behalf.\n\nBrewton used to call Carl with questions, which is not a problem. Except Brewton would call Carl at home at 8 p.m. ET, expecting him to answer questions. Carl would be at home, eating dinner or spending time with his family, so Brewton's calls were unwelcome.\n\nCarl would explain the time difference and said that Brewton should call before 5 p.m. ET, not PT. But Brewton always ignored Carl's requests, and demanded that Carl call him back \"first thing in the morning.\"\n\nCarl was nice and would wait until 11 a.m. ET to give Brewton time to get settled in his own office. Until he decided he'd had enough.\n\nThe day after Brewton's latest call, Carl went to his office extra early, got the information, and then promptly at 8:00 a.m., Carl called Brewton's house.\n\nA sleepy Brewton answered the phone and croaked, \"Hello?\"\n\n\"Good morning, Brewton!\" Carl all but hollered into the phone.\n\n\"What time is it?\" Brewton groaned.\n\n\"It's 8:00,\" Carl said.\n\n\"But it's 5:00 in the morning here.\"\n\n\"Huh, so it is. I guess there's a three-hour time difference. But you said you wanted these answers first thing in the morning, and it's 8:00 here, so I thought I'd give you a call.\"\n\nBrewton never called past 5:00 p.m. again.",
        "permalink": "/r/MaliciousCompliance/comments/166b7ff/ignore_the_time_difference_in_the_evening_ill/",
        "comments": [
            "I did this all the time while I was a telecommunications engineer in Chicago.  Sales teams got one freebie (plus a request to accommodate time zone differences), then for every 8:00 AM Eastern call they scheduled me for, I scheduled one for them at 4:00 PM Central.  Same idea for the folks on the west coast.",
            "Many years ago I worked nights and my roommate worked days. I'd get home about 7am and go to bed as she was leaving for work. For some reason her boyfriend liked to call about 9am and wake me up to ask me to relay a message to my roommate when she got home. (This was way before answering machines). No matter how often I asked him not to or had her tell him not to call and wake me up, at least once or twice a week he'd call.\n\nOne night I got home early...around 2am. Could not shake that wild hair out my ass, so at 3am I called his apartment. *His* roommate answered. His roommate was a great big boy. Not fat just BIG.\n\nI explained to Bob that Jeff kept calling me and waking me up and that starting that day every time Jeff called and woke me up at 9am, BOB could look forward to me calling and waking BOB up at 3am. Bob said he'd take care of it.\n\nJeff never called me and woke me up again.",
            "That's how you do it.",
            "The East Coast bias due to time zone differences is absolutely real.\n\nMy last boss was a lifelong East coaster, while I am from the mountains of Colorado and currently live in Denver. On numerous occasions he would mention how the culture in Denver was too relaxed. The more I've thought on it, the more I'm convinced it was mostly due to the time zone difference. He hated that we weren't online the same time they were and would complain that he had to wait for someone. He saw it as us not working as hard as people from the East Coast.\n\nTo top it off, he declared that our open seat in the West Coast was moving to Charlotte and that left me, the manager, as the only coverage for the West Coast past 2pm. Then when I left, they moved my position to Charlotte leaving zero coverage for any other time zones. It was all \"on-call\" after that.\n\nThat boss made it about 6 months after letting me go before getting terminated for being a bully.",
            "Exactly what I would expect from a Brewton\n\n... nicely handled ... exactly as I would expect from a Carl",
            "When I worked 3rd shift my brother had a habit of calling around 3:00 P.M. when I was sound asleep, always apologized and then would do it again.\n\nI waited for his wife to be out of town and called him at 03:00 A.M. two nights in a row, he finally got the message.\n\n(edit to add AM and PM)",
            "This approach also work great for those daytime workers who can't comprehend that night workers need to sleep during the day. \n\nWanna keep harassing me because you \"need\" someone to talk to on your lunch break? Fine. My lunch break is at 3am.",
            "My boss is in Ohio and I’m in Colorado. Last night at almost 7 pm MT he sent an email for a virtual meeting this morning at 6:30 am MT. I left work at 5:30 yesterday and got to work a little before 8 am to find a bunch of missed calls from him asking why I wasn’t on a meeting that I never even had the chance to know about 🤦🏼‍♀️",
            "I worked in a sales office in NY that called all over the country.  A sales rep asked how far behind us is Alabama.  Someone replied, \"1 hour and twenty years\"",
            "Beautiful and simple MC.",
            "People always feel like their timezones are the canon timezone \n\n\"I called  you guys when you opened for the last 5 days and no body would pick up\" \n\nSir, you're 3 hours a head and our hours say Pacific, so you're calling us while  are still asleep.",
            "Many years ago, when I still lived at my parents house, our house landline rang late one night - shortly before midnight iirc. My room was in the attic and as such I was the only one with a phone extension on their bedside so I answered it.  \n\nAs I was speaking, my dad opened my door and yelled up the stairs \"tell your friends not to call my house this late, I'm up for work in four hours\".  \n\nI happily yelled back, because the call was for my dad. \"It's Mike (secretary of a club my dad is in), he said that he's sorry to call so late but it's urgent. He wants to clarify something for the minutes of your last committee meeting\".  \n\nDad told me that nothing to do with a committee meeting could be that urgent and he'd call him back tomorrow.  \n\nMy dad is a man of his word and called him back as he was eating his breakfast at 0430 the next morning, opening his call with \"hi Mike, you said it was urgent?\"",
            "I did this to my coworkers.  \n\nThey were in California and scheduled a regular 3pm Friday weekly review call.  They'd do the call then call it a day and leave before 4pm.  This was 6pm Friday my time.  I asked for it to be rescheduled several times but it was the \"best time for the team\".\n\nSo I scheduled a call with us and a customer for 830 est (530am their time).  Because it was a big client they had to attend.  I told him what I did beforenthe call and he peppered the call with comments about how early it was for them.  Then he rambled and ended after a while with \"i gotta go for now, lets schedule a follow up for later.\" I loved it. \n\nMy boss called me later because people complained to him but he got a chuckle out of it.  The Friday call was rescheduled after that.",
            "That reminds me of an old doctor from our small town - he had problems with farmers waking him up early to ask him questions. Reminders that he was still sleeping at that time were mainly met with a “time to start the day, doc” type of reply or a quick “sorry”, then it would happen again.\n\nHe apparently had better success with phoning them in the evening, right before he went to bed, to give them their test results or follow-up advice “in case they were worrying about it”. Early morning calls (except definite emergencies) ceased.",
            "You should try talking to an EST bank while working in the Middle East.\n\nI was told a few times they can fix the problem at my local branch office.",
            "Living in HI and trying to deal with companies on the mainland was a real joy. Especially when you consider HI never changes their clocks so the time difference would change part way through the year so you had to recalibrate when it was ok to call someone",
            "I used to work 6:30 - 3:30 (morning - afternoon). I chose to do so. A guy from another team sent me an invitation, for a meeting he needed to have to ask me questions about a project.\nI decline and note in my reply that I don't usually work later than 3:30 but could make arrangements if sufficient notice is given. He sends a second invite for the next day at 6:30 PM, so 3 hours later than my usual. \nSo I played ball. I declined sent a new time with 7 AM for the next day.\n\nSurprise, surprise, there was then a final meeting at 11 AM 2 days later.",
            "TIL I've had a fundamental misunderstanding of U.S. regions for my whole life because the MidWEST is in the EASTERN half of the country. What are you guys doing over there?\n\nEdit: I would like to thank the several of you that have given me a history lesson on the origin of the \"Midwest\" name. Also, before you comment something, you should probably check if somebody else has already said the exact same thing. You could save yourself some time",
            "sometimes the only solution is to make it their problem instead of yours.",
            "Yeah, this has always been easy for me living on the west coast. I'm a heavy sleeper and you aren't gonna wake me up with a phone call anyway, but even if you did I don't answer until 8am my time.\n\nMy girlfriend gets called at 4am from their warehouse in Ohio because the supervisor of the warehouse for some reason can't call anyone else. In reality it's because she answers the phone, and solves the issue, regardless of when it is. I tell her every time she complains that she needs to set boundaries or it'll never stop.\n\nWe were in Alaska on vacation and she got a call on Monday morning that there was a bomb threat to the warehouse. To be clear, we live in Arizona, the warehouse is in Ohio, and my girlfriend is just a project manager of projects that go through this warehouse, among others. She has 0 to do with managing any of the people there and is in no way involved in their safety practices or reporting. There is zero reason for her to have this info other than to know it's going to push stuff back because no one can work. Which is absolutely irrelevant information for someone to get while on vacation. But, this supervisor supposedly has no one else they can tell that would get that information back to sales so they can inform the customer if needed. Their own boss, who works in another state and is therefore unaffected by the bomb threat but should also be aware of it perhaps?",
            "The fax machine was actually invented in 1843. I swear I'm not trying to be super pedantic, I just share this any time I'm able. I find it to be interesting that fax is so old.",
            "What a lovely taste of his own medicine",
            "I live in a country where the work week is Sunday to Thursday, so Friday and Saturday are the weekend.\n\nWe work with lots of people in different countries, and Americans tend to forget that Friday is a weekend here, and book meetings with us on Friday.\n\nI've made a habit of responding to these meeting invitations with \"Fridays isn't good for me - how about Sunday?\"\n\nThat usually gets the message across.\n\nOne person actually responded with \"sure, I can do Sunday\" and I had loads of respect for them after that, because it was the first time I felt that an American was willing to sacrifice their free time to accommodate me instead of expecting me to sacrifice my free time to accommodate them.",
            "This is called: Putting the turd in the correct pocket.",
            "I worked night work 10 pm to 8 am had a boss that would call me or dont laugh beep me at 1pm to 3pm all the time I tried explaining this was when I was sleeping so finally I started calling him st 3 am and asking stupid questions finally after about a week he said to me you know I'm really  tired I haven't gotten a good night sleep cause you are calling me!  I said oh you mean like when you call me in the afternoon get the point never called me again lol",
            "Yep.\n\nI was on a global team working in the Middle East.  Other main teams in Europe and of course mainly US.\n\nAnd this is recent so not like they couldn’t see my time zone (work hours available in Outlook) or just use a simple tool to plan meetings.\n\nAnyway typically the standard for global calls was meetings at 8 AM EST (we had some offices in NYC).  So Europe was afternoon and we were evening.  West Coast had to duck it up since us in the ME were calling in at essentially evening.  Made for a late late dinner.  We did the biggest compromise since there were less of us.\n\nAnyway sometimes some joker would schedule a meeting from the US with us at like Noon or even 2PM.  That was starting a meeting late at night, like midnight or 2 AM.\nSo I would politely decline and send a suggested time that was very convenient for me but would translate to like 2AM their time.\n\nNew invite would come out for 8AM their time.",
            "Saw the same exact ineptitude for time zones when I worked for Fandango and some people somehow ordered movie tickets for the wrong time zone, missed their movie by 2 hours because of the time zones and couldn't get refunds because the movie start time had already passed. And the theater couldn't refund or comp their tickets since they didn't purchase for their local theater.",
            "Why the hell was Brewton calling after 5 *his time* anyways? Obviously, after 5pm, businesses are closed. So, even if this chud didn't understand timezones, he surely should have understood business hours.",
            "Never piss off someone who can and will wake you up early on a work day",
            "Someone else may have mentioned this, but why did Brewton have Carl's home phone number? This was before cell phones and Brewton should only have had access to Carl's office phone number.",
            "This is great. 😀\n\nIm also a morning person. I go to sleep early and wake up early. Usually I wake up 05:00 in the morning, and If possible, I beging to work soon after. At my current position I can only begin at 07:00 tho. That means my currents working hours are from 07:00 to 15:00.\n\nWe got ”sliding hours”, meaning that we can decide when we begin and stop working and most of my colleagues do 09:00-17:00 hours, so Im sometimes bit annoyed when they call me for example 16:30. I usually dont answer those calls tho.\n\nI just might begin to call them 07:00 and see how they take it. 😬",
            "One beautiful Army-issue Friday a 19-year-old version of me was getting the typical weekend safety brief from my cell NCOIC before being released from a half day. The brief amounted to \"No drinking before 1700.\" To ensure I understood the instructions fully, I asked \"Is that 1700 Lima (local) or Zulu (GMT)?\" The NCOIC clarified that it was, in fact, local time before questioning why I was even asking since I was 19. Of course, I was just asking for the benefit of the group.",
            "\"I guess I'm NOT full of shit about the three hour time difference I've fucking told you about fifty hundred times you fucking moonbadger.\"",
            "Flawless Victory.",
            "I couldn't possibly love this any more than I do. Bloody brilliant job.",
            "[When I read Brewton I thought of Fenton.](https://youtu.be/3GRSbr0EYYU?si=6uxMxv0tfUlhDazs)",
            "this happens to me all the time.  HQ is west coast, I live east coast.  Get calls and slack messages at 6,7 8 pm or later.  not sure how they dont get it.",
            "I'm admittedly a little confused at Midwest being called Eastern Time. Most of the Midwest is on Central Time, unless people are counting Indiana and Ohio (and most of the Midwest doesn't).",
            "Good man. Sometimes the cure for stupid is showing them the results of their stupidity in a way that hits their non-empathetic asses.",
            "My father did the equivalent. Not just timezones, but cultures. We were in the Middle East, so 3 or 4 his ahead of London HQ, but also weekends for us were not Saturday and Sunday. We'd get late calls on our weekend, so my father returned them 6am on Saturday - also to their home number. It took a few times for the joint to be taken, and I think it was taken by their wife...\n\nTo make it more egregious, this was an international telecoms company.",
            "My kid had to do this with a grand aunt.  My daughter was in New York, her grandfather passed and her grand aunt was handling the estate.  She made all kinds of issues and we had to get an attorney involved.  As soon as attorney called all the drama went away.  But the grand aunt would call at 8pm California time.  Yes, college age daughter was up at 11pm new york time but not to deal with this woman.  She texted at 7am new york time (4am cali) because she said she couldn't talk during class or work.  Calls again 11pm NY time.  Daughter called her at 4am next morning.  She texted a few times in that day three hours isn't a big difference.  But 4am is?!?!?!\nWhy is it so hard to tell time in two cities??",
            "on the other side, i've seen employees try to get more overtime by counting the time change hours when they traveled.  those same guys  also didn't bother subtracting same said hours on the way back though for some reason....",
            "[deleted]",
            "This is why i sleep with my cell phone: I'm a real estate broker since 1989 who has gone through two times when shortsales where the main transactions. Bank Service Depts were mainly in ET and reps would call agents starting 7am their time, 4am my time, hoping to just leave a VM and on to the next file. I learned to only give out my cell number and then sleep with my phone and Snap To when it rang. I surprised every rep, who then had to spend 15-30 mins with me on borrower's file. It did get them to finish negotiations fast as each call with me screwed up their ROI.",
            "Try working in a global position where your office works on UTC+8 your operations office works on GMT+10 and you have to deal with USA, The Middle East, Asia, India and the UK with meetings, and the like. Very much a \"If this is Tuesday, this must be Belgium\" on a daily basis. Very much a TZ crap shoot.\n\nMy solution is that I am far to old bitter and twisted to care. What they pay me now is FU money so if the calls are between 05:00 and 15:00 I join. Any time in between if I notice the alert I may jump in, otherwise that is what emails are for. My boss is in the US on mountain time and even he schedules his calls when I am in the office.\n\nGo on peoples play silly games, that FU switch cover is off and the finger is hovering ready to flick....",
            "I used to work global support, and I've always checked before making a call, what is the local time at the destination.\nIt's basic behaviour.",
            "isn’t most of the mid west on central time?",
            "Why would he even give a client  his home phone number?",
            "When I worked from home, I never gave my personal number to clients. Ever. \n\nAnd if they found it I would ignore that they called it.",
            "Well played! You should cross post this in /pettyrevenge it definitely fits.",
            "Nicely played - beat that man at his own game.",
            "sounds like a story my dad told me!  I sorta wished we still lived in this time.",
            "My cousin from L.A. used to call me (in NY) after dinner. So once I called him back before I left for work\n\nOne time was all it took.",
            "This happened to a company I worked for in the late 1990s. I worked in an environmental and civil engineering consulting firm located in the Eastern Time zone. I was part of the field staff and we worked until we were done for the day, then clean-up and go back to the office, unload equipment and samples and do our paperwork. Sometimes I would get back at 6:00 or a little later. I would be the only person in the office. It was great, I got overtime and I could focus on getting my stuff done without interruptions. At least once a week there would be a phone call form this architect in Oregon or somewhere. She was always surprised that the person she wanted to talk to wasn't there, and I'd transfer her to the correct voicemail. I brought it up to the person she wanted to talk to, he just sighed and told me he tried to explain time zones, but she liked to return calls after 3:00, which is 6:00 ET.",
            "My dad had to work with people from around the world several times.  I was always amazed how he or them would stay late or get up early for work those days.  The Chinese he worked with were some of the nicest and would work 3 hours late on several occasions.  He said the guys in India were always rude and just wanted it all over, then would mess up, and he'd have to call again the next day to sort things out.  This is not a knock at Indians so please don't get it twisted.  This was just a small group of about 10 lazy ones.",
            "Happy to quibble on this one: [the Midwest is comprised of 12 states](https://www.bls.gov/regions/midwest/midwest.htm), only 3 of which are on Eastern time (ignoring Indiana's daylight saving time split).",
            "calling at 5pm in the first place is still a dick move, timezone differences or not.  also, fax and email did exist in the 70s, just not widely popular/used.",
            "Prefer seeing this vs. posts about mistakes kids are making now bc your post just proves that all kids make mistakes and I’m sure glad the internet didn’t exist for someone to provide perpetual embarrassment",
            "Wow. You must be really stupid and arrogant not to expect this to bite you in the arse. Nice story though!",
            ">in the Midwest, which is on Eastern time \n\nWhoa whoa whoa. Don't you lump the rest of us in with Indiana and Michigan.",
            "[removed]",
            "email was invented in 1969.",
            "I like the story, but I'm also trying to figure out where in the MidWest is in ET",
            "The fax was invented in 1843",
            "1970s wasn't before faxes, they were invented in the 40s.  Even email is from 1971.",
            "Fax machines were commercially available in 1964...",
            "The Midwest is on Central time.",
            "Brewton?  Hmm.. strange.",
            "\"Midwest\" is that south of Ontario?",
            "huh - imagine 10am US Eastern and receiving a call at 2am australian DST - been there, done that :(",
            "Hell yeah r/TraumatizeThemBack",
            "Having lived on both coasts as well as in the 'in-between' time zones I not only approve, I applaud!",
            "The best story",
            "Serves him right!",
            "This is the way 🤣"
        ]
    },
    {
        "post_id": "8otvwa",
        "author": "Clickity_clickity",
        "title": "The Story of Steve and Jim: I want to work by the hour!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8otvwa/the_story_of_steve_and_jim_i_want_to_work_by_the/",
        "score": 14314,
        "num_comments": 338,
        "created_utc": 1528227982.0,
        "selftext": "This isn't my story, but the story of a friend of mine I'm going to call Steve.\n\nHe ownes a landscaping business and has several employees. They work hard and get along really well. Steve pays them for their work done by the yard, not by the hour, in addition to buying his workers two meals a day.\n\nSteve hired a guy named Jim, who isn't a bad worker at all. Jim is just a little slow on the uptake sometimes.\n\nJim decided to start a fuss. \"I don't like that we're getting paid by the yard,\" he told Steve one day. \"I wanna be paid by the hour.\" Steve explained to Jim that, when you break it down, being paid by the yard comes out to over $10 an hour (about $22 in today's money, this was back in the 80's)--or more, depending on how many yards get done--and his hourly workers only make minimum wage. Steve further explained that the paid-by-the-yard workers get perks like meals, and operate on a true merit-pay because the more they get done, the more they get paid.\n\nJim was adamant, though, so Steve agreed. \n\n**Day 1**\n\nJim showed up, ready and raring to go. He decided, it appeared, to prove to Steve that being hourly doesn't mean he'll slack off! Like I said, Jim is a good guy and not a bad worker; he has a good work ethic and a big sense of pride. A couple yards got done, and it's lunchtime. Steve grabs everyone's order and asks Jim if he is going to buy anything.\n\nJim looked confused. \"What do you mean?\"\n\nSteve re-explained. \"If you're going hourly, I can't cover your meals anymore. You'll have to buy your own lunch.\"\n\nJim grumbled but ordered something small, and after lunch they all got back to work.\n\n**Day 2**\n\nThe crew was down two guys. Jim was in a good mood, maybe out of schadenfreude, because less guys on the crew meant less yards done--but Jim was going to make the same amount either way!\n\nWith a little bit of a smug attitude, Jim got ready for work, but when he looked at the job list for the day he looked taken aback. Steve had rearranged the yards for the week so that, for this particular day, they would be working on their smallest-yard clients. That way, the workers would get paid around the same amount they normally would if they had a full crew. \n\nJim hadn't noticed that Steve did this anytime he had a smaller crew: both because it guaranteed his guys were making over the legally-required minimum for per-part work, and because it kept their pay consistent.\n\n**Day 3**\n\nThey got a lot of yards done this day. In fact, they worked really well together that day, and really dug their heels in to get the last few yards on the schedule done. They'd taken about two hours less than expected, so everybody was able to head home early. \n\nJim asked if he could maybe go take on another yard or two himself, since if everyone got off early, he wouldn't be paid any more. Steve understood, and sent Jim out to get some hedges done, which took a couple hours because he was doing it by himself. But that was okay, because that was a couple extra hours of pay, and Steve was nothing if not fair.\n\n**Day 4**\n\nJim showed up to work a little late, because the extra three hours of hedge-trimming had left him more exhausted than expected. Steve was placing an order for breakfast as he showed up, and he just stood there for a few minutes as he watched Steve writing down orders for bacon and eggs and pancakes. Finally Steve stopped at Jim. Steve didn't say anything about Jim's tardiness; it was clear Jim had worked hard the previous night.\n\n\"You buying anything, Jim?\"\n\nJim swallowed hard. \"No, sir.\"\n\n\"It'll be mighty hard to work on an empty stomach, Jim.\"\n\nJim nodded. \"Yes sir, I know. I...\" I mentioned how much pride Jim had, and he really couldn't buck up enough to admit he had miscalculated. He knew he was wrong, but he was prepared to suffer.\n\nSteve, however, was a good dude. He recognized where Jim had erred, and didn't lord it over him. He made it plain and simple: \"I'll just put you down for some eggs and bacon, then.\" And with an understanding and appreciative look, Jim started packing the truck for the morning.\n\n~\n\nThey never really discussed moving back to per-yard rate, but Steve was nothing if not fair. Jim got his next paycheck to find that he had been paid per-yard as if they hadn't changed his rate at all. This meant not only did he end up with the better rate, but he even got some extra in his paycheck for the three yards worth of hedges he had done by himself. \n\nJim stuck around a long time, and ended up managing the crew after a while. He tells people that if you treat your employees right, they'll stick around. And that's worth more than a handful of pinched pennies.\n\n~~\n\nEdit: this was the mid-80's. $10/hr then was about $22/hr today.",
        "permalink": "/r/MaliciousCompliance/comments/8otvwa/the_story_of_steve_and_jim_i_want_to_work_by_the/",
        "comments": [
            "Steve is an amazing guy, the world needs more people like him. And I'm glad Jim learned a valuable lesson.",
            "The end is nonmalicious noncompliance!",
            "While I don't see the \"malicious\" part of it since the pay didn't change, he learned a valuable lesson about the business, and got extra money... this is a great read. Goes to show that there are still good employers out there who will look out for you which is always good to see. Thanks for the share!",
            "If I were Steve I would have prepared two pay stubs. One that breaks out the hourly rate as Jim would have been paid, and the real one. Then Jim could see how much better off he is.\n\nI was once on the receiving end of something like this - I hired a friend who has a contracting business to do some work on my house. He offered me a choice of paying hourly or by an estimated project rate. I chose the flat rate and he showed me a breakdown at the end which demonstrated that I was right to do so.",
            "Nice story, but why weren't meals covered for hourly employees? Was the per\\-yard people just considered \"varsity\" and received that perk? ",
            "That was...awwwww! I liked the ending!",
            "Wait, I feel like I'm taking crazy pills? If Steve is putting in so much effort to keep people's paychecks the same and consistent, why the hell isn't he just working 8 hour days at the same rate? This doesn't make any sense? Why wouldn't he pay Jim's food if he would get paid LESS to be hourly, this doesn't make any damn sense. ",
            "There are several concerning things in this story but everyone thinks it’s great so I guess I’m just crazy. ",
            "This was such a great wholesome Malicious Compliance story. Not that I don’t enjoy the regular ones, but this was such a nice surprise. :)",
            "So your friend pays landscapers minimum wage?\n\nHere in Phoenix, even the illegal Mexicans get $10 cash per hour (no taxes).\n\n",
            "Are you Steve, or are you just having an affair with him? \n\nAlso not malicious compliance.",
            " *if you treat your employees right, they'll stick around. And that's worth more than a handful of pinched pennies* \n\nSo many managers don't even begin to grasp that concept....",
            "Well this is a nice enough made up story. Only issue is there is no reason you have to pay minimum wage or not buy meals for your employees. So I guess if you want to be a dick and fuck with your employees that's cool. Definitely not like you could've sat down for 5 minutes and given him a real explanation instead of nope you'll make less.",
            "Came for the malicious rage...left with tears. Have an upvote, kind sir. ",
            "Hey u/Clickity_clickty! I have to ask did Steve pay these employees as independent contractors(1099) or as employees(w2)? It kind of makes a big difference.",
            "[deleted]",
            "Minimum wage to do landscaping, or $10 an hour (possibly) plus 2 cheap meals, maybe a $10-15 value per day. Landscaping is back-breaking work in the sun all day. And Steve is a nice guy. What the fuck am I reading.",
            "That was so wholesome!",
            "Reads super fake.",
            "damn that is the most wholesome Post I've seen in a while :)",
            "I come to this sub to laugh at the misfortune of others, not to shed a tear and regain my faith in humanity, dammit!\n\n",
            "I like Steve",
            "So....\n\nSteve was paying Jim less money in the end, but couldn’t buy Jim meals?\n\nWhat am I missing?",
            "Is $10 an hour a normal rate for that kind of work? I mean supermarket checkout teenagers get around $14 an hour. \n\nBut nice story!! ",
            "$10 is more than minimum wage for a laborer! Heck! I hate to think what minimum wage is. What country is this?",
            "This is more wholesome than malicious ",
            "Steve sounds like the kind of guy I'd like to have a beer with. Honest, hard working, salt of the earth type. Thanks for sharing this story. ",
            "r/BenevolentNoncompliance",
            "This was so wholesome.",
            "Damn, it comes out to around $10/hr for working landscaping? I did landscaping all throughout college and I started off (with absolutely zero experience) making $13/hr and by my senior year I was making $18/hr plus overtime. I don't blame Jim for wanting to try out hourly pay at all. The meal perk would be nice though, but I made my lunch every day and ate breakfast before I left for work.",
            "Steve sounds AMAZING. Seriously, this story made my heart happy! I've worked for so many employers who don't give a shit about their employees, just the bottom line. I'm happy to say after years, I've been with an amazing company that thinks like Steve for a year now. We had a woman retire 3 months ago, they had me start doing her work along with mine (insurance). I was happy to help, they are very good to me. After the first month I got a $3000 bonus. I was shocked and didn't expect that. Then the 2nd month another $3000 bonus. And then this 3rd month, another $3000. Most places would just make you pick up the slack. I'm so grateful for my \"Steve\".",
            "Great story.  Well written and insightful into the people's character.  Even a nice little surprise ending.  ",
            "Really the difference here is Steve makes all sorts of concessions for his per yard guys, but does not for the hourly guy.   \n\n\nFor instance you have 10 yards that day estimated to take 10 hrs...but you get them done in 8 hrs..naturally the per yard guys go home with a full wallet, but the per hour guy needs a concession, but only a moral one...the boss only need acknowledge the work done and money earned is the same let the guy go home early  whilst  giving him full pay...Moral of the story is either way can work as long as your not a stupid rigid prick. I am glad in the end both came out happy, but truly nothing gleaned here.   \n\n\nSame can be said for the fact the boss rearranges the calendar for the small, per yard crew..it's a concession he makes so that his method works that day, what about day 5 is that the day they work on the mansion lawn and are able to get one done...you see? Ohh wait I bet there some form of concessions made for the per yard people when that happens too....   \n\n\nMaybe I missed the part where its explained meals cant be bought for the hourly guy? Isnt that a perk/concession that is external to the \" per yard/per hour\" dynamic being explored, except for that Steve envisions that it must be that way?",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/benevolentdefiance] [The Story of Steve and Jim: I want to work by the hour!](https://www.reddit.com/r/BenevolentDefiance/comments/8ovszv/the_story_of_steve_and_jim_i_want_to_work_by_the/)\n\n- [/r/capitalism] [The Story of Steve and Jim: I want to work by the hour!](https://www.reddit.com/r/Capitalism/comments/8ow6jd/the_story_of_steve_and_jim_i_want_to_work_by_the/)\n\n- [/r/ctoccmhnapihghats] [The Story of Steve and Jim: I want to work by the hour!](https://www.reddit.com/r/CtOCCMhnaPIHGHAtS/comments/8oxg5i/the_story_of_steve_and_jim_i_want_to_work_by_the/)\n\n- [/r/wholesomecompliance] [The Story of Steve and Jim: I want to work by the hour!](https://www.reddit.com/r/wholesomecompliance/comments/8owkpy/the_story_of_steve_and_jim_i_want_to_work_by_the/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "I'm normally satisfied by a two-part decision/recoil from this sub, but this was quite a story.  Well done by all parties involved!",
            "This story made my day. It's just wholesome, there's conflict but both parties acted like adults and came to a beautiful conclusion.",
            "This is the most wholesome malicious compliance ever, your friend is awesome ",
            "The lesson lost in the modern workplace. I was managing a store a month ago with 17 direct employees and an additional 7 other employees. I was fired for asking to reduce my hours to return to school. Since my departure, there have been four firings and six quits. \n\nThe problem was that the owner is a huge asshole, and didn’t realize that huge part of my job with managing interactions between him and low level employees. He had absolutely no handle on his anger. ",
            "This was surprisingly wholesome. ",
            "This thread is off-topic- nothing here is malicious. Good story, though. Might need a new sub- misguidedcompliance?\n",
            "Ah, the days of $3.35 per hour minimum wage.  I remember them well, but not fondly.",
            "This story should be a country song. \n\nSteeeeeeeeve was nothing. If not fair\n\n*slide guitar solo*",
            "Where is the malice? This nothing but wholesome.",
            "One could argue he maliciously complied by treating him as an hourly worker (not paying for meals, letting him do extra yards alone) when he had no intention of really making him hourly.",
            "Hi steve! 👋",
            "This belongs in r/aww",
            "Did the guy ever get a paycheck that was on the hourly rate? What was his reaction?",
            "Isn't it the curse of \"may you get everything you ask for\".  \n\nWe've had people leave our company for .10-.25 an hour more somewhere else. Only to miss a day of work during the transition. ",
            "Why was there a difference and why would anyone pick the worst case?",
            "Damn, did it JUST get deleted? ",
            "wholesome ending to malicious compliance,\nGod bless their souls",
            "What a wholesome compliance, we could use more of these",
            "Not a lot of stories on this sub where nobody is a colossal asshole.",
            "This is the most wholesome MC I've ever read. It's like those stories you tell kids to make them hopeful in life/ attempt to make them more like steve/jim",
            "Took til you mentioned hedge clippers that I learned you weren't talking about getting paid every three feet, as in \"Want to do a few more feet after lunch? \"\n\nYou do people's yards.",
            "This feels too wholesome for this sub. Where's the dickhead manager? Where's the entitled employee? \n\nI come to this sub to laugh at the misfortune of others, not to shed a tear and regain my faith in humanity, dammit!",
            "Well good story but not MC. ",
            "I'd hardly call this malicious compliance, but it definitely is nice to see!",
            "Totally unprepared for the wholesomeness, i'm here to hate people and watch them rightfully suffer not this fluffy warm stuff",
            "Totally read this in the Mike Rowe voice.",
            "That's a much more upbeat story than one usually finds on this sub. Cheers to Steve 🍺",
            "I feel good after this story.",
            "Iv'e had employees on piece\\-rate before (similar to your yard pay). Allowing one to go to hourly could have actually messed everything up. Not only does piece\\-rate incentivise quick work, it makes teamwork essential because you are all paid by crew performance and not individual performance. If Jim had slacked off then it would have sewn discord amongst his crew that still worked per yard.",
            "I read this in a wholesome Texas accent. +1 great story",
            "This is a wonderful story, well written, I **love** it!!\n\n**This** is why I'm a frequent and loyal reader of these subReddits. The quality of the posts and the posters.",
            "Steve sounds like a top bloke",
            "My boss could stand to hear that last sentence a few dozen times",
            "I'm not sure this is exactly *malicious* compliance, but I love how it ended!",
            "This is a great turnout. ",
            "so much moral in this story, it's like a fairytale xD",
            ">Steve pays them for their work done by the yard, not by the hour, in addition to buying his workers two meals a day.\n\nAdding in the free breakfast and lunch, you'd be getting paid WAY more than $10/hr, plus you only have to buy foodstuffs for dinner and weekends. Shit, is he hiring?",
            "This was one of the most wholsesome threads on this sub I've seen. Neither party were dicks about the situation, handled it professionally, a little MC thrown in and bam, even a lesson gracefully learned. Good on them. ",
            "I need to show this to my boss.",
            "What an excellent boss. I'm willing to bet all my left socks that Jim worked even harder after that as an unsaid thank you.",
            "Steve is the person you look back and always wish you could have done more for. This guy sounds like such a great guy and he had been a Jim at one point too and remembered.",
            "Did I just read a script for a 1980's sitcom? Thanks for sharing friend. ",
            "I used to work a job that paid by the job. Except it was kind of a screw job on me, rather than a benefit by my employer. On the one hand, it meant he paid me a higher percentage for an install job than I'd get if I were hourly. Which meant phenomenal paychecks when there were install jobs out the ass. On the other hand, it meant when I was doing service calls and non-piece rate work, I was getting paid below industry standard. In the end, it all balanced out to an industry standard payscale, though, for most of each of the years I worked there.\n\nWe installed geothermal loops. Paying the loop guys a piece rate made more sense. It encouraged faster work. And, it generally took a relatively similar time to put in a loop of X feet long each time, with some variable for soil quality/type, weather around the install, etc. \n\nBut I installed the inside pipes. Which had absolutely no consistency to the length of the loop field. The best I did was a ten ton loop (1000 feet of pipe in the ground), that took me two and a half hours from start to finish. Paid me something like 20+ hours. \n\nThe worst, I did a three ton (300') where I was literally calling my boss to ask if the fact we had more pipe inside was an issue that took almost two days because of the length and complexity. \n\n",
            "r/wholesomecompliance",
            "This seems like it should be one of Aesop's fables",
            "Exactly how much money did Steve make off of Jim’s labor? Just curious ",
            "Love this story",
            "Who started cutting onions in here?",
            "Thank you for sharing. This was a nice story. ",
            "Nice story, this gave me a smile!",
            "I fucking love this story. The message Steve sent was IMO perfect correction of big pride when given the opportunity to mentor. ",
            "This was a great story in general, but also quite well-written. Thanks for sharing it!",
            "Steve and Jim are good dudes and this story deserves a wholesome upvote!",
            " This is one of the truest statements ever.  An owner, manager, and company is nothing without their workers,  everyone down to the smallest of jobs.  If you treat them like they are appreciated it'll ruin smoothly and you'll have happy,  loyal employees. Treat them like they're useless dirt and you'll have a revolving door,  drama,  and stress.  ",
            "Fuck, I’d go back to working lawn and landscape to work for Steve. \n\n\nSomething about being able to look at something and know it’s done as opposed to crunching numbers and hoping they fit someone’s narrative.",
            "This is a great story all round. Both Steve and Jim sound like fantastic people, and I'd like there to be more employers/employees like them.",
            "I want Steve to buy the company I work for ",
            "This is benevolent compliance",
            "Nice role reversal there! Usually it's the worker that maliciously complies with the boss (don't know if this counts as malicious though), but a refreshing change nonetheless.",
            "These stories are better than the normal stories one this sub. ",
            "This was perfect, and a good lesson. Wholesome, too! ",
            "That ending was satisfying for everyone.",
            "Wholesome asf",
            "I have a couple stories similar to this. But Steve sounds like a good boss and Jim a real fine employee.",
            "Worked Construction all my working days... I always endeavored to be like Jim and I'd say I was, but never of all my bosses was there ever a Steve",
            "> This isn't my story, but the story of a friend of mine I'm going to call Steve\n\n\nNice try, Jim ",
            "This was a wholesome story that I thoroughly enjoyed 👍👍",
            "If there were more employers like Steve the world would be a better place. I want to hug Steve",
            "Did this happen sometime this century?  The wholesomeness of this is so unheard of these days, this melts my cold little heart.  Let's all be Jims and Steves, please.",
            "I liked this story.  If you liked it too, I think you might like this movie.  \n\n\n[https://www.imdb.com/title/tt1172991/](https://www.imdb.com/title/tt1172991/)",
            "Sounds like Steve is a real jackass.\n\n\"Sorry Jim.  Since I am paying you less money now that you're hourly I will also have to stop providing your meals.\"",
            "I have 2 jobs.  One pool building where I get handsomely paid by the job, and one turf installing where I get fairly paid by the hour.  I love the pool job far more and the pay structure but unfortunately it’s only 5 months a year.   ",
            "Well written as a folksy yarn, good job",
            "Steve is an amazing boss, and Jim is a really hard worker. \n\nVery nice story.",
            "Why does this read like something my Dad would post on Facebook.  ",
            "!RedditSilver"
        ]
    },
    {
        "post_id": "mkddko",
        "author": "fmintar1",
        "title": "You want proof that I'm actually doing my business? If you say so",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mkddko/you_want_proof_that_im_actually_doing_my_business/",
        "score": 14304,
        "num_comments": 720,
        "created_utc": 1617600002.0,
        "selftext": "Edit 2: Thank you so much for all of the awards, I couldn't thank every single one of you. I appreciate also to some of the readers who applauded me to do this to a power tripping cops. While it is highly effective, I don't condone on doing it unless it's the last resort, like in my situation. I actually found most cops are extremely friendly and helpful to drivers. In fact, I got pulled over before for speeding 5 above limit on a downhill. The cop is extremely understanding, waived my ticket, & also gave me tips on the load that I carry at that time, which is a completely new information for me. The cop actually went beyond extra miles to educate me. I still have faith in humanity.\n\nEdit: For those who asked \"did I do anything on my log book during laughter?\" you all have asked the most important question, bravo. I did set it as \"Off Duty\" but did not put comment on it. I guess, in the eyes of my dispatch, it looks like I'm doing 1 minute of silence. I did get questioned by my dispatch and after thorough explaining, he too, did a 1 minute of silence.\n\nThis malicious compliance has brought to you by my trip from Chicago, IL to Los Angeles, CA.\n\nBackground: I'm an over the road truck driver and most of the time, it's more convenient for me to do my \"business\" on the highway shoulder. I don't have to drive around & around just to park to use the restroom. Just a quick 30 second emergency stop, do my business (either on the side of the road or empty bottles that I'm saving up [gotta do what you gotta do when you're on the road]), then off driving again. I'm sure I'm not the only over the road truck driver who have done these, it's very common.\n\nSide note: According to FMCSA, by law, we have to carry log books to calculate our driving & on duty time. This is relevant to the story.\n\nOn to the story:\n\nThis happened just a few hours ago somewhere in I-40 WB in New Mexico. I was suddenly in need to relieve myself badly, so as usual, I pulled over to a clean, wide highway shoulder, then I put my log book to \"Off Duty\".\n\nNote: this isn't my first time today doing my business.\n\nI have a habit of being very meticulous with my driving time. Which means, when I'm not doing anything, even for 30 seconds, I put my time in off duty. I tried to save as much driving time as possible, those multiple 30 seconds can add up to a lot to avoid doing 34 hours reset too soon.\n\nI looked at the passenger side window & sees multiple cars passing by. Turns out, there's a road where cars drive by on the side of the highway. Doing my business on the highway shoulder, nope! Instead, I did the alternate route, do it in a bottle, seal it, and stow it for trash later.\n\nJust as I finish doing my business, I heard a knock on my passenger door. Very weird, because this is at the highway shoulder, where no one should randomly be walking around. I stow away the bottle and go look who it is and it's a cop. I was thinking, crap, this isn't happening.\n\nI switched my log book to \"On Duty - Inspection\" and go answer the cop. Before I could say anything, the cop asked me to see my log book (it's part of their job to check whether we comply to the rules or not) so I show it to him. The graph looks like a heart monitor, as I was relieving myself probably 4 or 5 times per day (tiny bladder problem).\n\nThe cop questioned why I was off duty for 30 seconds to 1 minute every 2-3 hours almost everyday (electronic log book can be backtracked up to 14 days). I explained to him that I have to relieve myself every 2-3 hours, give or take. The cop didn't believe me and assume that my truck had a problem, that's why I have to stop every 2-3 hours. I repeated myself about my bladder issue but the cop still didn't believe me. Instead, he said:\n\n-Cop: Unless you have proof that you're actually relieving yourself, I'm afraid I have to give you a ticket for false usage of log book.\n\nCue malicious compliance.\n\nI told the cop to wait a moment and went back inside my cabin. I grabbed every single bottle of urine that I've been collecting today and the previous day (I haven't had the chance to throw it away), put it in a plastic bag, and for extra measure, grabbed the newest one out of the plastic bag (it was still warm). I showed the whole bag to the cop, plus the warm bottle, told him it's the newest one I just did a few seconds ago, and asked if he would like to hold it for further inspection.\n\nThe cop had the mixed look of disgust & horror. He was literally gagging, so I put back the evidence back inside my truck so he can recover. Then the cop says:\n\n\"I was expecting doctor's note or something like that. What you showed me was disgusting!\"\n\n-Me: But you asked for proof that I was, in fact, relieving myself.\n\nI was holding back my laughter so hard that my cheeks started to hurt. Then he gave me back my log book and told me to have a good day, then drives off. Have a good day, indeed!\n\nI took an extra 1 minute on the shoulder to laugh until I'm satisfied, then I'm off to drive again.",
        "permalink": "/r/MaliciousCompliance/comments/mkddko/you_want_proof_that_im_actually_doing_my_business/",
        "comments": [
            "Why would you carry around a doctor’s note that you have to piss? And that’s a pretty normal amount to piss if you’re well hydrated.",
            "Thank you for not being someone who discards their used bottles out the window while they drive.",
            "What did you log the laughing time as?",
            "Gotta love that the cop was really going to give you trouble over one minute for every two hours. That must be a hella quick fix sort of problem if it were really going to be fixed that quick.",
            "When you gotta go, you're gonna go! I always believe people when they gotta go lol. When you hydrate, eventually it's gonna come out.\n\nEspecially with tiny bladder syndrome, could get messy quick.",
            "Thats fucking funny, i do the same with my logs though. I stop for 1 min to piss off duty. I had a DOT inspection 2 weeks ago in Phoenix.  I was shocked when he didnt say anything about my off duty time. He got me on dirty grease on my axle plug. It wasn't leaking. Just dirt and grime on it.\n\nI drive sometimes up to 20 miles offroad for deliveries and it gets dusty being in desert. Its impossible to talk a company into weekly washes so dirty truck it is.",
            "\"Off Duty - Laughing too hard to drive\"",
            "Short breaks like that seem strange to me as an Australian.  If we want to record a break/off duty, it has to be a MINIMUM of 15 minutes, and must be a multiple of 15 minutes.  Stopping at the side of the road like OP would be easier to write off as work time, because you couldn't start driving again for 15 minutes if you wanted to count it as a break.\n\n14 minutes break = counts as no break at all.  29 minutes break = counts as 15 minutes break.\n\nThe balance must be counted as work time, so you might as well make it 15/30 minutes in the above scenarios.",
            "Truckers notoriously can end up with kidney and bladder problems amongst other issues. Idk how it would be odd to find out someone had to pee regularly if they were caffeinated or hydrated.",
            "In the Netherlands you probably would have been fined. You are not allowed to drive or stop on the highway shoulder unless your vehicle breaks down. Fine is €250,- (about $300,-) and is really enforced. It's especially annoying for truck drivers. Most are not allowed to drive in Germany on sundays and official holidays between midnight and 10 pm, so truck drivers try to stop on parking places as closely to the German border as possible, but there aren't enough of those. In the past, some would park on the highway shoulders. I believe that's one of the reasons the fine is so high (the other one is that this fine is also used for people who drive on the highway shoulder to avoid a traffic jam).",
            "[deleted]",
            ">-Cop: Unless you have proof that you're actually relieving yourself, I'm afraid I have to give you a ticket for false usage of log book.\n\nAlways remember - guilty until proven innocent!",
            "A doctor's note!?  \n\nWhat a damn rookie!\n\nA friend of mine was an EO, Equipment Operator, an 'Alpha Dog'  out in Iraq, on convoy security duty for the first time.       As an initiation, the Marines didn't tell him to bring an empty bottle in his HUMVEE, since convoys stop for no man.        So, Alpha Dog gets the call of nature, and she calls collect!        Without a latrine nor piss bottle, Alpha does the next best thing- he knocks on the boot of the gunner topside and demands, 'Switch with me!'.       Alpha climbs into the gunner turret; turns around facing the convoy HUMVEE directly behind him     ...and proceeds to spray them with yellow friendly fire.       Under orders not to break formation, all the Marines could do was turn on the windshield wipers and take the piss!",
            "Glad he wasn't pissy about it.  Getting older sucks, but ya gotta stay hydrated.  My adult daughter gave me a tiny brown book entitled, \"Poo log\" a few years ago as a joke.  Who knew some people actually logged them.",
            "\\*laughs\\* Oh, this is a beauty!",
            "Hey, so I'm just curious, because I genuinely don't know, but why would you have to be \"off duty\" for 1 minute to pee? \n\nEven if you do a 12 hour shift, and stop every 2 hours, that's still only like 6 minutes of 'stolen' time. \n\nIn an office you don't have to clock out to use the bathroom, and as your truck IS your office, wouldn't it be acceptable to use the toilet when needed? \n\nI can understand if you're taking a 20 minute shit every 2 hours. But for pee though...?",
            "[deleted]",
            "No. It’s evidence now. You need to keep it officer.",
            "I pulled over one time because I had to go so bad I barely made it off the highway. I stood in the itty bitty space between the cab and headache rack and took the best piss of my life. State trooper rolled up as I was sipping up. \n\n“Everything ok driver?”\n\n“Yup, heard a noise and just wanted to check the driveline”\n\n“Ok. Be safe out there.”",
            "LPT received and understood: always keep a bag full of piss bottles in the car",
            "I think that cop had it backwards, *he* has to provide proof of your wrongdoing. Innocent until proven guilty. I'm not saying he couldn't write you a ticket anyway, but it would have to be thrown out of court for lack of evidence (which, as a long-haul trucker, would be difficult for you to actually attend). Thank you for driving and relieving responsibly!",
            "Cue back to dumb and dumber where the cop took a swig of piss out of that beer bottle...",
            "This shit about needing a doctor's note to piss makes me mad. We are actually human beings who need to drink and piss it out to be healthy. Anyone not doing so every few hours is neglecting themselves. Your company isn't going to take care of you so you take it into your own hands and you need a doctor's permission suddenly? Sorry for the tangent this just gets to me. Nice story.",
            "What the fuck? Guilty until proven innocent? What a jerk cop",
            "What a pig. Going to punish you because he hasn't seen an accurate log before",
            "\"Pullover!\" \"No, it's a cardigan but thanks for noticing ...\"",
            "I too once used a bottle to relieve myself on a long road trip. I ended up putting the bottle away to throw away later. Unfortunatly, i got thirsty several hours later and it was dark. I ended uo taking a big swig off that same bottle somehow only to realize mid drink what it was! I ended up spitting all that out the window on the side of the road. It was disgusting and I have never used a bottle to do that agian, since then.",
            "Cop should just be happy you didn't show him the poop socks.",
            "Piss off😂",
            "It could have been worse, you could have showed him your log...",
            "That cop must not be a father if he finds piss in a bottle so disgusting that he gagged. \n\nEven so, how thin skinned is he? It's just piss in a closed container.",
            "Lol fuck that cop I love how you ruined his power trip with yick factor.",
            "Logged - \"Off Duty: Laughing at police\" I assume?",
            "As a manager at a travel center: I totally understand the difficulties of being able to relieve yourself while driving, even if you're in the middle of nowhere. You are also by far not the only one who uses whatever bottle or container they can to contain it...I'm sure I speak for every travel center staff member when I say, Please for the love of all things holy dispose of it properly and respectfully! We understand you do what you gotta do, and the only inconvenience it causes is adding extra weight to a trash bag..\n\nYou have no idea, or maybe you do, how many containers full of piss that are left BESIDES the trash cans or even just sitting at the fuel pumps. We don't wanna touch that!! \n\nI do have a hilarious story about a particularly full milk jug of piss that almost caused My GM to quit haha",
            "God bless you truckers!",
            "When a cop pulls you for 5 over the limit he's fishing for something.",
            "Why are vast majority of cops so blatantly stupid or ignorant?",
            "Okay, probably a dumb question...What do women truck drivers do? I don't see them peeing in a bottle very easily.",
            "Just don't use a Mtn Dew bottle",
            "This story could only be better if, after he handed back your log book, he looked at his hands with horror.",
            "\"show me proof or i'll ticket you!\"  \nshows proof  \n\"how dare you do that!\"",
            "You can get a portable urinal at about any pharmacy.  It has a handle and a wide \"mouth\" and a secure top that screws back on. Dump it out on the side of the road and rinse out how ever you can.\n\nEdit I remember finding these discarded bottles walking about with friends. 1 guy tpicked up a bottle . Saying\" beer! \" it was not beer. SMH stupid, stupid, stupid.",
            "Way of the road Bubs.",
            "Fucking way of the road.",
            "Serious question, as I used to work with truckers when the rules were changing.  Are you able to break your driving time up into chunks again or is it from the time the key turns, the clock starts?  I know in the 90's they could break up both their driving and rest times, so sitting for 30 minutes to be loaded didnt hurt them much, in the early/mid 2000's (?) I think there was a change that came down that started the clock when the turned the key each day, and it didnt have a pause?",
            "Good to hear that you're back on the road, Ray!!!",
            ">Unless you have proof that you're actually relieving yourself, I'm afraid I have to give you a ticket for false usage of log book.\n\nWow, that's really fucking dumb and wouldn't hold up in court",
            "Way of the road, boys.",
            "Piss jug alley \n- trailer park boys",
            "Tic-tac, sir?",
            "Was that laughing fit on duty or off? :-)\nGreat story.",
            "I once had a part time job at a video rental store years ago. There was no bathroom. There was, however, access to an attic where the owner stored the really old movies and he told me if I had to take a piss to climb up there with a soda bottle or something then toss it in a dumpster around the corner when I got off shift. First time I climb up there to take a piss I noticed several BK cups on top of one of the movie shelves. I get a bad feeling and carefully check... and yup. All full and no tops. I do my business and carefully climb down the ladder. I saw my boss later that day and told him what I found and I wasn't touching those cups of piss. \"Goddammit, Alex...\" Alex was the owners son that worked the store on the weekends. He left the store and was back 20 minutes later with rubber gloves and a bucket.",
            "You’re a hero",
            "Bravo OP!!!!! I applaud you, and would definitely give you a medal if I had the money TWT.",
            "i'd have insisted he hold the warm bottle as proof",
            "[removed]",
            "But did you log the extra minute of laughter?  I have to know...",
            "Skill test: don't pull over while using the bottles.",
            "[Way of the road buddy](https://youtu.be/Xb0bwbcfd28)",
            "Once every two hours is frequent urination?! When I'm doing work I tend to go once every 40 mins to an hour. I do sip a lot of water throughout the day though. Now I'm wondering if I pee wrong",
            "Me being English, I had to look up what an \"over the road\" trucker was. Long haul. It's long haul. Now I know.",
            "I knew a guy that worked security. He drove 12 to 16 hour nights. They had the schedule of logging in at each spot so tight that he couldn't stop to use a restroom. He would hold #2 until he went to lunch or got off work. As for #1, since it was his old beater he was driving, he drilled a hole in the floor, and used a funnel and hose.",
            "What sort of truck problem could actually cause a driver to stop for 30 seconds every couple of hours?",
            "I saw further on that you mentioned being new to the industry, so first off, howdy neighbor, and secondly, if you really want to save time, get a large mouth bottle or jug so you can piss while driving.\n\nAn empty gallon water jug works well. You can fill one while you're emptying another, and then dump it somewhere responsible, throw it out, and swap to a newly emptied one. Gatorade bottles work alright, too, but less capacity.\n\nIt takes a little practice, but it's the superior method because stopping on the shoulder is a bad idea. You should at least try to stop on the shoulder of a ramp, so you'll have some room to get up to speed, instead of trying to get back on the big road from a dead stop.\n\nOn that note, you're not actually saving yourself time, because you're still on the drive line while slowing to and accelerating from a dead stop.",
            "Fuck the police",
            "Impeccable form",
            "I use to work at a loading dock a while ago and the stories you guys (Drivers) bring back from the road are priceless!  \n\n\nNice one man! XD",
            "\"Well I don't know what I expected\"",
            "a round of applause for you, good sir. bravo",
            "You mean you can't piss in a bottle doing 85 down the highway? Rookie",
            "Father is a truck driver. I learned all the good pee spots on 95. No one ever believes me.",
            "Hilarious.",
            "I’m not checking but I hope you posted this in r/truckers!",
            "As a former resident of Albuquerque:\n\n1. \"I-40 WB...\" Who the fuck cares? It's a barren desert.\n\n2. That's the first I've seen a cop (not sure if it was APD or NMSP) ever give a damn about their job long enough to warrant that. I guess if you were speeding they wouldn't care to stop you.",
            "Piss jugs.  Just the way of the road bubs.",
            "\"way of the road buddy'",
            "Thanks for the extra info",
            "what type of bottles are the most convenient and your most common to pee in? I’m a female so I find this peeing in a bottle quite intriguing",
            "new mexico cops are a different breed fs\n\nsource: a new mexican",
            "Is that even legal for him to do? What law says he needs to fine you for wrongly filling out a log book? Like excuse me but thats a ridiculous law if it even exists and that cop is literally just trying to make money off you. And shouldn’t log book issues be something you take up with your job and not the government?",
            "Hope you are doing ok now :)",
            "You boys been doin' a little boozin' have ya? Suckin' back on grandpa's old cough medicine?",
            "Well done!! There’s so sick!!",
            "How screwed up is it that you actually have to do this to not get a ticket/be in compliance. You shouldn't need a doctor's note to take care of basic bodily functions. Keep on truckin brother.",
            "How did you log the time you spent laughing?\n\nDamn, now I need to pee.",
            "I was wondering how you managed to shit into a bottle until you said about your bladder.",
            "[removed]",
            "Just what size bottles are you using? I go through enough windshield washer fluid that I always have a spare bottle in addition to the one I'm currently using. I leave about an inch of fluid to keep it deodorized.",
            "high definition piss jugs",
            "How much time do you allocate for #2 in your “log book?”",
            "But did you go “off duty” to laugh?",
            "Is laughing on the shoulder on or off the clock?",
            "I'm interested to see how that works",
            "\"Am I being detained? Am I free to go?\" Ha! That'll teach him!",
            "Solid content right here.",
            "DOT cops are often a nightmare to deal with.",
            "My dad's a truck driver and he does that. He's never been pulled over for it though. I'm gonna have to read this to him lol",
            "Ray?",
            "How did you fill the 1 minute of laughing in the log book, thats what we want to know",
            "i have to say Falcon.",
            "Tic Tac, sir?",
            "if he had given you the ticket anyway would you have saved the bottles as evidence for court?",
            "Where does he think truckers use the bathroom when in the middle of nowhere/a highway?",
            "Rofl - Fellow trucker here, and I would have done the same exact thing!",
            "Way of the road, Bubs.",
            "Those cops hate it when you beat them with a legitimate log book",
            "You are the king, good buddy!",
            "I hope you did not forget to put you log book in order when you were laughing !",
            "I was really expecting this to be Lloyd and Harry Dumb and Dumber 2.5 LOL!",
            "It's It's way of the road Rick",
            "r/truckers would probably appreciate this",
            "Thanks for the story.\n\n&#x200B;\n\nYou should get your prostate checked. Prostate cancer, which is very common, can make you pee often.",
            "I wish you poured him a glass and handed it to him lmao",
            "So am I the only one that pees while driving into one of the xxxl  fountain drink cups",
            "First time I ever heard of someone 'pissing' off a cop and not getting a ticket.",
            "\"Unless you have a proof\"? What happened to \"innocent until proven guilty\"?",
            "Way of the road bubs!",
            "So you do your \"business\" and carry a \"log book\"? The 10-year old me is giggling.",
            "ACAB",
            "I was expecting a dumb and dumber scene where the cop takes a swig of it and starts choking.",
            "Wow! You can't even take a piss in usa without giving proper proof"
        ]
    },
    {
        "post_id": "cm3psi",
        "author": "Bawbag121",
        "title": "You want to finish late tonight and start early tomorrow? No problem",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cm3psi/you_want_to_finish_late_tonight_and_start_early/",
        "score": 14295,
        "num_comments": 264,
        "created_utc": 1564964044.0,
        "selftext": "Hi i drive charter tour coaches for a living, our industry is VERY heavily regulated, as it should be as we carry the most valuable of cargo, your family/kids/relatives, and if I fall asleep and hit your car, well you can work it out.   Now one of the rules is after a working day a minimum of time in complete rest must be given undisturbed...by law, this time can be reduced but only 3 times a work period (between 2 weekly rest periods... basically between your days off).  Another interesting rule is, by law, if your rest is disturbed, your rest must restart as though you have had no rest..this will be important later.\n\nIt sounds confusing, but I can have only 9hrs rest 3 times a week and the rest must be 11hrs, minimum, less than 11 complete hours rest period and it's treated like I had 9hrs only...even if it's 10hrs 59 mins.  Because of this most tour companies keep rest periods to 11hrs minimum, looking on the reduced rest as a \"just in case\" we get held up and get finished late etc, so we can start on time the next day and stick to the itinerary.\n\nNow we worked with one tour company, I'll call them mega-cheap tours, and their tour leaders like to squeeze every last bit of driving out of their tour hires, excursions all day to some out of the way flea pit, as long as the tour leader gets a kick-back, travel to hotel, then a dinner transfer and back to the hotel at night (none of it as the itinerary stated).  Most good companies eat close or in their hotel to allow the driver to rest, but for these guys, cheapest was best, and if that meant an hour there and an hour back at night...so be it, screw the driver, we are paying for him.  The reason for this is the tour leader got a kick back if they ate at the tour leaders \"favorite\" spot, and they had one in every overnight stop.   I had spoken to my traffic manager about how these guys just ignored the itinerary, and was told \"just do what they say, they are the customer\".\n\nNow I was working with one tour leader we will call him Wan, well known for not only working you to death but also stiffing you on your gratuities (he collected them from the passengers on the last day as we traveled to the airport  to \"help you\", sat behind you then placed them into an envelope,  an envelope you knew was light from experience). It's the last day of the tour, tomorrow I get rid of them all at the airport, and good riddance I thought, as the passengers are in an excursion, Wan comes to the coach.\n\n\"We need to go here for dinner tonight\" (passes me the address)\n\nI looks at the satnav\n\n\"wan that's 1hr 15mins away from our hotel tonight, you lot will be eating for 2 hours then an 1hr 15 back, then I need to shut down the coach and park it, i wont be finished until about 11pm\"\n\nHe looks at me \"i know the rules, you only need 9hrs rest, we will leave at 8am, plenty of time for a 2pm flight (international)!!\".\n\nHe was right of course, but remember that 3 times a week thing...he had already had me on short rest 3 times this trip owing to dinner transfers, not 9hrs but 10hrs something each time (this guy always pushed it to the max), it was at this point malicious compliance kicked in,\n\n\"Your right, i can work after 9hrs\"\n\nI changed the subject quickly as he smiled at me thinking he had screwed me over. Well the dinner transfer was worse than I thought, heavy traffic getting there meant I was late, which meant they started eating late, which of course meant they came back late, by the time i parked at the hotel it was closer to midnight.  I knew what was coming in the morning so phoned my 24hr traffic department, as I expected I was told under NO circumstances was i to break the law and run without my legal rest (massive fines for the company and for me if I did).   Normally I set 2 alarms when I'm on reduced rest as, to be honest, it takes it toll, and i need them to get up, but tonight....I set nothing, and took my hotel phone off the hook.\n\nI went to bed, I woke up to thumping on my hotel door there was the hotel manager and a very irate Wan\n\n\"You stupid driver, it's 8am, everyone is outside, checked out, with luggage, and you've slept in, get dressed and get the coach\"\n\nI smiled \"Wan, I'm on my legal break, we got back nearly at midnight so can't start to nearly 9, but besides, I've worked 3 times after reduced rest this trip and can't go anywhere until 11hrs undisturbed rest,  also you've just disturbed my rest as this gentleman can confirm (I was friendly with the hotel staff, they use the same hotels every trip and the staff hated Wens trips, as he never tipped..or rather his guests did through his suggestion, but he collected it to \"hand in\"), which means by law my rest period re-sets and starts again, but you know this, as you know the rules right?..., so see you at 7pm tonight..I'm cool for a late check out right? (I said to the manger who was nodding enthusiastically, knowing what I'd just done)\"\n\nWan's eyes nearly bulged out of his head...which was funny, \"Wait, what do you mean, we, we, need to get a 2pm flight\"\n\n\"I know\" i said \"Best start organizing taxi's for the 40 odd people out there, and next trip don't stitch up your driver\" As i shut the door on them both.\n\nI knew what was about to happen, within 5 minutes my own phone rang, the traffic manager, asking what time I finished the night before, then saying you can start at 9, until I pointed out the 3 late finishes...silence..then\n\n\"Well your right, but don't expect to be doing anymore of this companies tours, they will request we never send you\"\n\nI asked if he wanted me to drive without legal rest...I knew he wouldn't dare say yes, as i could be recording it.\n\n\"No you must take legal rest, this is the tour leaders problem, of his making if he had stuck to the itinerary's hours everything would be fine, just do me a favor and start at 11am...not 7pm, we need the coach back here tonight\"\n\nI knew when to not push it any further, and said i would be happy to start at 11am, and would start getting ready now and go down for breakfast.  An hour later I went down and saw Wan surrounded by angry passengers screaming at him with a phone to his ear, he saw me and came over\n\n\"Mr driver, please, i nor my company can get a coach to hire and it's 40 miles to the airport and our flight leaves in just over 4hrs, my company are mad I've not left you legal rest, and blaming me..please help me\"\n\nI couldn't resist\n\n\"Wan, if you use all those gratuities you have stolen from me and everyone else over the years, you will be able to afford to hire 10 taxis no problem and make the flight, but I would be quick about it, otherwise you might get stuck with 40 odd replacement flights as well as taxis\"\n\nWan gulped, eye bugle, and went white..all in one..it was funny to watch, and ran to reception asking for 10 taxis, what was funnier was when the taxi's showed up they said he needed another 4 or 5 just for the luggage (Each person had 2 massive suitcases), i just sat watching the show through the window eating my breakfast and drinking my coffee.  The staff thought I was a hero, and all smirked and looked on from their respective posts, i knew after this, no tips from the passengers would change hands and the cost of those taxis would hit his current fiddle bankroll hard (or so i hoped).\n\nMy boss was right, i never have nor never will do this companies tours again, it was quickly passed back I was not wanted, but Wan has never been back leading this companies tours either, my ex-colleagues (I knew my cards are marked as \"trouble\", and found another job with another charter company VERY easily) have told me that now the tour leaders are told by their head office to NEVER give the drivers less than 11hrs off EVERY night and factor this into any dinner transfers, if it can't be accommodated then no dinner transfer, and NO off itinerary excursions...period,\n\n&#x200B;\n\nTLDR: Got own back on tour leader using malicious compliance over-working me and stealing my tips\n\nEdit: Thanks for the Gold, my first ever\n\nEdit 2: platinum wow, thanks, and the silvers\n\nEdit 3: in the comments it has been stated I set him up and it was a dick move, well i saw it as his greed for a kick back set himself up...the itinerary said 9pm finish, this guy did this to me all the time.   He was supposed to (as much as me) be monitoring my hours to ensure the tour stayed legal, yes I could have pointed out the night before I needed 11hrs, but sometimes you just have had enough...so I complied and did as I was told.     As for possibly harming the passengers, making them miss their flight home, all this happened at 8am, 6hrs before their flight, if he had got taxi's then, which was what I wanted,  him to pay out money he wouldn't get back  (and he had the money on him plus to pay for those) they would have been at the airport before the coach would have got them there, no one was more surprised than me when I came down and they are all still there. If they HAD missed their flights, I assure you the tour company would have rebooked everyone on the next available plane...then came after my blood.\n\nAlso folks have got confused about the disturbed rest, why I didn't sit until 7pm, by the letter of the law I could claim this, and if wan had pushed it I would have, but I'm brave, not stupid, if the guy paying your wages says do him a favour and start at 11am after your first legal rest period...I start at 11am.",
        "permalink": "/r/MaliciousCompliance/comments/cm3psi/you_want_to_finish_late_tonight_and_start_early/",
        "comments": [
            "You know it's good compliance when company policy changes as a result. You're a hero",
            "Gotta love when you can pull that \"Federal Law\" out to slap down something stupid someone wants you to do. I drove over the road semis for a decade and the number of times I'd get called up in the middle of my rest break to split a trailer off with someone else two hours away...",
            "So are you no longer with the charter company or the tour company that contracted the charters service does not want to use you so your bosses put you on a different company's rotation?",
            "This is why you always thank the bus driver.",
            "As a hotel front desk manager, I applaud you for what you did. I have a special hatred for tour guides. And you did us all justice. Thank you so much, capeless hero!",
            ">\"Well your right, but don't expect to be doing anymore of this companies tours, they will request we never send you\"\n\n\nConsidering that they steal tips and try to screw over your rest time, not driving for them and only driving for respectful companies\nA sweet little bonus for following the rules",
            "I have been on similar bus tours (with much higher quality companies, fortunately), and the drivers have talked about how strict the rules are.  That tour company's days are numbered.  They're going to get one charter company or another in legal trouble, and the others are going to avoid them like the plague.",
            "I drove a school bus and I have also been a bus passenger to get to other cities. \n\nThe policy changes the company was forced to make had very likely resulted in a bunch of saved lives. One could have been someone I love.\n\nYou are a real life hero ..... seriously. Don't change.",
            "having been a coach driver in the (dim distant) past, I can really appreciate this story - well done \"working to rule\" and sticking it to Wan.",
            "I feel like you, the driver, should not be punished for this. You just followed the rules/law.",
            "Interesting. Tours I took always had two drivers to avoid exactly this type of issues and one drove while other rested. then again, if tour organizer is cheap they won't pay for second driver......",
            "As a fellow european truckdriver, the rest and driving regulations are strict but also necessary. Always fun to slap that in the face of annoying customers and sometimes your own boss.. \nYou did the right thing and I enjoyed reading it!",
            "As soneome that works for a company that supplies computers tobthe vehicles that shit aint no joke. The fines go into the thousands in a heartbeat. And the one mibute thing that is 100% correct.\n\nIf the driver for example moves his truck even 50 meters it shows on his card and hebhas to reset his full rest.",
            "What country are these bus rules for? Just curious.",
            "This was wonderful.  Thank you.",
            "Great read thank you!  Airline pilot here, I wish our rest rules were as good as yours.",
            "Sounds like Wan is a slave driver.",
            "Well done.  I'm not a bus driver, just a guy who loves road trips, and just driving a car all day can really take it out of you.  Even just the mental fatigue from a day full of concentrating on everything.  So IMHO those strict rest rules are entirely justified, as is sticking to them when you get pricks like Wan trying to squeeze you for everything they can.",
            "My friend is a truck driver who crisscrosses the nation several time per time out driving so I know the road rules very well you my friend are my hero and I will be sending your post to my friend who I know will laugh his ass off.\n\nI will say until I met him I never knew you can not drive over the Rockies with a trailer full of ice cream",
            "Love your laws, my father is a truck driver in Spain and I get crazy worried from time to time as he has to drive with little to no rest at all, the fines there are not so high for the company so they don't give a crap about the driver's health and they will continue that way as also when an accident happen you can't see anywhere in the newspaper if the driver has had all the rest needed, you just see that the truck rolled over, details of the trafic jam and not much else.",
            "I wish that law applied to OTR drivers. For us (at least in 2008, which is when I stopped driving professionally) the law was no more than 10 hours driving per day, no more than 14 hours of work per day, and absolutely no more than 70 hours in a 7 day period. Dispatchers loved to say things like....hey, you haven't been driving for 12 hours, you can legally drive now.\n\nThey ignore the fact that you had no load all day and are now expected to load up at 9pm and drive all night with no sleep.",
            ">  we carry the most valuable of cargo, your family/kids/relatives, and if I fall asleep and hit your car, well you can work it out.\n\n\nYou get a bonus",
            "\"I was told under NO circumstances was i to break the law and run without my legal rest (massive fines for the company and for me if I did). \"\n\nthis is good malicious compliance, but didn't you technically break the law by not waiting until 7pm? Or is the disturbance at the discretion of the driver to decide what counts as a disturbance?",
            "As a long distance truck driver who has similar laws, I salute you!",
            "Imagine all the people who died to exhausted drivers crashing because they were run ragged before that regulation was in place.",
            "I worked for a company that used to schedule me from 2:30pm to 11:45pm and they would have me  in the next day at 6:45am for 9 hours. You couldn't park on the property and had to be shuttled in from a different location. So I would get home around 12:20 or later. By the time I ate dinner and relaxed enough to go to bed it was like 1:30-2am. I would have to get up at 5:30am at the latest to get ready and drive to make the shuttle to work. Keep in mind the shuttles would leave at random times everyday and if you were late because of one it was your fault for not getting there earlier. I never understood how they could not only do that to an employee but expect a flawless work day out of them.",
            "Winning!!",
            "Noice! This was fun to read.",
            "Sounds exactly like a Chinese tour group.",
            "Please tell me that some of the passengers heard you talk about all the stolen gratuities, that’s just be the icing on the cake!",
            "Well done OP we all love and appreciate a safe coach driver!!",
            "To be honest I dont think this is great compliance as good compliance would have been to say to him at the point he asked you to do the transfer that \"I will require 11 hours rest when i get back from the dinner transfer\" so perhaps we should eat at the hotel. Granted Wan sounds like he is taking advantage of the driver this would have been a better way to go about it.",
            "Which tour company was this? Take 2 tour?",
            "Bravo.",
            "You think Kronos is bad, try ADP eTime",
            "Are you in the UK by any chance? Tacho hours very familiar with me!",
            "You, good sir, are my hero.  If you did that at the hotel I work at, I would upgrade you to a suite the next time (and every time) you showed up.",
            "So you're saying that he looked a little... wan?",
            "BOB: are you saying we shouldn't be helping our customers?\n\n&#x200B;\n\nCrappy boss: (in a regretful tone) n..no...",
            "Best story I've read all week.  I had a long discussion about this particular policy with a school bus/tour bus driver.  He told me about how he can't fudge the records to drive more now that everything is recorded electronically, but I thought he said he was due only 8hrs off in a 24hr period.  Could be wrong, but he was a super nice guy.",
            "That. Was. Glorious.",
            "This is amazing. Let poor old Wan shoot himself in the foot. I love how quickly he started begging.",
            "This is /r/prorevenge stuff",
            "Feels very r/prorevenge too",
            "I can only offer you an upvote, but, you Sir are very welcome to it.",
            "I have a question, how are you able to consistantly sleep for 11 hrs every day? I sleep for 5 to 6 hours and I am well rested and wired throught the day.",
            "That was a very satisfying read thank you",
            "[removed]",
            "That’s a big problem here.",
            "I like your style bud",
            "Damn that was a satisfying read. Glad everything worked out!",
            "Beautiful.",
            "You are my new hero!",
            "Dear my hero, you just reduce the bastard population, giving more learning to people who witnessed your action and thousands more over seas, all around the world just like me!\nAppreciate your action and thank you so much!",
            "May I ask which country this takes place in? It is in conflict with the bus laws I am most familiar with, though I do not doubt the story at all.",
            "This is legendary",
            "When I went to Trucking school, they reviewed log books and how the system worked and how you could fudge the numbers to make more money and drive longer. Then everything went to electronic and you couldn't do this anymore.  I had always wondered if something like this would happen. It was bond to happen.   Thanks to you I had the best read of the week and my question answered on how exactly that would go down. \n\n&#x200B;\n\nThank you!",
            "Wan sounds like the legal definition of Shitbird.",
            "Looks like the final score was... *puts on shades* \"Wan-nil\".",
            "Now i feel bad about the tipping, ive only been on one Bus tour this far but our tour leader also collected the tips for the day, including all hotel staff , restaurant and toilet atendants. we also knew that is was pretty low only 100 rupien per day if i remember correctly.. the only one we tipped directly were the tourguide, busdriver and his assistent ( not envelope, we were supposed to give it in the hand directly)..  what really annoyed me about the tipping part though was that we actually had been given a guideline  i dont remeber the exact numbers but  the busdriver was supposed to only get 1/5th of the tourguide and his assistent only a 1/10th.. the tourgiuide was running around in brandstuff.. we didnt comply with the guide  and gave less to the our guide and a bit more to the others .. ( i think 2/3 and 1/3 of the tourguide) sadly we didnt realise how badly we stiffed the hotel of tips until later..  so we didnt leave extra in the rooms, except one , as we thought it was taken care of..  \n on the other hand we gave our taxi driver double even after he got lost on the way to the hotel, his smile of gratitude and relieve was worth it (on a day we left the group for some shopping) :D",
            "You know you hear about that one time someone did something and now we have to make sure to follow the procedure.\n\n\nYou are now one of them legendary fuck up stories for years to come.\n\nIn time it will be interesting to hear how the story progresses or changes slightly from the original and probably most accurate version.",
            "Plural of taxi is taxis\n\nJu'st because there i's a letter `s` doe's not mean you s'hould u'se apo'strophe's",
            "> He was right of course, but remember that 3 times a week thing...he had already had me on short rest 3 times this trip owing to dinner transfers, not 9hrs but 10hrs something each time (this guy always pushed it to the max), it was at this point malicious compliance kicked in,\n\n> \"Your right, i can work after 9hrs rest\"\n\nNo offence, but at this point why didn't you tell him you already had 3 short rests this week? It sounds like you were just trying to be as sneaky to him as he was to you, and the people who would've suffered are the passengers.",
            "That is fantastic",
            "Unpopular opinion: you kinda screwed over all those passengers too in your desire to stick it to the tour guide. You knew he wasn’t a good guy, probably wouldn’t order taxis right away, add extra stress to the tour takers international travel, and potentially cause some to miss their flight.",
            "Justice boner",
            "You're a fucking hero",
            "Wan na get away?",
            "Creeper",
            "[deleted]",
            "Funny to think those passengers were making useless plans the night before since you already decided they wouldn't make their flights. I wonder how often flights get delayed because of people being dicks behind the scenes.",
            "You fired yourself. Nice job."
        ]
    },
    {
        "post_id": "tcc62o",
        "author": "BobertGnarley",
        "title": "Sure, the longest a customer will ever have to wait is 15 seconds",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tcc62o/sure_the_longest_a_customer_will_ever_have_to/",
        "score": 14283,
        "num_comments": 355,
        "created_utc": 1647074529.0,
        "selftext": "So I worked in a fairly large store that wasn't very busy until 3 pm, and only had 2-3 employees in the floor in the morning.\n\nWe were getting complaints from customers that they'd have to wait a minute or two at the register before getting checked out. We were always filling stock in the aisles and weren't allowed to \"just stay at the register\". \n\nManagement decided that the longest any customer should have to wait was 15 seconds before starting check out. As I always do when given tasks that contradict each other, I ask \"hey, what gets priority - getting our stock out or ensuring this check out happens within 15 seconds?\" They confirmed that it was the customer service and that it was a top priority.\n\nPerfect.\n\nI had my cart of stock and I was in charge of the register. My cart was about 7 seconds of walking time away from where I could view the register. So I literally walked for 7 seconds, checked, walked back for 7 seconds, which left me with a single second to do stock.\n\nNormally you can get a cart of stock out in about 30 minutes - my cart was still quite full after about 4 hours. Management came by and saw me walking back and forth \"barely doing any work\". I reminded her that what I was doing was top priority, and since I wasn't allowed to stay at the register, that I was accomplishing both my tasks in the most efficient way possible.\n\nThe next day the 15 second rule had been abolished.",
        "permalink": "/r/MaliciousCompliance/comments/tcc62o/sure_the_longest_a_customer_will_ever_have_to/",
        "comments": [
            "People these days, too lazy to clone yourself and be two places at once...",
            "\"Why are managers so bad at problem solving?\" is my real question.\n\nLike okay. You have customers waiting too long because your staff is all spread out over the store and nobody is at a register. You only have 2-3 staff to work with, but you want to cut wait times. You could do it stupid like in OPs story and just say \"get back to the register faster\", but it doesn't actually solve anything.\n\nSo how about this: one person is on register watching duty. Their stock cart should be filled with items that are within view of the register only. If there's restocking, part of their job is to check the other restocking carts and collect the items on the endcaps/shelves/whatever that have view to the register area.\n\nThey're going to cover a much smaller chunk of the store, but will also do the bulk of checkouts so it's all fair in the end. Maybe swap partway thru each shift to give the register guardian a mental break.\n\nIt's a little more work for the manager to get it organized, but then the problem is actually solved.\n\nEDIT: I'm aware of bells. I find them an insulting way to call someone and would use them as a last resort if I was managing a team in this situation. Seem like they'd be terrible for morale.",
            "a 1 minute wait wow that's quick. I work for a taxi company can you imagine the abuse I get telling customers it's a 20/30 minute wait",
            "This is a thing of great beauty.",
            "OMG.  I remember my traumatic retail career in my teens and early 20s.  \n\nRetail managers are the kings of contradicting orders.  I must've received at least 10 \"dive into that pool and stay dry\"-type orders on average, per shift.",
            "If this happened in America, this was definitely dollar general",
            "Wouldn't a bell at the checkout make more sense?",
            "Who are these customers, complaining about a one minute wait? Who does that? Who actually spends time and energy doing this? Your customers sound very entitled.",
            "[deleted]",
            "at my job management is so determined to turn our store into the shining that we have to greet everyone that walks in. when we were falling behind on that task (bc it's hard to bellow at the top of your lungs welcome in! when facing another customer as you're checking them out) they installed a doorbell on the automatic doors. the doorbell is so loud that people think it's an alarm indicating they've stolen something when they're just coming in. customers have also been complaining that it ruins the beginning of their shopping experience when they're greeted by the world's loudest doorbell and employees melting out of the woodwork to frantically greet them like puppies that have been left alone too long. we're not supposed to have this doorbell either. in fact one time my district manager visited the store, walked in the door, heard this loud af doorbell, turned to me and asked me if that was kind of loud (I had been hearing this doorbell for 6 hours minimum for a month). it took everything in me to keep my sarcastic answer inside. everytime upper management shows up for an inspection the doorbell mysteriously finds its way into a drawer until they are gone and then it's back on the door. one time a customer knocked down the doorbell and returned it to me fearing they were in trouble. I desperately thanked them for doing that and told them they saved us. there a mallet in the stock room that we get to use on hard tags that won't stop going off and I dream about using that mallet on the doorbell.",
            "So, basically the real answer is... they were understaffed",
            "This bugs me so much. I was an assistant manager at a dollar store chain. Consistently worked by myself but then got bitched at for not \"properly stocking\". Michelle I was here for 8 hours by myself and had to run to the register every 10 seconds. You don't want me to stay late so what the hell am I supposed to do?",
            ">The next day the 15 second rule had been abolished.\n\nIf only this were the fate of all stupid rules.",
            "This is the shit that happens when the people who don't do the work dictate how the work is done for the people who do.",
            "You know,if you learnt to hold the handle of a broom between the cheeks of your butt,you could have also swept the floor between walking back and forth. The fact you didn't learn is a failure on your part to support Management initiative. For shame. I guess no one wants to work anymore.\n\nBetter include the /s to be sure. Lol.",
            "Managers definitely at fault for implementing a policy without a change in process to ensure success. Instead of abolishing the 15 second rule (which should be a guideline not an actual timed event), they just need to implement a system where there is one cashier always at the register and use the intercom if a line starts and it looks like the guideline won't be met.\n\nIf you've ever been in a Walgreen's pharmacy and a cashier gets on the intercom and says an \"IC3\" code, it literally means \"I see 3\" people in the line, assistance needed at checkout. While it's ok I think to have a \"15 sec\" rule as a goal (as long as managers aren't being dicks and jump on the register themselves if needed) you have to set your employees up for success and not make it some veiled threat/punishment kind of rule or you get r/MaliciousCompliance",
            "I feel like the smarter solution to those complaints is just to have 1 person at the register at all times like any other store.",
            "It constantly amazes me how many stories like this there are on this sub. I love them... but at the same time, they always leave me scratching my head. How is it that there are so, so many managers that are simply incapable of predicting even the most basic of consequences to their decisions? \n\nI'm pretty good at predicting consequences, but not world- class good. So does that mean I'm just way above average intelligence, or does it mean I seriously overestimate what \"average\" is? Either version feels wrong to choose... but then there's all these dumb people in the stories. Hard to reconcile.",
            "So glad you weren't punished for \"That's not what I meant and you know it\" shit that middle managers are often so fond of.",
            "Whats more annoying is that they didnt want to pay an extra $50 to have one more person on shift.",
            "I love it when corporate people come up with these rules that do not work in practice and they think it does. And they get proven dead wrong and have to revoke it.",
            "Working in retail, I remember being the only one on register with no backup and also tasked with redoing an end cap, thankfully near the front of the store. Now, it wasn't super busy, but there was a consistent flow of customers needing to be checked out, so the end cap wasn't getting done very quickly at all. When I was pulled into the office for an official reprimand, I explained the issue but the manager wasn't having it. I tossed my keys on the desk, told him I'm done, and walked out. Felt good.",
            "The annoying thing is I love shopping at these times and don't mind waiting at the till (I find it relaxed, and I don't get rushed to unload on to the belt) but the poor checkout staff do call over from the Isle \"just be a minute\". And come over flustered and apologetic.",
            "I’m getting really big Dollar General vibes from this.",
            "Lmao sounds like Dollar General to me. Also not allowed to put something at the register to allow the customers to get our attention. Say, like a bell or squeaky toy. So stupid, dude...",
            "Seriously though, this is the best way to show management that stupid rules are stupid.",
            "https://www.gocomics.com/comics/lists/1720937/calvin-and-hobbes-duplicator-comics",
            "Fucking this. \n\nIn the early aughts I worked at home depot. They started 'power hours' where you had to stand at the end of your aisle from 9-11 and 1-4, then 6-9 and do nothing but customer service. No stocking allowed.\n\nI worked plumbing which has north of 5000 products. No manager (shared with Kitchen and Bath), 2 pt, and me, the FT. I worked mostly during the day from 8-4. \n\nWe'd end up with 6+ carts of returns piled up by the end of the shift that I couldn't get through because, hey. Fuckin power hour took up 90% of my workday. Got wrote up multiple times, both for working during power hour and having too many carts. \n\nFinally they fired me for having Swine Flu and didn't hire another FTer. Nothing changed till they replaced the manager",
            "A Multiple Success: \n\n* Got their walking steps in for that day, too\n* DURING working hours\n* While being paid for walking!",
            "*That* was their solution and not “have someone at the register”?",
            "Actually, if your \"cart was about 7 seconds of walking time away from where I could **view** the register\", then you were actually doing too much stocking work - unless \"where you could view the register\" was only 1 second away from \"where you could use the register\".",
            "Textbook MC. Excellent.",
            "you could become a personal trainer... must have jogged quite a bit there",
            "Dollar General?",
            "I hate working retail because of this. I don't know how to deal with clearly ridiculous rules. First, they give me a lot of anxiety (they just don't make sense!), and then, second, management somehow thinks that we can do these things effectively???\n\nI didn't get paid enough for the stress I went through and the work I put forth only to be told that I wasn't doing enough.",
            "Sounds like the dollar general in my town.",
            "not sure if your manager would like it, but the family dollar down the road from me uses a bell. They seriously only have 3 employees and the manager so when they need to stock shelves they put a bell on the counter with a sign.",
            "Do you work at a Dollar General? Cuz this was exactly what I dealt with there. But instead of abolishing the “check out as quickly as possible” rule (I think it was 30 seconds, but Idr), they just reprimanded you for not working quickly and efficiently.",
            "Sounds like Target.",
            "I shop at a really jukey Safeway sometimes because  it's  close  to my house. It's  in a pretty poor part of town...you can see women in their PJ bottoms and bedroom slippers. No matter how many people are in the line, there is always only one checker... \"take that, welfare broads!\". Go across town to the ritzy area and there is a checker at every register....be there a customer or not.\"How are you today, Mrs. Gotrocks?\" I resent this classism. You can certainly  tell a happy manager and crew...no ridiculous 15 second lag time. God bless all the hard workers  at mismanaged places of businesses.",
            "Funny and MC. lol",
            "I call bull - they would have fired him for being obtuse",
            "There should be a law which mandates that employees can either be on the register their whole shift or do other work in the store the whole shift. Not just in shops, but in all the other places too, like the bank. It's very frustrating when there is a line of 35 bank customers with just 2 available bank employees, and then, after finishing with one customer, the bank employee starts doing something else for 5 mins before calling the next customer in line. Or also in McDonalds, despite the fact that there are some workers in the back that you can see, there are clearly people who are making fries and icecreams while also dealing with customers, as if the work atmosphere already wasn't hectic enough. This is just very bad work organisation. To prevent the build up of longer lines, businesses should be forced to always have the maximum possible available number of staff whose only job is to deal with customers during that shift. But hey, that would mean that they would have to hire more people, and they certainly wouldn't wanna do that now, would they?",
            "This is the dumbest thing I’ve read on here",
            "Manglement at it's finest.",
            "That is kinda like what programmers do when clients whine too much without bothering to understand the issue.",
            "Thank God you weren't having sex",
            "A 2 minute wait!? *gasp* MY PEARLS!",
            "Mopped the floor with manager's own wet mop for brains",
            "[removed]",
            "I somehow doubt that your manager literally meant an actual 15 seconds on the DOT. She probably said that as a over-exaggeration of she basically wants you to do some stock and then every now and then go back get some people at registers and then after a bit go back do some stock. I doubt your manager literally meant that as soon as it was 15 seconds for a customer to be waiting that it was way too long and that they have to take a priority as soon as it's 15 seconds. When you asked they probably weren't informed by you that you were going to do what you did so they assumed that you prioritize the customers and then when the customers were gone or there's a decent break or even when there's just a few customers so that the other employee working could handle them all without any trouble that you would go and do your main job aka the stock.",
            "You got the rule abolished, which i applaud you for, but man you’re a drama queen",
            "Joann's?",
            "I'm pretty sure what whey wanted was for one person to remain in eyesight of the register and keep an eye out for anyone walking up to it, even when it was slow in the mornings.",
            "Catch 22..",
            "This sounds like Ollie’s",
            "Yup, companies would rather pay a manager 4 times the salary to watch 1 staff member do the work of 2.\nProgress.",
            "😅😅😅"
        ]
    },
    {
        "post_id": "gafw9v",
        "author": "vasco_",
        "title": "Want me to send out 2000 parcels to help grow my business? Ok!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/gafw9v/want_me_to_send_out_2000_parcels_to_help_grow_my/",
        "score": 14269,
        "num_comments": 251,
        "created_utc": 1588188620.0,
        "selftext": "In 2017 I signed for my webshop a contract with our national mail carrier to deliver my parcels. The more parcels the better rates you get. In my league they had a 1000, 2000 or 5000 parcel target contract. I went with the 2k one. At the end of year 1 there would be an evaluation, and they said they would be very flexible and reasonable because their priority is \"to help grow my business\". I actually had that in writing.\n\nFor any parcel I had sent through them beyond the 2k target I'd get a 50% refund of the difference between the 2k and 5k rate (e.g. 2k rate is 3,5 euro/parcel and 5k rate is 3 euro/parcel, they would refund me 0,25 euro back for each parcel above my 2k goal).\n\nOn the other hand, for each parcel I was short at the end of the year of the 2k target, they would charge me double the difference between the 2k and the 5k rate, on top of a flat rate penalty fee (so basically 1 euro per parcel I was short in the above example + penalty).\n\nEnd of  year 1 of my contract is 2 weeks away and I'm sitting at 1850 parcels. Thinking that 92,5% of my target is pretty good for year one, I gave them a call to talk about the extra charges and the penalty, and see if I could get the 5k rate for the next year as I was seeing / expecting strong growth. In the end it was their priority to help grow my business, and they are very flexible and reasonable.\n\nNo sir! They were dead set on me paying the penalty, charge me extra for the 150 parcels and on top of that they would set me back to the more expensive 1k target rate for the next year. Tried to escalate it but to no avail. So far for 'help growing my business and being very flexible and reasonable'.\n\nIn comes malicious compliance: I did the math and paying the penalty + extra charges was nearly double of what it would cost me to reach my target if I would just pay for 150 extra parcels out of my own pocket.\n\nI bought 150 bubble wrap envelopes dirt cheap, printed 150x stickers with my own address, put those on each envelope, drove to the mail office and dropped off 150 empty envelopes. Next morning the mail man arrives at my door with a grin on his face (he is a cool guy) and a stash of envelopes, wondering wtf I am up to.\n\nLater that day I called them to let them know I had reached my target and that I would not renew my contract. I signed with a competitor for about the same price per parcel, no strings attached  and did 17k parcels in year 2, which amounts to \\~50k euro in business they missed out on.",
        "permalink": "/r/MaliciousCompliance/comments/gafw9v/want_me_to_send_out_2000_parcels_to_help_grow_my/",
        "comments": [
            "I would have sent 149 empty envelopes to their office, and one with a letter stating “here, I’ve reached the target”.",
            "Hah., jokes on them - good job! What do you sell, sending out 17k parcels a year, if I may ask? And do you live off of if?",
            "This is well written and you did a good job explaining the technical contract language to make it easy to understand.",
            "Then u called them to let em know they missed out?",
            "Salespeople are always on about how \"flexible\" and \"helpful\" and \"caring\" their company is.  The problem comes when you truly need them to be any or all of those things and instead of a salesperson you talk to the billing department.  Billing people never take the sales training and think all of those things are a waste of their company's time and money.",
            "What did you do with the envelopes after they were delivered?",
            "Excellent. Amazing work.",
            "As someone who works for a large package delivery company I honestly wonder why someone would go for a contract like you had. Because the pay double the difference between 2 and 5k packages seems like an unnecessary and unreasonable noose for the customer. That might bring them a 1 time profit but would A. deter possible customers and B. create situations like yours that have customers leave after 1 year",
            "So they were gonna screw you for 150 euros + penalty fee? Seems like a paltry amount compared to the money they made from you for just 1850 parcels, and you wanted to spend even more money the following year.",
            "You should have added a cheap trinket, sticker or something in those 150 packages, and sent them to the first 150 customers on your list, as a thank you.",
            "Should have sent them to:\n\nMr Harry Potter\nThe cupboard under the stairs,\n4 Privet Drive, \nLittle Whinging, Surrey\n\nThat guy’s used to mail barrages.",
            "Amazing story",
            "Why do companies like this never understand that saying you're \"flexible and reasonable\", acting like you're trying to give a helping hand to the little guys, then turning around and clearly NOT doing those things means that NO ONE will ever give you repeat business unless absolutely necessary?\n\nThis is just dumb, man. Business is as much faith-based as numbers-based.",
            "thats some serious business growth! god damn",
            "Did you spend 150x 3,5 euro? rather than pay 1x150 plus a flat rate?",
            "Could you have just bought the postage for 150 packages and saved that postage for the next 150 parcels? Or did they actually have to SHIP 150 more parcels?",
            "2000 vs 17000. Things really took off for you. Congrats!",
            "I read a story about a deal with a parcel service that had basically the same system. However there was a loophole which did not take weight into account, it was just a fixed price for a certain size.\n\nSomeone calculated that sending bricks to a construction site using this system would be cheaper than using the conventional method. So they did.",
            "This reminds me of DHL.\n\nThe price kept going up because we just missed the minimums. As the prices went up, less customers selected DHL Express, so we had less shipments with them, which caused prices to go up.\n\nNow we barely do any business with them. Mission Accomplished.",
            "But why buy the envelopes? Cut up a few old cardboard boxes and stick mailing labels on the rectangles of cardboard. Or just use a third of a pack of copy paper. Oh, and you certainly should have mailed them to the company.",
            "[deleted]",
            "Thanks for the edit video, it's much clearer than the text",
            "This is the freaking soul of malicious compliance.  Good on you.",
            "That right there is the reason I only like to use U.S. postal and not a third party shipping company. Their prices are always cheaper, the service better, and they don't do stupid crap like bite the hand that feeds.",
            "Should have gone through your customer base and sent 150 of them a cheap thank you gift.",
            "This is really common in a ton of arenas, particularly SaaS, which is why it important to review new providers pricing tables independently. My first time seeing this was SalesForce, which at the time proved to be cheaper to buy 500 seats than 425 due to scaling, so for a long time we had 75 unused licenses until our company grew into it. \n\nLater, running sales and  marketing for a few SaaS companies, I would purposely build these sweet spots into our pricing tables, then let our sales guys know the \"hack\" they should treat as a super secret for companies that fell into it. \"Hey Bob, I saw you hit 751 licenses. You know, I'm not supposed to tell you this, but if you jump up to our 1000 license tier, your pricing will be the same as if you had just 700 licenses, and I can throw an extra 10% on that if you sign an annual contract.\" \n\nThis is not asshole design, it is merely a side effect of volume discounting that I've learned to exploit.",
            "As someone who manages logistics, I salute this awesomeness.",
            "Well done",
            "That video is very informative. I really learned a lot. Thank you!!!",
            "At least in the Android app, it shows the thumbnail for the video in the edit. \n\nIt's the best explanation I have ever seen.",
            "Want to see a socioeconomic breakdown of subreddits",
            "First thing i saw when i clicked into the post was a picture of rick astley, nice try OP ( ͡° ͜ʖ ͡°)",
            "Ok for real, how to stop it",
            "Damn OP way to beat the system & congratulations on the bigger year.\n\nDamn that was smart thinking on your part.",
            "Great! I love how businesses like that hurt themselves for trying to be clever.",
            "Well done, OP!",
            "Lel nice try OP but we can see the video thumbnail in your post",
            "If your business is growing this won't be the last hard commit you sign up for. I hope your takeaway here is: if you sign a hard commit you better expect to pay the difference at year end. That is literally what a hard commit means. You promised to send 2000 packages not 1850. A vague promise that they'll work with you means fuck-all.\n\nWhere I work we get lots of customers saying, please start me off at Tier 2 or Tier 3 pricing. We're going to spend a lot with you. I say, great, we'll put you down for a hard commit and then get you that pricing. They say hold on, I'm not actually 100% positive I'm going to spend that much so I don't want to do a hard commit. Guess what buddy - there's two people in this room and one of them controls how much you spend next year, and it ain't me. I'm not going to give Tier 2 pricing for Tier 1 volumes.",
            "“Big mistake. Big. Huge. I have to go shopping.”",
            "Good for you! Its all love and roses until you actually need something. Love what you did.",
            "Good job on the success and nice work sticking it to the stingy bastards!",
            "$2000 donation goal to go to a restaurant!",
            "Ok I watched it 3 times.",
            "Thats almost as good as buying dollar coins from the US mint. to get credit card points.",
            "That's so beautiful lol that's amazing lol",
            "Just, brilliant!",
            "Quick math",
            "Was it Hermes? This sounds like something Hermes would do.",
            "big brain used",
            "Your response to them was brilliant!",
            "I had a giggle fit after reading that.  Bravo!",
            "Cheers to your success",
            "This pisses me off these days",
            "The edit with the video fails for anyone who has an app that previews the first linked video/picture!",
            "Tell me why I clicked on the video even though I saw the picture above lol \n\nAlso 10/10 revenge",
            "It was the video that sealed my upvote!\n\nVery nice.",
            "[deleted]"
        ]
    },
    {
        "post_id": "k3b90u",
        "author": "RoseGoldFiend",
        "title": "Don't try to parent my children!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k3b90u/dont_try_to_parent_my_children/",
        "score": 14253,
        "num_comments": 332,
        "created_utc": 1606663989.0,
        "selftext": "I'm a nanny for a small agency and I love my job so much. Except when I dont... yesterday I took care of a 4 year old girl,   a 2 year old boy, and a 5 month old boy. \n\nI was there yesterday and I know kids at this age have enough energy to make the world stop spinning and they tend to not listen... but damn these kids were TERRIBLE. No control of themselves at all. There was paint on my dress, I was hit by glass cups and plates were thrown at me. Glasses covered in jelly. Kids were purposefully coughing in my face and I had some spit on me (I think they were sick too ugh)  needless to say my first thought was a shower and a hot meal. \n\nI lost my cool and I had to issue timeouts and separate the kids when they fought. Cleaned messes. Shield the infant. Take toys and TV away from kids and not allow them to choose movies. I record these so the parent know what happened.\n\nI always try to keep a positive outlook every day. Smiling and being super nice to everyone and ask how they are. I do this, and the mom told me when I first step in her house, was, \"do NOT parent MY kids. YOURE NOT THEIR MOM!!\". I was taken aback and wanted to be petty. So I said \"aight\". Mom left to go to work and I am currently letting the kids go ham in the house. There's a mess everywhere and I'm not even being bothered. Hit me with a glass? I hope it breaks and MOM can pay my medical bills.\n\nThe 5 month old is really the one I'm caring for at this point and I'm making sure he's safe. He's being cute af right now.\n\nI have yet to be done with my shift as I type this. The house looks horrid, there's a red spot on me from a kid hitting me, I am covered on coughs and paint and markers (thank the gods for washable shit). I'm not parenting them.\n\nI hope the mom enjoys the mess when she comes home.\n\nEdit 1: yall are amazing! Thank you for the awards! And the comments are making me ugly laugh!! I will absolutely be posting an update when I get home.\n\n--UPDATE--\n\nmom came home and was APALLED at the house. The cut on my hand (from me being stupid on thanksgiving) was torn back open because of kids and it needs to be patched. My hair is covered in peanut butter. My leather shoes will need to be cleaned and polished. Theres literal shit on the walls! And so, so,, so much more that happened. And I put the baby to sleep and walked out. Mom screamed she's gonna get me fired. I said nothing. She also followed me to my car saying she will pay for the damage to her home and the maid service. I'm not worried tbh\n\nShes being blacklisted by me. Never again am I going back. I need to take a nap and a shower and I need some mac n cheese lol\n\nUpdate 2: was on the phone with the agency and the mom. The family's contract is being voided and I'm being paid more than the extra money they were giving me. Plus the mom will pay for my medical bill to patch up my hand, cleaning my clothes, and clean my glasses\n\n Edit 2: some of you are concerned about the coughing. I had a rapid test done today while the doc was fixing my hand. I'm negative! \n\nEdit 3: Some of you have expressed concern about the incubation period. I will be self monitoring and getting a second test next week. Until then I'll be isolating as much as possible. I had it once and it sucked but at least I know exactly what to look out for symptoms wise.",
        "permalink": "/r/MaliciousCompliance/comments/k3b90u/dont_try_to_parent_my_children/",
        "comments": [
            "Do you have a rep from your agency you can contact preemptively,  letting them know of the the explicit demand of the client prior to the fallout?",
            "Sounds like the kids have learned their attitude from mommy dearest. \n\nLooking forward to the update, but kinda sad I won't get to see her nuclear meltdown in person.",
            "So I'm wondering if you're the first person to ever just let the older kids in that house run rampant and not clean up after them? (Which I think was a brilliant reaction to AwfulMom(TM) yelling at you not to parent them, btw.)\n\nI'm just wondering how much of a shock it was to her to see the chaos they really create if the nanny actually follows her idiotic instructions. \n\nI suspect most people she's hired did their normal job and then blacklisted her after the fact. Whereas with you, she finally got to experience the true consequences of her actions. (Or her inaction, since clearly she doesn't parent them herself.)\n\nI feel sorry for the kids, but mostly I'm really glad that your agency backed you up. \n\nI hope your mac & cheese was fabulous! 🌻",
            "Hey, just remember that people like you are the pedestal to our society, no matter how rotten, entilted, and petty other people are! You know what? Sometimes it is okay to stay petty, just do not give up! I am 100% confident you are doing a great job! :D",
            "Oh, so looking forward to the update... I'd go so far as to record her \"precious babies\" ruining the house. I'm petty.. and evil, So I'd add a quip about, \"Boy, i hope the maid is paid well. This is a mess!\"  \n\nGood on you for already telling your agency about this bat-shit-crazy lady and her hell-spawn. I hope you can relax when you get home, cuz holy hell on a ritz cracker, you deserve it.",
            "I am a nanny. I truly feel I can say from all of us, thank you!! I know we have all been there with that one nightmare family at some point, am I right?\n\nI very recently landed what I always dreamed of working in this position. Reading your story seriously made me have flashbacks of the absolute entitled, negligent parenting I have *had* to put up with in the past that I know is tragically oh so common. It is never okay to be hit, accrue damaged property of your own and then be reprimanded for doing your job. That client was describing a babysitter, not a nanny. There is a serious difference and frankly I'm gleeful her ass got blacklisted. Her behavior clearly indicated she is not on the level to handle having a nanny, they are far above her skill set and level of decency to respect such a contract with someone.\n\n I wouldn't hand more people over to be abused by her entitlement either, so kudos to your agency, for real! Many nannies I know are private hires and unfortunately you can get some 'lemons' before finding the right match sometimes. It's awesome you have someone to back you up while you stand up for us all!!",
            "That physically hurt to hear \"dont parent my children\"....but your a nanny?...otherwise why would they hire you? If it was to clean house a butler or maid would have been more suitable but....either say good for you.",
            "it's amazing that she's actually being held accountable for her/her kids' behavior, but picturing you covered in marker and peanut butter walking out of there like a queen is the best part of this",
            "It's astounding how many \"parents\" have that \"Don't parent my children\" mentality.  Kids don't require boundaries and discipline only when their life-givers are present.  Plus, there's a reason for the idiom \"It takes a village to raise a child.\"  But if more parents did their jobs properly, other people wouldn't have to.",
            "This reminded me of a nightmare when I was babysitting two monsters that was more in need of a jail guard or animal handler. Some kids really need parenting, and yet all they learn is \"you are not my parent\".",
            "Record this shit treatment",
            ">The family's contract is being voided and I'm being paid more than the extra money they were giving me. Plus the mom will pay for my medical bill to patch up my hand, cleaning my clothes, and clean my glasses\n\nThis should be the minimum.",
            "What country is this in? Though I expect it applicable to most",
            "As a former nanny, you are my absolute fucking hero. Take my free silver given in tribute to your amazingness. You did what we have all wanted to do at one point. Thank you for vindicating all of us in this one act of malicious compliance.",
            "Good for you on all counts! Yelling \"do NOT parent MY kids\" to the person whose JOB it is to parent your horrible demon-spawned kids? That woman has a mental block the size of Gibraltar.",
            "Yes! Please update us with how mom reacts!",
            "Get a regular test in a few days. Rapid tests are only 50% accurate and you are still in the incubation period, so you could have had a false negative.",
            ">the mom told me when I first step in her house, was, \"do NOT parent MY kids.\"\n\nAnd I would have said \"All right m'am, I'll inform the agency that you don't require our services after all\" on the way back out the door.",
            "\"Don't try to help me in raising my kids! Also, can you help me raise my kids?\" Does that Karen not know how a nanny works?",
            "Bookmarking for future fallout",
            "[removed]",
            "I'm glad you are utilizing the CYA method and I'm really looking forward to the update!",
            "Yikes. Report the cough to the local health agency.",
            "You are a wonderful person. I would do the same and when asked about why I didn't do anything \"you told me not to parent your children so I wanted to respect your wishes. Here's a list of all the things that were done today. I have already contacted the agency so I won't be back. Have a great evening.\" And walk out without another word or giving her a chance to say anything.",
            "\\*Sigh\\*, this was removed by the Automod when I posted it the first time, so I’ve modified it slightly:\n\nJust a heads up, a negative test for that thing going around killing a bunch of people (but which I cannot call by name) on the same day as a possible exposure doesn’t necessarily mean you don’t have that thing. Sometimes it’s detectable that early, but in my understanding it isn’t always.",
            "Bahahahah when the client doesn’t realise they’ve pretty much just told you NOT to do what they’re paying for. Might as well have been her telling a workman installing a new front door “DO NOT TOUCH MY HOUSE” and then being surprised when the door isn’t actually attached.",
            "[deleted]",
            "Oh my good god,  I had the EXACT same situation. A mom who would not ever let me say no to her 3 and 5 year olds, while they tore up the house and terrorized me. One was so bad that she had gotten kicked out of her elementary school, and the mom still never insisted on saying no. \n\nI ended up with bite marks and a child who threw a tantrum. I left and never came back.",
            "If you were exposed yesterday/today, even a rapid test wouldn't say positive until a few more days from now.",
            "The fuck does the mom do for a living?  Walk into establishments and scream to speak to managers?!\n\nI'd be so fucking appalled if I found out my kids acted like this!",
            "These kids in the middle of that mess need to be on a poster with the headline, \"Use birth control, or this could be your future\"",
            "\"don't you dare parent my kids!\"\n\n\"Well alright but somebody should!\"",
            "Is it not part of your job to clean up the house or just take care of the kids? I believe she will say: \"look at the mess! Why didn't you do anything about it?\" \n\n\nGive us the update when she comes home.",
            "Seems like a training film is needed before watching those kids.  Luckily \"The Omen\", \"The Exorcist\", and \"The Children of the Damned\" are all available.",
            "Whoa this is beyond nuts! Glad your agency took your side.\n\nThe cherry on the top would be for the “mother” to find this post :D",
            "I can't WAIT for the update on the moms reaction.",
            "Good on you and good on your agency for backing you up too",
            "I do love how your agency had your back!!",
            "So so glad your agengy has your back on this one. Enjoy your Mac N cheese!",
            "Wow,  the sheer audacity of this woman. No wonder her kids are out of control.\n\nShe needs to step up and start acting like a mom while the kids are still young enough to have this behavior corrected",
            "You are a hard-core champ. You offered that \"mom\" a hot steaming shitty plate of reality about her miscreant children. You win.",
            "I hope you survive your work day, and I'm so excited to see the results when Mom comes home. Can't wait for the update!",
            "Please get tested again in a week. You’re not “Negative” until the second test.",
            "Can I ask a couple\nOf questions?\n\nYou went there the first day and  it seems you tried to “manage” them .  Did the mother flip out when she read your list and  considered you were trying to parent them by trying to keep them from destroying the place  ?\n\nI can’t believe people would act like this towards you . \n\nI raised my kids and  have grand kids and I just shake my head when I hear parents say they can’t believe their child would do the or that . The one that really gets me is parents saying their child wouldn’t lie.\n\nI hope this is a wake up call for her",
            "PLEASE update us later",
            "Yeah, an update is definately needed. \n\nGood luck with the crotch goblins!",
            "Satisfying update",
            "Honestly, you have my vote just for your ability to keep the toddler alive in that situation. Mad props love",
            "Clearly she isn't parenting her children either",
            "Just glad you came out safe from it.\n\nUnreal that you couldn't win from \"parenting\" and \"not parenting\".",
            "Well, at least SHE gets to take care of her kids!",
            "Hey, she said not to parent her kids. You didn’t. It’s her fault her audacious children ruined the house. If she actually patented her kids, maybe it wouldn’t have happened.",
            "This may be my favorite “don’t parent my kid” Malicious Compliance story now.",
            "I agree with what most of the other people said, these kids are clearly entitled brats with a mother who won't parent them or let others do it.\n\nWhich kid smeared the poop though? If it wasn't the baby specifically report this. It's a sign of molestation for older kids to play in poop, and I assume a nanny has some sort of obligation like most child car workers to report these signs.",
            "That house screams of a severe lack of parenting. Some people just should not breed.",
            "I hope you are now in a better shape compared to that experience. P",
            "I drive a school bus, and I greatly empathize with you.",
            "Great story! Glad for the happy ending too. Hope you get some families that don't suck in the future",
            "Wow. This was satisfying af to read...especially the update.  What a shit show that household is.  I shudder to imagine those kids as entitled adults..Karen’s and Darens ( or Ivonkas, Donnies and Erics). Ugh!!",
            "tell me about this after ward ok?\ni want to hear the full story",
            "Glad to hear you're being reimbursed. No one deserves that.",
            "Thank you for doing what you do! I hope there are a lot of parents that are grateful for your help during this pandemic. You rock!",
            "Saying not to parent the children, and not even giving you rules or guidelines, they really are asking for just a whole bunch of crazy. I would have just said to them what the mom said and then said you were only going to take care of the baby.",
            "Mac n cheese you say? Try boiling elbows and using tostitos queso for the cheese (microwave the queso in a bowl first). Some bacon bits and a bit of buffalo sauce can especially spruce it up, but they aren’t needed. You’ll never want regular Mac n cheese.",
            "did the mom deny  that her kids did that?",
            "These are the parents that say, “You are making mommy sad, do you want mommy sad?” and the kid will say anything to get mommy to shut up so they can get back to their fun.\n\nKids need to learn that consequences will come of their actions.",
            "Me: If they misbehave....punish them...*evil smile at kids*",
            "Hope you find a better family that’ll appreciate the work you do, too bad for those rotten kids.",
            "Those poor kids are going to live a hard life because of her. How was the father's reaction?",
            "OMG pls let us know what she said when she got the phone call saying she was responsible for this whole mess 😂😂😂",
            "If you do start having symptoms, get another test!",
            "I would have given the kids so much sugar and bought them whistles and loud toys. Blocking the ladies toilet would also be fun and putting nappies(diapers) in her bed",
            "That is horrid. You are there forlight parenting and keeping the house in order. Screw her. Glad you don't have to deal with them anymore",
            "These types of parents are the worst...",
            "Awesome! Next time you could also call the mom every five minutes and say “they are doing so and so and since you don’t want me to parent you will need to correct them” haha. What do people expect?! I have two kids and to tell a caretaker not to parent is ridiculous!",
            "I feel for you, I feel for their future teachers and classmates as well. What a mess!",
            "Nice!  Really good job explaining and giving us a play by play with updates. That’s what sucks me in!",
            "Poor kids, they're being cheated out of everything they need to grow up to be okay adults with a mother like that.",
            "This is my favourite ever malicious compliance!",
            "Wow, just wow on how parents can hire people and expect them to NOT do their job.\n\nI hope your agency is connected like a lot of other industries are with other companies and get that lady blacklisted with all of them.",
            "My kids are 4, 2 and 5 months old, though they are boy, boy and girl respectively. \n\nWe expect people to correct any blatant misbehavior since we know we can’t be always there when they fuck up, nor leave the door open to make them feel like they can do whatever they want when we’re not around, specially given we’re not teaching them *our* rules, but society’s. \n\nSince we’re grateful for people helping us with this, it feels so strange to read “don’t parent my kids”. \n\nFrom a parent, thank you for caring.",
            "Have to wonder how she *didn't* notice her kids are like this before... unless she's either:\n\n* never actually been around them and just has a rotation of nannies before they give up\n* spoiled them rotten and just gives into their every impulse, and expects the nanny to do that too, knowing full well what happens (but if this were the case she wouldn't yell at you when you do precisely that?)",
            "I find it hard to believe that a nanny agency wouldn't have an explicit contract that states that nannies are both authorized and responsible for reasonable discipline for the kids.",
            ">She also followed me to my car saying she will pay for the damage to her home and the maid service. I'm not worried tbh\n\nShe said she would, or was she demanding that you (and the maid service) pay her for the damage to her home?  I'm not sure if she was still being an entitled parent, or realizing the reality of the situation and becoming desperate for another chance.",
            "I'm thankful for birth control",
            "Use all your footage and create a short called \"Raising Karens\"",
            " You sound awesome! i wish i had help like you when mine were little. i couldnt afford it, by omg would i have loved level headed parenting help when i was not with them. what is wrong with people? you keep being great and focus on good families.",
            "Get it, girl!",
            "Thank you for what you do.",
            "You are an absolute baller.",
            "This made me have a good laugh. \"Don't parent my kids\" \"sure thing lady\". What the fuck did she expect? For you to just clean up as they wreak havoc? I feel sorry for those kids tbh.",
            "I’m glad the agency had your back. I know this mom probably won’t learn her lesson but I hope she one day soon realizes she’s failing her children.",
            "I... I am so confused... Why would you even hire a nanny if not too PARENT the kids when the parents are away? Maybe I'm missunderstanding the point. But thought that was well the literal job.",
            "Can you give more specifics on some thing, mostly what the mom said. Did she specify what she had an issue with? Was it just being authoritative in general, or was it about something specific?, like trying to explain sex or religion? What did she say on the phone? His did your agency respond? Not just the outcome, but the details of the call.",
            "I am so, SO glad your agency has your back! That woman is infuriating. She clearly doesn't actually put the effort into parenting, but then gets mad at you for enforcing reasonable boundaries!? \"Parenting\" is literally what's she's paying for! I hope your next 1000 clients are 1000x better than her...",
            "\"don't parent my kids!\" Somebody needs to...",
            "Props for the handling.\nShame about the house but hope you covered your back, 10/10 for malicious compliance btw, nailed to a tee.\n\nAlso hope you don't get anymore like this",
            "Sigh......\n\nIf you don't want someone else to parent your child, then YOU SHOULD PARENT YOUR OWN CHILD.",
            "Perfect response, glad you got justice. As a parent, I learned early on with sitters to make sure they knew how I wanted my child to be disciplined, after a sitter made my son stand in the corner with his nose against the wall for half an hour. I was pissed.\n\nTimeouts, loss of privileges? Totally normal and reasonable consequence for being a little brat.",
            "You're gonna get fired lol",
            "Yeah, that's a downvote from me... getting spit/coughed/shit at and getting bruised to the point of an old wound reopening ist not malicious compliance for me. That's just stupid.",
            "Omg I feel for ya. I used to babysit for a bunch of strippers in my teens ( great pay and insanely well behaved kids) and I got stuck watching a friend of my siblings kids while she bartended. The dog left me wounded and I had to cut inches off of my hair and I quit babysitting altogether afterwards lol",
            "Only thing I would have done different was get the \"Do NOT parent MY kids. YOU'RE NOT THEIR MOM!!\" in writing or a video.",
            "This wasn't small,but kewl",
            "I was a nanny is can be a nightmare",
            "Ummmm..... isn't a nanny more or less a substitute parent?  I mean, you don't teach certain things (like religion) without the okay of the actual parent and try to support the messages mom and dad are giving the kids, but feeding and caring and so on is pretty much parenting.\n\nNTA",
            "I am 71 years old. When I was a kid growing up in a small mid-western town, every neighbor would watch out for everyone's kids. If one neighbor, for example, caught you picking her flowers she would paddle your butt. Your own parents would also spank you when you got home. Almost all of the adults of my generation grew up to be law-abiding respectful citizens. It does take a village to raise a child, but adults need to teach children to obey and be responsible. Moms like your pediatrician are raising narcissistic sociopaths, but won't realize it until too late.",
            "gotta love the slow parents",
            "Some folks should not breed.",
            "The only thing you did wrong was come back the second day. From a legal aspect, you are liable for the damages.",
            "Have another test done in 3-5 days",
            "Your job was to take care of them, not parent them. Obviously women hate eachother",
            "You're an actual hero. Please stay awesome. Don't let toxic people change you.",
            "OMG! I was looking for another post, and came across yours! Seriously - WTF! If those were my children and they did that to my Nanny (I don't have a Nanny - or kids) my children would be on a time out for the next 365 days! This is a salutary lesson and aptly explains how young children (rich and poor) grow up to be entitled self absorbed brats in adulthood!",
            "That parent is lucky the house was still standing and the roof still on when she got back from whatever she as doing"
        ]
    },
    {
        "post_id": "80cif0",
        "author": "MisterDerptastic",
        "title": "Dont worry I made sure to get a receipt this time",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/80cif0/dont_worry_i_made_sure_to_get_a_receipt_this_time/",
        "score": 14255,
        "num_comments": 622,
        "created_utc": 1519646301.0,
        "selftext": "My dad gets sent on business trips fairly often. As with most business trips, all of his expenses are covered. When he has to spend money during the trip on things that can't be paid in advance, he gets reimbursed by the company when he gets back and lets them know what he spent and what he spent it on. This is just stuff like the hotel, food and transport.\n\nDuring one of those trips, he was staying in a Swiss hotel, taking a plane back home the next morning. As he leaves the workplace, they ask him if they should order him a taxi for the next morning to get to the airport, which is about 50ish km away. My dad replies  that its a 5 min walk from his hotel to the train station, so he'll just take a train to the airport instead.\n\nHe does, and a few days later he gets a call from whatever finance departmant handles repaying expenses. They ask him if he's got a receipt for his train ticket, because otherwise they can't cover it.\n\nDad replies he only has the actual train ticket which has the price on it but thats all he has, you just buy it at a machine in the station and all that you get is the ticket, there is no receipt. So the lady at the phone tells him they can't pay him the cost because he doesn't have a receipt.\n\nSo a few weeks later, he's back in the exact same spot, and when they ask if he's going to take the train again, my dad goes 'no can do, I dont get a receipt that way. Order me that taxi. So the next morning he goes on a fairly long taxi drive to the airport. Fun fact: Swiss taxi rides are expensive as fuck.\n\nOnce again, a few days after he's back, a call from finances. About what the hell this 200 euro charge is, and how he had to spend so much this time. Dads reply was something in the lines of\n\n\" Well last time I took the train, but you didn't want to reimburse my ticket because I didnt have a receipt. So this time I took a taxi, but don't worry, I made sure to get a receipt this time, so there should be no problem with paying me back for this right?\"\n\nI was told they accepted because technically there was nothing they could do: the expense was necessary (to get to the airport) and he had a receipt proving it. Later that day they informed that in the future he was allowed to use the train if it was cheaper, and he would only need to provide them with the train ticket.",
        "permalink": "/r/MaliciousCompliance/comments/80cif0/dont_worry_i_made_sure_to_get_a_receipt_this_time/",
        "comments": [
            "Haggling regarding expenses is the dumbest part of taking business trips.  In your dad's case, I think at least my company would accept it since it had the price on it.  Once I had to call a pizza place and have them fax me a copy of the order I made because the receipt they provided was not itemized, which is a requirement for meal expenses at my company. Maddening ",
            "I'm in the military, and we had to travel from the US to Europe for the 70th anniversary of DDay. I began the planning a year in advance, and told my command wen needed to book asap before it became a bigger event and our hotel options would be limited. They said \"Nah..70th is nothing, 75th will be the big event.\"\n\nWell...we were at the White House when France's president arrived and gave a speech alongside Obama..in it he invited him to the 70th anniversary. Obama accepted. Before the end of the week, every major world leader said they'd be in attendance.\n\nHotel prices went from $70 a room in the Carentan area to $300...and sold out quickly. We could no longer fly into the are, but had to fly into Paris. The total cost of the event went from $15K to us spending $38K....when my command called me after we filled our travel claims, they asked why it was over double the original estimate. I said it was because they didn't let me book when I wanted to and waited a whole year...they swallowed the pill\n\nThanks command for wasting tax dollars and not listening to me...",
            "Similar story here.  While on a work trip I skipped a full meal for breakfast and just got a coffee and donut.  Submitted the receipt in my expense report itemized as breakfast for that day.  Accountant rejected it saying it wasn't breakfast, it had to be a meal, and the company won't pay for my drinks and snacks all day.  This resulted in a few emails and phone calls between her and myself about the charge and hilariously debating what defines a breakfast.  We wasted about an hour of company time for a $4 expense.  ",
            "I absolutely love it. In a previous job, about 25 years ago, I dealt with a similarly up-his-ass accounting manager. He decided to eliminate the generous per diem that the traveling group was getting in favor of some complicated formula of reimbursements because \"his research\" showed that we were profiting from the per diem. We were, but we were also travelling for weeks (sometimes months) at a time and the per diem was set-up that way on purpose to encourage people to stay in the traveling group, which was responsible for over half of the company's income, and was passed onto the clients at a profit to the company.\n\nHe felt any expense profit should come to the company, through his department so he could show upper management his cost savings. Almost *en masse* we all started to follow his new formula to the letter and submitted max reimbursements for every meal to the penny and per diem reimbursements skyrocketed for about 6 month and the company started losing money. He was pissed. We weren't terribly happy either as we were buying things we didn't really want, but none of us were willing to stop as we wanted the old per diem back.\n\nEventually, he got fired, as the per diem plan wasn't the only cost-savings plan that he instituted without proper backing or research that ended up costing the company money. After about 6 months, the company went back to our generous per diem and everyone was happier... except the accounting manager, as he was looking for another job.",
            "When I worked in the field, we would often find situations like this. Sometimes I’d be working outside my city so I’d need an overnight stay. They originally let us “stay with a friend” and have a per diem pay out. Most often we’d work as late as possible to finish the install and book it home banking our per diems. \n\nThen a new Operations VP came in and put a stop to our per diem payouts - everything needed a receipt. So we’d get a hotel just the same, but never end up staying in it. We were entitled to the overnight stay due to hours/distance so it’s not like we were breaking rules. I was also able to get loyalty points for free travel on my personal time. ",
            "I assume he was able to get reimbursed for the backdated train ticket too?",
            "business trip expenses are annoying, even for a good company like mine.  \n\nI had to ask cab drivers for receipts for tips since our finance department didn't have some function to allow me to tip without a receipt.  I felt like an ass, but I'm also not going to be out of pocket for $45 for a business trip they required.  No, that's not just one trip, but a half-dozen of them. ",
            "The ticket *is* the receipt. That’s the whole point. ",
            "[deleted]",
            "The one company I worked for that required extensive business travel (mostly international for about 18 months) made it simple by giving a $75 per-diem (this was around 2000-2001) that covered everything besides airfare and hotel (I paid for it, but it was fully reimbursed within a week of returning). I lived cheap and mostly pocketed the per diem. It was sweet, but I was too young and stupid at the time to realize that I could have used membership numbers on all of those international flights and expensive airport hotels (I worked on airport software so I was generally in or right next door to the airports I worked on) to get a ton of free travel. Oh, well.",
            "[deleted]",
            "I had a friend who works for the US government in a similar situation. Instead of a taxi to the airport($40-$50), he said his friend would drive him. He tried to get reimbursed for the tolls....less than $5 and they denied it because no receipt. Problem is that most of our tolls don't have an option for a receipt, you just drive through. So now when he travels, he takes a taxi instead, costing our government an extra $35ish each way. USA #1!",
            "I had a client refuse to put me up in an $65 per night hotel room. So instead, I billed the mileage for the 150 mile daily roundtrip. Oh, and the time in the car was billable... oh, and because it was above an beyond the 8 hours I was on the job site, that was billed as time-and-a-half. This went on for six days a week for 4 months. They never questioned a single invoice. and I was reimbursed for all of it.  ",
            "> A London based employee of our (UK) firm went to Chicago to attend a seminar. This goes back to the 1970s when proper men still wore hats, and our friend was indeed proper, so he showed up in Chicago in full British-style attire, including his beloved woollen hat. Lo and behold, Chicago can be a very windy place and, shortly after arriving in the Windy City, his hat blew off and was completely flattened by a passing car.\n>\n> Our friend thought it reasonable that the firm reimbursed him for his loss so, after having acquired a new hat, the cost found its way to the expense report, which he submitted on his return to London. In those days ours was quite a small firm, and expenses were controlled with an iron fist by one very senior person in New York, who shall remain unnamed. When he saw the expense report, he went ballistic and immediately demanded for our friend to re-submit his expenses, this time without the hat.\n>\n>Now, our friend was not giving in that easily. He was truly upset about the loss and only found it fair that Goldman compensated him, so he re-arranged his expenses, with the total adding up to the exact same amount, but the hat had mysteriously disappeared. Then he wrote in big fat letters across the expense report: “Find the Hat!”\n\n-- famous urban legend, debunked on snopes.com",
            "I used to work for a railroad and they were fantastic about reimbursing. No receipts required for meals as long as they were under $20 and they only spot checked. Never had an issue getting reimbursed. The scenario described here would never have happened!",
            "I got back from a business trip recently. The car rental agency have me a complementary upgrade! Woohoo!\n\nThen I submitted my expenses and got a note back saying \" you were not authorized to rent a car in that class\". ",
            "I bartended at a hotel with a restaurant, and whenever I could I would hook a customer up with a dinner check with no booze on it so they could turn in the receipt and be reimbursed for their boozefest. They appreciated it. Now when I'm travelling on business I always ask, and I appreciate it.",
            "Something similar happen to my dad many years ago, in every bussiness trip he always go to the cheapest hotel he can find, he also doesnt expende much in food or transportation beacuse that the way he is, but one day his boss complain about how expensive was his bussiness trips, so in the next one he go to the more expensive one, ordered food, and went in taxi to everywhere so his boos knows what is really to spend money.",
            "As a business owner, I think it helps to understand why your employer needs proper receipts. They're not being pedantic assholes, but instead they're following IRS guidelines.  They cannot legitimately deduct these expenses without an itemized receipt.  So when your employer says \"get a receipt\", they're doing so because they don't want to suffer through an audit at some point that is going to scrutinize that expense.  Sometimes it helps to understand why.",
            "People who feel the need to feel like they’re doing something so they create work. ",
            "Swiss taxis are indeed ridiculous.  I did literally 20-30km to the airport and it was $250.   Work didn’t even blink though.",
            "I mean, I obviously can't speak for the whole of Switzerland but in Zurich you definitely get the option for a receipt from machines. ",
            "I like the malicious compliance. And I think your dad is correct, that you don't get a receipt. Maybe there's a button he could've pressed or so, I'm not sure. But you could get one if you go to a person at the counter if the train station has one. Sure takes more time and is inconvenient so I'm glad the company said the actual train ticket would suffice.",
            "Huh, and I thought expenses at my first job were a hassle. Had that exact same conversation about a train ticket, but at least mine ended with ‘Oh, ok’ and it was fine.\n\nOTOH I did ring the VP Asia-Pacific in the middle of the night her time to say ‘You need to find me someone with a working Amex right now, because they haven’t paid mine in three months and I have a 5000 GBP hotel bill to pay.’ And that was *after* I’d already covered a 700 GBP bill on my own card earlier in the trip.",
            "To all business owners: **PER DIEM**!!! Pick a reasonable number and use it regardless of if the bill is on the customer's or the company's dime. Only sales guys taking customers out should have to save a receipt from a meal.\n\nNot only does this save everyone time and effort, it removes all the gamesmanship of meal limits (written or unwritten) and people feeling shafted because they worked through a meal.",
            "I had a company haggle me out of a few bucks in a situation like this.  Not to worry.  From then on it was give me cash or a company card.  They squealed like stuck pigs but I explained that “Im not in the business of lending this company money” And my credit card was no longer available to them.  Anger and rage resulted.  But I stuck to my guns and got a company card.  Now when they questioned a charge it’s up to them to convince me I’m wrong and I owe them.  Has yet to happen.",
            "My dad did something similar when he would be working with clients. If they got lunch he’d buy some cheap shit but wouldn’t always get receipts. The guy he had to give them to was always really frustrated about the lack of receipts. To teach him a lesson (I guess?), my dad went to a steakhouse or something and spent like $100 on lunch (normally spent like 5-10 tops). The twist is that the guy loved it because he finally had the receipts, but my dad was mad that he didn’t understand the point he was making.",
            "I once worked for a company that was run by Mormons, when I ordered a pitcher of beer they wouldn't reimburse it.  Every business trip after that always asked the restaurant to bill it under \"dessert\" instead.  Never had a problem after that.",
            "Stuff like this is so annoying. I had to send one of my barristers to the Court of Appeal and the firm who instructed us would pay travel. To get to London on the day cost £285 to 320 (got to love the British railway companies). My Barrister decided to go down a day early on a non peak time train, and stay in a hotel. It cost £160 total, with the added bonus of him not having to get a 630am train down to London.\n\nWhen I submitted the bill they refused to pay as hotels were not included under travel. Took me a full day of emailing and getting a manager involved for them to pay, even though it saved them over £150. Ridiculous",
            "Itemized receipts are unfortunately a big part of preventing fraud. \n\nImagine going to a business meeting at a restaurant. You can spend up to $75 for lunch between the two of you.\n\nNow, the trick is that they provide non-itemized receipts. You let the guest order a sensible meal at $17. You order the cheapest thing on the menu for $5. \n\nYou actually spent $25 with tip... But ask for A $50 giftcard to be included on the bill. Now you have a free dinner on the employer's bill.\n\n\nThis is a very common practice.\n\nMy SO controlls the spending in her department. People try to pull bullshit all the time and they're very generous with spending already.",
            "Always spend the corporations money when you can. They aren't going to give it to you anyways.",
            "Or you know they could just trust your dad took the train to the airport and trust his word for the price of the ticket. Seems like honesty and trust is out the window in today’s society though.",
            "How does no one here know the story of the guy with the extra guacamole?!\n\n[Starts here](http://www.askamanager.org/2017/08/my-companys-accountant-is-nitpicking-my-pretty-frugral-travel-expenses.html)\n\n[the guacamole comment](http://www.askamanager.org/2017/08/my-companys-accountant-is-nitpicking-my-pretty-frugral-travel-expenses.html#comment-1625078)\n\n[Satisfying follow up](http://www.askamanager.org/2017/09/update-my-companys-accountant-is-nitpicking-my-pretty-frugal-travel-expenses.html)",
            "British accountant here and I'm not sure where your dads company is based so local laws might be slightly different, but the reason you need the receipt is for tax purposes, if you transfer money into an employees account without sufficient evidence that it's an expense reimbursement then the employee is liable to pay income tax on that and the company should be paying a National Insurance contribution.\n\nA receipt is the general accepted level of evidence. Let's say it's a 50 EURO train ticket, no one really cares about this 1 off cost, but if over the course of a year, there's potentially hundreds, if not thousands of expense claims without proper receipts then this can create quite a serious level of non compliance and can land companies in serious trouble.\n\nOn top of this, receipts will have the suppliers tax number on it, which the company can offset against their own VAT bill. If your company pays out 100k in expenses without VAT receipts, that means they won't be able to claim back 20k in VAT.\n\nThat's why companies have blanket policies which seem quite ridiculous when you look at smaller examples.\n\nThat said, at our company we will accept a copy of the train ticket and not a full receipt and we'll just tell the employee to not do it again, it's not worth upsetting an employee over a small expense claim.",
            ">Later that day they informed that in the future he was allowed to use the train if it was cheaper, and he would only need to provide them with the train ticket.\n\nDid they reimburse him for his original trip after that?",
            "I would have said \"well since that's an approved expense how about you reimburse me for the other one as well\"?",
            "I had a job where you could expense unlimited food with a receipt and another job where you got $50 a day for food but didn't have to submit receipts.  The $50 a day place was great because I do Intermittent Fasting and generally don't eat breakfast.   I could take the extra money I saved through the week and have a nice dinner one night or use it for toiletries etc.\n\nMy current job requires receipts, has meal limits and you can't carry from one meal to the next so I get shafted for not eating breakfast and instead wanting a big lunch. :-(",
            "I traveled one place for work and the airport was an $80 cab ride each way.  In addition it would have been at least 2-3 cab rides a day while there between the hotel and the office for 3 days.   I mentioned that it was cheaper to rent a car at the airport to the boss and he agreed 100% so I just rented for 3 days.  With gas it came to about $120 compared to the estimate of $220+ to take taxies!\n\nSometimes bosses can be smart!",
            "Like a personal check, the ticket *is* the receipt...\n\nFriggin beancounters.",
            "This sounds like the parking issue at my office. We’re a state agency, but the office I work out of is in with our town’s government buildings. It costs $5/day to park in the government parking lot, or $25/month for a pass. We tried to get the state to pay for monthly passes for us, but they claimed that because we would not be using the lot for the full month (most of us work 4 days per week and are sometimes at different client sites) that we would have to be reimbursed for each day we were there instead. We all work at the office way more than 5 days per month, so it’s really just biting the state in the ass, but you know, rules and such.  ",
            "So...how did he get to the hotel from the airport?",
            "I travel a lot for work and started my own company a few years ago. The biggest fallacy out there is that the IRS requires a receipt for everything. This is not the case, they absolutely accept credit card/bank statements with transaction dates for ANY transaction and you don't need ANY documentation whatsoever in these three cases:\n\n* **You use a Per Diem arrangement for meals or lodging while traveling.** Every sane employer should switch to this so no one has to dick around with meal receipts when it's just them eating. It simplified my life an wallet size greatly.\n* **The expense is less than $75 and isn't for lodging.** This is the big one, the IRS doesn't want your piddly-ass receipts.\n* **A transportation expense where a receipt is not readily available.** This is for the exact reason that tolls, cabs, trains, etc often make getting a receipt hard or produce hand written receipts of dubious quality anyway.",
            "You can get a receipt from swiss train tickets, the machine asks you if you want to have a receipt or not.",
            "Have a similar thing. Flight from domestic airport $1800 and from the capitol airport $800+$100 domestic train/flight to the said airport.\n\nI suggested to take the cheaper option but rules said that they won't pay for the domestic transport.\n\nSo I took the flight from the domestic airport instead.\n\nNo change in the rules yet. They think it is ok to throw away money like this. Been doing this for a few years now.",
            "F that! Reimburse me for my first train ticket and then I'd take the train next time.",
            "Your dad is a lot like me.  I travel a lot for business.  When I first started I talked to my dad about it.  I was 23 years old and at a place that charged 50 bucks for the cheapest meal.  I didn't know what to do so my dad told me \"Get what you would if you were there personally and not for business reasons.\"  I obviously joked i would never go to a place that charged 50 bucks for a shit steak but it kept with me.  I still take the train to O'hare for business trips.  ",
            "I understand that pain. My company (or the travel company we contract through) has preferred airlines and upon taking my first trip the Southwest fare was almost 30% less but I couldn’t book it because it wasn’t a “preferred airline”. Umm...what? How stupid is that!",
            "I have to get VAT receipts for everything and submit them all on this shitey system called Concor a month at a time.\n\nFor example, I'm a home based worker, I get the train to London a couple times a week. I then put a months worth of tickets into concor and submit say a £1500 claim as one at the end of the month.\n\nLast month I didn't have a receipt for an £8.70 parking ticket. They declined my whole £1500 claim.. I'm now £1500 out of pocket and have to wait another whole month for the claim, less the £8.70\n\nWhen did you ever get a VAT receipt for a car parking ticket??? ",
            "Lovely. Beauracracy at it's finest. And great malicious compliance too\n",
            "So did they also reimburse him for the original ticket?",
            "ITT: people not understanding how business works or why.",
            "Your dad is my kind of guy. Make their inability to spot stupid bullshit cost them AND get your way in the end without a single argument.",
            "I think he wins ",
            "Train tickets are normally acceptable as a receipt where I work and in most countries they are printed as both a ticket and receipt (i.e. they include the information the tax man needs for input tax / expense deductions).  That expenses clerk was being a dumb ass.",
            "Okta workday. Best thing to happen to expense reports since the pen. My old job used excel forms and faxing receipts taped to paper. With my new job I can now snap a picture of the receipt straight from the app while still at the restaurant. It's fantastic!",
            "The ticket is the receipt. It even has the price on it.",
            "My work is tiny, about 10 pp in total and maybe 6 of us travel. The hurdles we have to jump to submit our expense claims is insane - made worse by the fact that they're trying to use an enterprise sized expense management app (take a photo of the receipt, upload it) that hasbt/can't be configured for a tiny business. They refuse to get us prepaid cards linked to the business expense account because they \"didn't even know it existed!\". We now just save our recipes and claim it back through our tax returns. ",
            "Very recognisable story. I don't understand the guys in finance, and it seems to be an international problem.\n\n",
            "Weird, our ticket machines offer a receipt, wonder why the Swiss ones don't.",
            "Very recognisable story. I don't understand the guys in finance, and it seems to be an international problem.\n\nIt doesn't say receipt, but it's a valid ticket and it's got the price listed on it and you *know* I was travelling... reimburse me already. You choose not to, I will choose the way that's sure to get me a receipt instead of the common sense cheap way and we *all* lose. ",
            "yeah sure like I'm gonna trust you Boss!?! repay me my previous train ticket, and I will use the train next time. Don't pay me, and I'll keep using cabs. \n\nFair, right? ",
            "Why was be billed Euros for a Swiss Taxi ? Many places accept Euros, but the money is Swiss Francs.",
            "I'm pretty sure your father either opted out from getting a receipt printed in the machine, or the finance department didn't realise that the ticket was a valid receipt itself. Switzerland is in the EEC, and every purchase has to be specified, with VAT (equivalent), and some sort of identification for the company recieving the payment (like a company number. Tax ID? Don't know the name for it in the US.) \n\nAny company operating inside the EU and EEC has to provide documentation for every transaction, ergo a receipt, to prevent tax fraud and tax deduction fraud.",
            "Did he get reimbursed for the trip weeks ago too after they said that ",
            "HAHAH, that's awesome.\n\nThat actually happened to me before. Company was putting strict guidelines on travel to/from the airport and gave me massive crap for taking a shared group shuttle from/to my house. Cost was pretty low but the shuttle service I was using kind of sucked (took forever to pick me up). So my boss suggested I start using a car service. \"We can do that?\" Apparently everybody did it since you got a receipt. So I started using car services.",
            "He should’ve just told them at that point - no thanks!",
            "Honestly I would just call the ticket a receipt if it has the price on it. To me, that's what makes a receipt a receipt.",
            "Tell the taxi driver to add the cost of the train ticket to the receipt. Bam, covered. Only a little bit of fraud.",
            "did he get reimbursed for the first train ride? ",
            "So, at least in the U.S. for tax purposes(I'm pretty sure, anyway), the train ticket, as long as it has the price of the trip on it, can be considered sufficient evidence for the travel expense. I feel like if it's sufficient for the IRS, it should be acceptable for the company to reimburse. ",
            "At my last company I worked in Engineering, where we were working to interface our equipment with various cash register and POS systems.\n\nOn occasion, if someone needed a receipt, they would borrow a cash register \"for testing purposes\".\n\nIt was always annoying to have to reprogram them back to their original settings.",
            "Gee. If I forget to get a receipt for mass transit my company just accepts me downloading the information from the agency's website (ex: price of a NYC subway [fare](http://m.mta.info/mt/web.mta.info/nyct/fare/FaresatAGlance.htm)) and forwarding to them.",
            "The Swiss ticket machine can print a receipt. You have to touch the 'print receipt' button at the end of the transaction.\n\nYes, taxis are horribly expensive over here.\n\nSource: Swiss, taking the train often (and extremely rarely a taxi).",
            "Sounds familiar.  I think BlackBerry and his company have been he same finance dept.  ",
            "International travel on company business and his employer doesn't provide him with a company credit card.\n\nWTF - that is shady unless it is a very small company that is taking advantage of him.",
            "This is why I was glad I had a company credit card when I was in management. Never had to take on the expense myself, just charged the company card.",
            "I travel for work all the time and take trains where the ticket has the cost (in euros) on it but you don't get an actual receipt and I've never once had anyone in the finance department at my office question it when I get it reimbursed.  Either the finance dept of the company your dad works for is terrible (or the company itself is terrible) or the person he spoke to just had no idea what she was doing.  That being said if it happened to me I'd absolutely take a taxi the next time.",
            "Expenses are the fucking worst.",
            "I once turned in a 25 cent parking ticket on my expenses. The CFO called me into his office and laughingly shouted \"Where in all of NYC do you park for twenty five cents?\" We had a municipal lot down the block and I'd parked there instead of a garage while I got a co worker from the office to drive to an off-site meeting. The ticket was the receipt.",
            "Are we a race of thinkers? Or just robots that can't think for themselves?\n\nArtificial intelligence and machine learning would probably have handled this situation much more efficiently in the first place",
            "Swiss train tickets are already \"receipts\" they have a line with the applicable VAT percentage (MWST). I never had trouble with Swiss train tickets not being accepted as receipts for my expenses.",
            "Completely irrelevant to the story, but when I was in Switzerland last, you could get a receipt for your ticket purchase from the machine, at least for card payment. \n\nAlso, ouch. Swiss taxi rides are really... unspeakably expensive. ",
            "Did they pay him back for the train ticket? If not, I'd just keep taking the taxi until they do.",
            "I am travelling to Zurich on weekly basis and there is now an option for the receipt at all of the ticket machines   ",
            "Had a few colleagues that went to a training session in another city, pretty expensive. They submit all their stuff and originals (important) to A/C for reimbursment. Well.. A/C lost all their papers and asked them to resubmit them, all originals required. My colleagues called them saying they couldn't possibly send the originals since A/C lost them but they had copies available. Nope, no can do, originals only or no money..."
        ]
    },
    {
        "post_id": "u4cluk",
        "author": "Jerberan",
        "title": "Months of paid vacation? I'll take it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/u4cluk/months_of_paid_vacation_ill_take_it/",
        "score": 14238,
        "num_comments": 372,
        "created_utc": 1650042163.0,
        "selftext": "This happened in Germany so the laws are different to other countries, especially to the USA.\n\n&#x200B;\n\nI was working for a family owned business (about 40 employees) a couple years ago. My time there wasn't the best because i had huge problems with my bosses younger brother. He was on early pension and officially just working on a small part time contract while in reality working full time with getting most of his salary out of pocket.\n\nThat i was hired meant for him that he just worked about half the hours he worked before and having a huge paycut because of me pissed him off as you can imagine. He talked bad about me behind my back all the time and tried to get me fired.\n\nDealing with him was a pain in the arse but i didn't had to deal with him to often, my co-workers were nice and the pay was good. So i didn't care about finding another job despite my relationship with my boss and his wife got worse over time too. My boss even came with me to two deliveries to costumers because his brother probably told him i would waste time during the deliveries.\n\nAt one day i had to do a delivery with my bosses wife's car because the company car i normally use was at the inspection at that day and the timing couldn't had been worse. I scratched the fender of her car on a wall when i tried to get out of the parking spot. The scratch were barelly noticable but i immediately reported it to one of my co-workers so no one can say that i tried to put it under the rug.\n\nI did the delivery and when i came back my bosses wife already waited for me. She went completely crazy, screamed at me for ruining her car (without inspecting the damage before) and said that she will take the money for the repair from my paycheck.\n\nI told her that i won't pay for anything because the insurance will pay for it anyway and thats what let her snap and she slapped me in the face. I immediately turned around, grabbed my stuff, clocked out and went to the doctor to get a sick note because of mental stress, which i threw into the companys mail box in the evening.\n\n2 days later i got a termination letter in the mail and had to laugh while reading just the first sentence. \"We are terminating your work contract immediately, or if this isn't applicable, within the legal 30 days.\"\n\nTo people who arend't familiar with german workers law's, it's illegal to terminate a contract immediately AND within the legal period of time in the same termination letter. You can do one or another but not both at the same time.\n\nSo i went to the government office to apply for unemployment and hired a lawyer to sue my boss for illegal termination. Over 2.5 months went by until i got a court date and my boss was really pissed when the judge explained to him that the termination was illegal and that he had to pay me for the last 2.5 months.\n\nBut the illegal termination wasn't the only mistake he made. The judge gave me 2 options. I can accept an immediate termination on that day and leave without compensation or i can have a 2 month salary compensation but i have to work another month for the company.\n\nMy boss laughed and said that i'm to scared to go back to work and that it makes him happy that i leave the court unemployed. He didn't looked that happy anymore when i asked him \"why should i be scared? Do you want to beat me like your wife did?\"\n\nSo i took option B and went to work the next morning. My bosses brother already waited for me to hand me the termination letter and made comments about how difficult the next 30 days would be for me. I checked the termination letter and after i've seen that everything was right i just said that i'm not feeling well, turned around and went to my doctor to get another 30 day sick note because of burnout.\n\nSo at the end i had a 3.5 months vacation with full pay, 2 month salary compensation and he had to pay for my lawyer too because he lost at court. I could have sued my bosses wife for the slap too but that would have been to much stress for maybe a couple hundreth euros.",
        "permalink": "/r/MaliciousCompliance/comments/u4cluk/months_of_paid_vacation_ill_take_it/",
        "comments": [
            "Nice work mate. Employers like to forget that their employees are human just like they are. It takes balls to stand up to them, but you've got balls of granite and you showed them who's boss! Good lad 😊",
            "And on top you could have gone to the police for assault",
            "Employee protection is so much better in Germany.\n\n&#x200B;\n\nWhen I was in University I lost my helpdesk job, since I reported a serious security issue to my boss and not to security... I was just on my \"3rd time limited contract\" (4th one will be unlimited).\n\nI had about 5 months left on my 6-month contract, so they decided to \"just send me home\" (Freistellung). Since I was still a teenager i was pissed at first... Untill they told me i would get my full payment for the next 5 month, but that I could not work with them any longer.\n\nBack than this was almost $10.000. I felt like i won the lottery ;)\n\nAfter the 5 month i had to take a job at \"Manpower\" - and I was getting right back into the same hotline seat for the same wage (for me) I knew they had to pay at least 50% on top since Manpower also wanted their share ;)",
            "Good on you, mate!",
            "Top it off with, does her car insurance company know that she is ordering an uninsured driver using a personal car for company business? And don't German Dr's have a responsibility to report abuse to the police? Not to mention, like you said, does the Govt know the brother is being paid under the table? I have questions.",
            "Lol, boss took the L",
            "Totally shoulda included your boss's wife in the legal proceedings.\n\nThink of how much MORE you would've screwed them over if she was also charged with assault or similar.",
            "Why did you not report the assault?",
            "You forgot to report them for paying the brother “under the table” — here in the USA that is called “Tax Evasion” and the IRS (Federal Income Taxing Authority) has a very dim view of it.  I’m sure your taxing and pension authorities would love to know about it as well.",
            "As an American this is delicious, thanks for sharing!",
            "> for maybe a couple hundreth euros\n\nA couple of cents doesn't sound worth it at all.  ;)\n\nhundred = *Hundert*\n\nhundredth = *Hunderstel*\n\nLoved the story!",
            "I don't know how battery works in Germany but the wife should be in some kind of serious trouble for attacking you. I hate when people get away with shit like that.",
            "The losing side should always pay for the expenses of the other party but US is so fucked up that it doesnt happen and it's used to intimidate the people.",
            "My American self nearly crying over the thought of 30 days off for burnout… I couldn’t use burnout as a valid reason to get 30 min off here. Take me with you!",
            "Living in the US, this reads like some work of fiction off of r/thatreallyhappened. Going to a doctor and getting a work note like that lol man what a concept",
            "Should have sued the wife and brother for mental anguish loss of income and filed assault charges on wife. Maximum damage.",
            "Maybe it’s my car being worth about as much as your average garbage bag but I wouldn’t have been upset about that. Hell a kid nailed the same car in the parking lot in Disneyland once. Told the mom if my car didn’t notably look any worse we could pretend nothing happened.",
            "damn, living in a state with actual worker protections? can't relate",
            "Loved!!\nI lived 3 years, (last 1,5y were miserable) in Germany, I know how mean this people can be. \nI also endure up in the police because of a neighbor, she had to pay 200€ fine for calling me f* bitch in our driveway in front of my kids!!",
            "It's probably the same in the UK. Our employment laws are extremely civilised. We look at the US in horror and disgust. Why is allowed the way it is in the US?",
            "> To people who arend't familiar with german workers law's, it's illegal to terminate a contract immediately AND within the legal period of time in the same termination letter. You can do one or another but not both at the same time.\n\nIt sounds like you are the one not familiar with German labor law, because this is ***exactly*** how this is done in cases where you terminate immediately:\n\nYou can only terminate contracts without notice for grave misconduct, that's typically theft, sexual harassment, violence, etc.\n\nHowever if a case goes to labor arbitration or court and the termination is withdrawn, then the contract is reinstated and you will get compensated retroactively, and if they still want to fire you, have to terminate then. Which apparently happened in this case for some reason - but the initial termination (without cause, regular notice) should have been perfectly valid.\n\nSo why the court sided with you / gave you those options I have no idea. You should have gotten one month pay and that's it.\n\nStichwort: “Fristlose, hilfsweise fristgemäße Kündigung“\n\nSources (in German):\n\n* https://kuendigungsanwalt.de/kuendigung-kuendigungsarten.html\n* https://www.impulse.de/recht-steuern/rechtsratgeber/fristlose-kuendigung-arbeitgeber/3558009.html\n* https://www.ihk-muenchen.de/de/Service/Recht-und-Steuern/Arbeitsrecht/Bestehende-Arbeitsverh%C3%A4ltnisse-K%C3%BCndigung-und-Sozialversicherung/K%C3%BCndigung-im-Arbeitsrecht/",
            "Your the peoples champ for this 👏👏👏👏",
            "Why didn't you immediately call the police for assault when she slapped you?",
            "Wait, you have to sue someone who physically assaults you?\n\nYou don’t just report it to law enforcement and provide evidence (immediate photos) and let them deal with it?",
            "Jeah Cool Story Bro.\n\nOn the Workers Courts first instance every party pays its own lawyer  regardless of outcome. This is so Workers can actually sue without being feared one party racks up costs they cant pay and therefore not going to court.",
            "Oh could’ve went on livin’ but he made a fatal slip \n\nWhen he tried to match a german with *good legal knowledge*",
            "You can get 30day paid sick leave because of burnout in Germany??",
            "Oh, aren't good worker laws great? Gute Arbeit!",
            "How does self-defense work there since she assaulted you first?",
            "This is great, you should also post it on r/antiwork",
            "mobbing gone wrong\n\nI love it!!!",
            "In usa here and this sounds like a dream to me. Workers rights protection is some of the best protection",
            "That seems like a very small compensation for unlawful dismissal.",
            "I would have made the bitch eat revenge pie",
            "[deleted]",
            "OP: \"I don't live in the US, and English is like my 3rd language\"\n\nTypical Redditor: \"This story is BS because I live in Kansas and that's now how US laws work. Also, you misspelled 'their'.\"",
            "Where is malicious compliance?\nHe said you are to scared to come back, not that you have to come back.",
            "Taking somebody to court against their will, and winning, is not malicious compliance.\n\nAt no point did you ever maliciously follow any ORDER that they gave you.\n\n\nNot even the going back to work. They didnt want you there, you were never ORDERED by your boss to go back to work.",
            "Nice! I'd move to Germany but my profession is not on the list of jobs that qualify for immigration.",
            "Being she was working, could you not have gone after the business for your medical expenses from the slap, instead of her personally?",
            "Probably going to downvoted for even asking this, but...\n\nDo Doctor's in Germany just do everything you ask them to? I mean a sick note after getting literally slapped in the face I can understand, but 30 day sick note for 'burnout' when you weren't working for 2.5 months?\n\nHow often do German employees exploit this like you did?",
            "So they can’t fire you? I don’t get it. How can the government force them to continue to pay someone who isn’t working and they don’t want anyway?",
            "Why did you not report your boss's wife to the police for assault?",
            "this is why I refuse to work for a) small companies & b) family run companies. No thanks",
            "Over here in Murca:  I worked my ass off for a place for 20 years and gave my notice of resignation.  I gave them 10 weeks notice so they could get to work on my replacement.  I had 72 weeks -- yes, that's more than a year -- of unused vacation. Unused chiefly because that's how it is in my country and my area of work.  \n\nI asked for my contractually allotted 4 weeks of vacation and 8 more as a way of, 1: giving me a break before my next endeavor, and 2: as a payback for the 72 weeks of unused vacation.  Some of the deciders actually balked at giving me the 8 weeks (and sort of sneered at me actually using my allotted annual 4 weeks of vacation -- something I'd never done in 20 years) saying I wasn't owed any severance since I was leaving voluntarily. Fortunately, saner and more humane minds prevailed and I was granted the 8 weeks.\n\nEpilogue: Those delicious 12 weeks combined break came in the depths of COVID so I was basically stuck at home day drinking and bingeing Reddit in solitude -- I even lost my dog right before this happened.  Would have loved to have gotten my 72 weeks, but...Murca.  And, it's been 20 months since I gave my notice and they still haven't found my replacement. The small minded schaudenfreude part of me hopes they recognize how much they took me for granted.  Doubt it.",
            "Did the judge know she slapped you? You should report it to the police and press charges.",
            "Digga, Du hättest Du olle in jedem Fall belangen sollen für die Ohrfeige / den Schlag.",
            "Great job OP! You’re a hero!",
            "How do you just go to the doctor and demand a month off lol?",
            "[deleted]",
            "this is **also a good revenge story!** 👍",
            "Absolutely great! I hope you could enjoy your time off ;) Do you work at a better place now?\n\n\\---\n\nGroßartig, wirklich! Ich hoffe, du konntest dich in der Zeit vernünftig erholen ;) Hast du denn jetzt einen besseren Arbeitgeber?",
            "Well, finally a german speaking fellow who learned english too 😍.",
            "This is a repost or something similar happened to another op. I’ve define read this. Just saying. Could be op posting twice. It was from a while ago",
            "You got treated like family. Then you reminded them that you are a human being, you have legal rights, it's a working relationship, and they gotta pay up.\n\nMuwahahaha.",
            "I respect you. I’d have slapped the bitch right back.",
            "I could take 9 months off per year and still make more money than I could in Germany doing the same thing. This is what Europeans don't understand. Sure you get a lot of time off but I do too and could have more and still come out ahead",
            "I don't know if insurance rates there vary based on claim history but raising someone else's rate over damage you caused isn't the right thing to do. You caused the damage and should have covered the cost of the repair.",
            "M..... .. V, vv, v5v55 5t,,,,',., g. ¡.",
            "Do people not go to jail for assault in Germany?",
            "I'm kinda shocked the lady had the audacity to slap you. And this happened in Germany? Wild. Glad you won.",
            "me",
            "Haha gotem",
            "Aaaahhh, that's lovely",
            "I am sorry but I have to correct you. It is totally legitimate to terminate a contract  immediately or if that is, for whatever reason, is not applicable, terminate the contract according to the terms stated in the original contract or according to the law both in the same document.\nEvery HR Person would use this variant in order to make sure not to pay excessively long, since the day of immediate termination starts the normal period for termination.\nPretty sure they made some other grave error like not giving reason why they have terminated your contact immediately and of course didn't write you up before hand or ignoring the correct period of time for the \"normal\" termination. Which leads to both terminations being most likely unjustified.\n\nThe relevant term is \"ersatzweise fristgerecht\" and needs to be within the terms of the contract and/or the law.\n\nSource: I am working HR and did several of those. Never do I ever send a immediate termination out without adding the normal termination phrase/period.\n\nBut to make sure: www.haufe.de/amp/oeffentlicher-dienst/personal-tarifrecht/hilfsweise-ordentliche-kuendigung-zum-naechstmoeglichen-termin_144_401490.html",
            "So the secret is having a doctor who listens. Where I come from, the doctor would say that stress doesn’t exist, that it’s all in my head and that I should go back to work. (and I heard that already).",
            "Balls the size of boulders, lad",
            "10/10 story.\n\n\nAnother 10/10 for the use of 'arse'",
            "You win! Wow",
            "Did you tell your lawyer and judge about her slapping you? Like in the USA that's assault and you could call the cops ans have a good lawsuit.",
            "It's also unlawful to terminate while sick :D sooooo many angles covered. I've seen other people play the same trick in other countries too.",
            "He had to pay for your lawyer? I thought at the Arbeitsgericht everyone has to pay for her own lawyer regardless who is winning.",
            "I say do you wanna figghhttt, do you wanna catch these hands? \n\nCause hit me? That will never happen",
            "AMAZING!",
            "Woooww, you're awesome man!",
            "fuck /u/spez",
            "Could you have legally have punched her square in the face as self defense? Play stupid games, win stupid prizes.",
            "Would it have been possible to get the owner's wife barred from the premises whenever you were at work? That would have been funny (but you would have had to work)"
        ]
    },
    {
        "post_id": "dy8939",
        "author": "Analytica0",
        "title": "Boss tells me not to e-mail any of her bosses because only she can communicate with them",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dy8939/boss_tells_me_not_to_email_any_of_her_bosses/",
        "score": 14228,
        "num_comments": 371,
        "created_utc": 1574106198.0,
        "selftext": "Years ago, I was working for a large organization. My boss was very nice and pleasant to work with at first. I was hired and tasked with taking a very troubled department and bringing it up in standards. My boss was fairly supportive during the initial few months on the job but then, something changed. The department began to perform and improve greatly within the first 6 months and this was recognized and heralded by upper management. This made my boss look good and also improved overall morale on the team within the troubled department as they were finally recognized for their efforts and talents,\n\nAbout this time(6 month mark), I was told to watch my back by a few other colleagues (both men and women) outside of my department, because my boss had a reputation for putting her own success over anyone else's. They also warned me that she was known for being very threatened by any successful males who worked with her (male here). She was a very big champion of the women on her team and regularly promoted and advocated for them but it seems that every male that worked on her team ended up leaving or getting fired (this was something I was not aware of when I was hired. I also am the ONLY male on the team). After investigating this further, I found there to be some truth to all of this. As it happens, over a 12 year period, over 8 men on her team either quit or were fired (6 fired and 2 quit). Of the women on her team during the same time period, 8 were promoted, 2 quit, 4 were still on her team and 0 were fired. So, I am a bit concerned about this now as 1) I am a male and 2) she has this reputation for making it difficult for men on her team. \n\nI just took this all in stride however and focused on continuing to manage the department to greater levels, work on continuing to increase the morale of the department and ensuring I communicate with my boss regularly about any situation that would become problematic for her or me. I also focused on ensuring that she got maximum credit for the improvements of the troubled department and credited her with being a great boss that ensured that the department received the resources and support that it needed to succeed.\n\nFast forward to about my 8th month there and I am in a meeting with my boss and she begins to rage against me that I emailed someone who was in the upper management of the company. I explained to her that yes, I did cc that VP because the email in question was one that necessarily involved the entire area under which this particular VP lead. She said I am not to do that and then proceeds to tell me that I am forbidden to email anyone that is above my pay grade as 'that is not my place.' She then tells me that ONLY SHE is allowed to email these people and that if an email needs to go to them, cc or not, SHE WILL send it. I ask her if she would like me to send the emails that would need to go to VPs to her for her to send and she tells me \"Yes, send them to me and then I will send them.\" I ask her also if she wishes I do not 'call the VPs on the phone as well'  and she say \"Yes, you are not to call them either\". Then she says \"I know you may be used to getting your way because you are a man but this doesn't mean you can try to take my job.\"  WHAT?!!  I'm kinda befuddled at this and just take it all in and decide that I need to respect her wishes because there must be something else going on here of which I am not aware. \n\nOK, fine. We will do it your way.\n\nAbout a month goes by and during that time I only need to email a VP once and I write up the email to this VP's department, send it to her and then wait for her to send it on. Now this email is time sensitive and involves giving the VP and his people a head's up about resources needed for a particular project. Now the VP MUST be included in this email because this request involved budgetary issues and only the VP over a specific area is allowed to change or adapt their budget. Otherwise, I would have just communicated directly with the members of this other VPs team to give them the heads up. So I send the email to my boss, ask her to send it on within the next 3 days and then I wait.\n\nAbout a week goes by and I happen to run into this particular VP in the elevator. She asks me about the project, resources etc etc and I let her know that things are good. She then asks about the overrun on this one particular area and I tell her that it is best she ask my boss. She then asks me to send her an email on this particular overrun and I let her know \"Sure, I will make that happen.\" I follow back to my boss, let her know about the conversation with the VP in the elevator and she blows up at me. Starts yelling and screaming and telling me that I am not to even talk with that VP or any VP about this project. I explain to her that sure, I get it but it would have been rude to not acknowledge this VP's questions since we were stuck in the elevator together and I did not seek out that meeting. She then begins to tell me that she has to write me up for being insubordinate and not honoring her request to not email, call talk to VPs'. I am floored but nothing I can do. As I am leaving her office, she tells me that \"I made a mistake in hiring you. I though you were different but you are just as entitled as all the other men I've hired.\"  DAMN!! Ok, so this is going really well. \n\nDo I go to Human Resources and have them play their stupid games with me? Nah, not gonna solve anything especially with a boss that has been at the company for 10 years or so. Human Resources generally cares very little about employees and only really worries about risk and protecting the company. They aren't gonna do shit for me so I don't report any of this. I seriously thought about filing a complaint about my boss's comments to me. But, when I had the meeting where I had to sign my write up, I decided against it given the HR officer had to read the write up before I signed it and I figured that since the write up was based on a BS policy that my boss created out of thin air, I was right in assuming that HR would do shit for me if I had complained anyway. So I just try to get through all this shit and start looking for another job on the side.\n\n2 days later I get a call from an SVP (to whom the VP from the elevator reports to). Now my boss also reports to another VP (this VP is a female and also not the same one from the elevator) and this VP to whom my boss reports, also reports to this SVP. This SVP asks me to come to a meeting that next day. I explain that I am happy to do so but I will need to check with my boss first to ensure that there are no conflicts in the schedule. I also state to this SVP that I would appreciate it if she would contact my boss as well to ensure that my boss is made aware of her request. The SVP pauses and then tells me \"No, that won't be necessary in this case\" and then hangs up. \n\nSHIT!!!\n\nSo, I email my boss, tell her that the SVP is requesting to meet with me the next day and wanted to make her aware of the meeting. She comes storming into my office around 5:30pm (about an hour before I usually leave) and closes my door and berates me for a good 20 minutes for talking with the SVP. She was so loud that one of the members of the department in which I worked was about to call security just before my boss exited my office. I knew my boss would be mad but didn't expect anything like this. \n\nSo, next day, I go to the meeting with the SVP. At that meeting is another 3 VPs: the first is the female VP whom I ran into in the elevator and was asking about overruns; the second is the female VP to whom my boss reports; and the third is a female VP that used to oversee the department in which I presently work. The SVP proceeds to ask me about the overruns. I explain as best as I can about the issues involved and also explain that I had prepared an email a few weeks ago about this. The VP whom I ran into in the elevator states that she never got that email on the cost overruns from me. I then explain that it would not come from me but would have come from my boss. The VP asks why I wouldn't send it. I say that is not my place to send emails to VPs. Then the SVP stops everyone from talking and says \"What did you just say?\" I then reiterate my response. Then the SVP begins questioning me about this point. After about 15 minutes of my explaining to them that I am not allowed to communicate with them per my boss's orders, they are all pretty disgusted and frustrated. I further explain that this policy was created by my boss and has been consistently enforced by her for the past month or so. They tell me that they will have to come back to me on this but in the meantime, they will get the emails about the overruns from my boss and follow up with her.\n\nSHIT SHIT SHIT!!!\n\nSo, I go back to my office that day and realize that my head is on the chopping block. I am really in a no win situation and I just have to wait for it to play out. And play out it did.........\n\nI come into work the next day (it's a Thursday) and I don't think anything has changed. Seems like a normal oppressive day and I am just waiting for the ax to fall on my head. I work most of the morning and then right before lunch, I get an email. The email is from the SVP with all the VPs copied in on it, that my boss is taking some time off and will be back in a few days. During her absence, all requests and management decisions will be made by the VP to whom my boss reports. I am not quite sure what this means but given the weekend is coming up, I am just glad this friggin week is almost over. Day goes by uneventful and the around 4pm , the VP responsible for the department in which I work ,comes down and comes into my office and tells me that as of that day, my department and I am no longer reporting to my boss but I was now reporting directly to her. I ask what that means for the department and my job. She said nothing, it just means that the department will be better served under this new reporting structure given the increase in the amount of business that the department was engaged in since my hire as well as the strategic internal leverage that would be needed going forward. I also was explicitly told that I was free to now communicate with ANY other VPs or SVPs of the organization as I saw fit. She then apologized for the experience I had with my boss and told me that she was unaware of my boss forbidding me to communicate with her or other VPs or SVPs. I take this all in, not knowing whom is telling the truth but relieved that I will no longer have to endure being treated like a child by my boss. I then ask about my boss and her reporting relationship to my department's other team members and was told that she was forbidden to execute orders to them on her own unless she has my prior approval. \n\nKARMA!!\n\nI stay at this company about 3 years total, have a great working relationship with the VP, whom was now my boss as well as the other VPs and SVP to whom they reported. I only left when I got a better offer in a different industry.\n\nMy former boss was eventually counseled out (over a 3 month period) after HR investigated her behavior, interviewed me about the arbitrary rules about communicating with VPs that my boss had enforced on me (as well as her shouting at me and writing me up and disparaging me as a male). Talk about karma, her write up of me was used as evidence that she actually had implemented this no contact policy solely with me and because she wrote it up and put it in my employee file, it proved my veracity about the entire no contact issue. In addition (and also compounding the problem) other alleged issues concerning cost overruns/financial reporting irregularities that she had hidden over the years. \n\nI have never seen her again but if I ever do, I would love to be able to say to her \"Great seeing you again. I always tell people that you are the boss that taught me the importance of using email to further my career.\" \n\n**TLDR**: Boss forbids me from emailing/communicating with upper management in an effort to ensure that she is the only one who gets credit for anything. Boss has a track record of bias against men and exhibits bias against me based on this same bias. This gets found out by upper management and then this leads to exposing my boss's attempt to hide her alleged financial malfeasance. Boss loses her job and I keep mine.",
        "permalink": "/r/MaliciousCompliance/comments/dy8939/boss_tells_me_not_to_email_any_of_her_bosses/",
        "comments": [
            "[removed]",
            "[deleted]",
            "I'm surprised you didn't ask her to email you about the no-contact-above-your-paygrade instructions.",
            "Heres the thing: there are feminists, and then there are sexists. This woman was a sexsist. She allowed her beleif that she was a champion for women to drive her into becoming exactly the kind of person she hates so much. Sexism isnt soley male or female driven. Its purely the beleif that one sex should be treated better than the other.",
            "Look, you're making life much harder on yourself. HR is, indeed, there to protect the company- we all know this. But that's useful to you in this case. If you don't document comments like those that she was making early and often, they didn't happen. You want those complaints of yours persevered in company documentation. HR doesn't care about you but don't think they won't get the long knives out when some boss they also don't care about is about to bring huge liability down on the company- which is exactly what happened. Also get ridiculous directives over email and, if your boss refuses, talk to HR about that as well so that they document it and your boss doesn't blame you for not communicating.",
            "Blind carbon copy could’ve saved you initial stress and worry, but foresight is 20/20.",
            "[removed]",
            "[removed]",
            "Holt hell... Feminism gone overboard.  I guess sure figured her help women points outweighed good business sense. Apparently this was not the case.",
            "[removed]"
        ]
    }
]