[
    {
        "post_id": "rz6l49",
        "author": "Accomplished_Week392",
        "title": "Tried to be honest with Amazon, but they were having none off it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rz6l49/tried_to_be_honest_with_amazon_but_they_were/",
        "score": 14227,
        "num_comments": 532,
        "created_utc": 1641667063.0,
        "selftext": "I was telling this story in another forum and thought I’d share here.\n\nThis was a year or two ago when Amazon fresh were opening up new stores in London. For anyone not familiar with they, you just walk in, take what you want, then walk out. Your Amazon account gets billed as they use cameras and sensors.\n\nSo I used the one in white city after it had just opened, I went in just for the novelty factor and got a few things. I found a couple of pricing errors, in my favour, a couple really big pricing errors. \n\nI done the decent thing and told Amazon, expecting a thank you, but got a call from an irate call handler insisting I got and was charged the correct amount and I wasn’t over charged and wasn’t due anything back, I repeatedly tried in vain to say no, you’ve undercharged me, but she was having none of it, so I gave up.\n\nNaturally, after the call, I changed my tube commute for an 5 minute longer route and I went in each day and bought only those items priced wrong. \n\nSuffice to say I have enough toiletries for a few years… also I am now sickened by a pricey cheesecake brand and have gone off haloumi cheese .\n\nTLDR . Got treated like a dick by Amazon customer service on the phone when trying to be honest because undercharged a lot on a few item in there fresh store. So went back each day and only bought they wrongly priced items to the point where I wiped them out daily of those items.\n\n\n\nEdit : for a bit more clarity on the prices, The cheesecakes and haloumi cheese were pennies in the pound I paid about 2% of the actual price, so about 8p per £5 fancy small artisan cheesecake, and about 9p for the block of haloumi.\n\nThe toiletries I paid about 6 or 7% of the actual price, so about 50 to 60p per item instead off £9 to £11 each plus it’s toiletries I’d have been buying anyway, only thing now is I had to get a few big boxes in the garage to store them.\n\nGoing via this store cost me nothing extra in travel as in London you get charged a fixed fee for unlimited travel within zones, it only cost me 5 min extra commute each day.",
        "permalink": "/r/MaliciousCompliance/comments/rz6l49/tried_to_be_honest_with_amazon_but_they_were/",
        "comments": [
            "Well if any company can take a hit, Amazon definitely can so 🤷",
            "There's a state law where I live that says if you find an expired product in a supermarket, the supermarket has to give you an equivalent non-expired product for free. This is of course to encourage supermarkets to keep expired products off the shelves.\n\nA couple I know noticed there was a huge, very expensive cheese wheel about to expire. They went to the supermarket every day to check if it was still there. Sure enough, it expired and wasn't removed. They called it out and were given like R$500 worth of cheese.",
            "Yeah Amazon has a few times double shipped our orders and we have called to send them back, not wanting to worry about a second charge, they didn't care, told us to keep them nd never charged us so.....",
            "A major musician supply company was having a special holiday deal a couple years ago. If you bought this great sound system, they were throwing in a guitar. Not a great guitar, but like a $300 guitar, so not a toy guitar, either. My husband ordered it for me and asked that it be delivered to his work address. But it didn't come on that Thursday when they said it would, and he was going on xmas vacation after Friday, so he called the company and asked them to deliver it to our house instead. \n\nThe following Monday morning, the sound system and guitar were delivered to our house. Later that afternoon, my husband's boss called to let him know a sound system and guitar had been delivered to the office. My husband went and picked it up before the office closed for the holidays. \n\nI called the company and explained what happened and she told me it was impossible. I told her that i was literally standing in my kitchen looking at  two sound systems and two guitars, and she told me again that it wasn't possible. \n\n\"There's only one bill of lading, and it's to your house. There can be no item of there is no bill of lading.\"\n\nI argued with her for a couple more minutes and offered to send her a photo, but she refused to believe me. Or... maybe... it was the end of the year and she didn't want to have to reconcile whatever had gone wrong. \n\nI made out pretty good on that one.",
            "[deleted]",
            "Even if they undercharged you its probably still profitable for them so I recommend saving yourself from too much cheesecake haha",
            "This reminds me of when Walmart had incorrectly priced my favorite table wine at $9.99 vs $19.99. Let's just say I cleaned them OUT.",
            "Amazon is pretty dumb.\n\nI wanted a price match on an exercise bike that went down $100 or so when I bought it a few days previous. They were adamant I return it and purchase a new one at the price I wanted, and wouldn't just give the money back.\n\n🙄 I already unpackaged and wasn't about to take apart a bike, and I wasn't going to return normally because there's a return fee. Had to get assurance that A) return was free and B) that it would be picked up since no way was I going to be able to carry the thing to a drop off location.\n\nOrdered new one, UPS picked it up (had to take two tries) still in box where they left it two days previous, and get the refund. What a waste of everyone's time. Felt bad for those guys. 😬",
            "When I worked at my second Walmart store, I had a similar experience. I usually bought my lunch from the store itself, and happened to notice one day that a flavor of a certain smoothie brand was marked incorrectly; all the other flavors were like $5.25, I think, and this one was marked $2.55, and wasn't marked for discount, so I went to my manager about it.\n\nNo one was working in that department that night, so she said she'd leave a note for morning shift to do something about it. Morning shift did nothing about it, nor did second shift, and the managers on our shift I guess thought they were above it because when I brought it up with her again, she said, \"It's been taken care of,\" in a really curt tone.\n\nIt did not get taken care of for a whole month, until the store manager deigned to visit one day and happened to notice. I don't know how much money they lost for it during that time (but hey, that kind of thing doesn't actually bother anyone there from my experience working at three separate Walmart stores with two of them working two different shifts per store at different times, so...) but for every shift until then I got that flavor to go with my lunch.",
            "One time at Safeway I found ground beef  mistakenly labeled for $0.32/lb\n\nMy broke ass dug through that whole pile, found the 4 mispriced one and felt like a motherfucker bandit.",
            "I ordered a Suunto GPS watch with a heart rate monitor chest band from Amazon few years ago. The watch came but the heart rate monitor didn't. So I sent an email and they replied they were sorry I didn't get the item ordered and have refunded the purchase price. I then called customer service and told them I got the $300 watch. I'm just missing the $75 monitor it was supposed to come with. Guy says \"No problem, we've refunded the full price. Anything else I can help you with?\" Uhh...I tried to do the right thing. I guess I'll just keep the $300 watch for free then. I'm not going to force them to take my money.",
            "Someone I know gets nervous easily and tried to tell a cashier she had been undercharged and bizarrely it escalated to a guard sternly telling her to leave the premises. \n\nAll she wanted was to pay for her candy.",
            "I have been mis-shipped products of $200+ value twice, and when I tried to return them to Amazon as a mis-ship they gave me all sorts of shit about proof of purchase and “no we didn’t mess up” I ended up keeping the stuff. Tried to do the right thing and just got yelled at by them",
            "Many years ago, back when the cost of a gallon of gas was not much more than a dollar, a new gas station opened in town. They were advertising 10 cents off each gallon and there were lines to fill up. This was before credit card readers at the pumps, back when you had to walk inside and pay once you were done filling up.\n\nI filled up, did the mental math and figured out how much I owed, and walked inside to pay. The store manager was working the register personally and he said I owed him about a dollar less than I figured.\n\nI knew I was right. Math is my thing - I used to teach algebra and first semester calculus at the local community college. The manager was giving me 10 cents off per dollar, not per gallon. I explained it to him but he just didn't get it. His little desk calculator said I owed him a certain amount after subtracting 10% and that's what he was charging people.\n\nSo I paid what he said and walked away, but being a math nerd I did some more mental arithmetic on the way out. 20 gallons per average fill up, eight pumps, four minutes per fill up, and a loss near 5% on each sale by putting the wrong number in the calculator - this manager was losing about $120 per hour because he was mathing wrong.",
            "Beautiful \n\nIt pays to always check your receipts!\n\nTime to buy favors at work & neighbors with cheesecake & other delicacies",
            "Same thing happened to me at Walmart yesterday. Ordered grocery pickup and found a pack of meat I didn’t order in my bag. Over $13 worth! Tried to return it, but they wouldn’t do a return without a receipt. My receipt didn’t list the meat because I never ordered it and wasn’t charged. So now we have enough ground beef for several extra meals.",
            "my moms boyfriend just bought a cheapish tv sound bar like 130 bucks or something and they sent him this surround sound assessed one worth about 400 and there was a note in there saying happy xmas.  I think an employee was saying fuck it that day.",
            "I love that you waited until you were sick of the items before you posted here. Like, even if they see post this and fix the prices, you already got your money's worth. Good on you.",
            "Hubby worked at one of the food warehouses in the States. They would get deliveries and if the scanning sticker was missing, they would toss the product. Nights he worked, he brought it to the dumpster, but left it outside of it. People would just collect what they could carry to their cars when the shift was over. They knew on warmer days to keep coolers in their cars and on break, they went out to \"smoke\" and loaded the coolers. Hubby and a few others would text some soup kitchens/pantries to pop over. That was the only area that didn't have cameras or security. Almost nothing was ever trashed. 1 day 100 gallons of milk, a coworker/teacher loaded it up for a school to use. Amazon really doesn't care about waste, and they do donate a lot of stuff close to expiring to homeless shelters.",
            "Good fuck em",
            "When the owner is going to space on the back of the oppressive modern slavery regime entailed to Amazon workers, I wouldn't worry about correcting their mistake.",
            "Maybe they were actually just hooking you up on the sly but had to \"act mean\" so their Amazon overlords wouldn't flog them?\n\nThat's what I'd like to think...",
            "I had one happen too with refunds. I got my friend a switch for his birthday, but then I saw I got him the gen 1 version. The gen 2 version has better battery and he mainly plays mobile so I purchased that and tried to refund the gen 1 version. Unfortunately for me, it got shipped so I told my friend to do a refund for me when he gets both and keep the gen 2 one. He did the refund and I got the money in the bank so everyone was nice and happy. That is until I noticed that a couple of weeks later Amazon refunded me twice. I was just waiting for their phone call or email telling me about their error, but it never came. Saved me a payment on my credit card bill.",
            "Ol Jeffy Boy had to wait an extra year to go to space because of you, I hope you’re happy.",
            "You went back every day and bought their whole stock.  They probably made a lot more money off of you than if they priced everything correctly.  Reminds me of a joke:  \n   \n  \nLittle Johnny is always being teased by the other neighborhood boys for being stupid.\nTheir favorite joke is to offer Johnny his choice between a nickel and a dime Little Johnny always takes the nickel.\nOne day, after Johnny takes the nickel, a neighbor takes him aside and says, \"Johnny, those boys are making fun of you. Don't you know that a dime is worth more than a nickel, even though the nickel's bigger?\"\nJohnny grins and says, \"Well, if I took the dime, they'd stop doing it, and so far I've made $20!\"",
            "Never be honest with amazon. Ever.\n\nThose undeserving of respect should not receive any",
            "I sent a high end Ultrabook as faulty (£1299) back to Amazon and they sent me a replacement. The tracking for the one I sent back didn't update for three weeks so I reached out to them to check they'd received it. The associate was really lovely and confirmed that they'd received it back and that my refund was on its way. I said I'm not due a refund as I'd received a replacement but they were having none of it. They couldn't be convinced that I'd received a replacement already . So yeah, that's how I got a Huawei matebook pro for 650 quid.",
            "Most errors in your favor you can ignore and take advantage of. The only thing I can think of off the top of my head you should not ignore is a bank error in your favor. If you ever see such an error call your bank immediately.",
            "Sounds like you may have found a couple Loss Leader items",
            "I had ordered one of those cheap cubby sets from Wal-mart once--probably around $50.  Instead, they shipped me a really really nice camping tent that was worth way more than the shelves.  I called them to tell them their error and to see how they wanted to proceed with a trade.  However, they wanted me to jump through hoops to return it to them--they actually wanted me to pay for shipping.  I really don't think they understood what I was telling them had happened.  In the end I told them 'nevermind.'  We said 'fuck it' and kept it.",
            "I bought a highly rated coffee maker (Wirecutter review), OXO brand,  made coffee today, came out lukewarm, so made another attempt , same result. Bought on Amazon this past November, still within the return date,  (until end of January) so I boxed it up. I didn’t have the original box, but packed it up as best as I could. I did have the UPC code, enclosed copy of return voucher. Took to UPS Store.  Several hours later, return approved. Full refund. Like $150 including tax, not a cheap machine. I know this isn’t a MC at all.  I really loved the coffee maker, but it failed. When they get the return, will it be an issue if I don’t have the original box?  Here, I’m being honest. I just wonder if they try to make some coffee with it or does it go back to OXO or to the dumpster?\n\nETA: just found the instruction book, the coffee scoop, and an additional plastic filter thingy and forgot to include. Oops.",
            "[deleted]",
            "Once someone i know bought something from Amazon and they accidentally sent him 2 of them. So they contacted customer support and told them what happened. They said \"oh were sorry we made a mistake we'll give you a refund\"",
            "Amazon simply does not give a fuck. You have to understand the amount of money they are making is mind boggling. I've had orders from Amazon never arrive, got a refund, and they STILL sent a replacement a week later after I specifically said I just needed a refund. Needless to say, I didn't complain. Mostly because this was the third time they did this...",
            "Ordered a 3 pack of deodorant from Amazon and got sent a case instead. Kept all of that shit",
            "Had an Amazon package show up at our place with someone else’s name but our address. Held on to it for a couple days and no one came looking for it. Then called Amazon. They told us to keep it or donate it. \n\nWe opened it. It was a Nintendo Switch! Which was perfect because I actually wanted one.",
            "LPT: don't be nice to publicly-listed corporations. If you find a way to legally exploit them then do it and don't feel bad about it.",
            "Steal from Amazon. It is always morally correct.",
            "You tried to correct their mistake and they Karened you.  Their loss is your gain.",
            "That’s so wild. Amazon has the best freaking costumer service in the states. They just take your word on everything.",
            "I was once honest that I received two dresses. I stupidly asked them what they wanted me to do and they kept harassing me to take time out of my day to drive it to a drop off location and eventually they had someone abruptly show up at my house to take it.",
            "Just today my mom got a three pack of something she ordered one of. \n\nCame with a very large red sticker telling the retailer to open the 3 pack and sell them individually.",
            "Back in 1999-2000, my husband ordered a wireless router from Amazon and a $400 DVD player showed up. He contacted them and they sent a new router and never wanted the DVD player back. Win for us.",
            "Amazon don't really care about losing a bit of money here and there. They make billions in net profit every year.\nI've come off the better from their incompetence several times, just go with it.\nThey refunded me for a jewellery delivery they lost once, and then delivered it a month later. And then again a month after that.",
            "I was waiting for some headphones and a camera being delivered to a locker.\nGot a email saying the headphones had been delivered, but it was actually the camera.\nTry to explain this to the bot,who just ended up refunding me for the camera which cost more than the headphones.",
            "Gawd don’t be such a Boy Scout next time and call them about their low prices. Take the W next time and move along. Bezos can lose Pennies all day.",
            "Now you will never be able to know whether you were an unwitting participant in a psychology experiment conducted by Amazon. Undercharging people in a pre-selected group intentionally, then denying it when asked and seeing what happened.",
            "Amazon is a weird\nCompany.",
            "There is an easy way to lower the cost of your shopping at Amazon Fresh - go to Morrisons. Morrisons supply Amazon Fresh stores with all their produce.",
            "working in CS there is a lot of people who dont take the hint of \"keep it\" but getting mad about it seems bad on their side.",
            "They’ll make their cash back in tax avoidance, so relax!",
            "I’m here for the malicious, but you lost me at the haloumi. Haloumi is life.",
            "Looool, if you still have too much halloumi, I'll take it off your hands, I'm London based too and just got into halloumi addiction  :)",
            "Amazon was rude to you so you went out of your way to patronize their business more?",
            "Wait, did they rebrand the Amazon Go stores to Amazon Fresh overseas? That's a mind boggling choice, given its the name for their grocery delivery service in the U.S., at least.",
            "While it's nice that you did the right thing, people have to remember these big companies don't really care about their customers. They aren't on the customers side, no company really ever is.\n\nSo when you call up saying you got charged less than what you were suppose to, all that company will be interested in is 2 things - The products that are priced wrong and getting their money.\n\nThere will never be a special reward or thank you token. There is no pass go and collect 200. It's simply give money to big corporation and tell them what they fucked up.\n\nAnd if it was the other way around, the only reason they'd ever give you your money back if you were overcharged is to protect their image.",
            "I ordered a ring doorbell pro from amazon, it was on sale, normally its 400 in my currency. It was down to about 250. So I thought, Bargain and it comes with a Echo Show free as part of the deal. So I go through checkout and pay then after its shipped I realize the price, I only paid about 170. They deducted the price of the echo show from the price of the order but the problem was is they didnt add the price to deduct it to begin with so the price came off the doorbell. The doorbell chime pro was also in my delivery, thats another $50 but I never ordered that.",
            "A relative had a lucky break at least a decade or two ago when high end laptops were first sold online for thousands. He went to the manufacturer's website to buy one and they were supposed to be £10,000 each, but a typo made them £1,000 each. So he bought 10 and sold the extras to his friends at a steep discount. No one from the laptop manufacturer ever contacted him and I'm not sure how long the error was there before it was fixed.",
            "They delivered me a 50 inch television to my home address, addressed to me in my full name. I called because I did not purchase the TV, my credit is locked so it cannot be identify theft. They claim they put my label for another item and the TV and I could keep it for their mistake. But that did not make sense because I had also gotten the item at the same delivery. So they treated me like I was crazy and now I have a free 50 inch TV that I have zero need for.",
            "The craziest part of this story is that you live in London and have a garage. I’m jealous",
            "Meanwhile, somewhere out there is an Amazon worker bragging to his friends about how he got even with Amazon for treating him like shit by mispricing stuff. And how some Amazon management is so stupid that they trust the computer over common sense.",
            "I once went tp buy some Batteries, price tag said 5.95.- when i went to the cashier, it was only 0.40.-.\n\nAs the honest human i am, i said thats wrong and just got a rude answer. Something like \"No that's the right price, the machine said it. And i am the manager, i know all my prices.\".\n\nI just said wait a sec and picked up a basket full of batteries. Ended up spending 60.- on batteries.\nAnd resold them online at 4.- each.",
            "Years ago I got a charge in my bank account for not having the funds in my account for covering a small payment, around £15 maybe? Issue is I have over £200 at the time. I was heading into town anyway so went into the bank.\n\nThe woman just wouldn't listen. Told her over and over and over again that I had far above the funds needed. But she wouldn't listen,  just kept saying that's standard charges for not having the funds. Eventually got a manager who immediately saw the error, apologised and refunded me.",
            "Amazon are horrible they even treat there staff like crap too I've got personal experience with that I won't go into detail",
            "Maybe consider donating some of those super cheap toiletries? I bet with the pandemic, the shelters are near bursting",
            "Love some fried haloumi. Well done for trying to be honest and letting them know. At least you got to help out some other people from it.",
            "Meh. Won’t even register to them. Less that a rounding error probably.",
            "It could be more costly for them to resolve the issue due to product handling and the call centers are probably over worked/under paid.  You didn't do anything wrong as I'm sure you already know.",
            "This happened to me when I tried to tell Walmart customer service that they double refunded me for a mini fridge.\n\nI don't think the woman could grasp that I was telling her they gave me too much money.",
            "I mean …. It’s an honest mistake.",
            "There are youtube videos made along similar lines where people would show how items could be stolen then they went back to Amazon, explained and offered to pay for the items. \n\nAmazon was unconcerned with the free items and seemed much more upset with pricing what happened. The most common theory seems to be that considering these locations were (and still are) so few that they valued the PR and reputation for a new tech revolution than they cared about losing money which is nothing for Amazon. Also, reduced work force likely offsets money lost via theft and mistakes.",
            "I have a similar story. I ordered one of those gaming chairs that look like a racecar seat (would not recommend btw) from Amazon. A couple of days after it was supposed to arrive, I still hadn't recieved it but Amazon changed its status to delivered. I contacted them saying I never got it so they initiated a lost product claim or something. I got a refund, and the chair arrived the next day. I tried contacting Amazon multiple times and even spoke to some sleepy rep so they could charge me again but they insisted nothing was wrong. \n\nGot the chair for free but I hope the seller got some sort of reimbursement.",
            "To Amazon, it's a tech showcase. It doesn't care whether the store makes money or not.  They care if it chaeges correctly.",
            "My wife made a walmart sale her a mispriced laptop, I was with her but I stopped by the sporting goods looking for something else. When I caught up to her she told me what she'd done, so I did the same. That store lost $600 in just a few minutes. Not that itll matter to them.",
            "I had an American Express corporate card. I travelled on business and spent about £1700. Around about the same time I set up direct debit so I could pay it off easily. I wasn't sure if I'd set it up correctly so I sent a check in anyway. A couple of weeks later I check the balance and it's +£1700.\n\nI called Amex and they said they had debited it from my account. I checked all my bank accounts and couldn't see where they debited it from. So I called them and explained they'd debited it from the wrong account. They thought they owed me the money. I called them about every 2 months for 2 years and tried to tell them. Eventually I left the company, cashed out and closed the account. That was about 18 years ago and I've never heard from them.",
            "> got treated like a dick\n\nIs that a bad thing or a good thing?",
            "Pricing is largely arbitrary when you get to big companies like Amazon. It's used more strategically than as a measure of anything. Amazon has been caught taking a bath on a product just to push a competitor out of business. \n\nSo it likely wasn't a mistake, it was likely an incentive. Price a few things well below manufacturing cost while many other items are priced well above market value. \n\nYou ended up spending more with them than you otherwise would have. That's how using pricing strategically works. \n\nThe customer service rep probably didn't understand you. Most people aren't thinking of Amazon's best interest, considering Alexa taking biometric data, or how they treat workers.",
            "This is why you should be a careful listener--especially when engaging with a complete stranger",
            "What if they did it on purpose?! So that people come back again and again thinking they're screwing up \"big bad corp\". As the old saying goes \"somewhere in the books it's all accounted for\"",
            "Praxis would have been buying every single one of those items in stock and giving them to your homeless neighbors. Let them eat fancy cheesecake on ol' Jeff's dime.",
            "This isn't your MC, it's the employee's. They aren't paid enough to care about Bezos not being the richest man on Earth. For all he cares, you got everything right and don't dare keep reporting it or someone will have to deal with the issue.",
            "Mmm, halloumi!",
            "I can’t imagine getting sick of haloumi. :)",
            "CS is drilled in \"act mean and refuse, or be as unhelpful as you can\" without any deviations of the script it seems...",
            "Yeah, this happened in the Amazon markets when they first launched in Seattle, but I don't think many people said much given how the city feels about Amazon currently.",
            "Ah man, I wish I had the cheap halloumi connect. Been hooked ever since the wife and I stopped by oily baba’s on our trip across the pond.\n\nI typically try to do the right thing but every now and then something with an Amazon works out in my favor and… I dunno, seems probably more expensive for them to fix it than for me to just move on",
            "Maybe they charged less in the store since they don’t have to eat some of the shipping for prime customers.  \n\nMaybe everything is just a little more online due to that?",
            "I laughed so hard at this. \nThank you for the awesomeness.",
            "Lul",
            "I tried doing this at a bagel place on campus that undercharged me one time when I was still a student. Instead of being grateful, the staff just got annoyed and told me to just go because it would be too much trouble to fix. Also got some dirty looks from the people behind me in line. Honesty just sometimes isn't worth it.\n\nAlso should add, I went to that place for breakfast once a week and the same manager was there when I went back. She recognized me immediately and joked about it. She wasn't being mean, but it made me feel really embarrassed, and I never liked going there after that when I saw her working.",
            "The earth is the person who ends up paying",
            "I think this is a ploy by Amazon to get more sales",
            "[deleted]",
            "If I don’t have an amazon account, can I still go in?",
            "Yo, OP, we need some more deets, because I wouldn't mind some cheesecake and halloumi for 9p right now. Take the malicious compliance to the next level please!",
            "I doubt they'll go bankrupt over a few underpricings. How does that caller still have a job?",
            "Watch out, OP. Amazon might force you to work in a warehouse under tornado conditions.",
            "If I ever gets shipped anything extra or at some very low price, I just give it to charity. Fuck giving it back to Amazon, they’ll probably throw it away into a landfill.",
            "I once ordered an SSD From Amazon and they sent me 2. I’m an honest person so tried to do the right thing and get in contact with them but they weren’t having it either. I tried several times with different people on their live chat until I gave up",
            "This is a natural consequence of outsourcing all your support to people overseas who get paid a couple bucks an hour. Still, even with the losses built in, they still probably save money doing it that way.",
            "I hope those extra toiletries aided you well during lockdowns",
            "So what's to stop someone who doesn't have an account from just going free grocery shopping? I can totally see someone sending their kid to pick up groceries or whatever.",
            "This post is impressively both peak r/BritishProblems and peak r/BritishSuccess at the same time, well done!\n\nSounds like the abundance of toiletries and cheese(cake) was an appropriate reward for being an upstanding citizen.",
            "Never heard of Amazon fresh. Sounds scary",
            "Why did you call Amazon and ask them to charge you more 🤣\n\nEven as a decent person, it’s Amazon. They wouldn’t do the same for you. Take your win!",
            "Keep the record you contacted them.\n\nIt is possible for amazon to sue you for the wrong pricing... Yes, large corporation could be this evil.",
            "It is always morally and ethically correct to steal from Amazon",
            "How do they know you have an amazon account? Tempted to pop down to one in my mask & hat with my none existent account",
            "I had several similar experiences with “ABC” drugstore. The med came in a 2-pack, but my Rx was for just one unit. Last time they said not to bother…apparently it messed up their inventory. It’s to the point that I have them check when I pick it up!  \n\nThey didn’t charge me for another VERY pricey med for my late husband, and were quite surprised when I made it right. Stinks to be honest, but I can sleep at night",
            "Why tf you gotta be a narc and tell them...",
            "Why would you try and help them in the first place... its Amazon not a children's hospital. Like who decides to help arguably one of the most evil corporations to ever exist.",
            "R the prices still broken",
            "The baguettes in Richmond always get charged as a packet of crisps so...",
            "[deleted]",
            "Once, a mall near my home put stacks of coupon books at all 8 entries of the mall.  \nThere was maybe 100 books per entrance and they were full of \"10% off dresses for XYZ shop\", and \"buy a bagel and get a free small coffee\" type Coupons.\n\nI grabbed a book out of curiosity, maybe an hour after they put them out, and when I saw the Popcorn one, I called my Brother to come down with his sports duffle bag and we snatched up every single book. (Yes, nearly 800 books)\n\nYou see, the Cinemas (movie theatre) had a coupon for \"1 free large popcorn\"... and that was it. No Expiry date on the coupons, no purchase requirement, no need to be there to see a movie, no conditions in any way... just present the Coupon, get a free plain large popcorn, end of story (with salt and butter sure, but not a fancy flavoured one).\n\nWe ate 1 or 2 free large Popcorns (each) every day for months off that error and not once did any staff at the theatre question why the only time they ever got a coupon handed in, was from one of two specific individuals (my brother or myself). \n\nI walked through the mall every day on my way to and from work, and they never put any more coupon books out with those same coupons inside (the movie one offered a free small soda with every movie ticket purchase)",
            "how many actual slaves drive the profits of amazon\n\nlike\nhow many young boys and girls\nmen and woman\nare actually held in bondage and forced to labour for the profits of that company\n\n\nthousands or millions?",
            "[removed]",
            "I'm actively fomenting pro union attitudes at the whole foods I work at and I also purposefully slow down amazon shoppers when possible.",
            "[deleted]",
            "Mind giving us an idea of how much the price discrepancy was OP? /u/Accomplished_Week392",
            "Love when this happens. They make you feel like a villain for getting a good deal.",
            "If the price is wrong the Amazon overlords kill the employee so they were freaking out denying the error.",
            "So that's why there were worldwide shortages of toiletries 1-2 years ago",
            "My partner used to work there",
            "Tbh she’s my name, again my name is Mr. Stevens?”\n\n“He’s be honest. They steamrolled themselves. Rip",
            "I know you're trying to be nice but what-in-the-bootlickin' is this? Amazon can take the hit. Of course you got chewed out, Amazon doesn't care about you and they're not going to thank you for being kind. It's not a mom and pop shop.",
            "Why bother trying to “be honest” and “do the decent thing” with Amazon? They don’t with you.",
            "[deleted]",
            "[deleted]",
            "Do you not understand how a job works? Why do you expect the CC person to care, about what the other departments responsible for pricing are doing?",
            "This should be on /r/iamathief instead of this sub.",
            "There goes another toilet paper hoard opportunity.",
            "I too, have gone off Haloumi cheese.",
            "That’s not Amazon Fresh",
            "after reading through comments i begin to think that for businesses is more profitable to lose items than to admit they made a mistake.",
            "Amazon have issued me random refunds for products I never requested a refund on & definitely never sent back. Every time I try to rectify it they misunderstand and say it's already been refunded. I just see it as a little present from Jeff at this point.",
            "Amazon Fresh regularly underprices things on the website. Depending on their inventory or deals, you can sometimes get things for as low as 1¢. It doesn’t sound like there was an error.",
            "From these stories sounds like Amazon is pretty good at giving away free shit",
            "At Walmart one time got a measuring cup set that scanned in at 1 cent. Was tempted to go back in and grab a whole bunch to just hand out to friends in case they needed a new set. \n\nAlso recently my GF found a Top Gun board game at Walmart and it ended up scanning at 2 cents. Looked like the last one on the shelves.",
            "Could have been loss leaders (if that's the term?) — companies always charge a significant mark up in order to create profit, but they also profit just by having you at their store, as you are not at someone else's, and most people will purchase additional items they didn't go there for.\n\nSo sometimes it's worth it to a store to take a loss on one product that is cancelled out by the profit they make on the other products purchased and the fact they got you in their store instead of you going to a competitors.",
            "/u/csm10495-bot !subscribe",
            "Reading all the comments on Amazon shipping errors, this post might actually explain that!\n\nhttps://www.reddit.com/r/MaliciousCompliance/comments/ryj8u5/shipments_going_out_of_time_the_most_important/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Sounds like the vending machine at a place I used to work.  The guy that stocked it put in two new items (beef jerky and something else, can't remember) that should have been priced at $1.25.  Trouble was, if you put in the exact amount and selected one of those items, you got the item and $1.20 change back.  Funny, those two slots usually sold out within an hour or so of being filled.",
            "A lot of people here are so honest. Literally 30minutes ago I was at the shop and bought a 4 pack of drinks. When the guy scanned the pack, the scanner picked up the barcode on both the pack and the individual can. \n\nHe voided the pack price instead of the can. You know I kept my damn mouth shut",
            "Thing is, I'm almost certain you played yourself here. Amazon's profit margins are pretty wide, generally speaking. Most likely they didn't take a loss from the pricing errors, and you bought a bunch of stuff you didn't really need because you thought you were getting a good deal. Wouldn't surprise me if they did it on purpose - 5 dimensional marketing.",
            "They still have pricing errors with their camera/computer system. I got overcharged today. A royal PITA to get it corrected. Next time I do, I am going to use the cashier in person, so I can get charged properly. Its a shame cause I was really excited to not have to wait in line, and use this store.\n\nI will keep going though, because they have some of the best grocery prices and a frequent 20% off sale if you are a prime member.",
            "I wish this would happen to me, but I've been overcharged several times. It's always a friggin' nightmare trying to get my money back. I try not to shop there anymore."
        ]
    },
    {
        "post_id": "8x1o3n",
        "author": "Hippo_Singularity",
        "title": "When we say it's not pumpable, that means it won't work with the pump.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8x1o3n/when_we_say_its_not_pumpable_that_means_it_wont/",
        "score": 14220,
        "num_comments": 562,
        "created_utc": 1531058975.0,
        "selftext": "I'm a truck driver.  More specifically, I drive a concrete mixer.  That means a large part of my job is dealing with people who know nothing about the material, nothing about my equipment, but still think they know better than me, since I'm obviously just an evil-smelling, gap-toothed hillbilly who didn't graduate high school.  In short, concrete is what happens when Malicious Compliance goes for a drunken joyride down the Dunning-Kruger Parkway.  \n  \nSo, on this particular day, I was pouring at a school out in the middle of nowhere.  Our plant was the closest one to the jobsite, but it was still a half-hour away.  It was also over 110 degrees (schools usually do their renovation and repair work in summer).  The order indicated that they were going to use a concrete pump, and the manager (we will call him Bob) told me to throw in some fiber.  There are a few different kinds of fiber we use, but the only one that works with a trailer pump consists of small squares woven out of a cotton-like material that come apart in the mix.  I throw that in, because it's a pump job.\n  \nSo we get onto the jobsite, and start pumping.  Everything is going well for the first couple yards.  Then the pump's reducer (a pipe running across the front of the pump) snaps, swing out and slams into my foot.  I wasn't hurt, but it turned out the pumper knew the pipe was getting thin and ran with it anyways.  Now I'm pissed; those pumps operate at massive pressures, and I have seen them blow concrete hard enough to knock a man over 20 feet away.  If I hadn't been wearing steel toes, it very well might have broken something.  \n  \nEventually, the customer comes over, to see what the problem is.  He looks down at the pile of concrete dripping out the broken pipe, prods it with his foot, and asks, \"Where is the fiber we ordered?\"  I explain that the buckeye fiber can't be seen after it mixes into the concrete, but assure him that I added it personally.  He then starts yelling at me.  He didn't order buckeye fiber, he ordered plastic fibers.  He pulls out his paperwork, and sure enough, that is what he ordered.  I admit it was a mistake, but also tell him that the fibers he ordered won't work with the pump he is using.  The inspector tries to explain that what he got is as good or better than what he ordered, and he is willing to sign off on the change.  Customer isn't hearing any of it.  We finish the load, and the customer orders another ten yards.  I call it in, adding the bit about the broken pipe and that the customer was upset that the first load had buckeye in it instead of plastic fiber; Bob can hear the guy swearing at me over the radio.  \n  \nNow Bob tends to be very protective of his drivers.  He is also more than willing to let customers hang themselves with their own lack of knowledge.  I once watched him batch about $1,400 of liquid stupid, because a customer ordered concrete with both an accelerator and a retardant in it.  Bob could have loaded another truck right there and then, and shipped it out.  Instead, he noted that only one truck was scheduled for that job, and waited for me to drive the half-hour back to the plant.  Then he batched the load (with plastic fibers) and brought the ticket down personally.  As he handed me the ticket, he said, \"Don't forget, they ordered at a 4-inch slump.\"  \n  \nConcrete slump is a measure of how wet it is.  It's measured by packing it into a 12-inch tall cone, setting it on the ground, pulling the cone off and checking how far the pile of concrete dropped (slumped).  4-inch is something of a default order, but the only things you pour that dry are footings and curbs, and you don't put it that dry into a trailer pump.  \n  \nSo I load up and drive back to the job.  By now, they have been sitting out there for over an hour in 110-degree heat.  The pumper is panicking, because the concrete is setting inside his pump, and the patch of sidewalk they are doing is going to have a great big cold joint (fresh concrete poured against set concrete makes a weak joint that is more likely to crack) down the middle of it.  As soon as the concrete reaches the back of the drum, the pumper tells me to stop and add a bunch of water.  The inspector authorizes 10 gallons.  It's still dryer than the pumper wants, but the inspector won't allow more.  Then the concrete hits the pump's grate.  Everything is fine for a couple seconds, then it just starts piling up without going through.  All those plastic fibers were getting caught on the grating and clogging it up.  The gravel can't get through with the fiber blocking things up, so all that is getting pumped is cement and water.  \n  \nCustomer comes out furious.  He accuses Bob of spiking the load with extra fiber and tries to reject the load.  I point out that we warned him the load would not be pumpable, and besides that, by having me add water to the load, they have already bought it.  So now we are pumping a few seconds, clearing the grate, then pumping a little more.  It took about three hours (which translated to about $300 of standby charges).  Most of the fiber didn't go through the pump (the pumper didn't want me throwing the giant clots of plastic in his hopper), along with quite a bit of the gravel.  The inspector ended up taking a couple samples from the pump hose (normally they only sample at the truck chute), because he knew what was going into the form wasn't what was coming out of my truck.  A month later, when those extra samples failed their 28-day test, the school had to tear out that sidewalk and redo the whole thing.  This time, they ordered it with buckeye fibers.  \n  \nTL/DR: Customer started swearing because I accidentally gave him what the job needed instead of what he asked for.  Brought back a second load the way he ordered it, and it made the entire job fail inspection.  Also made a pumper whose poorly maintained equipment nearly injured me stand out in 110 degree heat for several hours.",
        "permalink": "/r/MaliciousCompliance/comments/8x1o3n/when_we_say_its_not_pumpable_that_means_it_wont/",
        "comments": [
            "I know nothing about concrete but that story was really well-explained. Nice one OP ",
            "If there is one thing I’ve learned in my short time on this giant blue marble, listening to the professionals will usually end up saving you money. Especially if you are really polite to them. ",
            "I love it when the customer is an ass and it ends up costing them big",
            "Well , for an evil-smelling gap toothed hillbilly who didn't graduate high school you explained this malicious compliance very, very well. Props to your skills.\nGreat compliance. Give the man what he wants. Sometimes you have to let them learn the hard way. \nGlad you didn't get injured.",
            "Considering how fundamentally important a material in construction it is it’s amazing how few people understand concrete. I’m no expert but at least I know I’m ignorant on some aspects. Loads of engineers and contractors will insist that they know better than the manufacturer. \n\nRecently we did a few bridge infill jobs using foamed concrete and it took hours to explain that no, you can’t pour foam concrete in 1500mm layers. All it takes is a quick read of the spec sheet but some guys insisted it wasn’t the case until I opened the sheet and highlighted the relevant text. \n\nThese guys work with concrete all day, I think they know about their product better than you. ",
            "I'm glad Bob stands by his workers. This malicious compliance was sweet, but I'm still angry with the pumper for using dangerous equipment; his irresponsibility could get someone seriously hurt. ",
            "“Drunken joyride down the Dunning-Kruger Parkway”\n\ngoing to use this someday because it’s so funny. Will try to remember to give Reddit stranger credit!",
            "This is not my story. This is a story told to me by a co-worker that lived out in the country.  \n\nHe had just bought a house in the country. And on his way home a mile or so down the road from his house there was a house.  And in front of that house was a large dome of concrete.  It was very out of place.  Just sitting there in the middle of the yard. Finally he asked a neighbor about it.  There had been a guy living there who wanted to make a driveway or something, and he ordered a truck.  The truck came before he was ready, so he told the driver just put it there and he'd take care of it himself.  So that's what the driver did.",
            "[deleted]",
            "This is how you treat stupid ",
            "What sucks is that this was a school project which means this cut into school funding and probably had to come out of other budgets or at least other budgets for renovation and improvement and therefore ended up hurting children as well as wasting tax dollars just because some asshole didn't know well enough to listen to the technician who deals with this stuff every goddamn day.",
            "Oh, man. I used to drive a mixer truck, this takes me back, OP! In my short time in the cab, I found most concrete contractors to be methed-out jackasses who were always behind schedule (if you ain't pouring mud, you ain't makin' bucks). Way to stick it to one of them, for all of us! :)",
            "I only understood what was going on here because essential craftsman taught me about concrete. Great story",
            "What a stupid person. Let the experts use their experience and trust them.",
            "Thank you for a lesson about concrete. ",
            "I used to pour concrete, and their skill at getting the truck into crazy places, alone, is enough to deserve respect. Plus, the driver can be the difference between pouring a whole wall with a couple shovel pokes vs pulling 4 yards over ten feet.",
            "As a concrete pump operator, mixer truck driver and former aci certified concrete testing technician I love this story. \n\nI can vouch for the pressures OP described, concrete pumps can develop massive amounts of pressure in the pipes and if one blows its akin to a shotgun blast at close range. I've been thrown ten feet through the air when a blockage occured in the whip hose and suddenly released while I was holding it in front of me while priming the pump (concrete placing boom pump, not a line pump)\n\nCustomers can be incredibly fucking stupid and simply don't understand anything about how it all works.",
            "> In short, concrete is what happens when Malicious Compliance goes for a drunken joyride down the Dunning-Kruger Parkway.\n\nThis is fucking beautiful.  My oldest friend is a mason of like 25 years.  He's told me a lot of concrete.  Whole story was an absolute joy to read.",
            "I now have a weird desire to learn waaaay more about concrete. I've never poured it, probably never will, but that was super interesting.",
            "My dad was a materials engineer who specialized in concrete (freeway interchanges, bridges, etc). I haven't heard anyone talk about concrete like this since he passed away in 2001.",
            "I upvoted by the last sentence of the first paragraph. I love you, my hillbilly brother! ",
            "\"Not the curb that school needed, but the curb it deserved\".",
            "Just out of interest, what is the purpose of the \"fiber\" for?",
            "Apart from the MC, I just enjoyed reading about concrete pouring. Very interesting!",
            "Scratch another one off my bucket list. I've finally met the world's most articulate evil-smelling, gap toothed hillbilly who didn't graduate high school. ",
            "I only know what you're talking about because I built an ICF house once;  18 separate pours (ha, I feel my heart rate going up just thinking about it five years later).\n\nMy take-away from that was always bring more people than you think you need, always start as early in the morning as possible, and always, always treat your concreted drivers and pumpers like the magicians they are.\n\nYou usually only have one shot and they are often the difference between a beautiful finish and an unmitigated disaster that you will be chipping out for months.",
            "Can one of you gap toothed, uneducated hillbillies please explain to a college-educated moron what Dunning Kruger is? ",
            "Well-written!  Even this layperson understood the science without getting bored. And at least I have the sense to consider blue-collar workers every bit as valuable (or more so) as white-collar. There's reason I don't do things such as pour foundations for home additions: I know zip about it.\n\nDisrespect people who work with their hands AND brains?  Good luck fixing your car, rewiring your kitchen, diagnosing your plumbing problem.  I like to do the things I can around the house and yard because it gives me a feeling of accomplishment.  I hire knowledgeable people for the things I am not up to. And I listen to them.",
            "I learned more about pouring concrete in this one post than I knew was possible. Well done! ",
            "As a civil engineer, this is a beautifully well written story for professionals and laymen alike",
            "Wow concrete is cool",
            "Interesting! Here in Australia, standard slump is 80mm, 4 inches translates to 100mm.\nAs a builder, I've had similar crap pulled as well, MC with concrete is super expensive and fun to watch.",
            "I work as a Civil Engineer and people always think they know better. It's like dealing with Columbo's idiot cousin.",
            "Not do much related to your post, but more your profession: When I was a kid, I grew up on a construction project (my parents were building a house) so there were heaps of concrete trucks coming over quite regularly (I used to live in the Netherlands, where most houses are made of concrete floors, brick walls, and multiple stories).\n\nAs a result, I loved cement trucks, and wanted to become a cement truck driver when I was a kid :). Not anymore, but you guys still have a special place in my heart, there's just something cool about a truck with a giant rotating tub on the back, which carries a slurry which hardens permanently :P.\n\nJust felt like saying that :D.",
            "I've been pouring concrete in bumfuck nowhere with dingle berries who give me the stickiest, sandiest bullshit I've ever had the displeasure of working with...\n\nI needed this story.",
            "I am a project manager for a concrete company and though I'm a little biased in this regard I think this is a great example of exactly why people need to hire contractors to manage projects they know nothing about instead of trying to save money and act as their own contractor. Shit is way more complicated than people realize, and without a contractor to direct it, malicious compliance like this can play hell with a project.",
            "This is relatable, just that I am not a driver. Im an student engineer working this summer in a construction company. Learned quickly to listen to the drivers, they know what they are doing (and have saved my ass a couple of times). Never underestimate experience!",
            "I do concrete and soil inspections for my current job, fantastic story. I am constantly stunned by how little contractors know about the materials they work with every day.",
            "Were they using one of the little 2\" or so diameter pumps?  You said trailer pump, so I assume so.  Those things suck. I've never seen more than 10 yards go through one without it clogging at least once. The pump trucks I mostly see can pump a 1\" slump as long as it is normal weight, non fiber.  Light weight and fiber are a different story of course, especially light weight.  Also as someone who has tested a lot of concrete, fuck fiber.  It is such a pain to clean up.\n\nYou also seem to be a hell of a lot more knowledgeable than most drivers I've dealt with, which is awesome.",
            "As a former concrete tester, they really effed up that batch. Not only does adding water weaken the concrete, but so does excessive heat.  We were required to document anything that ran over 90 minutes from being mixed to being placed as a non compliance.  Over time the concrete heats up due to the chemical reaction and begins to set.\n\nI once had a project where they weren't moving fast enough and the concrete trucks started to back up.  At one point they had like 15 trucks waiting, and a large number of them were already over batch-to-placement just sitting there.  This was for a big elevated slab pour, so I called my office and they told me that any truck that gets used over its 90-minute mark, we should make an extra set of six 6x12 strength test cylinders (around 30 lbs of concrete each) - normally we'd make one set every 10 trucks.  I had to send a coworker to pick up more plastic cylinders (used as molds) and call in help to keep casting them.\n\nI'm a 5'2\"/120lb woman.  My muscles were killing me after that day.  I was so glad when I got promoted into the office.",
            "There's like 500 comments so I don't know if you'll see this. I was a Marine, learned how to do forklifts and other basic heavy machinery, and have a degree that's basically worthless but was paid for by the GI Bill. I love every part of this story, but that description at the front end just had me bawling.\n\n>In short, concrete is what happens when Malicious Compliance goes for a drunken joyride down the Dunning-Kruger Parkway.\n\nBravo sir. ",
            "A legend was born here",
            "I ride bikes in the hilly part of my town. Why do the concrete mixer truck operators spill so much concrete on the hills? Don’t they make a catcher to fit the truck to prevent spills? If they do why not use one?",
            "I always love it when my expertise and overall intelligence is underestimated.  I let it be a nasty surprise later.  I have also learned (the hard way) to respect \"evil smelling gap-toothed hillbillies\".  They usually have loads of experience that they are happy to share of you aren't an asshole.  I've learned a whole lot and wound up looking very good in the process.  I usually make a point of really praising said \"hillbilly\" up the chain of command.",
            "Should have just gone to the hospital and had your foot evaluated on a Workmen's Compensation claim.\n\nThat stuff needs to be taken seriously right away so your claims don't get denied later. ",
            "I worked 5 summers in concrete. When working with a pump its gotta be 5, 5.5 slump min unless the contractor wants to pay for a new pump. Why not elevate/chute it?",
            "I was a finisher for a few years and I just want to say HA HA. This is hilarious. ",
            "Concrete is actually damn interesting.",
            "Working in construction and dealing with plenty of assholes who think they know best, this was quite satisfying",
            "Please explain liquid stupid. That sounds very interesting",
            "I hope you took Bob out for a drink for sticking up for you! ",
            "Right out of college, after graduating with a civil engineering environmental Engr concentration bachelors and an EIT,  I took the first job I got offered which was a quality control technician for a concrete manufacturer. I pretty much did the same exact stuff the construction inspector did, it was all for the companies records so we could compare results with the actual inspector (most of the time if it was only the inspector, they would half ass the work, fuck up the cylinders which in turn caused failures in the compression tests).\n\n\nI know how that feels. Many times the guy in charge of the site would run over and yell at me for just standing by the concrete truck and wouldn’t listen when I said I didn’t work for him. It was the funniest when they would demand stupid shit just like you mentioned in this story; when I warned them hey would just insult my intelligence saying how I never even graduated high school and shouldn’t be giving advice.",
            "I’m currently in Civil Engineering College and that was a fantastic and thorough story. I’m just learning about concrete this semester and your explanations are spot on. Thanks this was a great read. ",
            "You made that sound interesting, standing in 110F heat, dealing with asshole customers, watching concrete dry.",
            "I didn't know concrete was *that* complicated...thanks! TIL.",
            "As a concrete pump operator myself, this guy pissed me off.\n\nYou're the driver. You control the concrete. If you dont think itll pump, DONT FUCKING PUMP IT. The amount of times I've been told to move the concrete when the drivers said they're not happy with it and its turned out to be a 3 hour fix job blowing the lines is too many to count.\n\n\nAlso, you're not wrong about the pressure in those things. It will kill you. You got off so lucky.",
            "This is awesome. I’m a GC and all the time I’ve got customers asking for dumb shit.  If I like them I can usually explain why they don’t want that but every so often I’ve got one who is automatically suspicious of contractors and confrontational.  Those ones I put every bit of the job and change orders in writing for them and do exactly what they ask for and later when they hate it or see their idea won’t work I charge to redo it. That usually teaches them to work with me instead of against me.  I learned something bout mud from this!  Educational!",
            "I felt like I learned things from this, honestly not entirely sure what those things are but it's nice to have learned some of it",
            "In the CM’s defense, schools (or any public contract) have very little wiggle room for installing anything not in an approved submittal. Especially concrete mix design. Sure, the RFP dictates “or approved equal,” but the key word is *approved*. CM sounds like an asshole, but he did the right thing. It’ll be an approved change order. \n\nEdit: I’ll add that he did make a mistake, but the mistake wasn’t made on pour day. He should have identified this logistical issue during descope with his concrete sub and gotten both fibers approved well in advance. ",
            "HA! I like Bob. Let'em shoot themselves. I'll watch.",
            "I work in an unrelated construction field. This story was awesome as shit",
            "I did concrete work back in high school and this fills me with so much glee.",
            "*\"In short, concrete is what happens when Malicious Compliance goes for a drunken joyride down the Dunning-Kruger highway.\"*\n\nPure. Fucking. Poetry. Thank you for that.",
            "Am a concrete inspector.\n\nCan confirm clients are stupid. I wish I could have tested your job... schadenfreude is my guilty pleasure.",
            "I'm curious what the outcome of that $1400 batch of liquid stupid was. ",
            "Damnit. I’m getting ready to order my first ever delivery of concrete, a 10x10 pad for a hot tub and I’m hoping that my honest stupidity and ignorance and asking for help over the phone will get me the right stuff. My thought was to brace the pad with rebar and use fiber cement, but didn’t know there were so many types of fibers. Damnit all the hell. What have I gotten myself into here?!?",
            "Fuck man, I pulled a screed on jobs like that.  Good malicious compliance, but I can't upvote because it made the job suuuck for everyone down the line.  ",
            "I ran a contracting company for about five years, we mostly did concrete.\n\nI find this story absolutely hilarious as concrete is a tricky beast and you definitely do not want to get it wrong. Foundations being the most important but really getting everything right, the gravel, the slump, the fiber, all at the right mixes for the right job, takes specific knowledge. Most contractors or subs that pour concrete don’t have half the knowledge that the guys at the mixing place have.\n\nThis is just hilarious.",
            "Shit I would have thanked you profusely for analyzing my order and giving me what I really needed. Unsung hero over here. ",
            "That's the thing about being an expert on a subject. People call you in ostensibly for your expertise. Only to do what every they want to do and have an expert to pin it on. \n\nI always put me recommendations in writing now and leave my part on the table for any project in which I am not the lead. \n\nIf anything goes wrong I can alway refer to the hard copy and say \"no, this is what I recommended.\"",
            "My father works as a building engineer. He does general maintenance and supervises vendors. He know a bit about a lot of things but only an expert in hvac as he worked as one for years. He told me listen to the professionals or its your head on the block. Only interfere when you are certain they are wrong. ",
            "I am fascinated by the science and complexity of your story. How mixing certain materials may have very different effects on the end result. I have never worked in concrete before. The closest thing for me is a sack of quikcrete but even I can understand why that customer was an idiot.",
            ">>>Malicious Compliance goes for a drunken joyride down the Dunning-Kruger Parkway\n\nUpvote for great analogy!",
            "[deleted]",
            "As a former field testing technician, I applaud your story.",
            "Another driver here!\n\nSpent about 6 years flatbedding and now run a vacuum tanker hauling oilfield fluids. \n\nHow do you like your job? My wife and I have actually discussed building a home in the near future. I got into doing some research about foundations and have found myself extremely interested in concrete. I love watching YouTube videos of projects and it’s just such an incredible material. There’s a channel called O’Neil’s Complete Concrete and I could watch his videos all day long. The form work that goes into these things is unreal. \n\nIt always makes me want to go set forms in the yard for a patio but I’m too intimidated to follow through with it, haha. ",
            "TIL about concrete! ",
            "Wow. I’m ACI certified (I can be the inspector in this story) and I’ve never seen fibers put into sidewalks. At least not around here. ",
            "[deleted]",
            "I must say, that’s a pretty solid story.",
            "This is my favorite one so far. ",
            "Very well explained interesting story about concrete! Learnt so much about concrete today ",
            "So did they rehire your company to do it? ",
            "Well done. Well written, well explained. \n\nAnd I want to get my street renamed to the Dunning-Kruger Parkway. ",
            "Thank you so much for all the helpful explanations OP. Makes this a very enjoyable read being able to keep up with every little detail!",
            "I generally read a story between the lines, this time I read it in full. People all over the world are assholes.",
            "[deleted]",
            "I wish I could grant another upvote for taking time to explain things. Great story and well written.",
            "Nicely done, and told so well I even learned some things.  Thanks!",
            "I'm in construction and know how ignorant most people are about how things are built,  it's annoying to say the least. ",
            "I would love to read stories about concrete all damn day",
            "Been in concrete since I was 6. \n\nThis is fuken hilarious. ",
            "Who is responsible for emptying the concrete from the truck?",
            "They learnt their lesson the second time. ",
            "I just learned more about concrete than I ever expected.. if I ever need a pour done, I'll leave it to the experts.. ",
            "I feel pleasantly well informed about pumping large quantities of concrete. \n\nOP- how much do you think the redo on the project cost them? Also I would think that it would be a contractor hired, not the actual school, that would be on the hook? ",
            "I feel like a concrete expert now, haha, just kidding. It sounds like there is SO much involved in your job. It's not like baking a boxed cake where you can just toss in water, oil, and eggs and 30 minutes later you're the star of the potluck... You work in a very underappreciated field.",
            "Moral of the story, don't F with the guy driving the concrete truck.  They do it because they are good at it and you will automatically know less than they do about moving that time-sensitive material.  Shut-up and stay out of the way.",
            "Lol this was brilliant. Got what they deserved. ",
            "Well, now I am an expert at concrete because I read a story of it online.",
            "Drove a mixer for a year or so and thankfully the crews we poured for were excellent and I learned a lot from them.",
            "I'm always fascinated by all the stuff out there I don't know anything about, like concrete.  Great motivation to actually listen to the people that know their 💩!",
            "the other day I read a TIFU about the kid who inflated his parts and I'm so glad this wasn't a chain reaction post off of that",
            "A really good malicious compliance story AND I learned some interesting stuff about concrete. Thanks man.",
            "I was a little sympathetic for the customer at first because construction companies do have a habit of saving money where they expect that the client won't notice it.\n\nBut then the rest of the story happened. Great job!",
            "I experienced a good amount of schadenfraude at this. Thank you!",
            "Slump test: https://www.aboutcivil.org/concrete-slump-test.html",
            "Man, I wish the drivers who deliver my concrete had half the knowledge you do. Most of them here are glorified wagon pullers",
            "As a former concrete pumper I can confirm that the amount of people in construction (and scarily enough a fair few are concreters) know a lot less than they should about concrete.",
            "> In short, concrete is what happens when Malicious Compliance goes for a drunken joyride down the Dunning-Kruger Parkway. \n\nNice!",
            ">fresh concrete poured against set concrete makes a weak joint that is more likely to crack\n\nHuh...so I guess this is why potholes always come back.",
            "I used to do the inspecting! I worked for a small firm that General Contractors would contract the materials testing. Fortunately, I never had to deal with this type of shit. I trusted the drivers to know what was going on.",
            "People, honestly.\n\nWhy are they so *dumb*?",
            "I like Bob.  He seems like the sort that has a look that says \"Oh, yeah?  I got this shit...\" and then everybody wishes they hadn't fucked with Bob.",
            "Concrete truck drivers can be a mixed bag, but you should always give the driver respect. In my (currently limited) experience, the drivers usually have a much better understanding of the mud than the contractors do.",
            "Your MC stories are the absolute best. Thank you for sharing. I had a blast reading through all of them!",
            "Man, the only thing I hate about this is that idiot customer wasted school money that could've gone towards better things. ",
            "A call should have been placed before the first trip out to explain the situation. If they still want the original order, bring it. If they change, ask for a written change order.",
            "It seems justice.... is set in stone.\n\nRun you over in my mixer, then reverse over you... that's what I call... A REMIX!",
            "On the flipside, My dad's firm had a lot of issues with the concrete firm \"fixing\" the order since they supposedly knew better than us what concrete we wanted, and being wrong. I like Bob's approach. Let people fuck up. (providing advice is nice, but if they insist...)",
            "what happens if you mix accelerant and reducer at the same time?  what does accelerant and reducer do in general?",
            "Just put her over there. \n\nhttps://imgur.com/gallery/33qcQrt",
            "I work with shotcrete. All the drivers i get could be replaced by monkeys if the had longer legs",
            "This certainly qualifies as malicious compliance, so not faulting it there at all. It's just that while I've been tempted to do stuff like this myself, it strikes me as the professional's job to protect customers from their own idiocy. It may be a battle, but at the end of the day if you helped the customer solve their problem that's what they're going to remember and rate you on.",
            "I appreciate your position and that asshole customer, I’m in residential construction so believe me I know, but cmon man schools already have a hard time getting anything into the budget let alone blowing all this cash because their dumbass was a blowhard. ",
            "> I was pouring at a school\n\n[Do you hang out there after work?](https://www.google.com/maps/@45.4272072,-75.6916994,3a,28.4y,184.2h,99.02t/data=!3m5!1e1!3m3!1sgsrgVAD5qxbC8dM231ExoQ!2e0!6s%2F%2Fgeo3.ggpht.com%2Fcbk%3Fpanoid%3DgsrgVAD5qxbC8dM231ExoQ%26output%3Dthumbnail%26cb_client%3Dmaps_sv.tactile.gps%26thumb%3D2%26w%3D203%26h%3D100%26yaw%3D276.8016%26pitch%3D0%26thumbfov%3D100)",
            "So what is fiber in concrete? What does it do to concrete mixtures?"
        ]
    },
    {
        "post_id": "9e87fx",
        "author": "Origamishi",
        "title": "Sure, I’ll give you the EXACT price you want!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9e87fx/sure_ill_give_you_the_exact_price_you_want/",
        "score": 14223,
        "num_comments": 568,
        "created_utc": 1536446359.0,
        "selftext": "To start, I work at an Enterprise Rent-A-Car in a less... desirable part of Arizona. I’ve been at my new branch for a week now, and customers are pretty wacky so far! \n\nToday, a middle aged lady named Cheryl (name changed) came in to pick up her car, and was furious from the minute she walked in the door. She slams her reservation papers on the counter and demands me to “explain myself”. I smile, and reach my hand out for a handshake to introduce myself (as I do with all my customers). She stares at me, and says she doesn’t have time for “this nonsense”. Alrighty, apparently I have some “explaining to do”.\n\nCheryl was upset that her 6 day car rental, Saturday to Friday, was being charged at the weekly rate of $260, even though she only has it for 6 days. I explained that this rate benefits her, because anywhere from 5-7 days is the same price. To get the daily rate, you take the weekly rate and divide it by 5.  I offered to extend the rental to a full 7 days to take advantage of our weekly rate, and then she went on to tell me that she doesn’t need it for 7 days, but only for 6, and that I better give her the daily rate instead of the weekly rate, or she will never do business with us again. I smile, and say, “Of course I can do that! Your new total is $312”.  Cheryl smiles condescendingly and says “See, that wasn’t so hard! I know that you’re probably not used to us older people with more life experience than you asking the difficult questions, but we’re used to paying attention to the details in order to not get ripped off!” \n\nDumbfounded that she didn’t get upset at the HIGHER price, I walked her to her vehicle, and sent her on her way!\n",
        "permalink": "/r/MaliciousCompliance/comments/9e87fx/sure_ill_give_you_the_exact_price_you_want/",
        "comments": [
            "I would also take extreme pleasure in her being charged more for being a pain in the ass. ",
            ">but we’re used to paying attention to the details in order to not get ripped off!\n\nOh honey.",
            "I wouldn't have been able to stop myself saying, \"Your new total is $312, about sixty dollars more than your previous price.\" I don't think I could work in any kind of front-facing position. ",
            "I also work at a rental car spot in a rural area. Yesterday I had a lady in a government rental take the car 1300 miles in 3 days. Unaware she had a mile limit of 200 per day she is charged an additional $196. I was nice to her and said I can leave this on my managers desk and he can look over it. She proceeds to yell at me and exclaims all of her government rentals are booked with unlimited miles no matter what. No problem if that’s the case the charge will be reversed. She then yells more saying she has to show it to her agency and explain everything and that she is never doing business with us again. I asked to see her reservation to clarify so she pulls it up. In giant fucking letters first line on her email is the daily rate and says “100 miles per day”. She was rude af, I didn’t leave it on my managers desk which probably would have gotten taken off left the charge on and she’ll have some explaining to do. Here’s a tip for rental cars too generally if you’re nice and understanding and you messed up on something they’ll will most likely accommodate to you. This was not the case. ",
            "She must be close to senile. Shouldn’t be driving. ",
            "I have a similar story in the food service industry. I was working at a little mom and pop BBQ place and this group of little old ladies came in all dressed up, clearly just got out of church. The first two ordered uneventfully, but the last lady ordered a garden salad with a side of grilled chicken. So I say okay, grilled chicken salad, because on the menu they are literally the same. Every ingredient, in the same place, same portion, everything, but a side of grilled chicken cost 3 dollars and would be 2 dollars more expensive. She was not having it. I tried to explain it to her, that she'd be spending more money for the exact same thing, but she was positive that I was trying to rip her off somehow. The manager even jumped in at one point to no avail. We rang it up the way she wanted and she walked away all smug like she won something. Whatever, we got out extra 2 dollars and she paid the idiot tax.",
            "Congratulations Cheryl, you played *yourself.*",
            "> I know that you’re probably not used to us older people with more life experience than you asking the difficult questions, but we’re used to paying attention to the details in order to not get ripped off!\n\nY'know, you're right. I'm not used to that. ",
            "I had a nearly identical situation when I managed a blockbuster. Woman came in with 3 movies and wanted to return them. They were 4 weeks late. Normally there would be a $1.25 fee for each of them and she was NOT having it. \"I THOUGHT NO MORE LATE FEES\" No matter how I tried to explain it to her. Eventually I told her that the only way she wouldn't have to pay the restock fee would be to just keep the movies and then she'd just have to pay for the used sale price of them ($9.99 each). She insisted she didn't want the movies and they sucked anyway. I (jokingly) suggested she could just pay for the sale price and give them back anyway. So that's what she did. Paid $30 to get out of her $3.75 restock fees. She smugly said on her way out, \"See, I told you I'd have it my way\".\n\nSure thing lady. I took the movies home. ",
            "A very old couple used to come into the restaurant I worked at in college every week. Every week they ordered two glasses of house red wine. Every week I brought them half a carafe of house red wine, which was approximately 3 glasses and also 2 dollars cheaper than buying 2 individual glasses. Every week the wife protested, and every week I explained again that even if they didn't drink the extra wine, it still saved them money. They were obviously on a budget, as it was extremely cheap wine. They were never rude though, just forgetful. They always actually thanked me, which is why I kept doing it. ",
            "Some people are right fighters. It baffles the mind. ",
            "The one thing I can think of that might explain this is if she was on a business trip and they wouldn’t reimburse her for a weeklong rental. But it doesn’t sound at all as if that was the case.",
            "I really want to believe this story ismfake, but I used to live in AZ. The sun fries their brains.",
            "A rental car cost $52 a day or $260 for 7 days. If Cheryl rents a car for 6 days at the daily rate, how much extra is she spending to be a dumbass bitch?",
            ">$260\n>\n>$312\n>\n>\"older people with more life experience\n>\n>\n>but we’re used to paying attention to the details in order to not get ripped off!\"\n\nhttps://giphy.com/gifs/mashable-l3q2K5jinAlChoCLS",
            "[deleted]",
            "\"Stupid people and their money are soon parted.\"",
            "Was this close to south eastern Phoenix? My vaunted is named Cheryl and this sounds exactly like something she would do.\n\nEdit: aunt* no idea why it autocorrected to that. ",
            "So, weird devil's advocate here, spitballing *why* she may have wanted to pay the higher price:\n\nIf this was for a business trip where she's getting reimbursed, and she's putting it on a card with rewards (say extra points or miles), it would make sense to maximize the amount of rewards received, and the extra amount wouldn't matter if it's getting reimbursed (also, if a reimbursal situation, the company may want to see \"rental for X days\" rather than a blanket week rental).\n\nNow, I can't guarantee that was the case here—she could have just been persistently insistent—but there's a slight chance it was logical.",
            "I've been in your job, same company... People are crazy.",
            "she owned u bro",
            "Are you by chance in Yuma?",
            "Good job on keeping your location vague. All of Arizona is pretty undesirable. (I have been told Tucson is nice, but I assume that's Stockholm Syndrome). ",
            "Enterprise rental a car gives you the tools to be your own boss",
            "Good job! Morons like that deserve the moron tax.",
            "I love me some idiot tax.",
            "I used to be a branch manager in upstate New York. I hated everything about that God damn job. Hope she doesn't get an esqi call",
            " *us older people with more life experience than you asking the difficult questions, but we’re used to paying attention to the details in order to not get ripped off!”* \n\n&#x200B;\n\n\"Cause it's more important that I be right than I pay less\"",
            "> \"I know that you're probably not used to us *older people* with more *life experience* than you asking the *difficult* questions, but we're used to *paying attention* to details in order to not get ripped off!\"\n\nr/iamverysmart",
            "There's a desirable part of Arizona? I assumed the entire state was uninhabitable desert with old white people keeling over from skin cancer and heat stroke while shouting about how people that get abortions will go to hell.",
            "Idiot tax successfully applied. ",
            "Sounds like a real Tunt.  Are you sure her name wasn’t Carol?",
            "At my first job as a bag boy at a grocery store they threw me on the cash register with no training. Some old lady was getting apples and I rang up the wrong type. She procedeed to tell me that as a grocer I should know my different fruit. So I looked up the code for the right apple and they were more expensive. Some people just have to have it their way. ",
            "I usually drop the car off at night when they are closed & get charged for extra things like gas (when I return it with a full tank) roadside assistance (that I NEVER get) etc. or extra time when it's returned early. It's gotten to the point where I have to come in the morning to avoid these charges when they are busy.",
            "I love Enterprise. A few years back I was involved with a very nasty business deal. It was me against a very ugly group of businessmen. Every time I rented from Enterprise, they made me feel like a million dollars. Every time I had to drive to an ugly meeting, they put some much needed wind in my sails. When the deal closed, they all got a cash envelope. ",
            "This lady was a total idiot.  However, I also hate these forced handshakes from random service people I see for a few minutes.  I also decline because I don't know you.  I don't want to shake your hand in the airport where you've shaken the hands of the 10 people in front of me in line, probably more.   Yikes. ",
            "This post has flooded me with Enterprise memories. \n\n\nDid you skill and grill to become a managers assistant? \n\n\nIs your customer service score called ESQI?\n\n\nDo you ever RAP slap to get your numbers up? \n\n\nDid you want her to keep her car for another day so your lot didn't sit fat for the night?\n\n\nAll right. I think that's enough lingo for the day. \n",
            "You shake everybody's hand across the counter? Maybe it's just me but that sounds kinda weird. I'm picturing ordering a big Mac and doing formal introductions with the dude behind the counter.",
            "Enterprise is a ripoff here in UK. For example they rent you a car with a random amount of fuel (usually less than a quarter full) and you need to return the car with no less than that amount. Try guessing how much you need to fill up for your trip especially if you have it just for a day, so most customers just gift them fuel.\n\nAnd what's that with \"a week is 5 days\" bs?",
            "I know that part of Arizona! It's called the entire fucking state. ",
            "Every time I rent from Enterprise for personal use I uber to a non airport location to avoid the franchiser fee. (Sometimes an extra 30-40 a day.) Am I an asshole for doing this?\n\nAlso how come it's not a flat fee per rental and gets applied to every day of the rental? ",
            "At a certain point, you do a quick scan of the room for hidden cameras because, surely, nobody could be that dumb...*sigh*.",
            "People just want it to be their idea. However silly it might be. ",
            "Ugh this reminds me of working with U-haul customers. I had a police officer come in one time with an expired drivers license. I had fun explaining to him that I wouldn't rent to him because of that fact. He tried talking his way out of it since he was a cop, to no avail. He called his GF(maybe?) we waited about 20 mins for her to show up....and I kid you not her drivers license was expired as well. I laughed when I seen the date, they were not amused. It wasn't one or two days expired it was months. One of many of my U-haul customer experiences. Best part of working WITH U-haul and not for them is that if the customers got shitty so could I, but I always enjoyed helping them with a smile. Seemed to piss them off more.",
            "Something tells me that 6th day wasn’t for the full 24 hours so she should have received the hourly rate. ",
            "Hey cool username! I love origami :)",
            "Oh hey cousin 😂",
            "So are you in west Phoenix or Tucson?",
            "Perhaps she’s spending it on some claims requiring the bill to be exactly 6 days, and weekly rate may ruin her. Who knows？",
            "But did you sell that dub?",
            "This would be even more hilarious if you get comission.",
            "What city?",
            "less desirable ? must be the valley right.",
            "Does Enterprise really have an excellent  corporate structure? I hear they give you the tools to be your own boss. ",
            "***You're not my supervisor!!***",
            "I don't get it, Saturday to Friday is 7 days.",
            "Assistant TO the regional manager ",
            "Thus makes no sense. Who walks away with a higher charge and doesn’t notice ",
            "...what the fuck was she thinking?",
            "Some employers will expense the exact number of days the manager approved, regardless of the cost.\n\nBut will complain if additional days are expensed, even if they're cheaper.\n",
            "You can't fix stupid.",
            "Oh boy! I love stories about bad customers at the Green Machine! I worked for erac for about four years, lovely times. ",
            "I really hope there's a follow-through to this story, but I also don't want you to deal with that hurricane, either way - good job OP!",
            "I used to work for ERAC too. Some customers were nuts. ",
            "Me TOO!  Lol",
            ">but we’re used to paying attention to the details in order to not get ripped off!\n\ni would've nearly shat myself laughing as soon as she was gone",
            "Enterprise brought a car to the body shop for me, and I kid you not, it smelled like pickles.  Seriously.  Ew.  I was in a time crunch at that moment, and thought maybe the guy who drove it to the shop had eaten his lunch on the drive or something.  I didn't have time to reject the car out of hand, but the smell didn't go away even after leaving it in the sun with the windows open for several hours.  Enterprise said if I could bring the car back to their store, they'd put me in an upgrade at no additional charge, and promised to make sure it didn't smell like any condiments first.  (It didn't.) ",
            "Dear God, and I bet she votes too....",
            "\"lessee, 2+6 equals 8, while 3+1+2 equals 6, so they're charging me less now. YES!\"",
            "Get used to it, working for Enterprise. Worst company, worst customers. ",
            "Enterprise has teams of people who scour social media for mention of their name.  If they don't like this post they'll do what they can to find you.",
            "Did she come back to bitch again or did she not even notice?",
            "Lol anything for that completely satisfied sqi call",
            "She had to have heard 212 and thought she won. ",
            "As someone who also used to be an Assistant Manager at an ERAC in Arizona, albeit in a very desirable area, but close to Sun City, I've had my fair share of these. I always found it much more fun to circle their final total on the printout and throw out a \"Thank you for your business\" handshake with a smile. ",
            "Starting to think robots are taking over. Cheryl refuses a handshake and is mad that you are making her pay less than what she expected.",
            "Assistant TO THE manager.",
            "Did you load her on on the tier one protection? ",
            "Scottsdale...?",
            "Stupid is as stupid does. ",
            "I worked as a CSR for Enterprise at an airport and the bullshit these customers and businessmen throw at you is so unnecessary. They’re practiced in manipulating employees and Enterprise teaches its employees to take the verbal abuse. It’s maddening. ",
            "I’m going to guess Casa Grande lol I live there. ",
            "What the hell ",
            "Assistant *to the* Manager",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/arizona] [Sure, I’ll give you the EXACT price you want! \\[x-post\\]](https://www.reddit.com/r/arizona/comments/9eb4jb/sure_ill_give_you_the_exact_price_you_want_xpost/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Assistant TO the manager",
            "its a funny thing called Customer service. Everybody complains about something. You are a brave soul. ",
            "To be fair this handshake thing is awkward. But I must admit that the service was excellent. It's a big change for car rental.\n\nNow imagine this woman renting in Paris or Rome... 😀",
            "Phoenix eh?",
            "As a fellow car rental person, I feel your daily pain.",
            "Oh my god. Some old lady did something similar to me. I used to work at a family owned food delivery service, I took orders over the phone. This lady calls and orders fried chicken and a desert. I noticed that for a dollar less, she could make it a combo meal and get a side as well. I tried for a while to explain that she could have the side AND it was cheaper but she just couldn't get it and I ended up just not comboing it",
            "I bet she votes.",
            "Are you in Yuma?",
            "Sounds like Kingman for sure. ",
            "...How is this encounter even possible. damn.",
            "Assistant(to the) manager",
            "This story is unsatisfying because we don't get to see the comeuppance of realization.",
            "It's CAROL!!!",
            "Thank you for paying $52 more than you should have.  My employer will use the extra money wisely.",
            "Was she one of those people who thinks paying more is a status symbol of sorts? :S",
            "I worked at Enterprise for a year and a half, get used to dealing with that question and asshats like that. People treat rental places like an extension of the insurance company that just fucked them.\n\nGranted this is the first time I've ever heard of someone proudly rubbing their higher price in a reps face lol",
            "No fucking way dude. That level of idiocy should not fucking exist LOL",
            "\"...less... desirable part of Arizona\"\n\nNew Mexico?",
            "Holy oversharing personal identifiable information Batman!",
            "This sounds like the people in Tucson lmao",
            "But are you the assistant to the regional manager???",
            "> in a less... desirable part of Arizona\n\nBullhead City? Tonapah? Kingman? Tucson? Heber? Winslow? Nothing? Sierra Vista? Bisbee? Guadalupe (technically part of the Phoenix Metro Area, but like a whole 'nother world when you cross into it)? Mayer? Congress? Miami/Globe? Safford? Oracle? Black Canyon City? Cleator? Benson? Nogales? Florence? Hayden? Winkelman? Dudleyville? Show Low? Bagdad?\n\nOf course I could keep going on; the entire state is littered with these small back-of-nowhere towns with little to nothing to recommend them, who's only source of jobs is either an open-pit mine operation or some other break-back industry (I'm not saying this is bad work - indeed, some of these guys make boatloads of money - but it'll age you prematurely, and what good is a ton of money if you have nothing or nowhere to spend it? I guess it'll make for a good early retirement if nothing else).\n\nMost people in this state either want to live in the Phoenix area, or if they want scenery and a slower pace, somewhere up north (Flagstaff or Sedona are two popular spots). Tuscon is nothing but a giant brown patch, but it does have some interesting scenery (and some great hiking/camping areas around it - some beautiful mountains - and skiing on Mt Lemon I guess) - still, I put it in there because unless you're there for the University, it's not the greatest place on the map of Arizona.\n\nAny place else is almost virtually a tiny \"oasis\" in the middle of unforgiving nature. Some people would call it a \"wasteland\" - I don't, I like the high desert and other areas of Arizona just like they are. I also love the fact that you can transition through 3-4 different climate zones inside of a few hours of driving your car.\n\nBut those out-in-the-middle areas are only for the toughest of Arizonan's to live in, where your nearest neighbor might be miles away, where if you get injured or sick, it's hours to the nearest hospital (and sometimes that's even by helicopter). So those places are, by the definition of most people, \"the less desirable parts\" - because of the lack of infrastructure and such (if they were more desirable, more people would be living there - basically a tautology).\n\nSo I'm curious - what part of Arizona is this \"less desirable part\" that you are working at a car rental place?",
            "While unethical, could you have changed her reservation back to the old amount and then pocketed the remaining difference?"
        ]
    },
    {
        "post_id": "qjoeh9",
        "author": "bag-of-tigers",
        "title": "Supermarket drama",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/qjoeh9/supermarket_drama/",
        "score": 14197,
        "num_comments": 330,
        "created_utc": 1635682943.0,
        "selftext": "Whilst in University I was working in a popular supermarket chain as a Team Leader. I worked evenings, so this meant that I was essentially in charge of the checkouts as there were no managers in. I wore a headset and if the cashiers needed assistance, they would buzz me and I would go help. It wouldn't say what help was needed on the headset, just which number checkout. \n\nOne night, I am in the middle of the store putting away some abandoned items. My headset tells me checkout 4 needs help. On it. \n\nAs I am walking over, checkout 8 also buzzes in. Fine, I will go there next. It takes a good couple of minutes before I get to checkout 4. Some discounted items weren't going through and I needed to authorise something. It took about 3 minutes to put through all the items that the customer wanted and then I make my way over to checkout 8.\n\nAs I approach, I can hear this guy causing a scene. He is moaning about how long I am taking and how incompetent we clearly are. As I get closer I see this middle aged man with his arms in the air in a \"come on!\" gesture, complaining at the cashier that he has been on his feet all day and all he fucking wants is another box of eggs. \n\nI am super polite and ask how I can help. He turns with the biggest frown and I fully expect him to rip me a new one, but alas... he suddenly looks sheepish, and his body visibly shrinks in with shame. You see, redditors, I was 8 months pregnant at the time and as big as a house. \n\nThe cashier explains that the eggs the man chose are broken and he needs a new box. Immediately, he says, \"Oh... um... I can go get them?\" There isn't even a queue behind him; he could have gotten them at any point.\n\nI say, \"No, that's OK sir; you've been on your feet all day. Let me get your eggs.\" I waddle away and take my time.\n\nEdit: Thanks for the love, man!",
        "permalink": "/r/MaliciousCompliance/comments/qjoeh9/supermarket_drama/",
        "comments": [
            "Grocery shopping 101, always check your eggs.",
            "This is the most wholesome malicious compliance story I've read. Hillarious. Just beautiful.\n\nComplaining to _cashiers_ about \"being on my feet all day\"! smh",
            "People make the employees run to grab the replacements? I've had broken eggs before and I just tell the cashier that I'll run back after paying and get another carton. I never thought of forcing an employee to go get them for me.",
            "People really buy eggs without checking them at the egg fridge? They wait to check until they are at the register? That's some special kind of stupid.",
            "[deleted]",
            "So, as soon as he saw you, there was a pregnant pause?",
            "Your condition and helpfulness made him feel eggzactly the way he should.  It was a well hatched plan.",
            "Everyone should do their time in retail, sot hat they can become better customers but also to understand how that environment functions. Many people I know got part time jobs as teens, and on one hand dealing with some stuff at that age was terrible, but on the other hand then you know how not to treat the people doing their job to make your experience better!",
            "I bet those eggs were delicious. Seasoned with all that guilt.",
            "I like the way that broken eggs and fertilized eggs connected you two",
            "Hope he feels like crap after that!",
            "If a customer is not adult enough to check their own eggs, then they shouldn’t be trusted to push a shopping cart.",
            "He should  have checked his eggs before putting them in his cart.",
            "This is just lovely! Well done, OP!",
            "Shaming people, just occasionally, can be very powerful.",
            "Who doesn't check their eggs when they get them.  Lol...",
            "Well, at least the guy had the wherewithal to realize that he had really fucked up and was aware of his mistake.",
            "Once I was at Cosco buying two ready-bake pizzas. At the till I was informed that to get the \"deal price\" for 2 pizzas I had to get the same kind. I was apologetic and said to run the pizzas through as 2 pepperonis, and I'll run back and swap out the other one when the transaction is done.\n\nThe helper said no problem, she'd run back and do it for me. I expressed thanks and appreciation.\n\nWhen she got back, I made a point of looking visibly distressed. I said... \"I.... want a different pizza... I.... don't like the way that pepperoni is arranged\"\n\nThe helper looked immediately exasperated and took on the \"you gotta be kidding\" look on her face. I busted out laughing and she saw I was just teasing her and joined in the laughs. Gottem!",
            "I worked in a grocery store during University \n\nI remember a very pregnant manager lady doing a carryout for a slightly embarrassed entitled lazy person.\n\nAwesome! Hope all is well with your little one!",
            "Always check your eggs, you don’t want them to be bad eggs because next thing you know your kids start adapting their attitude",
            "Pretty please tell me more about his and the cashier's reaction when you got back with the eggs ❤️❤️❤️\n\nHow hard was he blushing? Did he avoid eye contact? Oh my goodness give me every detail",
            "All that angst over eggs?  Such an easily managed situation.  What was this guys problem?",
            "Logic 101: If it's a problem you can easily solve yourself with neither trouble nor cost, do so.",
            "Well your eggs were obviously OK!",
            "I spent 5 months doing both day and night shifts in my store's dairy department and the only thing I have to say is fuck eggs.",
            "I worked grocery retail for 18 years, love this story!",
            "Yessssss",
            "“Yes sir, and we here at grocery store and basically every other store in existence also are on our feet all day.”",
            "There are fewer things than a pregnant lady working that will shame most men.",
            "His feet were sore, so instead of spending 30 seconds to walk over and get a new box, he’s okay with standing and waiting 8 minutes for a new one? I don’t know about you guys, but when my feet are sore, nothing is worse than standing in place. At least walking gets the blood flow moving.",
            "Did you return a couple months later, with help?",
            "> I say, \"No, that's OK sir; you've been on your feet all day. Let me get your eggs.\" I waddle away and take my time.\n\nI hope he can look up the nearest burn center.",
            "Oh, \"No, that's OK sir; you've been on your feet all day. Let me get your eggs.\" when you are dans une certaine condition, would be worthy of r/murderedbywords if they allowed this sort of post.",
            "At least the man knew the number one rule of life.  Don’t mess with a pregnant lady.",
            ">\" I waddle away and take my time.\"\n\nImmediate upvote, both for your action, and for your eloquent description, \"waddle away ...\".",
            "> I waddle away\n\n🎵 from the troubles in my life 🎵",
            "So was it a boy or a girl?\n\nEdit: is it",
            "Then she waddled away waddle waddle till the very next day",
            "The \"Team Leader\" title reminds me of Meijer. Used to work at a meijer as a dairy stock clerk several years ago and our managers were called team leaders.",
            "Welcome to cub foods.",
            "Some Safeways puts unbroken eggs from broken containers into a new container and charges 0.99 per dozen. I love getting those, you can get egglands best for 0.99! Awesome",
            "[deleted]",
            "The biggest surprise from this story is that places actually exist that force employees to come in to work at 8 months pregnant. wtf",
            "Neat. Pick me up some bread too",
            "Well that was rather anticlimactic. Your MC really only hurt yourself.",
            ">There isn't even a queue behind him\n\nWell sure, the people behind him found other cashiers by the time you bothered by.",
            "And then your unborn fetus clapped, right?",
            "What or how are you going to sell broken eggs?",
            "Buhahahahaha very nice. Well done mom. Congrats on your bundle of joy!",
            "He should have known that you could do as good a job of egg fetching as a non-pregnant person.  Otherwise, it would validate all of those rascals that used to adjust hiring practices to the myth that you wouldn't be.  Yay you.  Good job.",
            "Let us observe this scene:\n\nOne cashier is not allowed to sell some 1.50 bag of bread for 1.20 without a nuclear launch code.\n\nAnother cashier is not allowed to replace a defective carton of eggs.\n\nA man who has worked his ass off all day has to sit in line waiting for codes to go through so that he can get one fucking box of eggs. Why doesn't he just get his own eggs? Idk, because he's tired as fuck and it didn't click in his brain that he's allowed to do things that are not procedurally recommended by the corporate steel hellscape he's forced to peruse on this evening.\n\nThe store is inadequately staffed, and an 8-month pregnant woman is cleaning up and managing a store instead of resting literally anywhere else.\n\nAnd this grocery chain no doubt has made record profits in this year 2021.",
            "Not sure if I understand. I get the compliance part - you got the guy a carton of unbroken eggs. What I don't get is how this is in any way malicious?",
            "Wow, it’s almost as if workers are… people too? No, that can’t be right.",
            "Fuck whole foods",
            "You were 8 months pregnant in University? That must have been hard.",
            "Loving the use of waddle. My wife also described any movement the same way when she got past 6/7months",
            "Guessing this is in the UK?",
            "> I was 8 months pregnant\n\nWhy you wasnt on maternity leave already?",
            "Honestly, if the market takes the time and effort to get headsets, they could have gotten speakers. As far as I know, all Aldis in my area have updates their systems so that each employee has an earpiece and on their collar a speaker. When they need something, have a question, they simply push a button on their collar and they can speak with the other employees, ask for a price, get a new register opened and similar.",
            "*Love* the way this was written, holding the punch 'til the right moment.  Well done, OP!",
            "Wait, who checks their eggs at the cashier?",
            "What I saw in France in a few supermarkets was a tower of trays of 100 eggs (10x10), and another tower next to that of empty egg-boxes that held a dozen. The customers would take eggs from the 100-tray and fill an empty dozen-box. I don't know what subsequently happened to the trays that held a few stuck or broken eggs, but each customer got a personally-checked dozen of unbroken eggs."
        ]
    },
    {
        "post_id": "n1ts2s",
        "author": "Kleefish",
        "title": "\"My house my rules\" okay!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/n1ts2s/my_house_my_rules_okay/",
        "score": 14198,
        "num_comments": 444,
        "created_utc": 1619789089.0,
        "selftext": "So a few years ago my dad was moving out of his house and in with his parents due to some health problems with my grandma. This was iver summer break and i was just out of high school at the time, about to go into college so i had absolutely nothing to do all summer as i waited to move out of state.\n\nMy dad never was and still isnt super organized, where as I am *alphabetize my own bookshelf with a full system* Type-A about keeping things in order. Call me weird but i really enjoy reorganizing things/cleaning, it just hits that button for me. \n\nSo being that he had about 2 months until he closed on the house, i just start to pack up some of the house for him (basement was a DISASTER and i had wanted to tear it up for years). So within the first day i had made a significant dent in the basement, which ended up being a very involved process. I didn't realize when we had moved in that a lot of the stuff from our old house was still packed haphazardly because my brother and i were too young to really help. So i went through the process of unpacking the still packed boxes from house 1, labeling the boxes the way i wanted to and then repacking those boxes appropriately. After about 3 days of this i get about 50% done, including cleaning/packing my room and some of the garage. \n\nHeres the buildup to the MC\n\nMy dad comes down to help me, all good with me. I start explaining where things go and my dad wants to change it. I resist, explaining that i already have the system and that i have been doing the bulk of the packing so he should probably just go with me on this one which is when he hits me with the namesake of this post.\n\nSo i relent, because i know what will happen. \n\nAnyone thats really type A will agree with me that the only thing more frustrating then things being chaotic and out of order, is things that are *slightly* out of order. Which is what i KNEW would happen. Regardless of the fight dad and I had, he ended up almost following the system. Mostly things that belong in the labeled boxes went where they were supposed to, except for a few VERY important odds and ends that got put... well... not where they were supposed to. I noticed this but because of \"my house my rules\" CLEARLY he has a plan so i dont say anything -.-\n\nI knew the payoff was going to be a slow burn, and it came several months later when i was in school across the country and unable to help.\n\nDad calls me one day very flustered because he cant find something he NEEDED. He had been in the storage unit he rented in my hometown for the better part of three hours looking. \n\nNow the storage unit got packed HORRIBLY by the moving crew, i have been in there a few times after this story and i feared for my safety, its a legitimate labyrinth/jungle gym and a nightmare to get through, not to mention this was mid summer and there was no AC.\n\nSo dad is mad on the phone asking me where it is and i ask him if its in the box I labeled in big red sharpie IMPORTANT SHIT. He says no, and i smile a bit. Then he says, well you were in charge of packing all of this stuff and now I can't find it. That's when I calmly reminded him of the blowout fight we had over this exact issue and how he commandeered my operation afterwords. I told them that if I was actually in charge it would be in the box labeled important shit. He hung up on me after that.\n\nI love my dad and I had no problem helping him out, we laugh about it today but I can't say I didn't get a good chuckle at the thought of him sweating and cursing climbing around in that fucking storage unit death trap. He recently found another place to live now that my grandparents have more in-home assistance and I've already worked out that I'm gonna come help him move. \n\nWe already agreed I'm in charge this time.",
        "permalink": "/r/MaliciousCompliance/comments/n1ts2s/my_house_my_rules_okay/",
        "comments": [
            "Good story with an ultimately good ending.",
            "I have a whole house for you to organize, OP. Free reign. I won’t bother you. Organize to your heart’s content.",
            "I wish I had a relationship with my parents where they would hang up on me. Instead it's an awkward and unemotional one where we pretend everything is fine and say cordial goodbyes",
            "Can you come organize my house for me??",
            ">I've already worked out that I'm gonna come help him move.\n\n>We already agreed I'm in charge this time.\n\nThe *ultimate* moving helper is a Big ol' Dumpster.     If the stuff was sitting in storage for months, does he *actually* need it?",
            "When you are asked to help somebody/do something, it's best to settle who's in charge from the beginning. This helps reducing the chance of arguments, as the people not in charge just surrender and usually end up malicious complying(if they were right).\n\nnicely done op",
            "Slow burn is best burn.",
            "Very frustrating i can relate\n\nI try my best to keep things organized and have a system yet my wife is not only the exact opposite, i think she deliberately does it more awkwardly because ive suggested doing it an easier way.",
            "Please come organize my ish",
            ">alphabetize my own bookshelf\n\n...There are people don't alphabetize their books?...",
            "You wanna be my brother? I'll invite you over for BBQs and let you organize my house however the fuck you want.",
            "the main thing i miss about my ex is that she was a fabulous organizer. however, one of the top reasons she annoyed me was that...she’s a fabulous organizer. \n\nwhen she told me, in all seriousness, that my garbage can was in the wrong place - and then doubled down when challenged- i started to reconsider my choices.",
            "\\>My dad never was and still isnt super organized, where as I am *alphabetize my own bookshelf* OCD about keeping things in order. Call me weird but i really enjoy reorganizing things/cleaning, it just hits that button for me.  \n\n\nDo books beginning with the word THE belong in the T's or do they belong alphabetically by the second word in the title?  \n\n\nDo books beginning with numbers belong in their own numbers section or do they belong alphabetically by the first letter in the written number? If books with titles that begin with a number get their own section is that section before or after the alphabetized books in order?",
            "Organizing things and being neat isn't OCD. It's closer to OCPD but you still need to get diagnosed, I recommend seeing a medical professional if it starts disrupting your life.",
            "Im curious what the item was",
            "I discovered a really awesome organization hack for packing stuff. Take photos of everything you're putting in each box. Title the photo(s) with numbers when you save it in an album you upload to the cloud. Put the same number on the box. \n\nIf you're going to be accessing the box/plastic bin a lot, I like to write a list of contents on an index card and tape to the lid. I have a shit memory, and documenting the contents saves me a lot of aggravation.",
            "I want to know the other labels.  Was there a box of \"unimportant shit\"?? \"Kitchen shit\"?  \"Towels and shit\"? \"I don't know what this shit is\"?",
            "Great story, if you find yourself at a loose end feel free to come and clean and label my house to your hearts content, I won’t even bother you 😜",
            "Please don't say you \"are\" OCD.  OCD is a real disorder that people *have*, and it's insensitive to casually claim it just because you're tidy.  Every person with OCD would love to just be tidy and leave the actual disorder behind.",
            "My dad came over to help my with a project at my house when I was in my thirties. I told him what the project was and how I had it planned out. He immediately jumped back in time to when I was twelve or so and says something like “No, we’ll do it like this.”\n\nMy dad is a really smart and very capable guy and his way would have been fine, but I’m not twelve anymore and I am also kinda smart and pretty capable. I was about to start the confrontation but instead took a breath and said:\n\n“Dad, you are a smart guy and if we do it your way it will look great when we are done. Now, I am also a smart guy and if we do it my way it will also look great when it’s done. So, how about since this is my place we do it the way I was thinking this time?”\n\n\nIt was a bit of a turning point for us actually and yes it did work out good in the end.",
            "While your dad definitely deserved that, unless you've been diagnosed OCD please don't use the term, OCD is not all about cleaning and organizing, OCD is repetitive behaviors to prevent an imagined outcome. IE something bad happened when I didn't lock my house 3 times, so I must lock it 3 times now to prevent bad thing from happening again. It is a struggle for people suffering to deal with their obsessive behaviors, misuse of the term is not helping people understand them and can in fact harm societies' understanding of what true OCD is.\n\nThe term that applies is Anal-retentive or anal for short, as in I'm anal about people misusing the term OCD so I feel I have to correct it, especially when they should use the term anal in regards to cleanliness/organization.\n\n&#x200B;\n\n anal-retentive\\[anal-retentive\\]ADJECTIVE\n\n1. **(of a person) excessively orderly and fussy (supposedly owing to conflict over toilet-training in infancy).**\n\nNOUN*(anal retentive)*\n\n1. **a person who is excessively orderly and fussy.**\n\n&#x200B;\n\n \n\n## Obsessive compulsive disorder\n\nAlso known as: OCD\n\n* **OVERVIEW**\n* **SYMPTOMS**\n* **DIAGNOSIS**\n* **TREATMENT**\n\n**Symptoms**\n\n* Symptoms can be either obsessions or compulsions, or both\n* Symptoms can be mild and gradually progress in severity\n* Stress worsens the symptoms\n* Persistent, repeated and unwanted thoughts\n* Urges or images that are intrusive\n* Compulsive or ritualistic behavior to get rid of the thoughts",
            "Your story was very entertaining but honestly the “I’m OCD about cleaning and organizing” was a bit upsetting to read. I have OCD and it is such a monster of a mental illness. OCD is not a descriptor or a personality trait. It’s not a way to describe how clean you are. There are other ways to communicate that. Mental illnesses are not quirky personality traits, they’re serious things and wording yourself like that just helps normalize this damaging way of thinking.",
            "...i was hoping for the last line when i read you were going to help him again...",
            "Wow, it's nice to hear when someone learns from theiristake! Glad you both can laugh!\n\nP.S. Can you helpe move?😸",
            "Your dad is lucky to have you!  \n\nOne of my SILs does this - help people organize and sometimes downsize - as an astonishingly lucrative side hustle.  Her actual professional is chemical engineering but I think her side work is her favorite.  I really believe it is a gift, some kind of intersection of information management and spatial relationships and stuff wrangling.  It is amazing.  She is why I can find or reach anything in my house and why doing school for the niblings has worked.",
            "the father of a friend of mine used to slightly adjust small items in a room just to fuck with my friend because he has your same OCD.\n\nmy friend could *sense* something was amiss almost immediately and couldn't rest until he \"fixed\" it.\n\nthat's got to be just a fucking exhausting existence.",
            "I live with my parents. They decided to tell me that a couple years ago. While I was actively mowing their giant yard. \n\nSo now they: spent the rest of that summer doing their own yard. Takes me about an hour, them about 3. \n\nTried again the next summer, couldn’t handle it. Got a local guy to start doing it at $50 a week. \n\nAnd now this summer I guess they did the math for last summer and decided a riding mower would be cheaper. $700 later on a used mower…\n\nAnd it doesn’t work. \n\nCan’t wait to see how this’ll play out now.",
            "My husband, whom I love dearly, THINKS he can organize while I actually can organize. He won't let me touch his study, his man cave and the garage. The rest of the house is neat and organized. 99% of things are found where they are supposed to be and with minimal fuss. His 3 areas? Not so much. His idea of organizing is picking things up, thinking where they should go and then just putting them down randomly where ever. And he wonders why he can't find anything.",
            "I love you from afar. \n\nI just watched my Dad pack for a permanent move to the Philippines. He is basically fitting his \"stuff\" in those gigantic overseas boxes. When I mean 'fitting\" I mean there is no order or reason of What he is putting inside each box. His way is to put as much as he can that fits snugly and safely for overseas. If he labelled each box of EVERYTHING, I will be surprised.\n\nNow, if I were to do it his way (more economic??) I would at least number the boxes and write down the inventory of what is each box. \n\nCan I hire you when I move?",
            "I found your story AND the comments very interesting.  Especially liked the OCD reference and explanation.  \n\nAlthough I am like you, I really prefer to just call myself \"organized\", because calling oneself \"anal\" is just...too much!",
            "Awesome, wholesome, loving MC. Thank you OP; this is the smile I needed this morning.",
            "Lol I wish I had that “button” so bad",
            "There is a box labeled “Important shit” I don’t know why but that’s funny for me",
            ">\"We already agreed I'm in charge this time.\"\n\nREALITY FOLLOWS-UP: \"Right on up until the plastic gratitudes and salutations die out, my father looks right down his nose at me, tells me it's his way or the highway, and history repeats itself with a few more things said you just can't take back.\"",
            "OP can I adopt you so you can help me get my shit together lol",
            "What are your hourly rates?  Because I could use your help in a big way.",
            "This is a great read. Love a good organization story - especially when someone who doesn’t organize learns a lesson.😁",
            "As someone who’s dad is no longer with us. I totally get it and relate to your story. Sometimes you have to make it seem like it’s their idea when it’s actually yours. It’s saved a lot of arguments and heartache. I really wish I could hug my dad lots. I miss him lots.",
            "Can I adopt you?",
            "I’m moving my husband did this shit to me. We have four tiny kids. Right now he’s working out of town and only helping on weekends. I finally had to push back as to avoid bing in your dads shoes. I I’m a SAHM so it’s my house my rules.",
            "Mom: “Where’s the vacuum?”\n\nMe: “Did you check the place where the vacuum’s supposed to be?”\n\nMom: “Yes! It’s not there!”\n\nMe: “... Did you also think to check in your bedroom?”",
            "My SO and I organizer things very differently, but both like to stay organized. When we moved, I got to be in charge of packing since I was home more during the day. I color coded and labeled each box according to contents and which room it would be going to at the new place (box with the blue label that says \"office\" means it goes in the office room with a blue card taped above the doorway). \n\nSOs family helped us move and they all teased me when they saw my system. But when we moved, no one had to come find me to figure out where boxes should go. Even when they got tired and started piling the boxes in the front room of the house, I knew where each would eventually go. \n\nI had the entire house unpacked and organized in less than a week.",
            "> We already agreed I'm in charge this time.\n\nNarrator: \"And so our intrepid hero showed up bright and early that first morning only to find out what he'd been told was a flaming pile of b.s. \n\n\"It was déjà vu all over again when, early on in the packing, his father repeated his now-infamous catchphrase and OP saw his future flash before his eyes.\"\n\nI hope I'm wrong, but unless your dad has become a bit more mellow, *moving 2.0* is not going to proceed any smoother than *moving 1.0* did.",
            "You don’t say how old your dad is but you should be ready for  r/agingparents in 20 years. Wait until his memory starts slipping and he can’t keep track of his money. And then he sabotages everything you do to help keep it organized.",
            "I'm a mover who works like you.  Organized,  labelled, right down to room and red striped for will need to open ASAP.  I actually do this for a living too.  My husband moves stuff the day of and just dumps everything chaotically in large black garbage bags. \n\nWe're getting a divorce.",
            "I need someone like you in my life to help get my sh*t together!",
            "Glad to see how this ended instead of you getting so perturbed you stopped talking to him.",
            "Love it. Good story.",
            "I love when MC's end with people learning that's why things are done in certain ways",
            "It's nice to finally see a wholesome ending where everyone doesn't end up hating each other.",
            "> I knew the payoff was going to be a slow burn, and it came several  months later when i was in school across the country and unable to help. \n\nnice hahahah",
            "Good ending, I am sad that I will never get a similar outcome. My dad (90) will never give up control of anything regardless of whether he is correct or not. Over the years I've tried yelling, reasoning, calling in experts etc. It never works. The latest battle is getting him and my Mom into a more appropriate living situation (their house is not good for two people with mobility issues).",
            "Parents are hard to raise.",
            "I get claustrophobic if things aren't organized and where they belong. I'm not a collector of stuff so everything is easy except the bookshelves...books are my weakness. 843 books on shelves according to author and publication date. Paperbacks have their own section and I have a list of which ones will get replaced by hardbacks and I go through the shelves once a year and remove any book I haven't read in 2 years. What can I say 🤷‍♀️",
            "I hate my parents idea of \"design\" at the house there are multiple bookcases with inaccessible shelves because there's a table in front of the bookcase. They can't pack or manage a fridge or pantry because they over fill it and their kitchen space is so poorly managed there's no counter space to do anything.",
            "Can you come to my house……?",
            "I like these ones",
            "You would like records management",
            "I love people like you. I hate organizing and don’t even know where to start. So when people like you step in, I step back with my hands up, “You tell me what you want me to do. And where you think things should go.” Lol",
            "I like stories that have a nice ending despite the MC",
            "what are your rates for organizing a house? I may have a job for you..",
            "Nice wholesome ending. We love these.",
            "You DO know you can make a good living at this, don’t you?",
            ">My dad never was and still isnt super organized, where as I am alphabetize my own bookshelf OCD about keeping things in order.\n\nJust a side note, I personally wouldn't say there's a particular correlation between orderliness and sorting your bookshelves.\nI am far from orderly, my place is a goddamn mess every time there isn't someone planning to come over within the week, but having order on your shelves is the bare minimum imo.\n\nHow do you find things otherwise? Do you just spend several minutes going through everything every time you need a single book?\nI feel like, at that point, you're past just \"disorganized\" and right into \"chaotic\" territory.",
            "Always have the box called important shit. It's a life saver.",
            "You don't have ocd please stop using that word. It is a serious condition that tears people apart physically and emotionally",
            "[deleted]",
            "Omg the rude comments are ridiculous.",
            "Great story! I know you didn't mean harm, but using the term \"OCD\" as an adjective for orderliness (or anything else) can be very harmful, especially for people who have diagnosed OCD. Obsessive-compulsive disorder is a very challenging illness, and misusing the term invalidates sufferers' experiences and makes light of something that is truly deliberating for many. Instead, you could say \"I am extremely particular about how I alphabetize my bookshelf.\"\n\nNo hard feelings — Now you know :) Great article about this issue found [here](https://medium.com/writing-in-the-media/please-stop-using-ocd-as-an-adjective-11985737c28a).",
            "[deleted]",
            " Good story, but alphabetizing your own bookshelf is not OCD. And it just perpetuates negative stereotypes when you. Compare being organized to having OCD. It’s like someone saying they’re feeling “schizo”",
            "Hey just wanna say, can you not use OCD to describe how clean you are if you don’t have the disorder. That’s not what OCD is",
            "> Call me weird but i really enjoy reorganizing things/cleaning, it just hits that button for me.\n\nWhatcha doing this weekend?",
            ">I am alphabetize my own bookshelf with a full system Type-A about keeping things in order.\n\nAmateur.  Call me when you have them sorted in LOC order.\n\n\"Alphabetical\"?  By author, Title, or Subject?\n\nI hope you hit him with \"I told you so.\"",
            "[removed]",
            "Can you not use the term \"OCD\" to just describe keeping things neat? OCD is actually a crippling disorder and calling yourself OCD when you don't actually have OCD is offensive to people who do have it, makes their disorder not taken seriously and is just all around cringe.",
            "I’m no clean freak but let me ask, while you type A’s are cleaning and organizing and packing and moving, does it make it easier to minimize the amount of stuff? I mean does it occur to you to not have a dozen of things that a couple could do the job?",
            "[deleted]",
            "Not malicious \n\nJust an OCD person bragging about their superior organization skills.",
            "Ugh you are just like my wife, she insists the spice rack be organized alphabetical where to me it makes more sense to keep the spices most used in the front and spices rarely used in the back. It is a bitter and unending conflict.",
            "You had nothing to do all summer, & you didn’t get a job? I sound exactly like my parents, ‘cuz there would have never been a “hang out all summer” option for me.",
            "You might be telling it badly but you come off as a complete jerk here. Hahahaha my dad’s suffering even tho I got involved w/o being asked. 👀👀👀👀",
            "[deleted]",
            "[deleted]",
            "Tldr: OP enables his dad's shitty boomer behavior.",
            "I am also super organized and totally get this. It’s good to hear that your point was made for you!",
            "Good luck for the next move, I'm glad you guys can laugh about it today. Thanks for sharing your compliance with us!",
            "Slow burn payoffs are the best!",
            "I would like to hire you.  How much do you charge??????",
            "Hanging up on someone is classic Boomer energy. Can’t deal with reality, can’t act with civility, so they “gotcha” with a hangup. They are boorish children.",
            "> where as I am *alphabetize my own bookshelf * OCD\n\nThat's not so bad. I used to alphabetize my bookshelf, unless it was part of a sequential series, like my large collection of the old Star Trek novels and the 90s era Star Wars novels. Those went in sequential order of release.",
            "So, did he ever find the thing he NEEDED?  Or did he give up and just go buy another one?",
            "I love happy endings as it sounds like he learned his lesson!",
            "I am moving in July so if you want another summer project I could really use some help",
            "If you wanna come help me pack up and organize I promise I won’t tell you my house my rules 👁👄👁",
            "This turned out to be a wholesome MC - Thank you for sharing!",
            "As a somewhat disorganized person who PRIDES themselves on their organization skills specifically related to moving, this was an extremely satisfying to read.",
            "Do you pack an \"open first\" box for things you will definitely need immediately and don't want to have to dig through boxes looking for if you don'thavetime to unpack the first day? Like: meds, toilet paper, a pan to cook in, charger, etc",
            "This is way better than my \"my house my rules\" story, where I just slept in the car for the night and scared the shit out of my parents when they couldn't find me the next morning.",
            "This was an unusually wholesome MC!",
            "A few months back I reorganized the kitchen since I was in culinary school and it was a disaster trying to find different things and after couple weeks later my mom started yelling at me because moved stuff around and I told her where she could whatever she was looking for and had a nasty attitude about it but she learned that the new organization of the kitchen was more useful than how it used to be",
            "Well I wasn't expecting this. I'm pleasantly surprised.",
            "You had me at “slightly out of order”. 😂",
            ">I resist explaining\n\nHas a very different meaning to:\n\n>I resist, explaining\n\nPedantic, maybe, but I had to reread it twice before I understood your meaning. I thought a type-A might appreciate that correction. :)",
            "Cc: Readers Digest/ life’s like that",
            "I have an immediate loss of respect for him for hanging up on you to save face.",
            "Uggghh! That first half made my butt pucker up! \n\nI am the same way! When my (now ex) wife and I were leaving our first apartment, I had boxes labeled by contents, and room; also in a way that would be easiest to unload, in the new place.\n\nI came in, from work, one day, and the wife and her aunt are literally dumping drawers, upside down, into boxes, and sweeping things off of shelves. Cutlery in clothes (Smart, right?), shoes with books, HBA with kitchen stuff.....gives me chicken skin, remembering it!",
            ">He had been in the storage unit he rented in my hometown for the better part of three hours looking.\n\nSo he rented a storage unit by the hour?  Wow."
        ]
    },
    {
        "post_id": "1bk4pk6",
        "author": "Massive-Discount845",
        "title": "Church wants to sue me for a review?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1bk4pk6/church_wants_to_sue_me_for_a_review/",
        "score": 14195,
        "num_comments": 620,
        "created_utc": 1711021872.0,
        "selftext": "I'm from Germany. We are a very litigious society, so much so that businesses can sue individuals for writing bad reviews. In fact, per German law, it's up to the individual to provide evidence that what they wrote actually happened, or else the individual can be forced to take down the review and pay legal costs to the business.\n\nI'm a tradesmen and did some renovation work for a church in a small town. The church did not pay me. I take 50% upfront and the church had cheated me out of the second half after I had completed the job.\n\nThe church only had one other review. I wrote a review stating that I had been cheated by the church. I  promptly got a legal letter from the church demanding to take it down unless I wanted to be brought to court. The church could easily argue that they paid me in cash and I would be out of luck according to German law.\n\nOkay. I complied with their demand. \n\nI took down the review and posted a new one stating that I'm a tradesmen and the church threatened to sue me for writing a simple review. I also attached the legal letter from the church as an image in the review.\n\nFast forward a few months, I received an angry call from the clergyman. He said my review had caused several tradesmen to either ghost him or ask him for complete payment upfront. He claimed that I had 'cost them thousands' and that I would 'burn in hell for hindering God’s work.' I then asked him, 'What is your religion’s founder's view on honesty, compassion and forgiveness?\n\nCue a moment of radio silence, followed by him hanging up the phone. No legal letter yet, anyhow I can now substantiate my review.",
        "permalink": "/r/MaliciousCompliance/comments/1bk4pk6/church_wants_to_sue_me_for_a_review/",
        "comments": [
            "Nice. You had legal proof supporting your review!",
            "If they were going to claim that they paid you the last half in cash, I wonder how they were going to prove that?\n\nWhere I live, with business transactions in cash, if you don't get a receipt from a cash register, you will get a hand written one with the implicit purpose of documenting what was paid when and for what.\n\nI'd drag their holy asses to court if I were you.",
            "Wait. What is that cost they are complaining about? That they actually had to pay their bills?",
            "'cost them thousands'? How? Because they planned on scamming other trades tradespeople too, and now they had to pay full price?",
            "Anyone else catch the implication that they intended to rip off subsequent contractors? Why else would it cause a loss when they demanded payment up front?",
            "You'd think they'd be wary of messing with carpenters at the very least.",
            "In England Dan Neidle, a tax lawyer, accused the former Chancellor, a government Minister, of a tax fiddle. \n\nQuite subtly, so he could have said “oh goodness, a mistake, I must fix it”. Instead he sent a solicitor’s letter threatening to sue, and the letter said it was “confidential”.\n\nDan Neidle put the letter on the Internet. \n\nTurned out, indeed there had been a tax fiddle.",
            ">He claimed that I had 'cost them thousands'\n \nHold up.\n \nYou cost them thousands because they lost the chance to stiff people on work done?\n \nPretty sure it does not work that way.",
            "I am not an expert on the law, but if they paid the first half by check wouldn’t it be their responsibility to explain why they paid the second half in cash and didn’t get a receipt?\n\nOtherwise anyone who did not pay a bill could say they paid in cash and no one could ever successfully sue for a past due payment.",
            ">The church could easily argue that they paid me in cash and I would be out of luck according to German law.\n\nHmm...you issue *receipts* for cash payments, right?\n\nAnd they have one in their hands, right? No?\n\nIs there a record of the receipt in your receipt book or ledger? No?\n\nYou have records showing billings for the unpaid amount that continued AFTER work completion, right?\n\nThey have copies of their messages refuting the bill after completion, right? No?",
            "I wasa landscape designer/contractor. I did two churches before I learned my lesson. They paid me, but it was always the cheapest they could get away with and everything was done by committee, which is incredibly inefficient. \n For the record, Jesus didn’t start a church.",
            "\"I can't remember, which commandment is Thou Shalt Not Steal?\"",
            "You shall not steal!",
            "Dude’s mad he can’t cheat people in the future and called you to complain about it. It’s pretty funny",
            "Humble tradesman, doing The Lord’s work by sharing this story with us",
            "> He claimed that I had ‘cost them thousands’\n\n“Because of you exposing how I cheat tradespeople out of their full payment, I have been forced to pay them what we actually agree on! I am outraged!”",
            "“Never do business with a religious son-of-a-bitch. His word ain't worth a shit -- not with the Good Lord telling him how to fuck you on the deal.”  \n― William S. Burroughs",
            "Having the tradesmen ask for full price up front had cost them thousands. Which means that they never intended to pay the full cost for anything. No. The church was trying to make the tradesmen lose thousands.",
            ">He claimed that I had 'cost them thousands' \n\nIsn't that just outright admitting that their intention is NOT to pay for the work they agreed to pay?",
            "Can you not sue them for the other half of your pay?",
            "If that's what they complain about, then maybe they aren't doing God's work.",
            "Amen!",
            "I love how this priest was threatening Hell upon the contractor for telling the truth, thus not breaking any of the Ten Commandments, while the church didn't pay said contractor for the work they did, thus stealing from the contractor, and breaking the Eighth Commandment. \n\nI think that the clergyman needs to reread Matthew 7:3-5 in order to refresh his memory.",
            ">The church could easily argue that they paid me in cash and I would be out of luck according to German law.\n\nNo. That's not how this works. Even if they paid in cash they'd still have to have a receipt from you for their own accounting.",
            "German here. That dude was used to mostly having work done by somebody from their flock, who will happily eat three sorts of shit for breakfast, and got culture shock by suddenly finding out that in the real world his actions come with actual consequences. At least in the form of a bad review, which feels rather underwhelming, considering you could - and absolutely should - have sued them. And then still post the review, but this time what you upload is a court judgement. Why on earth you didn't is completely beyond me.",
            "The only way complete payment up front was going to “cost them thousands” would be if they didn’t plan to pay it under a post-pay scenario.",
            "Weird. How did you \"cost\" them thousands?\n\nUnless they planned on stealing from everyone.\n\nIt's because they wanted to steal from everyone, isn't it?",
            "I seem to recall there’s something in the Bible that literally tells people to pay their workers.\n\nSomehow churches seem to think they’re exempt.",
            "I got burned by every single “religious” business that I ever did work for. It happened 3 times and after that I refuse to do work for or have work done at any business that has a religious theme.",
            "So awful! Church cheating money out of honest tradesmen. The clergy should burn in hell.",
            "What was the one other review?  \"Attended every Sunday, tithed proper amount, still went to Hell.  Would not recommend.  One star.\"",
            ">I took down the review\n\nAwww....\n\n>and posted a new one stating that I'm a tradesmen and the church threatened to sue me for writing a simple review.\n\nFuck yeah!!\n\n>Fast forward a few months, I received an angry call from the clergyman. He said my review had caused several tradesmen to either ghost him or ask him for complete payment upfront. He claimed that I had 'cost them thousands' and that I would 'burn in hell for hindering God’s work.' I then asked him, 'What is your religion’s founder's view on honesty, compassion and forgiveness?\n\nYou should post this as a review lol",
            "**\"cost them thousands\" ?**\n\n... How many trades people had they planed to steal from?!?\n\nNot what JC would do",
            "Would've loved to ask him on that call \"remind me, what trade did Jesus practice before he began preaching full time? Do you think he ever got stiffed by a church?\"",
            "“The power of compliance compels you!”",
            "The church wouldn’t be able to claim they paid him in cash. Any legal payment needs some kind of paper trail for tax purposes. If they didn’t do that the state would show up faster than Jesus resurrected.",
            "So do you have to pay taxes on what you weren't paid? Is the church not accusing you of tax fraud? Where's the burden of proof now?\n\nYou write review stating nonpayment.\nChurch says that's a lie they did pay.\nBurden of proof is on you to prove absence of something - you concede that you can't prove they didn't pay you in cash.\n\nSince you can't prove they didn't pay you, if you are accused of avoiding tax on that payment does revenue have to prove you received payment or is it up to you, once again, to prove you didn't?\n\nIf the tax man found no evidence of fraud (i.e. That payment didn't occur), is that now evidence that you were not paid to support your review?\n\nGenuinely curious. Q",
            "Tell him this:\n\nClergy like you are the reason why your religion is dying.  People can see how dishonest you are and have decided to stop wasting their lives and money.",
            "OP should put the Church on notice the old-school German way. Nail their unpaid invoice to the door of the building like Martin Luther's 95 Theses.",
            "The church thought they had the lord on their side. They forgot. \n\nChrist was a carpenter.",
            "You had me at the review, and then you threw in this          \n>  'What is your religion’s founder's view on honesty, compassion and forgiveness?         \n        \nMagnifico!",
            "Curious, is it actually realistic in German courts would accept \"I paid as cash\" alone as evidence of payment?\n\nThe US is very litigious aswell, and you will see everyone and their cousin claim \"I'm going to sue you\" yet wouldn't even know the first step to find a lawyer, yet alone why their claim has zero legal basis, they just repeate the same bullshit they hear in TV and from the equally informed\n\nEven paying in cash a receipt is expected as proof, they would never accept \"I paid, he is lying\"\n\nI'm honestly curious if it would be any different in your case, did the church just threaten a lawsuit with zero legal backing hoping you would just back off since nothing you said was not true",
            "How could it be that you cost them thousands (unless of course they were planning on getting work done cheap by stiffing their contractors...)",
            "If they didn’t pay cash for the first half, would be hard for them to prove they paid in cash for the second half. \n\nGoing forward communicate every deal/payment etc via email.",
            "That explains a lot about why my Google review of a bad meal got removed. I even posted pictures of my food inside the place, with their  very unique and identifiable restaurant seen in the background of the photos. Got a legal warning they were going to take me to court over it asking me to prove I was actually there (5 years after I took the pictures and wrote the review.) I thought it was just junk email at first, but then Google took my review down.\n\n\nEdit- the restaurant was in Germany.",
            "Now, leave the original review as another user.",
            "They claim you cost them thousands because contractors are demanding full pay, so they’ve just confessed to not paying out in full for work.  (There would be no additional cost by paying up front, vs paying as you go)",
            "If the church wanted work done, all they have to do is pay the total up front. Sounds fair enough, unless the church was planning on cheating someone else.\n\nGood on you for keeping them honest.",
            "They claimed you cost them money... The only way that's true is if they planned on not paying the agreed upon amount going forward as well.",
            "Fuck organized religion. They will steal your money and then say that you are wrong for not believing in their myths.",
            "Sir you have cost me thousands of dollars that I had planned of scamming you fellow tradesmen out of . Expect a letter from our lawyers.",
            "\"Hindering God's work\" - well maybe he should have prayed to Jesus for carpentry instead of contracting out services.   I'm glad the other trades are getting the message about that hypocrite.",
            "I think the clergyman forgot that the patron of his religion is likely going to be on the side of the contractor considering he was a carpenter...",
            "Mail them.  Hold them to the letter of the law.  That’s a t right?",
            "Dont forget, they'll still go to church on the sunday after they've ripped you off, confess thier sins and they'll be forgiven by the only entity who's opinion matters to them",
            "you know, if there's reviews from outside the country they couldn't go after them...\n\n\nso if anyone posted the name of the church online....",
            "You shall not steal; you shall not deal falsely; you shall not lie to one another.\n\nLeviticus 19:11\n\nYou shall not oppress your neighbor or rob him. The wages of a hired worker shall not remain with you all night until the morning.\n\nLeviticus 19:13",
            "You probably didn’t cost them, but your review made sure they couldn’t rip off future tradesmen by only paying half. \n\nIf they had paid you in cash they would have to prove this, and let’s face it, they don’t have that proof.",
            "His religion was founded by a tradesman! lol",
            "I'm a freelance graphic designer and I straight up decline work for any religious organization. Every time I tried to give someone a change they fucked me over. Not worth it.",
            "When he said you \"cost them thousands\", what he means is he spent thousands more than he wanted to because you prevented him scamming even more tradesmen. Good job!",
            "There was a electrical contractor in Nevada who was saying that the brothels were good payers, & churches were always wanting the work to be done as a \"donation\", sorry my opinion is donations do not put food on the table.",
            "You literally did the Lord's works and saved so many tradesmen from future pain and suffering.",
            "Wait, so the court wouldnt ask them for any proof they paid cash? Like a receipt? They would just assume its true?",
            "Tell that fucking prick if he needs work done he should pray about it instead of stiffing people who actually exist.",
            "I wasn’t aware Germany was that litigious. The US always gets blamed for being so “sue happy”. That being said we can post whatever we want on review sites (short of slander). I keep it at stuff I can say happened but yeah, we have a lot of leeway.",
            "Shame you couldn't sue the church for non payment.",
            "Take back half your work using a sledge hammer.",
            "You do have a Higher Authority.",
            "What is your religion's founding carpenter's opinion on greedy money handlers in his father's house?",
            "Jesus famously said, \"workers deserve their wages.\" And, if you want to pursue getting paid by this clown. tell him you plan to use the discipline procedure in [Matthew 18:15-18](https://bible.oremus.org/?passage=Matthew+18:15-20).",
            "\\*Delicious\\*.\n\nNever get involved with people who can clear their conscience by asking an imaginary friend for 'forgiveness'.",
            "Mission accomplished.  Well done.\n\n\n>He claimed that I had 'cost them thousands'\n\nYeah, by putting them in a position where they actually had to pay their obligations.  It's easy to save money when you never pay your bills.\n\n>and that I would 'burn in hell for hindering God’s work.'\n\nOh, knowing GOD as I do, I'm pretty certain that the pastor is the one in danger of GOD's judgment in this situation.  The pastor is the one bringing discredit upon the church, not you.\n\nAgain, well done.  I love a happy ending.",
            "And people think the States are the most litigious ones.",
            "Good for you!!!",
            "I like how you can complain about possible legal action for your last comment but can't complain they didn't pay you because who has receipts for not getting paid.",
            "In your case, I'd have told him to keep it to text messages and e-mails, so that you have all communication in writing. Or typing, to be precise.\n\nOtherwise, you did Awesome.",
            "Are you allowed to record calls in your jurisdiction? It'd be a real pity if a recording of that call (or any similar future ones) also got linked off a review site...",
            "Nicely done",
            "Well played",
            "Leviticus 19:13",
            "Without a receipt, how could the church prove in court that they paid the second half? If you have a copy of the original estimate and a copy of the receipt for the first payment, I think you would have a good case against the church for nonpayment.\n\nI suppose if the total amount of the contract was very small, it might not be 'worth it' to take them to church. Otherwise...",
            "Something something forgive something something",
            "Where I'm from in the US, normally cash trades like this result in a receipt. Whether written by the entity being paid or the entity paying. You can buy most receipt books at small hardware stores/stationary stores or amazon/online. I had to do this for repairs on my vehicle after a mechanic forgot to put the hub nut back on and resulted in my vehicle breaking down in the middle of nowhere 10 hours from home. I had to pay a mechanic who worked out of his house to fix it. He asked for cash and I needed a receipt to get the money back from the other mechanic who fucked up and he whipped out that little booklet to give me a receipt. But most small-town mechanics I've been to in the past had the same booklet I've bought cause I've used them for some handyman work I do now on the side.\n\nEach receipt usually has a bleed through and is numbered together, so there's two exact copies (normally one yellow/pink and one white), one for each party. [Something similar to this.](https://www.amazon.de/-/en/dp/B000KJOVBK/ref=vp_m_cpf-substitute-widget_pd?_encoding=UTF8&pf_rd_p=e6197d6e-6708-4208-9cf7-149be7c342de&pf_rd_r=Q9DNVKSFE6J7E2Z40YG0&pd_rd_wg=Q3O2l&pd_rd_i=B000KJOVBK&pd_rd_w=1w8cw&content-id=amzn1.sym.e6197d6e-6708-4208-9cf7-149be7c342de&pd_rd_r=facad4c1-f4aa-447c-b061-56a1ce32a951&psc=1)\n\nI'd definitely pick up your own receipt book up somewhere so you can write out receipts in the future at the point of transaction. If they don't pay, you keep both receipts, and if Germany has certified mail, use that to attempt to collect uncollected payment so you can track if the documentation was received by the party not paying, just incase this happens again or you need to go after a party for payment.",
            "There's a gospel sentence that workers should receive their just earning. Compare Mt 20, 1-15.",
            "Not only that, Jesus was a carpenter. Something tells me he would want tradesman to get paid.",
            "It is a trap : you can not prove the absence of fact. Only prove its existence.\n\nThe church should have to prove it had pay you in full. It is what IRS and trade ministery are for.",
            "How did you cost them thousands unless he was always planning on cheating the tradesmen?  Unless the tradesmen were dishonest and took money and didn’t do the work.  But then you have a paper trail and sue which is something the church seems to like to do.",
            "Remind the clergyman of 1 Timothy 5:18 - “For the scripture saith, thou shalt not muzzle the ox that treadeth out the corn. And, The labourer is worthy of his reward.”",
            "They should just pray the pay away.",
            "Wouldn't you have had a receipt that they never finished out, showing that they never paid you the second half of your contract?\n\nI mean it's great malicious compliance but I'm still mad that you didn't get your money.",
            "Next time just post something like \"I'm a tradesman. I would highly recommend to other tradesmen that you secure payment up front before working with this church.\"",
            "How could other tradesmen's demanding full payment up front cost that church \"thousands\" if they reliably pay all their bills in full anyway? (Granted, there's a small gain from delaying payments to take advantage of the \"float\", but that's a minor factor.)",
            "The Church of the Pharisees.",
            "I assume this church is Christian. I assume that they preach honesty and Integrity and discourage or denounce greed, dishonesty, and selfishness. \n\n\nHypocrites",
            "Religious people are suicidal. Their sense of reality and their own mortality is not really lining up with actual reality, but that's their choice or just their circumstance that has molded him into making that choice.",
            "For some reason, for me the most surprising thing about this is that Germany is a very litigious society.",
            "What?   Consequences?  LOL  You are a hero.",
            ">I took down the review and posted a new one stating that I'm a tradesmen and the church threatened to sue me for writing a simple review. I also attached the legal letter from the church as an image in the review.\n\nThis is brilliant. Hat off to you.",
            "This whole thing feels too perfect and beautiful to be real...\n\n...but I choose to believe that it is.",
            "> I then asked him, 'What is your religion’s founder's view on honesty, compassion and forgiveness?  \nCue a moment of radio silence,'\n\nfunninest shit i heard 🤣🤣🤣🤣🤣",
            "Maybe he's still awaiting his god's reply? \n\nAnd waiting\n\nAnd waiting\n\nAnd waiting 🤣🤣",
            "Just send me reviews, Germans. I will write them for you. I am American, and they cannot squeeze blood from a stone.",
            "Wouldn't they have gotten a receipt if they paid cash for the second half?",
            "\"It's for a church hun… NEXT!\"",
            "Greed and theft seem to be the two sins modern churches seem to struggle with.",
            "TIL Germany is a litigious society. The Internet had me believing the US was unique in that aspect.",
            "I love this story",
            "Germans can get sued for posting a bad review?? Holy shit. And people say America is litigious.",
            "You “cost him thousands” by not allowing him to cheat other tradesmen. “God’s work” must be theft.",
            "Church is a business 1st and teaching people morality a very distant 2nd.",
            "The Power of cash compells them.",
            "Have they paid you yet?",
            "I thought the only opinion that mattered to the Church was God's...nice to meet you finally",
            "Dietrich Bonhoffer just rolled in his grave. ",
            "You donated the second half of the payment due to the church. I hope it is a tax write off in Germany.\n\nWhile the Church could argue that they have paid you cash for the second half, do their have a receipt to prove it? Did they get receipt for the first half?  I bet the clergyman is pocket the money!",
            "Sehr Gut!",
            "I would post another review that the priest said you would burn in hell for asking for your payment.",
            "You should have made them prove they paid you the other %50 by showing a cancelled check or receipt. How did they pay you the first 50%? Damn churches....first ones to cheat, lie and swindle will be religious people!",
            "Even in the Bible, it says a workman is worth his wages.  \n\nIf they continue to not pay, offer to contact a lawyer to sue them....",
            "\"He claimed that I had 'cost them thousands',...\"\n\nSo he admits this is their plan on \"saving money,\" by only paying tradespeople the required starting payment, not the agreed-upon total amount. Sounds like grounds for a lawsuit or something.",
            "'What is your religion’s founder's view on honesty, compassion and forgiveness?   \n\nThat's more of a vibe thing than actually something we practice 🤭",
            "Cost him thousands in money he was going to steal from hard working tradesman.",
            "As someone who lives in the US... \n\nFuck. Christians. They are some of the most self-entitled collectives you can ever encounter.",
            "You should go back to the church before the weekend service and remove just half of the renovation work. tell them since they did not pay for it, they don't own it. They can have it reinstalled (for a new cost of installation payable upfront).",
            "Chef’s kiss!",
            "…germanys legal system is stupid",
            "[deleted]",
            "This is a karma farm post. OP has only one post and makes false statements about German law. I don't think they know German law even a bit. Source: Me, German lawyer",
            "I'm German and I'm claiming bullshit on this story. Just point me to your review to prove me I'm wrong, but for now:\n\n- New Account\n\n- No further interactions with the redditors on this story\n\n- Total bullshit claim the church could say he was paid in cash (you'd be required to keep the invoice and receipt)",
            "You’re a smart guy/girl/other.",
            "And we Americans are the only ones called litigious….",
            ">he church could easily argue that they paid me in cash and I would be out of luck according to German law.\n\nSorry that is nonsense. Because legally they should then get a receipt from you. Otherwise anyone could claim they paid in cash.",
            "For anyone who thinks the US is litigious, Germany is 50% more litigious.",
            "Well played sir, well played",
            "Has the lawsuit been settled yet?",
            "Could you write in the conteact that only payment accepted are trackable payments like bank transfer?",
            "If you happened to have a (legal) record of the call you could follow up with a second review that they had threatened that you would burn in hell for your honesty…",
            "Could the tradesman somehow gain admittance to the church in order to remove half of his work?  Or did public accomplish the revenge?",
            "Hey OP share the review link!",
            "That is fantastic! Love the UNO Reversal on the Philosophy of Jesus being brought front & center to the clergy.",
            "free speech laws in Germany are so fucking stupid, made for cowards and cheats. I never say anything critical that can be traced to me.",
            "God can suck it.",
            "might wanna ask him about stealing, too",
            "Time to rip out 50% of the work you did!",
            "Fuck religion!",
            "I find what the church did heavily ironic and in line with a lot of modern religious institutions.",
            "You should have written your review on paper and nailed it to the door of the church",
            "Well played, best of luck",
            "“The power of Christ compels you…to leave a bad review!”",
            "I have no problem with religion, just the people who claim to do the right parts of that religion when they obviously do not.",
            "Thou shalt not ste-… eh I forget the rest, probably not important anyway",
            "Guess god wasn’t on his side after all!!!",
            "Burned down the church.  Well done.",
            "Loved it!! Kudos",
            "If it is so litigious there, why not sue them for what they owe you?",
            "The hypocrisy of religion on full display....",
            "Awesome! You did the right thing. Fuck them!\nAlso, freedom of speech. No german court will sue you for that, no worries.",
            "Refer him to the owner's manual for the building he works in.  Specifically the following sections:  \nDeut. 25:4  \n1 Corinthians 9:9",
            "You can't sue them for failing to pay?",
            "Post links or it didn't hsppen/ this is just a creative writing project.",
            "Religion's founder's view is so good",
            "So ein Quatsch. Das hast du dir doch ausgedacht. Wenn Sie dich nicht gezahlt haben, setzt ne mahnfrist und dann ab zum Anwalt.",
            "What a stupid ass German law.",
            "Ha ha ha, yes you 'cost them thousands' because they normally only pay the 50% up front part.",
            "Did you not send a bill requesting the payment and reminders? \n\nBecause if you did and they did not object to the reminders (Mahnungen) that would be enough proof that you did in fact not receive payment.",
            "That has got to be the best MC ever!",
            "So in Germany you don't have to pay anything after the fact because you can claim you paid in cash?\n\nHuh?",
            "You forgot to add “stealing” to the list.",
            "I love you",
            "Nice, great job. Fuck that church and that dude.",
            "So much for 1 Timothy 5:18",
            "Crazy that despite the country, religious zealots are trash people worldwide.",
            "> What is your religion’s founder's view on honesty, compassion and forgiveness?\n\nDon't forget theft.",
            "What church organization? Welche gemeinde?",
            "Sue them, put a lien on the property",
            "Chef's kiss. Mwah. Perfecto.",
            "“We are a religion we are allowed to be shitty!!”",
            "Maybe the padre can pray his shit gets fixed next time 🙄",
            "“Costing the thousands” that’s because they now have to pay full price for the work done.",
            "Can he prove you will burn in hell??  Maybe sue him for false gibberish?",
            "Holy shit, that's funny!",
            "Genius x)",
            "So glad Karma is working!",
            "You would not be out of luck, they have no proof of the second payment (Barquittung).",
            "German Beleidigung law?",
            "How would it have cost them money if they intended to pay everyone? Sounds like this was a long term plan.",
            "lol, the only way you cost them thousands is that they were indeed not paying for the rest of the work",
            "So smart. Love it",
            "Love this!",
            "Bravo 👏 👏 👏 👏 👏",
            "This is so awesome!  I love it!  Way to go!",
            "Messed up. How do you prove you weren't paid by cash?? That's impossible to do.",
            "He would have eventually been dumped by other tradesmen when he refused to pay the last half of what the church owed them",
            ">\"What is your religion’s founder's view on honesty, compassion and forgiveness?\"\n\nKeep in mind their religion's founder was (allegedly) hung on the cross between two thieves. Pastor may have gotten them confused.",
            "Just quote I Corinthians Chapter 6, where the Bible says not to sue people.",
            "Guess this is more evidence of the benefit of getting EVERYTHING in writing; contract, receipts, etc.",
            "How is this society supposed to work? I can default my debts, and when I get sued I can say I paid cash, and the other has to prove I didn't?",
            "I particularly like the assertion that paying in full up front had \"cost them thousands\"  \nGotta love a church official that admits they were planning on stiffing other contractors, too.",
            "You cost him thousands because he couldn’t stiff the next guy like he did to you.",
            "Kudos. Fuck religion.",
            "“Your religion’s founder…” 🤣🤣🤣👍🏻",
            "Something you learn as a contractor pretty early on: Never work for doctors, lawyers, pastors/clergy. It is **never** worth the grief you're going to get.",
            "Crazy how he managed to convince himself he was justified in ripping people off bc he's \"doing the Lord's work\" lmao, kinda gross",
            "I hate people who con trades. It’s hard work and you cannot leave a shop only paying half. Pleased you did the second review and stopped others being taken advantage of. The only way it would cost them thousands is if they were going to keep doing the same.",
            "Americans could have a hay day with this information and an exposed business... Just saying.. Say the word and we can write any review you'd like",
            "Lol good for you",
            "I found out that churches all over abuse their position with Christ. When things work the Minister's way, God bless you, when it doesn't, go to hell, that's religion in a nutshell.",
            "Im really satisfied that you found a way to get a review up and then found out that the review is working. Yeeessssss",
            "write the 1st review again ... 🤣😂🤣😂"
        ]
    },
    {
        "post_id": "gvi0hd",
        "author": "Notjustacatlady",
        "title": "I Can Only Work 29 Hours A Week But Have Full-Time Responsibilities? Ok Boss!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/gvi0hd/i_can_only_work_29_hours_a_week_but_have_fulltime/",
        "score": 14194,
        "num_comments": 228,
        "created_utc": 1591138872.0,
        "selftext": "I (23F) started a new job last summer as a part-time fellow with the possibility of going full-time. I was hired to replace someone who was full-time, so my responsibilities were much greater than the time that I was allotted to work, which was 29 hours a week. Basically, my bosses kept piling work on me and since this was my first job out of college, I finished it but was basically working full-time for about a week and a half. I had flagged the issue with them and they told me to reflect the time on my timesheet.\n\nFast forward to pay-day, my bosses are livid that I worked too much, saying that I had to stay at exactly 29 hours to be a part-time employee. Cue the malicious compliance.\n\nI started vehemently tracking my hours. I would plan my weeks in advance so I knew the maximum amount of hours I could work each day to stay at 29 hours. I basically worked from 9:30 to 3:30, but obviously there were days that I had to work longer. When my bosses would give me tasks on Thursday and Fridays, I would say to them, well I have to leave at 2 pm today so I'm under 29 hours this week and go home and relax. This obviously made my bosses frustrated since they needed to offload work, but I was just following exactly what they had told me to do. After about 3 weeks of this, and multiple tasks not being able to get done because of my strict 29 hour work week, they finally offered me a full-time job.\n\nEDIT: Wow this blew up! I had 14 karma when I posted this so I was not expecting this at all. Thank you to everyone who has commented. It's been great to read all of the support and solidarity to everyone whose employers are attempting to take advantage of them. For all of the people saying this isn't malicious compliance, I think that 11k people beg to differ so I'm not going to argue with you in the comments. ",
        "permalink": "/r/MaliciousCompliance/comments/gvi0hd/i_can_only_work_29_hours_a_week_but_have_fulltime/",
        "comments": [
            "Malicious compliance with a happy ending - excellent. Nobody should have to work for free, and you made the right choice.",
            "I hope you used them for all you could then got out of there.",
            "I wish more people knew that this was exactly how to handle it. Manage your hours and document. Get paid for 100% of the work you do.",
            "That's exactly how you're supposed to handle it. Work your schedule, flex if needed, and communicate if you're going to go over hours. \n\nIf your bosses find that malicious then I find your bosses stupid.",
            "Good on you to stick to your schedule. And glad that the company realized that getting exactly what they ask for is not always the best way to do business.\n\nGood luck on the future job hunt.",
            "This mentality of keeping employees under a certain number of hours a week is, I think, one of the biggest problems with a lot of the jobs young people are in these days.  (I say \"young people,\" because I had a big birthday this year, and don't feel too young anymore). I managed at two national retailers (two big names), and they will not let people go full-time, because they don't want to pay out benefits like paid time off, dental or health or life insurance. So, a lot of the hardworking employees  I hired had two jobs, just so they could pay their bills, because 25 hours a week at just above minimum wage is not enough for someone to live on. There are so many people in the states who are working 50-60 hours a week at TWO jobs, but because neither will give them full-time hours, they're killing themselves working and have no benefits to show for it. But at least the stockholders are happy. Please know that if your workplace is like this, it's not because your manager doesn't want to give you hours. Strict orders come from corporate to have as few full-time employees as possible. The people at the top don't care about you. You are expendable and replaceable. It's just the worst.",
            "I worked at a major big box retailer that in theory budgeted enough hours to have enough employees on the floor.  There were just a few problems with that; they refused to allow anyone to ever work over 40 hours, they hired some 16 year olds that couldn't work late, the store always needed cleaned at the end of the day and this wasn't budgeted for, and a few times a week a truck would come in and they'd assign some of us older people to unload it (which often took until around 1 AM). \n\nAll of this often led to several of us cutting our weeks short, taking off mid rush on Thursday or Friday, and even skipping shifts on the weekends when we tried to warn our managers ahead of time we were getting close to 40 hours.\n\n---\n\nGlad to be out of there, irregular schedules and never knowing if when it said you'd be off at 9 PM if you'd get home before 2 AM was not pleasant.",
            "An old job of mine, a full timer on 38 hours a week. Contract makes provision for “unpaid reasonable overtime” - whatever. \n\nIt wasn’t until the boss asked me to work a 6th day in the week, that I said well hang on it’s Friday, I’ve already done extra this week, and you want me to do a whole Saturday? I couldn’t do it anyway with pre existing plans, and refused. I started to track my hours, and discovered my average work week was sitting at around the 50 hour mark. Though questionably legal both under general employment standards and our own industrial regulations I didn’t really care too much, I liked the work and it was a good stepping stone in my career path. \n\nBut I was yelled at on the Monday when the owner decided to come in, for costing him money when paying clients had to be turned away on Saturday. He was only angry because I was literally doing nothing on the Monday, I had cancellations galore so I spent my day cleaning. A very rare occurrence, honestly.\n\nSo from that point on, I kept my own spreadsheet of hours worked in addition to the companies time clock in the office. After a month that was busier than usual , I was owed 5 whole days off. \n\nTried to claim them back as time in lieu, got approved, and then payroll took those days out of my annual leave instead. \n\nCue messy drama with the union, threats to my career, and me quitting in the same week as 2 other key employees. \n\nThe business closed its doors permanently 3 months later.",
            "I understand why this is posted here, but I wouldn't say you are being malicious. I would say you were acting honestly, which is something a good manager should appreciate. Good on you for handling the situation directly and professionally.",
            "Hey, at least they offered you a full-time position instead of telling you to take a hike.",
            "I used to work in a 24h lab. We could work a maximum of 40h a week. You could hit 40h for the week at like 10am on a Friday and they would send you home. Some tests took 2-6 hours to complete and were billed as such on our timesheets (which proved you were actually working while in the lab). Since we were allowed to stay as late as we wanted I'd put in a 12'er on Monday/Tuesday if I wanted a long weekend.  \n  \nOften I'd resort to cleaning duties on Thursday just by nature of not having to spread a single test over two work days. Busy work to keep the bosses happy ya know. My super had to have a chat like, \"Uh...you're working too hard and it's making me look bad that you're only working 4 day weeks and cleaning for half the day on Thursday. It makes it look like I don't need so many guys in the lab. If you work slower you can take more breaks and come in on more Fridays to keep upper management happy.\"  \n  \nWe got bought out maybe 3 weeks after this convo and EVERYONE quit. Since I was such a \"hard worker\" they piled everything on me. Lots of time sensitive rush orders, especially at the start of the week. The first 3 weeks after the buyout I worked 16's completing the rushes for the week on Monday/Tuesday and took Thursday/Friday off to the complaint of nobody this time lol.  \n  \nIf you're not going to pay overtime I'm OUT.",
            ">For all of the people saying this isn't malicious compliance,\n\nYou were told to work the extra hours then got told to work no more than 29 hours, so you went to strictly 29 hours, as instructed, and didn't do any work for free, thus letting them feel the burn of their own rules.  How is that **NOT** malicious compliance?",
            "Heads up, since you mention you are 23. This is not malicious compliance, this is setting healthy professional boundaries. This is everywhere and imho it is not mean if rude, it is bosses trying to do their own job awkwardly in ways that can be stressful and intimidating. As an employee, you are there to support them, but support them with the truth.\n\nThey wanted to know if they could get the job done in 29 hr/week. As disappointed as they might be, it's not on you. You did your job and reported the truth back. Believe it or not, people will respect that.\n\nGood luck and congrats.",
            "I was in the same position last summer, luckily i had two great bosses who completely understood. They went out of their way to plan my schedule out and give me the best path to success. When time came for a full time position they fought super hard for me but could not match the other offer i had lined up.\n\nI miss those guys. Good bosses can make any bad situation good.",
            "I worked at a chain gym when i was 26 and experienced in the field, the gym had just opened and they hired a bunch of 19 yr olds that had never worked before. The head office said they werent going to ‘hire’ a manager for a few months but i would be ‘considered.’ After a week they kept telling everyone I was in charge, made me handle all problems and all the 19 yr olds told members i was the manager. When i confronted head office they said i was entitled for expecting a promotion after a week and for wanting more money than the 19yr olds lol, walked out on the spot laughing",
            "employer\\*pikachu face\\*\n\nAlso, OP. keep your resume up to date. A place that treats new hires like this will not be a place to flourish in the long run.",
            "When my daughter was in college she worked at her apartment complex which paid for her rent. They started requiring her to work extra hours which they wouldn’t pay her for.  As an HR Director I advised her to file a complaint, which she did and got fired.  We (she) contested her unemployment benefits and won. The company was later sued and was required to back pay all the employees.  \n\nEach of my daughters ( both worked there) and their former co workers received settlements from a class action lawsuit.  My daughters each received over $10000.",
            "UP vote.",
            " Great work!",
            "It sounds like they wanted you to work “off the clock”. Employers like this are setting themselves up for legal trouble and I hope they get caught out.",
            "I have seen so many people suck up the work, and hope they get full time, or appreciated or respected. but why would they pay you or contract you when they don't have to. People will always do what suits them the most. in this case, it suited them to hire you because they needed the work done.\n\nif people do this stuff for free or with out sticking to guns, you won't be treated favorable, they will continue to exploit you.",
            "My wife was hired in a student part time position with a 19 hour per week cap as a student designer lead in a marketing and design department. She was strictly reminded that working over 19 hours would lead to termination.\n\nAfter three months of stressful deadlines and constant pressure from her immediate supervisors to meet those deadlines, in addition to other adjacent full-timers offloading work to her, she went to the department head and asked them to help. The department head simply advised to manage her time better and figure it out.\n\nA couple weeks and a few heart-to-heart talks with her later, she decided to resign from her emotionally and socially draining job with my full support and understanding.\n\nIn her exit interview, her immediate supervisor informed her that they had just let go of two underperforming full time employees and wanted to test a student to see how efficiently the same amount of work could be done. We were blown away at the callous management style...\n\nThey asked her to come back...\n\nNo increase in hours, no pay increase.\n\nShe said no.\n\nI’m glad you got your full time offer! I’m surprised how many companies appear to do this but without validation or compensation at the end. Best of luck!",
            "Wow - bosses who actually realize that 40 hours of work requires 40 hours of time!",
            "You’d be surprised at the prevalence of this. At his previous job, my son worked part time. Was told for over a year that his boss would get him to full time when the company could afford it. As he, of course, went on international trips, staying in five star hotels on the company budget. \n\nIn the meantime, Son would be sitting at the kitchen table at Christmas working, because he’d constantly be getting rush requests on his very short time off. \n\nMoved to another job, increased his income by 60%, then after a year was making nearly double for about the same amount of work as the “part time” job.",
            "Some employers deliberately do that to young people. Cover your ass. Document everything. Have a chat with legal aid or a lawyer specializing in work related issues.",
            "This is a common tactic.  Trying to get you to work extra hours off the books to look good in the hope of a full time job that will never come.",
            "I feel like companies like this will treat you better if you stand up to them. Instead of just respecting you for the work you do and the quality, you have to demand respect from them. You should proceed as though you are staying at this job... you never know. Look at their qualifications for advancement and raises. Make sure you are meeting the expectations and keep record/demand   a performance review. It's surprising how often it's not the people that deserve advancement/raises that get it but it's the people that demand it",
            "They we're hoping you'd work off the clock. Good on you for not doing it! Know your worth!",
            "I used to have a flexible job that ranged between part time to full time. But yeah, that wouldn't fly today. Because Obamacare mandates anything above 30 hours must have health insurance provided by the employer they track those hours pretty religiously now.",
            "When you quit don’t even give a 2 week notice.",
            "“Replace this full time worker with a part time college student and give them 1 hour less than the government says we have to give them benefits”\n*laughs in corporate*\n“Sir, Theres at least 40 hours of work here”\n*grunts in corporate*\n\n(My first year at the job I didn’t take many union breaks... but I made up for them later)",
            "Everyone should do this. It drives me crazy when people work for free.",
            "They were hoping that since you were young and new to the job market you would work off the clock to get everything done. You reacted perfectly because they could not ask you to do that because doing so is illegal. Good job advocating for your self!",
            "This is 100% malicious compliance. You followed their instructions to the letter and they paid the price until they gave you what you wanted. Well done, mate.",
            "> I started vehemently tracking my hours.\n\nI would go with \"meticulously\" here",
            "Great work!",
            "They had hoped to intimidate you into working extra hours for free.",
            "Find a new job. They will only take more advantage of you.",
            "As it should be.",
            "Now you're full-time still make sure you leave on time.",
            "You're brave. At that age, I would have just accepted that I was expendable and sucked it up.",
            "We are replacing our full time worker with a part time worker. But they still have to do full time work. only working half od a full timer hours. yeah that seems like pointy hair logic to me.",
            "They set the rules and you made it work to your advantage.  Good work!  Always remember it as you advance in your career, for yourself and those who you will be their boss.",
            "It's absolutely malicious compliance. They wanted you to do the work, regardless of the time it took, but not pay you for it. Good for you for not allowing them to take advantage of you!",
            "Correct method, NJACL.\n\nEveryone: do not work for free.",
            "\n>I (23F) started a new job last summer as a part-time fellow\n\nThat sounds like an interesting job, being a guy part-time.\n\nSeriously though. I'm not too sure I would've continued working there, but that's probably because, as a trucker, I can quit my job today, and at work at another tomorrow.",
            "I was capped at 40 and not allowed overtime. \n\nI left most Fridays at lunch",
            "Frequently we are told that we must all \"work hard\" to make your job a success and provide value, and that can be true when you are actively involved in bringing something to fruition and your in the payoff for it too (either with a reward or with the practice gathered).\n\nHowever.\n\nAll too often we are expected to bring the same amount of self-sacrifice to the mundane and continual with little reward - we need to know when to respect our own time and effort and when to respect your team. \n\nThis was one of those times to respect your own. Well done.",
            "That's not malicious compliance, that is normal.",
            "this kind of thing happens all the time sadly.",
            "make sure they understand when you go over 40 hours and make sure you put it on your timecard. after a few months of overtime, they will probably bump you up to salary.",
            "I love the phrase part time fellow",
            "My former job that I was supervising at for an auto part warehouse did some real questionable stuff for ‘part time status’ employees. \n\nSummertime was super busy so they would open the flood gates on working past the 28 hour threshold which folks loved because hey, who doesn’t like OT when it’s voluntary?\n\nThe only thing they didn’t ‘broadcast’ to these guys is that if you were averaging well over 28 hours a week during the first half of the year, the last quarter you would be dropped down to next to nothing so the yearly ‘average’ was still less than 28 hours. \n\nHope you don’t need to pay bills or buy Christmas / Holiday stuff come November and December. \n\nHated that place :/",
            "Good for them. Sounds like it was a job they didn’t hate.",
            "Hope you demanded a 50% pay hike!!",
            "Wow glad you pressed them and got a full time thing from it. I worked for city government and was in the same boat. It's such a sneaky and mean tactic to avoid healthcare and everything. There was never room to get full time where i worked, we never had \"the budget\".",
            "Ah, I recall a job where I had a 9 hour day with minimum 13 hours of duties. Alone. For 3 years.\n\nNo wonder I had a mental breakdown.",
            "\"No no-- we just only want to PAY you for 29 hours\"",
            "I’m in a kind of similar situation. Full time at my job, got moved to part time. Set hours from 9-2. Hourly employee so that differs. Whenever my work asks me to work extra hours, I tell them no. \n\nI actually enjoy being part time. I don’t feel the need to help them when they’ve made the decision to move me to part time which resulted in me losing all my benefits. Sorry not sorry",
            "They were trying to foist wage theft on you without you complaining. Good for you!",
            "I was not even allowed to skip my break although my job required it to keep everyone else on and I constantly got docked. Higher ups don’t care and only pretend to when they are viewing it themselves. I’m expected to work through my break but it just doesn’t function if I don’t? Demoted.",
            "Meanwhile I work in a kitchen, I asked for 2 days off in a row to go to an out of state wedding, I asked with 6 months in advance. I was threatened with termination simply for asking... I didn’t go to the wedding...",
            "Well done. Good for you.",
            "Good on you for being a hard ass right out of the gate!",
            "At least your boss identified the problem was the time and not you mostly it's otherwise",
            "Are you in Europe? Because part time means 4 hrs/day (out of 8.5 full time, half an hour being legally mandatory break), not 5.6 hrs.",
            "I wouldnt call that malicious compliance. Id xall that sticking up for yourself, and showing your worth!",
            "Be glad you still have a job."
        ]
    },
    {
        "post_id": "hj4g7e",
        "author": "Future_pink719",
        "title": "I sold the ring he wanted, but he told me to",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hj4g7e/i_sold_the_ring_he_wanted_but_he_told_me_to/",
        "score": 14184,
        "num_comments": 362,
        "created_utc": 1593582586.0,
        "selftext": "I used to work in a pawn shop as both a sales associate and a pawn broker. I have so many stories I could probably fill this subreddit, but this one always makes me smile because of how smug the man was. \n\nWhen I was a sales associate, I sold a lot of jewelry. I often had to tell people that we couldn't hold items because A) someone might come in and want it and have the money right there and B) we had a layaway program. So, unless you put some money down, 20%, holding it wasn't an option.\n\nSo, one day this man comes in and is looking for a very specific type of ring: diamond channel set anniversary ring set in white gold size 5. The pawn shop I worked at had a VAST collection of these types of things in many sizes and with many different carat weights. He needed a specific size and a specific carat weight and he was very much in luck, because we HAPPENED to have it. Most pawn shops are you get what you see and you can see what you get. Basically, we don't have inventory/stock of any specific item and our jewelers are for sizing and dipping purposes only. So, I show him my ring that I have in the case.\n\nMe: here you go. Exactly the size you need and just over the carat weight.\n\nMan, pulls out a loupe, looks at diamonds: okay, they're not AS clear as I normally like them.\n\nMe: yeah, I understand, but the price is only $350 and at a regular jewelry store, this would easily run around $1500, so while the clarity isn't as nice, it's still a really good deal and I don't know if you'll find another this size with the same carat weight.\n\nMan, sighing: okay. Well, I know your sister store also has some rings, right? Do you think they might have a better one with better quality?\n\nAt this time, there is a woman looking at rings and clearly listening to our conversation, but I'm positive he hasn't noticed her. She sees the ring in my hand and I see her eyebrow go up.\n\nMe: Im not sure, but they are a smaller store, so their inventory is smaller. If they do have one, there isn't a guarantee the ring will be the correct size or the same carat weight.\n\nMan: hmm. Okay, well can you hold the ring for me? I want to go see their inventory.\n\nMe: I'm sorry, we can't. Company policy is that all items held must be put on layaway for holding. If someone wants to buy an item and it isn't in layaway, we don't want to stop them.\n\nMan: Hmph, well, I'm gonna hold off and go check that store. IF someone comes in and sees THIS specific ring, yeah, go ahead and sell it, but I doubt that's gonna happen. \n\nHe walked away with a kind of smug look on his face. Just as he left, the woman who was listening to our conversation walks up. \n\nWoman: can I see that ring he didn't want?\n\nI hand it over to her. She slips it on her finger and smiles.\n\nWoman: I'll take it.\n\nShe didn't even hesitate. She straight up bought this ring after wearing it for 5 second's. During ring out I asked her why and she said she had been searching for a channel set ring for a few years at the pawn shops, but none had caught her eye like that one and it was her size, which can be hard to find. I told her have a nice day and cleaned it before she left.\n\n45 minutes later, the man walked back in.\n\nMan: okay, they didn't have anything, so I guess I'll take that one I was looking at.\n\nMe: I'm sorry, sir, but just after you left a woman came up, tried on the ring and bought it. I don't have anymore in the carat weight you're looking for. I have some in the higher carat weights, if you're interested!\n\nMan: are you fucking serious? You knew I'd probably be back! Why did you sell it?\n\nMe: well, you did say I should if someone came in and saw it. Just because you doubt something is going to happen doesn't mean it can't.\n\nEdit: some of y'all are saying I didn't say the last line. Let me make something clear: the pawn industry is  incredibly different than normal retail stores. I have actually told customers to straight up \"Get the fuck out of my store\" and had 0 consequences. I promise I said this line. If you're wondering what happened after, he demanded to speak to my manager who shouted through the window: \"we don't hold shit for assholes unless you put it in layaway. Don't assume shit here, buddy!\" That manager also looked exactly like the BTK serial killer, so.....",
        "permalink": "/r/MaliciousCompliance/comments/hj4g7e/i_sold_the_ring_he_wanted_but_he_told_me_to/",
        "comments": [
            "I used to sell at flea markets. One year, I was helping out my father in law who made decorative lawn art. His main seller was a Dutch style, wooden windmill. Season was basically over to sell this, but he needed working capital. I loaded up the truck and took it to the best flea market in the area. Mind you, the season was over, but I decided the gamble was good enough. I had something like 50 of those things in the truck.\n\nShortly after noon,  I was down to the last three. One guy asked me to hold on to the one he bought (yeah, he paid cash) so he could shop around a bit more. I told him I'd stick around til 1, even if I sold out. \n\nDown to my last two, and I have a tourist trying to haggle me down on the price. Normal price was $30, I was selling them close out for $25. She wanted both for $35. She wasn't budging. I had agreed to let her have both for $40, but she never said she'd buy. Meanwhile, the guy That bought the other windmill came back to pick it up, I excused myself, telling her I'd be right back, turned around, handed him his windmill, and went to see about closing the sale. She was gone. Oh well. \n\nAlmost immediately, a guy steps up and asks how much. I told him $25 each, both for $45. He whipped out the cash, paid for them and walked away with a smile. \n\nOkay, I sold all of my inventory, didn't have much in the way of clean-up, and the guy I would have waited on picked up his product. All done. I go to get in the truck and the woman came back and said, \"Okay, I've thought it over and I'll buy those two for the $40 you said.\"\n\n\"Sorry, Ma'am, but I already sold them for $45. \"\n\n\"But you knew I wanted them.\"\n\n\"Yeah, but you never said you'd buy them, so when I didn't see you, I sold them to the next person. And he didn't haggle. He headed that way,\" pointing east, \"I don't think he'll sell them, though, because he bought them as Christmas gifts.\"\n\n\"Don't you have any more?\" \n\n\"Nope, I brought 50, I sold 50.\"\n\nTook the truck back to the shop, handed Dad the money and told him I sold out. It always surprised him when I did this. I did this every week for a month and a half, kept his business afloat, then headed out of state. He turned the sales over to my brother in law. BIL was lucky to sell one.",
            "If he liked it, then he should've put some cash on it.",
            "[Channel cut diamond ring.](https://bnsec.bluenile.com/bluenile/is/image/bluenile/-diamond-wedding-ring-platinum-/AB03502000_main?$phab_detailmain$)",
            ">You knew I'd probably be back! Why did you sell it?\n\nPossible future sale versus certainty of sale now... hmm let me think, this is a tough one...",
            "I love when people (who don't have the slightest clue about statistics or probability) get upset at me when they're not prepared **when\\*** bad things happen.\n\n\"I know FlightOfTheTigers is always talking about being prepared for the worst case, but who could've guessed we'd have an earthquake in the middle of a pandemic?\"\n\nBeing my job to anticipate these things: \\*raises hand\\*  \n\n\n\\*In my line of work...bad things are not **if**; they're **when**.",
            ">Man: are you fucking serious? You knew I'd probably be back! Why did you sell it?\n\nThe correct answer is \"that's my job.\" You could elaborate but it would be pointless.",
            "Idiot he could have put it on layaway and then had a refund if he found something he liked better. Being cheap bit him good!",
            "That guy, with no doubt, got what was coming to him!",
            "Friend of mine. I show him retail space in the perfect location for him. Says he wants it but it's a Friday, \" nobody will write a lease over the weekend \"\n\nCalled broker Monday morning,  somebody wrote a lease over the weekend. \n\nMy friend got a less desirable space in an older building for the same money.",
            "So satisfying when that happens. Had the same thing happen to me when selling cars. Smug asshat gives a lowball offer on a Cadi Escalade which I turn down. He says, can find a better one cheaper, but hold it for him anyway with no deposit. Explained that's not how it works, gives me more smartass talk and leaves. Comes back next morning with his wife while the Escalade is out on a test drive. He gets all mouthy again as the people pull in in \"his\" Escalade. So I walk over to the test drivers and ask if they are serious buyers, they are and say We will take it. Now I'm the happy one. Go back across the lot tell him and his snotty wife it's sold.\n\n The wife starts cussing and making a scene. I tell her no deposit was left last night so 1st come 1st serve. Now her shit talk turns it venom on husband. I tell them to clear out and don't come back. Best day ever!",
            "I have to wonder if she hung around nearby to watch him come me back for it then after he left offered it to him for a 50% markup.",
            "I would love to read more of your storys from the pawn shop! This one was hilarious!",
            "The greatest selling point for that woman was that someone else was interested in the ring first.  It was cheap and now she had a story about how some idiot passed it up to tell to anyone who would listen.",
            "I do the same with Facebook Marketplace these days, due to so many no-shows. You want it? Put some money down, otherwise it’s still available until you come pick it up. \n\nWhere this fails is in giving away stuff. I swear we had 7 people who were “dropping in tonight” to pick up a free mirror before someone eventually did.",
            "it feels like she probably wasnt sure about buying it, but did once she knew it would annoy him",
            "\"You and I just had a long and complicated conversation in our shared English language, but you can't comprehend the phrase 'We can't hold items unless they are put on layaway?' \"",
            "From my experience, no matter how much I compare - the first item I really liked is usually the one I end up getting. These days I stop looking if I find something I like - and just get it.\n\nThe only exception I'd add is for online shopping. YouTube reviews can rarely convay what the actual thing is like (especially if it's something touch/sound/size related). Some things you just need to get a feel for in person.",
            "\"WhY dID yOu Do ExaCtLY WhAt I SaID tO?!?\"\n\nKudos to that woman, I hope she is happy & wearing that ring, sparkling in the sunlight, and smiling to herself. \n\nAnd I hope you're doing well too!",
            "A sale is better than a potential sale",
            "I find it hilarious people didn’t think you said what you said.  It’s a pawn shop, not Tiffany’s!!!!",
            "My best friend owns a pawn shop, will confirm? They talk to customers as they see fit. They can say anything they want basically and treat a customer however they want",
            "My main takeaway from all this is I finally learned the name of that magnifying glass jewelers use (loupe).",
            "Money talks, bullshit walks.",
            "Greetings fellow pawnbroker! Great story.",
            "Sounds like your manager doesn’t take any bullshit",
            "Let's hope his fiance also maliciously complies",
            "This is great. You told him exactly what you were going to do. I don’t even know if it’s malicious compliance because you were following your own policy that you warned him off, but I really enjoyed this story.",
            "Does that guy not know how pawn shops work?",
            "I love this.\n\nI flip musical instruments and it's surprising how the affordable stuff just flies out the door without much bullshit. The higher ticket instruments seem to attract bargain hunters.\n\nI recently sold a highly sought after Japanese model guitar to a guy. But not before having this other guy with all the telltale signs of being a time waster. He asked a million questions. He came and looked at it. He made lowball offers. He compared it to other models.\n\nHe left, and he continued to message me. 3 days later he finally agreed on a price and I told him the instrument sold 2 days ago.\n\nHe flipped out. Saying it was his. He wanted it. Etc etc. I said \"Well, you never asked me to keep it aside and never put a deposit on it. A guy came to see it the day after you did, put the cash on the table and took it home that day. That's how you buy stuff.\"",
            "Oh man.  That reminds me of the exact opposite thing.  Back in the 90s my family would frequent the local video store.  We knew the management and were in weekly (not a Blockbuster franchise).  \n\nThey had this guy who worked the store and we’d frequently call to confirm they had some random 50s/60s musical, he’d confirm it and we’d ask if he could hold it for us, we’d be there in 30 mins.  \n\nHis response was always “it’s not going anywhere...” because who wants to rent a dopey old movie? After awhile we decided to pull a prank on him.  Call. Confirm. Hold on film.  Then we sent a family friend in to rent it.  We walked in 15 mins later and ask for it.  Dude was FREAKING OUT! “You said it wasn’t going anywhere and you’d save it for us!”  Had a good laugh with that one.  \n\nHe stopped saying “it’s not going anywhere” after that.",
            "Had to google to understand the ring was channel-set and not a Chanel set.",
            "Love it. \n\nReminds me of going to an old book fair. Friend of mine is a book dealer and had a stand, so on my way out of the fair, I stopped by to have a chat, with zero intent to buy anyhting more that day. \n\nWhile we were talking, a woman browsing his books found a really interesting one. A history of witchcraft. Book was just over 100 years old and in great condition. She spent a lot of time checking it out, and then put it back on the shelf and walked away. \n\nShe didn’t say a thing. But my gut said she was gonna bring a friend over to see it. Had she asked my friend to hold it for her for a few minutes, I’d have respected that. But since she left without saying a word, and I thought the book looked really cool....\n\nBook is now on my bookshelf. \n\nAnd yeah, my friend called me later saying she’d come back to buy it.  Oh well!",
            "For $70 he could have held it🤷🏼‍♀️",
            "Nice.",
            "I have no problem with this whatsoever!",
            "Lol he was probably gonna whine that since it wasn't his favorite he would want a discount anyway.",
            "Not malicious. First come first served. You explained the rule to the man, there's nothing else you could have done.",
            "Hes going to make a great dad",
            "Karma for expecting owner to bend his knees for you",
            "\"It's the one ring in Mount Doom",
            "Let me know what’s happening",
            "You should share more stories",
            "Isn't sadness supposed to be Will Smith too",
            "You want it to be.",
            "You want it to be?",
            "“We’re not wanted here.",
            "As a person who worked in a pawn shop, can you really get a good deal in a pawn shop? I always wondered.\n\nI’m talking about purchasing jewelry.",
            "Ring sting",
            "Pawn 1?",
            "I'm in car sales, and I get this line all the time - \"I'll come back in a couple days, and if it's not here, it just wasn't meant to be!\"\n\nWe offer temporary holds, and the shortest term, we don't even charge for. But, that's too much commitment for some people...",
            ">That manager also looked exactly like the BTK serial killer, so.....\n\n[Yeah, I wouldn't argue either:](https://www.google.com/search?q=btk+serial+killer&client=firefox-b-1-d&channel=cus2&tbm=isch&source=iu&ictx=1&fir=irHsRLKoU5KGzM%252Cki9bZhZQ6lE0SM%252C_&vet=1&usg=AI4_-kQ_t_0_bDowZpBJpsJU8U0ztM-vKg&sa=X&ved=2ahUKEwiJjt_Sk63qAhUqJTQIHYYdAAwQ_h0wAnoECAUQCA&biw=1522&bih=716#imgrc=irHsRLKoU5KGzM)",
            "While he deserved it, this isn't malicious compliance at all.",
            "> 5 second's\n\n5 second's what?  It's 5 seconds, not 5 second's.  Why are you adding an apostrophe to try and make a plural?",
            "This is the same as the US.",
            "[deleted]",
            "[removed]",
            "Feel like this could have been solved with a phone call.",
            "How much of a discount did you give her cause you thought it was funny or cute or whatever...? They were probably a partner couple in it together.",
            "[removed]",
            "You people are trash",
            "Plot twist: The woman who bought the ring was the mother of the man who first looked at it. She bought it for herself because she knew he couldn't really afford it, even though finding out her size and style was a thoughtful gesture. She didn't announce herself because she wanted to save him the embarrassment. You were unintentionally very helpful to both mother and son.",
            "This isn't malicious compliance. This is just malicious and cruel.",
            "Aww I feel kind of sorry for the guy though. Seems like the lady that bought it was just sold by what you were saying while she was eavesdropping. I doubt she was looking for that exact ring.",
            "He had kinda a smug look on his face??? Wow. You are awful."
        ]
    },
    {
        "post_id": "i4arrd",
        "author": "Sugar_Daddy24",
        "title": "Phone? Sorry, just my diabetes pump.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/i4arrd/phone_sorry_just_my_diabetes_pump/",
        "score": 14175,
        "num_comments": 591,
        "created_utc": 1596651994.0,
        "selftext": "Just found this sub! This story dates back to my senior year of high school (2013).\n\nMy school was quite small, we had a graduating class of 92 so everyone knew everyone. All the teachers were amazing and very involved in our academic lives, but for the most part had nothing but good intentions. Unfortunately there was 1 teacher, our English AP teacher, who was just an absolute jerk. She was the type of teacher that if she saw you with your cell phone out, even during lunch or in between classes, that she would take it, give it to the principal, and give you a detention.\n\nI decided to fuck with her one day because she was quite clearly in a pissed off mood and the opportunity was perfect. I was standing in line for lunch and I got my pump out (I was diagnosed with diabetes at age 8 and I have had a pump since 9). It looks a whole lot like a cell phone other than the tube running from it to my body. Without really looking closely it can easily be confused with a cell phone. She sees me playing with my pump and comes over to me. This is obviously not exact words used. I more than likely was a little disrespectful but I definitely knew the boundaries and would never be so blatantly rude or disrespectful that it would deem necessary to get a detention.\n\nTeacher: Give it to me now and follow me to the principles office.\n\nMe: Um no, I need this to live.\n\nTeacher: Give it to me now, I will not ask again.\n\nMe: No, leave me alone I just want to eat my lunch.\n\nShe then grabs my arm and drags me to the principal's office. I was very close to the principal as I was the class president so I spent a lot of time with her planning school events and such.\n\nTeacher: This student had their phone out during lunch, refused to give it to me, and was rude and back talked me.\n\nPrincipal: Is this true (Me)?\n\nMe: No ma'am, my cell phone is currently in my locker.\n\nTeacher: I saw you playing with it in line!\n\nPrincipal: (Me), please give us your cell phone.\n\nMe: Okay, follow me to my locker then.\n\nTeacher: No, give it to us now, it is in your pocket.\n\nMe: No it's not.\n\nTeacher: Then empty your pockets.\n\nI proceed to empty my pockets which was a pack of gum and then I have my pump in my hand because it's connected to me so I can't put it on the table.\n\nTeacher: Why would you lie to me when you obviously have it in your hand?\n\nMe: This is my diabetes pump.\n\nTeacher: Why didn't you tell me?\n\nMe: You never asked if it was a cell phone, you just tried taking it away from me.\n\nTeacher: This is ridiculous, you need to show more respect.\n\nPrincipal: I think we are done here, Teacher you can leave I will talk with (Me).\n\nTeacher leaves and is quite obviously pissed off about the situation. I tell Principal the truth about the trap I set for Teacher and that I hope she isn't pissed at me and I won't do it again. She chuckles a little bit, tells me to go eat lunch and she will see me later for a school fundraiser event. I never had another encounter with Teacher and during class she made it a point to try not to talk to me.",
        "permalink": "/r/MaliciousCompliance/comments/i4arrd/phone_sorry_just_my_diabetes_pump/",
        "comments": [
            "Before I started reading I had this horrible feeling of dread that she’d try to snatch your pump away from you not realizing what it was. Smh, why people like that choose teaching as a career I will never know",
            "Sounds a lot like this Malicious Compliance story shared last year!\n https://www.reddit.com/r/MaliciousCompliance/comments/b264gn/you_want_my_insulin_pump_you_got_it/\n\nYou'd think they'd do some training for the educators so it wasn't such a common mistake?",
            "I’m a teacher with a pump. I tend to have a light-hearted relationship with my kids (high school aged) and they tease me. One day, I made an adjustment on my pump and one kid just says “ooooooooh, Miss, no phones! You’re in trouble!” \n\nSo I show them the pump, do a mini-lesson on it and what it’s for, and unhook it from my body to show them how it works. One girl literally screamed like I’d just stabbed myself in the hand “PUT IT BACK ON OR YOU’LL DIE!”\n\nHaving a pump usually sucks, but sometimes it can be fun :)",
            "I once got told off for testing my blood sugar in class (T1D) when I was feeling low. She tried telling me I should do it in my own time (ie break time). \n\nI just got up and walked the hell out, almost collapsed on my way to reception.",
            "I've never had something like this happen to me, but a friend of mine use the insulin pump as an excuse not to get robbed. \n\nShe was on the train on a shitty line that links the suburbs to Paris, and two dudes approached her and asked her to give them her phone.\n\nHer : \"I can't\" \n\nOne dude : \"Come on we see it in your pocket give it\" \n\nHer : \"It's my insulin pump. Without it I die. You can't take it !\"\n\nI guess they thought it wasn't worth the trouble (or she started making too much noise) and they moved on. Sometimes ignorance is good, these dudes probably had never seen an actual pump.\n\nSo you know, next time someone's trying to rob you, tell them it's your life-needed insulin pump. Maybe they'll go away.",
            "My dad has a pump, obviously he’s not in grade school. He’s very much retired. \n\nBut the amount of times that damn thing goes off. \n\nTeachers would go nuts. \n\nBut he also can’t hear it now. The frequencies are outside of what he can hear at his age. Or he’s willfully ignoring it. \n\nWhenever I’m home with him it’s always “dad are you aware you’re going high / low”? \n\nI worry as his hearing keeps going, and he can’t hear it at all. Hopefully the pumps get better at communicating with cell phones and he can view it without having to see it. \n\nDo you have any problems with driving and getting in trouble with texting and driving when it’s just your pump? \n\nI fuss at him all the time for driving and looking at his pump",
            "Hmmm, my daughter is type 1.  We just had it written into her 504 plan that she is allowed her cell phone at all times.    \n\n\nFull stop.   But hers also has her CGM numbers and transmits them to us.    \n\n\nOur school stopped doing DARE last year, cause we had my daughter all in on stopping right before walking in to the class with the cop and saying \"Hold on I gotta get high before Dare\" and popping a starburst in.",
            "As a teacher myself, this is terrifying because they should have known you have diabetes! We are briefed on student health conditions every year and when I’ve had diabetic students there has been additional training required on recognizing highs/lows, etc. This is super dangerous!",
            "Im also diabetic and had a teacher try and take away my \"cell phone\" when I was in class. She actually grabbed it out of my hand and tore the site itself bad enough i had to do an actual site change",
            "I went to an all girls school with a pretty strict dress code. \n\nThere was one teacher that would always yell at me to put my “cell phone” away. It was my insulin pump. The first time it happened she was really apologetic. But she would call me out on it all the time. Eventually I wouldn’t even stop and would just yell back “insulin pump!” and keep walking.",
            "Also a type one here. In 9th grade our rules changed to phones must be in locker mid year due to an incident. A day or so after this rule took place the principal of the school saw mine on my hip and it went a little like this:\n\nPrincipal: Excuse me Xxgougaxx but you can't have phones on you during the school day\n\nMe: yes maam I know the new rules. \n\nP: well u need to take yours and put it in your locker\n\nM: it is\n\nP: I see it right there put it away now\n\nM: oh that's my pump. I need it to live. Its quite literally connected to me at the moment. \n\nP:(bright red embarrassed) whoops sorry, carry on. \n\nNot as exciting as OP but I totally get it",
            "My daughter had this same thing happen. Got in trouble when a teacher in the bathroom saw her with a \"cellphone\" took her to the office. Nope need it to live. My daughter is beyond shy.",
            "How childish of that teacher. Going out of your way to mess with people, and then going out of your way to avoid those who put you in an uncomfortable situation. It’s sounds like her students have a higher level of maturity than her. She should not be in a profession where she may be viewed as a child’s role model.",
            "You may want to change principle to principal.",
            "Reminds me of the time I checked my blood sugar in class at my desk, which I had every right to do, and a student teacher tried to tell me I couldn’t do that there. I told her she better check on that before she goes around saying things like that or she’s going to end up on the wrong side of a lawsuit against the district. I spoke to the school nurse later that day, cause you know us diabetic kids tend to be close to the school nurse, and she had a whole fit and took it up the chain. The next day I was called into the principals office to be apologized to by the teacher and the principal on behalf of the district.",
            "Hi fellow T1D! I'm so glad she didn't yank your pump away from you! I've had that happen and it really hurts!\n\nWas it a Medtronic pump, those things definitely look like cell phones/pagers!",
            "This sort of happened to me. I jumped all over a student whose phone beeped in his backpack before testing started. All phones must be turned off and turned in! This is a testing violation!  ...turned out his phone was actually his heart monitor that beeped when it was out of range. Of course I apologized profusely. I also brought it up at the next faculty meeting.",
            "There is a story on here of a woman tearing a girls pump out of her stomach thinking it was a video game she wanted for her kid. The results were horrifying",
            "I got suspended because of my pump. I graduated in 1999 and this happened my sophomore or junior year. I was walking down the hall and had my pump clipped in my pocket. The PE teacher saw it and told me to remove my pager (cell phones were not as popular then, most people still had pagers). I calmly said I was sorry but I could not remove it as it was attached to me. He called me a liar, i further explained it was an insulin pump. He told me he had never heard such a lie and I was taken to the office. I was suspended for \"insubordination\" since I talked back and didn't just remove my pump.",
            "Not exactly the same but in 8th grade, my teacher told me to put my phone away in front of the class.\n\nI didn't have a phone back then. I picked it up what she thought was a phone and showed that it was in fact, a simple calculator and there was no trouble.\n\nIn hindsight though, I cannot remember why I even had the calculator out. It was Language Arts class.",
            "My daughter is 6, has had a pump since she was 6mo. This is easily my biggest concern and I will destroy every teacher that tries it. My kid won't suffer cause some ass face thinks they rule over children like royalty.",
            "God, something similar happened to my mother about 15 years ago, and she's still endlessly embarrassed about it. \n\nShe was a substitute teacher and phones were only recently becoming an issue in classrooms. She saw someone fiddling with something under their desk during class, so she went up and asked them to please put it away during class. They turned and pulled out their blood sugar tester, and just told her what it was and that it couldn't wait. She was mortified and apologized over and over, she didn't know anyone in the class required it. \n\nIt's still one of those stories that embarrasses the hell out of her lol.",
            "I had a substitute teacher who tried to make me give her my insulin pump, too lol. Like, no, I need this to live.",
            "Ahh the fun side of diabetes. When I was in jr high a sub teacher thought it was a pager (just aged myself lol) and ripped it off my hip. AND pulled the entire site outta my body.\n\nNever saw a teacher backpedal so fast in my entire life than the time they just realized they fucked up BIG time.\n\nAlso got asked once by a girl in my class if it was vibrating underwear.",
            "Damn, you got off lucky. I've read a story on /r/entitledparents where [someone ripped the pump off a guy](https://old.reddit.com/r/entitledparents/comments/apy2kw/em_tried_to_steal_my_insulin_pump_and_give_it_to/) thinking it was a phone. There's actually several such stories on there. (shakes head sadly)",
            "I never thought of this possibly happening to my 6 year old. The last few years, everyone has been very informed and attentive, besides a lunch monitor who made him toss his food before he was done on the first day, causing a low. That was just a lack of communication so I wasn't upset.\n\nHowever, I WILL encourage my child to have a little fun messing with a teacher if he ever does have an encounter like yours, especially out of ignorance.",
            "When we were taking a test one of the teachers said nothing could be on the desk or in pockets.  One girl with a pump obviously couldn't comply and the teacher humiliated her trying to find a way she could \"put it on the floor or something\".  Ugggg",
            "I had a teacher once tell us about his first year of teaching. He said in one of his classes there was always a beeping noise. One day it was happening again as usual so he said “whoever has there phone out turn it off right now” all the kids looked horrified and a boy near the back said “uuum, I can’t turn it off” the item making the beeping noise was this kids heart monitor.",
            "DUDE I am diabetic and I did this exact same thing except it was during class. This power hungry teacher who was always trying to get people in trouble saw me using my insulin pump. I knew she would try and come take it so I kept fiddling with the buttons after I had given myself insulin that I had forgotten to take earlier. She walked up and said “give it to me. Phones aren’t allowed in class” and I simply replied “this is my insulin pump” and she turned white as a sheet and kind of apologized before going back to her lesson. She didn’t pick on me very much after that.",
            "Reminds of the story where a sub took away a kids hearing aids thinking they were earbuds then got mad when the student couldn't hear him",
            "This ended better for you than for my friend M in HS. Teacher ripped her pump out of her hand and out of her body.",
            "\" This is ridiculous, you need to show more respect. \"\n\nAND\n\nTHERE\n\nIT\n\nIS\n\nGod I hated that shit when I was a teenager, whenever (some) adults were in the wrong (and most likely realized it themselves) instead of conceding they would just whip this saying out. I guess some adults were just too prideful to admit being wrong to a teen.",
            "I could see mistaking an insulin pump for a pager or mp3 player or something but they really don't look anything like cell phones this is baffling.",
            "Thank you!! Relatable AF. Ever since being mistreated by staff members as a kid over my diabetes and endangering my life, I’ve been dangerously ready to escalate when necessary and make sure people don’t do this again.",
            "Some people should not be teachers.",
            "This reminds me of when I was in elementary school. There was this epic bitch who was basically a glorified hall monitor. Everyone hated her because she was anxiously nasty. One day I was standing in the lunch line and I was turned around talking to my friends behind me. I think she and I were singing a little song we did in youth group that had an accompanying dance, and at a point in the song you're supposed to wave your hands and wiggle your body downward (hard to describe, but the point is I wiggled my bum). This bitch SHRIEKED at me from down the hallway and demanded I stand against the time-out wall (if you got put on the wall you had to wait silently in front of everyone and then get your food last). I was like \"what did I do??\" She said \"you know exactly what you did! You were rubbing your butt on that little boy!!\" I was completely flabbergasted because 1. I didn't know who she was talking about (the friend I'd been singing literal church songs with was a girl. Turns out she was referring to the kid in front of me in line) and 2. I was like 10 years old and had no idea why anyone would rub their butt on someone else. I tried to explain myself but she didn't let me say anything. I had to just stand on the wall and cry silently, completely mortified and embarrassed. \n\nI hope she's rotting in hell right now. People like that shouldn't be allowed anywhere near children. Unfortunately she adopted a family of 5 or so sibling foster kids, and they were the only black kids in our school. So not only were they singled out in school because of their skin and hair, but she was incredibly strict and mean to them and wouldn't let them go to any friend's houses or birthday parties.",
            "I love how people think a graduating class of 92 is small. \n\nI had 7 kids in my graduating class. We had 32 kids in the high school my senior year and like 130ish kids in the whole school. \n\n\nHell, my home town only has about 110 people in it.",
            "Went to a club that didn't allow phone inside and one of our group has a pump, very similar experience of them trying to explain they couldn't just leave it at the door lol",
            "Wait you couldn't use your phone at all in school? Shit some classes encouraged us to use them as resources which we did yes and dicked around of course but still was incredibly useful in my chemistry and applied physics classes",
            "Happened to a classmate in middle school, we were sent to a teacher for the period that we didn't normally have. Teacher promptly said, you need to put your mp3 player away. Of course being nosy teenagers we are all looking around. Teacher says, I'm not telling you again you need to put your mp3 player away. Girl says um, this is my insulin pump? Teacher got very embarassed.",
            "Ah, another story of the 'medical equipment mistaken for mobile phone' variety. Though usually it isn't a setup. That is new.",
            "That principle is the bomb. Wish more had the good sense to just see kids as they are and not as they are told to be.",
            "I started reading this and was about to ask if you went to my highschool, because the exact same thing happened to a guy I knew. Only difference really was that he was not into school politics at all",
            "Okay. I had a kid in my high school class of 95 people that had the same thing happen in 2017, except it was his pacemaker.",
            "My friend got a distracted driving ticket because the cop refused to believe he wasn’t using his phone when in fact he was checking his pump.",
            "No phone at lunch? What the fuck? Lunch is /your/ time. She had no right",
            "Did we go to the same school!?! I had an AP English teacher who would watch the halls like a hawk between classes. She LOVED to catch kids breaking dress code (usually something ridiculously tiny like a top shirt button undone or wearing short socks). As it was a private school, we had uniforms and girls mostly wore skirts. In the winter, it was VERY cold if you wore a skirt to school because you were only allowed panty hose (or at best some short shorts) underneath your skirt. Many girls wore warm leggings that they pulled up to hide under their skirt. One day, I was walking past her in the hall and she yelled out to me to, \"Come here, now!\" It was absolutely bone-chilling whenever she directed her attention at you, even during class. She struck fear into the hearts of all students. Truly. I had no clue why she'd stopped me. She said I was getting written up immediately. I still had no clue why. She pointed at my knee and said that's against the dress code. I pulled up my skirt slightly and she saw I was wearing a cloth knee brace because I'd dislocated my knee cap earlier in the week. Felt pretty damn good to see it suddenly dawn on her and the \"egg on her face\" look she gave me (even though there was not malicious on my side).",
            "Bro u should’ve just given it to her in the cafeteria so she would see its attached to your body and ask about that and then tell her it’s your diabetes pump\n\nand tell her she could get fired for endangering  the life of a student",
            "Did she mess with your grade ?",
            "I'm glad you got your revenge they really deserve it, but gosh just readying your story makes me upset that someone in such a position like that teacher would act like that...towards a child nevertheless..it just show how being older doesn't neccesarily give you wisdom and maturity.",
            "This sounds suspiciously familiar. Belpre high? \n\nGood on you though. Teachers really need to understand more about diabetes.",
            "i know for a fact i have heard this before. idk where but on reddit too.",
            "That teacher is an absolute idiot. What if she literally pulls it out and possibly hurt someone?",
            "I em antisocial if someone takes my pump I’ll just die quietly instead of confronting them I don’t like people I hate them",
            "That's pretty harsh policy, not even allowed to have your phone during lunchtime, damn.",
            "This is funny to me because I thought my director had an oversized phone on his hip. But it was an insulin pump. Made a funny end of work day convo",
            "I encountered lots of issues having a pump in high school. Mine was wireless, omnipod, and very much resembles a phone.",
            "This story sounds awfully familiar to me i feel like i heard this story a long while ago on another subreddit..",
            "Honestly wish I had the knowledge and experience I had now in my high school body. A teacher trying to take a life saving device from me AND has the balls to put their hands on me? Yea that teacher is catching hands and being put on the fucking ground. Also at 18 (as a senior the chances are good) you’re an adult and they literally don’t have authority to touch you like that- they are not your legal guardians. Stealing a life saving medical device is assault and you better fucking believe I’ll defend myself and then sue the district and the teacher for the trouble it caused me. \n\nObviously you were fucking with them so this doesn’t really apply but if that situation came out of the blue you can bet that shit wouldn’t end well.",
            "It's stories like these that make me thankful for not having to deal with teachers who don't know shit about diabetes in highschool. My mom would've ripped the whole school district a new one lmao",
            "I've been through this a thousand times (I was diagnosed at 5, got a pump by 3rd grade) and you bet your sugary ass I was smug every time someone tried to get me in trouble/punish me for it",
            "I had a friend who was kinda like you in this case. He had a broken cell phone so he took it apart as much as he could and then proceeded to place the part back together without the screws. In one of our shared classes he pulled it out and just fiddled with it intentionally trying to let the teacher see. The teacher came by and tried to confiscate it but as he was passing it to her, he made sure she dropped it so it fell on the floor and exploded on the ground. She just stood there in shock until he started laughing and she told him to clean it up.\n\nHe unfortunately passed away about 6 years ago from complications of breaking his foot while riding a bike he hooked up a lawn mower engine to.  I sure miss his goofiness.",
            "meanwhile I had an employee at a secure facility using her cell phone and telling me that it was an insulin checker",
            "I love this method of fucking with people who are overly concerned with trivial rules. Bravo!",
            "Principal. You can remember it because principals are your *pal*.",
            "Sam? Is that you?",
            "I would like to say I had a shitty AP English teacher too.",
            "I love this so much!",
            "I change my lancet every time, but i’m totally guilty of not wiping my finger",
            "My husband had some random dude try to jump him in public once for “wearing a wire.” Nope. Insulin pump. Also, we don’t know you or care crazy dude.",
            "I had to check the name after I started reading this. The same thing happened to my daughter (also diabetic with a pump) except she was in English class.",
            "I'm quite scared about this. My dtrs school is vicious about phone use, and it looks like the best Cgm to switch to uses the phone as receiver. If they take the phone we're screwed.",
            "I was an EMT for 10 years so someone taught me that saying to help me recognize diabetic emergencies and know (or at least guess) which one I was dealing with.\n\nWe could only “help” a person use their testing equipment.   But if they were out of it we could not stick them to test their blood.",
            "My brothers pump started failing during a test. The alarm kept going and he explained, but the teacher put him in the hall (understably so). But the pump kept beeping and so he went back to the teacher and said he was going home, because something was wrong.\n\nShe was mad and told him he failed the tests.\n\nShe did however apologize to him, which I do respect. Haven't seen many teachers own up to their mistakes.",
            "My daughter just graduated (top 10, woohoo!) in a class of 58 (I know, not a huge number but we're proud nonetheless!). Me, my husband, her father, half her grandparents... We all attended that school too, so I know small schools :) \n\nit must've been super awkward for you to stand up to that teacher, being in such a close-knit, everyone knows everyone type situation, & I'm super impressed you were able to do so without compromising the respect a student needs to show a teacher. Serves teacher right for making fast assumptions, I hope she was embarrassed & had to hear about it from the principal or other teachers afterward.",
            "Hold on, I’ve heard this story before...",
            "The bigger crime is that you never learned the difference between principal and principle.",
            "It was 2013 and you weren’t allowed to keep your cell phone on you? I graduated in 2002 and parents fought to let students have them. Weird.",
            "Relatively small class of 92, ok",
            "Sorry, it was in the casting!",
            "Damn bro. No phones even during lunch and in between classes. That must have sucked",
            "I hope that teacher quit her shit after this",
            "*great name*",
            "\"I need this to live\"\nIf she would have showed you m o r e r e s p e c t she would probably notice you c l e a r l y saying that lol",
            "That “show some respect” is absolutely clownery",
            "I like the idea of you can use your phone if your not making a distraction and you understand it's only hurting your own chances at passing",
            "Medtronic!",
            "Damn, nearly everything that teacher did would have been illegal in my country.\n\n(Well, detention and physically dragging students is illegal here definitely, taking away a cellphone at lunch might very well be too.)"
        ]
    },
    {
        "post_id": "pl5wkk",
        "author": "russian_hacker_1917",
        "title": "We're not allowed to tell students they don't need to show up? Ok!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pl5wkk/were_not_allowed_to_tell_students_they_dont_need/",
        "score": 14161,
        "num_comments": 429,
        "created_utc": 1631219242.0,
        "selftext": "Back in senior year of High School (last year of HS), I had an amazing English teacher. Very engaging and passionate about what he did: a great class to have first period.\n\nWell, the class is all seniors, and it was the end of the year and finals were coming up, you know how that goes. Our school's schedule for finals was 2 periods/classes per day for 3 days. \n\nThe administration, wary of senioritis and kids skipping class, warned the teachers that they must hold class on the day of their scheduled final and that they cannot tell the students that they do not need to show up.\n\nSo my teacher, the week before finals gets up in front of the whole class and says,\n\n\"For our final, we will be watching a movie. Now, the administration has told me that I am not allowed to tell you that you do not have to show up to this final...\"\n\nHe stares at us and pauses for a few seconds.\n\n\"...so I will not do so.\"\n\nNeedless to say, I got some extra zzz's that finals week.",
        "permalink": "/r/MaliciousCompliance/comments/pl5wkk/were_not_allowed_to_tell_students_they_dont_need/",
        "comments": [
            "My high school favorite  \"hey Mr C can i go to mcdonalds?\"    \"No.\"\n<3 minutes later>  \"Mr  C can i go to the bathroom?\"   \"Ya, bring me back a coffee\"",
            "I’m a high school teacher and last year I had a student ask me “Hey Mr. M, if I were to sign myself out and go get donuts for everyone would you let me go?” To which I responded, “I’m almost certain I can’t say yes to that. But if you need to use the restroom, you’re more than welcome to go.” I gave him a wink, he left, came back and brought everyone donuts.",
            "I had a high school student come in late after lunch, maybe 5-10 minutes or so. Kid puts a parfait on my desk and goes to her seat and says nothing--if I'd marked her late, she wasn't going to make a fuss. It was the confidence that I appreciated, but the parfait helped. We all have our price, and that hit mine.",
            "My chemistry teacher did something similar. \"I can't tell you not to come to class for the last day of school. I *can* tell you that whoever's in class will be helping me wash beakers and tubes for storage.\"\n\nI have no idea if anyone showed up.",
            "Reminds me of a teacher I had once, but this would be malicious non-compliance, so sadly I can't post it here.\n\nI was in grade 12 chemistry class, with one of the best teachers in existence. This guy made everything fun, interesting, and accessible. He was clear, concise, didn't ramble, had multiple ways of explaining the same concept for people whose minds worked differently than others, etc.\n\nOne day we come into class, and he shows us a letter that he's been sent about how he needs to \"stop having explosions\" in his class, and to stop letting kids out of class early (we'd sometimes get out up to 5 minutes early if we'd finished the material for the day).\n\nSo the lesson for the day begins. He teaches us about electrolysis by running electricity through hydrogen peroxide (IIRC, may have just been H2O and not H2O2). He then demonstrates how explosive hydrogen is by igniting the collected hydrogen. He then shows us how the explosion has produced water.\n\nHe then goes away for a moment to fill up a large can (roughly a 1 gallon tin can) with methane gas. He had to go to another room, because the gas had been turned off in his room.\n\nHe promptly punched a hole in the can, lit the escaping gas on fire, and then demanded that we study it closely and write down what we observe about the fire as it burns.\n\nIt burns steadily for a few minutes, and then starts to weaken and sputter, sometimes nearly going out, sometimes coming back just as strong if not stronger than before.\n\nFinally, it seems like the flame is about to extinguish entirely, when suddenly, *BANG*, the can rockets about 3 feet into the air.\n\nHe's demonstrated to us how you can have a consistent and controlled burn of natural gas (methane), but as soon as the flame dips *inside* the container of gas, it will cause an explosion.\n\nAfter the class had settled down, he dismissed us.\n\nAll of this took about 20 minutes of the 55 minutes of class.\n\nMr. Licht, you taught me more in your classes than I learned in the rest of high school combined.",
            "Junior year of HS (1996).  \n\nLast week of school every year nearly everyone in the school brought in squirt guns and it was like a game of \"Gotcha\".  (Look it up ya damn kids and get off my lawn!!!)  The school was adamantly against squirt guns and teachers would confiscate them if you got caught.  I had an older lady for Lit who was as strict and by the books as could be.  Rumor was that she spent that week confiscating everything from everyone.  Lo and behold it was last class for the day on the last day of class, when someone got caught with a cheap clear plastic squirt gun trying to spray another kid without her seeing.  Ol Eagle Eye caught him and called him out...  And before anyone knew what was up, she pulls out two confiscated Super Soakers from under her desk and drenches the offender.  From that moment everyone pulled out their concealed squirt guns and it was a Battle Royale in the American Lit class.  As she emptied one, she picked up another and wreaked havoc on the class...  she had about 20 various sized squirt guns.  No one left that class dry.\n\nGreat time.",
            "It's been nearly twenty years, but as I recall my high school was just smart enough to give up.  I think we had to do our finals early so they could do the math and make sure we were graduating, leaving nothing to do during finals.  So... we didn't have any.  Just grad practice.  Ugh.",
            "I had a professor in intro level uni who used to get around the finals mandate by having you show up, hand write \"I am happy with my current standing and would like it as my final grade\" on a sheet and then sign the bottom.",
            "In the mid '90s I had an AFJROTC instructor senior year that let me and my friend come into his classroom to help \"put together shelves\" at the end of the year for like a week. He wrote us all day passes, and he let us run out to \"get tools\" from my buddy's house with the condition that we were back before school let out and we had made the shelves by Friday. Lol it was one shelf that actually only took like 10 minutes for one person to assemble. Sarge was the man.",
            "I still remember in senior year bringing in a note to the principal \"RobertER5 was celebrating Senior Skip Day Friday 5/3. He had my permission.\" Signed by my father.",
            "5th period after lunch was Dual credit accounting. If you did UIL for accounting you went off from the rest of the class and had a huge module study document to get through.\n\nMy group of 5 was like 6 weeks ahead in the huge booklet.\n\nUnwritten rule was to show up late after lunch and bring the teacher chickfila.",
            "Seems weird to me - in my country/state all classes completely finish a full week before exams even begin. Students get a whole week of pure study time + the exams run over a 2 week period. These were state-wide assessments though, not marked by your school teachers",
            "My school had what we called \"senior privileges.\"  They were small things like a reserved parking lot, getting out of class 5 minutes early at the end of the day, our own lunch line, and best of all! No finals for the last semester of your senior year if your grades were high enough. In fact, if you didn't need to take finals, you were just dismissed for the last 10 days of your senior year.",
            "Went to a private school for a few years. On the 15 mile ride we went buy a Dunkin Doughnuts on a busy street corner every morning. Well one day someone convinces the Bus Driver to stop and get everyone doughnuts, driver included. So he stopped the bus on the side of the road with the lights flashing so the cars stop while someone runs across the road and into the store then the lights go off. When they come out driver turns the flashing lights on again so the doughnut getter can cross the busy road, and off we go. That was the routine everyday after and everyone pitched in for the doughnuts except the driver, his was paid by us for stopping. It was that way the entire time I went to that school.",
            "England - the pub owners’ daughter was in Year 11. Every Friday she would be let out of class to take lunch orders. Every Friday a good half of the faculty and some of the Upper Sixth would have lunch and a pint before afternoon class.",
            "My high school chem teacher had \"donut day\" on fridays for seniors. Each week one set of lab partners would bring in donuts for everyone.  \n\nHe got seniors to show up to first period at 8 am all year. I worked at the grocery store so when the kids would come in to  buy donuts i would set them on the scale and weigh them as cabbage. \n\nI did get bullied a lot less after that",
            "I just say “If I were a student, I’d stop coming to school after ____day.” For some very stupid reason our district made the last day of school a Monday? Like any learning is going to happen that day…",
            "Reminds me of a teacher I had senior year, Izzy. He was a young teacher in that his senior year of high school there was a kid attending for 8th grade algebra during 0 hour. That 8th grade kid was in Izzy's class his senior year.  Like I said young.  He usually didn't care if we showed up a little late occasionally as long as it wasn't an ongoing issue and you actually did the work in the class.    \n\n\nOne day quite a few of the students were off on a trip to view colleges so the class attendance was very low. On the board he had written that we were going to watch a film about the 'Ethics of Business on Society' or something equally boring. We PLEADED not to watch the film.  He was not having it. Starts up the film and is SHOCKED to find that 'Billy Maddison' is playing. Why how ever did THIS happen? \n\nThe late policy did backfire on the valedictorian once. She went to get coffee before class and didn't know the principal or dean or someone would be in our class that morning. To be fair, no one else knew either until we showed up. Oops.",
            "One of my favourite teacher, on the last day before holidays, told us to open our notebooks to write down what homework needed to be done during the holidays. Everyone sighed until he said:\n\n\"Go out and enjoy the sun\"\n\n\"Get a lot of sleep\"\n\n\"Relax and do things that bring you joy\"\n\nThis dude was great. \n\nI had another teacher who was laid back but firm when needed. On the very last day of the school year, we had finished all the program so she told us we would consolidate what we know. One student interrupted her (nicely) and told her \"NO! Today, we make pancakes.\"\n\nAnd he proceeded to get a fucking pancake maker out of his bag, along with a big bottle of batter, some paper plates and some jam & nutella. \n\nThe teacher just looked at him, amazed, and said \"VERY WELL THEN! Let's all have pancakes! I'll go get some juice from the cafeteria.\"",
            "Reminds me of my senior English teacher from high school. To this day, years later, he's still my all time favorite teacher  (and, I admit, the unknowing object of a minor crush on my part; but he was objectively a fantastic teacher who made me love writing).",
            "My final year was great. Being an Adult for most of it meant I could sign myself out. Teachers were cool letting us know what days were important and which were if you needed help.",
            "I had a professor or two in college who would say that we had 3 big tests, two midterms & a final, but only your best 2 scores counted.  So you could take a final if you needed a grade boost but if you were fine there was no penalty to skip the last day.",
            "When I was in high school, senior ditch day was taken very seriously and seniors would ditch after their first period. My first period was music class and I was the only freshman with everyone else being seniors. I didn’t know that this class was usually saved for senior year because it was an easy A. So the day before senior ditch day my  music teacher says “I know you’re all seniors and are looking forward to tomorrow for reasons I cannot say nor encourage but I will say that I may or may not have plans tomorrow so enjoy yourselves.” I thought he was joking and I didn’t really think people really ditched on senior ditch day. I had always showed up for school, never ditched, and freshman year I didn’t really make friends so I didn’t pay any mind to it. I show up the next day, let myself into class and realize I’m the first one to show up, even before the teacher. I take my seat and wait. 15 minutes pass and still no one shows and I think it’s a bit odd but wait anyways. I’ll add that back then I had a flip phone so I didn’t have a real way to entertain myself. I start reading a book and the bell rings and yet there’s no teacher or students. I’m starting to wonder if I got the wrong classroom even though I know I’m not. 10 minutes after the bell rings I go out to check the hallway and there’s no one there. I’m literally the only one in the room. As a naive freshman, I remember that it’s senior ditch day but think surely the teacher will show up and maybe some other kids. 15 minutes into class, I hear the door open and I’m like thank god! I’ve been waiting for a good hour and see the teacher wit his coat on he seems really surprised to see me, so much so he had jumped when I spoke because he didn’t see me right away. He says “what are you doing here? It’s senior ditch day” and I say sheepishly that I’m a freshman and he completely forgot that I wasn’t a senior and we just stand there for 30 seconds until he says that he had already made plans for the day and was just coming to get his bag. I didn’t know what to say and he says well you can leave if you want and I said I don’t have anywhere to go really and he’s stumped but then takes pity on me and says ok you can stay in the room and he put on the movie Fish Tales for me on the tv. I gotta say, I had never felt more like a loser than that day 😂 and suffice to say I didn’t participate on senior ditch day when I was a senior either. This just brought up that memory lol",
            "Love that. Our teachers just gave out nonsense tests that day, with questions like, \"What's your favorite color?.\" The ones that didn't would let us know that if we had something like a doctor's appointment that day to just go ahead. None said anything about all of our doctors being at Cedar Point",
            "Seniors specifically ended school before everyone else. Graduation is usually around two weeks before the regular end of school, too. It was really neat because a lot us would go volunteer at field day at our various elementary schools!",
            "When the district where I teach went 1:1 with iPads for kids in K-8, there were a few apps that kids still had to be 13 to access (like the Adobe apps).\n\nI taught fifth grade, but Spark and Spark Video were really useful for presentations and writing projects, so I told my kids, \"Unfortunately, Adobe requires you to be 13 to use their software, so do not, under any circumstances, \\*LIE ABOUT YOUR AGE SO THAT YOU CAN GET PAST THAT FILTER\\*. It would be absolutely wrong to \\*SAY YOU WERE BORN TWO YEARS EARLIER SO THAT YOU CAN HAVE ACCESS TO THIS WONDERFUL AND CONVENIENT SOFTWARE\\*.\"\n\nLuckily, now the district creates accounts for all kids.",
            "My teacher would always say, in the most sarcastically serious voice he could: \" i will be having class and taking attendance, and i WILL mark you absent.\" While shaking his head.",
            "There's the right way and the way things really work. This was the second one.",
            "Reminds me of a scene in L.A. Law where William Shatner has a conversation with James Spader (I've forgotten the charcter names long ago.) Spader had pulled a shenanigan but the shenanigan worked out very well for the firm. Still, the conservative partners were displeased and told Shatner to give Spader a good talking too.\n\nThe talk went like this... \"Don't ever let me CATCH you doing that again.\"",
            "Awesome teacher. I had a similar situation with a very different type of teacher;\n\nFinals week, english course that doesn't have a final exam, I go in, the teacher has a documentary on that's not even relevant to the subject (I think it was about Blackberry phones, in 2013 when everyone already had smart phones), so I just started playing a game on my phone. She got all butthurt and demanded I give her my phone, I just told her it would stay in my pocket and she didn't have to worry about it. \n\nWell the principal said \"you can give me your phone for the rest of the day or you can leave.\" Last day before exams? Fuck it, no class is going to have actual work, it's all just going to be review, so I went home early.",
            "I had a teacher in highschool who would not mark you as absent if you missed a specific class, as long as you actively participated during the rest of classes and had a certain minimum grade.\n\nHe got called out by administration and had to drop this. The average grades of our classes dropped a full point soon after.",
            "I had a psych instructor do something similar. She told us the first day of class that at the end of the semester, she would drop our lowest test grade. So basically, if you got an A on every test, there was no point in taking the final. I loved her so much I took her next  level psych class too and it was the same deal.",
            "The fuck kind of bullshit administration is that? The day before finals, all of our teachers went through the list of students to tell them which ones didn't need to show up. If you did need to show up, they would write the grade you needed on the final to pass the class and hand it to you.",
            "Senior of High School, small school, 30 peeps in my class. First period PE for one 6 weeks period,  me and 2 buds were supposed to go to the football field and practice golf, BUT, my friends House was between the school and the football field, my other friend and I would show up at the house when school started, the friend living there would wake up, donuts and coffee, the price is Right for first period, show up for 2nd period like normal, Life was good",
            "Weary means tired. Wary means cautious.",
            "I currently have a professor who on the first day of class passed around the lecture hall a bucket filled with smarties. Completely unintelligible and his assignments were copyrighted by him in the late 90s to early 2000s. Spent half the first day of class talking about how he’s taught our grandparents, and that his department won’t let him teach higher level courses because they want those courses be taken seriously. I now understand how people get 100% in his class without showing up to class ever.",
            "When my son ( a senior in high school at the time) turned 18, I informed his school that he was now legally responsible for himself and could check himself out of school for whatever reasons he thought were necessary. His teachers loved that, and (we live in Texas) there were many “ necessary”  breakfast taco runs for the entire class.",
            "The technical term for this is [praeteritio](https://www.thoughtco.com/praeteritio-preteritio-1691522).",
            "Same situation. Senior year, my English teacher held his exam, as he was required to because it was administered in the cafeteria, but his exam was one page long, had three sections title \"Useless Questions\" \"Really Useless Questions\" and \"Even More Useless Questions\" that had fill in answers you couldn't get wrong like \"Which hand do you you personally use to throw a ball? Right, Left, or Other?\" \n\nDr. Kearny, you are a legend.",
            "I'm not American so can someone clear this up for me?\n\nI always thought \"finals\" in American High School referred to final examination, am I wrong in that? Or how can it be okay not to show up for final examination?\n\nOr were these classes in addition to the final examination? In which case I wonder why there would still be classes in this period, shouldn't the entire curriculum have been taught already at that point?",
            "When I was a Senior in HS (1991)  we had our Senior Skip Day like 2 weeks before the end of the school year.",
            " Had a teacher who knew we’d spend the next 2 years working on computer work, so he had us all do hand on building, the finals were all sent by the district and covered engineering, so he put some numbers that “in no way correlate with your test” on the board. Needless to say, everyone aced the computer portion",
            "Mr. Incredible working in insurance.  \"I'd like to help you but I can't... I'd like to tell you you go see Norma Wilcox but I can't...\"",
            "I had a college professor do the same thing. The school forbade the teachers from exempting students from the final. He said, \"I can't tell you you don't have to take the final, but at the start of the term I told you that I only give 5 exams (three exams, the midterm, and the final) and your grade is the average of 4 of them. I drop the lowest grade.\" He stopped speaking.\n\nOne of the students said, \"So, does that mean that if we're happy with our grade we don't have to take the final.\" He shook his head and said, \"The university has said that I can't exempt anyone from the final, but I give 5 exams and drop the lowest score, so your grade is the average of those 4.\"\n\nHe still didn't get it, \"So, we don't have to take the final?\" The rest of us shouted at this dim bulb, \"HE CAN'T TELL YOU THAT. IF YOU'RE HAPPY WITH YOUR SCORE DON'T COME TO THE FINAL, BUT HE CAN'T TELL YOU THAT!!!\"",
            "I think we had the same teacher. That fucking guy was most excellent.",
            "Before I had to move out I studied in a school that would hold a school-wide water baloon war on the last day. Damn I miss ECC.",
            "It's the kind of pointless control schools feel they need to have which does nothing but demonstrate how pointless school administration really is when it comes to the day-to-day running of the schools.",
            "As a junior in HS I was in a class of 97% seniors. In our school seniors had the last 1-2 weeks off to graduation practice and whatnot so it was just me and 2 other juniors at the end of the year. We walked into class and our teacher goes “why are you here. Go do your independent research projects” to which we all looked very confused. He responds “yeah. Weren’t you going to study the effects of a McFlurry and a mid morning nap on the effect of student mental health?”  Still we stood there confused. Finally he just flat out goes “you still can’t take a hint. Go get my flurries and don’t come back to my classroom or else I have to figure out a lesson plan and it WILL include quizzes.”",
            "My high school English teacher had a similar attitude about Senior Ditch Day. The administration had told them they couldn't encourage us to skip school and most of the teachers who were anal af had tests scheduled once word got out as to what day we were all planning on skipping. \n\nDear old Mr Bartman left us a note on the overhead projector that said \"On Friday [whatever fucking day it was] there is rumor of a planned class skip day. On [date] you will have to be in class and not going to Huntington Beach by peir [idk] or to the local amusement park. We will have a 'test' so be prepared.\"\n\nNo surprise he was the teacher every Junior hoped to get for 12th grade English class.",
            "My Spanish teacher my junior and senior years was like that. She's from Uruguay and super chill, let us call her by her first name and if we called home to get permission she'd let one or two kids from the class run down to the grocery store for snacks for the class (we had 90 minute class periods)",
            "I always feel so bad when I read these kind of stories but not for what you’d probably think of. \n\nAt my high school, if seniors had an A going into the final, they were exempt. This also came with rules: absences over a certain number in any given class forced you to take that specific exam, teachers could revoke this do to behavior, being given iss excludes you from all exemptions, and a few others. \n\nBasically if you went to school and did the work, you got off a week and a half early AND the school district inflates graduation rates. Win/win",
            "Me when my students are working on stuff independently in class:\n\n\"I am not allowed to tell you that you can listen to music while working.\"",
            "Probably should have stuck with the last bit of English class, as that’s apparently when they taught the difference between “weary” and “wary”.",
            "[**https://tvtropes.org/pmwiki/pmwiki.php/Main/CouldSayItBut**](https://tvtropes.org/pmwiki/pmwiki.php/Main/CouldSayItBut)\n\nNot bad.",
            "When attendance didn’t count against students I used to tell my students:\n\n“I am not allowed to tell you not to attend school. What I can tell is that there will be no consequences for missing, I will not be taking any grades, and we will not be learning anything new. But again, I cannot say to you ‘DO NO COME TO SCHOOL’” Everyone understood.",
            "That Teacher is GOAT\n\nAwesome teacher!",
            "We weren't allowed Phones in High School so in Grade 11(second last school year) we had this amazing Accounts teacher, almost everyone brought a phone and kept it hidden but a friend of mine decided to bring a Tablet to school and forgot to put it on silent. The teacher was teaching and it began to ring, he walked up to my friend asked for the Phone, mh friend whips out a Tablet and he just takes it and puts in his pant pocket. No one knew how his pant pocket was big enough for a tablet, gave it back after school. Really Chill Teacher, had a Heart Attacl the next year survived but was fired as he didn't really teach much.",
            "I love how maaany teachers in this comment-section exemplify a core mechanic of society, low-level corruption. Only 50% serious tho, but still... XD",
            "\nI",
            "I had a chemistry teacher my senior year that told me that I could show up to class at anytime first period after acing every quiz he gave for the first half of the semester.\n\nSo I showed up 15 min before the end of the class everyday to take random weekly quizzes. And ended the class with a proper 100%.",
            "Weird. My small town highschool til midway through tenth grade was mostly great with this. Had good exemptions and all, and made things bearable. Basically the standard no referrals, certain amount of missed school classes, passing, and tardies. That last one was kind of stupid though. I also ended up having to take an exam because I was out too often for medical reasons.",
            " this is my dad! Lol",
            "Love it. That's exactly the sort of person i aspire to be.",
            "This is how I roll with my college students—although usually about departmentally-required textbooks. I tell them they have to buy them while very slowly and pointedly shaking my head.",
            "Love it. My senior year English teacher was similar. I had her first period every day, which meant I was usually late for her class. I had long since learned how to call from outside the school directly to a teachers line in their class. She would answer in front of all of my classmates I was supposed to be learning with. I’d ask what she wanted from Starbucks or Dunkin’, then roll up 20 min later with her Chai Latte and a croissant. \n\nShe also inspired me in a lot of ways. Introduced me to Hunter S. Thompson, shared casual reading recommendations, and I used to buy her dinner for her whenever she came into the restaurant I worked at. Damn, Mrs. Goldstein, you were the best.",
            "My dad was left handed. So now I’m sorry you have to reveal your name and SS number .",
            "I signed up to be an aid my senior year for the math teacher I had for my sophomore year and also my freshman basketball coach. I would usually show up, grade papers for maybe 5 minutes and then he would just let me leave to work on homework. I could also just show up as late as I wanted and he generally never really gave me any work to do even if I was on time haha. One of my favorite teachers/coaches!",
            "My HS History teach was a father of the owner of RDS skateboarding and would spend the last week showing us their skating videos. It was always awesome and every kid showed up. \n\n\nHe was also the type to get easily distracted and talk for hours about random interesting facts. Miss that teacher",
            "that’ll show em",
            "Senior year of college, I still needed 8 math/science credits to graduate. Luckily for me, the state had *increased* the requirements to get certified as a teacher the year before (it either went into effect for new teachers that year, or was going to the next year), so the college had to scramble to create 2 new classes: \"Math For Education Majors I & II\".\n\nTo give an example of how bad the situation was (and the kind of teachers I had *before* college), the year before I had a roommate in a similar situation who the school allowed to skip the first semester class and go right into Part II his last semester. The first night, he came home with a homework assignment that went like this:\n\n* Put these numbers into ascending numerical order: 4, 9, 32, 17, 6, 13\n\nand I got to spend a whole semester learning math that was *pre-that*.\n\nNeedless to say, the old saw about those who can't held true, and by the spring everyone else in the class (I was the only non-ed-major) was struggling to pass a class that never got beyond multiplying proper fractions. The professor, who had a Ph.D in actual math, was being leaned on by the college brass to pass these kids though, so around April she came up with a compromise -- the final grade for the class was being determined by an equal-20%-weighted 4 regular exams and a final, so she announced that everyone could just drop their lowest and she'd only average the other 4. Having aced all 4 up to that point, I asked \"What if someone doesn't take the final?\" and was told that would result in getting a 0 for that test, so I made sure to get her to clarify that the final was also droppable like the other 4, which it was.\n\nThose are the people who've been teaching everyone else I know's kids for the last 2 decades.",
            "Clearly not Asian if you didn't show up to class on time anyways.",
            "1987 Mr. Jenkins. You could show up with 5 minutes left in first period as long as you brought Winchells and a Dr Pepper for him.",
            "Is not allowed outside of the states",
            "During my time teaching at universities the administration required that the students be given makeup classes on several occasions, I made clear that attendance for both periods would be taken at the beginning of the first period and that being marked present or sick was the only grade qualifier for that makeup period. I had to be present during both periods. There were between 5 and 30 students in each class. Only once in 15 years did any student come to the makeup class & that became an extremely interesting one to one tutorial on phone, tablet and computer security, incidentally the class was a foreign language speech and debate one, so technically it could be argued that it was on topic and was certainly beneficial. \n\nI was constantly amazed at the lack of security knowledge of my students.",
            "In college a TA told us he wasn't allowed to cancel the recitation but he was allowed to move it, so he said he was moving it to the janitorial closet.  We all understood.",
            "My high school government teacher to me: \"I can't tell you that you don't have to take the final. I can tell you that my favorite doughnut is a custard-filled long john. From Meijer.\" (Which was easy walking distance from my school.)\n\nI brought him back his doughnut.",
            "We had a similar thing in High School, classmates asked if we could have a look at blood under the microscope. The teacher said \"I am not allowed to tell you to prick your finger and put it on a microscope slide\", one of us got the hint and *accidentally* cut themselves on a staple.",
            "Hey, Teach, do we have to come in tomorrow, when the other kids are testing?\n\nAbsolutely. You must come in. You'll probably be the only one who does, though.\n\n(nobody comes in)",
            "I just remembered that I don’t think I took a single final senior year. \n\nI got all A’s (not a flex. I grew up to regret my wasted youth) and anyone with an A in the class didn’t have to take the final. It was a senior perk I think they called it. It was intended to get kids to actually do work their senior year. Most kids knew they were or weren’t going to college and so it was for the college bound kids to work hard to try and get a reprieve while the non-college bound kids finally got their comeuppance for wasting their time. \n\nWe can argue the ethics of the situation, but idc honestly. \n\nNo finals. Fucking awesome.",
            "My high school Spanish teacher, day before the final went over how the final would count for 5% of our grade and then very specifically went over the entire class and whose grade the final would actually make a difference for. I had a solid B. If I got 100% on the final I’d end up with a solid B. If I got 0% I’d still end up with a solid B. \n\nWe still had to show up (boarding school) but it sure made that final go by a lot fasfer",
            "T-72s all the way to release",
            "I’m fucking lazy, Brian. Ok?",
            "[deleted]",
            "Seeing all the replies sharing similar stories, makes me wonder why admins insist that kids show up to fuck around and watch movies.",
            "I’m thankful my high school had exemptions. If you had a an A (89.5 and above) in the class you didn’t have to take or show up for final. If you had that as an honors classes you got a 3 point curve/bonus so only had to have an 86.5 or better. Ap classes had a 5 pt curve so an 84.5 or better would mean no finals. Senior year was the first year I had no finals at all.",
            "In elementary school the vice-principal used to monitor the detentions.  He would often pick one of the kids, usually a boy, give him money and send him to a nearby convenience store to pick up drinks and snacks for the two of them.",
            "Bahahahahhaa yessss teacher/professor MC is my fave kind of MC",
            "The best part of senior year was finding all the ways to just skip class.",
            "This entire thread is so fucking wholesome!",
            "bringing bk or mcdonald's breakfast late as hell to first period always tasted better for some reason."
        ]
    }
]