[
    {
        "post_id": "bvx634",
        "author": "Isabel_Internet",
        "title": "We are all malicious compliancers on this blessed day",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bvx634/we_are_all_malicious_compliancers_on_this_blessed/",
        "score": 14152,
        "num_comments": 780,
        "created_utc": 1559480852.0,
        "selftext": "A guy I know (we both work in emergency services/public safety) was at a restaurant with his family. He racked up a $100 plus bill. Waitress brings the bill, he puts his credit card in the receipt thing, hands it to her. She comes back a few minutes later, tells him she can't charge the meal to that card because he doesn't look like the picture on the credit card. Well, that's true, he had lost 150 pounds in the preceding 2 years.\n\n\"Oh, that's me, I used to be fat...\"\n\n\"I'm sorry sir, you don't look like the picture, my manager won't let me run the card.\"\n\n\"Well I don't  carry that much cash, and that's my only credit card, so what do you wanna do?\"\n\n\"I don't know sir, but I can't charge this card if you dont match the picture. \"\n\n\"Well kids, you heard the lady... FREE MEAL!\"\n\n*Manager comes out*\n\n\"Sir, you're going to have to find another way to pay for the check.\"\n\n\"There isn't another way. I gave you my card, you refused to charge it, so it's your problem now.\"\n\n\"Well if you leave, I'll have to call the police.\"\n\ntEn MiNuTeS lAtEr\n\nCop: \"Oh hey Josh, what's up?\" (Remember that Josh works public safety, he personally knows all the local cops.)\n\nJosh: \"They won't take my card because it has my fat picture on it.\"\n\nCop, trying VERY HARD not to laugh: \"Uh, yes ma'am, I can vouch for him, he is the same person as that extremely fat picture on the card.\"\n\nManager: \"I can't charge the card if the picture doesn't match.\"\n\nCop: \"So he's tried to pay, and I've confirmed he is who he says he is, and that picture on the card is him, and you won't run the card?\"\n\nManager: \"I'm not allowed to, no.\"\n\nCop: \"Well Josh, you heard the lady, FREE MEAL!\"\n\nJosh and the cop then proceeded to stand in the parking lot for another 20 minutes laughing and talking, while the manager glared out the door from behind the hostess stand. (Josh's wife and kids (teenagers btw) had long since walked to Target across the parking lot.)\n\nI often would ask him if he had been back to that restaurant, he said he got a new card recently (with no picture at all) and he did go back, just he and his wife. Different waitress, never saw the manager, ate, paid, left.\n\nIt was a Longhorn Steakhouse, if you were wondering.",
        "permalink": "/r/MaliciousCompliance/comments/bvx634/we_are_all_malicious_compliancers_on_this_blessed/",
        "comments": [
            "Those people are idiots.   Why didn't they just ask for additional ID if the picture didn't match?    A driver's license with the same name on it would be enough for airport security.\n\nThey just lost $100+ in food and tips over nothing.",
            "Since I haven't seen this yet: gg Josh for getting into shape!!",
            "I’ve seen ignorance, but I’ve never heard of a manager of a restaurant not believing a cop.",
            "Similar thing happened with a s-i-l but without the cost ... his teenage passport showed him slender with a full head of dark hair. He was making one last trip to Greece on that passport and was now a 20 something. He gained weight, went bald, started shaving his head and grew a short beard.\n\nCustoms weren't having it. He was detained and even when my daughter vouched for him, he pulled out his current driver's license, company ID that sorta showed a transition shot and they finally let him board the plane. He got a new passport.",
            "Honestly, it's likely that that manager was fired if the wait staff reported the incident to coorporate.  \"Yeah, we had a diner not pay for their table.  No, it wasn't a dine and dash - (manager) refused to accept their card.  They lost weight since the photo on it.  Yes, police were called - the officer verified ownership of the card to the guy.  Manager still refused it, so the cop allowed the guy to leave.\"",
            "[removed]",
            "Congratulations, you maliciously complianced yourself.",
            "The area sounds like Jacksonville, having done the Longhorn to Target run multiple times. The attitude wouldn't really surprise me either.\n\nStill, 150 pounds in two years is seriously impressive. Congrats!",
            "Your friend should have gone to the bank and get $100 in pennies. \n\nUnwrap all and pay.",
            "The US needs to drag itself kicking and screaming into the 21st century and just use a PIN with their cards - no subjective judging of signatures or photos.",
            "He didn’t look like the picture on his credit card? As in he had one of those custom ones with a photo of him on it? Why would that be an issue, you can get anything you want printed on a custom credit card.",
            "[deleted]",
            "One of the few times that \"Then it's for free, right?\" from a customer actually works.",
            "Pictures on credit cards was a thing touted by companies as an added security feature some years ago.  I don't think anybody offers this anymore.  It would only work if used in person and a fair amount of card transactions happen without you being seen.  So, this could be an old story, but I still kinda smell a fake story.",
            "Don’t people from the US have an ID? I’m not saying a driver’s license, but an actual ID with your picture, name, date of birth, social security number?",
            "Speak for yourself.",
            "TIL all I have to do to get a free meal is to lose 100 pounds.",
            "\\* compliers",
            "Wait credit cards in the USA have your pictures on them?? America explain, I am confusion.",
            "I’m the manager and my boss says if the picture doesn’t match don’t take the card. I don’t need common sense or critical thinking just do as the boss says. I’m a good employee, now which ovens are for which people again boss?",
            "Even if he did have another card with the same name on it, they still \"shouldn't\" accept it, if they believe he isn't actually Josh.",
            "r/DeliciousCompliance",
            "[deleted]",
            "It’s apparently not too common but some people carry around this thing called “drivers license” that can verify your identification in cases like this.",
            "Why not just ask for the drivers license to verify the name!? People are not bright...",
            "Daaaaaaaaaaaaaaamn\n\nDunno how IDs work where you’re at, but if they idiot manager was here, they’d never take a card payment because no one matches their pictures.\n\nWe all get our ID pictures taken at 16 and they’re valid for about 20 years (aka you need to file a police report as loss or theft if you want a new ID... only way to get a new pic). I’m 23 now and I look nothing like that pic LOL\n\nIt used to be worse. Under the previous system, your 16-year-old ID was with you your whole life... unless it got unreadable (they used to be booklets), lost or stolen. Mom and grandma had theirs until the law changed, so...",
            "TIL that there are credit cards with peoples pictures on them.",
            "Malicious Compliers not compliancers",
            "I look super young and still get ID'd for cigarettes, and I'm in my 30s. I also lost a significant amount of weight, and my two IDs are me at my heaviest and then during the middle of the weight loss. I've often had to show both while holding them up next to me to prove yes, it is actually me, and yes, that is actually how old I am. Yes, I know I don't look like I was born in the late 80s, but I can assure you if I was gonna make a fake ID, I wouldn't have one that just causes all these damn questions.",
            "You didn't show your ID to confirm the name? You didn't have your wife pay? You pretend that anyone even gives one shit about a picture on a credit card?",
            "I worked for longhorn for 2 years and that policy is made up and ridiculous. Did they not think to ask for an ID to match the names?",
            "Excluding when I get carded while buying cigarettes, I haven't had to show an ID to use a credit card in _**years**._",
            "[removed]",
            "It’s the server’s responsibility, and she had some delegated authority here. Note that if she didn’t run the card, she didn’t get a tip. \n\nThe manager HAS to say that the card must match the photo, but if the bill got paid, I guarantee you he wouldn’t have cared. He’s probably muttering under his breath, “dangit, why did she even mention it to me, she could have run it through and no one would have cared. Oh well, live and learn.”",
            "[removed]",
            "Nice Ken M reference sir",
            "Didn’t josh’s wife have her purse? How is she going to shop at Target?",
            "That was awesome! FREE MEAL!",
            "but what are you even going on about? picture on a credit card?",
            "I just can't help but think that the manager took the bill from the poor waitress' pay to cover the \"free meal\"",
            "My only issue with this story is there is no mention  of tipping  the waitress. This was not her fault. Surely he had at least a few bucks in cash to make that right.",
            "Use the Bat Signal",
            "/r/KenM",
            "FREE MEAL Y’ALL",
            "An I the only one not getting the title?",
            "I used to work at a lonhorn. Can confirm management really is that stupid. Ugh.",
            "Poor manager. Just trying to keep that fat guy from having his identity stolen.",
            "Am I the only one questioning having a photo ID on a credit card? Is it an American thing? Never seen a single photo ID on a card. In the UK the card has name of card holder and the credit card number. Nothing else is required.",
            "Hooold on a second. Do US credit cards have a photo on them? What in the...",
            "This might be dumb, but I have never seen a credit or debit card with a picture on it. I need someone to explain this.",
            "Josh is a moron  He's lucky he's friends with the cops or he should be charged",
            "Who the fuck has a photo of themselves on a credit card? Never seen that before in my life",
            "I have several credit cards..... and not a single one has a picture on it.  I’ve worked retail for many years and have never seen a picture on a credit card. \n\nWhat part of the world is this story from, and why do they have pictures on credit cards?",
            "Speak for yourself!",
            "Wow, this is surprisingly entertaining for how mundane it is",
            "Wait, you have pictures on your credit cards?",
            "Where do payment cards have pictures?",
            "What kind of a credit card has your picture on it?",
            "I don't fully blame the workers. Companies will fire people over that stuff. I used to work at Taco bell and they will fire anyone that gave a medium cup to people that asked for a water cup. And the place I work at now will fire anyone that doesn't ID people when they buy tabacoo or alcohol. Even if the person is clearly over age or you know them, you still have to ID them. Even if the cops say it's ok, they can still get fired for not following the policies",
            "Am I the only server/bartender who doesn't give a fuck about the photos on a credit card? I ask for a driver's license every time...",
            "Meanwhile in my country when I renewed my ID, but lost the document to go get it after couple of days, they asked me to at least show bank card and my persons code to identify myself.",
            "I didn't know credit cards had a picture on it",
            "Since when did credit cards ever have your photo on them? I’m confused!",
            "You have cards with owner's picture and that picture is that important? WOW. One of the banks I had an account offered to make cards with any picture the client brought in, be it their dog, baby, celebrity, sunset whatever. But never heard of pictures that have to match the face.",
            "I love when an MC is not just a great MC, but is also just so dang wholesome. Great work losing those lbs Josh!",
            "Aaaaah, this is handbook malicious compliance",
            "Can confirm. I had a BofA card or two with my pic on it years ago. At the time they didn’t just issue them, I had to go in and specifically say I wanted my pic on them. Then someone took a current at the time pic. They will just use the same photo on new cards unless you go back in and get your mug shot updated.  Errrr mug shot and bank shouldn’t be in the same paragraph I guess heh.",
            "This is just a simply beautiful story",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_donald-trumps-taco] [This is great](https://www.reddit.com/r/u_DONALD-TRUMPS-TACO/comments/bw0xmy/this_is_great/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "I have never seen a credit card with photo ID on it.",
            "Josh you officially beat the sistem black n blue",
            "What credit cards have your picture on them?",
            "Seems pretty unlikely, I've never heard of anyone not taking a credit card in the U.S., they could give two fucks, I use cards with my wife's name and vice versa, no one cares.",
            "Stupid move to go back. Never go back to a place serving food when you've pissed off someone at that place.",
            "I've never seen a credit card with a picture on it.\n \nIs that an American or at least *insert specific state* thing?",
            "Wait a minute. Since when do credit cards have pictures on them?",
            "> wife and kids (teenagers btw)\n\nThis worried me for a second and then I realised I'm a dumbass.",
            "The funny thing is most cards don't have pictures and I'm sure they run those without asking for ID",
            "What a great server, most servers including me would not even bother to ask for ID when we see \"See ID\" on the back of cards.",
            "Im happy for Josh but im upset for the waitress. Most likely that manger took the cost of the meal out of her tips for the day.",
            "The logic... \"If you don't pay we'll call the police!\" \\*calls police\\* \"If you don't charge his card he doesn't have to pay\"....",
            "Since when do credit card have photos on them?\n\nI have had numerous credit cards over the last 25 years, never once had a photo of myself on them.\n\nIn fact, if working in a customer-facing position, I would have assumed such a thing to be a scam or a joke, and would have probably called the cops on someone who *did* have a photo on a credit card; on the assumption that it wasn’t a real credit card and they were trying to scam the company out of a free meal.",
            "Speak for yourself!",
            "..... why didn’t the wife pay?",
            "You have pictures on credit cards? WTF",
            "He’s not a dispatcher in Texas is he?",
            "Wait, is this Orlando, Florida?",
            "I would of just kept coming back to eat lol",
            "I'm guessing this is a US thing... but can someone explain the \"free meal\" thing? Is this a statute of some kind?",
            "Smells pretty fake",
            "Speak for yourself",
            "That's a good one, thanks for sharing that story.",
            "Pictures dont match so...",
            "Wait, since when did credit cards require a photo on them (not from the US)",
            "I’ve never seen a credit card that has a picture of someone on it.",
            "TIL some cards have your picture in them",
            "Fine. Agree to disagree. I believe how someone acts depends on how secure one’s job is, whether the workers had a mandatory on them concerning such, how decent one’s attitude is. \nPersonally I would have smiled and called my district manager from his table, let them decide. That what they get paid the big bucks for. Made copies of everything. \nI stand on my points. They are valid. You have many excuses but the reasoning falls short.",
            "This story did not take place in Arizona!",
            "Commenting as someone who has worked in the service industry, this is the only time in history that the dumb \"it's free\" joke wasn't a joke.",
            ">There isn't another way. I gave you my card, you refused to charge it, so it's your problem now\n\nThis sounds so odd to me (europe), because its still your responsibility to pay. The restaurant was at first just cautious which more people should do. (they couldve asked for older pics to confirm etc though). If my card got stolen i wouldnt want a random guy just saying OH thats how i used to look like and the shop just charge the stolen card. And as someone coming from retail.... the damn OH SO ITS FREE!!!.... No its not free and we hear this every fucking day.",
            "This Longhorns and Target doesn’t happen to be on Jonesboro Rd by a Truetts, Yuki’s, Texas Roadhouse, Best Buy, Hooters, Burger King, O’Charley’s, Game Stop, McDonalds, Golden Corral, Wendy’s, Chili’s, Home Depot and La Parrilla does it?"
        ]
    },
    {
        "post_id": "981w4a",
        "author": "GaelicPjotr",
        "title": "Are you sure you want to do that?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/981w4a/are_you_sure_you_want_to_do_that/",
        "score": 14149,
        "num_comments": 471,
        "created_utc": 1534509334.0,
        "selftext": "I originally placed this story at r/talesfromtechsupport, some people referred me to this sub so here you go.\n\nAbout 3 years ago I used to work at the tech department for a customer support provider. Our client was a budget ISP, so you know what's up. Besides customer support, I also worked a few hours per week as Quality Monitor (QM). This basically means that I listen recorded calls and grade them on how well the employee did. My colleague (let's call him Burt) e-mailed me that I have to listen to the call he is having right now with a customer, Miss $ladypants.\n\nTen minutes later I see that he is done with the call. I download the recording which also contains a screenrecording of Burt's desktop, so I also could see what he was doing during the call. The call was not in English so I translated as accurate as I could.  \n\n\nBurt: Good afternoon and welcome to $client, my name is Burt, how can I help you?\n\n$ladypants: Ya hi you need to fix my Wi-Fi, it just stopped working on all my devices! This is the 2,147,483,647th time this week!\n\nBurt (loading the customer data): That sounds like quite the problem ma'am, on all your devices you say?\n\n$ladypants: Ya but I still have TV.\n\nBurt: Indeed, I can see that your internet still works, so it seems to be just the Wi-Fi.\n\nBurt follows the regular troubleshoot which takes a few minutes, but $ladypants becomes impatient quickly and starts to scold Burt.\n\n$ladypants: Why does this take so long, is this your first day or something?\n\nBurt: No ma'am, but not all problems can be fixed quickly.\n\n$ladypants: I don't have time for this BS, can you transfer me to someone who actually knows his shit?\n\nAt this moment is Burt audibly getting pissed. I see him opening up his workmail and sending me the actual message as I think to myself: Burt you baldy motherfucker you...\n\nBurt: I'm sorry Miss $ladypants, but you'll have to deal with me. Let's just focus on the problem, OK?\n\n$ladypants (starts screaming): NO! I'm done with you! All of you! I want to cancel my whole package, you hear!? Right now!\n\nBurt: Are you sure? I think it's better if you-\n\n$ladypants: No! I don't want to hear anymore excuses! For the second time, cancel it!\n\nBurt: Okidoki ma'am this will take only a minute, I'll be right back.\n\nBurt (calls to $admin in the backoffice): Hi $admin, Miss $ladypants would like to immediately cancel her complete subscription.\n\n$admin: Uhm.. Is she sure about that, buddy?\n\nBurt: Yes, I asked her specifically (he didn't lie)\n\n$admin: Allrighty then, the order is first in the list so that is... done! All the services are terminated, the final bill for this month will be recalculated around $somedate.\n\nBurt: Cool, thanks.\n\nBurt (goes back to $ladypants): Thank you for waiting miss $ladypants, I ha-\n\n$ladypants: WHAT HAVE YOU DONE MY TV STOPPED WORKING!\n\nBurt: Well, that's because you have canceled your subscription, so the services stop too.\n\n$ladypants: WTF I DIDN'T MEAN THAT?! You know what I'm gonna file the biggest complaint you've ever seen! Give me your name and transfer me to your complaint department!\n\nBurt: I'm very sorry ma'am, but if you want to do that you will have to become a customer first.\n\n$ladypants: ...\n\nBurt: ... can I do anything else to help you with?\n\n$ladypants: FUCK YOU YOU PIECE OF SHIT \\*click\\*\n\nAnd the recording ends there. Burt has never heard about her again, she went to a different ISP.\n\nEdit: grammar, a bit more elaboration",
        "permalink": "/r/MaliciousCompliance/comments/981w4a/are_you_sure_you_want_to_do_that/",
        "comments": [
            "\\>> Burt: I'm very sorry ma'am, but if you want to do that you will have to become a customer first.   \n\n\nBurt is my hero today.",
            "I don't get what she actually wanted. Did she think the threat of cancelling would get him to solve her problem quicker?",
            "> she went to a different ISP\n\nAnd that's how I know this couldn't have happened in the US\n\n^/^s",
            "She's lucky her Wi-Fi wasn't stopping 9,223,372,036,854,775,807 times a week!",
            "Sounds like my job... Except the customers don't pay, can't cancel... And are coworkers. But since I have a shitty chain of command, they think customer service is more important than the respect due to the workers.",
            "Nice work throwing that prime/MAX_INT in there. A+ attention to detail. ",
            "> Burt: I'm very sorry ma'am, but if you want to do that you will have to become a customer first.\n\nbahahahaha",
            "What's the bet her problem could have been resolved by restarting her modem/router?",
            "[deleted]",
            "Reminds me of [this South Park scene](https://www.youtube.com/watch?v=TGwZVGKG30s).\n\n\"I'm sorry, ma'am, but this line is for customers ONLY\"",
            "> I'm very sorry ma'am, but if you want to do that you will have to become a customer first.\n\nThat's a lot of words to say, \"fuck you.\" Well done, Burt.",
            "Serves her right for being so rude!",
            "And with that, she became a Giant Steaming Pile of Not Burt's Problem. \n\nBeautiful.",
            "I used to work at the fruit company and I had a lady that didn’t like my answer. She had pissed me off the whole call. She tried to end the call with, “Thanks for NOTHING!” But I ended it with a chipper, “You’re welcome!” And hung up. ",
            "I had something similar happen to me (I was in the customer position). I had an online business many years ago with hosting and my domain registered with 1and1 hosting. All was well when everything was working, but my website would go down for a few hours. Then down again. And again. I called customer support each time, getting routed to India and being told the usual \"I'm very sorry sir, it looks like there is maintenance on the servers. Your website will be up soon.\" this was very frustrating to me because this is an online business and it doesn't do any good to have a website that nobody can reach and continually goes down. Looks like a suspicious business from the customer perspective. Also, that's fine if they're doing maintenance but why couldn't they switch me to a backup server or something so my website would not have to go down (I'm not in the industry so I don't know SOP for server maintenance). Maintenance was also midday and for hours or even two days on end. So I had been working on transferring my website to another hosting company, and once that was done I called 1and1 to cancel my hosting. The guy canceled my hosting AND domain, which locked my domain where it couldn't be uncanceled for at least a month. So now the domain name that people know and I had made a lot of effort advertising is now useless. I ended up getting a new domain and advertising that as the new one, but that almost ruined my business. The situation in OP's story seems small and easily correctible (just set up a new subscription), but in my situation it was pretty damaging. ",
            "I'm now at full-mast at work, thanks for that",
            "“Are you sure you want to do that?” summarizes so many of the posts on here",
            "Wait, how does one go about finding an alternative isp?",
            "I worked in a call center doing ISP tech support for awhile. Burt is my hero.",
            "But why the nsfw tag?",
            "[deleted]",
            "> if you want to do that you will have to become a customer first.\n\nThat reminds me of my first, and last, experience renting from Enterprise.\n\nI was taking a trip to a new city in Texas (Austin, I think). I was traveling on my own dime, and Austin routinely jacks up the rates for rental cars at the airport, so I rented an off-premises car from Enterprise.\n\nI caught a bus from the airport (long delays, lots of stops) and finally arrived at the Enterprise. They promptly told me that they didn’t have any rental cars available. I gave them my reservation number from a week prior... they didn’t care, no rentals, so sorry.\n\nI went outside and made a reservation at a Hertz a mile away. Noting that Enterprise had a shuttle driver just sitting in the parking lot looking bored, I asked if he could drive me the mile to Hertz, since my predicament was on account of their error.\n\nAnswer: “Our shuttle is only for our customers.”",
            "This was hilarious but it might be worthwhile to ELI5 some concepts or use whole words instead of an acronym since some people here wouldn’t have the same level of knowledge as people from tfts",
            "Thank god she canceled her plan at that call, otherwise she would have run into a serious problem having to call again for the -1 time.",
            " *Ya hi you need to fix my Wi-Fi, it just stopped working on all my devices! This is the 2,147,483,647th time this week!* \n\nCertainly, please throw your cheap D-link wireless router out the window and buy a decent one, that should solve al your wifi problems. Have a good day.",
            "Fucking brilliant",
            "I $ don't $ understand $ your $ accent.",
            "Hang on. Her service was terminated immediately? Surely she would retain her service until the end of the current billing period, no? ",
            "Burt you magnificent bastard.",
            "*slow clap* \nBravo, good sir. Bravo. ",
            "> Burt you baldy motherfucker you\n\nI'm stealing this. Just need to meet a Burt with some degree of hairloss before I can use it.",
            "If you tell a salesperson you want to quit their service, they will try to talk you into buying a different package. If you tell a technician you want to quit, they will ask you the effective date. LMAO  ",
            "Burt is a model everyone should follow when dealing with assholes! GaelicPjotr you should send Burt a link to this post and tell him too look in the comments!",
            "Sometimes the best support action is to fire your customer or let them fire themselves.",
            "Did anyone else have a specific voice for miss lady pants?  I’m sure we all thought of the same person...",
            "Did you put a Runescape reference in there? That max value stack tho. ",
            "The thing about any kind of budget service is that if you choose to go that route you need a basic understading of the subject, because 9 out of 10 times it's the support that gets cut first to provide a cheeper alternative.\n\nBasicly, i know nothing about cars and when ever anything is wrong my first action is always to ask for help, i have never even opened the hood to see if i could do anything. So i pay for expensive (fair, expensive) insurance and aditional services, i need them to realize i'm a moron and that they need to hold my hand the entire way.\n\nBut i'm fairly tech savy. So here when ever i encounter a problem with my phone or pc i go, how do i fix it, where with my car i'd go 'help me', and both my phone and isp plans are budget options.\n\nIf you choose a budget option you need to be proficient in that area to a certain degree, because your other option is Burt.",
            "I worked for a large cable monopoly and didn't have to deal with back end because I was cross trained. If they threw a big enough fit I'd check to see if they were calling from the ip modem then disconnect services as soon as they asked. Hello? Hello? Aw, they hung up. Worst case they were on their cell and didn't know what just happened so I had to explain it. YOU WANTED THIS. Go be assholes to someone else",
            "While ai never got to do this when I worked in call centers, I did get the pleasure of people getting angry with the date of the their field repair ticket and hanging up before I was technically finished with it. No tickets for them.",
            "Burt is a problem solver. Love it.",
            "I kept hoping she had a VoIP phone.\n\n\"I want to cancel my account now!\"\n\n\"Very well, I'm putting in the ticket now it should just take a couple of min\"",
            "Ooooh. Heh heh. I've got one like this. Mine dates back to, oh, '97 or so. Back when 99% of people going online used their telephone line, with the whole screeching warbling bit to connect, and being unable to make calls while online. (Cell phones weren't exactly common back then, nor was 'going online'.)\n\nI did tech support for AOL back then, fixing problems. The usual. Well, at one point management decided that the Retention team had too much work on their hands -- too many people calling to cancel their service -- so changed the rules for techs. Originally, if someone said they wanted to cancel, we'd just foist them over to Retention immediately; with the new rule, we had to ask if it was something that we could fix, and if not to go ahead and cancel right there. No further attempts to convince them to stay, other than asking, \"Are you sure?\"\n\nSo I get this guy who, without preamble, tells me he wants to cancel his service. Okay, I give the usual -- and no, there isn't anything wrong with it, he just wants to shut it off. Fine by me. I pull up the account page, verify everything, then ask the \"Are you sure\" question.\n\nHe says yes, I click the big red button, and immediately hear from his end:\n\n>     \"GOOD-BYE.\"\n\nSee, he was one of those rare users who had a second phone line, and was connected and actively using the software at the time. So when I canceled his service, it instantly disconnected him.\n\nHe shrieked. \"Hey, what happened? It kicked me off!\"\n\n\"Well, yeah, you no longer have an account.\"\n\n\"But I wasn't done with it! Turn it back on!\"\n\n\"I can't, but I can get you to someone who can.\" I then transferred him to Retention.",
            "Fuck, I wish it was that easy to cancel an ISP. Took me two fucking weeks.",
            "...\"...have to become a customer first...\" omg, that's the best!",
            "i seriously hate tfts shitty php variable naming convention",
            "This is a type of customer you don't need to retain.",
            "I'll strive to be like Burt today. Long live Burt!",
            "Ok, she was being an asshole, and this is absolutely MC,\n\nbut damn, why was she having such horrible problems with wifi?\n\nIt can be incredibly frustrating, but the service tech ain't the problem.  \n\nHeh, she shot herself in the foot with that childish fit.",
            "I hate when people abuse the NSFW tags...",
            "No need to be mean and call him baldy, yeesh",
            "Tech support is so garbage in Venezuela (CANTV), I can't empathize with them, 60 min on the phone, they hand up on you (when you think they can't do that), garbage in infrastructure. I'm just mad, good story though. ",
            "> Burt you baldy motherfucker\n\nWow so mean to Burt despite him being the hero of the story.",
            "Man, I may only know it's the maximum number in some system because of RuneScape, but I really love that 2,147,483,647.",
            "This is beautiful. You better have given his conversation a good grade, OP!",
            "Is this in Brazil? Because if it was, and canceling everything was just a matter of being an asshole, I would have been an asshole and not endure the pain that was disconnecting my service.",
            "My ISP is absolute jack piss when it comes to customer service but I would NEVER talk to anyone like that.  Nobody deserves that, regardless.  ",
            "Too bad she wasn't VOIP.",
            "For some reason my brain thinks that butt sounds like krug from Thor Ragnorak",
            "I work for a up and coming ISP. They told us that we don't need customers who are assholes. People tend to stop yelling when we agree with them that they should cancel their service. No retention. No supervisor. Just transfer to billing and let them get canceled. ",
            "Burt! You absolute legend! You lived the dream of all of us in customer service. ",
            "I feel like Burt could've replied better than \"sorry, you have to deal with me\". Still a bitch tho",
            "I actually watched a friend do this once. He's kind of an alcoholic, and his streaming TV service wasn't working (movie kept freezing) and he drunkenly called the service and yelled at them and canceled it. The first and last time I ever hung out at his house lol.",
            "My boss would have been all over my case. When I was first hired as web hosting tech support they told me if someone isn't being civil we could tell them we can't continue the call and then hang up if they keep going.\n\nMy second boss had a \"the customer is always right\" and \"always help the customer\" mindset. Even if something was out of our scope of support we were supposed to assist them as best we can. Also fuck WordPress. ",
            "Look mom, the RuneScape number! ",
            "Wonderful! Give Burt a raise. ",
            "Burt is my goddamn hero ",
            "Burt won that round.",
            "I hope that Burt got an A* QM score for responding to the customer's wishes so quickly.",
            "Burt is the overlord!!!",
            ">can I do anything else to help you with?\n\nBurt, you are a customer service tech, a representative of this cable company...\n[*Never* end a sentence with a preposition!](https://www.youtube.com/watch?v=Q4XCZfkGF8k)",
            "'how burt cost us a customer'. IDK this seems counterproductive to his job description imho. ",
            ">a different ISP\n\nWhat language is this? It looks English, but I can't understand when those three things are placed together like this.",
            "10/10 xD",
            "Not saying this didn’t happen, but it sure hits a lot of the check marks for social justice upvotes on Reddit",
            "Immediate cancellation of internet and TV? Over the PHONE? I fucking wish.",
            "Uuhuuuup",
            "[deleted]",
            "Burt is the hero we need. ",
            "That's the greatest.",
            "~~unpatient~~\n\nimpatient",
            "What’s with the weird dollar signs?",
            "wHaT hAvE yOu DoNe My Tv StOpPeD wOrKiNg!",
            "GREAT STORY!!!!! You have got to know when to FIRE THE CUSTOMER!!!!",
            "This was heroic, lol. The only creep factor is that people have the ability to scrutinize and spy on employees while at their desks, alone. That is not common...you worked for creeps, lol."
        ]
    },
    {
        "post_id": "emjj9g",
        "author": "Noodle013",
        "title": "The Long Game",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/emjj9g/the_long_game/",
        "score": 14142,
        "num_comments": 773,
        "created_utc": 1578619377.0,
        "selftext": "I’ve named this tale The Long Game, since it actually spans over the course of several years leading to the satisfying conclusion. Also, because its a long story. I’ll understand if you skip this one for a shorter one. \n\nSeveral years ago I was in desperate need of a job. I was recently released from active duty in the US Army under a medical discharge, met my girlfriend (who is currently my wife) who moved in with me with her two small children from a previous marriage, and I was bouncing around from dead end job to dead end job. I had very little real world skills to offer to employers so my options were limited. I took a chance and interviewed with a small security company and was immediately hired. They liked that I was prior service, grilled me with questions only a veteran would know, and sent me to work on their biggest contract. \n\nI was on a site of a massive multi-million dollar construction location. A large named oil company was building a new headquarters and well... massive construction project just doesn’t seem like a big enough description. As security, a bulk of our responsibility was checking and vetting all construction workers and contractors through the gate, inspect vehicles for possible stolen property, and generally serve as a deterring force. To put it simply, everyday my gate alone would process about 1-2 thousand cars during my 8 hour shift. The site was running 24 hours a day, 7 days a week to meet the very tight construction schedule. I was only on one of 3 gates so thats about 3-6 thousand cars that came on site every day in an 8 hour period. Massive construction site. \n\n(As a side note that will become very important later in the story, each car that came through had to undergo a strict inspection when the driver is FIRST assigned to work on the site. Then the vehicle gets a sticker and is allowed to drive onto the construction site. We would ensure the car has the sticker, and then just process everyones badge through a verification machine. If all badges passed, and the car had a sticker, then we would let the contractors on site so they can get to work.)\n\nWorking there was great. All the security were ex-military so, beyond a little teasing about who they served with, everyone bonded really well. We didn’t have sick days or vacations days, so when people would call off for personal reasons or illness, everyone happily chipped in to make up the lost hours. And, because of this teamwork, our big boss overlooked the call offs and let us make overtime money. No write ups, no punishments.\n\nSometimes we were working 16 hour shifts back to back. I spent many nights sleeping in the parking garage in between shifts because it was easier than driving home, to sleep a few hours, only to come back to work for another 16 hour day. We were in outdoor conditions in all weather, and were on our feet on concrete the entire time. Sitting down was a luxury that we rarely saw. We couldn’t leave the gate for any reason unless we were relieved by a supervisor who would try to come by twice during an 8 hour shift to let you go to the port-o-potty or quickly eat your lunch. Rain, harsh summer heat, bug storms (yes thats a thing), hail... you were out by your gate with no protection other than a construction hard hat. I know these sound like horrendous conditions but really, it was the best job I ever had. \n\nBecause of the conditions it was no wonder that 95% of the employees were male. We tried hiring females but most would last a few days before quitting. Those people who did not quit in a few days were lifers and loved the job. \n\nThe problems began about 3 months into the job. One of the supervisors was quitting to go back to school so a position opened up. Everyone was given an opportunity to apply for the supervisor position. I was encouraged by the night shift supervisor (who was the one quitting) to go for the promotion because he thought I would be a good replacement for him, even though I was the newest officer on the site and had the least amount of experience. So, I threw in my hat just for laughs. \n\nTwo other people applied. One was a guy who had obvious seniority. The other was a girl (one of three on the site) who had been there for about a year. We were given a face to face interview with the boss. We’ll call him Jim. My interview went well and Jim liked that I was ambitious. Jim was also the guy who accepted me onto the site in the first place. \n\nThe next phase of testing was a practice run as a temporary supervisor. We were each given a day to be the supervisor in charge. Jim was there, along with a junior Supervisor named... Ray, yeah, thats a good name for him. (For clarification, Ray did not want the promotion and was happy performing his regular duties) both were present just incase situations occurred that was beyond our ability to handle they were standing by to assist. My test day went well. I finished all tasks assigned to me and I even managed to handle a minor emergency on my own. The other two applicants apparently didn’t do to well...\n\nThe senior guy kept forgetting his list of tasks he was given to accomplish and kept going back to the office to ask Jim what he should do next. The Girl did ok, but every time she would check up on the guards she would flaunt around her temporary rank, make employees call her “ma’am”, and bragging about how she was definitely going to be getting the promotion.  Imagine her shock when I was given the position as the new night shift supervisor. To say she was angry was an understatement. \n\nApparently she was so upset that she didn’t get the promotion that she called me on my personal cell phone. She stole my number from the supervisor emergency phone. To add to the situation, I had not yet been informed I got the promotion. Nothing official had been put out just yet. Not a direct quote but paraphrasing as best as I can:\n\nMe: hello?\n\nGirl: How does it feel?\n\nMe: um... who’s this?\n\nGirl: what? You don’t know? I thought supervisors are supposed to know EVERYTHING!\n\nMe: (very confused) You called OP, I think you may have the wrong number.\n\nGirl: I know who I called! Don’t pretend like you don’t know. You got the promotion because you’re all sexists pigs!\n\nMe: I got the promotion? Cool!\n\nGirl: That promotion was supposed to be mine but I guess since Im not in the bro-club they just gave it to you. If you don’t resign the position to me I’m going to tell HR about all this sexism and you’ll all be fired!\n\nMe: What sexism? I got the position by passing the tests. Isn’t it sexist to assume you should get the promotion only because you happen to be born a female? Isn’t that act alone sexist? \n\nGirl: But only men get promoted to leadership positions!!!\n\nMe: 95% of the site is male! Odds are males are going to get promoted. Sorry you didn’t make the cut but none of this is my problem. \n\nSo I hung up the phone and called both Jim and Ray to inform them about the call. I was assured that I was promoted, they didn’t know how she found out, and they were going to file harassment on my behalf to HR for her stealing my phone number from the work phone and contacting me with threats.\n\nAnd thats where the story SHOULD end. But oh no fellow readers... it has only just begun. Now would be a good time to get some popcorn and a drink. \n\nSo about two to three months roll by and I’m getting into the role of Supervisor. Girl, has since been removed from the site, and the employees are really happy that Im the new supervisor and that Girl is gone. Things continue as normal and I begin bonding with my staff. I especially bond with a guard that no one liked. His name for this story is Victor. Victor is a marine veteran, he was in the initial invasion of Iraq and developed severe PTSD. It makes him very confrontational, argumentative, and a super big A-hole to anyone who talks to him. I liked the guy from the get go and we quickly became close friends. \n\nEvery night I would hang out with him between my duties and we would talk. I eventually convinced him to seek help from the Veterans Association, and go to PTSD counseling. He was also going to school to get his Masters degree (Thanks to Ray who convinced him to not give up on his education) and would just need to vent sometimes. I was that vent. He would blow up at me, yell and scream, and when he was done we would hug it out. It was therapy for him and I didn’t mind. \n\nAll seemed to be going well until one day I came to visit with Victor. What I didn’t know was that Victor was pulling a 16 hour shift and actually worked the afternoon and the night shift. So when I showed up to work he had already been there a majority of the day. He asked me if I spoke with Jim recently. I hadn’t. Apparently Jim didn’t show up to work today. A few days go by and well... Jim mysteriously disappeared. \n\nAfter 3 or 4 days of his disappearance, Ray called an emergency meeting with the supervisors. In attendance was myself, Ray, and another supervisor from the second shift who is not important and does not require a fictional name. The meeting was to try and figure out what happened to Jim. We pooled our knowledge together and decided the best course of action was to contact the main headquarters branch to see if they knew something. He wasn’t answering the phone when we called him so we feared he was in the hospital and no one bothered to tell us. \n\nWhen we called we were given the run around, but eventually an HR rep who was friends with Ray spilled the beans. Jim had quit the job. Girl (from earlier) apparently made good on her threats. After she was kicked out of the site, she got ahold of a lawyer and began the process of suing the company. Not only for sexism and favoritism, but also sexual harassment. \n\nAs it turned out, Jim was a lonely man. Girl and Jim began flirting and eventually sexting... and the idiot used the company supervisor cell phone to do it. She not only had copies of the messages, but when the company dug into the phone records they had all the evidence needed to see she was not lying. There were pictures... lots of pictures. \n\nGirl was brilliant. Evil, but brilliant. She knew that the old supervisor was going to go back to school eventually so she began flirting with Jim. She pursued him. Each conversation in person she would be flirtatious, rubbing him and even having sex with him. On the phone, however, she played coy and made him take charge. In the end, the evidence looked like he pressured her to have sex with him... and promised a promotion (in a bout of pillow talk and before anyone knew that the position was going to be open) to her in exchange for sex acts. At the time it was role play, but now it appears like this was all part of her insurance plan to get promoted for real. \n\nThat was more than enough for the company to do something. When Jim caught wind what was happening he took off. \n\nThis left us without a boss, and worse, in order to avoid a lawsuit, the company rehired Girl to her old position, replanted her on our site, paid her enough money to cover her missed salary plus a bonus and a raise, and promised to get more females on the site and on supervisor positions. This was enough to satisfy Girl so she dropped the lawsuit. \n\nAs the only form of authority on the site, we three supervisors took it upon ourselves to run the site as best as we could until a new boss was assigned to help us or one of us was promoted to the position. \n\nAlmost two months went by and Girl was a huge nuisance. She was constantly calling off her shift at the last minute and since everyone didn’t like her, no one was willing to cover her shift. We attempted to write her up for the situation but she quickly threw it back in our face and threaten to call her lawyer for harassment. After all, “none of the male employees get written up when they call off... obviously this is sexism and boys club all over again.”\n\nShe pushed her luck too far one day, however, and severely disrespected one of the oil company representatives during his visit. He had her permanently removed from the site. When the security company tried to take her side (for fear of another lawsuit) he said either Girl is gone or he’ll get another security company to take over the contract. The company gave in and moved her to another site. \n\nBut even though Girl was now out of our lives forever, the absolute nightmare she started was still forming overhead. The company finally found a suitable replacement for Jim, that was also female to satiate the terms set forth by Girls lawyer. \n\nOur new boss was named... well, i have lots of names for that sea hag but for now I’ll refer to her as Tasha. \n\nTasha was a handful from the get go. As the new boss she was working on the site for nearly two weeks before she ever introduced herself to either the second shift supervisor or myself (i still worked nights). What boss does that? Two weeks before you introduce yourself to the supervisors? It took her another month to eventually meet all the guards. The site was busy but it wasn’t that big. \n\nAlready she was off to a bad start. She was also non-military and didn’t seem respect the fact that every guard and supervisor was a military vet. Most of us served in war zones, lived in the dirt, and were very self sufficient. She saw everyone as a brainless meat head who needed CONSTANT supervision. The term micro-manager isn’t strong enough of a description to understand the level of hands on she needed to have. And it probably would have been much different if she was improving things, or making things more efficient... but she was barely able to perform the simplest tasks, made constant poor decisions, and just kinda ticked everyone off whenever she was around. \n\nWe three supervisors tried to train her and bring her up to speed with the site but she wouldn’t hear any of our advice. After about another week or so from her introduction to everyone she began to get worse. \n\nWe started seeing a ton of write ups flooding across our desks. Like, dozens and dozens for a single employee. And the write ups, while technically correct, were of the most petty things imaginable. Her favorite was writing up employees for breaking uniform regulations. You have a stray string on your uniform? Write up. Shoes dirty? Write up. A haircut she didn’t like? Write up. Glasses smudged? Write up. The best was her writing up a guard because his uniform was wet... because it was raining outside, and we were not allowed to seek shelter because of our duties. \n\nEvery gate had a “guard shack” available. It was a small space with just enough room for a chair and a table to write on. It had a small A/C and a mini-fridge to keep water, Gatorades, and our lunch cold. But no one could use the guard shacks because they were so far away from the gates. Still within eyesight, but we had to physically badge in vehicles and employees and the verification machine was set up next to the gate. When you swipe a badge, a green or red light flashes and it makes a little beep sound to say wether or not someone is allowed on property. But if you’re in the guard shack you can’t physically hear the beep (reminder, this is a construction site) nor can you see the lights because the lights face the vehicle. So you have to stand there and swipe the badge and physically look at the lights to know wether or not to let anyone in. Also, remember the car stickers? They were positioned on the windshield so you can’t see them from a shack 30 feet away from the gate. And because of the massive volume of cars coming and going, there just wasn’t any time to walk to the guard shack, much less sit down. \n\nWe tried to explain that to Tasha who just didn’t seem to care. \n\nIt also became very clear that she was focusing on one guard at a time. Every write up and disciplinary meeting was laser focused on one individual. Eventually that person would get so sick of the harassment that they would quit. As soon as they were gone she would focus on another guard. \n\nThe entire site went from a dream job to the most hostile work environment i’ve ever bore witness too. I served 10 years in the Army and served three tours to Afghanistan. I served under some of the most idiotic leadership imaginable, people who only got promoted because they were in the army soooo long that eventually they would get promotions. Ask a Veteran, they’ll understand what I mean. And all that time, all those dead end jobs with king of the tiny pond managers i used to work for, were NOTHING in comparison to Tasha. \n\nAfter two months under her reign 12 employees quit... including Ray. Yes, apparently supervisors were also under fire. I feel that I’m obligated at this point to mention that Ray is the best damn leader I’ve ever had the luxury of working with. Even though he was technically under me, he was and is the most professional man I have ever known. Period. Everyone on site respected him, everyone would have followed him to Hell and back, everyone loved Ray. Even when I was promoted above him, instead of being petty he encouraged me to do better. He trained me and became a role model to myself and many others on the site. Including Victor. Remember him from earlier? The PTSD guy that no one liked. Apparently he had two friends in this world. Me and Ray. And now Ray was bullied out of his job. \n\nProtip: Never fuck with a Marine. Especially one who has nothing left to lose. \n\nTo put into context how bad this really is, no one quit the company before Tasha took over. Some people left to better opportunities, or were new hires who couldn’t hack it, but overall people had worked on that site since construction began 5 years prior. Some people had been with the company going on 10 years. These were the people she was going after and who she forced to quit. I had quit smoking for three years and things got so bad everyone started smoking again, even myself. \n\nYou would think with as many people quitting that we would have a worker shortage but then you would be mistaken. As soon as someone quit, the next day the position was filled again. But 2nd shift supervisor and myself quickly learned that these people were not ex-military. These people were moody, had very bad attitudes with other guards and the many contractors we were dealing with on a daily basis. They were lazy, would often hide in the guard shacks and would not verify wether or not cars could enter the site. They were messy (both in personality and their surroundings) and generally what one would consider horrible employees. \n\nWe called Ray to see if he could contact his HR buddy to find out where these people were coming from. And here is where the story gets even worse...\n\nRemember when old boss Jim took off? Well, someone had to take the fall for the sexism lawsuit that was forming. So the company terminated another employee. That employee was responsible for staffing the oil company contract. He was also responsible for hiring veterans and verifying them. Remember the questions I was asked at the beginning of this story that only a veteran would know the answers to. Yep, that guy. He was gone. So unfortunately no more veterans were selected from the hiring pool and sent our way. He was terminated because he originally hired Jim.\n\nAs it turned out, Tasha (the new terror boss) was actually in charge of an office building contract in another part of the city. She lost the contract to that building and herself and all her guards were now in limbo and out of a job. Some of the guards were issued to new contracts but pay in security is usually pretty lousy. Normally about minimum wage. But our job paid very well. $15 an hour to start off because the company was supposed to offer it only to ex-military guards due to the site contract. \n\nI discovered years later that Tasha actually lost the building contract not because the contract ended naturally, but because she and her guards were useless that the building hired other people to do their jobs. The person in charge of contracts... was sleeping with Tasha. They covered up the contract loss so she can still have a job. Oh, and since military guy got fired during the lawsuit... Tasha’s fuck buddy took over his responsibilities.\n\nHence, Tasha got another site contract, a pay raise, and was selected only because she was female and sleeping with the contract guy. Hows that for ironic sexism? \n\nAnd... it gets better... and the write ups and harassment on our site were a ruse to get the Veterans to quit their jobs, forcing the company to fill the spot with whoever was available due to a loophole clause in the oil company contract. It basically allowed the security company to staff open positions with non-military employees in an emergency employee shortage incident. \n\nAnd guess who the new lazy employees were? Yep, the old guards that served under Tasha, who were so bad at their job that they lost their own contract. But why them? Because they were requested, by name, by the largest contract supervisor Tasha. \n\nOne by one I watched my fellow veterans and employees fall under attack and quit, only to be replaced by useless people and backstabbing thugs. \n\nI really could go on, there is a TON that happened during that time period, but its well past the time for some Malicious Compliance. \n\nI was the next to be targeted... and I was the next to quit. \n\nThe malicious compliance, unfortunately was not caused by myself initially. But, by Victor who now watched his second and only friend quit from the job site. Victor is my god damn hero. \n\nAfter I left I started working for another security company. Ironically, the guy who hired me was Jim. My direct supervisor? Ray!!! We three were back together again and worked for another oil/gas company. The pay was awesome and info was shared about Jim getting set up for the fall and what not. We tried to get Victor to quit his job and join us at the new company... but the old marine was on one last mission. \n\nRemember those car stickers? Well, as it turned out, Victor had a super power. For whatever reason, he was able to spot forged stickers from across the gate.\n\nOk, so forged stickers? Yep, they were a problem. The construction site had very limited parking and safety regulations were put in place that only licensed drivers could come onsite. The cars also had to pass crazy tests in order to meet the safety regulation compliance. The problem is that construction companies and sub-contractors often hire illegal workers, or people with criminal history, or people who just have crapy cars that probably aren’t registered or even inspected by the state. No one really cared, but without licensing they could not drive onsite. So, someone began forging car stickers and selling them to all the people who would not legally be able to get them. \n\nAt first they were crude, obviously crayon on tape. If you glanced at it, it was passable but any close inspection would reveal that the sticker was fake. If a fake sticker was found, regulation stated that the car must be pulled over, and a security supervisor would need to be contacted. The security supervisor would have to get ahold of the site foreman, a supervisor from the fake sticker driver, and a police officer who would remove the sticker and permanently remove the employee from the site forever. \n\nNow, because all the replacement guards were really bad at their jobs, the fake sticker business was in full swing. They were getting better, laser printed on vinyl, and nearly indistinguishable from the real stickers. \n\nBut Victor was now on a mission. He took a position at the main entry gate and began pulling over as many cars as he could with the fake stickers. He pulled over sooo many that a security supervisor (Tasha) was assigned to be nearby at all times. The site had to hire an additional police officer and the Site Forman had a permanent representative at the gate... \n\nEveryday Victor was pulling over car after car. He started training some of the least useless guards how to do it and what to look for. It became a HUGE nuisance for Tasha but she technically couldn’t do anything about it because he was following the site rules to the letter. \n\nAfter a month of aggressive crackdown on the fake sticker problem, the Oil company representatives held a special meeting with Tasha and Victor to plead with him to stop. He had singlehandedly removed so many construction workers and contractors that many companies were pulling their long term contracts with the oil company. Construction came to a sudden halt, and the oil company was hemorrhaging tons of money to either keep on contractors or find new ones willing to pick up the job where others left off. \n\nBest of all, the construction should have been WAY ahead of schedule so the Oil Company sold their old headquarters to someone else in the expectation to move into the newly constructed headquarters. However, incompetent security replacements were not checking vehicles exiting the properly and thousands upon thousands of dollars worth of tools and construction supplies were stolen, causing massive set backs. \n\nThen, the sticker fiasco cause any progress that was still going on to come to a sudden halt. \n\nThe Oil Company now had to pay and greatly inflated rent at their old headquarters because the building was sold but they had nowhere to send the employees!!! So the new owners let them stay and jacked up the rent so high that it was causing the oil company to lose massive revenue and stocks were beginning to drop. \n\nDuring the meeting Victor only asked one question, “So, are you changing the regulation to state that illegal drivers are now allowed onsite?”\n\nOf course they didn’t change it. They couldn’t and Victor knew it. The meeting came to a close. Victor returned to his gate and continued his mission. After a few days, an accident occurred onsite. The blame was the drivers, but the buck was passed to Victor who became the fall guy and he was terminated from the security company. Everyone knew it was Bullshit and that he was obviously the scapegoat... but Victor didn’t care. He waged his war, and in my eyes, he won. \n\nSo thats the end of the Malicious Compliance and if you made it this far then good on you. I hope you enjoyed this slice of my life and I leave you with a wish: I hope the best of your past is worst of your future. \n\nIf you’re still here then you’ll be pleased to know there is a little justice in the world. \n\nVictor left security permanently. He finished school with honors and got his Masters degree. He also took my advice and sought help for his PTSD. He ended up getting 90% disability from the VA and gets a fat check every month.  He technically does not have to work anymore but took a job as a maintenance supervisor at the local city college. He is doing much better mentally and is looking forward to buying his second home. We still talk regularly and is considered a very close friend of mine. \n\nJim, Ray and I worked together for years at another security company. \n\nJim left that company for better pay at a different security company and has only spoken to me once since his departure. From what I hear, he got married and is doing well. \n\nRay took over as a contract manager for an even different security company much closer to his residence. He is still happily married and adopted his two nephews to raise along side of his son. We still talk semi regularly and go drinking at least once a year with Victor.\n\nI became a big time security supervisor at the company and have only recently left due to political conflict. I now am an HVAC technician and me and the wife are doing well. \n\nAnd what of Tasha? Well... she was eventually fired for the hell she caused. It took years to unravel the drama but eventually karma caught up to her. Jim called me once (after he left to work somewhere else) and warned me that Tasha was looking for a job in a new security company. He just denied her application when he realized who she was based on the stories Ray and I told him. \n\nShe then interviewed for the position at my company. Guess who did all employee hiring? This guy! I had another officer send her into my office. She walked in all dressed up, smiling and ready to do her interview... then she saw me. Her smile faded and she walked out without ever saying anything. I then made a call to Ray and gave him a heads up that she was out there. Several weeks go by and she walked in to interview with Ray. \n\nHe told me that when she saw him she broke down crying. She confessed that since she was terminated she has been unable to find a job. Everyone who interviews her just so happens to be an ex-military veteran who used to work on an oil company construction site. She was losing her home, her husband left her and took her kids (he found out about the contract guy she was sleeping with), she was living out of her car... she pleaded him for a job. And Ray, the most professional man I had ever met, was an ex-marine. He knew what happened to Victor, about how she threw him under a bus. He told her to beat sand, and to tell Satan “hi” for him when she goes to hell. \n\nProtip: Never mess with a Marine.\n\n——————\n\nEdit for added info and concerns:\n\nFirstly, thank you all for the overwhelming response. I figured my story would be overlooked and possibly read by a handful of people. I never would have imagined I would get this kind of response. Thank you all for the awards, the updoots, and the kind words. It really means a lot to me and yes, I read them all. Wish I could respond to everyone but I can only say “thank you” so many times before it loses its sincerity. But thank you to everyone. Also, I will pass on your good wishes to Ray and Victor the next time I talk to them. \n\nSecondly, few commentators correctly noted that this story is very one sided and sexist against the female employees. I’m just popping this here to address their concern on a few points:\n\n1) The female character named Girl should have a real name and not just labeled as a gender. You’re right. Didn’t even think about it while I was writing this and frankly I don’t care enough about her to justify giving her an identification. If this upsets you then I understand and accept your criticism without any negativity on my end. \n\n2) This is a boys club, all females in the story are depicted as evil or were oppressed, ect... the story most certainly had that vibe and really that wasn’t my intention. Consider it a big oversight on my part. The whole story is incredibly long and there were so many people involved that if I got detailed it would be like a marvel movie. In fact the persons Girl and Tasha were the only females on the site that were a problem and were not liked. We had other female officers on site that were well respected and were treated just as equally as everyone else. One female in particular tried to be a huge help to us and she was one of the replacements. She was an ex-police officer from Chicago who helped us legally build a case of workplace harassment and even coached us on how to lead the investigation. The case was ignored and nothing productive came of it. Its a story all on its own so I excluded it due to length. \n\n3) Jim was not a victim. You are correct. What he did is idiotic and an abuse of power. I will not argue with you there. However, note that I don’t talk to Jim anymore. There are reasons for that and the fact that his loins caused numerous people grief and sorrow is a big factor. What he did was reprehensible. However, Girl using the sexual relationship to push her own agenda also negates her being able to claim victimhood. If she was a victim, she should have sued instead of going right back to a company that allowed this to happen. At least, thats my opinion which really means nothing.  \n\n4) If this story offends you then too bad. Hate to be the jerk but I can’t change events that happened in real life to suite your political correctness. Things happened, and as the world crumbles around you sometimes the moral compass get spun. It’s not an excuse, just a very sad fact of life that is highlighted when you are trying to claw your way out of a shitty situation. \n\nEither way, thank you for everything and I’m greatly humbled by you all.",
        "permalink": "/r/MaliciousCompliance/comments/emjj9g/the_long_game/",
        "comments": [
            "Worth the read. You write well and it was interesting enough to read the whole thing. \n\nWell done, all of you. And kudos to Victor.",
            "Wow that is quite a story... and a textbook MC, sad to see how much havoc can a single person cause being in the wrong place and abusing the power it holds",
            "Well written and explained.\n\nGlad the good people got out alive.\n\nAfter that primer, I think I'm ready for War and Peace.",
            "I'm just glad Victor is doing well at the end of it all. :)",
            ">I eventually convinced him to seek help from the Veterans Association, and go to PTSD counseling. \n\nI don't care about the rest of the story - this is the part where you're a hero!\n\nTaking care of each other is important.  :)",
            "How could Jim be \"set up\"? He's the boss. Bosses aren't supposed to flirt with or sleep with employees, no matter what. This whole debacle is at least as much his fault as \"Girl's\". It's kind of weird OP absolves him of any blame.",
            "Worth the read, but also great revenge.",
            "This was the absolutely best story I've read on here. You're a great writer.",
            "Damn. This was some A+ compliance right here. Also, the fact that piss poor hiring led to such losses to the company should have been a huge red flag for someone in the hiring department. This problem created itself, and could've been avoided entirely if they'd just kept the guy who vetted the security staff. \n\nAs for Victor, that man sounds like a legend. Never underestimate how far a pissed off Marine will go to make his dissatisfaction known apparently.",
            "The people over at r/talesfromsecurity would love this.",
            "I've read shorter Stephen King books.",
            "Wow, you can really tell how a man feels about women when he calls them just “females” or “Girl,” especially in a story when he’s given all the men names....",
            "Written like a screenplay. I can almost see Ray Liotta and hear Derek and the Dominos playing in the background",
            "Excellent story, & I'm glad all worked out well for the protagonists!\n\nHowever, in future, I would ask you not to refer to adult women as \"girl\", and to furthermore give a name to all characters... leaving the only unnamed character as \"Girl\" does, in fact, sound sexist. \n\n(I know, I'm full of rules. Gotta stay true to my nature as a feminist killjoy)",
            "[deleted]",
            "[removed]",
            "What a story OP! This is excellent. Thank you for your service: both to our country and to stopping Karens.",
            "This was the most satisfying fucking thing I've ever read. Sorry you had to go through hell, OP, but I'm so glad karma caught up in the end for Tasha.",
            "As a fellow Tasha, I apologize for her behavior from all of us with the same name. I am ashamed lol",
            "tl;dr",
            "I’m glad your crappy supervisor got what she deserved. Buuut I have to agree with the other woman you worked with and say this sounds like a big ol’ boys club. That’s probably why not many women worked there. Not because women don’t like standing in the rain...",
            "Great read. I actually like the longer posts. \nWhen background and relevant details are added. Thank you for taking the time to type all that out. I'm glad you guys came out okay. I was an army wife, and the bonds you make during your service last. It truly is a brotherhood. I understand to a degree, but not having actually served I know it's more in depth than non-veterans understand.",
            "Is there a TLDR?",
            "Thank you for your great story, it was playing out like a movie in my head (Victor was played by a no nonsense Tommy Lee Jones, regardless of how accurate that is!). Took your advice and made a cup of tea and got snacks at the intermission before the main story! The wind was let out of my sails when I got to 'and that was the malicious compliance', I was wondering what happened with Tasha and everyone, but then I got to the aftermath and felt like Goldilocks when the porridge was just right, so satisfying! Thanks again for sharing!",
            "That’s my uncle!!!",
            "Honestly the only thing I’m shocked at is that Tasha didn’t get fired. How did no one higher up make the correlation between her getting hired and her guys coming in and thousands being stolen from the sight - mind boggling !",
            "You were an infantry guy for sure haha",
            "You're my hero for hanging in there with Victor in the early stages when he really needed you. Vet here. Know what you did. Thanks.",
            "Pro revenge. Justiceboner!",
            "Wow, what a story!  And very well-written, which is a refreshing surprise these days.  I do have just one small critique, which I hope you won't mind terribly:  if I recall correctly, in a few instances when you said \"myself,\" in those contexts it should have said \"me\" (and once when speaking about Tasha, it should have been \"she\" instead of \"herself\").  I was an editor for several years, and old habits die hard.  But really, for the most part - bravo.  I'm glad Tasha got her comeuppance and that things worked out pretty well for the rest of you.  :)",
            "Definitely worth the read.  I was wondering just how the MC would come into play as people were getting let go, and you definitely managed the long game.\n\nYou are an exceptional storyteller! Plenty of context, nice and clear, and well paced. Didn't even realize how long the post was until I finished, was too caught up enjoying it.  Excellent work all around.",
            "Thank you for not putting a TLDR.  Well worth a read.",
            "[deleted]",
            "Please post this on r/militrarystories.  As most of you are Vets as well as the fantastic story in and of itself they'd appreciate it probably more than we already have!",
            "You ever stop to think about the fact that you very well could have helped Victor from becoming another statistic? You know the one I’m referring to. Without somebody having been willing to sit and let him vent without taking it personally. Without having somebody sit there and talk to him and encourage him to get the help he needed. Without having somebody, we may not have Victor. What you did Is what more veterans need to do. Thank you for being your brothers keeper. \nSigned\nA. Veteran",
            "Btw, your story was read on YouTube by Storytime.  Took up the entire video of over 30 minutes. 😁",
            "This was the most satisfying MC I've ever read. Great storytelling by the way!",
            "Fucking long story it would of been shorter if you had wrote a book damn!! Good though 😉",
            "Thank you for this story, I love it! I am upset with both women and how they acted. As a woman I have experienced sexism, also at the office. However, crying \"sexism\" when that's clearly not the case is really harmful and needs to be dealt with accordingly.\n\nMy boss once asked me to take minutes during a meeting with the rest of the attendants being all male. It wasn't a sexism thing where they ask the woman to take minutes. My boss knows that my minutes are the damn best, so he asked me to take care of it.  \nIt's really easy to cry sexism when you're a woman in a male dominated field, but you need to be damn sure before you do. The time I had a  temp job where everyone earned the same, and I later found out my male colleagues were actually making more... that was sexism (I got the raise and missed wages paid). The time my boss asked the female in the room to take minutes... not sexism.\n\nGood on you and Victor for not taking that crap.",
            "Thanks for sharing !",
            "Fucking love it!",
            "Holy crap. That was absolutley beautiful. Thank you for your service, and you're a hell of a writer.",
            "Previous commenters are right: well written. Thanks. And yay for Victor.",
            "Screw short posts! This is the kind of shit I'm on this sub for. It's interesting, well written, clear.. it's basically a work of art.",
            "Victor: tormented, nothing to lose, & has copy of the rule book. Malicious Compliance just waiting to happen!",
            "That was a long read. You weren’t kidding. Good story though. Glad to know Victor is doing well.",
            "This is the longest thing I've read in ages, but it was worth it.\n\nI was worried that the MC ended with Victor, but I was happy to read the epilogue at the end there.  10/10",
            "Very long, but well worth the read. Thanks.",
            "That was amazing. You are quite the writer, my friend.",
            "This guys got premium for years",
            "All of that for that itty bitty malicious compliance... I feel used.",
            "I love everything about this story, even if the Malicious Compliance was only a small part of it. Thank you for telling us what happened to everyone after this all went down. I legit made a movie in my head while reading this. Your writing is spectacular and your storytelling skills are on point!\n\nGlad everything worked out (for most people) in the end!\n\nMy dad was a Marine and let me tell you something, don't EVER fuck with a Marine.\n\nSemper Fi",
            "Thank you for sharing this story.  I am a woman, and I enjoyed the hell out of the read.  Women can be damned beasts!!",
            "> Now would be a good time to get some popcorn and a drink.\n\n*scrolls down*\n\n*gets popcorn and a drink*",
            "Good story, but fuck you I lost the game",
            "I thought I was reading a Hallmark TV Movie at the end lol",
            "Fuck you Tasha!",
            "A well-told tale with awesome karmic ending. I applaud you OP, not only for a rollicking good story, \nbut for telling it so well, and on your PHONE, no less! \n\nSome Redditor who reads this should contact you about seriously turning this into a movie / sequel 1 / \nsequel 2; or even a short mini-series for one of the streaming services. There are so many topics and \nthemes that would capture an audience. I would watch for sure, and tell my friends to not miss out.\n\nAnd when it comes to filming, please remember to sign Vin Diesel for the part of Victor!\n\nThank you, OP, for unapologetically  sharing your huge-part-of-your-life story here.",
            "Nothing happened to girl? Shes the ome who started this chais, she mist have received karma one way or another?",
            "100% epic.",
            "You write very well and spin a good tale. Ever consider writing professionally?",
            "When is the movie version of this coming out?\nI would definitely watch it",
            "Oh man what a mess. Women like that give the rest of us a bad name and it's really annoying. It's so satisfying seeing people get what's coming to them though. Tasha can go kick rocks",
            "Props on being an HVAC tech. I'm one myself. On the commercial side.",
            "You Got Featured in a Rslash Video\nAnd Came here to say Hi",
            "Wow. You know, normally I’m a big equality/women’s rights person, but for real, that has to have limits. What Girl did, twisting a situation and making herself out to be a victim in order to get what she wanted, is *exactly* why people don’t believe actual victims when they report.  To me, it doesn’t matter one bit what Jim did or didn’t do, at least in the scope of this story. Not saying I think he’s a saint, but what she did makes what he did a non-issue: she used “victimhood” for her own personal gain. Unbelievable. \nI’m glad Tasha got her comeuppance, not being able to find a job. She targeted vets who were doing their jobs and good at them just because she wanted to plug in her own deadbeat people. I may not be military, former nor current, but damn even as just an American, that should be unthinkable. Don’t take good jobs from vets doing a good job. \nAs for Victor, I’m glad he got the help he needed and finished his schooling. And tell him it’s impressive he managed to almost single-handedly shut down such a massive construction project! Thank you all for your service, and thanks for sharing this story!",
            "I have absolutely no words, other than how amazing this was. Truly puts the \"rollercoaster\" in the metaphor \"this story was a rollercoaster\". I have a fuck ton of shit I want to say and stuff but it would be gushing, so I'm gonna leave it at that... This story has got to be one of my greatest saves!",
            "Enjoyed reading through all that. Details were great. Learned a few interesting things as a civilian (just how things are run, etc). Kinda curious what questions only a veteran would know on an interview now. I’m sorry about Girl; stunts like that hurt legit MeToo issues.",
            "pleeease can you write actual  books too because you write really well and that can't be the only yarn you have",
            "No TL; DR here. Would read again and again.",
            "Incredibly well written. My ex is a veteran (we're still great friends and coparents) and I'm always blessed to see the loyalty he and his army buddies have, even with some of them thousands of miles away. My daughters have \"uncles\" all over the world because of the army.",
            "So the company only hired veterans and you don't see the discrimination at that point",
            "Oh man.  I've never served in the UK services but I have found that the German, British and American vets I've worked with make for the best employees in almost all cases.  They are highly organised, presentable when necessary, highly reliable (even the ones with PTSD, one of my mates holds down a director level job with a pipeline company despite serious PTSD after two tours in Iraq and two in Afghanistan), they are used to a rigid management structure and they don't tend to make trouble unnecessarily but are quite good at causing issues if unfairly provoked.\n\nI have not had the privilege of hiring one yet but working with these men and women is great.  She is a total idiot.",
            "It's a great read and great compliance.\n\nMaybe a TL;DR?",
            "It seemed like the bad guys won halfway through the story but I'm glad it worked out in the end. A reminder that sometimes, you just have to dig in and move forward. Kudos to Victor. Ray sounds like an angel. You write very well OP, all the best to you.",
            "I am legitimately so upset at all the people calling sexism for this writing. This is a very boiled down story about two people who are horrible who just happen to be women. Women can be sexist, even if you don’t like it. I know the OP personally and he is a huge advocate for equality and fairness and not being a shit ass in general. Maybe don’t read into things using your experience as the lens and if you don’t like it just leave it? All this negativity on a story about negative people feels gross. It’s honestly astounding to read a story about someone entirely different but the main point I keep seeing people make is “she can’t be sexist she’s a woman” like???? That was back story and THATS NOT EVEN HALF OF WHAT SHE DID. She was an awful person. But sure go ahead and lash out at someone that I greatly admire and is the hardest working person I know bc you got a personal bias.",
            "Made it through, was watching anime in the barracks when I came across this and I had to pause it so I could really read it, I’m glad I did and the ending where we learn about everyone (especially the she devil) was my favorite part, I love when they do that in movies too.",
            "Written like a vet, as read by a vet. Well done, bro. And buy Victor a drink for me.",
            "Okay, I'd watch that movie! So long as the ending is emphasised so that the evil people truly get their comeuppances and the good guys really do leave for greener pastures at the end. I think it could have an Office Space feel, and become a cult classic. Please mention \"As seen on Reddit\" in the ads/posters, so that I know to watch it.",
            "Came for a story, stayed for Victor.",
            "That's probably one of the longest reddits I've read but with a great outcome. Thanks for sharing.",
            "Hell Yeas!! Semper Fi!!",
            "This was incredibly well written! I know you may be tired of hearing this, but.... You really would be an excellent writer. You built up exactly enough exposition before going into the main conflict and resolution. And good for you for not putting up with such crap and for doing well!!!!",
            "Is Victor still single? Not asking for a friend...",
            "Ahh yes!",
            "This is sort of r/prorevenge but she played herself on the long game haha.",
            "/r/NuclearRevenge?",
            "That was fucking fantastic. I love these longer reads that have ridiculous payoff at the end.\n\nGood thing karma caught up to her; I hope all her references (assuming they were her former lackeys) also can't find jobs in their respective fields. Shame on them for being such terrible liabilities to any company, no matter the cost to those companies.\n\nI have no love for the oil companies, but this should have been handled way better, even for them. But that's all water under the bridge now.\n\nGlad you and your friends are doing well, and keep in contact. I daresay I hope there are more stories from you, as you write very well, and even with the anonymization, keep it coherent enough to follow!\n\nAs an aside, if I were friends with you (have a couple ex-military friends) I would cherish your discipline and ability to follow rules, however asinine they may be, just to spite the people that want to go around them.",
            "I never served.  But I have worked with a few that did.  And I learned very fast (Not that I needed to), but you do NOT fuck with someone who served.  No matter why they got out.  You NEVER fuck with them.  And I have earned a few friends from that.\n\nI respected them, and earned their respect.  And I would NEVER tarnish that, even to those who I have not had the chance to meet.  I respect anyone willing to put their life on the line.  I also can't stand the kind of BS \"girl\" and \"Tasha\" pulled.  I also would have 100% helped \"Victor\" in every way I could have.  Both his PTSD, and his \"final act\".",
            "Do you know what ended up happening to Girl?",
            "Thanks for writing a military related story in a way everyone can understand!",
            "What about the girl? Did she ever get her comeuppance?",
            "TLDR.",
            "What a read! amazing",
            "i breathed through my nose a lot. but eh, what happened to Girl?",
            "This ought to be on TV. Great story brother 💪",
            "**My \"I've got a similar story\"**: I had a project manager who was a real witch. Everyone hated her but me, I merely found her to be \"something to ignore\". One day she got very nasty to me, nasty to the point that the entire staff threatened to quit. I called the boss and told him all about it, he had to cut short his vacation (on which he was introducing his parents to their new grandchild) to come home to fire her. She stole the company laptop, and the company eventually decided it was worth it to not have to talk to her again. She moved on to another company, which soon hired me and someone else from the staff who hated her. We warned management about her, by virtue of telling them that under no circumstances were either of us willing to ever be alone in a room with her, because who knew what lies she would tell if there were no witnesses? Not long thereafter she had a bad meltdown in the office and ran out the door, leaving all of her things. She was never seen again. The moral of this story is, never hire a large woman wearing a tweed Chanel jacket and too much perfume.\n\n**My \"Yeah, never mess with a Marine\"**: When I was a kid (about 9) the (new) principal somehow got it into his head that I was the root of all evil, and punished me pretty severely. The two worst punishments the school offered (in a state where expelling someone was illegal) were, silent lunch (you were seated at a special table for kids that had \"silent lunch\", kids at surrounding tables would taunt and/or hurt you, and if you so much as yelped someone would be there in an instant to scream at you and send you to the office to be yelled at further) and indoor recess (everyone else got to go outside and play or be in the cool shade while you had to sit in a very hot classroom and do work). The principal gave me both, *every* day - pretty much exclusively because I had the audacity to complain about the people that were bulling me, and this would create work for him if I didn't shut up. I tried to explain to my parents what was happening to me at school and ask for help but they wouldn't even let me talk, they just assumed that whatever the school did was okay and they didn't need to get involved and if I wanted to talk to them about it I was just wasting their time. (Yeah, my parents were real winners. I would conclude I was an unwanted \"oops\" baby if I hadn't encountered the Planned Parenthood literature in which my mother recorded her very deliberate effort to have me. So I *know* I was wanted, they just *treated* me like I wasn't.) \n\nSo one day he pulled me out of class to bully me personally in the hallway outside the classroom. He pushed me a \\*bit\\* too far and in a panic I escaped and ran out the nearest door out of the school - I intended to walk home (a few miles). However, by chance my mother had just showed up to take me out of school to take me to the dentist, so her car was right outside the door. She, being crazy, didn't question why I came running out the building as soon as she pulled up and got in her car. Kids in the classrooms with windows facing her car only saw me run out the door and get into a strange car. The school asked what had happened - the car she was driving wasn't the one they had a description of on file (she had two and they knew about the other one) and she'd never actually gone inside to talk to them, so as far as they knew I was kidnapped, and the school went into full freakout mode. Meanwhile my mother pacifically took me to the dentist and then home, where she didn't find out about anything for a couple hours until the police called again to see if she'd gotten home. \n\nMy befuddled (and, I'm not kidding, severely mentally ill) mother did nothing about it (she outright refused to speak to them) until my father got home, and told him. (Her refusing to speak to them *did not* help them calm down, but it took 3 hours for the nearest police to get to us, so nothing happened before my father got home.) \n\nMy father was a marine. (A sniper, a very good one, and a Vietnam vet. I saw him shoot a squirrel in the head with a BB at about a quarter mile at age 71.) He talked to me and finally listened to what I had to say, motivated by the police being involved, and was infuriated when he learned what the principal was doing to me - he said he knew of the \"silent lunch\" punishment being used when he was in the service, and it was very inappropriate for a kid. *Any* kid. Especially *his* kid. He called the school, which had kept the main office staff - including the principal - there until they heard what happened to me. (I suspect the principal was *not* happy about the chaos he had caused, it was about 7:30pm and he had been at work for over 12 hours solid, but he had no way to get the school to call off the frantic search for me and any attempt would involve admitting that he had been bullying a child.) My father got in his car and went to the school and \"talked with\" the principal.\n\nI don't actually know for sure what was said, I can only guess, but my father told me that night that I wold be off of both daily punishments immediately and the principal wouldn't be bothering me any more and please let him know if the school failed to fulfill this in any way. In fact the (very macho, scary to most kids) principal would go sheet white, turn on his heel, and walk very quickly in the other direction when he saw me coming - a fact that did not go unnoticed by my peers, to their astonishment. (I had the good manners to refuse utterly to explain.) \n\nNever mess with a marine.",
            "Tasha is the definition of someone burning all their bridges.\n\nLet her be an example to all of us; it's better to not be an asshole.",
            "that was a great read! good job to all of you for sticking your ground!",
            "amazing",
            "Haven't read this satisfying story in a long time..\nThanks mate...\nAny word on \"girl\"",
            "Typically people like Tasha are in a downward spiral of their own design. That type of energy just gains momentum. She had a lot of chances....\n\nRespect. I hope your boy Victor was the one selling all those fake stickers for side money.",
            "i just lost the game",
            "That was an absolute belter of a story, so glad I took the time to read it and very happy that the good guys turned out alright in the end!",
            "Man, this was fucking AMAZING!",
            "That was just...perfect.",
            "Great story! Thank you for taking the time to write it!",
            "Good story, and better telling. Seriously - well described, laid out, punctuated etc. Very enjoyable to read.\n\nThis is underrated IMO. A lot of posts on this sub seem to be focused on the story being told over the delivery, but personally I'd far rather read an average story that's enjoyable to read over a great story that's told badly.",
            "That was fucking awesome. All of it.",
            "Amazing story probably the best one I’ve heard. Perfect ending when I saw how long this was I was about to keep scrolling but when I read the first paragraph I was hooked!",
            "Was this in the woodlands? Did the oil company have an X in the name?",
            "Wow, what a wild ride. Really enjoyed your story, it's so well written. Absolutely infuriating too but I'm glad you and your buddies mostly won out in the end. Well done :)",
            "great read, glad Victor got it sorted!",
            "I was in for the long haul as soon as I read the military part. Good for Viktor",
            "Well worth the read. Written well and easy to relate to.",
            "I absolutely loved this story.  Excellent build-up, great people, and good old fashioned MC made this an incredible read.  I’m saving this to read again and again later on.  Thank you for sharing this amazing work of art.",
            "Had me hooked, brilliant story. I went and made a Tea at your mention of popcorn and a drink, I knew this was going to be a long one :)",
            "King.",
            "best read of the day!",
            "Thank you for this. Fantastic story. Glad karma came round",
            "that was a good read, well worth it, kinda wanna walk past her car and give her the 🖕🏻",
            "Just wanted to let you know this story is 5,326 words, and adds up to 9-1/2 pages at standard font size and spacing.",
            "This was amazingly well written and well paced for such a long story. It kept me reading all the way to the end and am glad that everyone ended up better off.",
            "Woahhhh that was a freakin movie man!! 10/10!!",
            "Don't know if you'll ever read this, no need to reply, but I came here looking for justice and I found a moment of tranquility. I don't understand or can relate to being a vet, I can understand the love you had with your team and without active retaliation you steered your lives in a positive way (I know there must have been a lot of swearing in your minds at least) ending in such a calming manner I was not expecting. Thank you for the story!",
            "It's been a long time since I've seen \"beat sand.\"",
            "It was worth the read. Keep up the good work and thanks for your time in service!",
            "Wow that was totally worth it! Glad Victor's doing good.",
            "This was a massive wall of text, but I am not disappointed. Thanks for a great read! Glad to hear things are looking up for everyone that was wronged and Tasha is getting what she deserves.",
            "Saved comment, will read later",
            "Easily the best MC I've read to date. Kudos to Victor.",
            "Story enjoyed",
            "That was a fantastic story, karma's a bitch!",
            "A roller coaster of a story! I loved every second of it!",
            "YAY VICTOR!!!!!",
            "That was fucking amazing. One of my best reads while taking a dump (I sat here for 20 mins longer to read this). Wish I could give you an award but I’m broke, sorry.",
            "LOL man that was a good read",
            "It was easy to stay engaged. Thanks for being literate. Nice MC!",
            " So, are you changing the regulation to state that illegal drivers are now allowed onsite?\n\nThat shit gave me shivers man.",
            "I was disappointed with the malicious compliance (though still enjoyed the story) until I saw that Tasha was fully fucked and couldn’t get another job. This made me happy.",
            "Victor is the man. Seems like such a cool dude that’s just misunderstood",
            "Just finished well done sir. One hell of a good read.",
            "Holy crap, it was long but definitely worth the read!",
            "Great story! Just felt like I had to post something since I took the time to read it all :)",
            "Victor did his job well, you say victor pulling up hundreds of cars with fake stickers and this slowed down construction- that is crazy - you don’t want illegal cars not authorised / fake stickers since they shouldn’t be there - this clearly shows how the tools went missing .\n\nTo Tasha - why waste your time if you just want a fuck buddy find someone rich and why ruin an army of people( pun intended)and the girl ( partly Jim was to blame for the mess for all the nonsense he walked into basically).\n\nTo top it off the irony is that all this shadow war was against former\nVeterans!",
            "semper fi!  :)",
            "This is the most text I've read in a long time and it was more than worth it. Great story!",
            "This was the most glorious story I have ever read on Reddit.  Thank you for your service, and for the story. I'm so happy for Victor, too!",
            "You ought to write this as a full on novelization! Super entertaining and I could totally read it as a novel",
            "The best story I have EVER read on this sub!",
            "Wow! Just wow! I think I just fell a little in love with Victor!! \n\nAnd with your storytelling skills! \n\nThis story, well, pulled me out of a case of the red ass, lol. I'm not mad anymore. Thanks for that!",
            "I hope u/rslash reads this to me.",
            "for later",
            "I love a happy ending.",
            "Gold",
            "This was worth every second spent reading! You have a way with words. I would consider getting a dictaphone (archaic term used on purpose) and start telling some stories!",
            "Brilliant! I thoroughly enjoyed your well written story. As a woman, I am sorry you had to deal with the likes of Girl and Tasha. Not all of us are like that.  Glad it worked out for you guys. We appreciate your service!",
            "Best story I’ve read on reddit 10/10 and fuck tasha and fuck anyone who doesn’t respect a vet.",
            "I, too, enjoyed reading your story. I really enjoyed that you included how and what everyone else involved is doing. It’s very satisfying learning the “good” guys prevailed in the end.",
            "This has to be the best composed story I've read. Good job, and I'd like to thank you, and all of the vets in this story for your gracious service to this country.",
            "thank you for the heads up on the water break before going thru the hefty MC post.\n\ncheers, OP.",
            "Great story, once I got into the main part of the story it just pulled me in, you're a great writer. It's amazing how much havok one person can cause if they know how to. Both the girl and Victor changed so much.",
            "When is the movie?\n\nI could even see it as a grity animation too.",
            "Absolutely brilliant tale, thank you for the hard work and excellent re-telling.",
            "I was heated for a minute.  Went back to work and came back to read the other half.  Worth the read.  Got to say, shitty people get what they deserve in the end.",
            "Wow, great post. Good on ya. I loved the follow ups at the end too",
            "The best example of \"People don't quit jobs, they quit managers.\"",
            "That was a cracking read.",
            "You were my first ever award sir and it deserved the platinum, glad all is working out for you and all those friends you worked with!",
            "Wow great story Noodle013! Well written or I wouldn’t have been able to read to the end. Plus I really wanted to get to the karma part. Thanks!",
            "Fucking great story! I loved how everything came full circle. \n\nBut did anyone else read the ending like the epilogue of The Sandlot?",
            "Really cool story actually. But way too much \"don't mess with military guys\". Of course security guards that are ex military are very useful, but I feel like everytime you pushed how people shouldn't mess with veterans were situations that are completely unrelated to having served.",
            "You are a very good writer and story teller. You could prob make good money as a content writer on the side of you enjoy it.",
            "This was awesome to read and to hear on YouTube... love this and you are my very first up vote!!!",
            "It's almost like all the vets adopted the unofficial motto of military service \"Embrace the suck\"",
            "Thank you for the awesome read. Thank you for your service!",
            "I was thinking I could skip to the end, and I did, but then the comments convinced me to read it all, and I did.  Worth the time.",
            "That really was the long game huh, and the long post",
            "Took me half an hour to read but damn",
            "Girl here ! AWESOME \n\nWay to go VICTOR!\n\nLong story ...but way worth the ending. Satisfying. Thanks for writing it all out.",
            "Great writing brother",
            "What a honour and so lucky to start working at a site and ending up having a lifetime friend like Victor.",
            "Took me about 10 minutes to read but was worth it",
            "Hey! I really like the way you write. Perhaps consider to write a book about your life? That must be awesome",
            "Comment",
            "This deserves a spot on r/NuclearRevenge. As for the complaints of it being one-sided, well, knowning what you know, I think it's safe to say that this side is closer to the truth than their (Girl and Tasha's) side. I wish you, Ray, and Victor all the best in life (but I'm sure you guys already are living your best lives :D)",
            "Great read. I'm currently encountering slight anxiety at my own work because our Executive Director resigned, and they hired someone else from another location without opening the position up for anyone who is currently working at our site. It's a whole story in itself, but reading this really shows how bad things can get when management changes things up. I'm hoping this case will be different than yours, but I'm also prepared to book it if things start to go sour.\n\nAgain, great read and I wish you well in whatever life throws at you. :-)",
            "This was a very interesting read. I’m glad to see through your edits that you’re open and accepting of different takes on your story by others. I agree with some people that Jim was not really a good guy or a victim. He shouldn’t have gone along with Girl’s advances. And it does seem that your workplace may truly be not a very welcoming environment for females, esp with the employer gender ratio. But this is real life, not a story, so people can be morally grey and that’s that. And the side you, OP, take in life may not always be the one right moral side, but it doesn’t change the fact you took it. I like how this story represents the greatness of the world.\n\nI’m glad Victor eventually got better, and Tasha got retribution in an ironic way. Even though I believe Girl did have disadvantages in the workplace because of her gender and she did have reasons, I dislike when people use a political agenda to drive their personal gains. Hope you all have a better life now. Anyway, this was definitely worth the read.",
            "There is no such thing as an ex-marine.",
            "Great read, felt like reading a book. Glad I didn’t scroll past this story",
            "Great story, worth the read. Thanks for sharing.",
            "Thanks for sharing this with us. \n\nYou should hit the /r/militarystories mods, see if it could be posted there.  \n\nAs you said the story was over several years and  described how was victor just before saying jim was missing, I feared victor made him dissapear...",
            "Glad things worked out for you guys!  Too many bad supervisors/managers/Owners/Presidents/CEO's out there.....",
            "Amazing work OP pleased to read your tales. Thank you for your service too! Also for some reason may comments of praise have been downvoted hard and what more could I offer than try and alter that. Have a wonderful day OP cheers!",
            "I love long stories so your fine",
            "If anything, your post script makes it even better.  I wish you all the best and fortune in your life thank you for the story, it's one of the best MC stories I have ever read.  If you do read this comment, a simple \"K\" is all the thanks I would require.  In the words of another reddit I follow.  Well done wordsmith.",
            "Great story! Worth the read",
            "Absolutely amazing story my friend!",
            "\"Me and the wife\". Of course it had to be THE wife. Oh boomers.",
            "This was a good read. I enjoyed reading it. Thank you",
            "/r/talesfromsecurity  \n/r/militarystories  \nmight like this story as well",
            "Great story! \n\nI'd watch this movie :)",
            "This was the best story i've ever read. Yay for you, Ray and Victor! Glad y'all are doing well :)",
            "You reap what you sow. Great storytelling OP, I wish you the best.",
            "Well that was a damp fucking squib.",
            "You're a great writer :) Thanks for keeping me entertained at work!",
            "This story reminds me of the copypasta that ends:\n\n\"The students applauded and all registered Republican that day and accepted Jesus as their lord and savior. An eagle named “Small Government” flew into the room and perched atop the American Flag and shed a tear on the chalk. The pledge of allegiance was read several times, and God himself showed up and enacted a flat tax rate across the country.\"",
            "Fuck yeah, that was worth the reading time investment!",
            "So I'm guessing you and Jim aren't friends anymore",
            "Initially a little peeved you referred to “girl” as girl but soon realized she definitely is not a woman.",
            "Damn this is the juiciest story i've ever seen.",
            "As a woman, I'm ashamed to be in the same, well, biological gender as those two bitches you've encountered. And yes, I said bitches, because what they've done is just unforgivable and if I were in your shoes, I wouldn't hold back and just punch them right in the face and stomach.",
            "It’s like a TV series that’s been going on for 8 comes to an end or a player from a sports team gets traded off. I’m just glad you didn’t stop taking to Victor. He seems like a really cool guy. Glad you two are still close.",
            "Great story, thanks for sharing, even if it was 3 months ago. I wish I saw it sooner so I could’ve been more in on the conversations :)",
            "great story thanks for sharing, the ending is very rewarding to read, i personally felt joy when reading how that idiot ended up, and that everything ended in a good way for the good guys",
            "Sometimes I wonder why XL flairs keep getting so many awards. I think this is one of the actual good stories that actually deserves that many awards.",
            "This would be a great dnd canpaign. \"Tasha's Hideous Construction Site, Featuring Victor the Paladin\""
        ]
    },
    {
        "post_id": "i18m4f",
        "author": "Fiennes",
        "title": "Want me to write a short perspective of World Religions from the perspective of an Alien-race? Sure!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/i18m4f/want_me_to_write_a_short_perspective_of_world/",
        "score": 14124,
        "num_comments": 536,
        "created_utc": 1596206320.0,
        "selftext": "I am not sure that this post qualifies, as it didn't end well for me.\n\nBack when I was in high school, I used to go to a Roman Catholic school, here in the UK.  We had a rather irate RE (Religious Education) teacher.  One Friday, we were set homework to write 2-3 pages, describing world religions as if we had just discovered the planet as an alien.\n\nI set to work and wrote it out on the Friday evening...  then had a thought...  If I were writing this from the perspective of aliens, then it wouldn't be in English (foolish me).  I came up with a symbol for each letter of the alphabet, and re-wrote the entire thing with these symbols.\n\nMonday morning rolls around, and I handed it in (with a decoder, of course).\n\nI ended up in detention for 2 days.  I also understand I probably wasted that teacher's time when they just wanted to read and grade - but part of me wanted to get some kind of credit for the extra effort.\n\n&#x200B;\n\nOh well, sometimes compliance isn't all roses :)",
        "permalink": "/r/MaliciousCompliance/comments/i18m4f/want_me_to_write_a_short_perspective_of_world/",
        "comments": [
            "I wrote an essay in college about the Bauhaus, who had created their own font. I asked the professor if it would be ok to type it out in said font since it was relevant to what I was writing. They agreed. Got the paper back a couple weeks later and was docked marks and scolded a bit for using a font that was not considered academic.",
            "Some people have no sense of humor. I think you did an excellent job.",
            "Yeah I think this was pretty clever. You probably should have also submitted a \"clean\" version because nobody is going to hand-decode it, but this definitely wasn't worth a detention.",
            "I had a similar school story, but the teacher was happy about it. History teacher broke the class into two teams of \"archeologists,\" and had us create artifacts for the other team to figure out.\n\nI wrote a page long letter and then assumed that the letter C had been replaced as redundant. (\"this letter is a k in front of some vowels, and an s in front of others.\"  \"Why not just use k and s then?\") There were a few other similar changes.\n\nThen I created a paired letter Cypher, each pair of letters matched to a different pair of letters.  The other side said it was unfair since I explained what I had done and how deciphering it was literally impossible. The teacher said it was a good example of how hard translating old languages can be, and how important the Rosetta stone was.",
            "Reminds me of a post I once saw containing student homework assignments. The student was to \"...assume the role of a Chinese immigrant in 1870 and write a letter home describing your experience.\" \n\nYeah, the letter to home was handwritten in Chinese.  \n\nA+ if I were the teacher.",
            "[deleted]",
            "When I was 10 I, for some reason I can't remember, objected to a school exam so I wrote the whole thing in mirror writing. It was graded normally and the teacher didn't even mention it. \n\nIf I got a rise out of them I probably would've done it again, but with no reaction I didn't. The teacher saw right through me, one of the only good ones at that school.",
            "I did something similar in high school with the pretext I was a member of a previously uncontacted nationality. I gave her a coded copy with a decoder. \n\nTeacher gave me a B+ with comment in my language... I read through all of them and a comment near the end said. \"If you acknowledge this was annoying by Friday then I'll give you an A\". Mrs Faye could give as good as she took.",
            "A religious school teacher asked you to write about Christianity from an alien perspective? That seems like a really strange project, that lends itself more easily to critical views of religion than friendly ones",
            "Maybe you got detention for substandard fictional language practice. One to one letter conversion? Unlikely \n\nJust kidding. That is very creative and the teacher sounds like a humorless jerk.",
            "Damn, why tf are catholic teachers so angry?! The terror I experienced from the nuns at school...",
            "There are several online translators for Klingon, in case you want to do it again. \n\nThough even in English the Klingon (or even better, the Ferengi) perspective would not have been to her liking.",
            "I could understand not laughing it off if it was a big project, but 2 day detention for something that is a playful riff on the assignment is way overboard.  It could definitely come across like am attempt to \"trick\" teachers so that you can get an extension. People are constantly spreading tips of how to corrupt docs so that they can't be opened, \"accidentally\" submitting the wrong doc, etc. I imagine it'd get pretty frustrating. \n\nIf it wasnt a huge deal, I would have just asked that they give me the English version the next day. If it was a big deal assignment or if I was just real sick of this kids shit, I'd probably ask for the alphabet code and then have them decode like 2 or 3 words - if it's coming out as legible English then clearly they actually did write it, so again just print off the English copy and turn it in tomorrow.\n\nThe most interesting part of this story to me is that a roman Catholic religious studies teacher was encouraging kids to use defamiliarization  to analyze religions. You would think that a religion as with as much archaic rituals and mystical spiritualism would want to avoid kids thinking about their practices too objectively.",
            "My daughter wrote a letter to Santa Clause when she was 6 or 7. It was printed and every letter in every word alternated between red and green ink. Up here in Canada letters to Santa are addressed to the North Pole and the postal code is H0H 0H0 (I.e. Ho Ho Ho). They get intercepted by postal workers and they usually send back a nice reply.    \nThe reply that came back was half a page of printed text and every letter alternated between red and green ink.",
            "As a history teacher I think this is groovy. I would have laughed, asked for the English translation and given you something extra.\n\nI had a student who answered short/medium response questions using Comics he drew. Absolutely brilliant and I wasn’t testing for writing ability, so he really nailed it. I’ll never forget him.\n\nVery creative!",
            "[deleted]",
            "You should have given him the \"original\" alien version, *plus* a decoder, *plus* a pre-translated version. That would have saved teacher the effort of having to decode your paper to grade it... but would *also* have highlighted all the extra effort you put in (assuming he at least tried to decode a bit of the alien text to see if it was BS).\n\nStill... nice job, and you certainly didn't deserve detention.",
            "Freshman year of English in college I was asked to write a paper describing what a future archeologist with no knowledge of modern civilization would be able to learn about the 18th century if they discovered a copy of an 18th century novel. I wrote a paper on how they would be able to determine that a civilization with a written language existed, had some form of standardized paper making, and printing press. Did an entire analysis of what you could learn by finding a printed book, but no analysis of the contents because the prompt explicitly said no knowledge, which I took to include knowledge of the language. Got a zero on the paper and challenged it with the Dean, pointing out that there was no way a future civilisation could have zero knowledge if they were still able to read English because of the volume of writings in that language. I was told that I shouldn't be in college if I couldn't respect academic authority. Quit that school, went elsewhere, and now I've got a post doc. That was twenty years ago and I still use that teacher as an example of an incompetent educator and that Dean as an example of a useless bureaucrat.",
            "I thought this was going to be a story about how you ripped apart Roman Catholicism from the point of view of aliens. \n\nI was very surprised with the turn that took lol",
            "Even if you go slowly, it’d take at most 2 minutes to use find all and replace 26 characters",
            "I was expecting a story of getting thrown out of religion class for describing the Earth as a planet full of delusional psychopaths who kill each other for the sake of their imaginary friend.",
            "As a teacher, I would have given you bonus points! However - I also would have wanted a copy that had already been decided for me to grade!",
            "You should’ve gotten extra credit on top of full credit. Some people clearly hate creativity",
            "I had an English teacher that would've absolutely loved this! I messed with her once by switching the word \"the\" with \"lime\" in an essay. The essay was questioning how languages formed to make certain sounds mean specific things and what the effects could be if just two of these words switched places. She gave me an A+ for that so I can only imagine the absolute glee she would've had deciphering a new language.",
            "I think you should have been rewarded.\n\nI didn't follow the instructions so got a bad mark, but my teacher enjoyed my story that I wrote so much that she read it to the class, but then I got I think a 50% because I didn't hit the qualifications. And she made it clear WHY I wasn't getting full marks. And I agreed that I went sideways with the assignment.",
            "Man, I thought this was going to be about how you ended up offending the teacher by pointing out how violent their particular religion is/was, but this is just straight-up funny",
            "Thats unfortunate that your teacher took it so badly, I did this once with a teacher and he laughed at it and since I made the script into a font he asked for it and my next exam was written in the code",
            "I see you are the madman responsible for the symbols font in office",
            "I don't get why you got detention cause if the teacher could have been bothered to read the essay they would have seen you actually did the work and then some.\n\nBonus marks from me!",
            "I would have decoded it, read it, and given you a LOT of extra credit along with an A+. Then I would memorize it and only speak to you in that language for the rest of the year as an inside joke.",
            "What an unimaginative bitch. Teachers like that are the reason kids stop being creative. You shouldn't be made to feel bad for something you thought was a fun and creative effort",
            "My history teacher was the same. I wrote a piece on the Black Plague, roughed up the edges of the paper and then stained it to look like velum or parchment. I was proud of myself but he refused to mark it, saying “I don’t accept a child’s drawing”. \n\nI was 13 at the time. Always hated that prick.",
            "Okay, that was super creative. As a teacher I really would have appreciated it, but I would have asked for a fully translated copy to be handed in the next morning for grading.",
            "Dude got lucky to be honest.\n\nHe wouldn't have enjoyed my Alien race's analysis of Catholicism one bit. Like, the only bit of the Catholic Church that my Aliens would have approved of is the anal probing in the orphanages.",
            "How did the Catholics expect these essays to go? I mean, how many variations of:  \n\n\"We landed on this backwards planet of superstitious, hairless apes. They have a variety of god-figure legends, and frequently murder each other over slight differences in interpretation. Despite these traditional fables frequently containing morality rules, they ignore rules they don't like, and pretend claim to follow others yet often violate these rules. These primitive barbarians should be avoided until they learn logic and reason.\"  \n\ndid they get? Certainly anything like:  \n\n\"Look, these humans know Jesus too!\"  \n\nis patently ridiculous.",
            "If i ever need to do that i at least already have an alphabet\n\nBut you did an amazing job dude. Totally did not deserve that detention",
            "∆ππ×  $¢^√√$.  ^   |•   ^•°¶©$$\\×",
            "I would have given you extra-credit, asked for a decoded version to read, and then posted a picture in r/teachers of the awesome hilarity  (can we share pics there? I’ll have to look...)\n\nHowever, though the Catholic Church may think I’m Catholic, they are very, very wrong, and I would never be found teaching a religions class.",
            "Not gonna lie, if you had been in my class I would have given the extra credit for the creativity. I was a middle school English teacher, and one year I had my students each take an index card and use markers to illustrate an adjective. So, for example, they could write the word \"colorful\" and make each letter a different color, etc. \n\nI had one student turn in a blank index card (except for his name, obviously). When I asked him about it, he said his chosen adjective was \"invisible.\" I gave him full credit, but I also changed the instructions for the next year lol",
            "As a former ELA (English/Language Arts) teacher, I would have appreciated it, then asked for a translation.  As a current science teacher, I think this is great.   :)",
            "Tbh I'd have laughed it off but asked for you to also give me the already-decoded version for extra credit. Lol",
            "[Reminds me of this Calvin and Hobbes](https://www.gocomics.com/calvinandhobbes/1995/01/09/)",
            "Ugh.  That sort of thing infuriates me as someone who loves learning.\n\nAs a teacher, I would have said \"Thank you\" and then asked for the translation.  If you didn't have it handy, I would have had you miss something and write the translation.  \"Punishment\" fitting the crime while still rewarding extra effort.",
            "And that's how school kills imagination. Oh, and it's not a flaw; it's a feature.",
            "Reminds me of something a friend pulled in religious education. Also Roman Catholic school. Teacher was talking about cultural diversity in Christianity and how it often diverged in different places due to poor communication in ancient times and the very different pagan cultures that existed in places when they were being converted. Celtic Christianity was given as an example of a large divergence that could have caused one of the many failed Protestant Reformation attempts over the years, but didn't (some high church Anglicans hold that Celtic Christianity was the true light, Rome were the heretics, and the English Reformation was Cranmer pacifying Henry into splitting with the heretics to preserve the uniquely Celtic traditions of the Isles, but this is just bad history and bad theology in more ways than I can explain in a malicious compliance story). This was linked to the Irish pagans, and we were asked to write a two to four page essay describing Christianity from the perspective of the pagan Celts. \n\nThis girl wrote three pages in ogham script. Teacher accepted it and figured it would just be a matter of transliteration. Turned out it was written in Irish as well. The kid said something about period accuracy. The next year, according to a friend's younger sister, both that religious education class and the history class that teacher taught had a rule that said \"Assignments may not be turned in written in foreign script or a non English language, unless assignment specifically requests period accurate language and script.\"",
            "I thought you were going to say that you completely tore the concept of religion apart because, to an alien, it would all seem ridiculous. What you actually did is way better though. You shouldn't have been punished for that!",
            "\"Oh! You went above and beyond expectations and thought outside the box in a fun and interesting way for your homework. Detention, young man!\"",
            "You came up with a new alphabet and DIDN'T get credit?\n\nPeople pay for that these days.",
            "I think you are more creative and talented than your other classmates. I mean you are absolutely right. The teacher should know aliens don't know any earth language.",
            "Did this alien race call religions illogical?",
            "I think it was clever.  I’m sorry your teacher didn’t have the wherewithal to see it that way.",
            "I give you an A+ for your extra effort and creativity",
            "A better teacher would have rewarded the additional effort and creativity.",
            "I want both a copy of this alphabet a d a copy of your homework.",
            "your teacher should try to teach sign language to walls and stop thinking she is any good with humans.",
            "Why would somebody get punished for that instead of just being asked to do it again?",
            "Correct response: bonus points for creativity, points off either for late submission of a readable version or just for being a smart ass.",
            "Reminds me of an example that makes the rounds occasionally:  \"From the perspective of a Chinese immigrant to the United States, write a letter home describing your experiences.\"  The answer was written in Chinese.",
            "That's a very dangerous thing to ask of any thoughtful person",
            "I was once tasked with writing a paper on what the world would be like with out friction. I handed in a blank paper and got full credit",
            "That’s a great idea, and you sound like you were a really cool kid. I don’t think this was malicious, though.",
            "This is a prime example of how school kills creativity and plants the idea in children that you should never take risks.\n\nI hate this.",
            "Dude I’m a teacher and I would have given you major props.",
            "I was expecting a different direction. A scathing review of how silly we as humans must look.",
            "As a teacher, I'd applaud your efforts. And then ask for the version written in English.",
            "I love that this story doesn't have a villain like most of these stories do. It's just giving me \"dennis the menace\" vibes and it's pretty wholesome",
            "That's actually really creative and I woulda given a good grade. I once wrote a report on Anthem, from the perspective of the mains son, on a a roll of paper like a scroll. Don't remember what I got on that tho",
            "I was expecting this essay to go: foolish human beings believing in ‘supernatural deities’ they call “gods” super weird. I guess if we masqueraded as gods we could take over and enslave them. Mwahaha!!!",
            "Teacher here: After my initial WTF reaction, I probably would have laughed. Then I would have spent the next hour writing a response in your language. Anything to put off grading papers. Yuck.",
            "Dude if my kid had wrote something out like this and the teacher gave him detention, I think I'd raise holy hell about it.\n\nMy kids thinking from the perspective of an alien race.\nThey dont speak English. Why should they get DETENTION thats reserved for kids being destructive and for getting into fights?\n\nRidiculous.",
            "I'm interested to know how the actual essays were received by the teachers. \n\nPresumably an actual objective third party like an alien race would look at our various religions and think we're all fucking batshit insane, childish, easily brainwashed, delusional, and so on. They would surely conclude it makes no sense. \n\nHow would the teachers react to such an essay?",
            "If you were my student I'd have called you in to my office and congratulated you on the ingenuity... Then asked for the original essay in English that you used as the basis for the encoded version 😜",
            "I would have maliciously complied with the school's fundamentalism by writing: \"This request is a trap because the Bible never mentions aliens, therefore aliens do not exist.\"",
            "We had a teacher in high school who was rather awesome. He gave an assignment to the class for a book report, from a long list of books he had read as well. One student wrote a report out, about The Hobbit, but did it using Tolkien’s runes. Mr E (that was what everyone called him) handed him back the report, with the grammar and runes corrected. \n\nRIP Mr E. you were an awesome teacher",
            "The whole concept of that assignment is baffling. As if a space-traveling alien race would see religions as anything but a curiosity. \n\nI imagine, this coming from a religious teacher, the expectations may be to have the aliens travel nearly impossible distances with technology we could only distantly understand and then arrive only to say, \"Hey this one specific ancient myth about a clearly unscientific story is definitely a true story about the origin of the universe - I'm convinced! And remember since I'm an ALIEN this conclusion is completely unbiased by human culture.. Guess Catholicism is probably right all along lol",
            "Performs task flawlessly, and gets detention. \n\nSounds like religion to me. Job well done!",
            "My writing teachers would have given extra credit, but required I also provide the English version.",
            "Honestly I feel like this is super creative and I would have awarded you extra credit.",
            "I would've laughed, gave extra credit for creativity, and then ask for the already translated page",
            "That sounds like such a fun assignment! Honestly it's your teacher's fault. Kudos to you.\n\nIf I were your teacher, I would have given you extra credit, then been like, \"OK, but seriously, rewrite this in English. I'm not decoding this shit.\"",
            "You should have typed it all out in Word and then changed the font to Wingdings.\n\nThen when he complained you could have just changed it back to Times New Roman(s killed Jesus Christ).",
            "Sorry you received detention. That's pretty stupid of them to even give you detention. Give a \"0\" on the assignment if anything. Plus, it was homework...I am proud of you for thinking that up",
            "I once bound a report using Japanese bookbinding using red thread as our teacher were adamant that having a \"red thread\" through the text were important.\n\nEarned me a + on my A.",
            "I did something similar where they wanted us to get creative.  So I did my homework on a blank puzzle and put it in a little box and the teacher had to put it together to grade it.  Not happy",
            "Back in the day, I used to be an English teacher in a Bilingual High School in my country. (México).\n\nAs a teacher, I would have given you an A+....",
            ">I am not sure that this post qualifies, as it didn't end well for me.\n\nThis definitely qualifies my good sir. If anything, its a great example of the difference between this sub and ProRevenge.",
            "From a teacher's perspective: if it was clear that this homework was supposed to be graded, I would be annoyed as hell and could kind of understand the reaction. If this was just normal homework, I'd be utterly impressed and you'd have been my favorite student for at least a week.",
            "Shouos have handed in an already translated copy too. Probably would have went from detention to extra points for artistic flare",
            "Good idea. Probably would have went over better if you turned in an English version and the coded paper as well. Good job on creativity.",
            "Read ***\"Letters From Earth''*** by Mark Twain.",
            "Sometimes doing above and beyond the requested job just gets you shat upon.",
            "Most of the Teachers lack creativity. I did almost same and got a detention for a month with extra homework. I always Hated School",
            "That teacher does not get paid enough to decode 3 pages of a made up language. \n\nYou would have probably gotten extra credit if you had provided a copy written in English as well as what you turned in.",
            "Teachers don’t want to read and grade. I’d give the kid an A without even knowing what it said just for the ingenuity. Also they should have been more specific.",
            "Very cool. Reminds me of the report on genetic engineering that I did in calligraphy in high school. I'd gotten permission beforehand and after was asked to never do that again.\n\nTurns out it was too hard to read fast.",
            "Instant A+ from me. And your teachers were just pissed they didn't forsee your ingenuity.",
            "As a teacher, I’d have given extra points for creativity, even if it made more work for me.",
            "I had a student do this to me (I’m an 8th grade ELA teacher) when I told them they could write their final story in whatever language they wanted (many students’ first language was Spanish) and I thought it was hilarious. She did also give me a copy in English, though, so not a lot of time wasted on my end, since I just graded the English version. I’m sure I still have a copy of it somewhere.",
            "In my physics GCSE exam had a question that asked \"explain how you can see this question\" essentially just wanted \"light comes from source, hits paper, some goes in eyes\" but I left it until the end so that if I had time (which I did in the end) I could as full of an explanation as I could at 16. For the three lines they'd given in the paper for the answer ended up writing a page and a half.",
            "I would have given extra marks for that. A++",
            "I love it.\n\nMy kid once used some of the Bionicle language in an assessment and his awesome teacher wrote a coded message back!",
            "In 1st year in Ireland (8th grade I think is American equivalent?), I had an assignment to make a Ancient Roman newspaper. At least 4 pages with multiple articles on sport, housing, emperor, etc. I wrote it entirely in Latin using google translate. Got a B",
            "I was bored with a theology assignment in 9th grade Catholic school to turn in three pages on the existence of God.\n\nInstead I turned in a 20 page short story, some sort of SF about a dystopian theocracy. I got an F and an A+, averaged to a B. Fr. Ralph was usually kind of a jerk,  but he liked the story.",
            "I thought this was gonna be some edgy r/atheism thing, but that’s actually really funny and worth two days of detention.",
            "When I was in middle school, my history teacher had set up a cryptographic treasure hunt where you answer questions around the room to get the \"translation\" of certain letters around the room.\n\nI had a deep love for logic games and the such, and was absolutely not paying attention when she had passed out the handouts the day before the hunt...\n\nSo I solved it.\n\nSubstitution cyphers are actually pretty easy. You just find the one letter words- that's either an \"I\" or an \"A\". Then, find common words like \"and\", \"of\",  and \"if\". I did the paragraph in about 15 minutes- it was written for 6th graders so it's not like I was dealing with Nietzsche here.\n\nI turned it in the next day at the beginning of class and she gave me an F. This was the genesis of my \"fuck school\" attitude and I can only blame my love of logic puzzles.",
            "....I mean you put more effort than anyone I'm sure. If it were just random scribbles then I think the detention is fine, but to put that much effort in homework I'd be pretty proud.",
            "They probably wouldn't have liked what I would have to say, because every religion seems weird and crazy looking at it from the outside. It only seems sane and logical if you are a part of it without questioning it.",
            "No offence, but that would be a code for english rather than a foreign language",
            "The understanding is what makes all the difference. If you could do it all again, and hand in one copy in Alien, the decoder, and the copy in english that you wrote first, THEN you'd not cost extra time for the teacher AND have gone the extra mile.\n\nAh well, hindsight is 50/50",
            "I once had to write a paper on an alien species arriving to earth and discovered a thing.  I pulled the slip.  Sports. What the eff? How would an alien be surprised by sports? I made it out to be that sports here looked like confined battles and warfare. The screaming and cheering,  the violent tackles and throwing balls at insane speeds looking like they were trying to kill eachother",
            "I had a teacher in college that wanted an essay on an old religious belief, I chose the Norse and their system of belief. I typed on my computer in both the Elder Futhark and English, stapled them together and handed them in.\n\nTeacher took one look and started laughing, she had a daughter that was studying archaic forms of writing.",
            "Detention time? Why? It's genius! :D",
            "You could have written it in Klingon and included this web link for translation purposes.\n\n [https://tradukka.com/translate/en/tlh](https://tradukka.com/translate/en/tlh)",
            "when asked to 'answer in brief', i hope students dont start getting rid of their clothes till the brief.",
            "Dude- you totally deserved extra credit! You went above and beyond.",
            "If you included the key you should have at least got a passing grade",
            "I can't give you gold but I can give you an 'A'! great stuff!",
            "Roflmfao thx for the giggle",
            "I would have given you extra credit, and triple extra credit if you also gave me one I didn't have to decode.",
            "That seems like a really fun assignment!!! I might do that for fun",
            "I would have been so proud of you. You weren't being malicious but it was perceived that way.",
            "It's probably too late now, but Strange Planet would have been a brilliant comic to reference in the paper...",
            "I would've used wingdings, then printed it out.",
            "I had a high school teacher who said we could turn the paper in to her with whatever font we wanted. I confirmed with her “any font I use from Microsoft Word is okay?” “Yes”\n\nI come in over the weekend and turn in a paper printed completely in Wingdings. She was not amused.",
            "\"They believe what now?  Really?  But they have space travel and Nuclear weapons\".  \n\"Councillor, your opinion\".  \n\"There is really no hope Captain\"\n<sigh>.  \"Well that leaves me with no choice.  No1, arm the Planet Buster\".  \"Planet buster ready Captain\".  \"On my mark, Fire\".\n\"No1, plot a course out of here and lets see if we can find some intelligent life for once.   Engage\"",
            "Had to go to a Catholic school in Belfast, and places and around UK, they all absolutely horrible RE teachers. It wasn't until I got to secondary school that they became OK. My first secondary school had an American who was enthusiastic and actually made it fun. The second school had both a horrible woman and a woman who was bipolar with leprosy.\n\nThe only thing I learnt from RE was that Buddhism and Sikhism seem to be the most ethical and most peaceful.",
            "You needed a simple request from the teacher to give him/her a translation next class, and an A+ for creativity.",
            ">but part of me wanted to get some kind of credit for the extra effort.\n\nYou did get extra credit though - two free days! Hard to top that. Except for three free days maybe.",
            "...You are my favorite kind of student",
            "Should have wrote from a Scientologist point of view",
            "Should have wrote from a Scientologist point of view",
            "We had to write an journal like essay about living in ancient Athens or Sparta in history when I was in high school. I translated the entire thing to modern Greek (unfortunately), made ten 'stone' tablets from cardboard and wrote the entire thing in Greek. My teacher demanded a translation.",
            "What was the grade?",
            "That kind of effort would be something I would have done.. spent 4 pages on a short (1 page) story about a turkey in 4th grade.",
            "Detention? I would’ve pinned that to the wall of the classroom as an example of what I’d expect from my students. That’s above and beyond what was asked and it was even decipherable. Absolutely incredible. A++ in my gradebook",
            "I think I would have laughed given you full credit and then had a ball decoding it. But that is what fun teachers would do.",
            "My physics teacher made us write about moving from the stone age to bronze age. \n\nSomeone drew stick men pictures with a pencil they lit on fire. Got an A.",
            "This is what I would've done :') but we weren't given homework like this or very much for RE. Though we did have a particular teacher who had the misfortuity of sharing a name with a. Outkast song so it's all people would sing. More people got put in detention Iver that than not doing RE work",
            "Teachers are kinda, known, for having almost no sense of humour. \nI remember a friend telling me she had an assignment about making up a car (?) And she jokingly named the car after the teacher. The teacher laughed with her, and then sent her to the principal's office for making fun of her",
            "\"... So you think you're going to just grade my paper without putting in some effort? Guess what... \"",
            "I know at my school they had specifically in the student guidelines that all assignments must be in English",
            "This sounds like something Abed would do.",
            "I got an 6 (mark F) because I wrote a English conversation in a movie where they only talked English. Apparently the frensh teacher wanted it in frensh. \n\nSry for bad grammar I can’t remember how the language of France is written",
            "I had to do a report on Portugal in the 5th grade. It was a big project, more like writing a book on the country (we were given a format to follow - no less than 4 paragraphs on the climate, each being no less than 5 sentences. 8 paragraphs on culture, 4 paragraphs on food, etc), and we were given a month or so to do it. I finished about 2 weeks early so I translated it word-for-word with an English-Portuguese dictionary and divided each page into two columns - one in English, one in my badly translated grammarless Portuguese. The whole thing wound up being something like 90 pages long, double sided in size 12 Times New Roman, per the school guidelines. I did not get extra marks, per se, but I did get a 100 out of a teacher who never gives those out.",
            "I discovered I could easily write longhand backwards (I'm left handed) and once wrote the answers to a punitive pop-quiz all backwards in mirror writing.  Don't recall getting graded down for it.",
            "A+ 110% Nice out of the box thinking!",
            "I would have included both versions but hindsight is 20/20",
            "I honestly would have given you extra credit dude.  Well done.",
            "Man you went the extra mile with the decoder. “they just want to read and grade” type of minimally motivated teachers are big part of why we are where we are today (at least in the US). Of course the funding and therefore the low salaries offered is more at the root but I digress.\n\nOut of curiosity, what were some of the alien observations that you wrote?",
            "This reminds me of the time a few years back, when I was teaching 6th grade. We had 1:1 tablets, so we did a lot using them. One little stinker wrote a chapter summary using only emojis. I found it humorous, and didn't punish him. I did, however, make him rewrite it. One of the skills we were working on was correct sentence structure, something you can't really do with emojis.",
            "One of my friends did this for his Latin final freshman year. He wrote the entire thing in Latin when the teacher wanted English. He failed.",
            "This story reminds me of the I am groot kid",
            "Alphabet, now!",
            "I was expecting that you were Mary Doria Russell and you produced \"The Sparrow\" for your project.\n\nFrom the blurb: \"The Sparrow, an astonishing literary debut, takes you on a journey to a distant planet and to the center of the human soul. It is the story of a charismatic Jesuit priest and linguist, Emilio Sandoz, who leads a twenty-first-century scientific mission to a newly discovered extraterrestrial culture. Sandoz and his companions are prepared to endure isolation, hardship and death, but nothing can prepare them for the civilization they encounter, or for the tragic misunderstanding that brings the mission to a catastrophic end. Once considered a living saint, Sandoz returns alone to Earth physically and spiritually maimed, the mission's sole survivor - only to be accused of heinous crimes and blamed for the mission's failure.\"",
            "What a humorless teacher. I would have loved the idea, though I’d still ask you to decode it for me.",
            "I feel like I would have just spent a page describing angels from biblical texts as aliens then a book report from Mark Twain’s Letters from the Earth. I mean he did all this leg work already. And honestly I doubt a catholic teacher cares about Hinduism or Islam.",
            "if you handed that to me, I'd applaud the creativity, and then tell you to hand me an English version by the end of the day",
            "Eh... use *Ziltoid the Omniscient* as musical background...!",
            "If I were you, I would have written it twice.  The second time would be in plain English with a note at the beginning explaining that it was translated for the benefit of human readers, perhaps making that note a foreword that explains WHY it is being shared with humans.  Something along the lines of, \"I find the concept of religion to be a curious one, both terrifying and fascinating at the same time.  To summarize what I will expound upon in the essay proper, religion seems to me almost like an abstract form of viral organism, a sort of computer virus which behaves like an organic virus.  Thus, I hope that this piece adequately and accurately explains my views and causes you to think about those views and your own very carefully.\n\n\"The people of Earth know of the existence of my people, and we hope that our interactions with you will help your species advance peacefully onto the interstellar stage.  Ideas must be critically examined always, constantly tested against hard reality, and set aside to be remembered as errors when they fail that test.  I hope you find this piece thought-provoking and enlightening, or entertaining if nothing else.\"\n\nIf you had, the teacher would've used the English-translated one for the grade, but you would've gotten bonus points for the alien original.\n\nEDIT: Formatting and extra thoughts.",
            "When I was in secondary school in the states, my history teacher gave a small speech about how he didn’t accept late papers and he didn’t care if the printer printed the paper in Russian we were to hand it in. So, I did just that, printed the paper in Russian. He gave me a B, said the writing was unclear. (He did let me hand in an English version as well and it made my day that he was a good sport about it.)",
            "I would have laughed and laughed and not bothered to decode it all. Just enough to know the amount of effort. Then Just given you and A.",
            "Really? Detention for being creative? Fuck that. You should kept a plain copy and turned that in too,",
            "But most aliens on TV and movies read and write in English.",
            "> (with a decoder, of course)\n\nShe didn't even have to do frequency analysis to crack it and she's still complaining. Dude, I sure would not want to do a room escape with that lady.",
            "Your teacher was a grump. I would have given you extra marks for creativity and then asked for the translation so I could properly grade you.",
            "I was supposed to write notes for my ap wh class and the teacher said do whatever makes you comfortable in taking notes. I had found out he grades notes based on how he like his notes, so I did what made me comfortable... writing in my mother language-- Romanian. This of course pissed him off bc now he couldn't read what I wrote to grade it based on his criteria and gave ma an automatic a on the assignment, but he did ostracize me in front of the class and yelled at me for bbeing different and stubborn. After one A, he got rid of the assignment.",
            "This was pure genius",
            "Screw that. If I was teaching the course, I’d be rewarding OP’s creativity and out-of-the-box thinking, though I’d ask for a translated copy, rather than decoding it (I’ve got other papers to read man). Then again, some religions don’t really reward alternative views.",
            "Did you hand in an already decoded version too?",
            "I would have used the standard galactic alphabet, like any normal Alien. But A for effort. :-)\n\n[http://www.shikadi.net/keenwiki/Standard\\_Galactic\\_Alphabet](http://www.shikadi.net/keenwiki/Standard_Galactic_Alphabet)",
            "That's awesome! It's a shame you were punished for it. It's understandable, though.",
            "Lol, I thought this was going to go somewhere else but this was pretty creative too.",
            "Catholic school = no sense of humor, sorry OP.  Sounds cool to me.",
            "A Catholic RE teacher that even implies aliens might exist is something new for me tho",
            "Define: cult\n\na relatively small group of people having religious beliefs or practices regarded by others as strange or sinister\n\nDefine: religion\n\nA successful cult.",
            "Technically you were the only one who did the assignment properly. You're right, what are the chances that the aliens speak English or any language thaw t sounds like it or is written like it? I enjoyed the story even though it wasn't a happy ending for you.",
            "Catholic school...there's your problem.",
            "Complain to the head/dean/principal. That's the sort of r/maliciouscompliance that should get better grades",
            "You should’ve provided a translated copy and I think you know this. I wouldn’t have marked your work as-is.",
            "That's just the result of a grumpy/lazy teacher.  You did good work and exposed a loophole in the assignment.  You'd be a jerk if you didn't include a key, but you did.  That's an A+ in my book",
            "This is really clever, OP! You get an A from me :)",
            "Very clever!",
            "Mate that's BLOODY fucking funny forget that teacher for not having a lick of humor in his soul",
            "Sounds like extra credit to me.",
            "Will you post the paper?",
            "Can you please show it to us?",
            "Imagine forcing a teacher to spent the time on an essay that they would’ve been able to do 30 in. They just wanted to give an assignment, there was no malicious intent there at all. You just decided that out of ALL of the essays you had to make yours a pain in their ass. Teachers don’t live in the school and only grade papers, you deserved that punishment for making their life harder for the fun of it.",
            "a tl;dr of religion goes: greek philosophers were taught everything they knew from the Egyptian mystery schools and then perverted the knowledge so that a select few knew it's true meanings to control the masses.",
            "Awesomeness!!!",
            "If id be that teacher id applaud your creativity\n\nBut then religiots do not like the meat to be creative",
            "You didn't just use Futurama Alienese?",
            "wtf is everyone commenting here fucking 13 too? This isn’t “performing the work flawlessly” or something worth extra credit, it’s a 13 year old being a pain in the ass for no reason. If they had submitted it with the proper copy as well it’d be fine but the teacher having to ask to actually be able to read the work is stupid. Makes sense for a 13 year old to do, but was clearly not done just to be creative"
        ]
    },
    {
        "post_id": "aexco2",
        "author": "PeachyKeen413",
        "title": "Not allowed to leave my desk? I'll ruin everyones day",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/aexco2/not_allowed_to_leave_my_desk_ill_ruin_everyones/",
        "score": 14117,
        "num_comments": 758,
        "created_utc": 1547225951.0,
        "selftext": "I was a weird kid who HATED telling people I was sick. \nIn elementary we were having a movie day and nothing would stop me from going. I threw up before school and told no one so I wasn't forced to stay home. During the movie I kept feeling sick So I would ask the teacher if I could go to the bathroom, right next to our class, throw up and then return to the movie. I did this about 3 times before the teacher decided I wasn't allowed to go to the bathroom. Next time I was nauseous I went to the teacher and said I was sick and needed to go to the bathroom. She didnt believe me (obviously) and I then stood by the garbage. She was having none of that told me to sit down and not get up again. I tried to hold it in but I threw up all over my desk. And wouldnt you know we had some sympathy pukers there. \n\nEdited for spelling",
        "permalink": "/r/MaliciousCompliance/comments/aexco2/not_allowed_to_leave_my_desk_ill_ruin_everyones/",
        "comments": [
            "In elementary school I was in computer class and felt like I was going to be sick. I tried to get my teacher’s attention but she ignored me. I went up to her to ask to go to the nurse and she told me to sit down and wait my turn. So I did. She went to literally every single other student in class... she was a spiteful bitch.  \nShe finally gets to me, I open my mouth to speak and immediately have to run to the sink (the computer classroom was a repurposed art room). Puked my whole life out and was sent to the nurse. \n\n\nAnother time in middle school, I went to the nurse cause I was feeling sick. She sent me back to class even though I basically told her I felt like death warmed over. I go the whole day feeling the sickest I’ve ever felt, and go back to her office at the end of the day because I could not handle the hour-ish walk home. The nurse tells me to leave and I burst into tears. She finally takes my temperature and tells me to lie down. Called my mom.... had the flu and was out of school for 2 weeks. ",
            "I had a similar experience in middle school. I went to the bathroom and threw up but when I went to ask if I could go to the nurse/call home I was told the policy is that someone has to witness it for you to go home. So when I had to do it again about 10 minutes later I made sure to do it in the classroom instead of the bathroom. ",
            "I have a similar story but I had told everybody I was sick, mom sent me to school anyway. Mean old 4th grade teacher wouldn't let me go to the nurse, wouldn't let me go to the bathroom, get in line to go to assembly. In the hallway outside the gym I barfed all the way across the hall...",
            "[deleted]",
            "I got sick on a school trip to the Netherlands, and threw up in Anne franks house, and I remember the teacher had very valiantly offered her lunch bag , with the lunch inside, for me to throw up in, still ended throwing up on both our shoes tho. She was very kind about it but i remember her saying \" just once ..  i want to get through this house \"\n\nApparently in every europe trip to the Netherlands, this teacher has had to leave the tour early because of students being ill for whatever reason. shes never had the full tour, rip",
            "Similar thing happened to me when I was in first or second grade.  I remember I told my teacher I wasn’t feeling well, and she told me to lay my head down on my desk.  Not 5 minutes later my textbook, desk, floor, etc was covered in the scrambled eggs I had for breakfast that morning.\n\nShe never doubted me saying I wasn’t feeling well again, though.",
            "In third grade I told a teacher I needed to go to the bathroom. She said she was speaking and it could wait.\n\nA minute or two later I raised my hand and she said \"you are not going to try to interrupt me again\" I told her \"I can't wait\" she said \"well then you can go right there in your seat\"\n\nSo I stood up, pushed the chair back, unzipped and went in the seat.\n\nI got sent home and yelled at but it was entirely worth it. She was a lot more accommodating of students toilet needs after that. ",
            "Slightly different story but in kindergarten the teacher wouldn't let me go to bathroom when I really really had to poo. So I waited and waited for the other kid to come back so I could have my turn and release the brown barrage that was building. After many requests to go I was still refused. So out of protest I just let rip and shat myself. My mum was the manager of the only daycare in town so she was fairly well-known, she did not appreciate  the entire parent community knowing I had violently shat my pants during class in a fit of defiance.",
            "I had a nurse who didn't believe i was sick sent me back to class i puked over half of the room. Her husband was the janitor i felt sorry for him.",
            "So I used to work in a restaurant, and most restaurants won't let you call in sick. You can try but the manager will just ask you \"who's covering your shift?\" Nobody is going to cover a waiter shift on a few hours notice. \n\nI get sick one day and I'm forced to go in. I show up and try to tell the manager I'm sick, but she just says \"well you should've gotten your shift covered. Go stand in your section.\"\n\nSo I stand in my section and start to get nauseous. Instead of going to the bathroom, I just throw up in the middle of the restaurant floor for everyone to see, staff and customers. Got sent home.",
            "I told my mom I was sick before mass but she didn't believe me. I threw up in all over the pew in front of me. She believed me then.",
            "Oh man, I got sick one day in elementary school a bit after lunch. We were coming back to the classroom after some activity, maybe library? Anyways, my classroom (3rd grade) had two bean bags that were “reserved” for two people each week, the weekly class leader and the person next in line for class leader (rotated alphabetically on a weekly basis, they basically ran errands for the teacher). We had a substitute that day who was very hard nosed and strict. I started to feel very sick and nauseous as we were walking down the hallway into the classroom and I honestly was about to collapse as we entered the classroom. My desk was on the other side of the room but the bean bags were right inside of the door. I fell over into one holding my stomach and probably looking like death. This sub started bitching me out (I was 8 years old) demanding I get out of the bean bag and sit in my desk. I told her multiple times I felt like I was going to throw up, but she ignored me and acted like I was faking, just yelling louder at me to get up and go to my desk. I finally responded by beginning to puke all over the floor. Luckily for the sub, there was a trash can nearby that one of my classmates grabbed for me. \n\nVindication was sweet, but it left a nasty taste in my mouth. ",
            "“Sympathy pukers” ",
            "In first grade, I felt like I was gonna puke. My teacher was helping another student that moment. I walked over to her and waited quietly for her to acknowledge me so I could tell her what was wrong. She told me I had to wait my turn and to go sit down. I tried again a few minutes later and she got visibly agitated with me and again told me to sit down. So I went back to my desk again and puked all over the floor. She turned white as a sheet when she saw this. I hope she learned to ask a child if they’re having an emergency when they interrupt her. ",
            ">sympathy pukers\n\nWay to downplay the puking domino effect (picturing the infamous scene in Monty Python's Meaning of Life).",
            "I had braces as a child, very strong gag reflex. Tech didn’t believe me when she was moulding my teeth that the paste was going to make me sick, long story short vom all over myself, the floor the chair and a little on her hands/arms as she drew them away in terror as my wretching began\nMight post a decent write up for this sub cheers for inspo",
            "My parents had this old Bonneville car when I was a kid.  I have two younger sisters.  This Bonneville was about the size of the state of Maryland and had a rear facing third seat.  I was known to get car sick when riding backwards. \n\nWe had extended family visiting us and we were heading out to dinner.  Someone had the bright idea to take the Bonneville to dinner rather than separate cars.  It is so big, everyone can fit!  My sisters and I were unceremoniously dumped into the back seat. \n\nAbout 10 minutes into the ride, I was very nauseated.  Every time I tried to say anything, I got hushed (I was about 6 years old) and told I was fine. The rumbling in my tumbling had other ideas.  I suddenly turned into a disgusting version of a fountain and spewed everywhere.  One of my sisters (about 4 at the time) is a sympathetic puker even to this day.  She followed suit.  \n\nFinally the adults realized what was going on.  I then discovered how many family members are sympathetic pukers.  I think my dad had to steam clean all the interior floors.  I TOLD you I was feeling sick, Dad!",
            "I told my second grade teacher that I was sick & she didn't believe me and wouldn't let me go to the nurse's office. On the playground, I threw up all over the place, and nearly passed out. She got mad at me for not telling her I was sick. I wish I had known the word \"bullshit\" back then so I could've told her off. ",
            "When I was in second grade I got sick during a spelling test and threw up on the test. My teacher gave me a 100 on it ",
            "Teacher wouldn’t let me leave and I barfed hot vegetable soup all over the student back in front of me. It was lunch time and we got free milk and canned soup to eat with our sandwiches from home. Popular for day!",
            "This. \nThis is just one of many reasons I don't restrict visits to the bathroom in my classroom. I genuinely can't understand the teachers who think this is a good idea. ",
            "My daughter had a similar experience. She wasn’t feeling well and asked her teacher to go to the bathroom. Teacher said no and my daughter sat down. Daughter got up and asked the teacher agin to go to the bathroom and was told no again. This time she vomited on the teacher’s shoes. The bonus is that the teacher got the flu too and was out for a long time because of it. The teacher wasn’t a very nice person. ",
            "When I was in 4th grade I felt nauseous\n I raised my hand, to ask to go to the bathroom, but was ignored for a while. I then got up and walked toward the teacher to tell her I felt ill and needed to go to the restroom immediately. Then I threw up on the teacher and fainted in front of all of my peers. \n\nAnother time, in kindergarten or 1st grade, I told the teacher I felt sick. She wouldn't let me go to the bathroom. I threw up some mucous and I got yelled at for \"spitting on my desk\" and made to clean it up. I told my mom about it and she ripped that teacher a new asshole. She had my back when it counted, especially when I was really young. ",
            "One time in class years ago. I want to say 4th grade it was 20 minutes before school was out and I had to pee so bad! I told my teacher. And she insisted that I could wait the 20 minutes. Well turns out I had made the 20 minutes but not the extra minutes to get to the bathroom.. I completely peed all over my chair and myself with like 3 girls around who all ended up going too highschool with me.. and still know me..",
            "When I was in 2nd grade I went to school feeling normal. Ended up feeling queasy about halfway through the day. The substitute teacher knew my family from church and told me to just use the bathroom instead of going to the nurse. \n\nNothing happened. Still felt terrible. \n\nI sat back down at my desk which was set up in a block with 3 other students and immediately vomited across the desk into the lap of the poor boy sitting across from me. (Into high school I still hadn’t lived this down). \n\nAfter a few days of sickness and an ER trip we found out my appendix had burst and I had emergency surgery. ",
            "Similar experience in 3rd grade. My mom wouldn't let me stay home, wouldn't believe I was sick and went to lengths to tell my teacher not to believe me either. I almost threw up as the class was walking into art and the substitute let me go to the nurse. I told the nurse my teacher would be mad if I wasn't back soon but let me fall asleep for over an hour. When I woke up I was so panicked and quickly got back to class. At this point the class was at library. I decided to walk right into class and explain to my teacher. She yelled at me so much that she had me in tears. Of course I turn around to go to my desk and the whole class is watching, waiting to come back into the classroom from library. Humiliated, I sat down. Later, while making crafts, we stood in line at the teachers desk to have her hot glue something together (since we couldn't use a hot glue gun). I'm finally at the front and all of a sudden, can't hold it in. I can't get to the trash can fast enough and threw up on my teacher's shoes.\nAs she walked me to the nurse she mumbles, \"well I guess you weren't lying.\"\n\nKarma Ms. Scales, and yes I still hate you.!",
            "I got accused for pissing on the water bubblers. It wasn't me. So I was upset at being blamed for it. I was told to sit in the corner. The lunch bell rang and everyone went off to have lunch. Including the teacher.\n\n  \n\n\nDuring the break I just sat there. Until I actually had to pee. I was busting and decided I would pee all over the toys near the corner. I didn't play with them anyway. In hindsight, I should have peed all over the teachers desk.\n\n  \n\n\nHowever, when she returned to class, unlocking the door. She asked me how I got in? I told her I was never let out. You told me to stay in the corner until you let me go.\n\n  \n\n\nShe didn't believe me. I then got sent to the principal's office and suspended from school.\n\n  \n\n\nI was asked to be picked up by my mother, who was mad at me after they told her all the things I did wrong (allegedly). I got a beating when I got home.\n\n  \n\n\nI spent the rest of my life pretty much never trusting anyone and mostly flying under the radar purely to avoid any liars and conflicts.\n\n  \n\n\nIt served me well. But, fuck that teacher. She was an arsehole.",
            "I was a shy girl and in 2nd grade.  After already leaving class to pee  2 or 3 times, I had to go again.  Raised my hand, teacher said no.  I held it as long as I could, then peed my pants I just put my head down on my desk and cried.  I waited until everyone left so I was the last kid to leave.  When I got home and my mom found out, she took me to a doctor and I had some kind of infection or something and I ended up having to have surgery because of it.  I know my mom called the school or the teacher, but of course once I came back to school I was cured so no revenge.",
            "In 1st grade we were watching some movie about dinosaurs, (we weren’t even learning about them) and I kept saying to my teacher “I need to throw up, let me get up I have to throw up!” And she wouldn’t let me get up. So when the movie was over I ran to the trash can and a girl from my class walked in front of me, and I threw up all sliver her. Still friends to this day btw.",
            "Gotta admire that perseverance.",
            "I once threw up on my teacher because she wasn't letting me go to the bathroom. She doesn't talk to me when I visit her anymore",
            "My sister had asthma. In third grade her PE teacher decided he knew more than everybody and she needed to participate, regardless of the note from the doctor, my parents, and the school nurse. A few minutes on, she predictably threw up all over the gym. He got ripped a new one by the nurse and my parents. If I remember correctly, the principal made him clean it up himself.",
            "I lost my last tooth, (that I didn’t get pulled in college,) in my senior year of high school. I raised my hand and said I needed to go to the nurse because I lost my tooth. My CalcCD teacher rolled his eyes and said “Oh let’s see your tooth, then!” \n\nSpit blood and a tooth all over the damn desk.",
            "My 4th grade teacher was an asshole. She would throw chalk around, pull out her hair, yell at us, etc. One day we were lined up to go to the gym. Like most days we weren't doing something perfectly, which caused a delay. While we were waiting for what seemed like an eternity, one kid goes up to her (to the front of the line at the door) and tells her he doesn't feel well. Now, this kid had trouble hearing and speaking, but he tried his best. All the kids had grown up around him and could understand him. She couldn't understand him at first, and he kept holding his stomach and telling her he didn't feel well. Finally, she yells at him \"Go to the bathroom!\" and, well, either he couldn't make it or he took her words literally. Liquid poo shot out of his shorts, then he proceeded to run down the hall in a panic to the bathroom. That's when she decided it was a good idea to let us leave the classroom for the gym as the overwhelming smell of shit filled the air. He shit in the middle of the doorway, so we had to tip toe around the puddle and walk carefully down the hall to avoid the poo drops. I still feel bad for that kid because he had enough troubles without being known as the kid who shit everywhere. She was a terrible teacher who didn't give shit... ",
            "I remember one time I was waiting for class to start in the 6th grade and I started feeling nauseous, so I told my teacher. That year I was getting all c's and b's so I didn't have any kind of extra trust that usually came from extraordinary grades at my school, so she didn't believe me and just said I should've gone before class. So I threw up in my mouth and swallowed it because I was disgusting lil sack of poop at the time. I got nauseous again later on in class so I went up to tell my teacher again while she was lecturing. She didn't like this and told me to sit down.  Then, as I was explaining that I really wasn't feeling good I projectile vomited onto my teacher. I dont really like confrontation so I never told the whole story to anyone, and my teacher didn't get fired or suffer any consequences outside of other students making fun of her. She sent me to the nurses office and I went home after throwing up again, this time in the office sink.",
            "Similar story, in 6th grade my best friend and I had a terrible teacher. We had those school breakfast French toast sticks that morning and 30 minutes into class my best friend gets real pale. She asked the teacher if she could go to the bathroom, he said no. And then no again, until finally she was grabbing her stomach and puking all over the table we were sitting at. Thank you Mr. L, I will never enjoy french toast sticks ever again. ",
            "I LOVED telling people I was sick. Especially my parents. Especially when it got me out of school. Especially when I wasn't sick.",
            "If you are working now, I do hope you stay home from work when you have something that might be communicable!\n\nLOL at \"sympathy pukers\"!",
            "I was regularly sick as a child because of various conditions that went undiagnosed thanks to medical neglect of my parents. Anyways. I told my family I was sick and needed to stay home. They made me go anyway. My choir class ended up piling coats on top of me while i played on the floor in the back of class. I finally convinced my dad to take me home as i was a teen but not quite old enough to drive. Riiiight as i walked through the front door BLEGHFHGH all over the floor. My dad has never been good with medical stuff but he muster up a joke saying \"i guess you really were sick. No kidding. Now clean up my puke.",
            "I get sick, you get sick, we all fall down?",
            "[Lest we forget](https://www.youtube.com/watch?v=zK0JaEde4VI)",
            "I had a horrible fucking second grade teacher and one day I was feeling super sick. I kept telling her but she refused to let me go to the nurse and at the end of the day I ended up puking in the middle of class and again on some kids shoes. She decided it was close enough to the end of the day that I should just wait it out and ride the bus home and didn’t call my parents. ",
            "People that don't stay home sick are the fucking worst.\n\nThey bring their sickness to the school, then get all the other kids sick... And now the parent with limited sick days gets to use up their time nursing sick kids before becoming sick themself.\n\nSame goes for people that come to work sick.  You aren't impressing anybody.",
            "I was a sick kid growing up but I didnt like telling people when I was sick unless I knew it was gonna be an extra bad day. In 5th grade i had started getting very bad reactions from my ADHD(ADD) medication to the point my body literally forced it out of me. Most of the time it was a dry heave but one time as soon as i got to school and we lined up for morning extracurricular class i tried to tell her i was gonna be sick, she just told me i was fine and to get back in line. I walk about two steps and threw up a good bit but swallowed it so i wouldn't get yelled at. Another two steps and I couldnt hold it all so I ran to the trash can and spat it all out. It was mostly water and the medication so the teacher thought I just faked it with spit. She didnt think in was faking after she got her nice leather shoes covered in a wonderful layer of bile and Vivance.",
            "If only you had of projectile vommited on the teacher as you were saying but I'm about to ARRGGGUHHJHHHYJGJRHR.\n\n\n\n\n",
            "Two stories related:\n\nWhen I had turned 9 I just started the 4th grade. Precious I had a fantastic teacher who had the respect of his students so he didn’t need to worry about trivial things like approving bathroom breaks. So long as you didn’t interrupt his class or take to frequent he didn’t care. Well this new teacher was terrible and also afraid of losing power so she understood a bathroom break to be ditching class and avoiding her. One day I got the shits from breakfast. I had gone to the bathroom 3 times by 10 am. Well she felt it was too much so said i was not allowed to go again until after lunch. 20 minutes later I feel my tummy rumbling so I just go to quietly excuse myself during independent reading, avoiding asking permission because of what i was just told, and on the way it she screams, runs across the bathroom, grabs my arm and literally throws me back into the classroom; landing into a chair. She screams that I was told no more breaks an hour ago and i was to sit and wait. Well i friend waiting more but 5 minutes later I knew it was a losing battle I walk over to the can, from trow and coat the inside of her desk can. She took me to the principal for disciplinary actions immediately and when my mother heard what happened she blew more shit than I did. Oddly enough that teacher did not return from term break.\n\nOther story was much further along. 16 years old and just starting junior year in secondary school. Had a bitch of an algebra prof who allowed no leaving the classroom during her hour and a half. She actually had the knob flipped so that the key was on the inside and she would lock us in during class. Well I had bad fish at lunch that day so my stomach was, again, turning in place. I knew i was about to erupt just not good timing as to when. I asked to go to the bathroom as not to cause an incident. No go. Then I asked to go see the nurse. This is to be allowed at any time, for any reason, without question. Again, nada. Lastly i say simply I want to take the trash can back next to my desk. She said she would not allow any sort of interruption to upset her class. Now for reference, I sit just next to her desk so I could reach out and touch her if she was seated at it. She finished up lecture and we start reading when I feel Ole Faithful start a knocking. I choke it down long enough for her to get back to her desk and sit down. Now this lady is the epitome of fat. She was wider than she was deep or tall. I’m talking easily 70% body fat. She more or less pivoted foot to foot because she could no longer move her legs so this was holding it down for a while. But as soon as her ass hit that seat I turn and spray her up and down. I’m talking firehose all over her face and front. When I finish, I ask if I am now allowed to leave the classroom for the nurse. I never returned. Next day i was told I was transferred to a different prof. ",
            "Please don't do this as an adult. \nNo one else wants your sickness. ",
            "Anyone else change to, \"Oh God, I can't get sick now! My grades can't handle a sick day!\" ? I transitioned into that phase in highschool. 1 sick day = some math equation that would DEFINITELY be the one on the test.",
            "When I was in 4th grade, I had chicken pox, I didn't know. I went to school, and my gran packed some oily foods in, because she didn't know I was sick. If you didn't know some oily food can make you throw-up if you are really sick.\n\nAnyways, I was in math class, and the teacher was horrible, and didn't want you to go to the bathroom etc. Me being me, don't talk to teachers like this, and in general don't easily tell people that I am ill. \n\nSo, one moment I am feeling ill, and the next moment I threw up on my desk, book and floor... yes it was gross, duh\n\nThe teacher got mad at me for not telling her I was sick, and for throwing up on my book.\n\nLike, lady, I didn't know I was gonna throw up, I was 11, I just thought I was tired or something.\n\n(This is not the only incident with this woman, but the other story is just to embarrassing x_x)",
            "Back in grade 3 or 4, during a math class, I could feel a big fart coming on. So I asked my teacher if I could go to the bathroom, because I could feel I wouldnt be able to let it out silently. She denied my request, so I did my best to hold it in. \n\nBut then I had to get up and point to something and the little amount of strain was enough to push out a little toot. My teacher then got very angry and said how disguisting it was to just fart on purpose in the middle of class and ejected me from the rest of the class. \n\n Bitch, it was not fucking on purpose and I tried to find a solution we could both be happy about.",
            "I did a similar thing. Some kids were playing in the bathroom and when they came back the teacher yelled at all of us and said no one could go to the bathroom. Only....I had to pee. Bad. I pissed myself in my chair and that bitch wouldn't let me call my mom",
            "I hate people that go out in public when sick. Some even brag about it. I had one coworker saying he was fine working with temperatures up to 101.5. Well fuck you dude, you just got everyone sick.\n\nThe worst was at a job where they pooled sick and vacation days.",
            "just a shame she didn't have to clean it up",
            "Kids like you are the reason everyone gets sick",
            "[deleted]",
            "Never got sick in school. But I did get sick on the job. Felt ok when my shift started but got sick after lunch. Told my boss but he said I couldn't leave cause there was no one else to cover the shift for the evening, cool.jpg. \n\nSo I'm in the back doing something, holding back the vomit the best I can. After fighting it for about 30 minutes, I can't hold it back any longer and walk towards the trash can to puke. This was one of those vomits that was like a fire hose at full blast. Almost like it is lifting you off the ground. Just as the liquid exits my mouth, my manager walks into the back room to see me puking. \n\nHe just turned around and left and came back a few minutes later. I was sitting on the floor with a smaller trash can sweating and drooling cause I still felt like puking. He said as soon as I felt up to it, I could leave for the day. \n\nI didn't puke after that point but I took that trash can with me when I left just in case cause I didn't want to puke in my car. I cleaned it out and brought it back. Said manager took my word seriously after that when I told him I didn't feel well.",
            "I was in kindergarten and told a teacher I had to use the bathroom. She told me to hold it until after our test. I then peed on myself.\nI don't know what they expected.\n\nAlso in the second grade on the way to recess the classes were being too loud. So one of the teachers decided everyone would wait in lines and had to stay quiet for a full minute before we could have recess. I told another teacher I had to pee and they told me to just wait. What a surprise I peed my pants. The teacher was like \"Why did you do that?\" I mean I told them I had to pee and I meant it.",
            "Same thing. I was 15, got drunk the night before, asked if I could go to the bathroom and was told no. Sat there at the back of the Class feeling like I was gonna die, then couldn't hold it back no more, threw up under the table, the bell goes and everyone gets up and tbh I don't think most of the class notice, I tell the teacher I've been sick and leave to go to the next class. ",
            "I had a similar experience in 7th grade. We were in history class and were planning on heading over to the 8th grade wing to look at the projects they had been working on for a while (groups acted out and explained scenes from different time periods). I told my teacher before we left that my stomach hurt, and she brushed it off as me just trying to get out of class (granted I had missed a lot of school that year, but that was mostly due to an issue that made me go in and out of hospital often, and she knew that I was in hospital when I was gone). Well she didn't let me go to the nurse, and so I went along with the rest of the class to watch the 8th graders' history projects. I was able to watch a couple before I started feeling kind of dizzy and somehow made it to the middle of the big room that they were in. Before I knew it I was on the floor puking onto the carpet. My teacher saw after a moment and brought a trash can over, while another teacher who's class was in the room at the same time ran to go get the nurse. I ended up being gone for about a week and a half after, before I was finally able to go back to class.",
            "\"Sympathy pukers\" thats gold right there.",
            "Oof, I have acid reflux and I was really sick on the first day of year 6 and had to keep on throwing up. The teaching assistant said no when I went to her table (she was doing loads of paperwork) and when I ran to the bin she said to come back here and let me talk to you. I then proceeded to throw up on her paperwork.",
            "Just one of the many reasons I don't stop my students from using the bathroom if they want. The risks are just too high if it is an actual need. ",
            "One time, I mixed a pot of fake puke at home and then I went to this movie theater, hid the puke in my jacket, climbed up to the balcony and then, t-t-then, I made a noise like this: hua-hua-hua-huaaaaaaa – and then I dumped it over the side, all over the people in the audience. And then, this was horrible, all the people started getting sick and throwing up all over each other. I never felt so bad in my entire life.",
            "I mean, this is kind of on you for not giving her information. Her decision made pretty good sense based on what you told her.",
            "Sounds like one of my kindergarten adventures ™ \nWhere some kid barfed and everyone else but me barfed lol",
            "Seriously, if I’d ever been considering going into teaching, you all just fucking cured me of it.",
            "Kevin?",
            "The puker brotherhood, always underestimated, always here for you.",
            "I did this in second grade after recess because I was on the merry-go-round. I got to prove her wrong and go home early.",
            "[deleted]",
            "When your friends hurl for u",
            "Similar thing happened to me except I had an overreactive bladder and the teacher wouldn’t let me go to the restroom so I peed my pants, the chair i was sitting on and all over the floor. Take that!!! ",
            "Sympathy pukers...lol\n\nBtw what was the movie?  Stand By Me?",
            "https://www.youtube.com/watch?v=zK0JaEde4VI",
            "Jeez that was almost one long run on sentence ",
            "You're an asshole though, because staying home is just as much about avoiding spreading it as it is about you getting better.\n\nTeacher had every right to assume you were doing weird shit if you don't tell them why your bathroom habits suddenly become so weird.",
            "That's not as much as malicious compliance as karma either way 👌🏼",
            "This belongs in r/kidsarefuckingstupid",
            "Ji8i7uju",
            "Honestly, this doesnt sound like malicious compliance to me. It just sounds like you being an asshole who should have stayed home when you were sick. "
        ]
    },
    {
        "post_id": "k8lqcy",
        "author": "ExcelCrazy",
        "title": "Corrupt manager wants me to reject crucial supplies - I do as instructed",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k8lqcy/corrupt_manager_wants_me_to_reject_crucial/",
        "score": 14123,
        "num_comments": 339,
        "created_utc": 1607364138.0,
        "selftext": "Added TLDR in the end.\n\nAbout a couple of decades ago, I used to work at a concrete production plant for a reputable construction company. Our company, like several other construction companies, were awarded a portion of a larger project.\n\nA large portion of land was earmarked for setting up temporary office buildings and concrete plants for the different construction companies. The “sites” were separated by temporary barriers and had separate entrances. \n\nAs many of you may (or not) know, concrete is produced my mixing cement, water, sand and stone grits (size 20mm + 10mm) along with special admixtures in a specific ratio. Our recipe also contained a special ingredient - stone dust. Turns out, only our company used stone dust in our concrete and the neighbors did not. So a special truckload full of stone dust was specially shipped for us. This is important later. \n\nMy job entailed orchestrating concrete delivery to our project sites apart from regular quality control tasks like checking incoming materials for quality etc. Only after I had signed the delivery receipts, our stores personnel would unload the trucks at designated areas. A log of all trucks entering and leaving the concrete batching plant would be kept by security at gate (Relevant later.)\n\nSince my job entailed checking incoming material before accepting, the suppliers would usually try to offer some petty bribes, from cash to booze to flesh - if you know what I mean 😉 \nI always declined such offers as once accepted, you became their dog and lose all respect in their eyes. Moreover, bad material also impacted the quality of concrete produced: strength, consistency and setting time, to name a few. Since concrete delivery was also part of my job, it was in my best interest to only accept good material, otherwise the client would chew me up during casting. \n\nOne night, a supplier truck entered the premises with 20mm stone chips. Upon testing, I found them to be undersized for 20mm and oversized for 10mm. I went ahead and rejected the load. The driver and supplier started pestering me, offering bribes and what not. When I didn’t budge, they called my boss who asked me what was going on. I explained that the quality of material was unacceptable and I have rejected this. When I mentioned it is too small for 20mm, he ordered me to dump it in 10mm bin anyway. I knew what that meant. My boss was on the supplier’s payroll. \n\nA couple of weeks pass by and my boss asked me to reject “a truckload” of material from a very reliable supplier. He knew that the supplier was only delivering stone dust that day and should we reject material, the entire load would be a waste and a loss to the supplier. Once the stone chips or stone dust has left the quarry, they, for some reason, can’t bring it back. Hence my boss wanted to hit the supplier where it hurt most. Especially stone dust as there was no other company that would take it. \n\nCue - malicious compliance. I called the supplier, who had become a friend by now and told him that I was under orders to reject “a truck”. He panicked and told me that my boss was putting pressure on him for bribes. This particular supplier believed in providing quality material and always visited my lab to understand how I tested the material and what my requirements were. He would then go back to his quarry and adjust the equipment to deliver the best quality materials. Because he put so much effort in improving the quality of his product, he did not budge and bow down to my boss’s demands. \n\nI asked the supplier friend to route a truckload of 20mm stone chips meant of some other company to my plant first. I would let the gate security log the trucks’ entry and then promptly reject the material. He was then supposed to send the stone dust which I would accept and be done with my “task.”\n\nEverything happened as planned, I completed my remaining activities for the night and went home. When I came back to work in the evening, my boss was waiting for me at the door. As expected, he had checked the entry/exit log as well as material receipt history. He had noticed that I had accepted the stone dust and was chewing his anger, waiting for me to explain. \n\nHe very casually asked me if I had rejected a truckload. I acted dumb and answered in affirmation. I told him that the very first truck, a 20mm was rejected. Now usually 20mm is never rejected, especially from this supplier, so he asked me what reason did I give while rejecting the truckload. I said flakiness index - a test we never do as a field test, but is mandated by the client to be done once a quarter. \n\nHe knew that I was playing him but he couldn’t do anything. I had done exactly what he had asked meto do, reject “a truckload.” I had covered my bases with the security log as well as material receipt so he just muttered something under his breath and never mentioned this to me again or asked me to do anything similar. 2 months later he was transferred to a different site and I became the overall incharge - same designation and pay, just more responsibilities.\n\nEdit: Wow. So many upvotes and a Gold. I am deeply humbled 🙏\n\nEdit 2: wow another gold and then a platinum. I feel blessed.\n\nEdit 3: TL;DR - manager asks me to reject “a truckload” of material, assuming I would reject the special kind. I reject the generic material which was meant for someone else anyway, thereby saving a supplier a bunch of money and inconvenience.",
        "permalink": "/r/MaliciousCompliance/comments/k8lqcy/corrupt_manager_wants_me_to_reject_crucial/",
        "comments": [
            "I used to be an inspector for TxDOT back in the day. We had a contractor that had their own plant, but wasn't very good. One night, we were slipform paving, and somewhere in the middle of it they sent a truck of soup (slipform paving you need thicker concrete). I knew it wouldn't pass, so I started doing the slump test on it. Specs also said I could hold it for 45 minutes.\n\nSo, I started doing that on every truck. At one point, I had every one of the plant's trucks waiting. By the end of the night, I sent back 19 trucks that didn't pass inspection. That means the company had to eat the cost. While I was holding the trucks on site, the plant manager came out with a stack of 100's, and asked me what it would take for the concrete to pass. My answer was the concrete needed to pass the slump test...\n\nI had to explain to the big boss why I rejected so many trucks. Luckily, I had documented everything, so I was good.\n\nThey never pulled that again on me.",
            "I’m often told that I should lie or cheat to get where I want career wise or even get official business done; but I have taken upon myself to stand true to my values and remain honest regardless of the outcome.\n\nStories like yours give me hope and confidence to keep walking this path. I’m sorry someone stole your post, and I wish you all the best.",
            "> 2 months later he was transferred to a different site and I became the overall incharge - same designation and pay, just more responsibilities.\n\ni figure this is why your old boss was taking bribe money",
            ">My job entailed orchestrating concrete delivery to our project sites  apart from regular quality control tasks like checking incoming  materials for quality etc.\n\nAt this point I imagined OP walking up to a dumptruck fill of stone dust, swiping it with his finger and wiping it inside his lower lip like a coke dealer, then giving the nod to let it through. Dunno why but this had me giggling.",
            "Hopefully with you in charge things went more responsibly and much better for everyone in long run. Taking shortcuts should only be for traveling  otherwise you will eventually pay for it.",
            "Drives me nuts when people don’t have pride in their work. Especially when it can have such serious consequences. It’s one thing when a minimum wage worker is rude to a customer in a big corporate chain store... it’s entirely another when 10s or 100s of thousands of dollars and/or even people’s lives are riding on the quality of the product",
            "I've only known of two separate instances where we had run-ins with contractors and regional inspectors. The first was a good on the contractor's behalf. \n\nThey misjudged (or flat out didn't and tried to bull their way through with a wild number) the moisture content on a load of aggregate for concrete. \n\nThey based their batches for a bridge project on that number, which pretty much made batches as dry as popcorn; the rocks were literally heard rattling around in the drum!  We limited out on the water allotted by the book to add to dry batches to get them to spec, and it was still dry. \n\nThe pump truck was choking on the dry crap, so we took a load, and ran a slump cone. Now in doing so, we were measuring the moisture content by making a controlled cone of concrete slump and after a predetermined measure of time, measured how far the concrete slumped down. \n\nNormal slumps usually run around 4-7\" depending on the materials used. This one, ran one quarter of an inch.  (.25\") It was that bad.  Dad rejected that truck. \n\nBut the sawed off young buck mouthed off at dad, which the foreman and the crane operator heard. Dad, John, Frank, and me, would have easily totaled over 1 ton of deadweight, and this little shit of a trucker barely tipped the scales at 100. He realized he had no authority there or the muscle, scampered back to his truck, and ran for it. We got on the radio, stopped all concrete deliveries and requested they redo the moisture tests.  \n\nOne hour later the next truck arrived with the owner riding shotgun, and we ran the full spectrum of tests; the slump and air retention on them; it was perfect.\n\nThe next one was just pure corruption. We rejected a lot of aggregate rock due to poor sizing. The sieve tests on the sample were way out of spec. Dad kicked it out and informed the district office of the end result, mailing them the reports.  Comes to find out later they ALTERED the forms showing it was in spec, gun-decking their own test reports to reflect the alteration. You could EVEN see the whiteout on dad's test forms. He got hot, and filed complaints with Region 1 and our own boss. The repercussions bounced up and down the line, and I THINK the district office's director \"retired\" early.  No one ever crossed us afterward.",
            "I was a supply officer in the military. What you said about once you take bribes, you belong to them is so true.  The people who provide the food, services, etc won't get in trouble for bribing you, so once you take a bribe, you can never reject a bribe, or they threaten to tell your boss.  You go to Leavenworth and they find the next sucker.\n\nApparently it is even worse in intelligence. Once you take a bribe from a foreign power, you get life in prison/death penalty if you are ever caught, so the folks who bribed you for a ship schedule now own you.  Side note, with a few exceptions most spies actually get reduced sentences in exchange for providing as much information as possible on exactly what information they shared, but 20 years instead of life is not a huge relief.",
            "[Just because you are spez, doesn't mean you have to spez. ](https://www.reddit.com/r/Save3rdPartyApps/)",
            "Wasn’t this already posted?",
            "r/benevolentdefiance for taking care of your friend.",
            "My brother-in-law was in a similar position at a company that does huge public works in my very corrupt country. He was \"promoted\" to a position best described as \"bribes and kickbacks manager\", which he refused.\n\nHe was obviously let go and could not find a job in any other corrupt public works engineering firm in the country.\n\nHe now owns a pub and both his boss and his boss' boss are in jail.",
            "Well done for standing up for what was right. It can be hard to do.",
            "There must be something about working with concrete that breeds malicious compliance -- checkout /u/hipposingularity's posts here too",
            "I hope your boss built himself a house, which subsequently collapsed due do poor construction materials.",
            "As a consumer of concrete (usually for communication towers) i take the quality of my concrete seriously and appreciate your efforts. We always take test samples of pour and have them tested for strength after the pour in a lab. I have never had a sample rejected for insufficient strength but can only guess what would happen if a batch failed. We'd have to dig out the pier and repour causing a huge delay in construction.  Delays = $$. Get it right the first time!",
            "What was the stone dust you mentioned? Fine aggregate, or an scm like silica fume/fly ash/GGBFS?",
            "Are bribes for material really that common, Jeez.",
            "What country is this? It sounds crazy corrupt.",
            "Do you work in America, or somewhere else? Sounds like a very corrupt operation.",
            "Thanks for looking out for the company and the customer - the company, because it employees so many people who feed their families.  The customers, because I have been on the receiving end of shoddy work which completely falls apart in three years and I will never do business with that company again.",
            "being involved in quality control myself i love how you did the responsible thing and played the game there....i bet your customer likely went over your bosses head, and your boss lost his post for being unreliable. kudos to you man you are obviously more deserving of that post.",
            "[deleted]",
            "So boss was asking supplier for bribe money, was refused, then told you to reject a truck from them. Sounds like a rather serious crime. But why play around to actually reject a truckload? Boss knows you did a naughty and also that it wasn't the naughty he asked for. I feel like something is missing, such as that a second reject would trigger an investigation or something.\n\nAlso, congratulations on your promotion to more work for the same pay.",
            "Wait I missed somthing. Where's the twist? Was it the 20mm being rejected or the dust?",
            "I like how the story ends with you taking on more responsibility for the same pay.",
            "A bit late to the party but I wanna share a 30 year old story from my dad. He often tells me that the construction/real estates industry is cesspool of bribe action. Once you give in to your greed, you are forever tainted and will lose respect by being recognised as the person who could be dealt with through bribery. It is a tough road for the few rare people who really uphold the correct moral values and professionalism.\n\nAs an architect and belonging to the compliance department in a real estate company, he has to screen over the contractors' application for a huge project. \n\nSo he was sent to the mainland China for a certain hotel construction project in the early 90s. Different companies tried different ways to bribe him into accepting their tender. \n\nThe most notable one was the contractor that was going to secure the contract anyways as their proposal was the best. Yet the night before the announcement, they bribe my dad's hotel staff and took his keys and put 10\\~20 hemp bags of coins in his room, saying that is the part payment if my dad is willing to accept their tender. Then the contractor emptied out the bags and all the money scattered on the bed, trying to show how rich my dad could be for accepting the offer.\n\nMy dad just told him that tenders are chosen according to the details of their proposal. Then he said he will check out and switch hotels as he don't want to sleep on a bed full of the smell of coins. Then he told the contractor to clean up his own mess and take their coins back home. The contractor called my dad a douche for not helping him put the coins back in the hemp bags. What a tosser.\n\nAlso, the face of the contractor shaking hands with my dad in the public event photoshoot after securing the contract was hilarious. Dude would have secured the contract anyways but the culture of bribery was deeply rooted in them. Pathetic.\n\nLastly, he said the people who are the most prone to such acts are either over-ambitious young bloods who want to get some quick success, or those who have been clean their whole lives but close to retirement but suddenly insecure about their financial stability after retirement. These advices never really helped me as I chose a totally different field of work. But I guess it still was great knowing that my dad was a good person.",
            "Did the stone dust help harden the batches, or what was its purpose?",
            "Man, I would never have guessed that the concrete industry had such stringent controls, nor be so rife with corruption.",
            "its kind of sad that this is supposed to be a story of your exceptional actions and not just a normal average reaction to that kind of behavior",
            "If you have integrity, nothing else matters.\nAnd if you don’t have integrity, nothing else matters.\n\nGood on you.",
            "Grats for working with the supplier to prevent some bad issues.",
            "As a quarry owner you played that amazingly well. QA for concrete agg is a pain in the arse and cowboys in the industry just make it harder for everyone. Thinking on your feet, showing initiative, respect and standing by your own convictions are qualities to be proud of. Well done. Oh and that boss will come unstuck one day.. supply shit concrete to the wrong company and have cracking or failures in the pour and watch those bribes mean nothing as your taken to the cleaners by a team of lawyers. You should be proud of yourself.",
            "I got shivers at the \"Okay, route a truck meant for another customer to me first so I can reject it.\"\n\nGenius. Thanks for not joining the Scumbag Parade. AKA I suspect the reason why so many new constructions in my area are collapsing.",
            "Impressive.\n\nFollowing orders AND making sure it won\\`t bit you in the backside!\n\nWell done.",
            "My dad was a cement mason and a site foreman.  Your dedication level is the same as his was.  No bribes, just quality work.",
            ">to flesh - if you know what I mean 😉\n\nOh, I know what you mean alright 😏. Bacon. They offered you bacon.",
            "And when flakiness fails, you can go for the average least dimension (asphaltic concrete is still concrete! It gets no love!).",
            " Go get a raise man!",
            "Is this a thing in construction? Seems like the bribes are working somewhere, otherwise the drivers wouldn't be doing it.",
            "I would have done everything I could to get your boss shitcanned, but nice work",
            "If you're at all related to an American company (or even just using banks that correspond to US banks) you can use the FCPA to drop a giant fucking hammer on your boss.",
            "Sounds like my country's government project...",
            "TIL that cement and concrete are not the same thing",
            "Who knew there could be so much drama at a concrete plant.",
            "I had thought based on the headline that you would reject the stone dust,the concrete production would have to halt because there was no stone dust,and then the company would lose the contract because it wasn't producing concrete.",
            "Thanks for explaining it so well! I have no knowledge of construction/engineering but this was all explained very well and easy to understand.",
            "I worked in an asphalt testing job one summer, and just like your plant, being honest was a major career liability.",
            "Great story but I'm a little confused. What was the MC? I got lost there.\n\nAnd also, why were suppliers bribing you? Aren't you guys the ones paying them?",
            "Dude, reading this makes me wonder if you live in China",
            "As someone who used to work in Concrete, everyone uses a \"stone dust\". Everyone.",
            "Wow",
            "Good job on the MC, OP",
            "ah... a little thing I like to call... \"ethics\"\n\nsuch a rare commodity nowadays",
            "We need more people like you in the construction business.",
            "Same designation and pay?  Some promotion.....",
            "> Especially stone dust as there was no other company that would take it.\n\n> I asked the supplier friend to route a truckload of 20mm stone chips meant of some other company to my plant first.\n\nHow was there a truckload of 20mm stone chips meant for a different company when no other companies use stone dust, only yours does?",
            "No one wants to admit they watched it.",
            "Good work!",
            "I understand couldn't you just get him fired for soliciting a bribe?",
            "I never knew that cement was such a cutthroat, dog eat dog business.  I feel like I just read a mob novel.  What a whirlwind.",
            "Integrity is everything. If your industry is like mine, everyone, somehow, eventually knows everyone who knows someone. Your honesty will pay off and your reputation will reward you; either career wise or simply by you yourself knowing you’re above that crap.",
            "Integrity is something that no one takes from you, you give it away. And it’s hard to earn back. Good job dude!",
            "The stone dust supplier could have sent an empty truck, then you would have rejected it because of \"quantity issues\". Supplier would have lost just the trucker fuel and time, not a cargo, and the rejection task would be complete.",
            "I LOVE your solution!! Brilliant!",
            "Thank you for trying to do the right thing. Corruption in all industries literally destroys society.... Or in this case, the physical foundations for which society is built upon.",
            "A mad scientist's obsession with mixing sand, stone, water, and cement has started to yield some concrete results....",
            "[removed]",
            "there is hope for humanity .... carry on sir",
            "Fuck yeha I love concrete stories. Cement gets me so hard.",
            "How many Jimmy Hoffas per truckload to make a good foundation?",
            "I feel like this is a well orchestrated trap rather than malicious compliance... but story was still good",
            "Georgia, do you recognise this things? 🥒🥕🍌🌶🍆”",
            "> I always declined such offers as once accepted, you became their dog and lose all respect in their eyes. \n\nSo that's your main motivation for not accepting bribes?",
            "Upvote for concrete!",
            "lol I I ill ￼",
            "*I reject physics, Mojang!*",
            "fucking. brilliant.",
            "You do good.  \nKeep doing good.",
            "Gives me strong Locke (2013) vibes.",
            "add a tl;dr please",
            "TIL there's money in dust.",
            "As a retired professional engineer, it is professionalism like yours that more people outside of construction should be aware (even if it was sneaky). It is the commitment to standards that gives a project a hundred year life, stops the smoke and fire from traveling through the wall, keeps a bridge standing when a semi hits it at high speed and ensures an accident free construction team. Nice job!",
            "This is really interesting. Especially because of the fact that I just listened to a thing on YouTube about different types of sand, and how they impact construction.",
            "The sounds like its in India\n\nThey all seem to be sponsors in cricket. Seriously how much money do they make to sponsor the cricket"
        ]
    },
    {
        "post_id": "pjv82m",
        "author": "DramaGuy23",
        "title": "If it's a C# developer you want, it's a C# developer you'll get!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pjv82m/if_its_a_c_developer_you_want_its_a_c_developer/",
        "score": 14080,
        "num_comments": 501,
        "created_utc": 1631046448.0,
        "selftext": "This is the story of how I got hired at an old job I had a few years ago. The technical manager (who ultimately became my boss) was a great guy and was the one who embarked on a course of malicious compliance to get what he wanted. It happened like this...\n\nThe company was small, about 20 people, and run by a CEO who knew the company's industry but didn't know anything about technology. What she knew was that she had a team of five developers and one technical manager, and that the company's code was written in the a programming language called C# (pronounced \"C-sharp\"). One day, her favorite member of the development team quit, whom she regarded as their foremost expert on C#. \n\nTo the technical manager, this was an enormous opportunity. He had four other developers who knew C#, but what he was missing was an expert in database design and administration. The company processed a huge volume of data, and he knew enough about databases to know that theirs were a mess: the same data had to be recorded in multiple places and was always getting out of sync, operations that should have taken a few seconds would run for minutes, etc. He didn't want to replace the departed employee with another developer; he wanted a database expert. But the CEO wouldn't hear of it. Cue malicious compliance. \n\nSomehow he got a description of the person he actually wanted into the hands of a recruiter, who found me. (I had over ten years of experience in database development and administration at that point, but had never touched a line of C# code in my life.) The technical manager had a \"skills assessment\" he was giving to all candidates for the job, which was 100% database questions. There was a huge, boldface warning at the top, which I found extremely odd, stating, \"These questions are extremely difficult; it is unlikely you'll be able to answer them all. You may not be able to answer any. Do not feel any pressure to attempt questions you find too difficult, as these results are not related to the position.\" I was told I had 20 minutes to work on it. Well, I finished it in about 2-3 minutes, the questions were all actually very easy, and walked back in to the office of the technical manager to ask if I was missing something and what this was all about. He gave me the \"shush\" gesture and motioned me back into the conference room. Then he explained. \n\nHis office was adjacent to the CEOs office, so he couldn't talk in there. The warning was something he'd been forced to put on the test after a recruiter (who apparently had initially been just as confused as I was) had called the CEO to ask why they were giving a database assessment for a C# position. He'd had to play it off to the CEO as, \"Well, wouldn't it be good to know if we happen to find a C# developer who is comfortable with databases too?\" He explained all the backstory described above. And then we talked for about 30 minutes about databases. C# didn't come up. The job sounded really interesting and would be a chance for me to make an enormous positive difference. At the end, he said, \"OK, you're perfect, I'm going to recommend you for the position, but first you have to talk to the CEO. Remember, when you talk to her, you're a \\*\\*C# expert\\*\\*. Got it?\" I was worried, but I thought, \"Worst case, I get caught and don't get the job; best case, I can really help this company.\" \n\nInto the CEO's office I went. After an exchange of pleasantries, she said, \"So, what would you say is your #1 technical strength?\" I made a thoughtful face, and said, \"Well, it's hard to say. I have skills in a lot of different areas, but if I had to pick one, I'd say probably C# programming.\" Her face lit up. \"Ah, fantastic!\" she said, \"That's exactly what we're looking for!\" We talked for a few more minutes about salary requirements and start dates (I said I could start in two weeks), and at the end she offered me the job. \n\nThat night, I stopped on the way home and bought a book about C#-- I think it was literally called something like \"Learn C# in 14 Days.\" By the time I started two weeks later, I knew enough C# to do my job. As the technical manager had said, there was an enormous amount of database redesign to do, so the C# programming was maybe 10-20% of my time. I was able to get those database jobs down from minutes to seconds like they should have been, and the CEO was so impressed she never even questioned my background. I continued to learn C# on the job, and no one ever found out I hadn't been a C# expert all along.",
        "permalink": "/r/MaliciousCompliance/comments/pjv82m/if_its_a_c_developer_you_want_its_a_c_developer/",
        "comments": [
            "I will quote my programming teacher from 25 years ago.\n\"I know these programming languages, and the others I can fool you that I know.\"",
            "For a while there it sounded like you were describing a position in the dev team I work in. Database is a nightmare and because it works \"good enough\" its never been improved. \n\nMy favorite story so far from this job was when I brought one report's runtime down from minutes to seconds and an employee of one of the customers complained that it was too fast, so it must be doing something incorrectly.",
            "Love this story.  Nothing can screw up a project more than a top manager who has no idea how the project actually works.  You can't do a solid application design with everyone having just the same skillset!",
            "As a recruiter I can tell you right now, this type of hiring manger is an absolute breath of fresh air. It takes guts to go outside the wire, especially when it’s the CEO, but a non-technical person dictating what a technical hire needs to be is the absolute worst. Good for your HM for finding a work around that benefit the team more than the ego.",
            "> I continued to learn ___ on the job, and no one ever found out I hadn't been a ___ expert all along.\n\nBasically every dev in every job lol",
            "[deleted]",
            "Awesome story!  I bow to your knowledge of SQL and the holy databases.  \n\nI've been a C# developer for 11 years. I've literally built systems that allow 30 year old applications to talk to modern ones.  I also know enough SQL to know I should not be allowed to touch the databases.  If it is any more than get me this information out of this table (I'm not joining tables for any amount of money) I'm looking for a DBA.  I just don't think that way.",
            "I've been screaming for a DBA for ten years now.  We're constantly having performance issues due to software developers thinking they know what they are doing with fancy queries.  I'd settle for a contractor coming in for a few months to a year to go through all our SQL and make recommendations.\n\nI can write queries.  I can't promise you they will be efficient queries because I'm not a DBA and I've only learned enough SQL to be dangerous.",
            "That's a great story, but there is no chance I would take that job if the management is this messed up.\n\nAlso, redesigning a database like that is not trivial -- the entire codebase needs to be modified to accept the new table design. \n\nEverything about this job makes me want to run away.",
            ">The company was small, about 20 people, and run by a CEO who knew the company's industry but didn't know anything about technology.\n\nOh wow, but do I love these.  Mmmmmmm.",
            "That is the problem with the tech industry... never enough thought to actual database design and development.... everyone is looking for a DBA.... who sits and watches a screen... and makes sure the back up runs.... smh....\n\nSpent 20 years in database world and am not qualified to be a dba or \"programmer\"... 🤣🤣🤣🤣🤣",
            "My former employer told us when interviewing that your present skillset is only moderately relevant. What we want to hire is demonstrated ability to come up to speed in a new technology, become functional quickly and become expert eventually. No one knows everything, we can teach anything you don't know... But you have to be able to learn it.",
            "Wow I went to uni and still don't have a full grasp of C#. Mind lending me your book?",
            "As my family says\nDon't let your qualifications get in the way of your aspirations",
            "I've said for decades now that after you learn your first dozen programming languages, the rest are just syntax.\n\nCheers for that technical manager for knowing how to get what he needed, not what management wanted.",
            "As another DBA supporting C# developers...hi!\n\nThe biggest PITA for our job (IMHO) is all the people who have databases that are absolute crap but won't hire a DBA because \"It's *just* a database! How hard could it be?\"\n\nThankfully my current boss is NOT one of those (but several other dept heads are and I *itch* to get my hands on their databases.)",
            "That technical manager is an artist",
            "It's amazing that to get a reasonable job that suited you only took reading a book to seal the deal.\n\nGreat MC",
            "If you had to learn a programming language on the job, C# is a pretty good one, especially if you're using Visual Studio. Just about anything you want to do has good examples online or Microsoft has already provided you with examples.",
            "This is good. No one was screened over. Company happy. You’re happy with a paycheck.  Nice wholesome story.",
            "I always like to give the metaphor of programming in a new language being similar to ordering food in a foreign country:\n\nIf you know you want a Big Mac, all you have to learn is how to say \"I want a Big Mac (please)\" in the local language.\n\nSame thing with programming - if you know the gist of what you want to do, figuring out how to do it in X language is a google search away.",
            "Not malicious...but made me laugh",
            "As someone who started with db and then realized that a) constantly managing it by writing transactions is getting stupid and b) we desperately needed some internal tools.... I learned c#. Took a few months to do some BS projects to get used to it, then wrote a program for warehouse management and pulling orders etc. Some of the core of that program are fucking terrifying, but by Satan's grace it still runs.",
            "Did you have any programming experience? Pretty cool story!",
            "I'm a developer for a decently large company. I'm dealing with a bit of this myself, where a manager is absolutely technically incompetent. \n\nLong story short, we have a java spring backend that a manager is dead set on keeping. It's a lot of garbage code without comments. Every time us 3 devs suggest changing it, the manager fires back about how much money it took to build, and how he knows Java is the way to go because he \"has 20 years of Java experience\". (I doubt he was very good)\n\nI was moved to that team to replace 2 other devs that had quit. In the next 3 weeks, both of my new dev friends put in their 2 weeks notice. The team has since been \"put on pause\" and I'm on a new team.",
            "I just wanted to say... I tried reading this in tune to the Fresh Prince theme song, and it didn't work.",
            "As a C# developer that's now in database management learning that on the job, I applaud you for that one. It's great to see that I'm not alone.",
            "Maybe I’m biased because I know C# but I think database expertise is more specialized and harder to hire for. Technical manager probably saved the company a lot of money.",
            "I love opportunities like that!\n\nA long time ago, I had a similar thing happen and spun it off into a pretty great career run lasting two decades!\n\nBasically, they needed someone who could prototype and improve and older shop.  Old people, old machines, just old...\n\nThey wanted to hire someone who knew CAD design and layout.  Truth is I was great at all of it, but not too familiar with CAD due to simple lack of access.  \n\nSo, what I did was bootleg the CAD system and camped out in a friends dorm room for two weeks to learn it on their system.  I did not own a computer powerful enough at the time.  I had also done everything manually to that point too, which really helped.\n\nSame kind of scenario really.  Hire in for the \"required\" skill, but end up making a big difference due to other needed skills.\n\nFunny how it worked out too.  I ended up moving away from prototyping and manufacturing due to the major outsource wave in the 90's.  Had I not taken the job and stretched for the CAD part of it, I may well have had a lot tougher time of it all.  Turns out CAD was easy for me and fun.\n\nMoved again, into professional work associated with the CAD and related systems, eventually building up fairly large scale, multi user managed CAD systems capable of building cars!  Did a lot of that on SGI computers too.  Lots of fun.\n\nAnyhoo, great story!  Have fun!  You should given how you came in the door.  \n\n-----\n\n\nHey passersby! You just never know!  Deffo make that difference when you can, but also take the skill builders when they come up!  If you can scrape in, learn as you go and hopefully work with cool people that help one another, it almost always adds right up to bigger, better things.\n\nOver time, you end up able to do a lot, and it can all build on your core competencies! For me that was computers and manufacturing.  CAD and related systems amplified all that nicely.  Could just as easily be anything you are good at and or are putting time into getting good at it.\n\nOP is likely to have a similar thing happen.  Databases are their wheelhouse.  Adding the new language + some experiences bringing out the best in that company may = much higher value opportunities later on.\n\nWhat door you walk into the building matters.  In my career, walking in the shop door meant one kind of pay and potential for growth.  Walking in the front door at my next gig meant another, and so it goes...",
            "To quote our professor at the university 20 years ago: Don’t bother trying to impress someone with all the programming language you supposedly known. I expect from every true programmer to be able to learn any language they might need within months, if not weeks. A programmer is a problem solver not a language guru.",
            "This was such a nice story",
            "You gotta tell her when you leave.  Tell fuckin everyone.",
            "r/ActLikeYouBelong",
            "So many years ago, my database programming course pounded it into my head to normalize your data. It has served me well in the small databases I’ve created over the years.",
            "Once you understand the fundamental paradigms, a programming language is just vocabulary for most purposes.",
            "Reminds me of when Teddy Roosevelt was trying to solve a labor dispute.  The industry barons refused to allow a union organizer at the table so TR called the guy a sociologist and the barons allowed it.",
            ">The warning was something he'd been forced to put on the test after a recruiter (who apparently had initially been just as confused as I was) had called the CEO to ask why they were giving a database assessment for a C# position. \n\nThis sounds like the company wasted the time of a recruiter and at least one other applicant just because the manager wasn't able to talk to his CEO.",
            "Repeat after me:. \"Google is my friend...\"",
            "What my school taught me is that once you know the fundamentals of programming, the only difference when changing language is semantics (`print` vs `console.log` vs `cout` etc)\n\nGood job OP",
            "I really wish this story ended with you finishing the project and then telling the CEO that you didn't know a lick of C# when you started",
            "that was awesome read 10/10. wish you all the best.",
            "Sick.",
            "I *love* when CEO's or other senior leaders try to insert themselves into technical matters. It *always* works out so well. /s",
            "Being a good programmer isn't about what you know, it's about what you can figure out.",
            "IT feels like even OP didn't realize that he is an expert C# programmer all along!",
            "\" Was written in a language called C#(pronounced - hashtag)\" ok gotcha. You learn something new every day",
            "Who cares what language an employee has experience with?  You can teach an experienced software engineer a new language in relatively no time at all compared with teaching them to design good software.\n\nIt's like demanding that a mechanic be an expert with metric tools.",
            "This is hilarious, and it's also sad how little some upper management is just so tech illiterate.",
            "This is great example where employer has no clue who they need thus asking for skills that have nothing in common with job requirements, and someone having all the knowledge who they actually need.",
            "Awesome work by the technical manager and yourself to go above a beyond and do what needed to be done :)",
            "When I was in college almost 30 years ago, one of my professors told the story of a guy whom he'd taught walking across campus loaded down with library books. This was at the end of the semester, so he was wondering what the guy was up to - reading instead of studying for finals.\n\nThey were programming books on C++. The guy had lied in an interview and said, \"Sure, I know C++.\" \nThen he taught himself C++. My professor heard from him later, and he was doing great in his new programming job.",
            "Why did i read the first 10 words like the intro to fresh prince?",
            "That's awesome",
            "Great story, (I really do like it),  but nobody's getting punched in the balls after literally asking for it,  so maybe not \"malicious\" compliance?",
            "As an business/systems analyst who has been responsible for the databases for most of my career (and love them) but also strives to at least follow code to see what it's doing - I love this!",
            "C#.... I thought you were talking about a music chord right off.",
            "C# is just Java but better",
            "Wait, it's not pronounced \"C-sharp\"?",
            "I'll call it \"C hashtag\"",
            "I passed a programming test via being able to read patterns in programs and the short hand spelling isnt far off from myself. Interviewer was really impressed by me finding all the errors in python code and then confused when I said I have never learned anything beyond c+, excel and visual basic.",
            "\"Once you start learning a few, it is easy to catch on to many others, my programming teacher, who has been programming for anywhere from 20 or so to 40 years knows about 25 languages.",
            "The ability to diagnose a problem and the passion to learn are far more important than any particular technology you've used in the past.",
            "Similar story on the opposite end of the spectrum. I interviewed for an engineering technician job at a small space company. They loved my experience and asked if I know how to write any ate  with LabVIEW. I said no, but it's something I'm interested in learning. \n\n\nAnyways, 2 days into the job, my first assignment is literally to LEARN LabVIEW AND write an entire ate program for the upcoming product shipment. \n\nI quit.",
            "Love this story ❤.",
            "Boy, what a great way to luck into a new skill!",
            "I sometimes pronounce it \"C Octothorpe\" for variety",
            "Programming is easy if you know how to google. Been at it for 10 years but I still need google and stackoverflow every now and then. Its impossible to remember everything.",
            "That company was lucky to grab you",
            "That's so frickin' cool.  I couldn't even learn basic in junior college,...so I'm always impressed with anyone who can learn programming at all,...let alone enough to do an actual job in 14 days! lol.",
            "If it's the same thing 💀",
            "This is... eerily familiar to when I was a junior C# dev turned Oracle SQL developer during one of my contracts.",
            "Funnily, as a C# developer, I often fixed DB stored procedures because companies didn't have DB admins... I learned a lot and I have a few example of SP running for hours and that improved to run for a couple seconds. These stories always come in handy at interviews.",
            "When I was studying computer science at university, I also worked on the side to... have money, I guess? But I also wanted to get some professional experience while at it. Second job I got was looking for a Delphi programmer. I haven't ever written Delphi, just had a bit of Pascal at school, and I said as much on my first meeting, adding that goes hard can it be to learn another language. They took me up on it. I stayed with the company for five years (I took quite a bit on my degree), they even hired me full time after I finished, and the next job I got was also Delphi, at least in the beginning.",
            "It sucks to have a boss who doesn't even know what he or her employers do. I could pretend to work all day and nothing would ever come out of it.",
            "I think this is the only positive Malicious Compliance post I've ever read.",
            "Upskill too, 10 years databases and solid c# will get you a very high paying back end dev job",
            "I was learning about DBMS a while back, it I didn't find it very exciting and very difficult lmao.  Learning the syntaxes was a struggle.",
            "> I was able to get those database jobs down from minutes to seconds like they should have been\n\nFlashback to a legacy system with entire paragraphs, if not short horror stories, of SQL with multiple joins and recursive lookups that would work though slow when developing but letting in more than ten concurrent users would halt the server to a crawl and make the database weep for mercy.",
            "Ah, this post makes me happy. No anger or pain or cringe, just beautiful benign deception and a good chuck of self-improvement to boot.",
            "Thing about programming is if you know couple of them you can pick up easily any language ....most of them has same if while logic etc ..only syntax changes",
            "This is like knowing an assignment last minute before the deadline",
            "Better than what happened to me... I've been hired as a C# developer with 12 years of experience on my belt, when most of the problems were in the database. \n\nI knew SQL as a language, but no database administration. Got the book SQL Server Administration in a Month of Lunches to get the basics (great book BTW) and started from there.\n\nCompleting 1 year in the job this month, I'd consider myself a mid level database administrator by now. At least the database is running smoothly.",
            "I’m confused, what’s the point in having a technical manager if you won’t let them make managerial decisions about your technology?",
            "I wish I could say I have no idea what any of this is about.\n\nUnfortunately, as a jack-of-all-trades sysadmin/DBA/datacenter architect kind of guy, I get this more than most.\n\nI can certainly roughly optimize SQL, but I also know that someone truly dedicated to it can often improve anything I’ve “optimized” significantly. But it’s rare that management recognizes the need for it when “it already works.”",
            "Necessity truly is a mother! In the Year 0, I had 17 years of C and C++ experience (plus Pascal, Fortran and LISP which were getting less relevant by the day), and was architect on a project at my new company when our Java programmer left. He said the project was \"practially finished,\" meaning it was a right mess in which almost nothing worked. So ... in two weeks I learned Java, at least well enough that in two further weeks I was able to deliver the finished project for testing, on schedule. It became my main language for the next decade.\n\nI think I had a similar book to the one you discuss; it was \"HTML in 24 hours.\" What they actually meant was 24 one-hour sessions, but still, it was enough of a springboard that I could pick up the rest on the job.",
            "I'll never understand a person's inability to admit when they don't know enough about something. And yet here's a CEO doing just that.",
            ">(pronounced \"C-sharp\")\n\nI call it C-pound just to fuck with our code monkeys.",
            "Back in university, when I was still a god-awful developer, I wanted to make video games for fun.\n\nI used C#. I wrote it as of it were Java, and whenever something didn’t work I googled it.\n\nI wrote several small video games that way. C# is a great language, it feels like a more modern Java (Java has improved since though).",
            "IT is 80% database and its utilization...the other 20% is restarting the device.",
            "so, let me summarize:\n\nan employer managing databases (with C# knowledge) left and so the company look for people\n\nyou're good at databases (like, really good), but you don't know how to C# and was found to fit (I don't understand some sentences, probably just me)\n\nusual process of hiring a new employee, then got to the CEO and told that you had C# knowledge (even though you did not)\n\ngot hired (asked for starting date), then went to buy a C# book, read it before you started your job, and then started your job\n\nand went to redesign database jobs (with some of the time touching C#) reducing a lot of time on the jobs\n\nOP, are you sure this is ***malicious*** compliance? I mean, is this even ***compliance***? i'm not seeing that. if you do, can you mention it?",
            "I use C# solely because I develope using Unity",
            "It's like baptism by fire.. Atheist style!",
            "This doesn't seem particularly malicious",
            "If anybody comes up to you on the hook",
            "\"This is the story all about how my life got flipped turned upside down...\"",
            "> Don't worry, you'll break eventually",
            "If i was green i would die",
            "This isn't malicious compliance at all. More like kind compliance",
            "Wasn't this actually more of a... benevolent compliance? 🙈",
            "The recruiter thought it was weird to ask a bunch of db questions for a backend C# dev?",
            "How is this malicious compliance? The technical manager didn't comply with the request for a C# developer he just lied.",
            ">That night, I stopped on the way home and bought a book about C#--\n\nSo, you bought a book on C++?",
            "OP, can you give us a link to that book please?",
            "Does anyone else refer to it as C-hash, instead of C-sharp?",
            "Why does tech have to be so dysfunctional so much of the time?",
            "As a programmer with many decades of experience, it *still* baffles me today's programmers are given degrees without a single shred of knowledge in working with databases.\n\nAs the one who does the hiring, I now have to determine who's a candidate to learn a crash course in SQL programming, and open to the idea, vs those who'll not care because it's not in their job description.\n\nSo much has changed. Worse, I'm terrified so many damn companies put out job qualifications in which no recent graduate can even come close to matching.\n\nJust like this \"CEO\", she hadn't a damn clue what a programmer does, and she only wanted to validate what she wanted to hear.\n\nThis management setup is precisely what's wrong with so much software development today, and why all of it sucks.",
            "Did I miss something? Because it sounds like OP’s boss just lied to the CEO and made OP go along with it.",
            "Surprised you took the job, that would have been a huge red flag",
            "A language is useful but at the end of the day if you have nothing interesting to say then no one is going to listen.",
            "R/symbioticompliance"
        ]
    },
    {
        "post_id": "md17hv",
        "author": "ThisPercentage",
        "title": "Navy Corpsman vs New Nurse",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/md17hv/navy_corpsman_vs_new_nurse/",
        "score": 14082,
        "num_comments": 442,
        "created_utc": 1616687025.0,
        "selftext": "1990 I am a relatively new corpsman (medic) assigned to a surgery ward at the Naval Hospital. Our patients are all post-op and there are 60 beds. There are 6 or so corpsmen assigned to take care of these patients. As part of our duties we are to chart our findings and observations as we make our rounds.\n\nThis surgery ward is usually a first assignment for corpsman and nurses coming fresh from school. I joined the Navy at 21yo so am a little more world wise than my peers who are all 18 or 19. I know, especially in the military, there is the book way of doing things and the effective way of doing things. We had volumes of manuals that covered every aspect of our jobs and duties that you could imagine.\n\nCue the new nurse who has been assigned and wants to show how good she is at managing the lowly corpsman troops. She was merciless. Always looking for opportunities to embarrass or cause trouble for us.\n\nOne evening I observed her shouting at one of the corpsman for using an unapproved abbreviation in a patient's chart. What was the offensive abbreviation? ASAP He had written that the patient needed an evaluation ASAP. You would have thought that he had personally offended her honor.\n\nI went and looked in the approved abbreviations section of our operations manual to confirm that it was not there. It was not. I did find that there was a very extensive list of approved abbreviations available to use though.\n\nCue the MC. I pulled all of the corpsmen on the shift and told them to bring their charts to the break room. We then charted all of the notes together using nothing but approved abbreviations. The notes looked like another language! I made sure everyone could read their own notes and sent them out to put the charts back.\n\nNurse \"pain in the butt\" came in to review the notes with the corpsmen. I take the first round. This is done while standing at the bedside of the patients. She opens the chart, looks at the note and says\n\nNurse: WHAT IS THIS?!!\n\nMe: I do not understand. What do you mean?\n\nNurse: I do not understand anything you have written.\n\nMe: It says that the patient is recovering well with little difficulty but will need further evaluation based on his comments and visible demonstration of discomfort and reduced mobility in his left upper limb.\n\nNurse: That is not what it says.\n\nMe: Maam, I assure you that it does and that those are all approved abbreviations. I am sorry that you do not know them. I do realize that you are new.\n\nI smile. She does not. This is the first of 60 charts she is to review. I have never seen corpsmen so eager to review chart notes. We did go get the manual for her, just to be helpful.\n\n&#x200B;\n\nPosted in  [r/militarystories](https://www.reddit.com/r/militarystories) as well.",
        "permalink": "/r/MaliciousCompliance/comments/md17hv/navy_corpsman_vs_new_nurse/",
        "comments": [
            "In the words of Second Technician Arnold J Rimmer, \"He who lives by the rule book, dies by the rule book.\"",
            "Now you communicate via ICD 10 codes.\n\nPatient is recovering well following W55.41XA incident resulting from V97.33XD encounter. Related S10.87XA is healing well and is not expected to result in any further complications. Family history does suggest that patient may have Z99.89 tendencies and should be monitored upon waking.\n\nNext of kin has requested rejection of visitors due to Z63.1\n\n\\---------\n\nW55.41XA - Bitten by pig, initial encounter\n\nV97.33XD - Sucked into jet engine, subsequent encounter\n\nS10.87XA - Other superficial bite of other specified part of neck, initial encounter\n\nZ99.89 - Dependence on enabling machines and devices, not elsewhere classified (aka. Crackberry syndrome)\n\nZ63.1 - Problems in relationship with in-laws",
            "If there is a group of people who follow specific instructions to the fucking T... it's the military. She fucked around and found out. lol",
            "The navy, specifically those with some rank, can be really hard to deal with sometimes. If you dig deep enough, you can always find a reg that you can use against someone, but you also still have to work there.",
            "Murdered by TLAs! Cannot up vote enough.",
            "This officially is my favorite malicious compliance of all time! It has a jerk who thinks they are better than everyone, a manual proving the malicious compliance was all right, a hero who helped all the fellow corpsman, and the villain having to pay the price. \n\nThis is it, nothing could be better :)",
            "Nurse with 5 years experience. Civilian. I approve. One day maybe we’ll realize it’s not a pissing contest between medicine and nursing and the patients will be better off.",
            "The poor guy who had been scolded by her should have said to her with a shit eating grin: \"I could get you the manual ASAP if you need it\".",
            "As a Navy brat, my dad served for 27 years, he enlisted as a Corpsman in ‘67 in Vietnam, I feel y’all don’t get enough credit. I’ve had many broken bone set, stitches applied, etc etc by one of y’all and there’s no civilian equivalent to the expertise in my opinion. Thanks Docs, y’all keep doing what you do.",
            "I knew a Navy Corpsman who applied a tourniquet and started an IV while suspended in flight under a helicopter via Special Patrol Insertion/Extraction (SPIE) rigging to an injured marine who set off an improvised explosive device during a Long-range reconnaissance patrol (LRRP). \n\nThe Corpsmen was batshit crazy but had mad skills. \n\nHe also had a hard time dealing with people (including nurses) but eventually we learned how to cue off his body language when he got agitated and annoyed with those of us who didn’t meet his approval (for whatever reason).  \n\nThe last time I saw him our building was on fire and he was screaming like a madman at the universe (or God?) while exiting the building. \n\nWar is hell and I learned to respect and appreciate anyone who tried to help and heal others no matter what their (and mine) personality quirks and idiosyncrasies might be.\n\nBe kind and less judgmental when you can.  That’s my story and I am sticking to it.\n\nSemper Fi and Oorah Devil Docs...\n\nAnd so it goes.",
            "Now I want to know what was written on the chart.",
            "Makes me wonder how far back the nurse vs corpsman feud goes\n\nMy time in there were the nurses that made our lives living hell, and then the ones that understood we're all on the same team and did their best to guide, teach, and even protect us.",
            "How is ASAP not an approved abbreviation? That's like, one the very few universal abbreviations I can think of that literally everyone knows.",
            "I smell the handiwork of the E-4 Mafia.",
            "I upvoted this anyway even though my wife is a nurse. She's great, but some nurses can be Ratchetts.",
            "Deserved treatment delivered More!\n\nBy the way, \"more than one corpsman\" uses the word \"corpsmen.\" You meant \"cue\" when you wrote \"que.\"",
            "I don't care who you are, if your first move when you roll in is to sling your dick around you are scum.",
            "At least you didn't have to deal with a resident who became an attending on the same floor.  His head got so big it kept bouncing off the hallway walls until the Admiral had a little chat with him:)",
            "RTFM",
            "I am a nurse, old though, RN for 26 years, and this is awesome and was exactly the appropriate response. No one is better than anyone else. WELL.DONE.",
            "so what happened in the days and weeks that followed? Did the nurse lighten up on the bullshit or double down?",
            "This is great.",
            "Insecure bullies like the nurse do it to feel good about themselves.  Newbies like this nurse like to establish who is in charge.  Hopefully, what you did brought her down a few notches.  Bullies do not like to be publicly shown that they are wrong or don't know.  But she only got what she did to others.  So good for you.",
            "Sounds like a typical SNAFU.",
            "May I ask, do corpsman have the same duties as nurses? Like are y’all on the same level as far as duties/pay/and whatever? \n\nDo corpsman only serve at military hospitals/doctors offices at VA?",
            "If language is understood then it should not need to be approved. Have fun deciphering a page of abbreviations!",
            "r/militarystories",
            "Hah.",
            "I am a nurse. I fucking hate nurses like this chick. Our profession is full of them too. This is awesome what you did. I’d buy you a beer if I could.",
            "Why does Corpsman autocomplete to corpse man?!",
            "I always knew the proliferation of military acronyms was intended to be a punishment.",
            "My old company had a list of over two hundred abbreviations, acronyms, and initialisms. Shortcut on the desktop was C.R.A.P. \"Company Regulatory Acronym Protocol\"",
            "Rule #1... Never fuck with the Doc.  Ever.",
            "I imagine all military stories as an episode of mash. It especially helps when it's a story about a medical unit.",
            "I really enjoyed this story, and as OP had crossposted this in r/militarystories as well, I thought I’d check it out.  \n\nI tried reading the first post and... I now know how that nurse feels.",
            "...i would have retrieved said manual ONLY if instructed to by a superior.",
            "Now that's good quality Malicious Compliance!  Nicely done!!!",
            "God bless Doc. Kill",
            "The proper way to “corpsman up”",
            "I love you.",
            "Bravo Zulu!",
            "Is Corpsman the PC version of zombie?",
            "One of the most beautiful possibilities is that in medicine, the same exact acronym can be used to mean multiple different things, and manage to be an approved acronym for each and every one of them at the same time, understood only by context. \n\nJust one Example:  ALS can be a reference to Amyotrophic Lateral Sclerosis or Advanced Life Support. And more often than not if you are charting about the 1st one, you are also charting on the 2nd in the same damn chart! There are also about 15 other things that get notated as ALS just off the top of my head.",
            "E-4 Mafia.",
            "Being ex-navy, I learned not to fuck with the pecker checkers!",
            "You’re an example of why corpsman are a priceless asset. Most of the junior corpsman were disciplined and our IDC’s were always more squared away and more dedicated to the patient than any nurse or PA. I served with line corpsmen, the level of commitment from them is unmatched. I always enjoyed watching our HM1’s grilling the juniors on medical knowledge.",
            "Play stupid game win stupid prize. Well played sir.",
            "This is funny and all but medical charts are not something to be fucked with. There is a list of approved abbreviations for a reason.",
            "You win, forever!!",
            "Perfectly malicious compliance ha! i enjoyed this thanks for posting",
            "For civilians, is a corpsman like a CNA and the nurse is an RN?",
            "I just learned the term \"blue falcon\" the other night while watching a video on Youtube... would it  be fair to say this nurse was one of those?",
            "Ex corpsman here, well played man.",
            "Ayyyy, it’s nice to see a cello Corpsman around here. \n\nI guess she’s never heard of *fuck around and find out* with a bunch of underpaid basically nurses with a heaping amount of sleep deprivation lmao.",
            "Reminds me of one of the first things I heard from my future roommate when I got to Oki: \"Don't fuck with the docs\".",
            "Lol that you are more worldly at 21. But good malicious compliance if it happened",
            "> I do realize that you are new.\n\nI love this! That one had to sting",
            "Can't out-Doc the Docs. Semper Fi.",
            "I am a nurse and find this hilarious.",
            "I just have to say this is my favorite story of all the ones I’ve read here.",
            "Why do I envision this new nurse as the type of butter bar who tries more than once to tell a Chief what to do.",
            "Crosspost to r/corpsmanup. I'm sure the rest of the boys over there will love it as well.",
            "Doubt.",
            "Way to go out of your way to potentially cause patient harm.",
            "So you compromised patient care to prove a point. Very classy.",
            "I LOVE this",
            "So. Just to be clear, you intentionally made medical records more difficult to read, to try to teach someone a lesson? Even if they’re all approved abbreviations, why use them unnecessarily? Fucking hope you never come near me or anyone I care about.",
            "should post this in Military stories and Millitious compliance.",
            "oh man! what happened next?!",
            "This is fucking beautiful",
            "I was a Corpsman as well (2000-2003) and I dont have any of these kinds of stories (my nurse was an LT whom I adored and got along fantastically with and miss to this day) but I've seen other horror stories. This made me chuckle.",
            "Damn! This is brutal",
            "Weaponized bibs, I love it!",
            "I love this. I just simply LOVE this!",
            "I love this so much. Well done.",
            "LOL Excellent",
            "This sounds like M*A*S*H lmao!!! This Isn't military Approved!!! Omg, that's awful!",
            "Hooyah!"
        ]
    },
    {
        "post_id": "usddj2",
        "author": "memon17",
        "title": "HOA won’t let us fly our modest pride flag: UPDATE",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/usddj2/hoa_wont_let_us_fly_our_modest_pride_flag_update/",
        "score": 14063,
        "num_comments": 652,
        "created_utc": 1652881733.0,
        "selftext": "I thought I would extend a quick update to y’all, a year after this small story blew up.\n[here’s the link from last year’s post.](https://www.reddit.com/r/MaliciousCompliance/comments/nq4eui/hoa_wont_let_us_fly_our_modest_pride_flag_so_we/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\nWe received a ton of support; with a side of online hate mail, but the positives really outshone the negatives. We haven’t gotten any negative feedback from the HOA (I’m still a director and sit on the board), and the neighbors who reached out were all supportive and very kind! No new news have come in that would prevent us from making this our yearly tradition, and we’re already setting up for this June. [This is how the house is looking now](https://imgur.com/gallery/SVxWGj3)\nWe got some national and international attention, which we appreciated, in the name of representation, a few very nice media articles, some goodies, and I even turned the experience it into some fun art work with the help of an amazing local artist. \nThank you all for your support, comments, and awards, that still trickle in every week or so! Never expected this would go viral! \nBe smart out there, fellow malicious compliers!",
        "permalink": "/r/MaliciousCompliance/comments/usddj2/hoa_wont_let_us_fly_our_modest_pride_flag_update/",
        "comments": [
            "We don't normally allow updates, but this is fine.\n\nThe purpose of this rule is to try to prevent people from sharing multi-part stories where one story would do. The original post feels to me like they reasonably expected that post to be the end of the story AND it feels like posting here lead to more story.",
            "Also, I know this isn’t actual malicious compliance on this post, but y’all made this the top post of this subreddit last year, so I thought you deserved an update.",
            "Let there be light!  Your house looks amazing.  It's a little early, but Happy Pride Month.",
            "as long as they enforce the rules fairly, you're free to ask them to change it",
            "I'm not in an HOA. A neighbor walked into my new place without knocking while we had contractors doing renovations, to tell me that the US Flag still flying from the previous owner was damaged and needed to come down.\n\nSo of course I put up a Ukraine flag shortly thereafter. Then we've been flying a Canadian marijuana flag since 4/20. We'll be switching to the Progress Pride flag between now and June.\n\nOwning a flagpole is great :)",
            "[deleted]",
            "There have got to be many ways to follow the rules and comply maliciously\n\nWhat immediately comes to mind\n\n-\trainbow rock gardens \n-\tpainted ornamental boulders\n-\ttemporary chalk coloured sidewalks\n-\tpatio lanterns\n-\tbird houses\n\nAdding\n-\tbird weathervane\n-\tdecorative wind spinner [link](https://m.media-amazon.com/images/I/71sNLAT00zL._AC_SL1500_.jpghttps://i.imgur.com/nj3xhjZ.jpg)",
            "Man that looks good. What kind of lights are you using? They're so bright.",
            "Back when I lived in the states there was this no flags rule. It was eventually ditched after some old folks keep complaining about it I don't remember but I think they were vets or their sons served the armed forces. Then we had all kind of flags, from countries to confederate, LGBT and a few that I guess were small countries.  \n\n\nThings took a turn for the worst when we had way more people complaining about the confederate flag, or some about the pride flag, others saying that the palestinian flag was just there to provoque, I swear I even saw a taiwanese flag in a puerto rican home and I'm just sure that it was to upset the several chinese people that moved to the neighborhood. \n\n  \nI moved out of Dallas some time after that, but last thing I hear was that they prohibited flags again except for 4th of July and only the Stars and Stripes flag for only that day.",
            "Amazing, keep up the good work!",
            "Your Malicious Compliance is wonderful and is making the world a better place. Thank you for the update.",
            "You're the shit, OP <3",
            "Enjoy your win!\n\nEverything about this is beautiful!",
            "Thank you for the update, and to the mods for allowing it!",
            "Beautiful :) your story makes me so happy",
            "I remember this and remember absolutely loving it. All my support and love to you and yours!\n\nI have every intent of having a pride flag hanging somewhere when(if) I own property one day",
            "May I suggest planting a flower bed like the pride flag too? Pinterest have some lovely versions! And your curtains could easily be pride flags too. And the trash can could use some painting too… and why not the mailbox: https://www.amazon.com/Wamika-Rainbow-Magnetic-MailWraps-Standard/dp/B07QG9VVZ4",
            "Fuck HOAs.",
            "I live in a pretty diverse neighbourhood. No HOA though.\nLots of flags, there's a Pirate flag, some political flags and lots of different sports team flags from all over the US.  Nobody cares, nobody complains.  It's wonderful. I'm gonna put up a peace sign flag.☮ Sorry for those of you that have to deal with an HOA.",
            "Wait i have seen this house. I KNOW WHERE IT IS! I don’t guess it breaks the reddit tradition of not revealing your user name since I don’t know you. CHEERS!",
            "HOAs should be banned",
            "My mom won't let me put cheese on my meatloaf, so this really hits home.",
            "This is so wholesome I love it!! I'm gonna show this to my cousin and see if she can pull any inspiration from it for her and her gf's apartment :)",
            "Meanwhile my HOA is trying to say that the concrete slabs that get walked on, leading from driveway to door are not considered a walkway, and I’m responsible for damages due to their shitty drainage.",
            "I'm just here to say Fuck all HOAs. They are bastions of defacto discrimination. Never move to an HOA neighborhood.",
            "To everyone who got tricked by the title of this post…\n\nThe HOA wasn’t letting anyone fly any flags except the USA flag.\n\nI got tricked too - don’t feel bad.",
            "Have you ever considered changing curtains to rainbow patterned ones? If they clash with the interior, you could always make the liner rainbow-flag pattern, while leaving the face fabric to match the decor of the room.",
            "Holy shit, your house looks incredible with those lights.",
            "Wow this is amazing!!",
            "To all the people that sent you hate mail. Fuck you.",
            "Beautiful colors!",
            "It's great that the HOA didn't balk at your lighting choice. I'm sure your HOA would have something to say if you did the house up like the [Equality House](https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Equality_House_-_Rainbow_House_Across_Street_from_Westboro_Baptist_Church%2C_Topeka%2C_Kansas_%2830224409157%29.jpg/1200px-Equality_House_-_Rainbow_House_Across_Street_from_Westboro_Baptist_Church%2C_Topeka%2C_Kansas_%2830224409157%29.jpg) in Kansas. It also prevents some neighbors from painting their houses to display the various hate groups they represent. Just picture having to look at a house that was solid red except for a swastika or a house painted to look like the confederate flag.\n\nHard to display hatred with colored lights.",
            "Your house looks amazing dude!",
            "That lighting is amazing. I’d leave it on all year. Maybe switch it up and do some crazy colors. \n\nHow did you do this? Can you change the pattern?",
            "Check out \"the hookup\" on YouTube\n\nHe will teach you how to build and install permanent lighting that is entirely DIY, open source and repairable.",
            "What happened to those trees! \nWhy are there no leaves?\n🥺🥺",
            "This is so beautiful! Reading that the good outshone the bad really brought a smile to my heart. And speaking of outshining, your mc is perfect! Thank you so much for sharing your update. ❤️",
            "Could you tell us the name of the current spotlights you are using?",
            "I glanced through the comments, but didn't see any mention of the stickers. Where can we get them?",
            "Not really into the rainbow color theme but that shit looks dope as fuck!",
            "https://wkfr.com/rainbow-house-moline-illinois/ this is my buddy's house.",
            "I’m a huge fan of rainbows in general; how was this done? :o",
            "Can I just mention how awesome your house looks...",
            "I don't know what I expected that picture to be, but it surpassed my expectations wildly, well done.",
            "I understand why they exist but HOAs are a plague.",
            "I am here to say that your light display is **beautiful**.\n\n(I also have concerns about light pollution, but credit is given where credit is deserved; this is a tasteful and very soothing scheme.)",
            "In re: the original post, I'd've flown the state and city/town flags just to piss off the HOA. /r/fuckHOA",
            "More cowbell!",
            "Your house looks so pretty! I would almost want to live next to you, except I hate HOAs and I can't afford a house.",
            "What? How could this be an update. I saw this already... Like every year this is posted or am I going mad?\n\nEdit: ah okay so just an update of an update. Get it, keep representing!",
            "Might I suggest you check out r/WLED",
            "I fucking hate HOAs.",
            "So the HOA (where you serve on the board) made a logical decision to eliminate all flags except the American flag to prevent possible disputes between neighbors flying thin blue line flags/black lives matter flags, and you decided you weren't getting enough attention, so you had to switch to colored lights? \n\nI mean *you're part of the group the made the decision*, yet you can't abide by the decision the group made? This doesn't really sound like malicious compliance to me, this sounds like you're a bit of an attention whore. It sounds like your HOA made a good-conscious effort to prevent any friction between neighbors, you were part of that decision, yet you can't even comply with that decision. \n\nIt's okay if everyone else has to take down their flag in the name of neighborly friendliness, but the rules don't apply to you, you have to let everyone know what you think at least one month a year. \n\nIt sounds to me like you crave external validation/attention, or why else would you post this update?",
            "Jesus. Imagine putting this much effort into announcing who you like to fuck.",
            "That's so gay",
            "Don’t live in an HOA they are worthless trash",
            "Less maliciouscompliance and more 'look at me!'. You sound like a terrible neighbor.",
            "Why do you care so much about telling us youre gay?",
            "What’s up with people fighting HOA rules…I don’t care how great your cause is, if you don’t want to abide by the rules to which you agreed, move out of your hoa.",
            "I looks very nice and I'm very supportive of the message, but does it get turned off at some point?  Like 10ish?  If my neighbour had xmas lights on all night, all year round, I'd be pretty pissed too.",
            "Imagine making your sexuality such a large part of your identity that you need to decorate your house like this. Top kek.",
            "What a waste of elictricity... Why didn't a flag cut it?",
            "This story warmed my heart 💕",
            "People conforming to the letter, but not the spirit, **of a request**.\n\nMalicious compliance is the act of intentionally inflicting harm by strictly **following orders** or rules\n\n\nNobody ordered or requested you to do any of that decoration.\n\n\"Also, I know this isn’t actual malicious compliance\"\n\nWhy the fuck even bother having subreddit rules if people posting dont give a fuck, and the modds also dont give a fuck.",
            "*gestures broadly at everything*",
            "[removed]",
            "Love it! This is pretty much how I plan to illuminate myself, even when it's not MC! I just love the colors and lights :)",
            "Great now the whole neighborhood hate you",
            "No one cares if you’re gay, no need to fly a flag, can we have straight flags?",
            "Oof what an eyesore. I bet that whoever had a problem with the flag wishes they could go back.",
            "I also want to say that I will not continue to reply to hateful comments, people calling me names, questioning my intentions (for either this post or the lights). I will continue to block those people. Not because I don’t respect their act of sharing their opinions, but because I don’t feel like having to engage with hateful people. Y’all can still see their comments, and I won’t report them, so please don’t consider my choice of ignoring them an act of censorship. \nFor everyone else showing support, or expressing their hate towards HOAs, thank you!",
            "Your home looks amazing! Well done OP. 🏳️‍🌈",
            "/r/BestOfRedditorUpdates",
            "The house looks amazing!",
            "Lotta HOA bootlickers up in here",
            "Why would you post the link for the pic that can be seen already in the post.\nHow could you do this to me",
            "Fuck your HOA for trampling on 1A rights in general (fuck HOAs entirely as well) - limiting display of non-commercial flags is explicitly illegal in California under Davis-Stirling act, you should see if there are similar laws in your state.",
            "It's only a year later, but it still looks absolutely sick! Nice.",
            "Are the lights programmable or fixed color? If the former, you could set them up on a timer to switch between pride flags.",
            "Such a pretty house.",
            "I would like to see the list of hatemail you received... But with a very generic response to each as if it was greeting card.\n\nSomething along the \"Thank you, for all your support over the years!\"\n\nJust really lay it on thick lol\n\nI might be a terrible person...\n\nThat might make an amazing subbreddit and a satisfying way of bringing the ridiculousness of shitty hateful people to light\n\nEdit. Sorry! I forgot to say i love your display! And its great to hear a story where you actually have some good people you want as neighbours! Hapoy for you!",
            "What is your flag in pride of?  It's not like Russian Pride or something controversial like that, is it?",
            "Very cool!  (But where are the pale pink and blue and white that are supposed to represent us all?) :-/",
            "I don't like HOAs but rules are rules (it appears your HOA at least isn't going crazy like some of them). I honestly think your home looks way more awesome this way.",
            "Happy Pride Month!",
            "Other then the enormous amount of light pollution is it fabulous.",
            "Love love love this! Screw your HOA.",
            "First off, your house looks great.  Second, personally, you flying a pride flag out front wouldn't even register as something to be offended by.\n\nBut I will say this.   Flags are a really slippery slope.  Look at what happened in Boston earlier this month.   The city was forced to fly a satanic flag over city hall because it started flying all different flags to be inclusive but denied a request from a satanic temple.  I don't know how I'd feel if nefarious groups took advantage and brought this ideal to extreme (which always seems to happen nowadays)\n\nI'll also say the idea of an HOA isn't really all that bad but they are often presided over by people who let the perceived power get to their heads.  At it's core, HOAs are there to preserve community standards and property value, by extension -- not bad things.",
            "Love it!!! Thanks for the idea. I might do this to my house for pride month to surprise my daughter.",
            "I always worry something bad is going to happen to people for doing something like this even though it’s not hurting anyone. True Crime Brain",
            "This makes my queer heart so happy!! Happy early pride month 🥺💜",
            "GAY GAY HOMOSEXUAL GAY. I love it.",
            "HOAs are communist.",
            "Home looks good. Come Halloween I'm hoping for M&Ms.",
            "Lemme guess, fascist symbology is allowed tho.",
            "And y’all make fun of mags hatters fir flying flags. Lmao. Hypocrites.",
            "r/Everythingrainbow\n\nYour home is beautiful, OP.",
            "Keep em on all year long (at night of course) lol 🌈",
            "This is indeed malicious compliance, but as a neighbor who values quiet and less light pollution, your show of \"support\" is possibly abusive to those just trying to sleep. YATA.",
            "Love this!!  Not only is it pretty, but it's a fun way to show some Pride!",
            "If you didn't want to follow rules, you shouldn't have bought a house in an HOA. Now you know why everyone says HOA's suck.",
            "Some times putting your flags away and just being a friend to others works better",
            "[deleted]",
            "So gorgeous!",
            "[deleted]",
            "You do you. But stupid to live in a HOA knowing people are going to want to control what you do.",
            "[removed]",
            "Beautiful",
            "Because don’t let her out.",
            "I remember this from last year!  This is awesome.",
            "I don’t get why freedom loving Americans submit themselves to the whims of HOAs. It’s your house, do whatever you want with it.",
            "Ohhhhh it’s beautiful!",
            "That’s very beautiful.",
            "I absolutely hate HOA's. Hate them and the people in them. I honestly think they are Vile and Immoral.",
            "Very cool. I think you have started a trend across the country!!!!!",
            "That looks way much better than the flag.",
            "Well people who use the HOA to do stupid shit like not being able to fly your flag are corrupt and the HOA is broken, a story related to your story: A veteran was forced to take down the Nation's flag (U.S) he took this case to court and I believe he won and still flies our star spangled banner, maybe you can win this case as well. I believe you will and I hope that piece of shit who wanted you to take down your flag gets a hefty fine",
            "HOA’s are often disgusting and can get fucked. House looks awesome glad you’re getting support",
            "looks awesome, way better than a flag!",
            "Good for you!!!",
            "Hell yea brother.",
            "The house looks great and I’m really happy your neighbors are supportive. This is one of my favorite stories from this sub.",
            "Is it just me or ... where's blue?",
            "Nicely done",
            "[removed]",
            "Soooo....what's a HOA",
            "It looks incredible!",
            "That's really cool looking. Nice work!",
            "House looks awesome. Well done!",
            "Fan-frickin tactic!",
            "Lmao fuck a HOA"
        ]
    },
    {
        "post_id": "u5d7kz",
        "author": "allnamesaretaken467",
        "title": "Put my food in this bag, right now!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/u5d7kz/put_my_food_in_this_bag_right_now/",
        "score": 14058,
        "num_comments": 308,
        "created_utc": 1650162174.0,
        "selftext": "About a decade ago, I was in a McDonald's. I had ordered and paid, and was just waiting for my food near the pick-up counter. In walked a man with a serious case of Main Character Syndrome. He placed his order, then stood directly against the pick-up counter. \n\nShortly after, my food came out (and yes, they called out my order number). He quickly snatched it up, then looked in the bag and noticed it wasn't the right food. Since there was no chance he could have made a mistake, he started to complain. Yelling that they gave him the wrong food, he insisted they put his food in the bag right away.\n\nWith the joy of someone who doesn't get paid enough for this shit, they gladly obliged. Taking the bag back, they quickly piled all his food right on top of mine. The toxic levels of smug emanating from the man dissipated as the employee turned and handed me the bag.\n\n\"I'm sorry, sir. This bag wasn't your order. It was his [mine]. Your order will be just a few more minutes, as we need to remake it.\"",
        "permalink": "/r/MaliciousCompliance/comments/u5d7kz/put_my_food_in_this_bag_right_now/",
        "comments": [
            "I’ll never understand people who are rude to workers. They’re just doing their job and they’re just as human as anyone else. \n\nSeeing someone disrespect workers is an *instant* turnoff for me.",
            "I never really understood being rude to people who're preparing your food.",
            "Main Character Syndrome - I love this.",
            "They shouldn't have remade it. He asked them to put it in your bag so clearly he wanted to give it to you. No reason for him to get a second order.",
            "We love retail workers who don’t give a shit",
            "You should always be nice to people handling your food. It costs no money to be a decent human being.",
            "[deleted]",
            "r/deliciouscompliance",
            "I worked in a quick serve restaurant. Occasionally we would run out of a product, and we let people know and gave them other options. Most people were ok with it, but there were always those idiots who lost their absolute shit. I was a manager and I would immediately intercede between the idiots and my people. I have never lived by the customer is always right so I basically would tell them to get a grip or get out. After one morning of this nonsense, I went to a Moes. I’m on my phone while waiting so I wasn’t paying a lot of attention until I heard a grown ass man shouting at the young girl at the beginning of the line. He storms out. I move up and this poor girl is trying not to cry and said: I just want you to know we don’t have rice right now.  I laughed and said: well I ran out of caramel earlier so no big deal. Just give me the rest.    I will never forget the deer in the headlight look she gave me. No one in the history of mankind needs to treat anyone like that, especially a child. That was 5 years ago and I’m still mad about it!",
            "I went to a Whataburger in Texas last year and ordered some food. When they called my number, some lady that was standing right beside the pick up area, grabbed my bag and started rummaging through it. She complained that it was the wrong order. I spoke up and said, \"That's because it's mine.\" Then I told the guy behind the counter to remake my order since I had no idea where that bitch has had her hands. She didn't like that I said that, and I didn't care. Got a fresh new order. Grabbed the bag before she could shove her hands in it.",
            "Please tell me they smiled at him while stating it was not his order...",
            "I had this about six months ago in the Mc Donald’s. There was a big queue as it was a national holiday. Almost everyone ordered from the order machines so it was just waiting. My order is up, they call my number, I go over… but before I can get there a man has taken the bag and thrown his ticket down (the wrong number of course!). My order was small enough but had a separate happy meal with it. I looked to the man who took it, “I think that’s mine sir” to which I got a smug look like “I don’t think so!”. So I handed my paper over and I told them they had just called my number and I think that man has taken mine, which they can for 90% confirm. They had to remake my part of the order and when it was finally ready I walked out with the apologies of the staff (of course I told them it was absolutely not their fault). Just as I am leaving out the door I see Mr-steals-my-food with a raspberry face. I don’t know if I said it loud enough but my “oh? Took the wrong bag?” Sounded much louder in my head. I really hope they treated him how he deserved while they prepared his bags again. May your fries be always soggy and your burgers always cold sir!!",
            "Hope you enjoyed the extra food 🍟🍔🍪🥤",
            "When I worked my first job, I would sometimes go pick up lunch for the shift. Typically it was McDonald's, and typically this happened during the lunch rush. I never asked any of my coworkers for specific orders because I wanted to keep the order at the restaurant simple. I'd just inform everyone I was going to pick up cheeseburgers, my treat. \n\nSo I get to McDonald's and I go inside. I don't see any sense in taking up the drive through when I'm ordering enough burgers to feed 5 teens. Wait my turn in line, get to the front, and order saying \"could I please get 16 mcdoubles? No rush, I know you're busy and I have time.\" Then I'd go stand away from the high traffic areas and wait for my order to be called. \n\nThe staff seemed genuinely appreciative. They had to deal with a lot of individuals like the hero in this story. And often they'd give me the benefits. Someone ordered 2 big macs, but for whatever reason decide they only want one? I got a free big Mac. Gentleman ordered an iced coffee then complains theres ice in his coffee? I got a free iced coffee. \n\nWhen my order was ready, I'd always take the bag with a smile and a \"thanks so much, have a great day.\" Its not hard to be decent to service workers and ill never understand why some people have such a hard time with it.",
            "Main Character Syndrome! I’ve never heard it before and I love it!",
            "Anyone that works with the public eats shit for a living. People are very fast to complain, but rarely does someone take 2 minutes and compliment an employee anywhere.\n\nTake the time to ask for a supervisor, it really does make a difference. Don't just complain when you don't get your own way, if someone is surviving working with the nasty public, demand a supervisor... for a compliment.\n\nMatter of fact, if you are going to complain to someone, fine. Do it. But find two others somewhere that you can compliment. If you can't think of anyone to compliment, it's you and not everyone around you.",
            "This is glorius",
            "I imagine the other guy posting this exact story over at FML, then getting shit on.",
            "Did you enjoy your free food?",
            "The amount of times I’ve had to take control of the drive thru headset while serving front counter because all I can hear is people screaming vile abuse at the junior who was manning the station. I am obnoxiously polite to people when they do that to the point that they get frustrated I’m not reacting the way they want me to.\n\n\nAnd people, friendly word from someone who has worked a drive through: NEVER beep your horn while waiting at the box, you could severely injure someone if they are using a sharp object",
            "I deadass can’t think of a proper response as to how hilarious this must have been.",
            "I'm the one that goes to order here, walk away from the pickup here and wait for my order number to be called. Unlike other people that after order, stand in front of the pickup place being in the way of other customers. It irritates me, immensely.",
            "> a man with a serious case of Main Character Syndrome\n\n🤣 I haven't heard that one before.",
            "Absolutely love this!!!",
            "I use the aproach of being extra nice to staff at restaraunts, calling them by first name when appropriate and if there's a problem letting them know at the time so they can correct it. Everbody needs to learn to chill out.",
            "If they're happy to remake it, he's fucked. Never disrespect the people handling your food.",
            "r/deliciouscompliance",
            "Should have finished with, \"Will that be all sir, or would you like to place an order?\" (since he already said to put his food in the other customers bag, he should need to pay for another order)",
            "The only time I was ever rude to a worker was at McDonald's. Fun fact about Alaska. In Fairbanks the army is seen more as an occupying force than an economic benefit. So, basically they wouldn't serve me and the guy I was having lunch with at the time. We went in made our order and paid then waited for a half an hour while people came in, made their orders and left with them. Then when it finally came out the burger and fries were cold and they decided when I said I wanted mustard pickle only on the damn thing they decided I wanted everything but. So yeah I don't feel bad about giving the manager an earful.",
            "Main character syndrome. I like that. I think I have added something new to my daily vocabulary. Than you for the share & something else to make me chuckle.",
            "We'll have to remake yours, so that we can spit in it.",
            "HA! I worked at McDonald's for three years, having quit this past August. I feel WAY too good about how the workers handled this.",
            "I was just thinking \"McDonalds didn't call order numbers in the '90s\", and then I realized that a decade ago was 2012",
            "I was in a pharmacy at one time. They were running behind and a lot of people were frustrated at the poor clerk. When it was my turn to pick up medicine, I looked the clerk in the eye and said, “You’re doing a terrific job. You professionalism shows clearly.” Then I left.",
            "🤣🤣🤣🤣",
            "Awesome 👍😎",
            "This might be the best one yet.",
            "Main Character Syndrome. If LOL had not yet been invented, that would have done it!",
            "Bwa ha ha ha ha! This is why you don't piss off people that have it in their head that they don't have much to lose. Plus the fact that they didn't screw him out of his food (they were remaking it, after all) means he has absolutely nothing to complain about.",
            "(smirk)",
            "My manager regularly comes downstairs to the lunchroom saying things like \"Yuck, look at all this peasant  food\" and will often refer to us as \"peasants\" and tells us inflation is good because we will sacrifice longer hours and time, for less pay now. Unless we want to quit our jobs, we have to put up with it and he knows it.",
            "Dear u/allnamesaretaken467\n\nI officially love the term 'Main Character Syndrome'!  I am getting old so I'll forget to use it often as it deserves but I'm still stealing this.\n\nThanks!  :D",
            "Having worked at McDonalds. 9 times out of 10 the wrong order thing is because people take the wrong bag. We have order numbers and repeat the order to make sure its right out the window. And people will just say “yep thats my food” or w/e after not actually listening to the order. Like you got the wrong order because you cant listen",
            "Whats your favorite ability combo in the game?",
            "He’s just salty his wife died and he can no longer beat her and make her live in fear",
            "I am a little confused as to what actually happened in this story. The worker piled his food on top of your food (crushing your food in the process) in the bag, but his food wasn't ready, so it wasn't there to be put in the bag? Am I missing something?",
            "Was this in the NYC area?",
            "[removed]",
            "[removed]",
            "You lost me when you said it was food.",
            "Tell your current boss that you enjoy working for him (even if that’s untrue) but have been offered another position with similar hours but a higher hourly rate. Tell him you’d like to stay but it’s an offer too hard to refuse. However if he matches or exceeds the competitions offer you will stay. If he says no then you win anyway because you’re going to a higher paying job.",
            "bad guys gets old",
            "I wanna hug you for sharing this wonderful feel-good story!",
            "Hopefully they charged him twice",
            "Omg!  That's fantastic!",
            "So, you got free food at McDonald's cost? Or would the man be charged for it?",
            "🤣😂😂🤣🤣",
            "That was so relaxing to read at the end. Lol",
            "I didn't know there were any McDonald's where you get an order number. Every McDonald's I've been to they just call out what the order consists of when it's finished"
        ]
    }
]