[
    {
        "post_id": "wshldk",
        "author": "Aero-the-Observer",
        "title": "Want me to unload my own trailer? Ok, I needed a vacation anyway.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wshldk/want_me_to_unload_my_own_trailer_ok_i_needed_a/",
        "score": 14041,
        "num_comments": 468,
        "created_utc": 1660924785.0,
        "selftext": "So I was a trucker for a while, and that comes with plenty of stories of crazy things in so many places. One of my favorite stories, however, comes from a piece of malicious compliance that came together just perfectly.\n\nThe setup:\n\nI tend to be a bit on the lazy side when I can get away with it, and I searched for quite some time to find a company that would keep me far away from unloading the trailers myself. I found a good one that had a 95% drop and hook rate (Drop off a trailer full of goods, then grab a new one that's either loaded or to take to the next pickup). 4.9% of them are either handled by the receiving dock or by lumpers (dockworkers hired by warehouse companies specifically to unload trucks). That .1% is a list of places that just want to watch you work, or be convinced that you really shouldn't operate their lifts.\n\nIn my contract, I saw that there was a place where your hourly rate for unloading was stated. Not for the hours that you were sitting and waiting to be unloaded but for when you were the one unloading your own trailer. I also saw that the contract allowed for alterations to be made to the price of this service to be charged to the customer. As a joke I put in not one, but two extra zeroes. $1500 an hour for unloading a trailer? Should deter most people. Most people saw that, got a good laugh, then pulled in someone to unload for me.\n\nThe event:\n\nMost people, like I said, were smart. This run was set to arrive at 0300 to a certain clothing store in the mall, let's call 'em I.B. Nickeled. I'd been to this store a few times before and it was always the same manager, Mr. Dime, receiving me, and it was always the same runaround. If I wanted to get unloaded I had to wait for someone to get there, then I'd have to sit and wait while the poor kid back there got the load off, then I'd have to wait for traffic to ease up to get out since it was always almost 1030 by the time I finally left, leaving me with only a couple of hours left on my clock to get to a truck stop for the day.\n\nI got there and, yep, Mr. Dime had come in to accept the load. It was always hard to be smart at 0300, and I can only imagine that was part of Mr. Dime's usual runaround. This time was a bit different for a few reasons. One, he smelled like there was a bit of an herbal calming remedy about him to settle his nerves for the night. Two, he said that he was completely understaffed and there was no one around to unload me, so I'd have to do it myself. Three, I couldn't stay to my usual time because he had to leave before 0500.\n\nTo be fair to him, I did try and say, \"sure, but my contract says-\"\n\n\"I don't give a damn what your contract states! I don't have anyone in until the store opens, and I've got an appointment that's more important than some trucker's contract! Just unload it yourself!\"\n\nI considered it for a moment and went back up to my truck to get my tablet (This was in 2019 before the virus and the company had just swapped over to tablets for certain things, like signing off on expenses or getting permissions.) Mr. Dime was fuming when I came back and handed him the tablet. \"Just read through and sign with your finger.\"\n\nHe didn't read through. I had twenty pallets at one and a half thousand pounds each. The only available tool to unload was a manual pallet jack. I started my work clock and began unloading at 0315. At 0500 Mr. Dime looks on in satisfaction to see me about three quarters of the way through as he's out the door. At 0515, Mr. Dime's replacement, Mr. Quarter of the day shift, comes running in with his face white as a sheet to see me taking off the fourth to last pallet.\n\n\"Please tell me that I'm reading this wrong,\" he pled fruitlessly.\n\n\"I wish I could,\" I lied, knowing that Mr. Dime was about to be up a muddy creek with a spoon. \"I even tried telling Mr. Dime what he was getting into, but he just skimmed and signed.\"\n\nHe slumped. \"Wait here. I need to call my district manager.\"\n\n\"Better be quick. I want to be out of this lot by 0630 to beat the morning rush and get a good breakfast.\"\n\nHe ran back and I continued unloading. When I finally got the last pallet off at 0550, I turned off my time clock as the district manager came in, We'll call him Mr. Dollar just to keep consistent, followed both by Mr. Quarter who was looking somewhat relieved and by Mr. Dime who was somewhere between terrified and furious.\n\n\"You're Mr. Aero?\" Mr. Dollar asked, holding a printout and looking to it for the name.\n\n\"That's me,\" I agreed. \"I take it they sent over the contract Mr. Dime signed?\"\n\n\"Yes, and that's just it. Mr. Dime is accusing you of forging his signature on this since there's no way he'd sign off on a multi-thousand dollar contract just to unload a trailer. Especially since he claims you insisted on unloading it yourself.\"\n\nI whistled. \"That's a heck of an accusation. Hey, is that CCTV I see up in that corner over there?\" I asked, knowing full well that the entire loading dock was covered by a slew of cameras. The one I pointed out was positioned just right to catch the whole conversation at the door.\n\n\"Mr. Quarter, get the footage,\" Mr. Dollar said. \"We don't have audio but we do have visual on them.\" Mr. Dime lost his fury and now just looked petrified.\n\nThe Fallout:\n\nOne review later and I was grinning like a loon back to my truck. I called my manager, booked some home time, and walked away with enough money to last to the end of the month. The next time I went into that IB Nickeled there was a new, much more sensible manager who always had a man on staff to unload the trucks.\n\n&#x200B;\n\nEdits: Some typos. And to clarify a few things:\n\n1: Yes, I milked it a bit, though not as much as some people might think. Like I said, I was regularly there from 0300 to 1030 at the latest. Throw on top of that the fact that I've never been the healthiest of individuals and it took me that long to keep from hurting myself. This was during the summer in SoCal, and even at night it was still \\~90f outside, hotter in the trailer without any air conditioning. A fat man with no AC is going to take all the time he wants.\n\n2: Why didn't Mr. Dime do any of this himself and why did he lie? Truckers tend to get the short end of the stick, even when we're regulars to a place. This was the fifth or sixth time I'd been there spread out over the course of four months or so, so I was familiar enough that I was recognized at the dock but not so much that they really cared to keep track of it. The manager figured he could probably get away with shafting me since he claimed I didn't like how long I was waiting. I feel like he's made other truckers get to that point but none of them had hourly rates like mine on their contract. He's just one of many that thought he could get away with blaming it on 'that damn trucker' when it went wrong for him.\n\n3: What happened while we watched the video was pretty anticlimactic. The recording was on Mr. Quarter's phone when he came back and was pretty low quality, but you could still make out that I argued with him about unloading for a minute before coming back and he did indeed sign it.  Mr. Dollar said, \"You can go, Aero. Mr. Dime, go wait in the office. Now.\" I got going while the going was good.",
        "permalink": "/r/MaliciousCompliance/comments/wshldk/want_me_to_unload_my_own_trailer_ok_i_needed_a/",
        "comments": [
            "If you fuck something up, it can be fixed (most times) and can be used as a learning experience... You **lie** about fucking up? Well now that's a whole new issue in itself. Forget whatever it was that was messed up.\n\nHad a technician at my current job essentially cause $8k in direct costs and costed the customer upwards of $70k. He was brought to a meeting with managers etc, the problem was found and a procedure made for it.\n\nHad another guy lie about having done an oil change and brakes during a general service, and he was let go. It like parents always say, tell me and I'll be upset. Lie to me and I'll be angry",
            "And this, kids, is why you don't double down on your error when you make a mistake.\n\nGenuine mistakes can be explained away with maybe a warning.\n\nOutright lying on top of the mistake easily escalates it to gross neglegence and is easily a friable offense.\n\nGood MC with extra petrol needlessly poured on top!",
            "I'd have refused to lump for $15 an hour too.\n\nI'm not a trucker, but I know plenty. $15/hr is insulting, considering what the average hourly is for in-scope work, let alone doing something much more physical and demanding than the in-scope work.\n\nI'm a firm believer that out-of-scope work that has a specific fee needs to be set at a rate that discourages the behavior, not encourage it, since $15/hr is minimum wage, and you're much more valuable doing your actual job.\n\nI have a background as a HD mechanic, but now do piecework technical Install. When we're sitting on site with our thumb up our rear, and can't do our job, we're losing money. So the company charges accordingly. $100/hr charged for standby to the client, at the standard labour rate division (roughly 50/50 split between me and the company).",
            "((Just cause it wasn't up there and I was curious))  \n3.15 -> 5.50 = 2.58hrs @ 1500 ph = $3870.\n\nThat is a nice chunk of change to be walking away with. Mr Penny made you into Mr 4K. I hope whatever appointment he had was worth it lol.",
            "I work in logistics. My favorite phrase is \"I don't know, I'm just a stupid truck driver\"...which is always said with a smirk and a shrug.\n\nBut I know the truth.\n\nI promise to keep your secret, as long as you promise to keep my \"dumb CSR\" secret!",
            "So, I. B. Nickeled became Pay Me Plenty...",
            "Nice MC. You made out like a bandit. I would have loved to hear the private conversation between Dollar and Dime after you left",
            "It was always fun when you do stuff like that.\n\nWhen I was a driver for a reefer company, I ended up doing a lot of unloading my own because the lumpers would get in the range of $500-700 but we would get like $100. So I started a lumping llc with business licenses and forklift certifications is all the states we regularly needed to pay for lumping. Get the quote, send the request, get the funds, lump myself.\n\nOr when delayed at the receiver over long holiday weekend and get paid hourly because you arrived on time and they closed. Literally a paid vacation",
            "What a prick.\n\nHow hard is it for folks to own up to their mistakes. Dude fucked up, rather than say to his boss- I screwed up he accuses you of lying? Unbelievable. Some people just have no integrity.",
            "Mr Dime got drawn and quartered.",
            "Eat your crow while it is warm and tender or you may be forced to eat it cold and tough.\n\nIn the days where everyone owns a pocket sized recording studio, cover your own ass.",
            "Oh man, I love the names!",
            "As an ex-trucker myself, f\\*ck having to unload your truck. I get paid to drive. Having to unload makes me lose money.",
            "Years ago I used to be the nightfill boss of a hardware store. \n\nA guy in the trades department asked me to put something right up in topstock for them. I was required to do the task as my machine, a walkiestacker (like a cross between a forklift and an electric pallet jack) was able to get in much closer to this particular rack and the item being put up there was quite expensive. \n\nHe told me the position was prepared with gluts and braces for the racks and ready to receive the pallet. \n\nIt wasn't. \n\nI managed to save the load with the tips of the fork tines of the walkiestacker without damaging anything and my spotter/witness said it was the most amazing bit of maneuvering they'd ever seen. \n\nGet to the office, sort the paperwork for the morning shift to review and process. Camera footage isn't available for the upper corner of the trade department so it's going off witness accounts. Just me and my spotter with all other nightfill staff in other parts of the store and unable to comment. \n\nThe guy from trades lies and told them he never told me to put it up there. Only he wrote a note and left it on my desk. \n\nShowed the bosses the note. \n\nHe then claimed he never told me the area was prepared and that I should have checked before placing the pallet. \n\nNormally, very true. However this was in his department where I was almost never working as they had their own fillers, drivers and machines and no less than three people, two his own staff, saw him tell me it was all sorted and I just needed to lift and place with my machine to ensure a safe lift. \n\n\nHe got fired.",
            "Almost a blessing that those other managers arrived and got to cry through the pain, rather than having to justify it after the fact.",
            "Whenever I mess up at work I always call my boss and say “ hey I fucked up, this is what happened and this is what I’m doing about it” I usually have no issues afterwards.",
            "Finally some good fucking MC.",
            "I liked your naming convention here. Makes it easy to tell ranks of the employees without giving them real names.",
            "Two things:\n\n1. I had no idea you guys sometimes had to unload your own trucks. That's not driving. Asking someone to do a bunch of manual labor after trying to stay awake and alert for hours and hours of highway driving, then get back in the truck and go somewhere to grab a bite and catch some sleep is unreasonable. There should always be people available to unload, even if that means that Mr. Dime is doing it himself. In fact, I see no reason why he wouldn't. I would.\n\n2. You handled it perfectly. You set your price and they were dumb enough to take it. You even warned them. \n\nGood job.",
            "Whenever someone asks you to sign or email your demand to them, best to take a step back and check what hell you're about to unleash. Time tested advice that some people just don't understand.",
            "No idea why he didn't he just unload it himself.",
            "We have a pretty simple rule at work: \"We don't fuck up the same way twice\".  It acknowledges that mistakes happen but we expect to learn from them.",
            "I love the MC but, as someone who regularly unloads 1 ton and up wine and grocery pallets with a manual jack, how in the HELL did 20 pallets take you 3 hours!?",
            "Pretty certain I worked for one of these stores on the morning crew. I find it wild any of them had one of the workers unload the truck. It was always my manager doing it because you needed to have specific training. That store sounds like a mess.",
            "This is the way.",
            "Bravo, you! Beautiful MC, this.",
            "Pretty please can you tell me more about what happened while you all were watching the tapes and what Mr Dime did during it and how many daggers Mr Dollar stared at him?",
            "Ah haha. \"A lack of planning on your part does not constitute an emergency on mine.\"",
            "I worked in receiving for 14 years, was in charge of getting trucks unloaded for the last 9 of those. Most of the truck drivers were great, although you would always get a few bads ones now and then. Most of them would tell me how that we unloaded them faster than any other company they delivered to. I always said I knew they wanted to get out of there  and get home, so there was no reason to make them wait longer than necessary.\n\nAfter reading this, I can see why they were impressed with our unload times. I can't believe it took their workers that long to unload you. Depending on what the product wss, we would have had you unloaded and back on the road in about 15 - 30 minutes. That includes the time it would take to unload the pallets and verify everything against the packing list. If it was one of the many times that I was short handed and had to do it all myself, maybe an extra 10 - 15 minutes.\n\nI will never understand people that lie when they know there is proof they are not telling the truth. Those few bad truck drivers I mentioned earlier, I had more than once where they would tell their dispatch that we refused to unload them or they sat for hours waiting to be unloaded. Security logs the time in and time out for each load, with the driver signing each. So we had a driver that said we took over 3 hours to unload him even though his own signature on the logs shows he was only there for 30 minutes.\n\nAnother driver told his dispatch he got there at 7:00 PM, but we refused to unload him and he had to wait for first shift to get there at 6:00 AM to get unloaded (we did not have a third shift). The next day, there were emails going back and forth all day wanting to know why we had refused to unload him. No one had an answer until I started my shift. A quick call to ask security to check their logs showed that he had actually signed in at 11:30 PM, not 7:00 AM; a full hour after our cutoff time.",
            "This is the juiciest, most-satisfying MC I've seen in some time. Thank you!",
            "Man, it took me way too long to figure out what \"IB Nickled\" was.\n\nI should have figured it out at \"Mr. Dollar just to keep consistent\" but it didn't hit me until the last time you said \"IB Nickled\".",
            "LOL, love it... the audacity of Mr Dime with lying.  Glad he got fired!",
            "People in logistics like to lie, a lot.",
            "Drove truck for a family outfit in MN, if you messed up just walk up to the boss and tell him, I fucked up. He might yell at you if it was serious enough but most times he just wanted to know. I caused $70k in damage in an accident.\n\nEnd of year I asked him what it cost,he told me,smiled and said don't do that again. Roger that.",
            "This is magnificent!!!",
            "There is nothing about this story that does not have my respect and admiration, well done sir 👏",
            "20 pallets at 1.5 tons is impossible. You would have been way over your axle weights and overall weight. The max a load can usually weigh is 43-45k lbs depending on weight of truck/trailer if you want to be within legal weight limits.",
            "Reminds me of a late and unlamented driving job; today a whole cadre were picking up maybe fifty pensioners and dropping them off in a small bus depot with one street entrance only. I got there first, delivered the passengers, then crucially DROVE BACK OUT ONTO THE STREET before unpacking their bags into the waiting busses. Second up was a right nob end I'll call Mr Cool. Mr Cool drove on in, his passengers got out and he started going to the boot for their bags. I suggested he maybe wanted to DRIVE BACK OUT ONTO THE STREET but he totally knew better and wasn't really good about it either. I helped him carry their bags from his car to the bus. So, all finished and he went about his day? WRONG! Another ten cars proceeded to pull into the small depot through the only entrance, nose to tail, disgorging octogenarians and drivers struggling to help carry their bags. I ran back and forth helping the other drivers and thus speeding up the total process, Mr Cool did not. Then I left on my next job by the simple expediency of walking out to the street park and driving off, I'd estimate he was there for another hour until the unimaginably slow elderly people and luggage was out of that last car in and the gate unblocked. \n\nAnd the really funny thing? This was milk money for me, he was a career driver. Like, he should have been telling me the short cuts, not the other way 'round. And certainly not throwing it back in my face.",
            "I think if anyone was in your situation knowing full well what was coming I think they too would take a bit of extra time",
            "I supervise a warehouse currently and used to be an OTR trucker in my younger days. In my contract I had a stipend for hiring lumpers. I could bring my own along or hire any schnook standing on the street to unload the trailer. Or I could do it myself and keep the stipend. If the load was simple pallets that I could pull off with a jack or forklift then I usually did it myself. A full 53' trailer holds a maximum of 30 pallets sideways, 28 pinwheeled, or 26 straight so it was no big deal. But if the trailer was a floor load where you'd have to pick up each item by hand, Fuuuuck that. I paid a dock worker or one of the many illegal immigrants lined up looking for lumper work outside the facilities to do that shit.",
            "r/antiwork would love this",
            "IB Nickeled, huh? :D",
            "Thanks for telling that story. I got such a warm feeling when I read about the cameras.",
            "What breakfast did you get?",
            "I, F mid30s at the time,  used to work in a distribution center. I would routinely have 1k lb skids. Keep in mind that most skids are 8 ft tall (7 ft for Walmart), so even if they weren't that heavy, you can't move too quickly with a manual pallet jack. Dumping a skid Most Sincerely Sucks.",
            ">he smelled like there was a bit of an herbal calming remedy about him\n\nLOL, thanks!",
            "You know, sometimes  people need to just let the story be told.",
            "This has to got to be one of the best things I have read today and I read a lotttt 😂",
            "This is epic. Thanks for sharing!",
            "A lazy trucker?! No way. Grats",
            "> I.B. Nickeled\n\nThis sounds like something a pirate would say. \n\nArr, I b nickeled",
            "I unload 40k lbs of groceries everyday. I'm an independent. I charge the broker for the lumper fee, then I pay me to lump it.",
            "The best part about this post is most definitely the nicknames.",
            "I honestly recommend y’all read this in a distinct voice. I chose Kano, from Mortal Kombat. Made it much funnier",
            "Read your edit about temperatures and I couldn't deal with that. I've moved stacks of pallets from in the warehouse to the yard with a pallet jack before. It was a winter night in Britain and even then I was sweating my my third stack and getting rid of my hoodie. The security guy watching the shutter door looked at me like I was bloody mental, but all he had to do was just stand there in a jacket and lock up once I was done.",
            "I wonder what the enforceable limit is for a contract like that. If your hourly rate was $1 billion, presumably this wouldn't actually mean his company would be instantly bankrupted, but where is the line drawn?",
            "I as a union steward at my last job and we had a kid get caught via random drug testing.  He swore up and down that he didn't smoke marijuana, said he was at a party, and may have inhaled some secondhand smoke.  So he has to go to counseling and can't return until he's clean.\n\nHe returns in a couple of weeks and for some idiotic reason admits that, yes he did smoke the weed.\n\nSo now the company knows that he smokes weed and that he also lied to their faces... SMH!",
            "I feel like this is missing \"he was also drunk when he signed\" though I guess that might have invalidated the contract?",
            "Worked in retail for 10 years.\n\nMet lots of Mr. Dimes. \n\nThey always think they know better than everyone else until they find out why you said not to do it that way.",
            "How does it take seven hours for them to unload your truck in the usual way?",
            "Is the new guy Mr. JFK 50 cent coin or Mr. Sacagawea dollar coin?",
            "Who signs for a load before its unloaded.... that's like wiping your ass before you poo.  you could have done any number of things once dime man signed for it.... smh",
            "This is part of the reason why when I’m training new associates at my job, I make sure to mention that they won’t get in trouble for causing damage to our inventory. But they will get in trouble or worse for lying or hiding it. \n\nWe’ve all damaged some inventory or scraped them up to a degree- what mattered is that we’re up front about it and take responsibility for it.",
            "This story needs to be vetted. I drove OTR for twenty years with many different companies and the details in this story don't ring true.",
            "You're not a bad person but you're not a good person too, you seems like a person who have a lot of pain bottle up.",
            "A pallet of clothing wouldn't weight 1.5 tones. This story is made up.",
            "[deleted]",
            "we unload 16-24 pallets weighing 1k-1.2k with manual jacks weekly.  No problems. You are lazy af bro.  I would never let you stay on my crew for more than a few minutes.",
            "I mean, Mr. Dime isn't very smart, but you're kind of a douchey prick for doing that IMHO.",
            "Ha ha! Money talks! Especially lots of green!",
            "Karma…it’s a b****🤣",
            "[deleted]"
        ]
    },
    {
        "post_id": "eybm16",
        "author": "feeshta",
        "title": "Dealt with a Lying Landlord by Threatening to Run Up Their Bills.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/eybm16/dealt_with_a_lying_landlord_by_threatening_to_run/",
        "score": 14031,
        "num_comments": 338,
        "created_utc": 1580755304.0,
        "selftext": "I had a landlord in the past who slipped a 90 day notice requirement into the rental contract after I had signed it.  I was house hunting, so at the end of my lease I asked to go to a month to month lease to make it easier to leave when the time came.  Landlord and I agreed on a higher monthly price to compensate them for the lack of security, and I signed the contract at the office of a business they also owned downstairs.  Landlord wasn't actually present, but one of their employees handled it.  So, contract is signed and they go to make me a copy for my records, but are \"having an issue with the copier\".  After a few minutes they ask if they can text me when they get it to work.  I naively agree, and head upstairs.  30 minutes or so later, they text me saying they got the copier to work, and I come pick up my \"copy\".  I didn't think to double check everything at the time.\n\n&#x200B;\n\nSo, for the next few months I just pay my monthly rent while I look for a home.  Finally found the right place, and the closing date was about 4 weeks out, so I immediately notified my landlord that I would be leaving on said date.  Landlord responds that it's nice I found a home, but I would be responsible for the next 2 months rent after that as well due to the 90 day notification requirement in the contract.  I'm totally confused, so I go check my copy of the contract, and sure enough, there is a stipulation in there about that.  I also notice that my initials from the top and bottom of each page, verifying that I have read that page, have somehow mysteriously shifted to being doubled up at the top of the page after this stipulation, with none on the bottom of that actual page.  This was because they had inserted 2 lines of text detailing the 90 day reporting requirement, after I had already signed the paperwork.  They didn't notice the formatting error it created, which was a dead giveaway of what was going on.\n\n&#x200B;\n\nI inform the landlord of this, and notify him that this is not a legally binding contract due to this issue, and state that I will not be paying any further rent beyond this month, and expect my deposit back without penalty.  Unfortunately he persists with stating that this is a legally binding contract, and he will pursue it in court in addition to withholding my deposit if I fail to pay, blah blah blah...  I know I am legally in the right, but I don't want to have to deal with courts to settle it as that takes forever, so I come up with an alternative plan.\n\n&#x200B;\n\nThe one thing he hadn't thought about was the fact that the contract included all utilities, as the unit didn't have separate meters, and did not have any language forbidding excessive use of them.  It just so happened to be a particularly cold winter, so I informed my landlord that if he wanted to persist with his demands, I would be inclined to leave all of the windows open, crank the heat as high as it would go, open the refrigerator door, run the water 24/7, etc, and if he entered the apartment without my permission to turn any of these items off, I would report him to the police.\n\n&#x200B;\n\nI got confirmation that he would not pursue the extra month's rent or security deposit within 20 minutes.  :)\n\n&#x200B;\n\nEdit:  Just so everyone knows how the story ended, this happened around December of 2016 if I remember correctly, and I did get my security deposit back, etc.  Didn't pursue legal option because I didn't think it would end up being worth the time and trouble, though I understand the sentiment.",
        "permalink": "/r/MaliciousCompliance/comments/eybm16/dealt_with_a_lying_landlord_by_threatening_to_run/",
        "comments": [
            "Massive fraud attempt fixed, well done. Future reference, take a photo of each page next time..",
            "That's great! I've had issues in the past with a landlord, I love that you called him on his dishonesty.",
            "Had a landlord call me while I was in class to come home because he had entered the front door and my dog had backed him up against the door and would not let him move. At all. I let him know that it was finals week, he showed up unannounced and I could not leave but would be home as soon as class let out. I walked slooowwww home. When I walked in the back door, sure enough my dog was sitting in front of him with his back to the door. If he so much as twitched his finger she started growling and showing teeth. He tried to say that I would have to cage the dog as it was his house and he should be able to come in whenever he needed to. I let him know that he must provide 48 hours notice before entering the property and the next time I would take it to court and win. Bought that dog a fillet that night. Good girl!",
            "My last apartment was an individually owned unit managed by a crummy management company, inside a highrise that also had crummy management of its own. There was water damage from the unit above that caused our kitchen to be torn out. We eventually learned that it would be months before the kitchen would be replaced (fault of the building, not the company we were renting from). We complained multiple times to the management company we rented from that we shouldn't have to pay full rent because we don't have full use of the apartment. They kept denying it saying it's not their fault (which was true), but shitty because it definitely wasn't our fault and it should be the owner not the renter who suffers in a case like that.\n\n After a month of back and forth, we made an official complaint to the city, an inspector came out and said that our unit wasn't up to code, and that our landlord was going to be fined something absurd like $200 a day until it was fixed. Our landlord started BEGGING us to leave as soon as possible, but we had a lease so they couldn't force us to. They ended up paying us like $6k and fully refunding all deposits to get us to leave ASAP mid month. \n\nSucks to suck for them.",
            "I might still consider suing him for the full value of the contract for fraud, but that's me.",
            "Love this\n\nI had a past roommate try screw me. She decided she wanted to leave 7 months into our 1 year lease. Said she cover the fees, but then backed out a few days later. Lucky for me she moved in a month before me and the landlord said I'd get a copy to sign once I move in. Well, everyone forgot that, and so I never had signed the lease. My name was on it, but nothing legally official. Once I remembered that and informed her she was the legal renter, not me, she backed off pretty quickly",
            "Did similar to this when in college...landlord was refusing to clear snow / ice on the path to the parking lot and suggested we walk around the building, down the road, and into the parking lot a different way (1 minute versus over 5 minutes plus a jaunt down a public road with no sidewalks).  Told landlord we were leaving for winter break with the windows open and the heat cranked if it wasn't addressed....is was fixed the next day.",
            "You definitely should sue. He is most likely doing this to other tennants, and now knows to fix his formatting errors",
            "Tbh, you could just as easily say you'll turn the heat off and let the pipes burst too. A lot of leases have clauses to specifically keep your heat up so they don't. They'll sometimes lower rent so they can fill a unit they're heating anyway, too (though I doubt that in places like new york)",
            "Beautiful",
            "Always sign/initial in the middle of every page of a document. Never at the top/bottom. Do it even on pages with a signature line. \n\nI've done this for decades. I got screwed once and never again. \n\nI have had two companies (one an employer and one a lender) tell me that I can't do so and I said if I can't, I am not signing. They still balked and I said goodbye. \n\nIf they don't let you, don't trust them.",
            "One fix to \"problems\" like this is to use your phone to take pictures of the documents.  Someone says they cant make a copy of something, whip your camera out and take snapshots of the document and preview them to ensure they are legible. There are scanning apps that can convert such snaps to PDF on the fly so you can email them to yourself for safekeeping.",
            "Uhm, is there a way you can get your hands on bitcoin mining equipment? It's quite cheap since the price fell (because it's usually not worth the electricity in most countries,  but that is not YOUR problem ;)",
            "Always have two original copies.  Each you and the landlord then sign one of the contracts.  Then you and the landlord each keep an original contact that is signed in ink.  Also, each page should be initialed in ink by both parties as well.  This is the best way to protect yourself.",
            "Make sure you get that confirmation in writing",
            "That's fraud, I'd still sue him for the contract value",
            "Good for you. Fuck landlords.",
            "I had an absolutely terrible landlord in the past. When we viewed the rental at first it seemed okay, good enough for some college students. But needed a lot of issues fixed. Downstairs bathroom cabinet was rotted out, side screen door had no handle, bug problem, detached garage had no electric hooked up, nor did it have a functional lock, and more. On top of this, apparently this house was in a flood zone. Landlord had installed a French drain around the foundation. Never told us of flooding issues despite two bedrooms being in the basement. I live in a state that legally the renter has to be notified of this. Naturally, being naive we didn’t notice any of these issues. \n\nCome July of 2018, the house floods. Somewhere around 10 inches of rain overnight. Basement floods with rainwater first. The landlord had installed a French drain, but no backup sump pump in the basement. Once the water became too much for the city drainage system, the sewage backs up into the basement too. You read that right, sewage. I was the only one home at the time. Also was living in the basement. A friend came to help me get what I could out of the basement. But large things were all destroyed. Lost thousands of dollars worth of furniture. And thanks to the landlord not informing us of a flooding problem, none of us had flood insurance tacked onto our rental insurance. City was claiming it as a disaster, insurance wouldn’t cover because it was “rainwater” and considered and act of god. \n\nBetween the time of roughly 3am and 8am, the basement flooded with nearly three feet of rainwater and sewage. Landlord’s friend comes and drops off a sump pump. Doesn’t plug it in. Landlord asks me to plug it in and route it to the alley. I told him no. Landlord’s father shows up hours later to plug in it. Now they are pumping sewage into the alleyway. Once the water has cleared, everyone leaves. Including my father and a roommate that drove over four hours each to get there that morning. I on the other hand had been up about 24 hours at this point. \n\nCome back the next day, landlord had already thrown anything that was sitting in water away. Anything that seemed salvageable, they put to the side. Seemed like they were being nice. He then starts out about how he will have the basement fixed, and in the meantime we can live in a hotel. I ask if he plans to pay for that. He declines, imagine that. I explain to him the house in uninhabitable, and that breaks our contract. He reluctantly agrees, and says he needs a written notice of why us roommates are moving out. I give him that. Should have been the end of it. \n\nIt was after the water was drained out that we could see the full extent of the home we were living in. After they stripped the Sheetrock, there was visible black mold behind it. Obvious signs of bug infestations. Previous signs of flooding. Cracked concrete. \n\nA couple months go by, and he sends us a bill. He charged the other three roommates rent for two months while the house was uninhabitable, despite my notice including their names.  He charged each of us a “cleaning fee” after the flooding. He also charged us two downstairs for the disposal of personal belongings. The belongings that were soaked in sewage and needed to be taken out by people wearing hazmat suits. He then left utilities in my name as the home was being fixed, but did not bother to forward me a single bill. I found out through the utility companies. \n\nI also happened to find out he listed the home for sale within a month of the flooding. \n\nRemember when I said I worked for a contractor previously? I knew that after a disaster such as that flood which ruined countless basements and flooded so many homes, there would be no way he could get the home inspected, and fixed in that amount of time. No chance. I had photos of everything. The water coming through the drains and toilet. The sump pump routed to the alley. The black mold in the basement. I texted him, and said this bill is unacceptable, and that I expected a full refund of each of our deposits. He gave me an angry text explaining how ungrateful we are and how he gave us a deal on it. That’s when I hit him with it. I told him if we didn’t have checks in our mailbox that fully compensated us for the deposits, I would go to the city with every last thing I had. And he could expect to be served with a suit for allowing us to live in a home such as that. Even had lawyer give him a phone call. \n\nWithin a week, we each had the deposits back. We still lost money, but we were just glad to be out of that shithole. I can still smell that water/sewage. I still think of the fact we were wading around in it to get stuff out. Still think how we could’ve died that day had we not flipped the breakers off. Haven’t stopped thinking about the fact I happened to be up still when the water started to come in. To say the least, I was just thankful to be out of that house. \n\n\nWorst landlord ever. If we weren’t broke college kids, I would have taken him to court. Still wish I could to some extent.",
            "You missed out. You should've just taken him to small claims court for triple the amount of rent that he claimed you owed because the punitive punishment for most scummy landlord actions is treble damages. No lawyers, just a form submitted to the courthouse and show up to explain to the judge. Boom. Easy $3000+ dollars.",
            "Magnificent job, well done",
            "Great job but still sue his ass",
            "Nice play. You could have Mentioned  that the contract with the obvious formatting change would have been brought up in court and brought to question. All which would become public record and subject to penalties.",
            "It's always worth nailing a slumlord to the wall.",
            "Fraudulent contracts often get assessed triple damages in court... you probably should have let him file.",
            "Currently dealing with a bum landlord whose facade of willingness to help evaporated as soon as I made a request (which he agreed, with zero follow-up for over a month) for inspection/repairs on what, based on the past few weeks of informing myself, are definitely not up to municipal code re: airflow due to cracks in walls/windows/floors. Suffice to say, this landlord has made a tenants rights advocate of me and I hope for his sake that he follows through on his word for inspection/correction before the city does, or I'll have my own tale of renter's revenge on a greedy landlord.",
            "that guy is  wanker. Nice save",
            "You want to stick to the contract? Ok landlord.\nGreat compliance OP.",
            "why not ask to see the original or a copy of the original?",
            "One of those feel good stories here 😊",
            "This sounds like a Bitcoin mining farm location to me.",
            "lol, tfw the landlord fakes a contract, so you use his own loophole to make him lose money",
            "I’m not sure who you would report it to, but if you can I would still report the incident to someone. Now that you pointed out the error who knows if he’ll do it again with another unsuspecting tenant. At the very least maybe you can put it in a review on the apartment where you can.",
            "Would it have been considered pro-revenge if OP capitulated, gave the landlord the new date (at the end of the 90-day illegal notice), informed them of their utility abusing strategy, and then allowed the landlord the option to buy them out of their lease?",
            "But they must have kept the original? Sure, they edited your copy, but if you demand they produce the original they kind of have to, don't they?",
            "Fucking prick of a landlord. I get it can be difficult to be a landlord sometimes, and not all of them are particularly wealthy, but I'm so happy that fucking scum bag got put in their place",
            "I can only imagine how many times he got away with this.  As a lawyer, it makes me wet just thinking about how fun it would be to go after a guy like this that is screwing people.",
            "[deleted]",
            "Initial *every* clause, sign the bottom of the page (and top if you like). Otherwise there's nothing preventing them changing the page between your signatures!",
            "Landlords are leeches.",
            "Love the story but where is the malicious compliance?",
            "What a grimy fuck, good on you for shitting on him",
            "Landlords - biggest scumbags out there.",
            "Maybe this has already been said, but did you report him to the police, or at least tell the other tenants about his scheming ways? This doesn't sound like his first time doing this.",
            "Reading this thread makes me wonder...when I moved in in August, my apartment had broken AC and the complex didn't successfully fix it for almost a whole month. I always felt that I was entitled to a concession because I thought AC was considered like a core part of the housing included with the lease. They gave me a meager $200 concession and claimed that they were not required to give me any concession, but who knows.",
            "The Wet Bandidts applaud you!",
            "Kinda shocked at how much attention this little story got.  Glad some folks found it interesting.  I omitted a few details from the original post for the sake of brevity, I know, it's not like the original post was particularly short, but it would have been a good deal longer had I laid out the whole thing, so I chose to pair it down to what I thought was the core of the story.  There have been a lot of questions about the parts I omitted though, so I guess I should make a couple things clear.\n\n&#x200B;\n\nRegarding my reasoning for not pursuing legal options.  Firstly, I didn't believe there would be any big pot of gold at the end of that rainbow, and I was pretty busy with renovating my new house at the time, so I just didn't feel it would be worth my effort given those realities.  I understand the comments to the effect of \"the landlord can just do it again if you don't hold them accountable\", but there were also some reasons I wasn't too concerned about that.  \n\n&#x200B;\n\nFirst, the landlord didn't have multiple rental properties, so I wasn't concerned about this being a massive issue down the road.  The apartment I was in was the only one on the premises, and supposedly the only one they owned.  The owner claimed to be a first-time landlord, which I believe to be the truth based on my experience with them and the fact that the bought the property shortly after I originally moved it.  They were generally pretty accommodating the few times I had an issue prior to this.  Broken washing machine, blown fuse in the heat pump, that sort of thing.  They sent someone out within a reasonable time for the issue, and got it taken care of.\n\n&#x200B;\n\nThe second reason I wasn't worried about the future tenant, and really the primary one, was because the future tenant was the very store manager/landlord's employee to whom I actually delivered the ultimatum.  The very one who pulled the switcheroo with the contracts.  He wanted to move in to that apartment to save himself the commute to work, and had even tried to convince the landlord to cancel my lease rather than allowing me to go month to month so that he could move in.  Landlord chose to allow me to go month to month instead.  I figured Mr. store manager was well aware of, and almost certainly complicit in the fraud attempt, if not even possibly the primary driver of it.  Any case, I wasn't worried about him getting ripped off.  Rather, I would have been totally fine if he did.  LOL!\n\n&#x200B;\n\nHope that clears up things for some folks who had questions.  Sorry I don't have time to individually respond to each mention of the issue.",
            "Yeah - I had a landlord change a lease.   Total makes the lease unenforceable.",
            "Damn i'd still have TOTALLY taken his ass to court. We heard so much of this sort of shit in our contract law case studies, and my own landlord even tried to pull this crap when i was at Uni except instead of what happened to you, it was that they'd agree'd to have a 3rd person move in (my gf and i were looking for a place together) when university term started and the rent would be split between the 3 of us. We even interviewed candidates and found one we liked, then when we told the lawyers acting on behalf of the landlord, they said she'd changed her mind and wasn't going to allow anyone else to move in and my gf and i would have to pay the full rent between the 2 of us for that year (rent in Aberdeen is the 2nd highest in the UK, with London being top).",
            "Lol fuck landlords, good for you.",
            "Greta Thunberg would like a word about your plan",
            "This isn't smart... At all. \n\nIf your landlord is smart, they would monitor the amount of utilities that you're using and take you to small claims court for the difference in usage claiming tortious interference as the amount of utility that you're using is exorbitant and could possibly interfere with their current rental contracts.\n\nYou'd most likely lose and be on the hook for just about every dime...",
            "Fuckin A",
            "Up to a point, definitely.",
            "what an absolute idiot ,serves him right !",
            "This is why I come to this sub",
            "Up until the crash I was actually excited",
            "Their reaction seemed fine, it's just sad",
            "This is why you don’t copy a signed contract, but prints two copies that are then both signed. One for the landlord and one for the tennant.",
            "Landlords and renters both suck. I used to property manage for a friend when he moved but rented his place out instead of selling (4 unit house he lived in 1 of, so it was a rental property to begin with). He was super nice at first and accommodating, and renters followed the rules while he lived there. Once he moved out things started to slip as renters no longer were under his eye. He kept letting it slide until the place was a disaster. Once leases were up he refused to renew any of them, then turned into a hardass for the next round of people. \n\nHe wasn’t shady, but I see the stepwise path to hell pretty clearly",
            "> was the fact that the contract included all utilities, as the unit didn't have separate meters, and did not have any language forbidding excessive use of them. \n\nA shame you weren't GPU mining at the time.",
            "lol good one",
            "When DH and I were moving out of our apartment, because we bought a house, and manager at the apartment complex tried to keep the $750 pet deposit by claiming they had no paperwork that we had ever paid it.\n\nI went to the bank and got copies of the three checks, front and back, and written in the memo  \"1\\3 pet deposit\" on the front, and the back showing cashed by apt complex.\n\nGot the deposit back in four days.",
            "This is more malicious threat than malicious compliance...\n\nEven if you followed through it would've been petty or pro revenge and not malicious compliance.",
            "Is there a Yelp or Glassdoor type thing for Landlords out there? If so, you should absolutely leave a one star review and let future renters know he's okay with falsifying legal documents in order to try and extort money from his tenants.",
            "IANAL but I think I heard you can add \"Without Prejudice\" or \"All Rights Reserved\" before your signature to protect yourself in case of such fraud. Your mileage may vary on this one.",
            "Sorry to be the party pooper but this could of ended very badly and was a stupid idea that could of backfired. If you left the water running, all the windows open in the winter and it caused damage to the suite you would of been in serious trouble. Sink overflowing, heaters freezing etc. Any damage you would be on the hook and it would be a hell of a lot more than 2 months rent.  Also the landlord can enter you suite without 24 hours notice if they believe there is an emergency. Hearing water continuously running for hours could easily be considered an emergency as it could be the sign of a broken pipe. You got very lucky he didn't call your bluff.",
            "If you initial paper, how does inserting extra lines into another document move your initials on the copy you signed?",
            "> Landlord and I agreed on a higher monthly price to compensate them for the lack of security \n\nYikes! I've been doing research for a few months now on becoming a landlord and a big tip that I've learned is many successful landlords actually don't ask for another lease after the first one! The reasoning being that they don't want the tenants to go looking for a new place.\n\nSo agreeing to pay extra when it's an actual retention tactic used by some landlords would not make me a happy camper at all! But as with everything, YMMV...",
            "Too long, didn't read. Sorryyyyy"
        ]
    },
    {
        "post_id": "adsldc",
        "author": "benisaboringname",
        "title": "Ok, fine, I'll go on a Skype call with a potential client even though I've lost my voice.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/adsldc/ok_fine_ill_go_on_a_skype_call_with_a_potential/",
        "score": 14022,
        "num_comments": 286,
        "created_utc": 1546939420.0,
        "selftext": "Excuse any formatting. TL;DR at the bottom. \n\nA bit of background, I work in marketing and manage a number of client accounts for the business and I'm in charge of a team of account managers. I'm a minority shareholder in the business so, of course, it's in my intetest to ensure that the business operates efficiently and effectvely. As one of the longest serving employees, when given my last promotion, as part of the package I was offered shares in the business, as I would be one of the most senior members of staff. It works out that I own about 5-7% of the business (can't recall the exact share division). \n\nAs a shareholder, you'd expect that the managing director (let's call him MD) would understand that I genuinely want the best for the business, but instead, does not take me seriously at all, and frequently goes out of his way to undermine me. \n\nSo last week I was supposed to come back on wednesday following the Christmas break. Unfortunately, the week I was due to come back, I fell ill and lost my voice (as well as other issues that meant I couldn't make the journey into the office). I did the standard and messaged the MD as well as HR to inform them of what the situation was. We'd recently upgraded to a new project management system that needed a little bit of manual TLC in order to make it work automatically (if that makes sense?) So I figured I'd take advantage of my illness and just vegetate in bed and work on this project management system.\n\nAt about midday I get a text off of the MD which read: 'Hi u/benisaboringname, as you know, I would like to bring [insert name of large travel company] on as a client. As they'll be your future client I would like you to jump on a Skype call with them this afternoon.' \n\nThe subsequent (paraphrased) conversation: \nMe: I couldn't possibly do that, as you know, I have lost my voice and I'm currently in bed working on the project management system. \n\nMD: No I need you to do this. It's very important. \n\nMe: I have already advised you that this will not be possible. I don't NEED to work on this system today as officially, I'm ill and have no requirement to work at all, as you're aware, so what you're asking is unacceptable. \n\nMD: I don't care. You may be a director, but you're still an employee. Im sure your dividends are likely to be affected if we were to lose one of our largest potential clients. \n\n\nNow, finally (I know, I'm sorry) its time for the malicious compliance. Obviously I don't want my dividends to be affected in the next quarter, no matter how much of an open ended threat that was, so I call the procurement manager of this large travel organisation. I don't turn my camera on and I explain via text input what the situation is. We try our hardest to communicate, them talking via the microphone and me communicating via the chat function. We mutually agree that this is going nowhere and they agree that I shall call them back when Im well. \n\nHowever, the next day, I'm still ill and get a message off the MD saying that I need to go in the office for a 'priority one' meeting. Essentially, what that means is that even if you're on your death bed, you're expected to dial in remotely or go into the office. As I walk in, the MD, the HR Director and the Business Development Director are sat waiting for me. I immediately know that this is regarding yesterday...there's no other reason for the HR Director to have crawled out of his cave. \n\nI'm told to sit down and the MD looks incredibly unhappy. He shows me an email thread from the procurement manager of the travel firm essentially calling the MD unprofessional for making me go on the call. And saying they are having second thoughts about using our services. The HR Director, who has obviously been lead astray by the MD asks how I can explain this and why I didn't raise this as an issue. I ask to link up to the screen and show the HR Director the texts between the MD and myself from my phone. After a grilling, we all leave, putting it down as a 'learning experience'. \n\nFast forward 6 days, yesterday I contacted the procurement manager of this travel firm and he explained that he would love to become a client but as long as all correspondence went through me \"rather than the dickhead MD.\" \n\nAlls well that ends well I guess. \n\n\nTL;DR: Managing Director made me do a skype call with a large potential client despite having lost my voice. He threatens my income, so I have no choice. He gets called out by the potential client for his unprofessionalism after I explained the situation to them. Now they'll only deal with me directly and called him a dickhead. ",
        "permalink": "/r/MaliciousCompliance/comments/adsldc/ok_fine_ill_go_on_a_skype_call_with_a_potential/",
        "comments": [
            "When they think it's your fault: \"HEADS WILL ROLL!\"\n\nWhen they learn it's management's fault: \" Oh well it's a learning experience...\"",
            "Honestly the best part is that they refer to him as a dickhead. \nAlso, super uncool for you to get yelled at over this. You did what you were asked to the best of your ability after repeatedly informing them that it wasn't gonna work out well. I'm glad the client was understanding and cooperative! ",
            "This also means you have more clout within the company now.  \n\nGo and build up a strong personal relationship with your contact *and their underlings* at the client company.  Underlings are important, make sure you take the whole team for lunch one day before you do your 1:1 golf meeting with the client.  Couple of hundred bucks will go a long way in terms of relationships and loyalties.",
            ">Fast forward 6 days, yesterday I contacted the procurement manager of this travel firm and he explained that he would love to become a client but as long as all correspondence went through me \"rather than the dickhead MD.\"\n\nGet that in writing, somehow. That way it shows the other shareholders what a negative influence the MD is.",
            "I'm glad to see your MD was happy to hang himself by ~~email~~ text message",
            "What I'm wondering is that why would Dickhead try to fuck you over after the text messages had been sent somehow thinking you wouldn't save your own ass by just showing them to management as proof.  Did they think that it wasn't recorded or something?",
            "Well I found that even when I lost my voice, I could still whisper pretty alright. And it actually works great through phones and microphones that really pick up on the slightest sounds.\n\nI guess for a business call, it would be kinda creepy to have someone whispering throughout the entire call. :)",
            "I always think its ridiculous for someone to expect you to sit in on a call when you literally cannot speak.  You could try but no words would come out.  No amount of initiative, dedication to the company, or synergy can make your vocal cords function.  Sounds like an arbitrary control freak and he stepped over the line and was revealed for being arbitrary and ineffective.  Lol  ",
            "Hey OP since you work in marketing I got a question.  \n\n\nHow do fail adverts go out? Like when Dove had their near-racist advert... I mean, I'm under the impression that there's a good number of people who work in marketing firms have a group of people looking at the ads...  \n\n\nYou mean to tell me that every person who looked at the advert for Dove were ok with it? How is that even possible?",
            "It must have really burned MD's ass that the company's only stipulation is that they have no contact with him at all\n\n",
            ">\"rather than the dickhead MD.\"\n\n...made me giggle, and glad it worked out for you.\n\n...no fallout for DH?",
            "This is literally what scares me about finding a job. I'm only a freshman in university and I'm already not looking forward to working any corporate job. ",
            "Hopefully your MD doesn’t use this against you and puts a target on your back. With some\n(terrible) bosses, even though it was their decision that prompted something negative they place all the blame on their employee in order to save face. ",
            "What the hell is wrong with people? \"I am sick\" means \"piss off, I am not on your time\".",
            "Similar story, I applied for a retail job a couple years ago to help save up money to get through college. After hearing nothing back for a week and a half, I get a call out of the blue asking if I can come in for an interview. Only problem is, I’ve been incredibly sick and could only speak in a whisper. I tell the lady this, and after having to repeat myself a couple times, she says “Oh...well can you come in anyway? We have to get through all interviews today.” So, knowing I wouldn’t get the job if I didn’t go, begrudgingly said yes.\n\nI show up there and the sales manager is interviewing me,  and seems incredibly concerned that I came in to the interview sick but goes through with the interview anyway. He asks me to repeat myself many times throughout, and eventually gave up and probably didn’t hear half the answers to the questions.\n\nIn the end, I got the job. They were either very desperate or impressed that I came in. I like to think it’s the latter but it’s retail, so probably the former.",
            "This one was so boring it has to be real. take my upvote. ",
            "I'm glad he got skewered on the grill by HR for making you work while that sick.",
            "After the text \"that is unacceptable. bla bla bla\" I would have called his cell phone, and spoken with him directly. \"this is me talking - this is what you want to present to the client?\"",
            "> I ask to link up to the screen and show the HR Director the texts between the MD and myself from my phone.\n\nThere is no better feeling than \"you bet I've got direct evidence that this is not my fault\"",
            "Reminds me of when I lost my voice so I texted my manager to explain and see if he could call the other closer for me since she could not receive texts. He told me he was essentially too busy and if I needed my shift covered I'd have to call her and ask her since it's my responsibility. She could barely understand me and I'm pretty sure straining to try to talk to her made it worse. Not a fun time.",
            "Sounds like a shit company to work for, and if that wasn't enough, even having something like the below exist is the nail in the coffin:   \n \n>...even if you're on your death bed, you're expected to dial in remotely or go into the office  \n  \nScrew companies that have anything close to that kind of attitude. You know what I noticed? If your company doesn't make up excuses and is generally straightforward, clients and partners will happily excuse/reschedule meetings for illnesses and life events. ",
            "Losing your voice sucks when you're in a position where you have to talk ALL THE TIME. I used to work retail and once lost my voice working at a woman's clothing store in the middle of a transaction. The customer had to yell for my manager because the music was so loud.\n\nHowever, my sister and I love making bird screeching/squawking noises when one of us is losing our voice and it's squeaky. It makes being sick a little fun. ",
            "Reminds me of the time I lost my voice but still had to answer phone calls for the company I worked for. Good times. ",
            "Nicely complied!  Great result. :-)) ",
            "How do so many dumbasses get leadership roles in companies?",
            "Job security is a wonderful thing.",
            "Now, you aren’t going to like to hear this, but where you fucked up here was calling in sick and still continuing to work. \n\nThis whole situation could have been avoided.\n\nYou blurred the line between working from home and taking an official sick day, (I guess because you still wanted to get paid if you worked on the project management system instead?).\n\nWhat you should have done is, rang in sick, then ignored all forms of communication until the commencement of the next working day (I’m sure it’s even illegal in some instances for them to contact you after being declared sick).\n\nBy still working from home, you invited your boss to presume that you were well enough to still take a critical client call. If you were “really” sick, you wouldn’t even be able to sit upright in bed and concentrate on work. \n\nI’m not saying they were in the right, far from it, but you need to understand your rights in the workplace and protect yourself from situations like this, because there are plenty of employers out there who will take a mile if you give them an inch.",
            "This had the ingredients of becoming /r/ProRevenge or /r/RegularRevenge or /r/pettyrevenge ",
            "Don’t apologize for being on mobile. You will really piss of that one person",
            "I love that they called him a dickhead because they know they hold all the cards, and can say whatever they want/how they really feel. ",
            "Your story is on Bored Panda. I hope they contacted you for this. ",
            "How did you ask to link up to the screen?  If you were still communicating via text or such, they should have gotten the hint a bit earlier, though I guess MD still might now have.",
            "GGOOOOAAAAALLLL!!!! ",
            "I love work related malicious compliance stuff.",
            "This is sooooooo good 😍😂",
            "More often than not, those who end up in management positions have egotistical fantasies, and becoming a manager prompts a massive power trip for them. Of course, the reason these people end up in management in the first place is usually because they're willing to step on anyone in their way to get there. ",
            "yo wasn't this sub in it's earlier days with pictures and stuff?",
            "I'm really glad it all worked out for you. But I feel like it might have been less than professional of you to have thrown MD under the bus to your potential client in the first place. Why should they ever have known about him and his dickhead behavior? I feel like the meeting could have been basically framed as \"Hey, we had this meeting scheduled, and your business is really important to us. So, even though I'm sick right now and can't actually speak, I thought I'd at least make an attempt to touch base with you via text here and see if there's anything we can do to \\[accomplish the goals of this meeting\\] now. \"\n\nHow did MD's dickheaded behavior even come up in conversation with the potential client? \"Oh, I'm sick and can't talk to you, but my dickhead of a boss says we have to have this meeting anyways...so let's give this a go, eh?\"\n\nI just feel like any airing of internal dirty laundry (like dickhead boss behavior) is rather unprofessional and possibly counter-productive to the idea of giving a potential client a good impression of your company's ability to accomplish their goals.  \n\n\nINB4 \"Found the dickhead boss! Hurhurr\"",
            "I mean, yeah very uncool from the MD, but Malicious Compliance is not how a director of a company should be acting. The real motive of the call was not to discuss business, but to form a personal connection with the client and reassure them that if they sign, they will be taken care of by the account management department (who are the ones doing the actual work). The role of a Director is to come up with solutions, not to create more problems. The correct way to deal with this would have been to get in touch with the client directly via email and explain the situation to them and re-arrange a time for a call, offer to help with any questions by email, etc, with plenty of professionalism and enthusiasm thrown into the email. Then you tell the MD that you've reached out to the client to re-arrange the call for when you get your voice back. If the MD bugs you, you ignore them. You have fulfilled your duties to the best of your ability and they can't fire you for being sick.",
            "[deleted]",
            "America is such a poor place "
        ]
    },
    {
        "post_id": "her6mh",
        "author": "nexflatline",
        "title": "Noisy neighbor's kid stomping around at late night",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/her6mh/noisy_neighbors_kid_stomping_around_at_late_night/",
        "score": 14017,
        "num_comments": 376,
        "created_utc": 1592960612.0,
        "selftext": "My neighbor's 3 years old for some reason was always running around barefoot until 2am and then again from 5 am. You could feel the apartment shaking when the kid was stomping and the parents didn't seem to do anything about it.\n\nI didn't consider complaining, since I grew up in an apartment and I could get used to the noise with time. I was actually happy that I could listen to loud music and the neighbor wouldn't mind since they were also noisy. Well, to my surprise, in a few days I get a very angry building manager telling me that the neighbor complained I was too noisy, even though I was careful to never make noise between 9pm and 10am. Of course I then complained about the stomping and got told that other apartments also complained about that, but neither he nor the police could do anything about natural noises from normally living in an apartment.\n\nWell, from then on every night and early morning I would play very loud and dirty porn, and whenever I had a *guest* I would tell her she could be as noisy as she wanted. Every time I could hear the stomping halting right away and after 2 months they moved out.",
        "permalink": "/r/MaliciousCompliance/comments/her6mh/noisy_neighbors_kid_stomping_around_at_late_night/",
        "comments": [
            "Are the hot passionate moans of two people engaged in fornication natural living apartment noises?\n\nyou betcha!",
            "I had a downstairs neighbor for a couple years who was a very nice elderly Hispanic man.  My only issue with him was that a couple times a month, he’d drink too much on a Friday or Saturday night and break out his karaoke machine.  He’d sing sad Spanish language song and cry into the microphone until he apparently passed out.  What the heck do you do about THAT?",
            "I almost don’t want to know what the parents are doing while the kids are up all night.  One time my family went to a hotel resort with a water park, so kids were everywhere.  Our last night there I could hear the kids in the room above us loudly running around and jumping on the beds.  At 9pm, while it was annoying, I felt like that’s just one of those things you have to accept at a place like that. At 11:30pm, enough was enough and I called the front desk and had someone ask them to stop. It stopped and I went to sleep.  At 2:30am, I woke up and they were doing it again.  I called the front desk again and soon after it stopped for the night. As I checked out that morning, the hotel’s system obviously kept records of customers calling in. The woman apologized, and proceeds to tell me what happened.  When a hotel employee went up the second time, he told the kids that he needed to speak to the parents.  The kids said they weren’t there. He then said, “Can you call them?”  The kids said they couldn’t.  The parents left, the kids didn’t know where they were, and they were young enough that they didn’t know their cell number(s).  The hotel had a contact number in their system and eventually got a hold of the parents, who were drunk at a bar miles away. The hotel sent their van to go pick them up.",
            "i bought large speakers and play sub-test tracks. it literally tests out all the frequencies and some sub bass frequencies will shake your entire apartment walls but is mostly inaudible. like 20-30 hz. it strikes fear in neighbors. you can play god at any time.",
            "Why was it acceptable for you to play loud porn but not loud music?",
            "At least you didn't have a clogging problem.",
            "Once our downstairs neighbor complained that we we're walking late at night in the apartment. Our other neighbors from the apartment next to us used to bang on the walls when we spoke or laughed at hours like 3/4/5pm . One time they did it when it was 4, my roommate had enough so she walked out all pissed off and banged on their door. They didn't open it. But that was pretty much that, they never bothered us again.",
            "So, you mean to say I can't technically get in trouble for loud porn/sex noises, if my apartment neighbors call the cops?",
            "My upstairs neighbors are super nice, but loud. I ended up getting a loud fan to run at night to cover at least some of the noise. \n\nThey just had an addition to the family. I feel so happy for them, still makes me chuckle when I realize that I probably heard the conception. XD",
            "We have a similar problem with our neighbours but it's not the kids stomping, it's the mother and when shes not stomping shes slamming doors against the walls and this happens from about 5am until around 9PM.\nMy fiance plays bass guitar and when she starts he just turns his amp up until the walls are shaking...",
            "You forgot the elliptical reflector dish.",
            "I played Fantomas' first album once for some loud downstairs neighbors.",
            "That's messed up but also hilarious lmao! Bravo",
            "[deleted]",
            "I laughed at this. That mom needs to learn letting her kids stomp around at night will only get them noise complaints.",
            "[Relevant XKCD.](https://xkcd.com/316/)",
            "Neighbour two doors down in bock of flats.....every weekend this woman had a different guy at her flat and she was loud...i went up to her one day and asked her if she had a problem as she was so loud and if she could please shut her window at least...she laughed at me and said i was jealous..i said no i was not but that i was upset for her two daughters who were 13 and 15. They had to spend hours in the flat in there room with there mom overly loudly fucking strangers. Eventually someone did call the police and a week later the kids were gone...she accuse me and i told her that i did not get the time to call the police as someone else already had...She was quiet from then on as she was fighting to get her kids back for social services...",
            "So your other neighbours got to enjoy stomping sounds *and* porn sounds?",
            "When my wife and I finally own a home, she originally wanted a condo. Shared walls like this are *exactly* why I won't do it.",
            "Don't know where it was or how long ago, but I love expectation of peaceful enjoyment statutes and acceptable levels of natural sound. Those things helped in breaking a lease five months early.",
            "This is great but for me it's more pretty revenge than malicious compliance",
            "Poor kid, when do they get to sleep? Young kids need plenty. Not to mention having such a weird schedule must be terrible for them.",
            "After the 10th \"what are you doing step bro?\" The neighbors decided that they've had enough of Alabama and moved to a new state.",
            "I know you itallisized \"*guest*\" for a reason, but I also like to imagine whenever you had normal company over as well you told them to moan as loudly and dirtily as possible. Like, neighbor over to borrow sugar? Hey quick, give me your loudest porn moan. Amazon dropping off a package? Give me a couple noisy grunts. Pizza guy? Help me shake my bed for a second.",
            "Now he’s got a porn addiction.",
            "What is this, a crossover episode with r/TIFU?\n\n\"TIFU by letting my kid stomp around in the apartment\"",
            "Bow chicka-bow-wow turned up to 11. Love it.",
            "[ hears fornicating noises]\nKid: whats that noise mommyyy\n\nMom: ehhhhh...mmmmm...oh! you see........mmm..\n\nAckward silence \n\nMom: honey....i think theres a nice condo nearby lets check it out",
            "... and then the stomping at 2am and 5am return... but there’s no one living upstairs...",
            "I hated living in apartments for that reason, and would only live on the top floor. That’s got to suck OP, sorry you’re experiencing that. Hate people messing with my sleep.",
            "I had this problem in my first flat, but they got aggressive when asked to make it stop. I don’t understand why the kid is even running around 1-3 am in the first place, freaking parent better. Or at all!",
            "On the other side, having spent many years growing up living in upstairs apartments, I have the softest step of anyone my size (6'5\"/197cm, 280 lbs/127 kg) that I know of. Too often mom saying, \"Quit stomping\", and me replying, \"Mom, I'm tip-toeing!\" It's disconcerting when I walk up behind someone and startle them when I say Hi. I'm too big to sneak! \\*chuckle\\*",
            "25 pound barefoot child \"stomping.\"   The proper reaction? Loud porn, as one does.\n\nHooboy.",
            "Man, I am in the very same situation! Will take this post as straight advice",
            "In the immortal words of George Takei:  \"\\*OH\\*, \\*MYYYYYyyyyy\\*\"\n\n;-)",
            "This just seems like a really long way to flex about having sex.",
            "I feel so bad about this man... I've got a brother who's got a very young daughter and because of rhe fcked up education they gave her she's got a wicked sleep schedule (for a kid her age). And she's a stomper. Also has a loooooot of energy at aaaaaall time. So sometimes she stomps til 11pm or more. \n\nTheir downstairs neighbor is one of her kindergarten's classmates and many days a week when they see each other at the kindergarten she tells her she couldn't sleep because of the stomping. She must be 4 but she's such a polite and well educated girl and I'm so sorry for her I almost cried when my brother told me this but what can I say my brother and his wife won't take anything 😭😭😭 I'm sorry OP I failed you \n\nJeez i really have a weird ass family too... now that I'm writing this ._. This already sounded fcked up enough in my head but jeez ._. STOP STOMPIIIIIIING AND PARENTS DO SOMETHING JEEEEEZ",
            "LOL. my old roomie did the EXACT same thing for our upstairs noisy AF neighbor, tho they never moved out. we did however, into an actual home, saving money no less.\n\nhe also did it with actual ladyfriends. im hard of hearing, so i never once noticed...",
            "You should've get a band to play you something, but instead of using normal instruments because they are not natural noises, they would be taping glasses filled with water diffirently as a piano, hit the plates and other things as drums, and someone singing. In my opinion those are natural noises and if somebody complains, just tell them its your big family.",
            "Fuck I wish I can do that but I live with my mom",
            "Had a neighbor that lived beneath me.  Constantly complained about us walking and talking and laughing and what not at night.  Had a friend over for a late night trimming party as we’d just harvested, and we got to smoking and laughing while we trimmed, nothing crazy, just talking and laughing.  We get a bang on the door and the neighbor has had enough of our laughing.  Proceeded to yell and threaten me with the landlord and whatnot if we don’t go to bed.... what?   So... my living room was directly above her bedroom, and there was a loose, creaky floorboard.  I lit up a dooby and proceeded to pace back and forth over that floorboard, making it squeak for the next hour or so.  Did that almost every night for about a month right at what I assumed would be bedtime before she moved out.  Immensely satisfying, got a very nice couple that understood apartment living and noises after that.",
            "*Fuck yeaaah, these are the posts I like to read, ohhh yeaahhhh. Mmmmm...*",
            "It was my downstairs neighbors making tons of noise. So I bought a mini trampoline ...",
            "Well played. If you can't beat them join them.\n\nThat made more sense in my head. Now it just sounds wrong :s",
            "everybody gangsta til the dude starts moaning",
            "My friend lives in japan and her next door neighbour rhythmically raps his knuckles against their shared wall late into the night. I would be furious haha I’m picky",
            "This is THE BEST! Ha!!",
            "Spare a thought for the parents whose child is keeping those hours, they must have been exhausted. A lot of special needs children barely sleep",
            "I have a sister and the neigbours complained already, its hard to explain a kid things they dont know about a lot of things.\n\nIf you complain you'll onky get problems with the neighbours, I suggest (I dont fucking know lol)",
            "noice",
            "those who live in glass houses should not throw stones on other's homes. :D",
            "We got a noise complaint for laughing to much once!",
            "This is why I love my concrete walls and floors\n\nYa can’t hear shit lol",
            "Wait so when guests came over, you guys had sex?\n\n\nnahh jk i know what ur saying",
            "That might be qualified as malicious, but where's the compliance part?",
            "You're a monster.",
            "How did you know the kid was barefoot",
            "Same shit happened to me except I just got kicked out...",
            "Porn is always the solution.",
            "Lol, where did all the upvotes go this isn't the first time.",
            "> and whenever I had a guest I would tell her she could be as noisy as she wanted\n\n/r/deliciouscompliance",
            "It’s so petty I love it. lol",
            "What kind of porn tho?",
            "I'm glad you ended up fixing the problem. However, I do feel bad for your other neighbors for those two months. They had loud kid neighbor and they had loud sex neighbor. I would imagine that they may not have been the only one to move.",
            "Should of broke in and dropped thumbtacks",
            "wow you are quite the jerk.  congratulations",
            "Gross.",
            "[removed]",
            "You played loud dirty porn and there are kids in the apartment complex within earshot? That’s cringe as fuck.",
            "imo youre in the wrong for knowingly playing loud porn that a child could hear"
        ]
    },
    {
        "post_id": "1ciiqlp",
        "author": "Ghost_Alice",
        "title": "Karen says \"stop cheating to reserve the best parking space in front of the building!\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1ciiqlp/karen_says_stop_cheating_to_reserve_the_best/",
        "score": 14011,
        "num_comments": 1118,
        "created_utc": 1714664222.0,
        "selftext": "A karen neighbor of mine complained that my roommate and I park in the same parking spot, which is right next to the walk way up to the apartment building. Both of us ride motorcycle and both motorcycles belong to me, but my roommate rides one to get to work.\n\nShe accused me of using my second bike to get a defacto reserved a parking spot when nobody in the complex has one, and said that what I'm doing is not fair and it's cheating.\n\nI said \"Ok, I'll stop parking both my bikes in one spot.\"\n\nShe seemed satisfied with that and left.\n\nAn hour later I had all 7 of my motorcycles, 5 of them from inside the garage I rent but it's half way across the apartment complex, sitting in front of the apartment building taking up every prime parking space infront of the walk way to to my hall in the building.\n\nShe went to straight to the management to complain.\n\nThe management came out and knocked on my door.\n\n\"We can't have you using up every parking space\"\n\n\"Let me guess, Karen complained?\"\n\n\"Yes.\"\n\n\"Yeah she told me I'm not allowed to have two bikes in one parking space to reserve a space. I'm not doing it to reserve a space. Both my roommate and I ride both of the bikes we park in that one space, all the bikes belong to me but I gave the keys to one of them to my roommate to ride for commuting to work. The other one is my bike for going where ever I need. We park both in one spot to be nice and conserve parking spaces so other people have somewhere to park. I was just showing Karen what would happen if I'm only allowed one bike per parking space. The other 5 bikes are generally in another parking space, in my garage where I keep the bikes I that *don't* ride frequently.\"\n\nThe apartment manager said \"I understand. You made your point and I'll talk to her, please put the other 5 bikes back in the garage.\"\n\n\"No problem\" I said.\n\nIt's been a few weeks, haven't heard from Karen.\n\n(EDIT)\n\nSince so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined, let me clarify something.\n\nThis happened at 1 in the afternoon on a day both my roommate and I had off. Most people are away at work during this time. What's more, with the exact topography of the apartment complex, there are only 2 apartments per walkway without going up stairs on my side of the building, but 4 on the other sides because it's up a level and the building is built into a hill. What this means is that MOST people park on the other side of the building, leaving  MOST of the parking spots in front of my building free and open except for very late at night.\n\nHow the heck do you think I took up the 7 closest spots with all 7 bikes if the parking lot was full of people trying to park? Think about it for just a second before you assume details that aren't spoken just because you want something to be upset over.\n\nBOTH BIKES are away from the apartment complex AT THE SAME TIME for a MINIMUM of 4 hours a day. We didn't engineering the situation where my roommate gets home between 3 to 4 in the afternoon and thus gets first pick of the parking spots. We also could both be driving cars instead of riding bikes. Then there'd be two spots taken up instead of 1. I could just choose not to rent a garage and park all 7 out there forcing people into overflow parking, but I don't.\n\nAlso the garage is beyond the overflow parking. It's not fair to expect me to always park in the garage and walk even further because you don't want to park next to my bikes and have all of 2 extra feet to walk to reach the concrete walkway to the building.",
        "permalink": "/r/MaliciousCompliance/comments/1ciiqlp/karen_says_stop_cheating_to_reserve_the_best/",
        "comments": [
            "This reminds me of a story I once heard. I can't find a link, so it may be apocryphal.\n\nThe story goes, San Francisco was trying to increase revenue from parking meters downtown, so they passed an ordinance saying only one motorcycle could be in each space on the street, instead of doubling, tripling, or quadrupling up as was normal.\n\nSo the riders coordinated to all bring their bikes downtown on the same busy weekday and each took up one space, filling up every space in the downtown area for miles around. As you can imagine, it was chaos because none of the car drivers could find street parking and had to opt for much more expensive garages, and/or driving around for hours looking for a space.\n\nNeedless to say the ordinance was repealed.",
            "The main take-away from this is that OP has only 7 motorcycles.  Good luck, good sir, toward achieving the number you need. (N+1)",
            "We rode our motorcycles to watch a hockey game and we tried to only pay for 1 parking spot since we could easily fit 4 of them in 1 spot. They forced us to pay for each. So we took up 4 prime spots. The attendants were mad. The people we mad. \n\nHell I've been to baseball games and I was let in to park for free on my motorcycle while cars still had to pay.",
            "In downtown Toronto, you can park multiple motorcycles in one on-street parking space, at a 45-degree angle, backed in, and none of the bikes need to pay for parking. \n\nWhere are you going to safety display your paid parking stub? It would either blow away, or someone would just take it for their own parking space.\n\nI asked a Cop about this, and he had to call into the station and ask for a parking enforcement staff member to confirm it. And it was confirmed. \n\nAnd yes, I took the officers badge number, and he recorded the interaction in his notebook, just in case the Parking Authority officer (we call them Green Hornets, cause they hover around and sting you with a fine and wear green uniforms) decides to give out tickets. Then we have some paper trail to fight the ticket. \n\nOccasionally, some do-gooder will squawk that we need parking passes. A quick mind your own business, it's legal, look it up, is not enough for these ass hats. But, we just walk away.",
            "At some point in the '90s, NYC decided to 'crack down' on motorcycles sharing spaces- apparently they felt these bikes were avoiding parking fees that the city was being cheated out of.\n\nIn response a huge mob of bikers descended on the City at 5am, and parked one to a space in midtown, effectively taking up all the parking. I participated, even though I didn't work in the city.\n\nIt was generally considered the only time that the Giuliani Administration backed down on a 'Law and Order ' policy.",
            "Perfect! I once lived in an apartment complex with assigned parking. Our neighbors were the stereotypical jock lacrosse players for the college nearby. All of their friends would take all the “prime /assigned parking” and the handicap parking. Our downstairs neighbor was a nice old lady, and never wanted to start trouble. I’d asked them a couple times to not park in the handicap spot since it was the elderly ladies. Somehow a nail ended up under one of their tires. They never parked there again.",
            "You should always grab an opportunity to train a Karen,  I always say.. \n\nThis is \"rub the dogs nose in it\" level",
            "Parking both bikes in one space actually seems quite courteous",
            "I was once parking my bike at work, and someone who was forced to walk a long distance complained to me that I was taking up a parking space with only a bike.\n\nI asked her how many people her car had brought to work that day.",
            "I adore this level of petty, I aspire to this level of petty",
            "Beautiful.",
            "In a similar vein there is a motorcycle only designated spot in downtown Fort Worth. It's a fairly prime parking spot, you can back 5-6 bikes easily. As one could expect there is quite frequently a car parked there, it's a $55 fine but they won't get towed. \n\nI've heard more than one person complain about motorcycles parking in car spots. We still pay to park, I still pay for registration and insurance. Just because some dick bag can't read a sign and police won't tow them doesn't mean we're a lower class. I can park in the same spots as cars and when I do I'm going to do my best to make sure another car doesn't try to park in the same spot. \n\nI've seen people try to start fist fights over those spots. If I'm on 2 wheels and there is room I'll squeeze right up to the bumper of the offender and I'll get a photo of the sign, my motorcycle and their plate. Otherwise I'll be forced to park somewhere else where passerbys will try to sit on it and take selfies.",
            "I'm not a frequent driver (working from home since 2020), while my gf uses her car every day. So we decided to use a single spot for both cars, mine in front and hers at the back - the reasoning being: a) if we're both going somewhere we use her car; b) she's away every working day from the early morning until evening, so if I'm going somewhere alone her car won't be there to block mine; c) if I ever need to drive somewhere alone while she's home, I could always use her car. The cars were at a particular point in the lot where there is a \"shift\" in the spots, so my car was in the regular spot and hers was aligned with the next car in the lot, it was a perfect arrangement and nobody was inconvenienced by it. On the contrary, this way we didn't waste a parking spot.\n\nOne day I started noticing that every time both cars were away, a certain car would be in \"my\" spot when I returned. I would wait until the spot freed up and move my car there. This went on for a few months, until \"somebody\" called the police and had my gf fined for being parked irregularly. We explained the thing to the police guy and he removed the fine, because he understood that we were actually doing something good, but he advised not to do it anymore. That woman had probably called the police a dozen times over the \"irregular parking\" o\\_O",
            "Story from a LONG time ago from my brother who belonged to a biker club.  \nA couple of them parked at a supermarket and put two bikes in one bay.  They got tickets for incorrect parking and the supermarket refused to rescind them.\n\nSo the following Saturday at peak shopping time the entire biking club went back there and parked one bike per bay.  And went in for a very leisurely breakfast.  The car park soon had people queuing out onto the main road.\n\nThe supermarket manager pleaded with them to park their bikes several to one bay, but in response the two bikers showed him their tickets and said they would love to help but they couldn't afford to get any more tickets.\n\nThe tickets were rescinded immediatly.",
            "> Since so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined, let me clarify something.\n\nBwahahaha!  This is *peak* Reddit.  Because of course.",
            "why are people so stupidly petty?  \nIm really asking",
            "I’d be more upset that you have far more bikes than you can ride. \n\nI’ll help you out because I’m nice that way. <shows up at your door with my helmet, gear and a hopeful look>",
            "As a property manager I enjoyed this more than I should have.",
            ">>”…so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined…”\n\nBest description of social media I’ve seen.",
            "Dude the people here in your comments are fucking insane. Apparently, they hate motorcycles. Bunch of clowns.\n\nAlways good to see a Karen get fucked over.",
            "\"so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined\" should be called \"redditting\"",
            "These have been the most satisfying edits I have ever read. Some people are truly unable to connect some dots and deserve to be completely condescended to if you have to connect them on their behalf",
            "Seems like a lot of trouble on your end for nothing",
            "👍🏾👍🏾👍🏾",
            "You own 7 bikes and still rent?",
            "having that many bikes and living with a roomate in an apartment is a wiiiiild financial decision",
            "Heavier on the Petty revenge for me than malicious compliance, as you went out of your way and took bikes that you didnt even have parked to make a point.",
            "Nicely done. I hope you have a camera or at least an alarm on the bikes because she might try to mess with them eventually.",
            "Managers like “dude I don’t make enough to have to deal with this shit, just move them.”",
            "Screw all that. Just tell us about the bikes, and pay the bike tax.",
            "What's wild is OP lives in an apartment with 7 motorcycles",
            ">So many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined\n\nThis is the best description of Modern Reddit I have ever heard.",
            "> Since so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined, let me clarify something. \n\n^^This might be the very best thing I've ever read on Reddit.  Thank you.",
            "The way I'd sit on my balcony and watch this if I was your neighbor. Bravo, OP!",
            "i can certainly relate to the frustration of dealing with a nosy nieghbor like that. it sounds like this person was just trying to be considerate and maximize the available parking, but the nieghbor took issue with it. i've had my fair share of challenges with parking in apartment complexes, so i understand the desire to make the most of the limited spaces. it's good the apartment manager was reasonable and able to resolve the situation. some folks just seem to thrive on stirring up drama, don't they? hopefully this \"karen\" will leave them be now that they've made their point. i've found that staying calm and reasonable usually works better than escalating the situation, even when someone is being unreasonable. at the end of the day, as long as they're not breaking any rules, i don't see the harm in trying to conserve parking spots. it's a shame the nieghbor couldn't appreciate the thoughtfulness behind it.",
            "I used to hang out with a group of guys that liked to build Cafe Racers. \n\nFor these guys having titles to seven bikes would have been on the low side. But they were all just frames and baskets of parts.",
            "n+1",
            "Karen probably dissolved in a bathtub of her own bile.",
            "Seems reasonable to me.",
            "The edits are funnier than the original story. Typical Reddit.",
            "So basically she was complaining to you for being considerate. I love the malicious compliance!",
            "god forbid i have to do any more walking than absofuckinglutely necessary",
            "That was the \\*perfect\\* level of maliciousness to a karen :)",
            "I live the edit. Typical reddit they always have to make shit up, little details and assume they are right",
            ">Since so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined, let me clarify something.\n\nHave you ever been in AITA? It's a goddamn competition there.",
            "I don't even get what she means about you reserving a spot with a bike. It makes no sense.",
            "Op is in the right but if I lived there I would also be annoyed that they always had the best parking spot because they always had a bike there.",
            "> so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined,\n\nSir, this *is* Reddit....",
            "Why do you have 7 motorcycles and zero houses?",
            "parking issues can be tricky in apartment complexes, reminds me a bit of those puzzles where you have to move all the cars to get one out. glad the manager saw your side of things.",
            "Win",
            "I just get to work before my workmates and I’ll pick whatever spot 🤣",
            "In my last apartment we had assigned spots, and our neighbors had two bikes. I let them park in the front of my spot because it fit my KIA and the bike. They did the same with their own spot. Then another guy took the free to anyone spot with his bike at the front, and my wife and the neighbor were the only ones willing to put our second cars in it. Worked out for us.",
            "I keep imagining she's parking in the second closest spot and is mad she's not number 1",
            "You better have 5 garages sir!!!!",
            "Malicious compliance is my favorite. Lol",
            "well done by both you and the manager",
            "This is one of the best MC posts I've ever seen. /golfclap",
            "Absolutely brilliant! Happy to see Karen put in her place with her ridiculous complaints.",
            "Idk im extra petty if there was no legal reason to not park in free places I'd keep them there and swap bikes so none sit for 30 straight days (that's when places can tow in most states)",
            "Bikers Unite!  and save parking ...",
            "Hahaha this is hilarious.\n\nAs a manager i would be mildly annoyed but more amused xD",
            "I used to live in an apartment with a neighbor that had a motorcycle. Eventually we wound up with a deal that we'd share a parking spot because he parked in a way that a car could still fit and no one else would park in the spot if the bike was already there. I worked night shift and had dibs on the good spots when I got home in the morning and would just leave a gap in front for him to slip his bike in.",
            "Did Karen *need* a parking spot?",
            "That’s really cool story.  I ignored the neighbor part but the fact that you have a ton of bikes and loan them to friends is gucking rad.",
            "My old complex, for some reason, set up the parking with the assumption that only one person per unit had a car.  \n\nEvery unit had one assigned space and if there was a second or third car they would have to use rare unassigned spaces that had to be shared with guests.  \n\nIt was an unmitigated disaster.  Every morning people would wait until after people left and would swap out the car from their assigned space to an open space while their assigned space sat empty.  \n\nI mostly blamed the complex because they legit would run out of spaces.  But it really sucked for some people and I think the complex just stopped giving out parking permits for second and third vehicles.",
            "so...what is bike #8 going to be?",
            "What are your 7 bikes?! My wife and I have: 1964 Honda Dream 305, 1974 Honda CB750K4, 2017 Triumph Bonneville T100, 2017 Honda CB1100EX.",
            "Never ever try to appease internet white knights who conjure up fairytale injustice they imagine you must be guilty of.  \nDon't waste time on these digital Don Quixotes as they crack their own skulls on windmills.",
            "I don’t know about everyone else, but I think you did this perfectly! Sounds like you chose a good time to avoid affecting most people, and only kept the bikes parked there long enough to make your point. Pity you can’t charge Karen for the gas used to move the bikes out and back!",
            ">Since so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined\n\nIf reddit banned people for this a lot of subreddits would immediately improve.",
            "I'm not gonna lie but I'd be pissed if the same person always got the prime parking spot. But I wouldn't complain about it. I'll only remember and get annoyed when I see it. But once it's out of sight, it'll be out of mind",
            "My favorite kind of compliance is malicious.",
            "You didn't need that edit, Karen's are on the internet too.",
            "First world problems, eh?",
            "The apartment manager fucking hates you",
            "I straight went to your profile looking to see the bikes. Was not disappointed. Thanks so much!",
            "I don’t understand Karen’s rationale. Would she rather it be one per space?",
            "\"You're putting two vehicles in one spot, thats cheating!  Only one vehicle per slot!\"\n\nUh, wtf did she think was going to happen?  Pulling 5 more out of storage was honestly a dick move, IMO, but just parking in two spots next to each other and taking up twice as much space was the obvious outcome here.",
            "ESH",
            "I'd be on your side if you weren't perpetually occupying the best parking spot, right next to the walkway. Do it in a less desirable spot.\n\n\n\nIt's kinda rude what you're doing 🤷",
            "I don't think your complex would be cool with you taking up 7 spots regardless. If they didn't have it in the rules, they'd probably be sending out addendums at the next renewal. You're not kind for keeping those in your garage. That's what you should be doing, because 7 vehicles in an apartment complex is ridiculous. \n\nBut it IS very nice for you two to just take up one spot, and I honestly wouldn't see an issue with it if you actually were setting it up so you always had the prime spot. So what. It's one more free spot elsewhere.",
            ">  inventing details not in the story, assuming those details are true, and then getting upset over what they imagined\n\n\nThis is the backbone of social media.",
            "Why the fuck do you have seven motorcycles",
            "Im just here thinking about the insurance and maintenance and garage rental cost for so many bikes",
            "Guy has 7 cycles. Keeps 5 in the garage and absolutely uses two to always have one in the same spot. Why get pissed at Karen for calling you out? She didn't go to management until 1 person was taking up 7 spaces. What am I missing here?",
            "Elaborate _and_ effective. Nice!",
            "Perfection!",
            "Well played.",
            "wow, you got her",
            "Haw haw haw.",
            "This reminds me of a beach strip in the city I live in that has a strip of bars/ restraunts across from a skatepark and beach. Suffice to say it's a good spot for families to go on a weekend.\n\nBut it also has two areas that are designated motorcycle parking directly across from the busiest bar in the strip and so uber drivers will a lot of the time try and park there to get their pick ups.\n\nI once pulled in to the spot with some of my buddies in front of an uber driver that was indicating to pull across all the spots and just looked at him and waved him to keep driving the few meters to the parking lot while she looked at me pissed. Fortunately, because it's a frequent place for a lot of bikers to meet up so, there are pretty much 24 hour police patrols so and anyone caught pulling across the spaces gets slapped with a fine or parking infringement.",
            "Nice",
            "Nice",
            "I used to teach at a university that was infamous for no on campus vehicles. It was about a 1 mile walk from the parking lot. I talked to the security and they gave me a \"special\" motorcycle pass, I could park immediately next to the building I taught in. Didn't cost them anything, and spread cheer.",
            "how is this marked \"s\"",
            "Asking purley out of curiosity, no judgement what so ever. Why do you have 7 motorcycles?",
            "I'm a bit suspicious about the claim their roommate rides their other motorcycle.  \n\n\nBut who cares, if it's some sort of cheat code, I just let them do it. I prefer parking far away anyway",
            "Has no one mentioned a chastity cage yet",
            "They're lucky they don't turn it into motorcycle parking.",
            "I have the same situation at my condo here in Waikiki. There is one space in front of my building on the street, the rest all over the circle. I was parking my weekend ride there and some people just couldn’t deal with it and complained to the police. The police told me I could only park there for 72 continuous hours or I could be ticketed. I moved it daily back and forth to show it had been moved ( they marked my tires) didn’t here a complaint after that",
            "> Since so many people are inventing details not in the story, assuming those details are true, and then getting upset over what they imagined, let me clarify something.\n\nI love this."
        ]
    },
    {
        "post_id": "1118q5e",
        "author": "roodeeMental",
        "title": "Fine me a parking ticket when I have proof of purchase?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1118q5e/fine_me_a_parking_ticket_when_i_have_proof_of/",
        "score": 14002,
        "num_comments": 454,
        "created_utc": 1676296337.0,
        "selftext": "This happened the other year, when lockdown was serious. My mate tested positive for covid, so I did the proper thing of cancelling my holiday and isolating for two weeks. This was right at the start before self testing was available, so I just followed the guidelines. \n\nIt was a very cold fortnight. So cold, that at some point, the adhesive on my parking permit fell from the windscreen into the foot well. When i finally return to the world, I go to my van, and see a parking ticket for the previous night. My van hadn't moved in two weeks, and the same parking attendant everyday, just following the rules, hits me with a £75 fine.\n\nI call the company up and get them to check their payment record, my £25/month permit was in date, and they have my vehicle details. They told me the rules on the signs are clear, and if you don't display a ticket, you will receive said fine. No ifs or buts.\n\nI tried to fight it further and further, going nowhere. With my stubbornness, it ended up costing me nearly £200.\n\nThen it dawned on me. If they're not checking a system and just looking for a permit, why am I still paying for it?\n\nI called up and cancelled my monthly renewal, and kept hold of the permit. That was about 21 months ago. It's so bleached from the sun you can hardly make it out. But it's valid in every way that matters to the parking attendant, and I keep saving an extra £25/month.",
        "permalink": "/r/MaliciousCompliance/comments/1118q5e/fine_me_a_parking_ticket_when_i_have_proof_of/",
        "comments": [
            "When I was doing my Graduate Certificate, I had to travel down to Sydney for a week. I decided to ride my motorcycle down. Most of the week I left the bike parked at my B&B as it was easier to walk to my course. However, on the last day I rode my bike to the college as I had all my gear packed and ready to head home straight after the class. I parked it in a metered parking lot and went to get a ticket from the machine. There was a parking cop sitting on the curb having a smoke. When he saw me, he told me not to bother getting the ticket as there was no place to display it. I walked behind a hedge that separated the parking lot to buy a ticket. He couldn’t see me, but I could see him through the hedge. As soon as I was out of site, he walked up to my bike and got his ticket book out and started to write a ticket. I quickly ran around the hedge and showed him the ticket I had just bought which showed the time stamp before he had started writing the ticket. I informed him that I would keep the ticket with me as well as his name to fight a ticket If I got given one. He was not happy, but what could he do.",
            "Friend did something similar.  They issued a new paper pass each month.  Plain white paper, Black numbers and company logon in red.  She would toss each one on the dash board.  After a while, she stopped paying and just told them good luck finding the stub for the month. The toll booth operator couldn't care less and just waived her through, so she didn't pay for parking the next 7-8 years she worked there.",
            "Nothing better than free parking!",
            "I left my car parked downtown after a night at the bars once... The street was 2-hour parking from 8a-5p. I showed up the next afternoon to find two tickets on my windscreen, issued about two hours apart. After some closer inspection, I noticed that the location listed on the two tickets were different (one said 300 block of 3rd St, the other said 400 block, or something like that). I wrote a letter to the cops, and said that since \"my car didn't move, one of the two tickets must be incorrect and should be dismissed. Please let me know which one is valid and I'll happily pay it.\" Both tickets were dismissed.",
            "So forcing you to pay 200 has cost them 525. That's some high level manglement right there.",
            "In college, they loved giving out parking tickets in bright orange envelopes. After you received one, you just had to put the orange envelope under your wiper blade whenever you parked.",
            "Well played!   I lived on campus my freshman and sophomore years of uni, but moved off campus and got a car my junior year.  Being a junior meant I was eligible for a \"C\" parking pass as opposed to the awful fringe parking passes that had parking lots somewhere in east jesus, with no bus service.  Problem was the parking office had me listed as a freshman, and also told me it would take about a week to sort anything out once I showed them my enrollment forms, showing that I was a junior.  Meanwhile, what I had noticed was that the interior parking spaces of the interior floors of the big parking garage were dim as heck.  (In hindsight, probably unsafe, but oh well.)  Also that the C stickers were the same red as the then Hardees drink cups.  Scissors, a cup, a Sharpie, and some tape later, and I had a passable parking sticker until the parking office saw fit to issue me a real one.  Since I paid for a full semester of parking, no one was out any money, and I got to park where I needed to park.",
            "Nice.  Years ago in Ottawa, I lived in a place that we had to park on the street.  As such, we were entitled to buy a permit.  But EMR (energy, mines and resources) was across the street.\nWe had 2 hour parking with permit holders excepted.  But you could never get a park.  So one night, I replaced the 2 hour parking sign with a no parking sign I had (was left at a bar workplace after an event for temporary no parking... So yoink)\nFor 6 months, has guaranteed parking because it said no parking, permit holders excepted.  And they started issuing fines. Then the city finally got called or something because one day it was gone. \nWas nice while it lasted.",
            "Total opposite story, once put the wrong license plate number in my parking app, got a 50 euro ticket. I called them up, explained my typo and since there was no car registered with my typo'd license plate, they were nice enough to cancel my ticket.",
            "Waiting in a college parking lot one evening and a student pulls into the faculty lot next to a vehicle which had been ticketed. He slings his bag onto his shoulder, closes his door and grabs the ticket and places it on his windshield.",
            "Way to game the system! Using their own admitted ineptitude against them.",
            "At the university I attended student parking was like a mile away. Parking passes were extremely expensive and the walk to and from the lot was not ideal. They really monitored that lot for illegal parking as well, you had better have your pass displayed. One day I was running late and it was raining really hard so I decided, screw it, I'm going to pay for parking in the parking garage right next to campus. The parking garage was for faculty and visiting families, not students, but there was no attendant, it was just the arm that raised up and down after you put in your ticket/money . When I was leaving I witnessed the car in front of me bump the arm slightly, and it just raised right up and the car proceeded without paying. The arm dropped back down and I slowly nudged forward and made contact with it, and it immediately shot up! From that day on I parked in the garage for free. I used to try and time my leaving so that no one was behind me to witness my \"trick\" but after a while I stopped caring and just went. I never paid for another parking pass *and* had the best parking on campus!",
            "Where you live, can you take the fine to court to fight it?",
            "Did something similar except they didn't charge me the ticket. The email telling me that they'd take the charge away basically said \"sorry,  the ticket guy just checks for the pass because there's no wifi in the garage.\" \n\nPaid 1 more month to be sure they didn't issue new passes seasonally and then used the pass for the next 5 months. But i only parked there a few days each month so it might not have worked indefinitely.",
            "About 16 years ago I worked in downtown [very large city], and usually took the bus from my apartment. Once in a while (for one reason or another) I drove instead. Parking was $1.25/day, and I always parked in the same lot and paid cash. One day I parked, double checked I had the right amount, and went to work. They came through and raised the prices by $0.25 that day, and put $75 tickets on the windows of all cars parked there before the price change. So I know it wasn’t just me.\n\nI avoided driving in for the rest of my employment there. Fuck them.",
            "I once parked in a parking lot that had no visible signage on the outside at all indicating it was paid (at least, not on the entrance I used. There were 3 or 4 different entrances). Doesn't help that the parking lot wasn't lit at all either and it was *dark* out. Didn't stop them from leaving a ticket. Put in a complaint on the site saying that there was no signage, never heard back, but still haven't paid anything either. No idea what's up with that.",
            "Step 01. Get van\n\nStep 02. Park van\n\nStep 03. ???\n\nStep 04. (25x21mths) 525 - 200 = 325 profit",
            "My university had ambiguous wording on their instructions for parking passes. It said to place it on the lower left hand side of the driver window (or something like that). So while most would assume it meant windshield I’m petty and placed it on my door window. When I pushed back against the tickets I mentioned how if I pursued it, and won it sure would be terrible how everyone who over got a ticket could say they had it in the other spot for them to give me my money and update the letter.",
            "Don't forget to sign up again for a month when the ticket gets too faded to read :D",
            "Reminds me of when I was going to college and a parking permit for a semester was about $150. And to get to campus from the commuter lot you would have to walk over a mile or take the bus. \n\nI realized after a semester or two that I could save money by parking just off campus in a “Two hour parking only” spot and walk to campus. Most days I would be back at my car after 3-4 hours and, if I remember correctly, the most parking tickets I got in one semester was two. They were $30 apiece. So I still saved $100 after paying them.",
            "[deleted]",
            "Obviously too late now, but the rules are that if you appeal a parking charge notice, the time limit for paying freezes, giving you the opportunity to appeal and still pay at the lower rate.",
            "When I was a teenager me and my formed use to go fishing every a few times a year.\n\nThe lake we fished at was city owned so you had to buy your permit directly from them.\n\nThe pass cost $25\n\nThe fine for not having a pass was $15\n\nMe and my friend never bought the pass and if caught would just pay the fine.\n\nThey eventually raised the fine to $50 but by that time we had stopped fishing there.",
            "Nice, you've recovered £325 more than the original fine.",
            "u/roodeeMental This is a great trick, turning their own obstinate laziness back on them. You could extend this scheme by scanning and HQ printing the permit. Archive that MFer and turn them out as-needed.",
            "I am somewhat petty and I think for petty revenge, it would be fun to file a small claims action and see what a real judge would say about payment of services not rendered.  That might open a can of worms but it would be interesting to make the \"company\" send a representative to court (or better yet, a lawyer that is being paid big bucks).  A fine of 75 beans (pounds) versus pain in the behind. As Oraxy51 below commented, I will use the term penalty, of 4X's the actual income.....might be interesting fallout.",
            "Is there anything stopping you from making copies of the placard before it gets more faint?\n\nKeep the original as your master copy.  When a copy starts to get faded or damaged, make a fresh copy to display.",
            "I wish I got a 75 dollar parking ticket, I got a 400 dollar ticket for parking on my front lawn to get the car off of a relatively tight street.",
            "Not sure how it works in the UK, but if this happened to me in the US, and if it was within 6 months, I'd additionally do a chargeback on my credit card saying that they aren't providing the parking services that I paid for, they fined me despite paying for parking.\n\nIf something similar might be an option for you I recommend looking into it.",
            "I did something very similar after getting a fine for a tram ticket I Melbourne Australia.\n\nI was a conscientious student a uni who wanted to do the right thing. I was a concession card holder, was told by the government agency (incorrectly) that I was allowed to get a cheaper concession ticket.\n\nOn my very first trip, a ticket inspector gave me a fine for having the wrong type of concession card for a concession ticket, I explained that I was new to Melbourne and it was an honest mistake, and was informed incorrectly. \n\nNo excuses apparently for a 17 year old just learning a new system. Wham $250 fine.\n\nNever purchased a tram ticket for about 5 years after that, I simply ran the gauntlet. Fuck them. They wanna play hard ball on a teenage uni student trying to do the right thing, then I'll just do the wrong thing....for 5 years of my uni degree.\n\nWant to make me out to be a faire evader for being advised incorrectly by the same people who the inspector works for....then fuck you, I'll just be a flat out faire evaider from now on :). \n\nYes I earnt back the $250.",
            "I love it!! Well done",
            "You know, there is a lot of shitty news in the world today . . . But this made me smile.",
            "How incredibly, otherwise indescribably British.\n\nWell done, sir/madam!  Well done indeed!",
            "£25\\month x 21 months = £525 saved\n£525 - £200 penalty = £325 remaining \nReturn of £325 and personal justice = Priceless.",
            "Our local council reems us each year for a parking permit. We bought a new car at the one of last year so I had to update the registration details. Problem was we paid for the permit on our old car in September so by the time we asked for a new one at the beginning of this year they had started issuing permits that expire in 2024. The new permit instead of expiring in 2023 expires in 2024. A year of free parking. It’s the little wins.",
            "Once I parked in a lot that you had to have a pass for.  I needed to get into a building to submit docs for school ends it was gonna be a quick in-&-out.  I come back less than 5 minutes later to a ticket on my window, like they were watching and waiting to check each car that came in.\n\nI accept my fate and go to pay the ticket online but it says that the ticket will not be available to lay for 2 business days.  Fast forward a week because I forgot about the ticket, I go to pay it off.\n\nTo pay the ticket you need to look it up by your license plate number.  I enter the plate but it turns nothing, which u thought was weird because the ticket should definitely be there by then. \n\nI can't figure it out but then it hits me.  My license plate has the letter O in it twice, the ticket they appear as 0 (zero).  So I enter that instead.  Sure enough there it is.\n\nBut, that's not my plate, so I never paid the ticket.  Never heard anything about it in the 10 years since.",
            "You need to cross post this to r/IllegalProLifeTips",
            "Blimey - your parking enforcement company must be the only one in the UK that does not use APNR",
            "Yup.  Fook 'em.",
            "I used to park in a lot all day downtown Kingston and my smart car would fit between the barrier and the gate arm.  \nThen I got a jeep and would bump the curb and go around the gate.  \n\nIf you can get a handicap permit (in Ontario at least) you can park nearly anywhere.  As long as it’s not a NO PARKING during a certain time period, or a no stopping, you can park under a no parking sign. \nAfter my accident I parked a car in downtown Toronto for 36 hours for free",
            "Just make sure to check others permits.  I've seen comments about sneaky places that change the color of the permits every few months.  Might be worth it to just buy a month, get a new fancy permit then cancel.  :)",
            "When I was a freshman in college, I had my car which wasn't allowed. I actually kept it at an acquaintances home for the major part of the first semester, but over time I finally went and got the car. I had a little potpourri sachet hanging from my rearview mirror. I was lucky and found a space to park in my dorm parking lot. When I walked away I looked back at the car and wouldn't you know it, that little sachete of potpourri looked just like the parking sticker! I never got a ticket. 😃 I kept parking there all year.",
            "There was a car parked on the street near my apartment a couple of years ago. It did not have a license plate on it, none whatsoever. The rule in Pennsylvania is a vehicle must be properly registered and insured in order to even be parked on the street.\n\nI kept looking at the vehicle every day as I walked past it and wondered why it had not been towed yet. It was there for about a total of 6 months and kept gaining parking tickets at least once a day.\n\nAfter a couple of days of not walking past it because I had to go in a different direction is when it finally got towed!",
            "There is no way this could bite you in the ass, eh?",
            "They gave you the holographic plans on how to blow up the moon sized bullshit",
            "When I was in college, the permit cost $250 and it kept going up every semester but the citation was about $45 and I only got it once because I was in a teachers parking lot that wasn’t labeled so I didn’t know. So the next couple years I just didn’t get the permit. I parked far away and it was so far away that the parking attendants never checked because they’d have to walk. The only time that they did have to start checking is when some idiot posted on Reddit and made it popular and then they started checking after that. So whenever I saw them I would move my car otherwise didn’t pay for the last couple years.  ￼",
            "That parking pass truck wouldn’t work at any college I went to. They kept changing the pass color.",
            "Given the sub, I'm going to get down voted.  However, this isn't malicious compliance.  It's straight up theft.\n\nAt no point was OP directed to not pay for parking while continuing to park.  That's just something they figured out on their own after being annoyed at having to pay a completely unreasonable parking ticket.",
            "Noice. One of the best ones I read in a while!",
            "my parents are old, but can't get a disability plate, so i just made them at work.",
            "I once got a fine at college because according to the parking attendant my permit was obscured by the air freshener hanging from my rear view mirror... Even though the permit tag was printed on both sides and was color and shape coded for the current semester.\n\nluckily I was able to get it dismissed because they automatically dismissed your first infraction for every semester and I didn't have any yet that year.",
            "When I got a new car I didn't put the plates on for 6+ months and rolled through the bridge toll booth 4 days a week w/o paying.  $80/mo for 6+ months was nice.",
            "Handicapped placards.   Just gotta have some kind of mobility issue to get one. Talk with your doctor.",
            "Ok, that actually made me lol",
            "OH you sly fox you!!!",
            "I don't feel like this is malicious compliance.. Feels like fraud on your end though.",
            "U/teamsfm34",
            "That’s actually hysterical lol.",
            "NOICE",
            "Would have been an easy win if they wanted to take you to court. Popla is a waste of time nowadays too.",
            "on the brightside, you \"made\" that $200 back and then some",
            "I hope your reported him!"
        ]
    },
    {
        "post_id": "m77nsc",
        "author": "Teekno",
        "title": "Well, they had to feed us the school lunch.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/m77nsc/well_they_had_to_feed_us_the_school_lunch/",
        "score": 14003,
        "num_comments": 419,
        "created_utc": 1616007215.0,
        "selftext": "Many many moons ago, I was in high school in a small town in the central US. We had an open campus (meaning we could leave for lunch) and a popular lunchtime event was to go to McDonald's in a larger, nearby town. We had a 45 minute lunch period, and in 45 minutes, you could drive to McDs, go through the drivethru, and stuff your face on the way back.\n\nOf course, there was also a school cafeteria. However, this cafeteria wasn't actually at the high school -- it was at the middle school, and it served the middle school, the high school, and an elementary school, bussing students in to eat their lunch.\n\nMy senior year the administration set up a new schedule, and one thing that it did was shorten the lunch period by five minutes. Maybe not a big deal for some. But the folks that drove to McDonald's? You could do it in 45 minutes. You could not do it in 40.\n\nThey complained, it fell on deaf ears. So, someone (and I really wish it had been me) came up with a brilliant idea: eat at the school cafeteria.\n\nSo, suddenly, where about 30% of the high school students ate at the cafeteria, that number nearly doubled. The effect of this was that the elementary school, who ate *after* the high school, had to stand and wait because the cafeteria's schedule was based on how many students they expected to show up.\n\nSo we are eating in the cafeteria, and then nearly a hundred kindergarteners are just standing outside, waiting to come in. There wasn't anything the cafeteria could do -- they just didn't have the capacity for more students. And there wasn't anything the school could do, because they can't tell us not to eat at the cafeteria -- they're legally obliged to provide a lunch to the students that want one.\n\nIt was very effective, and they restructured the high school's schedule less that two weeks into the year to add those five minutes back so that they didn't have dozens of hungry five year olds.",
        "permalink": "/r/MaliciousCompliance/comments/m77nsc/well_they_had_to_feed_us_the_school_lunch/",
        "comments": [
            "Concise story, effective mass MC.... and almost delicious.  Kudos",
            "I wish they had open campus when I was in high school (2011-2015). I remember one point I had to go to a Dr's appointment, and because I had a truck I only had to miss part of the school day and not the entire day. Well, I had to show them proof of my appointment before they would let me leave. Not having anything on me I had to call the Dr's office and hand over my phone to the school staff for them to be told that, yes, I am expected to be there.",
            "Jeez! We only had 30min lunch break! Sucked because there's an In N Out just over 5 min walking distance away. But everyone knows that with their lunch rush lines, you'd be lucky to get back to class on time while inhaling the food which doesn't make it worth it. And no cafeteria at school. They sold food but there's no line. Just a mass of students crowding yelling their orders to the workers holding their money out hoping one of them helps you before running out of time.",
            "Complaining parents vs. Complaining teens... \n\nYou guys were getting that 5 mins back, for sure. \n\n#😂",
            "Wait... 30% of the highschool ate mcdonalds for lunch... every day...\n\nSweet mother of french fries...",
            "This reminded me that at 43 I still occasionally crave that square school cafeteria pizza.",
            "I feel like the parents of the kindergarteners were the most angry people... kids remember that shit lol",
            "I feel bad for those little kids though. It’s not their fault the school board is stupid.",
            "45 minutes? Mine were only 25. We barely had time to run across the parking lot, then across the road to a pizzeria, get from their prepared takeout case, then back across before lunch was over. I don’t know who it was that planned our lunches, but they expected students to be able to get food and eat within that time even for those who left for lunch. Our school also had its own cafeteria, but the school was made for 1,000 students, and the cafeteria was made to hold 50 in 3 separate lunch blocks. Each year an average of 8 students have gotten in accidents rushing back, many hundreds have come back late, and some kids would go hungry. 25 minute lunch policy is still in place, their “fix” for it, is to build a bigger cafeteria and take over the adjacent junior high school, kicking the 7th and 8th graders out to a new school, and end open campus lunches.",
            "I find the entire idea of being bussed to the *cafeteria* entirely baffling.",
            "Open lunch was the best.  The grocery store near our school had cheap fresh pizzas on Tuesdays, so I'd call and order one in Chemistry class, then drive and get the pizza at the beginning of lunch. There'd be a big line of students ordering pizza, but since is I'd called ahead I could just go straight to the register, pay, and walk away with my pizza for me and my friends. \n\nGood times.",
            "What kind of school district doesn't have cafeterias for each school. Tf? Where's all those tax dollars going? Great compliance, but the problem was dumb to begin with.",
            "Nice! Good on you all.",
            "My senior year of high school, my science class was a mix of seniors and juniors.  It was the period just before lunch, and usually we were hungry.  There were a couple of people who could not wait, and would sneak parts of their lunch during the class.  It became a running gag.  That turned into comments about having McDonald's.  The closest one was about 25 minutes away, doable but close time-wise.  A couple of the \"offenders\" had a free period right before science, so they hopped in a car, drove to the McD's and then ran back to school and at their burgers and fries in class.",
            "Did the students have to pay for the cafeteria lunches?  If so, sounds like the cut of the 5 minutes was some administrator's plan to force kids to use the cafeteria so it would make more money.  At my old elementary school, the principal wanted to make more money selling ice cream so he told the ice cream truck man that he could not park in front of the school anymore and sell to kids through the fence.  The ice cream truck man was a 1 man operation so he did not have the money to fight in court.  I wish he could have fought it.",
            "My high school had these mysterious and delicious egg rolls that I have never found as good anywhere else.",
            "Yeah it’s malicious compliance but to f**k with little kids to make your point is mean. IMHO",
            "Clearly the school staff failed to think it thru.\nUnfortunatly this happens a lot.\nIf it isn't broke, don't fix it.\nThanks for sharing.",
            "Learning how and when to break rules is the most effective thing I learned from public school.",
            "This story is great except that nobody should eat at McDonald’s every day!",
            "Except for the location of the cafeteria, the school sounds eerily like my HS.  Open campus, McDonalds roughly 15 - 20 mins away.",
            "My school district did elementary = k-6, middle = 7-9, high school = 10-12.  I went to high school in 10th grade and we had open campus. The next year when I was in 11th grade they decided to move 9th grade to the high school for some reason, and close the campus.\n\nProblems they didn't consider: \n\nLess than half the students, so 1.5 grades worth of students ate lunch in the cafeteria.  Suddenly 4 grades worth of students ate lunch in the cafeteria.\n\nYou needed 1.5 years of PE to graduate.  Most people took a year in 9th grade.  This meant PE went from 1/2 a grade worth of students to 1 1/2 a grades worth of students.\n\nThe school was *completely* unprepared for 3x the students in PE and lunch.  They did eventually manage to expand PE enough for all the students, but their solution for lunch was to split it into 3 periods!  Early lunch was at like 10am.",
            "This sounds awesome, but Maccas for lunch just about everyday?! That can't be healthy lol",
            "Brilliant. But what a weird setup. You had to take a bus to go eat lunch?",
            "They should build a cafeteria for the high school on campus. The amount of gas getting used to get you all lunch is ridiculous.",
            "Only in america is restored access to mcdonalds something to fight for.",
            "The Students used Malicious Compliance, it was super effective!\n\nThe Suits fainted!\n\nThe Students defeated The Suits!",
            "Something similar happened at my previous place of work. The manager wanted to get a better hold of our breakfast times, so she held a meeting with her department (one department out of many) about what time we should hold breakfast at. They wanted to hold a vote among the operators, but I pointed out that we should look at other's breakfast times to keep from swamping the kitchen. I was told I was trying to complicate things too much, and 8AM was voted on. For a few days the line would wrap outside of the lunch area (maybe 50' in total). The lunch staff was pissed and demanded we stop showing up at the same time as everybody else. It was maybe a 15min line for a 20min lunch, and that was screwing up all of the other departments with a similar breakfast time.",
            "I'm really curious how the cafeteria could predict how much food to prepare on any given day.",
            "I went to a technical high school, took machine shop.\nThe cheese on the cheeseburgers was exactly the color and consistency of the soluble oil coolant in the power hacksaw machine. A grey yellow milky color.\nMakes me nauseated just thinking about it.\n🤢🤢",
            "I loved the lunches at my middle school the first 2 years until they started busing and moved the classes around (late 1960's). The school had homemade sandwich buns and made their egg salad. Basically, any bread was made fresh, including pizza crust. I quit eating lunch room food when I found (gross out warning) the pudding I got was more a mass of hair with a bit of pudding on top. The kitchen staff wasn't happy since a \"black\" high school was broken up and school was made a middle school.",
            "One of my elementary schools, the lunch ladies actually cooked real food. The kitchen was down in the lowest floor of the building, the windows  would release delicious smells to the P.E. fields.  Think real homemade beef and noodles, chicken pot pie, vegetable soup and mild chili. The chicken noodle soup tasted so much like my grandma’s, I thought they stole her recipe. And the desserts! Sheet cakes with actual fudge or vanilla frosting, pineapple upside down cake, and real puddings (especially the butterscotch)! This was early 1970s,  in the South.  And also edible vegetables, usually cooked from fresh, not canned. Real green beans (with bacon, this is the South), stewed tomatoes and rice, Fresh corn on the cob. Real corn bread. My mouth is watering now.  Fried chicken day was epic.",
            "That’s crazy, my lunch in high school was 1hr 25mins.",
            "Well played. Dozens of bored and hungry five year olds sounds like hell on earth.",
            "Yall should have held out for 10 minutes",
            "Lmao that MC is so perfect it doesn't even need ketchup!",
            "Bravo",
            "I feel kinda bad for the kids, but it was a worthy sacrifice!",
            "Wow, now THAT is some sweet malicious compliance at its best.  Bravo",
            "I don’t really understand this cafeteria stuff, is it free food? And do you have to eat it at most schools? Can you just take your own lunch if it’s so bad?",
            "Me and a group of friends, about 20 of us used to all eat at one table in high school. One admin took our table away because we were the weird kids and he didn’t approve. We ranged from freshman to senior, and decided to eat in the un-used senior courtyard just outside the cafeteria. The first day he told us to come in and we explained that he took our table and we had no were to sit, he told us to split up. We went to his boss and they told us we could eat in outside thus begun the weird kids eating outside much to his displeasure.",
            "In the late 90’s my middle school had carts that began to sell McDonald’s cheeseburgers and slices of dominos pizza, alternatively you could always eat whatever slop they were serving in the cafeteria. They also decided to remove the “healthy” hansens sodas in the vending machines for coke and sprite lol. In high school similar carts were selling Taco Bell bean and cheese burritos.",
            "This school district sounds like it is run by morons",
            "This feels a bit more like... butterfly effect, rather than malicious compliance, but I do see where the MC comes in. Take away our five minutes? We'll make all the elementary kids wait 30 minutes and miss their schedule altogether!",
            "Jesus. We had 20 minutes for lunch, if we were lucky and our pre-lunch teacher let us out on time. You were lucky if you got through the line and got your food before lunch was over. You just prayed that your 5th period teacher didn't mind you being late if you wanted to eat.",
            "It's really depressing to hear about what sounds like dozens to hundreds of cars all making the same 30-40 minute round trip drive every day for something as stupid as a McDonald's lunch. :(",
            "As someone born in 90 (and poor enough to get other people's food) almost all the school food I ate was garbage. The only exceptionS that come to mind are fried chicken and pizza.",
            "Come post this in r/maliciouscompliancejr",
            "Great job!!",
            "I remember eating spaghetti sandwiches after school.",
            "Lasso: See you at lunch, huh?\n\nLUNGFOX",
            "I miss the deep fried burritos from my school, mid to late 1980s.  The only place I can find them now is at Disneyland... chimichangas.",
            "Is it common for schools to bus students to a central cafeteria? I went to some truly shitty schools but they all had their own cafeteria, at least.",
            "Aww poor kindergartners..",
            "💎👋🚀",
            "What happened to those peanut butter bars? Greasy but really good!",
            "Man we either had school lunch or what we brought from home and had 20 minutes to scarf it all down, and that included the 10 to 15 minutes you waited in line for food."
        ]
    },
    {
        "post_id": "cax8ad",
        "author": "DeadlyGerbil",
        "title": "Cut my job? Say goodbye to millions of dollars!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cax8ad/cut_my_job_say_goodbye_to_millions_of_dollars/",
        "score": 14003,
        "num_comments": 374,
        "created_utc": 1562654819.0,
        "selftext": "I worked for a major (U.S.) telecommunications company for over 10 years.  One of the jobs I had there was as emergency overnight tech support for our major accounts.  I'm talking about accounts like emergency services, traffic lights, the FBI, NASA, and the White House (I personally fixed the White House Chief of Staff's phone twice).  All of this was handled by 11 people in a call center that was one of two in the country that were open all night (mainly for customers who were overseas).  Because we were such a small team, and the people we dealt with were the overnight I.T. people at their various companies, we were on a first-name basis with many of the techs who called us.\n\nThen, one day, the VP of our company decides to step down as VP and take a job as the head of another call center.  His brilliant idea is to make HIS call center the ONLY call center for all business and government accounts in the country--including the ones my team handled overnight.  Naturally, this meant dissolving my team.\n\nWe were all very upset.  We liked out job.  Only the absolute best techs got to be on our team, and for good reason.  When something we handled went down, it had to be taken care of FAST, and some of the systems we dealt with were so obscure or old, that no one at the company except us and our daytime colleagues even knew they existed.  This also meant that we had to be ready to answer at a moment's notice, so we spent most of the night doing nothing, just waiting for a call.  The companies and government entities paid extra for this quick response.  Even so, over the years, my team kept getting assigned more and more little jobs to do \"between calls,\" which we handled easily because, well, we were the best.  It was almost my dream job.\n\nSo when we get word that our jobs are going to this other call center that, until now, wasn't even open overnight, we were upset, yet most of my team was still pretty supportive.  We offered to train the new techs at the other call center, some of us even offered to travel there for a week or so to do it, but we were all turned down.\n\nOur last week on the job comes, and we're there mainly as backup for the new team in the other call center.  We're not being routed calls, but we're ready on chat if the new guys have any questions.\n\nThe questions start coming in, and they're NOT what we expected.  Instead of asking about obscure, outdated systems that no one but us even knew about, the new team is asking us about things like how to fill out a time sheet for a shift that starts before midnight and ends after.  And this was their supervisor asking me.  We end up answering really basic questions that anyone at our call center, much less anyone on our team, would have known, and we all got a bit worried.  Then the supervisor who asked me about the time sheets asks how many calls we typically get in a night, and I say \"oh, between two and five per person, usually.\"  Then he asks how many people were on my team.  \"Eleven,\" I say, \"Eight to ten on any given night.\"\n\n\"Oh,\" the supervisor says.  \"We have thirty-three.  I wondered why we were getting so few calls.\"  They didn't have to do the little tasks my team did between calls, either--they couldn't, they weren't even trained for the calls they were getting.\n\nThe next week, my team was transferred into the normal overnight call queue, handling boring calls from people who didn't read or listen to the directions we gave them about how to make their phones work while overseas.  Sigh.\n\nA week after that, other regular overnight reps start asking me and the other former elite reps questions about systems that only we would know about.  Suspicious.\n\nA few days later, I get a call transferred to me, and it's one of the overnight I.T. guys from the major accounts.  I ask how he got hold of me, and he says that the first guy he talked to transferred him to me.\n\nTurns out, of course, that the untrained reps at the new call center were still untrained, so they were just dumping the calls into my call center's general queue and hoping that out of the 60 or so techs working there, the one who'd pick up would be from the former major accounts team.  Since three of our eleven people had quit when our team was dissolved, the odds of that were pretty damn low, which meant it took multiple transfers, which meant they weren't getting the help they needed in the time frame my company was contractually obligated to provide.\n\nI went to the director of my call center to let him know about this, hoping it would mean that since the new team was failing THAT hard, the company would see reason and reinstate my team again.  Nope.\n\nMy director informed me that the team would not, under any circumstances, be reinstated at our call center.  I could tell he was not happy about this at all.  So then came the malicious compliance.\n\nMy director told me and every other overnight tech at my center that if we were transferred a call for a major account, we were not to touch it, as we were not authorized to handle those accounts.  The next night, the accounts wouldn't even open for us, because our \"security clearance\" had suddenly been revoked.  We were to transfer all such calls back to the correct queue.  We were also instructed to forward any correspondence sent to us from the new major accounts team to our supervisors, whether chat or email.  In a few days, the transfers to our center stopped.\n\nNow, I wish I could say that the company saw the error of its ways, my team was reinstated, and everything went back to the way it was, but it didn't.  Instead, the company hemorrhaged major accounts like crazy.  We lost accounts whose MONTHLY bills were in the millions of dollars due to our failure to keep the terms of our contracts.  Barely a month after it was created, the overnight team at the other call center was disbanded, and the jobs outsourced.\n\nThen the outsourcers started transferring the calls to my center.  Again, I went to our director, hoping against hope my team would be reinstated.  Nope.  But the transfers stopped.  Again.  And the company lost even more multi-million-dollar accounts.\n\nLast year, the company announced the layoff of tens of thousands of employees.  I wonder why...  I saw the writing on the wall, and got the hell out with the best severance package I could.  So did my call center director.  He was no fool, either.  All because some idiot executive had a \"bright idea\" and not even the slightest clue how to execute it.\n\nEdit:  Thanks for the votes and awards!  I especially love how people have listed basically every major telecom in the U.S. as a possible example of this level of idiocy.  Just goes to show that it's a systemic problem.  I was afraid people might find this story too boring or depressing.\nIt has a happy-ish ending, though, because thanks to my generous severance package, I am now able to pursue my actual dream job of being a professional writer.",
        "permalink": "/r/MaliciousCompliance/comments/cax8ad/cut_my_job_say_goodbye_to_millions_of_dollars/",
        "comments": [
            "I think the following sums up what happens when someone high up gets a bright idea:\n\n&#x200B;\n\n*I just had a great idea !* \n\n(Going to make me look so great in the reviews)\n\n&#x200B;\n\n*Should I sanity check it with the people who know how things work ?* \n\n(The idea is simply perfect)\n\n&#x200B;\n\n*No ?* \n\n(I don't need the help)\n\n&#x200B;\n\n*Fire the people who know how to do things and replace them with untrained staff to save a few dollars ?*  \n\n(Saving money makes me look good)\n\n&#x200B;\n\n*Well that looks good on paper but what about the people who pay for the services who are no longer getting the service they pay for ?* \n\n(where are they going  to go anyway ?)\n\n&#x200B;\n\n*They are leaving ?*  \n\n(Don't need them)\n\n&#x200B;\n\n*Great idea person looking into a mirror: \"So hard to find good employees these days\"* \n\n(Clearly not my fault)",
            "Sounds to me like someone was planning to start a new business handling these accounts and needed to kill the contracts so his new company could get them.",
            "Said exec also lacked the testicular/breasticular fortitude to admit they were wrong. That is a fatal flaw that I wish companies would recognize and eliminate those employees, even when they are near the top of the chain.",
            "Ah I see you worked for that company! The one where change is supposed to energize us right?",
            "Had a job similar to this once. Centre manager ran it into the ground. I bailed before it got bad, but I distinctly remember being expected to train my better-paid, less-experiences/qualified replacement. I could write a book about the incompetence and criminality in that place from management... I felt very vindicated when I heard, a couple years later, that the center had been shut down.",
            "This has to be a trend these days. Most of the tier 2 support teams I rely on for my job are being replaced with call center techs who are clearly reading out of a binder. Thanks to you and your team for everything you did to stay the best. I hope the trend starts swinging back the other way.",
            "All part of the plan, right? The new management team was brought in *specifically to kill that company* so that the CEO and board cold \"retire\" and liquidate with massive bonuses.",
            "It's stories like this one that always make me laugh when someone says \"Private industry is always more efficient than government, because when people's money is on the line performance is always rewarded and this leads to greater efficiency and less waste\"\n\n&#x200B;\n\nAny idea what happened to the VP with the bright idea? It's been my experience that they usually manage to fail up - blaming any consequences of their bad decisions on someone lower down in the food chain than they are.",
            "> I went to the director of my call center to let him know about this, hoping it would mean that since the new team was failing THAT hard, **the company would see reason** and reinstate my team again. Nope.\n\nHaving worked for *probably* the same company:\n\nHAHAHAHAHAHAHAHAHAHAHA\n\nBureaucratic dysfunction and pig-headed doubling down on mistakes is baked into the RBOC cake.",
            "I wouldn't be surprised if this didn't play out exactly the way that VP planned.  What is that person doing now?  Does (s)he head a new company that services those accounts?",
            "Executives Totally earn their million dollar pay checks as they obviously provide so much more value to the company than even a dozen specialized workers\n\n/s",
            "> The questions start coming in, and they're NOT what we expected. Instead of asking about obscure, outdated systems that no one but us even knew about, the new team is asking us about things like how to fill out a time sheet for a shift that starts before midnight and ends after.\n\nThis really struck a chord with me. I am recently going through something similar (though not anywhere near as prestigious). My company has just negotiated an extension of our contract with the client. Ink not even dry yet and they decide that they are shifting all UK based teams over to India (by that I mean they are firing all their UK techs and replacing them with Indian ones). We are expected to do some knowledge transfer, thinking it will be things like processes on this client, how the AD is set up, what jobs we do and how to go about them. Instead we get asked basic questions like how to reset a password (generally dealt with by frontline anyway so such issues should not come to us), how to do a profile reset. In one case, we even had to give them an entire overview of PSTools, and basic CMD commands (tracert, ping, net use, etc). \n\nSo we are going from a well trained team who are frequently one of the best teams on this client and replacing them with (from my experience so far) people who don't even know how to do basic frontline stuff, never mind second line. \n\nI suspect it is going to go to shit, the other teams are already in serious trouble (we have to have a weekly call with all teams, SDMs, ODMs, etc involved to go over every team's queue, see where they are going wrong, and try to fix it. Problem is, even basic stuff such as the strike process or putting the ticket on hold have an 80+% failure rate) and now they are replacing the second line team, and the incident management team, with a single Indian team (conflict of interest much? Incident management should not also be the second line support team). Sorry for the rant.",
            "These are stories Im here for! Im sorry you had to go through it, they did it to themselves and dont deserve the clients.",
            "[deleted]",
            "the most depressing part of all of this is that the idiot who made these executive decisions gets paid so much more then you hard workers",
            "I worked over 10 years in an IT call center for a major US financial company. The parallels between your story and my experiences are impressive. I eventually left IT and towards the end the stress and frustration with the job was coming from management and my colleges not the actual customers. I watched management make one poor decision after another while ignoring advice and suggestion from the people with the most experience. Met up with a few of my old colleges and learned that there has been a massive exodus of IT employees from that company. Almost half of the IT staff (which was easily 1000 people) left, they've gone through two CIOs since I left, the whole thing is a mess.",
            ".... *some idiot executive had a \"bright idea\" and not even the slightest clue how to execute it.* \n\nSo then they'll EVENTUALLY learn that they need a qualified help desk in order to get and keep the accounts after MANY, MANY years.  So they'll get a well-qualified help desk AGAIN.  Then......\n\n...  *some idiot executive had a \"bright idea\" and not even the slightest clue how to execute it.* \n\nAnd they'll build up a help desk AGAIN \n\nand OVER and OVER and OVER!!!\n\n&#x200B;\n\nI've seen companies do this with outsourcing support to save money....only to realize that they don't get the same quality of support.  So they bring it all back in house.  Years pass and someone mentions that they can save money by outsourcing....",
            "Sounds like the company I worked for, 11 years service I gave them employed via outsourcing agency.\n\n&#x200B;\n\nWhat happened in my scenario was the company were willing to lose skilled workers to save some money, We were 2nd level analysts with high security clearance yet were paid less than other 2nd level teams due to technicalities such as we didn't remote onto user's machines & other bullshit . After 11 years I was told my contract would not be getting renewed & they me to train up Uni students as my replacement. These students were 1st/2nd year students & they struggled with some of the basics such as mapping a drive, I did feel for them being flung into the deep end & I don't think they fully understood what they were being landed with. \n\n&#x200B;\n\nEventually the contract was lost not long after my team were disbanded & I still have some of the students on my linkedin, the experience doesn't appear to have broke them.",
            "... meanwhile, said executive probably had a million dollar parachute and never really felt the sting of their decisions.\n\nShit like this is why I refuse to ever go back on the phones.",
            "Ugh, I really felt this as I'm from the same industry. I have great pride being able to resolve issues within our SLA, but bosses absolutely don't care or appreciate it.",
            "You need to start a company.",
            "[deleted]",
            "Hah, didn’t even have to say it was AT&T for anyone to know it was them after just a few sentences.\n\nAbsolutely horrific company in every sense.",
            "You should write a letter to the shareholders about this mismanagement. Open a consulting company on the side for yourself doing \"forensic IT consulting\" or something like that. If there's a shareholder derivative suit against management, you ask them to hire you as an expert witness for a few hundred dollars an hour-",
            "This just sounds like how businesses run now a day, clueless in charge and no sense of economics. Either they are trying to destroy the company or they are dumber than dog shit.",
            "Make a business plan, get on old crew back to together, reach out to your former associates that know you on a first name basis, profit.",
            "r/talesfromcallcenters",
            "This reminds me of a MC story from my days at an ISP (smaller) call center/NOC... I'll have to type it up sometime.",
            "I worked for a small sub-contractor of AT&T and all this sounds exactly like how they operated.",
            "I just don't get the whole \"No, I don't even need your help training these guys.\" Talk about some insane levels of Dunning-Kruger.",
            "God this made me happy. Not for OP and his co-workers of course, that sucks, but getting to read about how some asshat in a suit so magnificently crashed and burned is almost orgasmic.",
            "Sounds fun! Only wish you 11 grouped up and start you’re own company of the sort, and basically ran things the way it should. Assuming it’s within the terms of your contracts..",
            "I used to work for a major insurance company. They launched a \"support center\" and are having agents fire their customer service staff. I left because my job in sales magically became customer service overnight as incompetent call center drones sent crap my way. Anyone with half a brain could've told the brass that it's a dumb idea, but nope, we aren't smart enough to make those calls.",
            "I always find it interesting when bad executive choices lead to laying off lower employee's instead of reversing bad idea's or laying off the bad executives.\n\n:/",
            "Why on have you not started your own consultancy to just one of these massive players! Do it... pleaseeeee!! And then follow up...",
            "You should have reached out directly to these high VIP clients and offer to work for one of them exclusively.",
            "It's always the suits with business degrees who think they know how to run things... sheesh.",
            "Yet another case of a big time idiot wanting his resume to look good and killing a company.",
            "Not the same industry but this happens all the time.  Someone, usually in their late-twenties to early-forties gets hired on as a middle manager, decides they have to put their stamp on something right away.\n\nThis usually comes in the form of taking a process \"that works\" that all parties usually agree needs to have some money invested into it and doing it \"their way.\"  Their way almost always involves not understanding why the process is the way it is (things evolve over time, they evolve because of lessons learned), and not quite understanding the truth of the investment to get said process right.\n\nThen they miss basic deadlines, cannot perform mandatory tasks and the *originals* are usually moved to other tasks and given other duties.\n\nIf something is working, hitting your mandatory deadlines, and everyone is happy.  Unless you are going to learn that process and invest the resources into improving it..don't break what isn't broken.  I may be able to automate a process that saves me an hour a month--but if I can't justify the half-to-full work day to get there--I guess I'm going to do it the annoying manual way.\n\nTLDR; if you get hired in as a middle manager-to-director, ingratiate yourself with the team and don't make sweeping changes before understanding why things are the way they are..it's easy to say \"it's broken because people are lazy or bad.\"  But often times, \"it's broken because people have other responsibilities and they can't get the resources/time to innovate a process.\"",
            "Sounds like the work of a MBA.",
            "No good call center job stays good forever. Some clueless exec or puppet middle-manager always manage to ruin it.\n\nVarious studies have found that 70-80% of customers leave due to poor customer service (the remaining 30-20% is for things like \"found a better deal\" or \"no longer needed\"). I find it strange that this info is widely available, yet customer service is often the first department to be hit with budget cuts.",
            "This is a great learning experience for any company. They should read this to understand how a seemingly small change can lead to a major fuckup. \n\nNow with that said, I don't actually see where the malicious compliance is?",
            "Typical management at a big company. They are afraid to ever go back on their plans, regardless of who it hurts or how bad it hurts the company.",
            "Sounds exactly like AT&T......I left them also.",
            "I worked for a fortune 500 property insurance company for a few years. I live in a small town but our location had been around forever and had become the central hub for operations. A few years ago myself and 600 other people got laid off, as the company was sacrificing our location to open a new one in a larger city that had promised the company financial benefits my small town couldn't afford to compete with. \n\nOver a YEAR after the transition, a friend of mine still with the company told me their quality/productivity ratings were still down 80%. A YEAR LATER. \n\nNow, the company moved back. Less than five years later.",
            "Seagull management. \n\nFly in. Shit all over the place. Fly out.",
            "Yeah, sucks to work for ATandfee when they decided to churn.",
            "[deleted]",
            "I know exactly what company you worked for, and it sounds exactly like some BS they would pull. I'm glad I don't work for them directly, though I'm still a little too close for comfort.",
            "Did you work for a company that used to be something that rhymes with blingular and smellsouth?",
            "These 'bright ideas' from high up executives have got to be sabotage",
            "You didn't have any room for deviation. You were reassigned and had your access revoked. Not a MC. This was a boss shooting himself in the foot and you were powerless to do anything about it.",
            "Another classic example of \"If it ain't broke don't fix it\".",
            "The stupidity of some companies is mind blowing",
            "Sounds pretty typical which is highly unfortunate.",
            "I really enjoyed the way this was written. I think that bodes well for your future career in writing.",
            "Cross-post to r/talesfromtechsupport, OP. This fits that sub so well that I thought I was there.",
            "I wish I could be happy about the malicious compliance, but I'm just really sad about the way that went down. Fucking idiots in charge of shit they don't grasp, and refuse help SEVERAL times when clearly needing it. :(",
            "Hate to say this, but quit being so naive.\n\nThat dumb executive was doing exactly what he was told to do. For some reason, the powers that be wanted the company to fail on the books. Maybe a client transfer to a new company. Maybe as a business write-off to a parent company. \n\nBut this type of thing goes way behind one dumb executive.",
            "Sprint?\n\nI used to work for them, sounds like something they'd do.",
            "r/nuclearrevenge",
            "Management initiatives that only benefit management are the worst business mistakes.",
            "Great story; I'm a sucker for r/IdiotsManagingThings tales.",
            "Ya know, I have buddies in IT and system admin. Years of stories have me convinced that the people who run these tech companies don't know what their actual product is. Ya know, the type of person that values someone with a degree and fancy talk over someone that can actually do the job right the first time without leaving a mess for someone else to clean up, or the type of person that's worked in the field for years and has the training vs hey let's outsource this to India where they can't do but a fraction of what we can. Good plan.",
            "Oh boy I hope it’s Comcast",
            "I would love that job lol",
            "The corporate dystopian.",
            "[watched a video](https://www.youtube.com/watch?v=PqFr9iF1bRU) on you",
            "LOL, this makes me feel like a 13-year-old could run this better than him, oh wait, I am a 13 year old!",
            ">I saw the writing on the wall, and got the hell out with the best severance package I could.\n\nHow did you get a severance package if you left willingly?\n\n&#x200B;\n\nEDIT: Thanks for downvoting me for asking an honest question. Googling \"define severance package\" yields \"A **severance package** is pay and benefits employees receive when they leave employment at a company unwillfully.\" You guys suck.",
            "So..tldr. After 1st paragraph I noticed he mentioned contract jobs...not service related but contractual government accounts...that place price above quality. So no ranting is going to change that",
            "Sounds like Verizon - Federal Solutions, but man you sure are divulging quite a bit if you're someone that potentially held up to a TS/SCI - Yankee White.\n\nI hope you're embellishing slightly, because as written one could argue you're violating some conditions of your security clearance.",
            "Guessing this was Verizon. \n\nYour mistake was thinking you were some kind of tech god.",
            "/u/uwutranslator",
            "Somebody call Elizabeth Warren.",
            "TL;DR?",
            "On my lunch break I need a tldr",
            "No one uses a TL;DR anymore? FFS.",
            "Where is the tl;dr?",
            "[deleted]"
        ]
    },
    {
        "post_id": "szcdgc",
        "author": "daschande",
        "title": "New dress code for the IT department (of one person)",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/szcdgc/new_dress_code_for_the_it_department_of_one_person/",
        "score": 14000,
        "num_comments": 538,
        "created_utc": 1645604732.0,
        "selftext": "Not my story, written for dramatic effect but  not exaggerated or fabricated, TL;DR at the end.\n\n---THE BACK STORY---\nFather in law works for a heavy equipment manufacturer; highway making equipment, machines for gold and gem mining, etc. The machines aren't really relevant to the story; only that they're big and scary enough that everyone is VERY strict about safety. Well, almost everyone...\n\nThis company has one \"IT guy\", he does everything from web admin to the \nID badges to \"the printer isn't working\"...so obviously he needs an office with a computer. Only problem is, most of his job is keeping the ancient assembly line machines on life support; so he's constantly on the factory floor fixing error code TI-86 on machine C-137, etc.\n\n---THE PROBLEM---\nOne day, one of the VPs of ass-kissing deigns to leave the plush veneer of the C-level suites to enter the \"plebian\" office... and takes GREAT offense to the IT guy wearing jeans, boots, and a high-vis vest in their \"STRICTLY suit and tie\" office! Protests about his job duties fall on deaf ears; and since the IT department of one person doesn't have an official C-level officer, VP of ass-kissing decides to write a new dress code for the IT department. Suit and tie at all times. No exceptions.\n\nIT guy shows up the next day in a suit and tie, tries to fix an error on the factory floor, and (rightfully) gets turned away at the door  for lack of safety gear. He spends a few days in his office goofing off while the errors on the factory floor grow and grow.\n\n---THE FALLOUT---\nFinally, around 3 AM one night, BIG production line X goes down. This is a HUGE contract for the company; the company might go under if this client goes elsewhere! As such, emergency procedures state ALL C-level execs and even the owner MUST be notified immediately if this line stops at any time for any reason... so the upper echelon of the company (including VP ass-kisser) assembles in the board room to prepare for their firing spree!\n\nAround 5 AM, IT guy is ordered to the boardroom where they really lay into him before they fire him. Threats of blacklisting him in the industry, threats of lawsuits for damages, etc. Of course, there's the condescending \"Now what do you have to say for yourself?\" question.\n\n---THE MIC DROP---\nHe unfolds a few pieces of paper from his pocket and puts them on the table in front of the owner. \"THIS is why I have to wear a suit and tie no matter what, THIS was my objection because I have to do my job properly, THIS is the safety officer refusing me entry for lack of safety gear, and THIS is the record that VP ass-kisser got my e-mails but never responded.\"\n\nNot a pin drop or a cricket chirp could be heard, just the faint ruffling of pages as the owner read. Finally, he spoke. \"Your so-called dress code is officially revoked. VP ass-kisser is no longer allowed to have any authority over you. Please put on safety gear and fix machine TK-421.  The rest of us will stay here all day until I'm convinced that this problem will never happen again.\"\n\nVP ass-kisser kept his job (he was very good at his namesake, after all), but he was transferred to VP of a division that didn't exist and a workforce of one; only him. Rumor has it he's related to the owner somehow, but at least his self-righteousness can't ruin the actual work being done!\n\n---TL;DR---\nIT guy needs to wear safety attire to do his job on a factory floor. Random VP is furious he wears that gear in his own office, and makes a company policy requiring him and him alone to wear a suit and tie at all times. Policy backfires because IT guy can no longer fix the ancient manufacturing computers, and production screeches to a halt; potentially costing the owner his entire business.",
        "permalink": "/r/MaliciousCompliance/comments/szcdgc/new_dress_code_for_the_it_department_of_one_person/",
        "comments": [
            "\"IT Guy, why are you not at your post?\"  🤣",
            "C-exec: you caused this horrible problem. As a result, you're fired and blacklisted in our industry.\n\nWorker: actually, this VP is the one responsible.\n\nC-exec: oh... Well we'll give his own department and a raise then.",
            "I really hoped the fallout would be greater for the VP ass kisser. Awesome story though.",
            "I had similar for a short while but thankfully was extremely short lived. My answer was simply \"can you tell me exactly which days I will or won't have to crawl into a crawlspace, under a desk, or into the ceiling? Are you willing to put in writing that I won't have to do any of that work regardless of how critical it is if I show up in a button down and slacks? If not, jeans and polo's are easy to clean so that's what I'll wear\". They stopped trying to talk to me.",
            "Wearing a tie on a factory floor can be a death sentence. What a stupid prick ass kisser is.",
            "THIS was a good bedtime story, thanks.",
            "TK-421, why aren't you at your post?\n\nTK-421, do you copy?",
            "IT company I worked for won a sub-contract for the  whole of IT from a large prestigious airline and was therefore treated within the company as a flagship contract. The order went out that all IT employees **had** to wear white shirt suit and tie. IBM style  clones.   Disciplinary and sackable offence \n\nWe protested to our manager but it was out of his hands. This was orders  from the very top down. \n\nBut then a couple of months later the managing director wanted to come and look over  his shiny new flagship contract. Through the airline we got him appropriate passes to visit all the parts of the airport  where the airline had IT that we worked on.\n\nHe turned up and we started the tour. Through the aircraft hangers with all the engineers wearing boiler suits. Clambered through the baggage hall with miles of dusty and oily baggage belts with  baggage handlers in work type trousers, polo shirts and safety boots. Visited the outside to head of stands with everyone else wearing inclement weather gear. Wandered through  Cargo hall  with pallets of goods being split and repackaged in a warehouse style area, again with everyone else in work clothes and boots.  And several more areas with no-one else wearing suits - because of course not. \n\nOnly after that whole tour, and somewhat disheveled, dusty, oily, salty and rather damp  did  we then take him  to the airline's admin offices with their clean, air-conditioned and carpeted areas   and  people working in suits and skirts. \n\nTo be fair to the man he followed us gamely (even enthusiastically)  and never once complained throughout the whole day,  but just days later there was a new instruction direct from his office that we could now use \"best judgment\" for what to wear according to the \"local environment\"",
            "This is why an audit trail is important. Don't trust anyone that won't put things in writing.",
            "I love the stormtrooper reference!",
            "Meanwhile at my workplace.Teamlead: Did you finish all the testing on the machine?\n\nMe: No the suits were visiting.\n\nTeamlead: So... does that mean you showed them the current state of things? You know they are quick to jump to conclusions and you really should follow the official process.\n\nMe: No, I didn't show them anything. But they kept coming onto my machines safety zone (Lines on the floor you are not supposed to pass without permission + safety gear) and even touching parts, so obviously I had to keep it powered off. Sounded like a sales pitch though, so I just kept quiet and looking busy.\n\nTeamlead: That's probably for the best. I'll do my best to keep the suits away so you can work.\n\nMe: Thanks.\n\n^(So I was testing a new feature in untested software on untested hardware, which has the possibility of quick and sudden movements. Suddenly a suit appeared out of nowhere and put his hand in the middle for no reason, which could have easily lead to broken bones. They laugh saying I'm overly cautious, all our machines have safety mechanisms on there. Yes, all finished machines. What do they think R&D does? Think them up and will them into existence fully formed? I'm not gonna call them out in front of potential customers, but you bet the safety officer will be getting a note.)",
            "Excellent use of CYA there. \n\nHighly commended.",
            "Even the most ignorant person should be able to deduce that neck ties near an assembly line are a REALLY BAD IDEA.",
            "Corporate IT guy here, for a company of about 350 people. We have a small IT dept, like 7 people (not a problem honestly). I'm usually involved in everything IT ranging from help desk to server maintenance to new equipment rollout, etc. \n\nI wore nice clothes for all of a month when I started about 5 years ago, now it's just an untucked polo, khakis, and sneakers. At any time I may have to scrounge around under a desk, go out on a bus with equipment; any number of things that nice clothes would get in my way of doing. Nobody has said anything to me regarding my outfit, including the CEO and other execs.\n\nI'm the \"IT guy\", nobody really gives a shit as long as their problem is fixed. \n\nThis guy had a stick so far up his ass he could taste the bark.",
            "Well, seems that VP ass-kisser just got moved to the right department for him: the Rimming Room.",
            "That suit and tie crap needs to die. I worked in a place that insisted on that nonsense. After 5 years I got them to drop the ties but still dress shirts and slacks. We were overdressed for every single customer meeting. Everyone wore jeans unless it was a bank. It's just irrational boomer dogma.",
            "Don't fuck with the IT guy",
            "A tie is the chain and shackle of the IT industry. If you force your IT guy to wear anything but his favorite cargo pants, and a nice plaid shirt or polo, and sneakers or Doc's to his liking, you're a micromanaging shirt tucking dildo who needs something else to do.",
            "Damn, other than the VP, even our upper management IT wear casual clothes because they may be crawling around a server room floor or unpacking boxes in the IT warehouse on any given day.",
            "I worked in marketing for a company that made standard and custom industrial equipment. My duties included taking photos of the one-of-a-kind machines. I had a medium format camera and decent lighting kit - four light stands, off-camera metering, the works. As soon as a machine was completed and tested, they would call me across town to the plant to do the photos. On those days I would wear jeans to avoid ruining anything nice.  Sometimes the machine wasn't ready that day and I would have to wear jeans a second day - which for some reason infuriated my boss.  \n\nOne day she decided to accompany me on the shoot to show me that I could do this work in office casual.  Within the first hour, she had snagged her slacks on some raw steel and got grease on her nice shoes. She soldiered through. When I started breaking down the lighting she grabbed a cable to wind it up like a garden hose - between her hand and elbow. Because a factory floor is always covered in welding slag and forklift tire dust, I usually used a rag to wipe the cable as I hung it in loops to make a loose coil.  By wrapping it around her arms, my boss ruined her shirt and had so much grime on her hands and face she looked like a street urchin.\n\nThe next day she told me the jeans were fine and if I wanted, I could call it a day after a photo shoot so I could get a shower.",
            "I used to be an IT guy in an office. Of all the employees, I alone wore sneakers all the time. Management didn't like it, but my dress shoes had their soles crack in half from me crawling around under desks and them getting bent weird as a result. IT is not a formal attire job.",
            "This needs posting to /r/talesfromtechsupport",
            "Had a similar thing happen when I was in the Army as a mechanic.  We get a new Lt (lower management) who demands that out boots are shined all the time.  He actually chewed me out once after crawling under a truck for three hours because my boots were scuffed.  My Motor Sargent comes to the rescue and tells us to just sit in the office for he day, no work.  Two days, three.  The faults are stacking up and in the army the vehicles have to be at a certain percentage of operational before trouble starts.  Well, day four we are found with a stack of faults and no one working.  Lt they find out that the Lt is the one responsible as he had ordered us not to so anything that would scuff out boots.  He was transferred to a different unit the next day.",
            "This is an excellent example of CYA as well.",
            "I'm so glad the IT guy didn't try fixing a machine and getting his tie caught or some other horrible accident.",
            "Never mess with the following jobs: IT, maintenance, engineering, janitorial, security, or admin.  They know all and see all, best stay on their good side. \n\nIt never ends well if you do.",
            "im an IT Guy as well and had a similar issue. only difference was our safety requirements were pretty lax. i had kevlar shoes. thats about it. but one week i had to spend 80% of my time working in teh warehouse. crawling on floors, in shelving, all the dirty stuff. management actually got mad at me for wearing jeans instead of my khakis.\n\nso next time i wore khakis. they were filthy after an hour. got told that wasnt acceptable either.\n\nfrom then on i brought two sets of clothing. and took my sweet ass time getting changed. if i knew i had to work in tehwarehouse right away, id wear khakis so id have to change, and vice versa. they didnt like that either.\n\nthey fired me, i was A OK with that",
            "Frankly I think you should have insisted that the VP be fired on the spot before continuing your work.",
            "They would have cut off their nose to spite their faces if they had fired the IT guy. Can you image how much longer the machine would have been down while they found someone to fix it?",
            "Daughter in law, manufacturing engineer, was required to wear office dress up clothes and spent 1/2 of her time in the factory fixing big greasy machinery the other half in meetings with management. Factory people wore overalls but she was denied. Was constantly ruining her nice clothes. Another person in the same situation pulled her aside. Told her to never wear her nice clothes. Directed her to get a bunch of thrift store bargain clothes for a dollar and throw them away as needed.",
            ">VP ass-kisser kept his job (he was very good at his namesake, after all), but he was transferred to VP of a division that didn't exist and a workforce of one; only him.\n\nAh, a transfer to \"Special Projects.\"  That means he gets to keep everything he has... except his dignity and any meaningful duties.  I wonder if he was lame enough to stay in that job forever for the paycheck, or if he finally left.  If anyone would hire him.",
            "C-137. The Rickest of alllll the machines",
            "Please leave IT alone. We do the job that's asked of us and often more than what's expected when no one else can. (usually) We often handle equipment sensitive in nature but essential for any modern business to make any progress or profit in an ever changing world. Its why we earn big bucks and often work holidays and weekends against our will, many of us on-call unprepared or not expecting work on our seldom days off. The least we can request other than decent pay is the ability to go business casual if not completely casual. (The on-call nature of things also makes it hard to maintain regular dress)",
            "Tbh that’s just a company sitting on the edge if they have to rely on one guy to handle the machine errors.\n\nThey should really have a 2nd IT guy at least learning the ropes in case anything happens.",
            "I have worked in IT dating back to the mid 90s.  Even in \"white collar\" environments like hospitals and banks, I would occasionally be on the floor fixing something in a shirt and tie.  I never understood the dress code, and I would go home at night with dirty dress pants and shirt.\n\nIt's really become more lax lately and I'm happy about that.  Jeans, simple collared shirt, and gym shoes should be the norm.",
            "Sorry, you fired me, if you want to rehire me we can discuss terms.",
            "And this is why we document.",
            "I worked at a hospital call center that required all of the men to wear a tie even though they would never be seen. Boss thought they would sound more professional. She would also make me take out my nose ring every day, which I put into a super tiny bowl on my desk. I guess that made me sound more vanilla? She retired and the next boss got rid of both policies first thing. Now it's loosely corporate casual, comfortable but still neat. I left that job decades ago and wonder how the tie thing would fly now with greater gender diversity being validated!?",
            ">code TI-86\n\n&#x200B;\n\n>machine C-137\n\n&#x200B;\n\n>machine TK-421\n\nI see what you did there.... You're only missing A113....",
            "TK-421, why aren't you at your post?\n\nTK-421, do you copy?",
            "C-137?  I got the others but not that one.",
            "Unrelated, but your post structure (backstory, problem, fallout, mic drop) reminds me of Ars Technica's War Stories video series which follows the exact same pattern but with different words (setup, problem, solution, lesson)",
            "I love the code names in the story 🙂",
            "You motherfuckers open up with threats!? Here's what really happened. I quit, good luck fixing the line before you lose the contract. What? Ya'll motherfuckers want to play nice now? Since we are all being cordial let's talk about my raise.",
            ">Around 5 AM, IT guy is ordered to the boardroom where they really lay into him before they fire him. Threats of blacklisting him in the industry, threats of lawsuits for damages, etc. Of course, there's the condescending \"Now what do you have to say for yourself?\" question.\n\nWhat do I have to say? Well, for starters, here's all the proof that it was one of you and not me that is responsible. Second, fuck every one of you, I'm resigning effective immediately. Third, good luck staying in business when you can't fulfill this contract because of your own incompetence.",
            "lol moral of the story is to document everything and keep a hard copy",
            "Hope the IT dude followed up with \"Now how are you going to make it up to me, lets start  with 10k cash and a 20% hate rate raise\"",
            "Is this a failure of the VP or a calculated gamble for the cushiest job any of us could imagine?",
            "Gotta say, that was pretty good.\n\nMy shop is trying to roll out some \"work uniform\" T-Shirt BS. I work for a school district but I always dress Business Casual because A: I don't want to scare the kids. and B: I hope someday to become a real boy again and go back to the corporate world and I don't want to have to buy a new wardrobe when I do. So should I buy one of these shirts the only time I would possibly ever wear it is in my off time. And I don't want my off time to be full of \"Hey, you do computers! Could you....\"",
            "\"And now that we're all clear on my value to the company, please have a proposal for my increased pay by the end of the day.  If you're unsure where to get the money from, I can think of someone who tried to put the entire company under and I'm sure they'd be glad to take a cut.\"\n\nTelling your boss \"fuck you, pay me\" in a professional way is an art.",
            "Trust an IT guy to have all his documentation properly lined up.",
            "TK 421 eh? It was probably just a broken headset...",
            "Always keep your receipts",
            "Dress code is an archaic fuck you to the workers.\n\nAt Micro Center they make every male worker wear a shirt, tie, and slacks.  The only time these guys will wear this is at work.  \n\nMeanwhile, I wear tshirt, shorts, and sandals to work earning 10x what they're earning.\n\nI'd trust the dumpiest mofo there if I were to need advice.",
            "fixing error code TI-86 on machine C-137\"  \n\n\nSo, he's fixing a calculator on planet earth? :')",
            "TK-421, huh?  Nice Star Wars reference -- Upvoted!",
            "Machine TK-421, report.",
            "He should have said \"Yeah nah I quit, gday.\"",
            "They sell steel toed dress shoes",
            "That made me unnecessarily happy",
            "Suit and tie for an IT worker? What in the fuck? Especially given the industry and expectations. Sometimes I swear the C Suite doesnt have a fucking clue how the business operates beyond the numbers it produces.",
            "Beautiful...",
            "I liked the graphing calculator error code on the cargo plane machine. Glad he got the stormtrooper back up and running!",
            "Was the TK-421 at its post?",
            "My old coworker had an issued similar to this. His response to the new job rules was to retire early and quit. Much like this company he was the only one trained on the niche equipment and when he left they were unable to find a replacment. They eventually folded.",
            "Great Star Wars reference in there as well!",
            "So let me get this straight, VP now doesn’t even have to work for a paycheck?",
            ">\tthe company might go down if this company goes elsewhere\n\nWhy is anyone working for this company based on that alone? If a customer potentially goes elsewhere and puts your job at risk, aren’t you always worried?\n\nThis isn’t a healthy business, or one that can sustain itself.",
            "Some big holes on this whole story, if the IT guy drops dead the Company is FUBAR. I know this is standard in most of IT so....",
            "Damn, malicious compliance is so sweet. It's like karma on steroids. Sometimes you have to allow something bad to happen before people realize something isn't going to work. You can't convince them of it no matter how hard you try. So now they're screwed. So unnecessary.",
            "TK-421, why aren’t you at your post?",
            "Beautiful number and code picking",
            "Right but wouldn't they just have him put a hi-vis vest and hard hat OVER his suit when he went on the floor?",
            "Lol I used to do desktop work a fair but and they wanted me to wear coat and tie for my morning briefs. It was my first IT job and I was running the 3 man team for a sweet $12 an hour. I bent over backwoods for about 6 months to satisfy all the bull shit. My last 6 months I was wearing gym shorts 90%of the time hoping to get fired for not wearing a suit. Moving there is one of the best career moves I've made, but leaving there was definitely better.",
            "Wearing a tie around heavy machinery is a very easy way to get killed.",
            "I worked IT and had to do suit and tie to do it. And then we had this large move where I absolutely obliterated my single $500 suit doing it all, I just wore it all tattered up and when was asked, I mentioned why did we have to pay for expensive clothing that tears easily and gets caught in things for this kind of work and mentioned my tie getting caught is an OSHA violation and I had considered calling them. Didn't have to show up in a suit anymore after that.",
            "Wow, great story dude. Hollywood should turn this into a movie. Dramatic effects and all!",
            "A ti-86 is a calculator, unless someone named a purpose built controller after one of the most popular graphing calculators that has ever existed in the late 90's.",
            "I'm going to have to complain about your mixing of Texas Instruments and Star Wars references. I've filed an official complaint with the Reddit. You can expect to be served shortly.",
            "Okay, that's all well and good, but why couldn't he just put on a helmet and vest as he walked out of the office onto the production floor? And then take it back off when returning to the office?\n\nI get that it would certainly be less comfortable than jeans and those nice clothes would probably not be durable enough for a factory floor. But I also find it hard to believe that not a single one of those execs asked why he thought his new dress code somehow made him incapable of slapping safety gear on over it.",
            "Great story, but am I the only one that got the Star Wars reference?",
            "Missed your chance, Aussie bloke by the name of Rob Glenn had some tailored suits made up, could've messaged him for his tailors contact info.  \n\n[lad Bible article about Rob Glenn](https://www.ladbible.com/news/latest-aussie-bloke-creates-epic-tailored-high-vis-suits-20210604)",
            "I mean...\n\nHe could have kept a hi vis and boots in his office and put them on when needing to go on the floor.\n\nThats what I used to do when having to go on the manufacturing floor. Boiler suit over my clothes, safety shoes and hair covering.\n\nThe \"I can't possibly do my job so I'll sit here doing nothing for weeks\" is ridiculous",
            "good for you",
            "Hi vis vests are a pain in the ass. I have yet to encounter one that doesn't flip its self inside out and twist around as you try to put it on. No one is wearing that shit for no reason.",
            "None of this makes any sense. IT person should store their PPE in their office or the change room like everybody else working on the factory floor. If they go into the factory, put it on, if they are sitting in the office, take it off. Am I missing something here?",
            "Hopefully the VP was given a windowless office.",
            "VP Asskissing really broke a tooth on that rule.\n\n(Sorry, your username gave me a fond memory)",
            "This is glorious.",
            "As an IT guy I would leave after that. Not worth it.",
            "TK-421? Nice reference there ;)",
            "Transferred to VP of special projects, not a resume builder.",
            "I enjoyed it",
            "TK-421 wasn’t at his post\n\nTK-421 didn’t copy",
            "My favorite part of this is:  \"He spends a few days in his office goofing off while the errors on the factory floor grow and grow.\"",
            "And this is why you document everything",
            "This is awesome.",
            "So much power in that moment.\n\nIf it was this important and he was really the only one who could fix these things with that much on the line that they arranged a dress down for him, he absolutely should have said, \"Right after you fire the person who caused this.\"",
            ">Please put on safety gear and fix machine TK-421.\n\nShould have known it was a communications issue.",
            "NEVER mess with the IT guy. It NEVER ends well",
            "A reference to Texas instruments, Rick and Morty AND star wars, brilliant.",
            "lpt:keep your receipts.",
            "Slow clap!",
            "This is actually a sad story about how politics in an office affect the work flow.  Idiocy in action.  Leave employees alone and they will do their jobs.",
            "This is the reason the manager at my old job carried around a backpack. So she can switch between safety gear and appropriate office wear as she goes between offices and warehouse floors on the daily.",
            "\"not exaggerated\" when out the door quick.",
            "RAID is nice, but doesn't protect from people deleting their own files...",
            "Love it. I used to do pretty much the same job as that IT guy, definitely need some proper work gear. Glad I'm not doing it anymore though, but do miss the variety.",
            "Is C-137 a rick and morty joke?",
            "We had a similar story on an offshore drilling rig where all people out of the accommodation had to wear specific impact resistant heavy gloves at all time or be fired.\n\nNo exceptions were made for fine repair work or electronic technicians.  So they sat in front of broken equipment until the policy was changed",
            "But did you tell the safety officer that the suit made you really really really ridiculously good looking?",
            "should have asked for raise, before fixing machines.",
            "I love the Star Wars references and old computer numbers!",
            "I appreciate the calculator and rick and morty joke but idk what the last one is. If it even is anything.",
            "IT guy needs to state, \"Hefty raise or I am gone\"  He is literally one in a million.\n\nEdit:  HR guy has a dropped jaw that they even thought to fire IT guy because people that know both manufacturing machines and office machines are rare and HR guy would not be able to find a single replacement.",
            "Dress codes writ large are stupid as fuck.  Can we stop being children and caring about what clothes other people wear?",
            "Have you tried turning it off and on again?",
            "Scientific calculator followed by Rick Sanchez who is a scientific calculator",
            "This makes my little factory-rodent heart feel all warm and fuzzy inside. And reminds me it's been a while since I tromped through the c-suite in rubber boots and orange bib overalls. Long overdue.",
            "Glorious. THnaks for the share.",
            "Thank you for this story and for teaching me new words.\n\nNow to find an excuse to use \"deign\".",
            "C-137 as in Caesium 137?? The radioactive element? Lol It was the first place my mind went. \"huh, Calculator,  Caesium, interesting...\" And i had to go back and read the story because i was still thinking about it. XD"
        ]
    },
    {
        "post_id": "ixedmp",
        "author": "grillbuster5",
        "title": "It is MY day to buy donuts for the entire office as the new person?? Well...OK....",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ixedmp/it_is_my_day_to_buy_donuts_for_the_entire_office/",
        "score": 13988,
        "num_comments": 1280,
        "created_utc": 1600739909.0,
        "selftext": "As the “new person” at my job, I was told multiple times that I was expected to provide donuts for the entire office. Normally, that’s not a big deal... but two people in particular were rude and relentless about the donuts all week. Others joined in also. Apparently, these people recently extorted two boxes of Krispy Kremes from someone else. \n\nExamples of the behavior  - mentioned buying donuts 20+ times, name calling, interrupted meetings, powered off my computer (losing my work), refusing to answer legit work questions until I buy donuts, on and on.  \n\nHere’s the problem, I was hired in as a Sr., 30 years old, and I was not necessarily loving the idea of being told to buy donuts over and over. Hazing really did not seem appropriate at this point of my career (or for anyone else). I didn’t want to be a “bad sport” my first week, so I played along. I politely said that I will not have time this week but will get to it eventually. In terms of the workforce, I was mature, but I was not very mature as a person overall. I needed a creative way to address this problem. \n\nOn my way to work, I decided to pickup a cheap bag of small powdered hostess “donettes” donuts at the gas station.\n\nI distributed the donuts one by one, desk by desk, making sure to do so bare handed from the bag. I presented the donuts extremely politely, careful to mask my passive aggressive “F U” to the whole forced donut process.\n\nThe reaction from the staff was a lot of the “deer in headlights” looks.  People had no idea if I was a “really nice, but clueless” person, or if I was totally saying “F U” to the entire donut idea. Most people took the “safe” choice of being pleasant in return. Some people tried to refuse, but I mentioned the “big deal” about buying donuts, and still left a donut on every desk. \n\nI had originally considered providing a donut to everyone except the last two idiotic pushy people. I started verbally setting it up where they would not receive a donut. However, these two idiots were still openly verbally complaining about donuts, as adults. I could tell that this was not going to go away - they could not take a hint to back off.\n\nMy idea to passive aggressively snub them was no longer good enough. This had to be more direct.\n\nI decided I was 100% done with these guys, regardless of the consequences. I told them I had another idea.\n\nI grabbed a plastic knife from the breakroom, and cut the remaining donut in half the long (horizontal) way, so I still had two circles. The yellow cake was now visible. Then - the most brilliant idea of my life. A new way to hold donuts. One donut on each middle finger, with my middle finger in the center hole of each donut.  \n\nI stopped at both desks. The first guy had his choice of two half donuts on my middle fingers. That’s right, I was able to give him a double donut middle finger. He now understood that I was completely done with his BS, but he never  grabbed a donut. I explained the donuts are actually quite tasty, and urged him to take one, but Im sure I looked like a complete psycho. I was no longer able to stay in character.\n\nThe good news - his refusal to take a donuts from my middle fingers ALSO allowed the opportunity to provide the last guy a double donut middle finger!! I mildly snapped, and had a shitty fake grin on my face. I looked him right in the eye. Double Donut middle fingers up, no longer saying a word.\n\nThe reaction of the last person is best described as completely frightened. That’s right, I reached a complete breaking point over donuts, and scared the hell out of someone. \n\nAnyway, after this incident, I was never asked to buy donuts again.\n\n\n—————————————————\n\n\nEDIT BELOW due to more responses than I expected, and I cannot reply to all.\n\nThanks for reading and the (mostly) great responses.\n\nFor the possible donut hazers, I don’t know how to explain it further. These guys were way, way over the top. This was not normal office behavior. In fact, these guys were in trouble with management also. This is not a normal “team building” this was two total idiots that pushed and pushed.\n\nI do not need you to go back YEARS to try and retroactively change my behavior. This was a “malicious compliance” story that I thought was humorous enough to share, nothing more. I snapped, and acted crazy, but I’m quite happy now in a good career and this was YEARS also.  It’s all good now!! I do not need career advice here. Again, all good. In no way am I saying that I acted properly lol. In fact it was terrible office response, but I wasn’t fired. I ended up taking another position 3 months later.  Some of the people in the office actually appreciated that I stood up to these idiots, so it was “team building” in a way. There’s definitely different ways I could have handled this, but it’s over now. Even if I handed it differently, generally “nice ending stories where nothing happens” are not considered malicious compliance. Is that really what you were looking for here?\n\nI’ve purchased food/etc for the office many times since. Ive had team building exercises. I’ve never run into idiotic hazing like this since back then. \nAgain thanks for reading . I did not intend to annoy anyone that does FRIENDLY or NORMAL team building. That type of thing would not have caused me to snap, that’s very normal.  \n\nOK. Signing off.",
        "permalink": "/r/MaliciousCompliance/comments/ixedmp/it_is_my_day_to_buy_donuts_for_the_entire_office/",
        "comments": [
            "🍩😃🍩\n\n🖕        🖕",
            "The last place I worked had a \"new employee treats\" tradition too.\n\nOn their first day, their manager would go out and buy a bunch of donuts/cookies/bakery stuff. A \"welcome\" email would be sent out, and everyone was invited to drop by the new person's desk to introduce themselves and have a treat.\n\n\nI never realized until now how non-dysfunctional the routine was.",
            ">The reaction of the last person is best described as completely frightened. That’s right, I reached a complete breaking point over donuts, and scared the hell out of someone.  \n>  \n>Anyway, after this incident, I was never asked to buy donuts again.\n\nHow did the rest of your tenure at this workplace pan out?",
            "When I start a new job, I usually get excited to bring in treats for my team. \n\nI would be annoyed if it was expected for the entire office of me though.",
            "I was a temp at a crappy job. My first week there I was asked/expected to donate money to buying a retirement gift for the supervisor of the department I worked in. I didn't get medical benefits and was paid substantially less. Yea let me get right on that.\n\nI see your struggle and I salute you.",
            "I’m pretty sure I lost my company a monthly inspection contract because I never brought the new safety guy a coffee.  Like buddy..... I’m not your fucking gopher I’m doing a job and I’m not spending my money on a large shitty coffee just to keep your fat ass happy.  Get fucked.",
            "Why is it so hard for adults to go buy their own donuts? Seriously, like not even one dollar. Drive to store of choice, anytime you want, pay almost no money, get donut.",
            "That's awesome.  I had a boss whose last assistant baked all the time.  He kept reminding me that if I make dessert at home I can bring it in.  I finally told him that if baking was part of the job, he should have hired Betty Crocker. My family was lucky to get a home cooked meal.  Point taken and the requests stopped.",
            "Buys vegan carob diabetic friendly donuts.",
            "Aside from the story...asking the new person to bring donuts....weird...I’ve provided treats to welcome a new person but to ask the new person to do it...screams assholery.",
            "Well. I thought the \"donut shaming\" as I started referring to it in my first 6 months at my out of college job... wow. Same story. I lived this. I was hassled DAILY. it made me feel horrible bc I wasn't getting paid enough at the time to cover my bills- let alone buy people I hardly know donuts. The harassment got so bad that I eventually pulled up my bank account with .42 available and started crying in the middle of the bull pen office where we all worked. \n\nThis still didn't stop the guy. I won a gift card one day and he then made a Crack about \"now i would have the money to get them donuts\". You know what? I did. I took the gift card that I won from HR and bought donuts. Then I sent HR and email about how my purchase choice was made as a last attempt to get this coworker to leave me in peace about donuts. \n\nHe got in trouble but continued to harass people. He harassed my intern one time a couple summers ago and I flew off at him. He was moved out of our area. The man is a fucking nightmare. \n\n\nHe is also the guy who makes racist jokes. Like it is funny.",
            "Ok... here's a great idea... buy the donuts the day you're asked to, but have them be completely boring, unglazed, plain cake donuts (no one likes those) and wait until the day you're supposed to deliver them. \n\nStale, dry, unglazed, plain cake donuts.",
            "What is it with office jobs and these rituals where they pressure people to do things they don't wanna do, and that have nothing to do with the work itself. I worked for a company where if you cursed during a meeting you had to bring chips for everyone. If you were late to the first meeting of the day you had to give a buck to the team leader, and that money was used to buy snacks for the team. Two coworkers were particularly pushy about this, keeping tabs on who and when and what they \"owed,\" and ganging up on them as a \"joke\". Also pitching in to buy a birthday cake for everyone that had a birthday and being made to go sing happy birthday. Please, I never agreed to this, I don't even know half these people, let alone like them. I don't wanna be around you and pretend to like you more than is necessary to get my work done, please just leave me alone.\n\nI am currently in a different company where we can cut the crap and treat each other like adults, and have real relationships based on common ground rather than imposition, and I've never been happier at work.",
            "Establishing that you're both capable and batshit crazy early on is a total power move.",
            "In one story in /r/talesfromtechsupport the guy bought healthy gluten-free donuts. They looked fine, but tasted like regret.",
            "I used to have a co worker who actually complained to the big boss that he didn’t like the tissues they were providing and he preferred softer ones and that the coffee pods were a breakfast blend and he preferred darker roast. I was shocked but holy shit they actually bought better tissues and bought him his own box of coffee pods whenever she ordered supplies.\n\nOffice people can be complete twats.",
            "Thats such a shitty \"tradition\". There are so many hidden costs associated with starting a new job, even if there was absolutely no down time between your previous job. I would never be able to afford this as the new person at an office.",
            "This is so petty.",
            "> This is not a normal “team building” this was two total idiots that pushed and pushed. \n\nI think the term you are looking for is \"Hostile workplace\" or \"Harassment.\"",
            "I'd have just bought the doughnuts and charged it to their cost center.",
            "[removed]",
            "I agree your coworkers are children but what an incredible amount of energy you expended to show all your colleagues that you're petty.",
            "[removed]",
            "Double donnut middle finger is something that you had never think you would say",
            "TBH, sounds like winning the battle at the cost of the war.    saving 40 bucks, but nobody likes.",
            "I'm 50. The new guy on this team. Apparently there are a set of rules for owing donuts. One of the rules is being the new guy. Another is not knowing about the donut rules. I'll bring them in eventually. \n\nI kind of like the donettes idea. I don't think I'll be propping any on my middle fingers, though.",
            "Idk, this guy sounds like a dick.",
            "well fuck now I’m craving cheap Hostess donuts, thanks",
            "Donuts are so cheap, I’d bring too many to be passive aggressive. No, I insist, eat a 3rd one. They’re only good when they’re fresh, eat up. I’ll just leave the box on your desk and check in every hour to count how many you’ve eaten.",
            "You seem like a delight.",
            "This happened to me at my last job. People in my group kept saying that since I was new I needed to bring doughnuts. Everyone in my group would be considered obese or morbidly obese. I got fed up up one day and said, “Do you really think you need to eat another doughnut?” They we’re less than appreciative about me pointing that out.",
            "Nobody should be forced to buy food.",
            "I very briefly worked at a desk job when I was young, I never drank coffee (still don't). But had an older lady tell me since I'm new it's my turn to buy coffee and I should help with making coffee, help keeping coffee pot clean, etc. So I bought insta coffee packs thinking it was the same but less mess, no one was happy. She insisted that goto the store and buy real coffee beans. So I did, but I walked 2 miles to the grocery store bought a publix sub and sat down and spent like 30 mins eating it. Then bought the coffee beans and walked back to work, after she lost her shit and started yelling at me I just laughed and walked away. The boss came up to me containing laughter and told me it isnt a requirement for me to buy coffee anymore if I'm not drinking it.\n\nThat's when I realized no one actually liked that lady at all as a person and she wasnt my manager like she claimed to be.",
            "I hate that we've normalized pressuring people to spend money on their workplace. And boundary-crossing \"team building,\" like being expected to go somewhere AFTER work or to spend your lunch hour doing something with the team when that shit is supposed to be your moment of solace. Y'all need to understand, if I won the lottery tomorrow not a single one of you would ever hear from me again. Be friendly, have humor, but do not ask me to spend money and do not ruin my break.",
            "The people that are angry at the donut hazee are clearly the type to enjoy exploiting the position of social power they have when a new start starts. It's obviously so jarring for them to read that he stood up for himself and was confident enough to not buckle to the desperation of fitting in. I'm really enjoying reading the butthurt comments.",
            "Hey, because of all the dickfucks who are butthurt that they paid for donuts and you said fuck that.... Cheers to you!",
            "[deleted]",
            "Passive aggressive level 100. Take this over to r/amitheasshole and see what happens. I think you just made a shit ton of enemies at a new job for no reason.",
            ">Double Donuts middle fingers up, no longer saying a word.\n\nLMFAO I'm picturing Chris Meloni's charcter in Happy.",
            "My lil brother taught me this lesson when I was young: if you don’t want to do something, be shitty at it",
            "This. Is. Awesome.",
            "If bringing things in such as this is an absolute requirement in the work place, I do not partake. If it is optional - I do it all the time. I bring in cake, donuts, even beer (for after work obv) and set it up in the break room for my coworkers when I feel like they need a little boost to their day. I don't care if it's tradition, expected, etc. At that point you're just guilt tripping people into giving you free shit.   \n\n\nThese men work in an office. They can stop by on the way in and buy their own fucking donuts. Fuck them.",
            "Well damn. I’m more passive aggressive I’d of just bought extremely stale donuts or possibly donuts that I’m sure no one would of liked",
            "Office culture is grotesque. If you want donuts, buy donuts on the way to work, otherwise, mind your business. Stop trying to spend other people's money like some sort of awful adult children.",
            "Not gonna lie , pretty shitty culture for the new guy to treat the existing employee IMO.\n\n The jobs that I have been in, have always been the existing staff doing some thing to welcome the new staff (if any).  Not the new staff \"bribing\" ( yes I know it's not really bribing) into the new job/position.  If that new employee wants to extend their kindness , thats I'm them.",
            "I get why you did it OP\n\nNot everyone have it in them to make duchess, like that, feeling just as awful as they make others feel.\n\nGood for you to put a stop to that immediately.\n\nWhen I was an intern in a hospital, my internship was for 3 months (we were 3 interns in the same place).     The hospitals kitchen usually took care of morning bread and other goodies for the staffs breaks, meetings and such. Whenever someone went away or had to take paternity leave and the likes, the hospital kitchen also took care of special things, like cakes or special breads to get them feeling well send out. \n\nAbout 2 weeks before my internship ended, we were told that it was tradition for interns, to bring special bread and cakes for the last day of their internship.. Especially 3 nurses, pretty much reminded us daily not to forget about the last day treats and informed us that gifts were also very welcomed. \n\nIt was 2 very awkward last weeks and honestly felt like blackmail to even get out with an approved internship, as one of the nurses being very chatty about the expected last day goodies, had to sign for us, having completed the internship. \n\nI wish I could have been more like you OP, would have been nice to see their faces if we had pulled something off, like you did",
            "This may be an unpopular opinion, but any job that *expects* you to use your own money for group activities or food is a shitty job.",
            "Re: your edits- your story could literally be how you brought in kittens and puppies for staff snuggle time whilst you served the staff handmade hand tailored favourite donuts on diamond plates and someone would still find something negative to say about how you did it.",
            "The people giving you shit about this are probably the same people that haze newbies into bringing donuts in my opinion.\n\nCasually mentioning that it's tradition is one thing; but constantly, daily, going on and on and on about the new guy binging donuts is ridiculous.",
            "Living for this",
            "*\"Now Milton, don't be greedy; let's pass it along and make sure everyone gets a piece!\"*",
            "Double donut middle finger! Genius. The only way to improve on this, would be to sing “Double donut middle finger” to the tune of “Teenage Mutant Ninja Turtles”. But I do understand you were making this shit up on the fly. Still awesome.",
            "Beautifully done. And cutting the last one in half was beyond brilliant. Glad they realize they pushed you too far. I hope that sort of stunt ended with you.",
            "Hahahaha excellent.",
            "\"Good morning!\"  \"Enjoy your donut!\"  \"I dare you!\"",
            "I thought this was hilarious!!  You are gutsy and an inspiration for those of us who are just too damn polite.",
            "Why do people obsess over cake and donuts at a fucking office anyway???  It's unprofessional, not to mention unhealthy!",
            "I have literally not actually laughed out loud at anything on the internet for far too long. I'm laughing at this so hard my dogs are worried. Fucking brilliant.",
            "Ah, the classic double donut middle finger.",
            "It never seems to amaze me how the smallest of things, get amplified x5000 in an office. Outside the office: \"Uh, no. Buy your own.\" But inside, it brews into this toxicity.",
            "I had a more direct approach to a similar \"where's my McMuffin\" query a few times in one area I worked \"it's at McDonald's where I bought mine, why don't you go buy yourself one?\"",
            "You said you were hired as Sr. \n\nI’m just guessing, but in my field that abbreviation would normally mean a Senior Manager?\n\nIf that was the case, and I was in your shoes I would have had a really easy solution.\n\nIf your in charge of moving a particular KPI (key performance indicator, if your acronyms are different), usually getting that metric up to a certain number has very real tangible revenue impacts for your business. \n\nSo go to the Boss.\n\n“Boss, it would be worth $2000 a month in extra profit if we can get my metric up an extra 5%. If we hit that goal, each month, I want $200 in discretionary spending to use as incentive to have the staff keep it there.”\n\nBoss agrees, you go to staff.\n\n“I appreciate as your new manager, you feel like I owe you a little welcome aboard gift as is tradition. I’ll do you one better. Help me raise this metric I’m responsible for, and EVERY WEEK that we perform at this new standard, I’ll buy you donuts. EVERY single week. But only if you can hit this new metric goal.”\n\nThis isn’t a made up thing. I did exactly this working for a clothing retailer; the performance indicator we had to hit was based on our loyalty programs (email capture, rewards cards, and credit card sign ups) and we went from NEVER hitting the corporate target to smashing the target and being district leaders practically over night. \n\n(Wasn’t just donuts though. We agreed on a $200 Visa Gift Card each month, which we spread to $50 a week to stock the break room with drinks, snacks, and suggestions from a clipboard we mounted in the break room)\n\nStill, incentives work.",
            "I had something similar at my work place, I was told we all take it in turns to make drinks for the work force, but after seeing their tea I knew that none of them could make one worth a damn. so when it came to my turn I made the worst tea possible not once but twice, I have never been asked to make tea for everyone again. Fuck making 30 cups of tea a day...",
            "That was a great story!  Loved it 👍🏼",
            "I would have asked for everyone’s favorite donut that didn’t ask or wasn’t pushy and got the rest lemon flavored donuts",
            "Love it! An acquaintance told me about how he managed to get out of the Monday doughnut buying ritual. He'd buy day-old doughnuts from the grocery store.",
            "hahaha PERFECT! Sounds to me like those 2 wankers were treating the office like a pseudo college frat with hazing . maybe you scared them into actually growing up! well played!",
            "Damn all of these replies from people who harass the new guy to buy them donuts",
            "> I ended up taking another position 3 months later. \n\nNo surprise there.",
            "You sounds insane.",
            "You're 30, thinking being hired as a \"Sr\" is some sort of big deal so you shouldn't join in buying donuts for the team? It's donuts, like $5 a dozen at the grocery store. As a \"Sr\" staff member, I'm sure you'd understand the idea of comraderie and team building. This isn't malicious compliance, it's passive aggressive condescension, and I'm sure your coworkers really enjoy your presence.",
            "Dude, that is hilarious 😆",
            "Oh what a delicious way to deal with those ding dongs",
            "I have never liked when groups make the new person buy donuts. The group should welcome the new person by buying each new person donuts!",
            "Well done.  I don't like it when anyone tells me how and when to spend MY money.  Not their decision to make, ever.  Nobody knows each financial situation and there may have been a very valid reason that you could not spring for donuts.  Or maybe you don't even like donuts. Why should you have to buy them.  Even if it was \"team building\", it's stupid and they should think of something more creative and no cost.",
            "I can just hear your ex coworkers now..\n\n*\"Remember that girl who had a mental breakdown over donuts? I wonder how she's doing now?\"*",
            "Honestly all you did was embarrass yourself.",
            "Man, there's hazing and there's making the new guy buy donuts. At my job we bring in donuts for everyone on our own birthday. Its an odd ritual but who cares? Its a 5 dollar box of donuts once a year. Lighten the fuck up",
            "I like how you position the story like you don’t care what people think of you. Then add a edit as long as the post because you care what Reddit thinks of you.",
            "I mean you could have just laughed and said \"nice try. \" Messing with the new guy has been a thing at every job I've ever had and it started in high school when nobody ever fell for the old pool under the gym floor trick. Nobody also ever fell for the old empty the hot water out of the coffee machine (it self fills) trick. Or you could have been cool and just got donuts and not do what you did. Nobody ever really expects these things of the new guy.",
            "“The Fragility of Man and Dough” or “How to Lose the Respect your Entire Office in Four Minutes (number eight will shock you!)”",
            "I wath told thew would be donuts...",
            "They tried something like this at my office once.  I just ordered catering and left it in the break room and sat at my desk working the entire day.",
            "Love it! I wish I had the balls to do something like this",
            "At my workplace people like to celebrate their birthdays by treating the office to cakes and things. Some people make their own cakes, some buy in cakes and muffins and things. There's no pressure to do so and it's all very wholesome!",
            "It would be more hilarious if you licked your fingers after you gave each person their donuts....it would be a bit gross, but hey. Rub the message in am I right?",
            "LOL this was great. thank you.",
            "I think this is the funniest malicious compliance story I've ever read.",
            "Omfg I'm laughing so hard right now!! \n\nThis. This is why I come to reddit :)",
            "This is fucking fantastic!",
            "If it was me I would have bought some of [these](https://2.bp.blogspot.com/-Adzjf_iImeU/U3FNjDly5fI/AAAAAAAAJAc/ry262TakuW0/s1600/IMG_2869.jpg)",
            "Fuck am I glad that offices are cancelled forever",
            "Oh great... Now I really want to have a donut.",
            "I hope you're OK now.",
            "Thought it was going to be two dozen boxes of coconut donuts.\n\nThat's always a way to tell them fuck you.  Your way worked too.\n\ntldr:  and that's how  grillbuster5 ruined donut day forever",
            "Not sure abt this - but you probably won’t ever be a trusted coworker (as if you cared) - some people you can joke with - some you can’t",
            "I had a guy do the opposite. Insisted on buying food, and staying late if shit hit the fan. He finally got us to let him buy us food. Has yet to stay late. \n\nOur boss and a vendor generally take care of lunch when they are there. The man in question is pretty unlikable, so I feel like this is his way of \" joining\" the group...\n\nStill waiting on day when he's going to ask if I will buy lunch. It is going to be a big fat NEVER.  Truth is I I will buy eventually, just not under forced circumstances.",
            "I’m so entertained by this I’m still cry-laughing while re-reading.",
            "Bro, this belongs on r/deliciouscompliance also",
            "Why did this give me American Psycho vibes? :p",
            "I wish I got to see this",
            "Not quite sure why but I just laughed at this for about 5 minutes. So thanks for that",
            "Donuts? Oh shit I forgot, again. If only someone would remind me. Maybe tomorrow.",
            "Every job I have ever had I bought pizza for my working circle with my first pay check as a thank you. Never had a problem with anyone.",
            "See you’re getting heat and I just wanna say i laughed my ass off reading this just now.. props",
            "Should have just shouted\n\nDONUTS? HOW ABOUT DEEZ NUTS\n\nthen done a 360 and walked away",
            "I've been trying to silent laugh at my office desk for the past 2 minutes whilst reading your story.\nThanks for the good laugh (and for making my colleagues think I'm crazy).\nIt's a really good story!",
            "I love this. I probably would have bought plain donuts with no frosting or glaze so I could watch them all be disappointed",
            "I was asked once to clean the lunch dishes of my work mates saying that I was the youngest a d the newly hired. Dirtiest plates I had cleaned. They washed their own after three days.",
            "Mildly snapped is the best!\nI guess Donut fuck with you. Did someone already say this, I haven’t read the comments yet.",
            "OMG, still laughing.  Good on you for standing up to the bullies.",
            "What the hell is wrong with people lol. It feels like they were trying to assert dominance over you more than they were trying to get donuts.",
            "People should never be pushed to feed someone's addiction.",
            "We had a doughnut group in my office (\\~10-15 people) and it was  completely voluntary. We had a rotation and a different person would get  doughnuts every week on Friday. Only rules we had were if it was your  first week in the group you would bring doughnuts, and if you couldn't  that week you got someone to get doughnuts for you.\n\nMost  of the group is gone now (either left or were terminated) so I have no  idea what it will look like when we're able to do it again.",
            "This sounds pretty jerky tbh",
            "At my old job they tried to make a big deal about “the new guy” making coffee in the mornings. I made my own coffee at home and brought it with me. I’m not one for “hazing” either so I just straight up said I’m not doing it while looking ppl in the eye as I drink from my own cup.",
            "At my old office we made you buy the team (not the whole office) donuts if you were late to the daily 10:00 standup meeting.",
            "Hostess, I'd have gone with Great Value at Walmart.",
            "This story is hilarious.  I imagined it all as an anime short film.",
            "I think I enjoyed reading your edit almost as much as the original story. 😈 Thanks for sharing",
            "Bwahaha, how DELICIOUSLY passive aggressive!",
            "I always put a bowl of the joke jelly beans that taste like buggers and sour milk when I start somewhere new.",
            "Giving everyone a barehanded donut from the bag. Licking your fingers before reaching into the bag. Priceless.",
            "I feel you OP. Currently experience something similar but with added bullying of someone else. It's super weird. There's four of us in an office and everytime my boss comes to see me I have to buy the others chocolate. A full block of chocolate. Every time. \n\nSupposedly my boss is a disease spreader. So everytime she comes in she might infect us. So apparently that means we ostracise her and bully me. \n\nOne of them is being pushy and even started counting via postit notes how many times it happens. Ive been upfront about it my dislike of it. But this one person has kept pushing. \n\nNext step is to have a serious talk. But if this doesn't stop I have to put in a complaint. Wtf is with people",
            "You’re just the right amount of a dick. I love it",
            "I would have done the exact same thing. I once made a $ bet and lost. The winner kept nagging me for the $ Beyond what was necessary. So I paid them from my change jar and they were less than pleased.",
            "My job was the opposite. When someone new joined the managers were expected to bring doughnuts. People bothered me when I didn’t bring in doughnuts because I hired a remote employee who works 3,000 miles away.",
            "That's pretty awesome.\n\nI can see asking the new guy to bring in donuts on his first day as a welcoming offering.  By the second day my response would have been somewhere along the lines of, they're at the store waiting for you to pick them up and pay for them.",
            ">Hazing really did not seem appropriate at this point of my career. \n\nIs hazing a thing past college and sports? I'm well into my career as a senior IT and I've never been nor witnessed someone being hazed.",
            "Brilliant!!!",
            "I had to buy empanadas when I first started my job. Many people were insistent even my supervisor. I bought them and moved on with my life. It isn't a big deal. Shoulda just bought them and not made such a big deal.",
            "I think you're my new best friend. \n\nPsychosis and all.",
            "We had a practice at my job early on in my career, that if you were late you brought in doughnuts. I was late a few times, and because I rode a motorcycle to work, I would bungee strap the doughnuts to my sissy bar, essentially crushing them all. I did that once and nobody ever bothered me about it again.",
            "If you get that bent out of shape over $20 in donuts, I can't imagine you being much of a team player at all.",
            "Buy the damn donuts especially if your a senior level person.  Be generous.  I can guarantee your office mates will hold this against you in many small and (mostly) insignificant ways.  Office politics are weird little mine fields and being kind and generous to your colleagues is crucial if you want to avoid some of the better hidden mines.  You may not like everyone but at some point you will need to ask for some extra effort - project deadlines or straight up favors  - and all will be affected by how you are perceived.   $50 in donuts won't buy you a favor from anyone but $5 in donuts will lose you several.  Always be generous and kind.",
            "This is awesome. You are a beast.",
            "Tbh I would’ve been excited bc I love those little powdered donuts lol",
            "You didn't think to get an empty donut box but fill it with potatoes? \n\nu/rook218",
            "In our office, it's HR welcoming new guy with large box of bakery treats and welcoming everyone to join in. Asking or expecting the new guy to do it for the office seems rude.",
            "Were their name Hitchcock and Scully by any chance?",
            "I would've said, get your own doughnuts!",
            "“I cut the donut in half long way” there’s only one way to cut a circle in half lmao",
            "LOL these people in your workplace have too much time on their hands if they're really that upset about not getting donuts. I wish donuts were the most of my worries. I don't know maybe I just look at in a different point of view but also, I haven't eaten a donut in years so I'm probably biased.",
            "Ever notice how you come across somebody once in a while you shouldn't have fucked with?\n\n\\**donut fingers*\\*\n\nThat's me.",
            "My solution would have been three or four dozen plain donuts.  No glaze, no powdered sugar, just brown rings.",
            "This was golden. I cackled. Thank you!",
            "I know this is an old post, but did this happen to be a job in Central Michigan at an auto supplier? Because I worked at a place that had a literal list of occasions you had to bring in donuts. I was an intern and I was bullied into providing donuts."
        ]
    }
]