[
    {
        "post_id": "lwq0q4",
        "author": "BuguyaBriarLeigh",
        "title": "Cost my company $10k.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lwq0q4/cost_my_company_10k/",
        "score": 13985,
        "num_comments": 499,
        "created_utc": 1614764516.0,
        "selftext": "So, I worked a full time shift work job, where we changed between 2 positions based on the day and hours. If we were rostered on Monday - Friday, 0600-1800, we were at one position and weekends, night shifts (1800-0600), public holidays we were at the other. We received weekly rosters to show where we were working, and the company faced heavy fines if a position was unmanned.\n\nI knew a public holiday was coming up but the roster had me on the regular Mon-Fri position. I approached my manager and explained, who said she would check it out. \n\nFurther info - I was told by our head office that I would be the manager when the old manager quit and while I was on holiday, they hired this girl (who had zero experience as a manager or on the site, where I had been on the site for 8 years and had been assistant manager), so I was not inclined to put myself out to cover her or the company. \n\nWhen I came in for my next shift, I found a note from her to 'just follow the roster', even though it was wrong. Sure thing....\n\nI spent 12 hours watching movies and doing absolutely nothing at 2.5x pay (PH rates). I literally took my shoes off and spent the day with my feet up on the desk!\n\nThe company got a minimum $10k fine for not having the other position manned and the manager got blasted for not using common sense.",
        "permalink": "/r/MaliciousCompliance/comments/lwq0q4/cost_my_company_10k/",
        "comments": [
            "Always remember: if someone says \"Hey, there's a problem\", your best bet is to actually listen. The number of times your time is wasted because there isn't actually a problem will be more than covered by the times there is a problem and you have the warning to fix it.",
            "Did you stay with the company?",
            "Advice for anyone who needs to hear it - a promise of a promotion doesn’t mean a fucking THING unless it’s in writing, or until it actually happens. Take word from your superiors with a giant grain of salt. If you feel comfortable, no reason not to ask for them to give you documentation.",
            "I worked at a front desk at a YMCA where l had been full time for a couple of years and had a front desk manager above me and some new part time people also worked at the front desk. One day l was talking to the temp service person who we hired the part time people through and she had mentioned that she had learned that the front desk manager was leaving. So wanting to get ahead, l went to the YMCA director and put in my application for the soon to be open position and she immediately was furious since l guess no one was supposed to know yet. She ended up hiring someone else and asked me to train them. I told her that if l was good enough to train the new manager then l was good enough to be the new manager and quit. I heard a week later that the new manager had quit because there was no one there who knew how to train them and got stressed out so they left. The director then had to take over and l heard that it was so chaotic that they lost half their members. Good times.",
            "I'm confused -- why was there nobody scheduled for the other shift?",
            "And that's why managers need to learn to listen to the lower level employees who actually understand how the process works.",
            "In all honesty, this sub provides better leadership / management training (on what NOT to do) than a ton of soft skill classes I’ve taken.",
            "What I never understand in these situations is why the unqualified with no experience person gets hired over the qualified and experienced person.\n\nDoesn't someone in the company ever say, \"Maybe hiring Ms. No qualifications/no experience seem like a bad idea when we have Mr. Qualified /lots of experience available....?\"\n\nOr was there some kind of hanky panky between the new manager and a higher-up in the company?",
            "I'm guessing this must not be in the US because no governmental anything here automatically fines a company for anything anymore.   \n\n\nFor a fascinating look at why the US no longer prosecutes corporations for anything, read the book: The Chickenshit Club.",
            "It sounds like you're a security guard or something, but these stories absolutely suck without knowing what the main character is actually doing at their job .",
            "This reminds me of a retail job I had. I had been shadowing the assistant manager for several months, working overtime without being paid for it (by choice) to make sure I was the best choice for a new AM role. Well, the current AM got fired because an expensive product went missing, and I immediately applied to be the replacement.\n\nA few months later, a girl I worked with who knew nothing about the position was hired. I was told she was chosen specifically because she was a woman, and they wanted her to be the first female store manager.\n\nI left a few months later.",
            "Assistant to the manager?",
            "> I spent 12 hours watching movies and doing absolutely nothing at 2.5x pay (PornHub rates). \n\nHell yeah, brother.",
            "Sounds like my old employer.  Contract security is crazy.  I have a solo gate post now and am currently watching TV because its a super slow day.  I don't have to patrol, just check trucks in and out.",
            " *I spent 12 hours watching movies and doing absolutely nothing at 2.5x pay (PH rates). I literally took my shoes off and spent the day with my feet up on the desk!* \n\n&#x200B;\n\nI literally do this everyday half of the day i do somework\n\nand rest im on reddit \n\nIt gets boring",
            "why do companies enforce an arduous 12 hour shift, when in realism, instead of 2*12 hour shifts, you have 3*8 hour shifts?\n\nsame pay, more people.\n\nI see the same thing in hospitals, fire, police. endless hour shifts, which can be easily split into smaller shifts for more people.",
            "What happened to the people who would be assigned the night and weekend shift while you were on the day shift?",
            "No one ever listens.",
            "I’ve cost my company 10ks plenty of times 😅",
            "You work 5 days a week for 12 hours a day..? That's crazy.",
            "Good story, but presumably your company didn't hire a child as a manager.",
            "> I'll be in my bedroom.",
            "If it protects the company from lawsuits...",
            "You used to be in the military?",
            "Nice.",
            "What the hell kind of company is allowed to boom people for 12 hour shifts on the reg? That can't be legal.",
            "Well that’s also what you’re gonna get if you employ minors (if she was in fact a girl, and not a lady/woman/etc). This one is on the company for sure.",
            "Nice story, but not cool to refer to a professional woman as a girl.",
            "[deleted]",
            "now we know why you were passed over for promotion",
            "You costing them 10k is a reason why they didnt consider u for the manager spot in the first place..",
            "[removed]",
            "When you’re a turd employee"
        ]
    },
    {
        "post_id": "c1y7ej",
        "author": "larniebarney",
        "title": "Told my grandpa I was allergic to the beans he made for dinner. He doesn't believe me & insists I eat everything I've been served. Ok, you're the boss.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c1y7ej/told_my_grandpa_i_was_allergic_to_the_beans_he/",
        "score": 13982,
        "num_comments": 502,
        "created_utc": 1560835343.0,
        "selftext": "Was shooting the shit with my grandma when this old story came up. Pretty mild but still brings a smile to my face. \n\nTo preface, I'm allergic (or at the very least wildly intolerant) to beans. When I was a tot, my mom tried to feed me beans a few times and within five minutes I would projectile vomit right across the kitchen floor. She put two and two together and after that, no more beans for larniebarney.\n\nSo jump forward a few years, I was around 6 - 8 yrs old visiting my grandparents for winter break. I loved hanging out with my grandfather; he'd always bring me neat things like books and logic puzzles for us to play through together. That day in particular, he had bought me new crushed velvet pajamas covered in stars and comets. I was super excited to wear them to bed and was already wearing them at the table when everything went down. \n\nDinner time rolls around and my grandfather reveals that he made slow roasted beans for us. I immediately tell him and my grandmother that I don't eat beans because they make me sick. My grandfather rolled his eyes and told me to sit and eat my dinner. \n\nNow, to be fair, I was a little bit of a picky eater, but I never would claim that the food I disliked would make me sick. I'd just say I didn't like [insert food]. Beans were the only thing I'd explicitly say made me sick. \n\nI repeat again that I don't eat beans, that my mom never makes me eat them, and that they make me sick. Grandfather starts getting mad and tells me that either I sit at the table until I finish all the beans I had been served or I can go straight to bed and expect to be put on restriction for the next few days. My grandmother tells him that he should just leave me be, but he isn't having it. \n\nThis was the only time I ever felt anything other than pure wholesome love for my grandpa. He and my grandmother finished their dinner and started to clean up while I thought about what I should do. On one hand, I could just go to bed and accept that I'd probably have no cartoon time for the next few days, but I was so mad that he didn't believe me that I refused to accept being punished for telling to truth. \n\nSo I sat there and ate the entire fucking bowl of beans. I'm 24 now and that singular bowl of beans probably represents at least 80% of the beans I have ever consumed in my life. I hated the texture, the smell, absolutely everything about what I was eating, but he said to eat them all so that's exactly what I was going to do. \n\nAbout halfway through I start feeling strange but push through it, swallowing the beans whole and washing it down with as much milk and cornbread as possible. All in all it probably took me 15 or so minutes to finish, but it felt like hours. \n\nI finish up, put my bowl in the sink, and softly announce that I'm done with all my food. I remember he patted me on the back and said \"see? it wasn't that bad was it?\" as we walked down the hall towards the bedrooms. At the very end of the hall was the doorway to his + my grandmother's bedroom, with a bathroom directly across the hall; he told me to brush my teeth while he changed into his pajamas, and that he would come to my room afterwards to tuck me in. \n\nI open my mouth to say ok and all of a sudden all my larniebarney alarms go off; I about face so that I'm facing the bathroom, try to take the few steps to at least make it to the sink, fail, and proceed to projectile vomit all over the floor, the vanity, the mirror and myself. \n\nChunks of beans and cornbread collected at my feet as I coughed up everything I had swallowed whole. The milk mixed with the beans in the most horrific way possible, making the vomit thicker and stickier. My new pajamas were absolutely ruined and the smell only made me vomit even more. I started to cry as I stood in a pool of the vilest mixture of fluids I had ever seen come out of my body. \n\nIt was so sudden and violent that my grandparents couldn't even react right away. My grandmother (who had been lying in bed but could still see everything go down) scooped me up and started consoling me. I peeped at my grandfather, who was still standing there horrified at what he had just seen, and stammered \"*I told you beans made me sick*\" in the most defeated voice I could muster. \n\nMy grandmother gave him a death glare and told him curtly that since he had pushed me to eat the beans, he could clean up the beans. She helped me shower in their bathroom and calm down, until I asked her about my pajamas. The stomach bile basically ruined them and she told me that we should just throw them away. I cried even harder. When she finally got me to lay down and go to sleep an hour later, my grandfather was still purging the bathroom. \n\nThe next morning he apologized to me profusely and promised he'd never do anything like that again. As far as I know, not only did he never again force me to eat anything I said I didn't want, he extended the same policy to the rest of his grandkids. Years later, he'd say he could still remember the stench of the bathroom that night and the disgusting sensation of scooping semi solid beans from every imaginable surface. \n\n\nTLDR: Grandfather doesn't believe that I'm allergic to beans and tells me to finish my bowl of beans or be grounded. I eat all the beans then projectile vomit all over the bathroom, leaving him to clean it up.\n\nEDIT: because quite a few people have pm'ed or commented asking why my mom didn't tell them about my bean intolerance:\n\n\"*I'm pretty sure she did when I was younger and they may have just forgotten because they never make beans like that in the first place, even as a side dish. For context, before this happened I had lived with them for six months straight at one point and we never had beans during that period.*\n\n*I definitely remember mom yelling at my grandfather over the phone the next morning saying she had 100% told them before.*\"",
        "permalink": "/r/MaliciousCompliance/comments/c1y7ej/told_my_grandpa_i_was_allergic_to_the_beans_he/",
        "comments": [
            "I’m kinda bummed that the pjs were ruined. They sounded delightful",
            "For thinking that you were probably fibbing about the beans, gramps sure got more than he bargained for. While it was an evil MC for a small kid to execute, it was pretty wholesome how your grandpa handled the whole thing afterwards. It's one of those rare cases where people actually learned from the MC they were subjected to.",
            "Oh god. My nephew did something like this once to their baby sitter with green beans.\n\nI don’t think he’s allergic to them, but his body violently rejects them. Mom and dad knew it, so they don’t force him to eat them. They even told the baby sitter, he has a very picky stomach and will/can only eat a selection of foods. He will let you know what he would like for lunch/dinner.\n\nWell, she cooked whatever she wanted for dinner and included green beans. He said he couldn’t eat them and after some back and forth she got really angry and yelled at him to eat them or he was grounded from electronics and could go to bed (it was only 6pm).\n\nWell, he MC’d with the best of them and choked them down. After he finished the last bite, he got up to put the plate in the sink, stopped and turned towards her, and projectile vomited on her from the waist down. That did not make her happy and sent him to bed.\n\nMy sister and brother in law got home at about 8:30 and asked where he was, so she explained the whole story (of course twisted to make her look the victim). My sister calls him down and asks his side of the story and he tells the truth. Well, green bean vomit is in the trash can.\n\nSome LOUD words were exchanged and they fired her on the spot.\n\nHe waved bye with a smile on his face.",
            "Peas. Peas were my downfall. My grandma insisted I try bites of them at her table. Nope! I’d gag and scamper to the bathroom to hurl (thank 1900 house arrangement, the bathroom was right off the dining room). Mashed, boiled, stewed those evil orbs of green grossness found their way to the toilet. \nMy mom finally told her to stop torturing me and just forget trying to push them down my throat.",
            "Oh man, that just sounds horrid. \n\nI can kinda understand, while I don't seem to have digestion issues with brussel sprouts, I cannot for the life of me eat them in any sort straight fashion.\n\nWhen I was around 8-9 my parents made brussel sprouts for dinner and I just couldn't eat them. My parents thinking I was being picky (which is ironic considering I was never picky about anything) made me sit at the dinner table until bed time because I would start gagging whenever I tried to eat the brussel sprouts. Then I was told if I didn't eat them for dinner, I would be eating then for breakfast. So I kept trying to take the smallest bites possible, didn't help very much. \n\nEventually I ate maybe half but my gagging only got worse. Then I jumped up, an ran to the bathroom with my father telling me to get back to the table. I then released my whole dinner into the toilet. Too this day, I still cannot look at brussel sprouts the same. \n\nWeirdly if they are a part of a dish and like shaved into it, it's not that bad but cannot eat them roasted, steamed, grilled or any way in which they are the main flavor.",
            "Those crushed velvet pjs were the real victims here.",
            "I’m the exact same way! And had the exact same experience at day care!\n\nBeans and franks. Canned beans and franks. \n\nCleaning up a carpet of puke because you don’t listen when the child tells you that beans make him sick tends to make people more attentive to details like that later.",
            "I had a similar situation as a kid. I was NEVER a picky eater. There were a few things I didn't like, but I had no problem eating most foods.  \n\n\nMy parents went on a vacation, and we were staying with a family friend. That morning, I was told they were ordering Chinese food for dinner. Heck yeah! Chinese food is GREAT! My favorite! She asked what I'd like, I told her, all was well.  \n\n\nUntil I came home from school with a bad stomach ache. I got to the table for dinner still feeling like I was dying, and I sat at the table and tried to explain to Sally that my stomach hurt and I couldn't eat. Her husband started bullying me about it, how Chinese food is expensive and I'm wasteful. I told him that I let Sally know my stomach hurt earlier that afternoon, but we had no way of knowing it would still hurt by dinner time. (In hindsight, I now know that my frequent stomach aches, headaches, and vomiting as a child were all from anxiety due to being bullied so badly. I didn't get better at their house because I didn't feel comfortable there.) I said I'd still be happy to eat it for breakfast. Apparently that wasn't the right answer.  \n\n\nMy brother speaks up for me. \"Mamaleh LOVES Chinese food. If she's saying she hurts too much to eat, there's a problem. She'll definitely eat it for breakfast, though, she eats her cold leftovers all the time, the little weirdo.\"  \n\n\nSally's husband says, \"Eat it NOW or I'll take away your books.\"  \n\n\nNot my books!  \n\n\nCrying, I start to eat. I eat as much as I can, while crying. They WATCH me choke down every last bite. Everyone else had finished long ago, but they were... I don't know, trying to prove I wasn't in pain?  \n\n\nAnd then they watch me vomit all over the dining room table. All over their pretty table cloth, the centerpiece, splashing across the table onto the kid across from me... It was just a nightmare.  \n\n\nMy brother chirps, \"Maybe she should have just had it for breakfast.\"  \n\n\nSally, finally, has something to say to her husband.  \n\n\n\"Making Mamaleh puke it all up didn't waste a penny, right?\"",
            ">\tno more beans for larniebarney\n\nFor some strange reason, I just love this phrase.  Lol",
            "Cooked spinach was my kryptonite. Within a minute of downing any, it'd come back up.\n\nOnce my mother made me go to bed without supper because I didn't like what she served. In the morning, she had to clean up my lunch and bile.\nAfter that, if we didn't like supper, she'd give us peanutbutter jelly sandwiches. Apparently I'd throw up when hungry, or something. \nDunno, I personally don't remember and this is a story my mom has told me.",
            "Beans, beans, the magical fruit\n\nThe more you eat\n\nThe more you projectile vomit all over your grandparent's bathroom.",
            "Eggs do that to me.\n\nOne egg in a cake?  Sure!  I can have a slice.\n\nAn egg itself, in any manner?  Even just a few bites? My insides doth protest WAY too much.  Apparently my mom actually used the knowledge it would make me puke asap a couple times when I was a kid when she was worried I might have eaten something harmful.  That was the kind of kid I was: constantly putting things in my mouth, even the thing I had to eventually realize was made of (in the eyes of my body) poison.",
            "When I was about 4-5 I was struggling to eat my dinner, had been told I needed to finish it for some reason, can’t remember. But I didn’t chew the next bite of steak properly and only swallowed half of the meat, but it was still attached by a ligament or gristle to the meat I hadn’t swallowed, so I started choking on it. Ended up throwing up into my plate. Looked at it in shock/fear I almost died. \nMum(jokingly): You still need to finish your dinner!\nI just burst out crying. Fun times",
            "It is hard when you react badly to a food that isn’t a traditional allergen. I know three people with varied levels of bad reactions to eating and/or using personal care items containing coconut, and there are so many words that are code for coconut. Since it is the current wonder ingredient, that stuff is in so many things from almost every toothpaste and soap to even store brand Nutella and store brand rice krispy treats to vegetarian burgers. I wish there was an app allergic people could use to scan products and see if their allergen is present. Except when people know the problem, they probably would never think to warn you in advance when a product contains beans.\n\nI hope your grandpa got you new pajamas.",
            "I have legume allergies too. It's really hard to avoid in processed food. Guar, locust bean, soy beans, castor, pea protein, unlabeled \"vegetable\" proteins and broths - they all make me ill. So many people didn't believe me as a kid, which was nuts to me because I loved to eat. I wasn't picky otherwise.\n\nI still have to deal with it occasionally and often just say \"no thanks\" to things rather than having to explain why I need to see the label...",
            "Nearly had the same reaction to slimy food. It is a texture thing for me. My mother still cracks up everytime I get asked if I want a children's meal because I ask for a plain burger or something just without tomatoes or pickles.",
            "Normally these stories are against some asshole but every once in a while we have to look and remember that sometimes normally good people can be stubborn assholes for a moment or two",
            "I have a rather sensitive stomach and try to limit my intake of certain foods. My family is probably the most unreasonable at understanding ANYTHING going on in my life and whenever I try eating with them the only real flavor to the food is the cheese and grease. Guess what bothers my stomach the most! (That’s right! Cheese and grease) They always wonder why I have troubles with them and this is seriously the least of my worries in dealing with them. Some people just don’t understand until they see something for themselves.",
            "This happened to me too as a kid. Seafood doesn't agree with me, in any form. Well, my new, strict stepmother (from Minnesota where fish is eaten all the time) insisted I eat fish. I would throw up every time, but do so quietly after dinner so as not to cause issues. \n\nWell one day I had enough.  I said no thank you to the fish at dinner. She said fine, go to bed hungry, and it'll be here in the fridge for breakfast. \n\nThe next morning I sat there at the table staring at the stinky leftover fish. It was repulsive to me, and I still refused to eat it. I went to school hungry. \n\nAfter school, there it was again waiting for me. We all had to go somewhere that night (I forget where,  but somewhere that we all had to dress up for).  I finally had to eat that gross old fish, while everyone else ate their fresh dinner.\n\nSo after, we all get in the car to go (I wish I could remember where!), and I feel sick. Once we hit the highway, up came that fish, all over the car, our clothes, my siblings- it was everywhere.  My stepmother was so angry and kept screaming at me (while still driving down the highway) that I threw it up on purpose.   \n\nP.S. the car stank for ever more.",
            "Oh man that was like my parents and me. I’m lactose intolerant, though it enough I vomit I have the worse diarrhea for an hour after. \n\nBefore my parents acknowledged that I was lactose intolerant, they forced me to eat whatever they gave me, thinking I was being a picky eater. One day we had a pizza night with some family friends, and they told me to eat the pizza or else I wouldn’t get anything else to eat for the night. I was feeling very vindictive, so I ate 3 slices of pizza, had intense diarrhea, and clogged the guest bathroom toilet. \n\nMy parents later started changing the entire family’s diet so everyone cut out diary so I didn’t feel left out",
            "I have the same sort of thing with peanuts and peanut butter.  I'll throw up if I eat it but I can still eat peanut oil(or things fried in it)  and can still be around them.  Usually when people hear peanut allergy they Imeadiatly think that ill die if I'm within five miles of a spec of peanut.  Over the years accidentally consuming peanuts of some variety has caused me to find out it gets worse with age (when I was younger I just got an itchy throat,  then few years add on nausea and a headache,  then the vomit).  And majority of the time because at first I only said my throat was itchy,  my family chalked it up to being a brat who just doesn't like it.  Fast forward to a few years ago and I eat a Blondie(a brownie without chocolate that typically used peanut butter instead)  and Imeadiatly I feel terrible and nauseous. What was probably only 30 minutes felt like five hours and then I run to the toilet and vomit.  Now my parents believe me.",
            "RIP pajamas, we hardly knew ye.",
            "I’m allergic to pears, in a way you don’t wanna know. When I was 5 a lady brought pears to my daycare for her kid and, no matter what, every kid would have one. I like pears, but I knew I shouldn’t eat one. When she was told by the daycare leader that I have a pear allergy, but will not hesitate to eat one anyway, she smirked and *threw a pear at me*. Did I eat it? Yes. Did I regret it? No, but she did!\n\n ( ͡° ͜ʖ ͡°)",
            "I'm glad I'm not the only one who reacts this way to beans. I don't even know where the aversion came from, it always baffled me because as a kid I would eat EVERYTHING. My earliest memory was from when I was around 2-3 in pre-kindergarten at lunchtime, they made bean soup. I refused to eat it, one of the ladies tried feeding me herself, which resulted in me reluctantly taking 1 spoonfull of the soup and vomiting it back into the bowl. I still don't think it's an allergy but I can't even look at beans, which is a bit difficult given that I've moved to the UK, lol.",
            "Op, would you take stars and comets onesies?",
            "This was me but with spinach and eggplants. \n\nI don’t know what it was but I eventually outgrew it. I can eat spinach just fine right now. \n\nThe best part is, I had always refused spinach. One day my mother decide to “trick me” but chopping up the spinach and putting it in something else. (Basically a spinach pastry). \n\nI ate it. Didn’t complain. To be honest, didn’t know. \n\nI still vomited it out though. \n\nShe stopped forcing me to eat food since then. Lol.",
            "I kind of want to start a crowd fund to get you some more PJs - that’s super sad.   \n  \nF man, F",
            "But did they get you new pajamas?!",
            "Glorious. Absolutely glorious. Especially the part of premeditatively and maliciously powering through, eating the whole plate.",
            "Please tell me you got replacement jimjams.",
            "I did this with bread with nuts in it in the middle of an 18 hr car trip.  Said I didnt like the bread with nuts in it.  Forced to eat it and puked on myself and the back seat.  Had to smell puke for the next 8 hrs.",
            "I did this with cottage cheese in preschool, and a hamburger at home when my mom's best friend was babysitting me. I was about 3 at the time. \n\nIn preschool they told us we had to eat all our cottage cheese (which I'd never had before) in order to get the chocolate pudding dessert. Maaaan I shoveled that ish in fast so I wouldn't hafta taste it. Body said nope and it came right back out. I was soooo pissed when they told me I couldn't have dessert cause I threw up. Sorry heifers!\n\nThe other time was the best/worst tho. My mom left me and my lil bro at home with her best friend one night. Helen* decided to cook dinner for us. She made hamburgers, which I did not like at that time.  I told her as much but she forced me to eat it through tears. I tried to wash it down with as much red koolaid as I could to get rid of the taste. I don't really remember much more about that night except being mad as hell when i went to sleep....until I got woke up by mom. I was covered in pink throw up. Walking me to the bathroom she asked me if I was sick. I said \"No! Helen* made me eat a hamburger and I told her I didn't like em and she made me eat it anyway!\" Absolutely ruined my favorite footie pajamas. I don't remember being forced to eat anything I was dead set against ever again lol.  Years later I realized I had been laying on my back and how serious that could've been. Kinda scary",
            "I was at the orthodontist. They had to prep your teeth for braces with a very bitter chemical. I told the orthodontist I was going to vomit. \"No you're not\" and continues his work. Guess who got vomited on.",
            "This is why I'll NEVER make my kids eat anything they don't want.  My dad did this to me with oatmeal, I vomited it all back up, he still punished me.",
            "I get instant mega-shits when I eat brussel sprouts which is a shame because I love the taste of brussel sprouts. It took three times for me to make the connection because I'm a dumbass.",
            "I don't know why, but I wish there was a gif of your grandfather's face as he watched that scene unfurl. I don't know what he looks like, but I'm positive I can picture the emotion on his face.",
            "The amount of grandparents who think food allergies are just made up are too high. I've read many stories of people who continue to try to feed certain foods to prove the person is making it up. From restaurant managers who return food containing allergens to grandparents/parents intentionally adding allergens to prove it's fake. \n\nThe worst was a little girl who was allergic to coconut. Grandma insisted on using some coconut oil on the girls hair because culture. Ended up killing the girl.",
            "Ugh...I have an intolerance to lima beans, they make me gag. When my aunt babysat, she made me eat a whole serving of them and then punished me for being a \"drama queen\" when I gagged. Supposedly I was working myself up on purpose by crying and hyperventilating. After dinner I was sent straight to bed while my siblings and cousins got to stay up until normal bedtime. I WISH I had vomited on her.\n\nWhen my mom found out, she was pissed. But she didn't have any other free babysitters besides my aunt. So she instituted a rule, I was always allowed to substitute a plain peanut butter sandwich (no jelly, honey, bananas, etc. just peanut butter) for whatever had been served, at the cost of losing dessert. This satisfied me, no more eating beans that had already touched the back of my throat and been gagged back out. It satisfied my aunt because if I \"chose\" to be a \"picky eater\" I wouldn't be rewarded with dessert.\n\nAs an adult, I am no longer in contract with the aunt who made me eat lima beans. This makes me happy and if she isn't, tough luck. :)",
            "My brother managed to vomit eggs on our car...across a 15meter distance.\n(To the other side of the room, by the window, right on the car and everywhere in between)",
            "I'm glad your grandmother made him clean it up. Sorry your jammies got wrecked though, they sounded hella cool.",
            "Awwww sorry about the pj's! I like your grandma and grandpa's reactions though--you know he meant well and thought to teach you a life lesson, but it backfired spectacularly!\n\nI never liked cottage cheese and I still remember sitting at the dinner table at about age 6 or so, refusing to eat the cottage cheese served with the meal, and then having to go straight to bed, early and without dessert.\n\nIt was the one and only time I ever faced my mom down on a food refusal, and to her credit, she never insisted again that I eat cottage cheese.",
            "Okay, this triggered a rage flashback for me. \n\nI think one of my biggest pet peeves is gaslighting children, as if all children go around thinking up new and creative lies just to be little assholes. Some kids are 98% brutally honest. Some kids lie sometimes. Hardly any kids just go around lying all the damn time, especially when it comes to something like this. \n\nI cannot, for the life of me, understand why some adults just refuse to listen to a kid when he says, \"Hey that makes me sick,\" or \"I'm allergic.\" To respond immediately with knee-jerk denial is to treat a child like they don't know their own mind. How can you teach me to become an honest adult when you don't believe anything I say as a child? Why should I bother being truthful? How can I trust you, an adult, to protect me and keep me safe and healthy when your automatic first assumption is I'm intentionally making shit up?",
            "Milk and greasy foods did me dirty when I was younger. Now I just drink coffee with my bacon",
            "I believe this may be the Perfect Malicious Compliance story.",
            "My weapon of choice is red beetroot with sunflower seed oil.",
            "My god this is the most wholesome malicious compliance ever",
            "r/BeansInThings",
            "When vomit is the happy ending.\n\nGreat story, well told.",
            "I have a similar story except it was a hotdog and I'm not allergic my aunt just couldn't cook for shit (yes I know its hard to screw up hotdogs). We were staying at her house for the weekend while my parents moved our house. She was making dinner but at the time I did not like hot dogs. She proceeded to force me to eat this undercooked, microwave hot dog. Shortly after, I run to the bathroom and puke everywhere. She had just painted the bathroom earlier that day.",
            "can we get some F’s in the chat for the velvet space pajamas ?",
            "Kinda similar thing happened to me as a kid except it wasn’t an MC deal, just me being shy with relatives.\n\nI used to get migraines which would make me vomit if I didn’t get Tylenol in time, they weren’t too frequent but it was every headache that wasn’t treated. One time my siblings and I were saying with aunt, uncle and cousins, and I got a headache but didn’t tell my aunt because she was grumpy and strict (at least in my view) so I was kind of afraid of her. Then my stomach started bothering me so I finally told her I didn’t feel well, but by that time I had to just run to the bathroom. My cousin told her that my brother had hit me in the stomach earlier (which was true but unrelated), so I had to say that that wasn’t the problem. I don’t know if she knew about the migraines previously but I didn’t tell her about the headache so I could get Tylenol.",
            "\"YOU GET TO CLEAN THE BEANS\" rip my sides.",
            "As miserable as the whole ordeal sounds, big kudos to your grandpa for personally apologizing to you and admitting that he made a mistake. Telling children that you messed up and want to make things right can be really hard for a lot of adults, but it sets an amazing example.",
            "*My* mom figured out I was sensitive to quite a few vegetables when I was very young.  \"Projectile\" was a good adjective, but the direction was the opposite of \"vomit.\"  \n\n*Her* mom couldn't figure out why I *always* wound up with the explosive shits every time I went to her house.  She also kept insisting that I should eat certain things that I knew I shouldn't (corn, peas, and green beans were at the top of her list, and all of them were problems for me).\n\nIt took 11 or 12 years and a diagnosis of \"spastic colon\" from a medical doctor with recommendations that I avoid a specific list of foods (most of which my mom had already figured out) for my Grandmama to understand that I'm a picky eater for a reason.",
            "What a great grandpa, he learned from his mistakes and thought how to make it better. I mean, it's a shame that it happened but otherwise he wouldn't have gone through the experience.",
            "Your grandpa sounds like a good guy. We all make mistakes, but his ability to immediately own up, apologize, and learn from this is very telling of his character.",
            "Did you get new pj's though?",
            "My mom did something similar on Thanksgiving when I was around 9-10 years old.  I never liked the stuffing she made because she put too much sage in it for my taste so it was one of the few Thanksgiving offerings I wouldn't eat.\n\nI don't know if she was insulted because I didn't like her stuffing or if she just had a bug up her butt about it in general, but she decided I was going to eat a serving of it before I'd be allowed to have turkey, mashed potatoes and all the other traditional holiday fare.  Keep in mind that she did this in front of our relatives too (aunts/uncles/cousins).\n\nSo I valiantly try to eat the pile of stuffing in front of me, gagging with every bite, which resulted in my mom scolding me and telling me to stop being such a baby. I was too busy trying to get the stuffing down so I didn't notice that my two aunts were getting upset with my mom.  Made it to less than 10 bites before gagging so hard I puked up what I had already ate all over my plate, the tablecloth and my clothes, which in turn resulted in my mom screaming at me to go to my room and don't come out until she told me I could.\n\nI headed to my room, still covered with vomit and crying out of embarrassment and being humiliated in front of my relatives. After  I get to my room I realize that my aunts are yelling at my mom for what she did to me and that they're going home because she ruined Thanksgiving for everyone at the table.\n\nI full expected to get a whipping, or at least more scolding, but instead my mom came into my bedroom with a paper bag and told me to put my vomit covered clothes in them and then take a bath. When I got done and was dressed she brought me a plate of all my favorite Thanksgiving foods and set it on my bed.\n\nShe never apologized (She was of the school of thought that parents didn't apologize to their kids), but she also never forced either me or my sister to eat something we disliked from that day forward. If she made split pea soup, which mom & I loved, but my sister hated, she made my sister some scrambled eggs. Same thing for me when she made tuna noodle casserole, which I despise (still do).",
            "I had a similar experience at the same age. I was visiting my grandparents with my family. My grandfather would grill these big steaks with a huge rind of fat on them. I notoriously hated eating the fat on meat, and would always dissect my dinner to remove any traces. It was a taste and texture thing.\n\nWell, this time my Dad apparently decided he had had enough of this behavior, maybe he thought my pickiness was embarrassing or something. Anyway, he commanded me to eat the fat, and threatened some kind of punishment if I refused. At this point we had been sitting at the table for a while, and all I had left was this fat and a glass of room temperature milk. I started choking down this fat and washing it down with the milk. I may have been crying, I don’t remember. I just remember how incredibly grossed out I was by it... and then I felt myself gagging, and I immediately projectile vomited all over the dining room table.\n\nI just remember feeling incredibly vindicated by the whole thing. I think that was the last time I was ever told to eat something I didn’t want.",
            "This is probably the best MC story i've read.",
            "This is exactly why people who force kids to eat things they don’t want to eat piss me off.",
            "Holy shit this made me laugh harder than I should've. Your grandparents sound really sweet tho haha",
            "I'm glad to hear that your grandpa changed his tune/learned from his mistake. Sounds like your grandparents were really good people.",
            "So as a parent of a kid with a food allergy, this kind of MC scares me",
            "But did you get new crushed velvet space jammies?",
            "\"larniebarney alarms\" fuckin killed me.",
            "Reminds me of the time I was forced to eat spoiled cottage cheese because my mom and grandma wouldn't believe me when I said it tastes bad.  \n\nThey tasted it after a day of making me sit at the table until I ate it.\n\nI got ice cream for dinner and mom has never lived it down.",
            "Destruction:♾",
            "This is such a wholesome story. You got malicious compliance, but the person you were doing it do was a good guy and saw his errors.  Very nice story",
            "You triggered me. A few months ago, my 5yo absolutely destroyed our bathroom with vomit. The poor little thing tried so hard to make it to the toilet. She failed miserably. It was just a stomach bug though. I didn’t force her to eat anything.",
            "Oh man I feel ya but beans aren't so severe with me, only when they are mushed that's when the volcano erupts",
            "omgosh i should t laugh. oh poor wee kiddo. but dang you tell it funny LOL",
            "Wait so are you allergic to soy products as well?",
            "The MC is strong with this one.",
            "Why didn't your mom communicate the beans rule to them?",
            "Huh. When I was around that age, I used to have the same reaction to lentil beans. Only lentil beans. My mom made some casserole with them in it and I ate it, knowing I was going to throw up. I held out a tiny little napkin for me to throw up into, but I think I made it to the bathroom in time. I didn't even hate the taste, just thought they were meh. \n\nA doctor told me a few years ago that this doesn't sound like an allergic reaction, but who knows. I have no other allergies, and I don't think I still have the same issues with lentils...I've unintentionally had some lentils since (though maybe they were a different kind?), but try not to eat them in general. Maybe you no longer have the same issue with beans? If you don't like them anyways, though, totally not worth it!",
            "If your grandmother was anything like mine, he regretted that decision a whole lot more than just scrubbing a bathroom.",
            "I think that he probably thought you were being bitchy about the food since, as a picky eater child, thats exactly what i did with my parents (not the sick part the dislike) so he probably couldn't tell. I mean it's his fault but he would've had no idea.",
            "I’m legitimately mourning the loss of a stranger pyjamas from twenty years ago.",
            "Put on restriction?",
            "Are you allergic to all beans, or just certain varieties?\n\nDoes that extend to other types of legumes (e.g. chickpeas, lentils) as well?",
            "Wowie, Grandpa never expected that to back fire so horrifically.  Your incident caused him to re-evaluate and change his life.  Truly Epic.",
            "Can relate to the feeling of your grandparents not believing you just because you're a kid.",
            "I was expecting him to be mad that you threw up and make you clean it.",
            "This was a very well written account of this story",
            "It hurts me to know you will never experience the joy of red beans and rice",
            "I did this with tuna casserole except I just puked right there on my aunt's table.",
            "I found out the hard way that yes, my grandson really is allergic to carrots..its a lesson you do not forget.",
            "For me the best part is the death glare. Even if your grandfather could have been thinking after you vomited that maybe you had forced it somehow and it wasn't his fault, the death glare killed that idea instantly and from that point onwards it was more of a \"I screwed up big time\".",
            "I'm just glad the grandma didn't have to clean it up. My grandparents and great grandparents ran on a strict \"woman does everything get in the fucking kitchen\" system so I was scared til the end!",
            "Very well written account of your MC, RIP those pimpin jimmyjams.\n\nBUT I've read through most of the comments and I don't see how this isn't being made a big deal: the fact that you had the presence of mind, in your post-purged state, to utter *\"I told you beans made me sick.\"* To me, that is the crowning jewel on this whole ordeal and would've really driven it home to gramps that he did you wrong. The imagery of a limp, vomit covered child delivering that line is beautiful. Disgusting mostly, but also beautiful.",
            "Mine was not due to sickness but I did NOT like pinapple on pizza (I know, weird). Brother made me eat anyway and the pizza ended up on the sidewalk ala projectile as well.\n\nBut my favorite story is when my Grandma made me eat the asparagus. I told her I didn't like it. To be fair, I was a picky eater as a child, but she wouldn't listen. I threw it back up on the plate and I still remember what I said to her \"Do I have to eat it now?\" I went to bed with no ice cream and no replacement food. But she never tried that stunt again.\n\nSo yeah, my response to eating something I didn't want to was to throw it back up if I didn't get the alternative to go to bed hungry (Which I would totally be fine with).\n\nSorry you cried but I stand with you in pukey solidarity, OP!",
            "My thing, not discovered until college, is beer or even anything vaguely beer-like (hard cider, hard lemonade, hard root beer, even mead!).  The first beer didn't smell great, but it was the magical cure-all of college, so I drank it.  Midway through the third it all came up.  And ever since, merely the smell of beer makes me nauseous, such that I drop of beer (or related) has not touched my tongue in (counts) 25 years.",
            "It's weird how food is such a trigger for some parents. The most thoughtful, kind, loving guardians in the family can turn into screeching harpies when it comes to food. My mother used to force my sister to eat \"three Brussels sprouts.\" That was the bargain she made. As if Sis had some kind of iron deficiency and that was the only delivery system available. Never in my life did she force me to eat anything I didn't want, but for some reason she turned into a full-bore control freak when it came to stuffing my sister full of Brussels sprouts. \n\nI've had Brussels sprouts. I despise Brussels sprouts.",
            "Turns out you can teach an old dog new tricks.",
            "This story made me smile from ear to ear. I had and still have a very close relationship with my grandparents, but as a little girl, when we still stayed close to them, I was at their house all the time. The description of their house is also exactly how theirs is! With their room at the end of the hall and their bathroom right opposite. Thank you, for this.",
            "This exact same thing happened to me when I was about 6 or 7 with my Dad, except it was with oatmeal.\n\nI don't believe I was allergic, but I absolutely abhor the taste and look. He kept insisting that I eat it or I was going to be punished (IE. Go to my room, no cartoons, sleep early, ect.). So after a few minutes I finally take a spoonful into my mouth and immediately start vomiting on the kitchen table. Suffice to say, I think that was the last time he insisted on me trying something new.",
            "Aw",
            "Damn this story makes me crave Busch’s Baked Beans",
            "Fucking parents and grandparents...\"Try the peas!\" \"yeah like I've never tried peas\"\n\n&#x200B;\n\nStop treating kids like they're idiots",
            "This reminds me how as a girl I refused to eat 1/2 of a single baked bean.  That was used as an example for years about how extraordinarily picky and stubborn I was.  Well, you know what??  Maybe they should have tried to get me to eat actually GOOD beans and not that sweet monstrosity known as baked beans.  Those things are VILE.  I love pretty much every other kind of bean, just as long as it's not sweet.   So gross.  For YEARS I didn't even know beans could be good until I was introduced to bean burritos at Taco Bell when I was in high school.",
            "You have a bean intolerance, not an allergy.  Allergies cause anaphylaxis, an intolerance causes vomiting.",
            "You made me giggle like a maniac :)",
            "In Australia we have a breakfast cereal called weeties.  I love it and used to eat it every morning.  Until I fell pregnant.  I would eat it, finish the bowl and almost immediately it would come up like a geiser.  I had to stop eating them but every now and then I would have a bowl just in the hope I could keep it down.  Nope, it would come up so fast without warning every time.  Back to normal when I’m not pregnant.",
            "Thanks! I needed the laugh this morning",
            "I have a very similar story with my grandpa who I also adore and my jaw is dropping because of the similarities between my memory and yours.",
            "My story isn't malicious compliance, but this reminds me of something my grandfather did when I was a kid. I don't remember quite how young I was, but I was young enough to be using a sippy cup, and the lid had a sort of stopper in it that you stuck into the lid underneath the sip part, so that the beverage wouldn't spill out if the kid turned the cup over. I don't remember if there was any funny exchange between him and me regarding putting that piece in, but he didn't put it in and when I was in the bed a few minutes later, I spilled a whole lot of apple juice onto myself.\n\nTo his credit, he immediately washed my pajamas, but thinking back it might have also been because it spilled onto the sheets and blankets on his and my grandmother's bed.",
            "Are these it: https://www.houseoffraser.co.uk/brand/biba/constellation-print-pj-set-aj2904#colcode=aj290400",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/itoldyouiwassick] [Told my grandpa I was allergic to the beans he made for dinner. He doesn't believe me & insists I eat everything I've been served. Ok, you're the boss.](https://www.reddit.com/r/IToldYouIWasSick/comments/c23j1u/told_my_grandpa_i_was_allergic_to_the_beans_he/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "One way to be put off beans for life!!🥴🤢🤮",
            "I did a minor version of this with asparagus when I was a kid. My dad made me eat it despite the vile smell, and I spit it out and completely lost my appetite... the first time. The second time, a year or so later, he’d forgotten. And this time he made me eat them. Two bites in, I barfed all over my plate. \n\nThis gave me a reputation as a “picky eater” as a kid. I eat foods my parents would never dream of — which to be fair includes Indian food, spices, and sushi. But I was supposedly picky when I was a kid.",
            "I have the exact same issue with beans. I've been that way since I was a child. \n\nGreen beans and string beans don't bother me. Any other beans would make m vomit. However, small amounts will just make me nauseous and uncomfortable.\n\nI got something from taco bell once that wasn't supposed to have beans. I told my husband I could taste them. I ended up sick for the rest of the night. \n\nI also don't like the taste. I wonder if that's my body's way of telling me to stay away from them.",
            "oh man, lucky it didn't kill you like the grandma who put coconut oil in her granddaughter's hair.",
            "Did you get a new pair of pajamas to replace the ruined ones?",
            "one would wonder why the parents never relayed this kind of information. i know there's a lot to handle as a parent, but would it really take that long to say \"oh by the way, he can't eat beans. everything else is fine\" or mention it as soon as you speak to them next? i know everything my niece and nephew are allergic to, and i can only swing by to see them once every few months as scheduling permits.",
            "Wholesome",
            "Ah what a delicious and satisfying malicious compliance story. This made my day",
            "That happened to me but with green beans. I hate them so much, but I only occasionally get sick. \nOne of the few times my grandpa was over at my house I threw up from green beans. After that I didn't have to eat them at his house.",
            "Awww man what a sweet grandma",
            "I, unlike you, was and still am a picky eater. However, when my grandparents cooked something, I ate it because I felt bad saying no. One of the last things my grandfather cooked for me was tripe. I found it horrid but still ate it, with a smile, and I was 19.\n\n&#x200B;\n\nMy grandpa died some months after that. My grandmother still remembers the episode, somewhat fondly.",
            "That is fucking hilarious! You’re my hero! 😂😂",
            "Reminds me of that scene in 'Stand By Me'.  \n\nLARD ASS  \n\nLARD ASS  \n\nLARD ASS",
            "Something like this happened with me and my grandma where she was feeding me and I said I was so full and she kept insisting I take just /one more bite/. Ok gramma. I take one last bite. Cue instant vomiting all over the dinner table.",
            "I’m pretty allergic to walnuts.  I can eat one, but I’d get a dozen or more canker sores within about 10 minutes. \n\nSo, I worked at an agency where there was a support call center in house.  There were 25 agents, with 24 being women.  There were frequent birthday, holiday, and impromptu mini parties where a dozen people would bring baked goods and share around. \n\nDottie... fucking Dottie.  She’s one of those people that just doesn’t believe anyone else matters.  I told her I had a walnut allergy, and she told me she’d used pecans. They were crushed, so it wasn’t obvious. \n\nOne bite, and I knew.  I spit it out, and stormed out of the room.  About 10 minutes later I got three canker sores inside my lip where walnut particles had, I guess, stuck between my teeth.  \n\nWhen I showed her, she said I’d bit my lip while I was being over dramatic earlier. \n\nFucking Dottie.  What a cunt.",
            "This is honestly the best malicious compliance I have ever fucking read.  Bravo!!!  I'm dying laughing!!",
            "As a healthcare worker whose main job is to maintain patient's airways and ease their work-of-breathing? I'm always dismayed to read about folks \"challenging\" a person's allergies in this way ... and about said people willingly going along with it. Know what you can and can't tolerate, whether medically or emotionally, and allow nobody to cross over those lines. Have an upvote for an amazing story and I hope your grandpapa wasn't the only one who learned a lesson that day.",
            "Grandpaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaargh.",
            "Mine were soybean, I remember eating them when I was 6. I knew that they were not my thing the moment I tasted them, but I had to finish the whole plate because being African not eating all your food can get you whooped. Why ? Because kids are starving in Somalia or someother place. I still remember the yellow green vomit and the accompanying fumes. F@#k soybean, up to this day (27now) I stay away from anything soy.",
            "Congratulations, you played yourself, Gramps.",
            "Yo I developed a semi-severe \\[my throat casually just swells a lil more each encounter \\[my high ass ate a burrito thing once cause \"itll be fine ill find benedryl if i have to\" and uh no fun\\]\\] allergy to beans and NOBODY even my husband fully believes me on it and its so great to see beans dont like others too",
            "I don't have any food allergies, but saying that I am allergic to dust (as in, my throat tightens up/starts burning AND recently I get a nasty rash where the dust was?)...yeah...nobody believes me on this one.",
            "I have a kinda similar story.\n\nI was at my grandparents' house, and the way their dining room table was set up, if my dad didn't get up, I couldn't get up. I was probably 6 or so.\n\nSo we were eating dinner. I had just tried a new vegetable (broccoli I think, but it might have been asparagus). I start feeling sick to my stomach, so I tell my dad and ask to go to the bathroom. Well, he makes a snarky comment about not eating vegetables, but doesn't let me go, which is odd, since I was never the picky eater. That was my brother's shtick.\n\nAnyways, I just sit there for a little while. Then I   barfed it all back up, luckily into my salad bowl for the most part.\n\nMy dad was pissed. He hit the back of my head and went on a rant about how wasteful and disrespectful I was. My mom and my grandpa didn't say anything. My grandma said my dad's name disapprovingly. My dad didn't like that and started asking \"what?\" like he was surprised and outraged that she was calling him out for it.\n\nThey stared at each other for a little while. Then he got up to let me go to the bathroom. I didn't really feel the need to go anymore, but I wasn't going to disobey my dad, so I just waited there for a bit. There was some yelling. Eventually, I came back. They had cleaned up the mess, and we went home shortly after that.",
            "To be honest, I would have reacted the same way as the grandpa in the story. I would have just assumed the child was being a picky eater.",
            "As a father, if my dad or father in law did this to one of my kids I'd be pretty furious.  I wouldn't let them live that shit down for at least a year.  As a child I would have done the EXACT same thing.\n\n  \nFor those awesome pajamas that didn't even get to be used to their fullest potential even once:  \nF",
            "I had the same thing happen to me, only with my uncle. He made me eat cold pork‘n beans and I promptly puked them all over him. They shoulda listened!",
            "Well at least he was sorry",
            "This is also a great illustration of why Baby Boomers are fucking so much up right now. Their parents suffered through the war (and often the Depression), and as a result had some pretty extreme views on food, parenting, waste, and tradition. Their kids grew up with all that normalized, and it only warped the way they passed it along to *their* kids.  Rather than notice just how extreme they are, Boomers are blaming the next couple generations for not being as broken.",
            "Well, in his defense: You were a picky eater. He probably just thought you try to talk yourself out of it.   \n\n\nAlso I never heard that people vomit from eating beans before.",
            "Good for your control freak grandpa!!! Piece of shit!!",
            "I'm a little surprised that you ran for the sink, instead of just targeting your grandfather purposefully.  I guess it's just the instinctive reaction.",
            "Some old people think food allergies are bullshit and that we're all just wusses.",
            "You had me smiling at “when everything went down” (probably unintentional but amused nonetheless)",
            "> Grandfather starts getting mad and tells me that either I sit at the table until I finish all the beans I had been served or I can go straight to bed and expect to be put on restriction for the next few days.\n\nHere I would've thrown the beans on the floor and said: \"Done. They're finished.\"",
            "I will scold you for eating in the first place, physical safety always comes first, but personally I say you did a good job. Just don't ever do it again, you may die next time.",
            "Those pajamas were probably salvageable",
            "In terms of whether or not your mother told them: she may have, and they just didn’t believe her. There seems to be a somewhat common trend of grandparents not believing food sensitivities or allergies. Either that the parents are over-protective, or that we’re all “snowflakes” now, or just feeling like they confidently know how to parent due to experience so they don’t take parental instructions seriously.",
            "I didn't have any food allergies that made me vomit. Most of my food allergies were mild. Like hives and a rash or an upset tumtum.\n Oh, my grandparents on my dad's side were weird. Grandma L. had blinded her boobs. She looked flatter than her husband! Grandpa L had worn the same outfit for each day. He wore a green jacket, matching overalls, and work boots.\n The one time I saw him in a different outfit I didn't recognized him.\n The other Grandparents was Nana and Grandpa C. They were my sister and my favorites. Dad's family was all weird and his siblings we called by their first names.",
            "Why his mum didn't tell the grandparents: until 15 years ago nobody gave a fuck about food intolerances. It only mattered if you could DIE of something.",
            "You're a typical kid and your grandpa was right. Because of you I'm sure other kids in your family lied and got it of eating stuff. Worse kid.",
            "am i the only one who thinks that the problem was combining milk and beans (and eating too much) and this guy can probly eat beans just fine"
        ]
    },
    {
        "post_id": "p8bfc9",
        "author": "PipeOrganTransplant",
        "title": "Typical jerk neighbors complain about the truck in my yard - so I replace it. . .",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/p8bfc9/typical_jerk_neighbors_complain_about_the_truck/",
        "score": 13971,
        "num_comments": 709,
        "created_utc": 1629485434.0,
        "selftext": "I live in a mostly-quiet neighborhood with lots of snowbirds and weekenders because of the proximity to a lake.  The year-rounders are mostly retired and people generally get along fine.\n\nA couple years ago, neighbors on one side built a new garage and driveway - moving their cars much closer to my existing forsythia hedge.  I love the forsythia in the spring and basically let it grow however it likes so I can have the bright yellow flowers.\n\nAlmost immediately they started complaining that the hedge blocked their view as they backed out of their driveway.  In my state, neighbors have no right to a \"view\" extending over someone else's property, and our supreme court has repeatedly ruled that as long as trees and bushes do not actually impinge onto the roadway, property owners have no obligation to trim for visibility.  I keep a 5 foot strip mowed between my hedge and the road - perfectly reasonable to my way of thinking. . .\n\nSince they have no recourse RE: Hedges, they instead complain to county code enforcement about anything else they can think of.\n\nMy brother parked his (licensed and insured) project truck on my property a while back because he was in the process of moving and needed a spot for it while he was figuring things out.  In the meantime, he was in a bad accident in another vehicle and the truck has been sitting for over a year now.  The licence plate recently expired - and I got a letter from the county with threats of fines if it wasn't removed.\n\nCue the malicious compliance:  My brother decided to sell the truck for scrap and had it towed away this morning.  This gave my neighbors their temporary victory as they observed from their deck - and nearly 6 inches of improved view from their driveway.\n\nAt least until I moved my second vehicle - a 1960 Lincoln (which is about 2 feet longer than the truck - with current plates and insurance) into that place this afternoon. . .  As a single person with more than one vehicle, I may get around to driving that old car at least once more before winter. . .",
        "permalink": "/r/MaliciousCompliance/comments/p8bfc9/typical_jerk_neighbors_complain_about_the_truck/",
        "comments": [
            "A guy I work with had a old truck with a dump bed for his side jobs of tree removal. It was pretty beat up looking but it had current tags and he used it every weekend. His neighbors constantly complained about it being an eyesore and they wanted him to park it somewhere they couldn’t see it. They live in the mountains, no HOA and no rules about where you can park on your own property so he just kept it where he wanted it. One day his neighbor came over and got nasty with him about it, so he painted a giant middle finger on the dump bed and raised it up so it was pointed right at their house. Maybe next time they will mind their own business.",
            "My brother lived along a stretch of highway outside of a small town where we grew up. In his yard was a old volkswagon bug, one of the old ones. He'd had it for years and had hoped to fix it up some day. He was sentimental that way since it was his first car. \n\nFor three years his neighbors along that stretch of highway complained about the old car and badgered him to move it. They complained to the county over and over again, but the county couldn't do anything. Then one year, the town annexed a part of the county and spread its city limits to include the stretch of highway my brother lived on.\n\nAfter that, they started complaining to the city about his car. The city after three months of badgering by his neighbors finally served him with a notice telling him he had thirty days to remove the car or he'd be fined $50 a day till it was removed.\n\nMy brother who doesn't like being outmaneuvered combed through the city bylaws and ordinances and learned that why he couldn't have an old junk car in his yard, he could display lawn sculptures, art, decorative masonry, etc.\n\nSo, my brother gave his kids paint and brushes, sent them out to paint the car while he raised it up so the tires didn't touch the ground and left it sitting on trailer house adjusters he'd cemented in the ground under each axle. He finished it off by having a brass plaque made memorializing the death of his first car. This he fastened to the trunk.\n\nHis kids had painted flowers and dinosaurs all over it and something that looked like a carnivorous big bird. When the thirty days was up code enforcement showed up after a call from his neighbor. They hee-hawed over it, but in the end, art is subjective. With a plaque and children's paint he'd transformed a junk car into art and because the tires weren't touching the ground and the jack stands were permanently anchored in cement and not temporary, the city had no choice but to agree that it was art and tell my brother's neighbors they were SOL.\n\nMy brother loves telling this story and describing the I-just-bit-a-sour-lemon face  his neighbors made when they found out there was nothing they could do about it.",
            "Same with an HOA a Friend of mine lives in he had a work truck with his biz name on it and would park it in his driveway.  Rules of HOA are no vehicles with logos to be parked after 9pm or some crap.  It was like a 2 year old gorgeous truck that wouldn't fit in his garage.  So he bought a POS 85 truck rusted to shit and back, no bed, don't think it even had side windows.  His business was only like a mile from his house so he would drive there, get his nice truck out of the biz garage, and then drive the POS back home at the end of the day.  Tagged and Insured so nothing they could do about it, even made it a point to park it on the street in front of the karen.",
            "I have a 1967 Mustang in my driveway, but it currently doesn’t run. Hasn’t run for a little over 10 years actually. It was my moms, she never got around to fixing it, then just shifted that burden on to me. I never plan to get rid of it because it’s way too cool, I just haven’t been able to get the funds together to fix it.\n\nAnyways, a handful of people would constantly badger me about wanting to buy it, and I always refused. I never intend to sell that car basically. Well, one of the people I repeatedly turned away turned me in to the city compliance, and I got a letter in the mail saying I had 30 days to comply or they’d tow it. My options were basically get rid of it, or show it could actually move (the issue is that it had been sitting for like 5 years without ever moving). Well, I read through the entire city ordinance about cars, and found that because it’s a classic car all I actually had to do was block it from view somehow. Options included putting it behind a fence or gate, putting it in a garage, or, as I verified with code compliance, putting a tarp over it. I don’t have a garage, and I don’t really want to block my driveway with a fence and gate, so I bought a 20 dollar tarp and now nobody can do anything about it. And I’m sure the view of a crappy looking tarp is way more appealing than a beautiful classic car. Side benefit is I get fewer people knocking on my door asking about it!",
            "Once a week move it forward or back a couple of feet. That way you truthfully say \"I've started and have moved the vehicle once a week. It is not an abandoned vehicle\".",
            "My dude. Replace the car with a big ol RV",
            "And so self-unaware that they created the problem themselves.\n\nIt boggles me how people feel they get to complain about what other people do on their own private property as long as it stays within those boundaries (unlike, say, loud noise).",
            "[deleted]",
            "Now add a large colorful flag on a pole to the edge of your hedge.  You know, for decoration.",
            "You just reminded me of when I got a notice in the mail from our city to remove the junk vehicle from our yard....\n\nIt was my vehicle. That was my car. That I drove. Almost every day. It was a 1989 Nissan Sentra.\n\nI had to start parking it in different spots so theyd know it moved.\n\nJerks. Makin my poor old man out to be a junker. \n\n\n....to be fair it did end up being scrapped like 4 months later when the transmission kicked the bucket. During rush hour. 60mi from home. Between exits that are about 16mi apart on the interstate that is so lovingly nicknamed the \"Corridor of Death\". In a construction zone. \n\nA very nice construction worker helped me get it off the highway and saw me cry while I waited for my mom. Ahhh, Old Red. Such a fucking nightmare of a car. I loved him so. RIP(ieces), man. Best $500 I ever spent.",
            "Them having temporary victory is the best and makes the revenge so much sweeter when it all comes crashing down",
            "Our neighbor reported us to the city for having ugly cars in our driveway. She was referring to a 2001 Tacoma, a 2002 Audi Allroad, and a 1970 BMW 2800cs. Granted, the BMW is in the process of being restored, so it’s not super pretty right now but it’s far less unsightly than the 1999 GMC Safari minivan she drives.",
            "The way our property was originally set up, our road/driveway to our house was right up against this very small sliver of land for about 20ft that had been split off from a field. The old coot that owned it when we bought and started having a gate built was an utter twat about everything. \n\nThere was literally nothing at the land other than trees and overgrowth. But he complained to the county about all he could, including visibility from his property being made unsafe to pull onto the road. There wasn’t a road/path/trail there. He wasted so much time of everybody, it was infuriating. \n\nHe decided to start having trees cut down, so I called the county because our area requires a fair number of really easy hoops to jump through to remove trees. He’d done none of it and ended up tied up with the red tape. Legit, you fill out forms, the county makes sure it’s not a specific type of tree and you are good. \n\nHe passed late 2019 and his kids were very easy to deal with and we were able to buy that little bit of land from the estate at a reasonable cost.",
            "As a former collector of antique military trucks, I can empathize. Current registration, insurance, and a History Vehicle tag on a 22k Lbs truck, and neighbor wanted to complain. Neighbor discovered that the town supervisor had a military jeep given a showroom grade restoration by a fellow club member....",
            "Have you considered buying an old school bus?\n\nOh, and because it's no longer used for school transportation, you would have to repaint it. How does day-glo pink sound? But only on one side of the bus ...",
            "Time to get that pontoon boat up on a trailer.",
            "I know a couple of my neighbours look down on me because my garden isn't as pristine as theirs and they're not keen on my motorcycles and cars, despite most of them being behind the 6ft high gates and only one being on the drive in front of the gates, and another on the road in front of my house (and both cars that are visible are complete, running well, in good condition, fully licenced, taxed and legal and regularly used).\n\nI acquired some land a few years ago and on it are two Unimog 404S which to many would be scrap, but to me, are just basket-cases needing careful restoration.\n\nI don't really have the space to work on them, but if I did, it would need to be the drive in front of the gates, for all the world to see.  The temptation is STRONG!",
            "At least they didn’t take it upon themselves to “trim” your bushes. I’ve got a forthysia/honeysuckle/boxwood hedge down my driveway that’s along the property line. One of the neighbors decided to cut them back, and also some small hardwoods. These plants were clearly on my land! They wanted a flatter yard, so they brought in more dirt and also redid the gutter drains. Right to the property line! I called the city, and they sent someone out while they were still grading. Inspector said it was allowable, and I’m left with this.  https://imgur.com/a/DP7SkY7",
            "That car needs headers and an Italian tune up every weekend I think.",
            "Get. Cameras. \n\n\n\nThat is all.",
            "Put Christmas lights on it and call it art.",
            "Back in about 2005 I was chatting with a friend and a friend of his who was a Vermont Sheriff. The sheriff waxes on \" best neighbors I ever had, anything I need they got my back\" \"they grow pot too, and I don't give a shit\"...\"I got teenagers ...shee...it!\"",
            "Parabolic mirrors are $20 on amazon.  Some people are determined to fight over dumb stuff",
            "They should have just put a mirror on a sign post. View problem solved",
            "Wouldn't it be weird if you had a sudden passion for fixing up old school buses...",
            "Why do people care so much about others' houses, cars, gardens and decorations?",
            "It amazes me how in sooooo many of these stories, if the neighbor had just gone and talked to the person, like a polite adult, they likely could’ve gotten so much closer to what they wanted. My mom‘s favorite saying when I was a child was “You catch more bees with honey, then with vinegar.“ and I don’t understand why more people didn’t learn this as children.",
            "We had the HOA called on us because we had our third vehicle parked on the street—fully licensed, insured and in working order.  Ridiculous!",
            "1960 Lincoln--that's roughly the same length as a small cruise ship.",
            "Wait, so where are Americans supposed to keep an unlicensed vehicle? In the UK, any unlicensed vehicle needs to be kept off the highways, which normally means on private property.",
            "That was a bit like: “Neighbour. We just dug a big moat in front of our house and now we can’t get out. So you must build a road through your front yard so that we can get in and out!”",
            "I love the malicious compliance but don't let that old Lincoln rot away by sitting! just make sure you don't do that.  \n\n\nSincerely  \nA Lincoln car fan.",
            "I don’t get why you can’t have an unlicensed vehicle parked on your property. Where are you supposed to put it?",
            "All these comments make me happy that HOA doesn't exist in my country",
            ">neighbors have no right to a \"view\" extending over someone else's property\n\nOh, man, I feel you on this one.  I put up a privacy fence and you'd think from the neighbor's response that I killed their dog.",
            "Woof, a [1960 Lincoln Continental Mk 5](https://s3.amazonaws.com/images.hagerty.com/vehicle/web/1960%20Lincoln%20Continental.jpg) from that era was a veritable land yacht. I have the [model info up for that](https://www.conceptcarz.com/s7036/lincoln-continental-mark-v.aspx) and it's ~19ft. If you look up \"[land yacht](https://en.wikipedia.org/wiki/Land_yacht_(automobile\\))\" on Wikipedia, there's literally a photo of the 1960 Lincoln continental!   \nFor comparison, a modern honda civic is 15.3ft, and a modern Ford Excursion is ~19ft.",
            ">The licence plate recently expired - and I got a letter from the county with threats of fines if it wasn't removed.\n\nIf it's parked on your driveway and not on public streets/driven, what right do they have to complain about the tags?",
            "Too bad it wasn't an extended bed, high-top, windowless cargo van...",
            "\\**chef's kiss*\\*",
            "Picky picky SOBS  they be",
            "Do I sense that you could really use more trees and shrubs along that whole border? ;D",
            "If I were you I wouldn't drive it till next year. Moving into a new spot can be hard on a Lincoln.",
            "People hate those Lincolns but I love that year I feel like it's the most over the top American car from the Era I can think of",
            "OMG a 1960 Lincoln????? You won't be single for long",
            "Buy a Harley Davidson with short pipes , neighbors will love you 😂",
            "Buy a shitty cargo trailer for $500 and park it there instead. Way cheaper to insure for the year, particularly if you just get storage insurance and never intend to take it on the roadway. Also, 9 feet tall as a bonus",
            "Now you really need a nice big holiday trailer...you could even rent the spot out  n get some cash tas boot!!!",
            "Lol, don't screw with the locals.  That is the #1 rule.  \n\nWhat kind of Lincoln?  Continental I'm guessing.",
            "You should drive your old car at least once every couple of weeks just to keep it running.",
            "Jeeze, when people don't have problems they find problems",
            "Sounds like you lived next to Karen-like people. You located the nesting ground.\n\nThis almost happened to me until I accidentally complained about seeing neighbors ignoring certain things in the HOA rules. Guess who was also ignoring those things. Hard to complain on your neighbor for a mild annoyance when you're also violating HOA rules.",
            "I don't understand why you would get fees for having a vehicle parked on your property. Maybe it's a collectible. Maybe you have no reason to drive it this year. What's the logic in charging fees for a vehicle that isn't touching public roadways?",
            "The neighbors can screw off in this instance. They could have just asked you to move the car and there would probably be no issues…",
            "Your neighbors are idiots. The last people you want to piss off are full timers. Good for you for handling it like a boss.",
            "Shitty neighbors notwithstanding, I'm mildly surprised that your hedge blocking the view of oncoming traffic isn't an issue for the city. It is totally a safety issue. Backing out blind is dangerous AF.",
            "Hang on two statements here... A it was parked on your property and the county was threading legal action.... in Scotland they would have swiftly got to f@ck off, it’s private property and mind yer own business. But in America the land of the free the county can impinge on what’s on your property 😮 what dah fudge?!",
            "Neither of you sound very neighborly.",
            "It has to be licensed even if it never leaves your property?",
            "Sounds like you need to buy an RV or travel trailer.",
            "Them having temporary victory is the best and makes the revenge so much sweeter when it all comes crashing down",
            "So you're gonna mention a 1960 Lincoln and not provide photos? :P",
            "i bet you are a great lay.... Because when you fuck someone, you really really fuck them. Like they just going to talk about you for the season bro.\n\nHere's my updoot",
            "👍",
            "More trashy then malicious compliance.",
            ">until I moved my second vehicle\n\nThis is not compliance.\n\nNobody asked you to do that.\n\nThis is just you pissing off your neighbors and wanting to gloat on the internet.",
            "I'm in the UK, and we have a thing called SORN \\[Statutory Off Road Notification\\] which is great - it means you can stop paying insurance and road tax if the vehicle is on your private property and it is completely legal. Anyway good job OP. \\[edit: spelling\\]",
            "[deleted]",
            "Have your land surveyed and marked, get a 1,000 ft nylon roll and tie off between the outer stakes, then go along the nylon on your side and nail broken or cut(45 degrees) tree limbs into the ground every 6 inches the whole way. Or put up a 5ft fence at the end of your hedges",
            "Nope, you are just a dick.",
            "That’s a long story just to say *I’m that neighbor that’s gets my enjoyment fucking with my neighbors*. Just cut the stupid hedges so your neighbors aren’t taking their lives in their hands pulling out blind, and don’t use your driveway as an auto dump and y’all would’ve been friends. No, instead, your solution is to make the neighborhood look like white trash with a shitty, 50 yo land yacht. Brilliant. What a wonderful neighbor. If you don’t believe them that they can’t see, you could’ve just parked in their driveway and backed out yourself.",
            "Sounds like you’re the problem.",
            "So...you refused to just trim back a bush that blocked your neighbors view entering the road and let a junked car sit around for over a year?  And you think THEY'RE the jerks?",
            "I’m with the neighbors. I didn’t spend hundreds of thousands to look at you beat ass truck.",
            "Or, OR, you could try and be a considerate neighbor?",
            "Their house might catch fire by accident with that neighbourly attitude.",
            "Wow typical first world problems.",
            "[deleted]",
            "*Slow clapping while nodding repeatedly*\n\nExcellent MC!",
            "Is it a suicide? Or is it before they came out? I can't remember what year they introduced suicide doors......",
            "Used sparingly,  mothers milk.  Millions of Aussies raised on the stuff.\nSlathered on after a night in the turps, it is the ultimate hangover cure.",
            "Seems bizarre to me that the state does not require road visibility"
        ]
    },
    {
        "post_id": "6pyg3m",
        "author": "None",
        "title": "It's against company policy to deliver packages to an asshole.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/6pyg3m/its_against_company_policy_to_deliver_packages_to/",
        "score": 13971,
        "num_comments": 273,
        "created_utc": 1501184407.0,
        "selftext": "This little gem came not from me, but from an older guy I worked with over last winter break. We’ll call him Jeff for simplicity’s sake. Jeff was a delivery guy for a certain XYZ delivery company, and my job was as a holiday helper. (Basically I assisted in delivering the influx of holiday packages.)\n\nA couple days into my temporary job, we stop at a house with a pretty long, steep driveway. I do my thing and step out of the truck, arms out for the package, but Jeff tells me not to worry about taking it to the door. Instead we leave it at the foot of the driveway, near the mailbox. \n\nNot one to question it, I comply and leave it there. All the while Jeff has this huge shit-eating grin on his face as he blasts the truck’s horn and waits a couple moments. Then there’s movement from the house’s front door (hard to see, but I can make out this tubby, balding, 40-somethings guy with a sour look on his face step out.) \n\nWe watch the guy, who we’ll call Gabe, begin the long, arduous descent down his driveway, shuffling along at a slow pace. Jeff stays the entire time, grinning like an idiot while Gabe picks up his package, barely acknowledges us, and begins climbing back up his driveway. \n\nJeff calls out to him, “Thank you again for choosing XYZ deliveries, sir! We’re proud to ensure your packages arrive safely.” \n\nI can tell it bothers the fuck out of the guy, but he only flicks us off as he leaves. Jeff laughs, cranks up the truck, and we shove off.\n\nCompletely bewildered, I turn to him and say, “What the fuck was that about.” \n\nJeff only laughs again at this, in incredibly high spirits and launches into his explanation. \n\nApparently, the guy we just delivered to has had a history of fucking over the people he hires to do work for his home. (He’d scammed a landscaping company with claims that the grass they’d replaced half of his yard with didn’t perfectly match the shade of the other half.)\n\nAt the time Jeff got fucked over, he’d already been delivering to Gabe for years, and the guy had never been home (or had been home, but never answered the door.) Additionally, the guy’s garage was always closed, which is important because when it rains it’s company policy to leave a package just inside the garage door for safe keeping.\n\nSo one day, it’s drizzling outside and Jeff delivers a package to Gabe’s house. For whatever reason, the garage door is open this time around, so Jeff leans in and plops the package a couple feet from the cruddy weather. Then he goes about his day as normal. \n\nAbout an hour later, Jeff gets a call from his supervisor who’s in a massive frenzy. “JEFF! WHAT THE HELL DID YOU DO?! DID YOU SERIOUSLY MESS UP SOME GUY’S GARAGE! HOW IN THE HELL DO YOU EVEN DO THAT!”\n\nJeff, taken aback, does his best to get to the bottom of things with his supervisor. Apparently, Gabe had seen Jeff deliver the package to his home, seen him lean in to place the package inside, and then claimed that he’d broken the garage door. (In reality, Jeff told me Gabe’s door had most likely broken and the “cheap fuck was looking for some poor bastard to pin it on.”)\n\nFortunately, Jeff was able to escape any personal liabilities for lack of proof. However XYZ Deliveries itself couldn’t completely throw out the claim without engaging in a costly little court battle as they had indeed had a deliveryman on the premises and no proof of when the thing broke. They weighed the costs and decided on a $600 payout instead of the potential thousands it would cost in legal fees. \n\nGabe, the smug asshole, got his garage repaired for free. Luckily for Jeff, however, a small loophole in the delivery company’s policy allowed him to exact revenge. \n\nThe loophole was basically this: “In the case of delivering to locations where the delivery person feels he is at risk or in danger, he does not have to risk his personal well-being by setting foot on said location’s property. Instead said individual is allowed to drop the package off at the safest and most convenient location nearest to the individual’s property (i.e. the mailbox or foot of the driveway.)\n\nLearning this, Jeff takes full advantage. The next package Gabe orders happens to be an expensive piece of electronics and it was marked “Urgent.” Even better, it’s raining the day of delivery. Absolute downpours. \n\nJeff pulls up to your friendly, neighborhood asshole’s place and does the same thing he did with me: Blasts the horn several times and waits. Then he places the package just in front of the mailbox, under a plastic tarp (another policy in the case of rain.) \n\nApparently Gabe really needed the package, as Jeff’s horn draws him from his home and on a slow, slogging descent down his driveway. He’s fuming by the time he reaches the bottom, with Jeff smiling like a professional. \n\n“WHY THE FUCK DIDN’T YOU BRING IT UP TO MY MOTHERFUCKING HOUSE?” Gabe inquired politely as he grabbed the soggy-bottomed package.\n\n“Company policy, sir!” Jeff replied. “Can’t set foot on a customer’s property and risk further damages!” \n\nGabe’s mouth opened and closed like a fish as he tried to sort this out. He’s completely soaked now and shivering, so he just said, “Go to hell.” \n\n“Certainly, sir! What kind of shipment would you like for that?” \n\nAt a loss for words Gabe just begins slogging back up his driveway, with Jeff giving him a couple friendly honks to send him on his way. Then he continues on with his deliveries. \n\nThe entire incident took place a couple years or so before I began helping Jeff out, but to this day, he loves exacting company policy on the jackass. I felt a newfound respect for the man after that, and the rest of my time working as a delivery aid was filled with more awesome stories from Jeff, the good-humored delivery man.\n\nEdit: A couple of you wanted to hear the other stories Jeff had to tell. Well here's one of them: [Enjoy!] (https://www.reddit.com/r/MaliciousCompliance/comments/6q0e10/she_wanted_me_to_make_sure_all_our_leaves_stayed/)\n\nAnd here's [another] (https://www.reddit.com/r/MaliciousCompliance/comments/6q11cw/when_you_order_weed_illegally_via_public_shipping/)\n\nAnd the [Final Part] (https://www.reddit.com/r/MaliciousCompliance/comments/6q3ib3/i_dont_mind_what_people_stick_in_their_assholes/)",
        "permalink": "/r/MaliciousCompliance/comments/6pyg3m/its_against_company_policy_to_deliver_packages_to/",
        "comments": [
            "Isn't it funny how your co-worker starts off looking like a real jerk, but when you get the background story it all makes sense.  I love that.",
            "I hope Jeff teaches his replacement the company policy before he retires. ",
            "It's the little things that make the difference. You seem to work for a good company. ",
            "I love how his greed comes back to bite him in the ass.\n\n\"Why didn't you [do what I about sued you for last time]?\" ...Really, dude?",
            "Fuckin Gabe",
            "If reddit has taught me anything about working in a corporate setting, it's that you should read every company policy and exploit them for fun an profit to the fullest extent your imagination allows",
            "That's part about going to hell is hilarious. I may have to use that. ",
            "The best part of this is that if Gabe apologized to Jeff, even just once, for being a dick, I'd bet Jeff would stop doing this and start delivering back to his door/garage again just like before the whole incident.\n\nAll it would take is to show one bit of human decency, but that would require Gabe to admit that he is in the wrong, which apparently is too tall an order. As long as that remains the case, he deserves every bit of technically legal inconvenience that's coming to him.",
            "[deleted]",
            "I imagine Jeff Bridges doing this. ",
            ">“WHY THE FUCK DIDN’T YOU BRING IT UP TO MY MOTHERFUCKING HOUSE?” Gabe inquired politely as he grabbed the soggy-bottomed package.\n\nYou are an excellent writer. Thank you for this gem :)",
            "I had a customer like that when I still delivered mail. Lady Doctor got certified mail sent to her house fairly often, at least 1 a month or so. She almost never answered her door so I left notices for her to sign and leave in the box and I'd return with the letter the next day. Left a notice one time and she received a second certified piece the next day. I figured I'd save her the trip (she lived 2 miles from the post office at most.) and bring the letter with me from the day before. Seems the good doctor showed up to pick up the letter before I arrived at her house and wasn't very happy that I had taken it with me to deliver to her later in the day. She claimed that she had cancelled a lunch to pick this letter up and I should be properly reprimanded for a terrible decision. I took my talking to in stride and made a decision to strictly follow policy from then on. The doctor lived in a house with a windy driveway in the woods that had enough space at the end in front of a two car garage to turn a vehicle around doing a 3 point turn. Problem is, you're not supposed to back up in a postal vehicle unless it is safe to do so. Lady doctor never left room in her parking are for me to turn around so for the next 8 years any time she got anything that was too large to fit in her tiny mailbox, I left a notice and continued on my way. If she signed it I'd return the next day and leave her another notice, since it wasn't safe to turn around in her driveway. I like Jeff. ",
            "I find it kind of hard to believe that after the shit jeff put gabe through he would continue for years after getting deliveries from the same company.",
            "If it weren't for the fact that it would be textbook doxxing and would pose serious risks of criminal mischief, injury and death, it would have been glorious if reddit could ship stuff to 'Gabe' just so he'd have to go get it.  \n\nRefrigerator boxes full of nothing but packing peanuts, that sorta thing.  ",
            "Why wouldnt he just switch shipping conpanies?",
            "> “WHY THE FUCK DIDN’T YOU BRING IT UP TO MY MOTHERFUCKING HOUSE?” Gabe inquired **politely**\n\nHahaha, this had me dying",
            "I wonder if this is why I've always had problems with FedEx ever since I moved two blocks down the street.  Maybe the previous owner was a jerk to the FedEx guy.",
            "am I the only one wondering why this post is tagged NSFW though?",
            "Man my name is Gabe, every Gabe in TV/Movies is always a sniveling prick or at the very least lame as fuck. Now real assholes are given my name hypothetically?? Boy what a life ",
            "You should really consider xposting this over at r/pettyrevenge ! Love seeing posts like this ty",
            "> “Go to hell.”\n\n> “Certainly, sir! What kind of shipment would you like for that?”\n\nMy favorite part!",
            "This is the perfect story for this subreddit \nSeriously this is under appreciated 😂",
            "This is my new favorite story on Reddit. No vengeful overkill or anything. Just Jeff trying to keep from getting sued.",
            "Who the fuck leaves their garage door open?",
            "This fits better under prorevenge really",
            "Some of my best work experiences was doing holidays for UPS. Nice good work and doing it for about a month and a half leaves good money for back to school.",
            "My favorite ups delivery guy just retired and the people on his route had a party for him it was great ",
            ">“Go to hell.”\n>\n>“Certainly, sir! What kind of shipment would you like for that?”\n\nThat's an awesome comeback if i ever see one XD",
            "How is this NSFW?",
            "[deleted]",
            "Why leave packages in a garage? Who just keeps their garage open?",
            "I don't care if this is fake. I loved it",
            " >“Certainly, sir! What kind of shipment would you like for that?” \n\nI fucking lost it! That's hilarious! \n",
            "Remind me! 1 day",
            "Does \"Gabe' have a round head? ",
            "This guy sounds like a candidate for Roundup water balloons",
            "I like his style. However, I'm curious. Wouldn't it make sense for the company to decide to put a camera in every car so the delivery guy can take a picture every time he drops something off? To show there was no wrongdoing? I guess in this case he would have had to take a photo *before* putting it in the garage, but still.",
            "/r/pettyrevenge",
            "Can someone recommend authors that write like OP? My imagination is filled with visuals right now. I never get that from reading.",
            "I like the way you are writing these, reflects the people pretty well.",
            "I was too a holiday helper for XYZ. Best temp gig I ever had. Driver was a great guy. If any of you fellow Redditors need some extra cash during the holidays, and don't mind a long, physically demanding day, check it out. The uniform is easy too, one color, matches the truck. :)",
            "Never mess with your *mailman*",
            ":(",
            "What can ~~brown~~ Jeff do for you?  \n  \nThese stories are pretty damn funny, OP, sounds like you had a lot more fun than I did with my driver last winter (although he was also really chill and I liked him for that). Do you have any more, by chance?",
            "Sometimes you aren't sure this will be worth the long read but I'm glad I stuck it out.",
            "Wow! Jeff is sure a character I would like to meet personally. Keep those stories coming, I am sure there are many more! Thank you for sharing.",
            "I worked as a mailman after I graduated and this is common. Some people just have this hate on service people, especially old folks. Good on your coworker, makes me wish I could've gotten revenge on some of my asshole customers!",
            "I imagined this with everybody having British accents.",
            "As a former delivery driver, reading this makes me happy",
            "Treat the service class people around you well, it pays off in all kinds of unexpected ways. ",
            "Do y'all not just put boxes in a plastic bag when it rains? All the delivery companies here do to avoid the box getting wet in the first place. ",
            "The only thing I don't understand is the company policy of staying with the package.... what if he wasn't home? Why doesn't this guy just say fuck it and get the package later...?",
            "I'm getting such a kick out of reading your stories! At first I thought Jeff was an asshole. Now he's king! Thanks for sharing!",
            "> with Jeff smiling like a professional.\n\n:D I actually was able to imagine this smile in my head.\n\n> “WHY THE FUCK DIDN’T YOU BRING IT UP TO MY MOTHERFUCKING HOUSE?” Gabe inquired politely as he grabbed the soggy-bottomed package.\n\nHaha, the polite inquiry in its best.",
            "I loved this story, dude!! You've got a way with words and you're entertaining af! Jeff sounds like a real stand-up guy, and so do you.\n\n👍👍👍  \n\nCongratulations, you've made it to [my Top 10 List](https://www.reddit.com/r/lists/comments/6skuwd/swimmingjohns_top_100_maliciouscompliance_stories/).",
            "Why wouldn't the asshole find a different delivery company to use?",
            "This is ups isn't it",
            "Validated.",
            "tl;dr?  ",
            "Honestly you all seem like petty people. I can't wait for self driving cars."
        ]
    },
    {
        "post_id": "6eosz3",
        "author": "windrage2738381",
        "title": "Coffee shop compliance",
        "url": "https://i.redd.it/zfwt0aiax21z.jpg",
        "score": 13947,
        "num_comments": 78,
        "created_utc": 1496342603.0,
        "selftext": "",
        "permalink": "/r/MaliciousCompliance/comments/6eosz3/coffee_shop_compliance/",
        "comments": [
            "But they only drew it.\n",
            "Ceci n'est pas une signe",
            "I would totally go into that coffee shop.",
            "/r/NotMyJob ",
            "Needs more covfefe",
            "It opened up my eyes.",
            "mildly disappointed it isn't recursive",
            "Was expecting some covfefe",
            "This reminds me of the writing style Bill Watterson used in Calvin and Hobbes to narrate Calvin's school bully. I can't remember that kid's name though...",
            "If they only drew it",
            "Anymore one needs a college degree in the art of drawing pictures just to qualify for a crass corporate coffee cup filling position. It's a good things our universities have complied with this demand and produced a generation of graduates with both education enough to sell caffeine fiends their fix and at the same time talent enough to entertain the frazzled ego of the harried commuter class as they shell out for their expensive hot water mix. ",
            "This isn't really malicious compliance, just literal compliance.",
            "He probably made the sign he drew a sign on",
            "Meh.   \n\nStuff like this, where someone is being cute with a sign on purpose, should be 'retired'. Also, things where a computer is performing as designed does not count. ",
            "Fucking millennials.  This is why robots are able to take your jobs. "
        ]
    },
    {
        "post_id": "ihhf62",
        "author": "Shaagriel",
        "title": "No Outside Drinks in the Cinema",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ihhf62/no_outside_drinks_in_the_cinema/",
        "score": 13936,
        "num_comments": 581,
        "created_utc": 1598517563.0,
        "selftext": "I worked a month at a cinema and here's a story of malicious compliance by a customer. Please let me know if this isn't allowed and I'll delete it. \n\nThe cinema I worked at had a no outside food and drinks allowed in the theater rule. This was to boost sales of the food and drinks sold in the cinema. We (the workers) would usually let people in anyway if they brought snacks or whatnot as the snacks and drinks inside were ridiculously priced and the manager was cool as well. \n\nThe only time this rule was actually strictly enforced was when the general manager (GM) made his rounds fortnightly. In this case there was a store room where we would keep the customers stuff and give it back when they left. \n\nThis one time a guy around late teens comes in with his kid brother with a 2L bottle of coke in his hand. The GM was unfortunately there that day and was staring right at me so I had to ask the guys to leave it behind. They said ok. \n\nCue malicious compliance, the rules stated that outside food and drinks couldn't be taken into the theater where the movie played, not the facility itself. Dude comes out with his brother in 15 minutes and asks for the drink, I take it out, they each take a sip, give it back, and go back inside. They did this every 10 - 15 minutes and disturbed the other patrons and interrupted my work (I was happy to comply) and after they did this about 4 - 5 times the GM told me to just give em the bottle when they came out next and I DID!\n\nHonestly one of my favourite moments of working there.",
        "permalink": "/r/MaliciousCompliance/comments/ihhf62/no_outside_drinks_in_the_cinema/",
        "comments": [
            "Everyone knows about the rules against bringing in your own food, why wouldn't you just put it in a bag? They're hardly going to frisk you",
            "I was stopped from bringing in an icecream once, had to sit outside the entrance and tried to wolf it down. Cue brain freeze, and then frustration when 2 min later they let someone in with an even bigger icecream. \nYeah, I wasnt particularly pleased about that.",
            "Who brings a 2-liter to the movies?  Might as well order Domino’s.",
            "Last year my wife and I went to Costco next to a movie theater.  She bought a coke and hid it in her jacket to sneak it in.   She said she’d tell them it was an insulin pump.\nI told her it’s more like a cola-ostomy bag.\nI got the strangest look from her.",
            "I had a friend whose parents owned a bunch of theaters. He told me that the amount of money the theater made was related to how long a given movie had been out. On opening night for a big movie, they might be able to keep only 1/10 of the ticket sales.  The only way for them to make it worth while to keep open was to charge a lot for the food and drinks- they kept all profit from those. Even so, the family struggled and eventually decided to just sell out to a big chain group.",
            "Well done. A pretty clear MC by the customer and smart too.",
            "I wonder where they sat in order to do this.  And hopefully they weren't seeing this movie for the first time.",
            "A+ job causally dropping ‘fortnightly’ in there, Shakespeare",
            "I just want someone to love me the way they love that bottle of coke",
            "I am sorry, but I think it's fair to not let poeple bring their own food inside the cinema. I know it's expensive and all and that sucks very hard.I have been working at a small local cinema for the past 2 years and the shit people bring in is always way too sticky or very hard to clean in general. The stuff we sell is not, even the sweet popcorn is doable. The sweet popcorn from the store is way too sticky and big for our vacuum cleaners.And with only popcorn, crisps, M&M's and Skittles you won't get a huge mess like macaroons smeared out all over the carpet and chairs, or tapas, or a 2 litre cola bottle. Imagine it falling over and a bit less than 2 litres of cola runs through the theatre hall.\n\nThe only way our cinema is still standing is because we sell drinks and sweets. If a cinema ticket is 10 euro's and it is a Disney film, we have to give Disney 50% or more. so you still have 5 euro's left, than the cinema has to pay for water, electricity, internet, maybe rent for the building or beamers. Maybe some other licences. AND THAN the cinema needs to pay it's workers.\n\nJust think about that the next time you visit a cinema or a small local bussiness.\n\nI always say: I know it sucks, and I am very sorry. I know we ask a lot for our snacks and drinks, but when you go out to eat you don't bring your own 5 euro steak from the supermarket, right?  \n\n\nBut nice way to annoy your GM! Hahaha",
            "I don't know, if I was in the theatre with them I'd definitely have preferred you to throw it out instead, so I don't have to deal with them getting up so many times. Not sure why they can't just sneak in a smaller sized drink like the rest of us. If you walk into a theatre with a 2l bottle, you deserve to get it confiscated.",
            "In high school I worked at a movie theater. Similar rules, no entry with outside food or drinks. If the patrons were nice and polite we let them sneak stuff in. If they were rude we'd confiscate and \"throw away\" their food. We had two separate trash cans for it, one for food and drink that was opened and another one that we kept very, very clean for the closed stuff because we'd pick through the closed stuff and divide it up among the staff.",
            "In my country it is illegal to only allow food bought inside for some years now. The practice is called a “married purchase” because if you want to eat while inside you HAVE to buy the cinema’s food. It’s pretty awesome. We often buy large pizzas, hamburgers and whatnot. Much better than popcorn if you ask me",
            "I also worked at a theater when things were still open, and I was happy to let people bring in anything from outside, but what got on my nerves was when they would leave the trash of it behind. It’s already annoying to clean up trash people leave, but I expect popcorn bags and such, it just feels like they’re rubbing it in our faces that they brought in food. That and everyone became super up tight and tense anytime they saw an employee. I have told a group of people that I didn’t care they had outside food, but they should really learn how to “play it cool”",
            "also kudos for agreeing that food and drink prices inside cinemas are bullshit. eat the rich",
            "My favorite experience was when my then-girlfriend (now wife) and I went to see the 3D re-release of The Phantom Menace. We went to CVS to pick up a few things before the show (cards, deodorant, etc) and got a 2L of Coke Zero to share during the film. The guy working the theater queue said he had to check our bag, and he looked directly at the soda and didn't even say a word",
            "I would be far less tempted to bring in food/drinks if they had a decent food menu.",
            "Am I the only one who is jealous that op was able to work fortnightly into the story.  It a cool word that I have no concept of the time it represents.",
            "I had a jacket in college that I could carry 13 bottles of beer into the theatre in.  Worked great. Accidentally kicking the empties over and listening to them till all the way to the front was not great. Thank god none broke.",
            "Obligatory Steven Wright reference:\n\n*I got thrown out of the theater for bringing in my own food.  I argued that the concession prices were outrageous.*\n\n\n*Besides, I hadn't had a barbeque in a long time.*",
            "I'm all for sneaking in snacks, but a 2L drink...is awesome.",
            ">\t We (the workers) would usually let people in anyway if they brought snacks or whatnot as the snacks and drinks inside were ridiculously priced and the manager was cool as well.\n\nVast majority of the ticket money goes to the studio that paid $100,000,000 (or whatever the cost) to make the movie.   The theaters make much less on ticket sales, and rely on overpriced food and drinks to pay for the building, the employees, etc.",
            "Did this really work well for them though when they end up missing so much of the movie?",
            "Just sneak the food/drinks in like everyone else haha",
            "I went to one of those dine in theaters once because I won a free ticket from an event at my college. I looked at the menu, saw the prices, and decided just to get a water since it was kind of a long walk from my dorm. The girl brings me the water, waits for me to take a sip, and then says \"oh by the way if you don't order anything else we have to charge you $3.50 for that.\" Then left. Needless to say I never went back.",
            "fortnightly.  Thanks for the new word.  I will try and remember and use!!",
            "Paid $20 for four bottles of water once. Yeah, the movie theatres can SUCK MY FUCKING COCK!",
            "Tote bags are the real winner for movie going. I usually bring my kids and my husband sandwiches and tons of candy but I do purchase the popcorn bc like... I can’t make that kid of popcorn at home.",
            "We are always kind and considerate enough to hide our outside food and drinks from cinema staff when entering the facilities.  :)",
            "I used to work at a movie theater in college and once this guy came in holding a giant box of whoppers (malted milk balls). It was at least a foot tall in a carton  shape like milk would be. I told him he couldn’t bring it in, but said I couldn’t “see” him bring it in. *wink*. He went outside the doors (glass), opened the box, and started to pour them into his pockets!!! He filled both pockets up and they were bulging!! \n\nI just thought he would shove them in his back pocket and cover it with his shirt, not fill up his pockets! \n\nI didn’t mention that I saw him and the whoppers spilling out if his pockets and just let him through.\n\nEdit: spelling",
            "The cinema near me actually employed a security guard to check people for food.\n\nI used to walk in with my snacks on display, maybe buy one of the slushies the cinema sold because they are awesome.\n\nI got stopped by the manager backed by the security guard who was shaking his head.\n\nI said to the manager \"is this the hill you want to die on?\" He said that the policy was absolute (it wasn't company policy)\n\nI started walking around documenting all the food hygiene regulations they were breaking while loudly declaring them \"hmmm that cheese sauce is being held warm, do you keep a record of its temperature? No? Tut tut\" and \"why isn't this employee wearing a hat while preparing those hotdogs? And while we're discussing hotdogs, where is your temperature probe to ensure that the reheated food has reached the required minimum temperature?\"\n\nYou see, I used to work as a food safety auditor for a company that the security guard worked for as a cook... \n\nAnyway, I take whatever I want in there now and the cinema food is now safe and they have the proper temperature probes for hotdogs.",
            "Sneaking in snacks is part of going to the movies for me but only if I'm not going to an Alamo Drafthouse. I'll still buy popcorn but like bringing in Jerky and off brand dollar store candy is part of the fun.",
            "what was your spaghetti policy?",
            "Blessed were the days of being a late-90s rave kid with giant pants and numerous big pockets",
            "The movie theater i went to let me bring in my KFC as long a I bought a soda.",
            "I spent a year working at a theatre, I don't know about yours but where I worked, the company made nothing off ticket sales, all the money comes from ad revenue for the ads played before the movies and from concession sales which is why there was no outside food and drink.\n\nI only ever enforced the rule if there wasn't a huge line which would make the conversation waste everyone's time and if it was blatantly obvious they were smuggling something in.",
            "Move theater around here did not like me bringing in food either.  I mean, jeez - it's just a hibachi!",
            "I remember as a kid being told you weren't allowed to bring your own food or drink in (I just hid it) but as an adult, I've actually checked and it's not against the rules. (UK)",
            "Some friends and I brought sub sandwiches to our local theater once, the ticket taker said we can be in the hall with them but not the theater. So we stood outside the entrance until he looked away and went in. One of those not my problem employees lol",
            "In the UK cold drinks and snacks are usually allowed, just don't take the piss. Before we closed, we had s customer come in every few weeks and drop spaghetti Bolognese all over the floor at the back of an auditorium. Never found out who it was.",
            "Yeah, those food prices are nuts.\n\nBut, you realize that the movie itself doesn't pay to keep the theater in operation, right?\n\nThe concessions do.\n\nhttps://entertainment.howstuffworks.com/movie-distribution2.htm\n\nSo, no concessions, no movie theater. The more you gave away, the more prices had to be raised to compensate, but hey, you didn't care because Fuck the Man, right?\n\nThe General Manager, the one tasked with keeping the business running, and whose salary most likely supports a family, that person's job is dependent on following procedure and ensuring profitability, but fuck that person, right? Why do what they say when you have a different opinion?\n\nYou didn't think it was fair so you said fuck it.\n\n\"The people who brought in food wouldn't have bought the food anyway,\" you retort.\n\nNot your decision to make.\n\n\"It didn't hurt anyone.\"\n\nYou don't know that and it's not your decision to make.\n\n\"The food is overpriced and the management is gouging the customer.\"\n\nOverpriced compared to what you can buy in a grocery store, a purpose-built entity designed to SELL FOOD, not compared to movie theaters where it's the only way to stay in business and once again, not your decision to make.\n\nI have to be honest, I am blown away that this isn't clear to you. How do you not see that when you are hired, you do the job you're hired to do because you don't have a fucking clue how profitability works, what your specific financial contribution to the organization is, or how literally ANY of the rules work together to keep things running.\n\nSo in your zeal to show how unfair things were, you sabotaged the very thing that keeps a movie theater profitable and teenagers like you employed.\n\nWell done.",
            "Sounds pretty wholesome.",
            "I was told I couldn’t bring a hot coffee in with me on a very cold day. I had to drink it outside. Apparently I wasn’t the only one who complained because they started offering hot coffee soon after. For the record, I bought popcorn from them.",
            "general manager comes to the site once every 2 weeks? what the hell",
            "Don’t they restrict outside food because if you get food poisoning or if anything bad happened with the food they’re liable",
            "I remember the one time my grandma took me to the movies as a child (very much Not Her Thing).  She didn’t want me drinking sodas, so she popped a mason jar of orange juice in her purse-her very large, with room to spare, granny purse. 😋",
            "My friends an I, when we were in high school, went to see a movie (I don't remember what it was anymore, but that doesn't matter) and so we bought 2 2-liters and made a shit-ton of popcorn, which was put into gallon bags.  Then 2 of my friends wore trench coats with long pockets and one put both 2 liters and red solo cups in his coat, and the other put the gallon bags of popcorn in the other pockets.\n\nWhen we were giving our tickets to the lady at the entrance, my friend with the soda leaned forward to hand his ticket and one of the 2-liters tipped and fell out of his pocket.  Without missing a beat he just looked her straight in the eyes, put a finger to his lips and loudly went \"shhhhhhhh\" as he slowly picked the 2-liter back up and put in his pocket. \n\nShe started struggling to container her laughter so hard that the rest of us had to tear our own ticket stubs and walk in.",
            "A good friend of mine was a theatre manager for 20+ years; I asked him what the deal was with the outrageously priced concessions. (My wife and I had just had a theatre manager try to bar us from our movie because we brought in half-finished lattes, and weren't going to just dump out $4 drinks. We eventually persuaded her it wasn't worth her while to call security on a middle aged couple.)\n\nHe agreed that the prices were outrageous, but explained theatre finances. When the studios released a new movie, the theatre showing it would only get 10% of the profits the first week. Second week was 20%, third week was 30%, up to 50% for a long-running movie. With multiplexes, the number of movies which run for more than a few weeks is pretty small, so the theatre is making very little of the box office profit. So to stay solvent, they HAVE to recoup it at the concession stand.",
            "Kids were boozing",
            "This is why I used to prefer going to the theater in my local mall. They knew you were coming from shopping and didn't bother bugging you about carrying bags in. And the theater was right off the food court so inevitably everyone in the theater would be eating something from one of the various food places and not the overpriced hotdogs from the theater itself.",
            "Lame, I snuck in a 6 pack of PBR in to a theater when I was 14 for the lord of the rings two towers release.",
            "In his youth my husband used to slide an entire baguette loaf up his jacket sleeve to munch on through a movie 😂",
            "The best way to sneak food/candy in is go in the winter, so you can wear a puffy winter jacket, preferably with deep interior pockets. Its also good to put the candy in ziplock bags 1. so you can distribute the mass and make it less visible and 2. so you dont have any obvious right angles. It’s also a good idea to carry something that’s allowed, so if they ask what you have, you pull out your phone or something",
            "Laughs in [scottevest](https://www.scottevest.com/shop/mens-vests/mens-travel-vest/quest-vest-men.shtml)\n\nFind ally hidden candy in these 42 pockets!!!",
            "I remember one concert , early 2000s all the girls snuck it liter bottles of booze in various ways. Girl I was dating at the time wore a pull over windbreaker with a front zippered kangaroo pouch type pocket. Put a bottle of Captain Morgan in there, then she tied it around her. Easy Peasy, needless to say that was the last time I had Captain Morgan. Don’t need to see my insides like that again.",
            "Hate this rule. I don't like the food that the cinema serves. They also had a poor hygene rating.",
            "Awesome story, I would not miss bits of the movie for that reason though. \n\nI love taking beers into the cinema, where I live this is obviously a massive no-no but I have never had any dramas getting a 6 pack in. The after movie pee is a killer though.",
            "Do you not understand the business model of your employer?  High prices for concessions are part of the way the theater can afford to employ the jerks who don't enforce their policies.  By letting customer bring in outside food and drink, You were stealing the same as if you were taking bills out of the register or giving away product.",
            "We take dinner to the movies, but we always buy popcorn too because we do want to throw the cinema a little bit of cash. And before anyone asks, my wife smuggles in subs and sodas in a large purse. I miss going to the movies.",
            "I hate to point this out....but you know most of the money that the theater makes comes from concessions right? that's basically where your paycheck comes from.",
            "Indian theatres suck, workers are inhuman, everything insanely expensive and just bad experiences mostly",
            "That's fucked up. Where I live this practice is strictly forbidden because you can not be forced to buy another product (not having a choice to buy food/drinks form other place) because you've bought something there (the movie tickets). It called \"coupled sale\".",
            "The theater by my house is pretty chill with this sort of thing. My family and I once brought a pizza in lol.",
            "2 litres of a diaretic drink - he'd be pissing like a rhino!",
            "My [Scottevest](https://www.scottevest.com/) has lots of pockets. I can fit nearly anything in there.",
            "Reminds me of those “one per person per visit” coupons. Sometimes a manager will tell their employees that they can only accept one coupon.  I go in with my family - one per person should be 4, per visit means no more than that. When they try to only accept one, I ask them how long I need to stand outside before coming back in to make it another visit. They usually sigh and at least let me break up the order in to separate ones.",
            "I worked in a movie theater and I didn’t stop a guy who came in with a full pizza box. Wasn’t feeling it that day",
            "Reminds me of two different times for me.  One where i let food in and then one where i didnt.  I was on podium during a sat night.  7:00 rush in full swing and i got a sizeable line waiting to get their tickets checked.  Then all of a suddenly i hear a thunk at the back of the line.  A guy trying to smuggle a large bag of Wendy's under his coat fell onto the ground.  I just lean over and shake my head.  He got the point of i know and wont let him take it in.\n\nThe other time bit me in the ass.  It was early in the day so we were super slow, i think during the weekday.  Well one thing parents like to do is just drop their lovely little ones off and they now have a few hours childless. Well these two kids come in get tickets then run off since their movie isnt ready to start yet.  10 minutes later they come running back in clearly carrying a bunch of candy from the 5-below down the street. \"Ah theyre just kids let them have it.\". Hours pass and my rotation of podium is over and i go to clean the theater the kids were in.  Nerds. Fucking. Everywhere.  Looked like the little bastards just threw the candy everywhere.  Spent a good 15 min trying to get the little candy up.  Ended up just sweeping a lot of it to the lower section under the seats.",
            "We smuggled some cooldrink bottles and candies into a movie once. :) Of xourse all crinkly paper etc was removed and the candies was in small tupperware containers. :)",
            "I used to test the movie theater near my house to see what kind of ridiculous shit they would let me in with, one time I got in with a FULL meal from firehouse subs, and another time I walked in with the largest bag of cotton candy I've ever had in my life.",
            "We had a local cinema who had no problem with allowing food in. Chinese. Pizza. Hot Chocolate. \n\nAlso if you are challenged at the door just explain you have allergies and all the food you are bringing in is FREE FROM.",
            "I remember sitting in the theatre over 25 years ago and this family brought in a KFC family meal, complete with bucket of chicken, sides, drinks and I think they even had that McCain’s deep and delicious cake they would give too. I swear that boosted food sales though, because the whole theatre smelled like it and made us all hungry. Mid way through the movie some dude shouted “pass me a drumstick!”",
            "Long ago, in the before times, I was a hapless high schooler. \n\nAnd, for some class or another, we had to write to a local official about something in our town. Naturally, I wrote about the biggest deal back then; the movie theater that had just been opened, after a year or so of construction, back when I was in middle school. \n\nThe mayor wrote back, and included two free tickets to the theater. Which, as a brainless high schooler, meant I thought my letter had been so awesome that it made him send his secretary out to get them for me (and wasn’t until many moons later that I realized he likely had a giant stack of the things that he put in everyone’s reply letters). \n\nIt wasn’t until after I’d used up those tickets that I realized he’d included even more valuable knowledge inside the reply letter itself. \n\nWhen getting the theater built in our town, he’d included a rider which stated that, for the first ten years of operation, outside food and drinks were allowed (as long as they weren’t sold by the theater). \n\n\nAnd so, blatantly armed with this letter’s information and the brashness of teenagerhood, I bought a foot long subway sandwich, and marched through the doors with it. \n\nNo one stopped me. No one stared. No one said ‘boo’. \n\nMwa-ha-ha-hah! Ultimate power was mine!\n\nSo that became my routine. Buy a huge subway sandwich... or some Taco Bell... or in-n-out double-double... And then go enjoy a day at the theater. (Yes ‘a day’. I was young, dumb, and broke. Nowadays I’m totally *not* encouraging you crazy kids to theater hop and see three or four movies in a row, once restrictions have been lifted in your area, *wink wink*)\n\nLife was good. Life was sweet. All throughout high school, and early college, I enjoyed my outings to the movies. Being a bit of a jerk, whenever my friends were amazed at how I got away with *blatantly* marching my subs past the line, while they got stopped for trying to smuggle in a coke can in their cargo pants pockets, I’d just smirk at tell them it was because of how awesome I was. (It was my secret knowledge, dagnabbit!)\n\nBut, alas, all good things must come to an end. Nearing the end of my college daze, I came down on a random weekend, and... *SHOCK! GASP! SURPRISE!* ...I was stopped at the door by the pimply-faced teen, declaring ‘no outside food, sir’. \n\nI attempted to assert my dominance, pulling on my inner Karen, demanding to know just when, exactly, this so-called rule was put in place. He called over his manager, and she told me it had always been the rule, and pointed to a (suspiciously new-looking) decal on the front door. \n\nDefeated (there was a sign, people! A *SIGN*!), marched back to my car to dispose of the illegal food... nah, just kidding. I broke it down into two six-inch subs, and hid each one in the lower-calf pockets of my cargo pants (as was the style at the time). \n\nBut, later, raging at the injustice of them changing their policy, driving away a loyal customer of these past ten year... Wait...\n\nI suddenly realized... it had been ten years since that theater had opened. And the mayor had only negotiated the policy to last for... right, ten years. Have a cookie. \n\nThere was likely some manager there, with a countdown calendar, just waiting for the day she could slap that little decal on the door, and dash out hopes and dreams to shreds. Well, that, or it popped up on some corporate lawyer’s To-Do list, and a letter got sent out, and nobody really cared but me. But still... the Injustice!",
            "I think the most brazen I ever got in a theater was bringing in Chinese food. I still laugh every time I think about my friend eating white rice with chopsticks while the older couple next to us side eyed him disapprovingly. I don't even recall what movie we saw.",
            "I mean, ive snuck a beer or too in my sweater.",
            "They're so chill here, we bring in full teriyaki meals and a 6 pack of bottled sodas",
            "This is why you take a purse and just stuff it full of food and drinks. I have a relative who used to get burritos from Chipotle, stash them in her huge purse, and take them in with her and her husband in the theater.",
            "Some businesses are very shortsighted and try to hold so closely to the technicalities of a rule that they make things worse for themselves. I visited a mall theater once and asked for a cup for water. I had to take medicine and there were no fountains inside the theater. They were going to have me pay a full drink price for the empty cup so I could get the free tap water because they said too many people tried to steal drinks from the soda fountain. Ironically, you could bring in your own empty cup from the food court just outside the theater. Apparently, no one would ever think to fill their empty food court cup...",
            "I worked at a movie theater once and I told a group of teenagers they could not bring their LARGE pizza in to the theater. (My manager was standing behind me) These guys walked outside and came back in 5 mins later with no apparent pizza in hand. After their movie I went to clean their seats and low n behold, 1 14” pizza box on the seats. They didn’t walk through any exit or emergency exit and I was watchjng the only entrance to the theater. To this day I don’t know how they did it but I applaud the effort.",
            "The cinema nearest to me does not care. Over the summer, they don't get many patrons. There was one summer where there were routinely only 3 or 4 of us at the screening. One guy always brought in a chicken fillet roll (a big crunchy chicken tender sandwich).",
            "I'm going to a cinema on Monday to celebrate my birthday\n(they're re-opening just in time, with distancing of course)\n\nI allways buy snacks elswhere and just keep them in a bag when I come in\n\nThey can't search us unless they think we've stolen something so I always get away with it 😂😂",
            "As a former cinema employee myself my understanding of the no outside food or beverage is entirely due to healthcode regulations. Not just ä means of boosting sales. But that’s probably due to my cinema having had ä restaurant inside of it which drastically changes the health laws",
            "[https://www.youtube.com/watch?v=05OCOa1Oj7U](https://www.youtube.com/watch?v=05OCOa1Oj7U)",
            "On the west coast a lot of theaters search bags and purses now but so far not pants.",
            "Each time I've walked into a movie theatre with drinks and food, nobody ever stops me.  I always walk with confidence in such cases, like I'm supposed to be doing that.  People seem less likely to question you when you waltz in with confidence.\n\nHey, maybe I've just been lucky, or we have a slightly different set of policies here in Ontario (Canada) or whatever",
            "I’m so notorious at the dollar store near my movie theater the clerk while ringing up my truck load of candy, “Going to the movies I see. What’s playing?”",
            "I used to hide 3 or 4 beers in the hood part of my hoodie in HS. Along with a few more in the pockets. Good times.",
            "If I take outside food or drink into a theatre, I just bring my backpack. Never had anyone ask to look inside lol, jokes on them",
            "this made me giggle",
            "Many, many years of bucking this system as a poor student now a frugal father. The worst is bring a bottle, drinking it, putting it on the floor, then oops, accidentally knocking it over and it rollllllssss  all the way to the front row. I remember going to a movie with my brother-in-law with long John silvers fish fillets in his pockets.",
            "Yeah when I worked in a cinema we used the “if we can see it” rule. That’s what our manager said, if you can see outside food/food bags, tell them to trash it. We didn’t hold stuff for any kind ever. No space for it. We also had a no back packs rule but anything goes with a purse\n\nOne day a couple came in and her rather large purse reeked of KFC. I could smell the chicken, the biscuits etc. but I couldn’t see it so",
            "My hubby and I cheat, I have a rollator (walker with wheels that also has a fabric basket for keeping my shit) so we will go somewhere and buy food and drinks and pile it up in my basket where they can't see it and my purse will look empty. Lol. Works fantastic with Krystal's.",
            "While in college, the theater just off campus had the old ramped seating, where the floor is sloped down. Not that fangled \"stadium seating\". We snuck in bottles of beer. One of the more clumsy friends kicked over one of his empties and you could hear it roll all the way down to the front. And it wasn't a fast roll. Took a good 30sec to get to the front. Luckily it didn't pick up too much speed and didn't shattee. We thought we were definitely going to get kicked out. But no one came..."
        ]
    },
    {
        "post_id": "bxd95a",
        "author": "sjogga90",
        "title": "Want me to turn on cartoon gore for your kids? Are you sure?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bxd95a/want_me_to_turn_on_cartoon_gore_for_your_kids_are/",
        "score": 13922,
        "num_comments": 615,
        "created_utc": 1559801255.0,
        "selftext": "My brother and I aren't on the best of terms. I envy people with good relations to their siblings, because being around my brother is just draining. He seems to follow two very strict rules. The first is that he's always right, even when evidence is presented against him. I swear the guy has developed immunity towards logic and reason. The second rule he follows is that I'm always wrong. Whatever I say, he has to argue against. It's obnoxious. Luckily we no longer live in the same contry, so we see eachother at most two times a year which is barely tollerable.  \n\nThis story takes place in december last year. I had traveled to my parents to celebrate christmas, and so had my brother, his wife and his two kids, 2 and 4 (maybe 5) years old. All of us are staying in my parents house. As you can immagine, its rather crowded and the noise level far exceeds that of which I'm used too.  \n\nOne morning, I wake up around 8am. My brother and his kids are already awake and eating breakfast from what I can hear. I decide to browse reddit on my phone an hour, just to avoid more interaction than I have to.  \n\nWhen I finally decide to leave bed and have breakfast, the my brother and his family has moved on into the TV-room. The TV is on and they're watching cartoons on YouTube.  \n\nI make myself two sandwiches and join them. My brother hands me the remote and says; \"Just put on whatever 4yold is pointing at. I need to go to the bathroom.\" Alright, I can do that. Unlike his father, the little guy is actually pretty cool to be around.  \n\nWe browse child friendly Youtube videos eventually settling on Barney the Purple dinosaur. My brother has by this point returned. Eventually the video ends and related videos pops up. 4yold is pointing at a video called \"Scientifically accurate: Barney the Purple dinosaur\". I've been browsing enough internet to know that that is not a child friendly video.  \n\nThe conversation goes as follows:  \n\n4yold: \"Uncle, please put that one on\".  \n\nMe: \"I dont think that's a good idea. How about another one?\"  \n\n4yold: \"But I wanna see that one!\".  \n\nMe: \"I...\"  \n\nMy brother interrupts me.  \n\nBrother: \"Put that one on, he wants to see it.\"  \n\nMe: \"I really don't...\"  \n\nBrother: \"Put it on.\"  \n\nMe: \"Trust me, it's...\"  \n\nBrother: \"For gods sake, just put it on.\"  \n\nMe: \"Alright, but this one's on you\".  \n\nI mentally prepare myself for the total shitshow that is about to go down as I place the remote on the table.  \n\nNo more than 15 seconds into the video, the first images of cartoon gore is displayed. The 2yold starts crying. The maternal instincts of my brothers wife kicks in and she starts yelling at my brother to turn it of. By this point, the video has reached the point where kids are starting to get killed. Brother finally manages to turn the video off. The 4yold, having seen forbidden content, is now throwing a tantrum over not getting to see the entire video. Brothers Wife does her best to comfort the 2yold, but she's crying her eyes out. Meanwhile, my brother is trying to end the tantrum of the 4yold. \n\nDespite the mayhem, all I can feel is total inner peace. Never has utter chaos been so satisfying.  \n\nFinally my brother turns to me; \"Why would you put on that sht?!\".  \n\nIn a calm voice i simply reply; \"Because you told me too.\"  \n\nBrother: \"But you knew what it was?!\"  \n\nMe: \"And you didn't litsen when I tried to warn you.\"  \n\nBrother: \"You never tried to warn me!\"  \n\nI sigh. At this point I just leave. There is no winning this arguement. Afterall, he's always right, even when the evidence is screaming otherwise.",
        "permalink": "/r/MaliciousCompliance/comments/bxd95a/want_me_to_turn_on_cartoon_gore_for_your_kids_are/",
        "comments": [
            "Well at least they didn't see happy tree friends",
            "Welp, welcome to annoyed uncles annonymus, where we try to de-fuck the influence of the parents on the kids.  \n\nAdmittedly, that was some great unceling.  \nRecommended age to introduce them to simple-explosives-in-mothers-prized-flowerbed is around 10, by the way.",
            "[deleted]",
            "I wonder if you could tell him you're not turning it on and give the remote back to your brother. It sounds like he would still turn it on and at that point, would he still blame you for not physically stopping him or throwing a tantrum yourself? :D  \nYour brother sounds like a piece of work...",
            ">Afterall, he's always right, even when the evidence is screaming otherwise.\n\nThe last sentence was just perfect.",
            "I've seen the video. Let me just tell you 1) YouTube algorithms should know better and 2) please tell me they didn't see the whole video.",
            "\"If you think I didn't warn you. Then on what grounds are you claiming that I knew what it was?\" He obviously knows full well that you warned him.",
            "Your brother sounds like my asshole dad haha. I stopped talking to my father years ago because he thinks he is always right and everybody else are fools.",
            "So are you going to show them South Park next year? Its a family friendly cartoon!",
            "Honestly he knows he is wrong he just can't admit it. It was better for you to leave because now it is open ended and he will think about it later. Trust me I have a brother too. He ain't this bad but he is thick skulled and sometimes you just have to leave them alone with their thoughts. They might not crumble but they will waver. Eventually you might get an apology and eventually he might turn himself around. Never give up on your brother but keep him at a safe distance, he seems like a douche.",
            "I seriously hate people like that. should have a record maschine with you, stopping him, say him, tell me again, holding the recorder in his face. if he asks why, say so that he doesn’t pulls that shit as he always does. 🤷‍♂️",
            "If you were to tell him he's right, would it cause a feedback loop?",
            " \n\n>Brother: \"But you knew what it was?!\"  \n>  \n>Me: \"And you didn't litsen when I tried to warn you.\"  \n>  \n>Brother: \"You never tried to warn me!\"\n\nMy inner rage level just went over 9000 just reading this. \n\nWould have called him a stupid mofo not realising I just comitted suicide",
            "[deleted]",
            "[removed]",
            "Hate to say it but your cool nephew sounds like he will grow up to be your brother if he is throwing tantrums like that and not made to behave.",
            "Your brother sounds like the kinda guy who never got his ass properly kicked.",
            "> Brother: \"You never tried to warn me!\"\n\nThis sub sometimes fucks with my mental health",
            "I would start recording situations like this and play them back when the inevitable argument ensues.",
            "Video link?",
            "Make them watch dont hug me im scared...",
            "You should buy them Watership Down (1978) this year for Christmas.",
            "If [this](https://www.youtube.com/watch?v=865AoXifk7E) is the video, I'm just so proud of this particular MC.",
            "I have the same brother! Moved 3,500 miles away to avoid the constant competition and arguing. #1 complaint, won’t acknowledge when he is factually wrong.",
            "I think your brother needs an adjustment with a clue-by-four. Maybe several adjustments.",
            "Don't let him push you. If he wants his kids to watch that shit, make him hit the button. He wanted you to hit the button so you can be blamed.",
            "Your brother seems to be asking to be punched in the face as well as raising some future spoiled brats.",
            "Narcissist asshole. Would it kill him to admit he is wrong once in a while? Maybe OP should carry a tape recorder every time he meets his brother and then replay it over and over to him to prove he is wrong.",
            "Your brother’s a cunt",
            "I cut out a large portion of my family for being like this.  haven't talked to one sister in 20 years and the other in 30.  life is wonderful when you realize that just because you are family doesn't mean you have to keep toxic and evil people in your life.",
            "[Heavy Metal, the classic.](https://youtu.be/Lu_UB1Lus6I)",
            "Atleast they have never seemingly reached the clickbait side of youtube in the years the 2 kids have been alive,  i hope the kids can avoid clickbaiters tbh although that probably isn't very possible since YouTube just has to recommend the trash ;-;",
            "Why even bother with family when it can be so shitty? Once you say to yourself \"fuck it\" like I'm getting ready to do, you feel much better.",
            "OP, to be honest with you i would have screamed at him that i did try to warn him and then immediately following that i would walk out of the room not listening to anything he has to say, gives him a taste of his own medicine and shows that if he argues with you that it would happen again",
            "I think we have the same brother. \n\"He's always right and I'm always wrong\"\nWell that's confirmed\n\"Has developed immunity of logic\"\nAnd kept it thought his adult life?\n\nAre you sure he isn't my brother?",
            "There's always the muppets on bad drugs, AKA 'Meet the Feebles'. Made by that paragon of the Movie  world, Sir Peter 'Lord of the Rings' Jackson, when he was much, much younger.",
            "Sounds like you and the 4yo should check out /r/raisedbynarcissists/.\n\nSide note, been there, done that and removed a lot of dead weight from my life.",
            "Someone who thinks he is always right but someone else is always wrong is going to be a shitty father.",
            "I now have some awesome new videos to look up and scar myself with.",
            "Could have been worse DHMIS could have come on",
            "I feel bad for those kids having to deal with him every day. I can only imagine what their interactions will be like when they're in their teens.",
            "This is relatable\n\nBut it would be more likely my own dad and my half siblings\n\nHe almost let them watch Disaster Movie when I came into the room and turned it off",
            "I’m so glad I’m an only child.",
            "Next time you have conflict involving your brother ignorance you should mention that. \n1. Good leaders are not afraid to admit when they're wrong. \n       Another hard hitter is\n2. Mention how childish or pathetic someone is being.",
            "Have very similar relation to one of my cousins.  I handed him the remote and told him he could put it on.  His wife called him on it when he tried to blame me and she doesn't like me much either.",
            "Thank you for introducing me to \"Scientifically Accurate\"!",
            "I love this. You’re brother sounds like a dick haha. I have one of those.",
            "> The first is that he's always right, even when evidence is presented against him. I swear the guy has developed immunity towards logic and reason. The second rule he follows is that I'm always wrong. Whatever I say, he has to argue against. \n\nI feel this. I could taste my bile rising just from reading that.",
            "Always, when he's around, get a gopro and wear it at all times.  Or a mic.  Or something so that you can literally play back the video and the audio so that he can see what a shitlord he is",
            "how did this de-facto retard manage to reel in dates with a woman, make her his girlfriend, then his wife, then spawn two kids?",
            "I fully expected this to be about happy tree friends",
            "This is the point you hand him the remote and say \"go for it\"",
            "I want to torture your brother this story made me so mad",
            "...hope the kid's not permanently scarred!",
            "YTA",
            "[removed]",
            "WTF is wrong with you, getting petty revenge against family by traumatizing toddlers?",
            "REN and STIMPY",
            "I would record any and all interactions with brother. then replay your warning, again, and again, and again, and again and again ... I would become a nuisance to him until his logic kicked back in, or I became such a nuisance that he felt it necessary to accept defeat. \n\nI'd even mail that recording to his job..... put it in his car... on his sandwich... really... nuisance X Tasmanian devil = brother WILL acknowledge defeat. \n\nBut yeah, I will trust your word that you can't win with him. Your strategy of not playing at all and just walking away is probably the best win you can get.",
            "Well, you could have said it more convincingly that the video was an ultraviolent parody",
            "I feel like you could've easily put something else on but you decided to traumatize a little kid just to make stupid point with your brother.",
            "[removed]",
            "Am I supposed to be impressed that you're willing to hurt kids just to help your brother be wrong? You could have put the child's needs before your problem with your brother. That shit is in those kids heads forever, and you could have prevented it by being a fucking man, saying \"no\", and putting down the remote.",
            "[removed]",
            "Who believes stories like this, seriously? It's like a bad movie script. No person in reality would stammer perpetually like that: \"I...\", \"I really don't...\", \"Trust me it's...\" instead of just saying, \"It's a violent parody.\"\n\nAnd if this story is actually true all it means is that OP is an awkward snowflake incapable of communicating properly.",
            "Your brother had that shit coming lmfao",
            "I’ve seen the video in question and that just makes it way more funny",
            "Dude I really dont envy you. He sounds like a total pain.\nMu beother and I are on alright terms but we have no kids. We at least listen though. He sounds like a total jackass.\n\nI know this is gunna be cliche as hell but...you are probably gunna wanna be around him or keep in touch. Hes toxic and he can be a drain sure. \nBut my dad always told me that one day all you're gunna have one day is your brother. And he was not kidding. \nWait till someone else close gets sick of him. He will come talking to you. Garunteed",
            "I hate your brother now",
            "\"you never tried to warn me\\~!\"  \n\n\ncut ties with this guy.  he's not your brother, he's a monster in disguise as a human.  he's a walking problem incapable of rational thought.",
            "Oof that's gaslighting and some damn fine red flags for abusive behavior, kinda worrying",
            "Lol way to scar that poor child in the name of getting a jab in at your brother.",
            "You're an asshole. You let those kids be traumatized just so that you could get back at your brother. Way to be fucking petty",
            "You're a jerk - maybe you got back at your brother, but you just traumatized innocent kids in the process.",
            "The way you described your brother sounds a lot like how mine used to be. Thankfully mine has mellowed over the years. I hope yours will too.",
            "This story has inspired me to pull out my cell phone and record his wishes next time always-right asshole wants to go against my better judgement.",
            "Have your voice recorder on standby for future interactions.",
            "Most of the time me and my brother get along perfectly, but sometimes he gets these moods that are very similar to what you described. He said he *knows* David [younger brother] steals from him, but he just doesn’t have evidence.",
            "At least it wasn't wolfenstein 2",
            "Ok. Picture living with someone who is 99% right. All the time. Truly. I don’t know how he has so much insight and spider sense. But he is almost always right.  He gets so wounded if someone doesn’t take his advice and bemoans how he could’ve so saved them trouble/grief/money.  And he’s right. \nBut there is something about doing things your own way. Even if it’s wrong. \nHis brothers?  Just like yours. I assure you it gets more interesting as the kids grow.",
            "Belongs on /r/narcsinthewild, too.",
            "Oh man, I’m only 20 and my brothers 23 and is the exact same.. our relationships pretty much the same and I’m about to leave the country... are you sure you’re not me from the future?",
            "I’ve literally seen that video! Just thank god they didn’t make it to the end...",
            "Hm, I dont know. When I was 5 or something my father watched Saving Private Ryan with me and other hardcore war movies.  \n\n\nI grew up fine.",
            "Dont hug me im scared sounds appropriate though.",
            "Could have been worse. They didn’t get to the dinosaur penis.",
            "Why not use your phone to record such interactions \"no here, see you TOLD me too\" and play it back for him.",
            "You should record a conversation with your brother to prove with evidence he is a dick head",
            "Scientifically Accurate Duck Tales is better.",
            "My little sister was like this for a long time, she grew out of it when she hit 14 though. She used to argue about the weirdest things too, one time I walked past my lounge room and found her asleep on the couch, snoring slightly. An hour later, she wakes up and comes into the kitchen. I greet her with a \"Hey, you're awake\". Instant response was, \"I was never asleep\". She was snoring.",
            "My sister and dad on a nutshell",
            "My oldest brother is like your brother. \n\nI stopped interacting with him about 15 years ago. \n\nMy life is much better for it.",
            "Holy shit.. I have a little annoying fuck ass brother but thank god he's nothing like your brother.. That dude is an abomination.",
            "Does someone really need a warning with a video titled 'Scientifically Accurate Barney'? All you need to do is briefly consider what a dinosaur could do to a small child.",
            "[removed]",
            "The next time you let him walk into a landmine, whip out your phone and start recording so that you have something to shove in that narcissistic gaslighting jackass' face.",
            "Holy fuck. Shit like that pushes my buttons real good. If I had a brother like that, despite being a very pacifist person, I'd probably get into fistfights with him.\n\nTo claim you never warned him. That shit pisses me off.",
            "Why haven’t you cut him out of your life? Toxic people are the worst.\n\nI agree with ImNotPiggy’s response, tell him that leaders can make mistakes and that he was acting childish.",
            "At least your nephew didn't make it to the end of the video.",
            "Seems like a great time to put on watership down.",
            "If is really sadistic that you put it on",
            "My brother is the exact same way. I cannot have a conversation with him without being called stupid, even if I tell him to do his own research on a subject. But I get the feeling he thinks that about all women thanks to his upbringing.",
            "Feel incredibly sorry for his wife and children. They have to live with him and be his children :(",
            "How can someone be this unreasonable? Jeez.",
            "What was the video?",
            "I know it's a hindsight 20/20 type thing but if your brother is just like this you really should film him. Also part of me is guessing that he just didn't want his wife to be mad at him so he was desperately trying to shift the blame away from himself.",
            "Seems like he was the spoiled one in the family",
            "From the title I was expecting a coin flip between Anime or Happy Tree Friends. LOL",
            "I'm sorry you have such a bad relationship with your brother. Ik it hurts, but some people are just toxic and try as hard as you might. They'll still stay toxic. Funny story btw",
            "I had to find that video on youtube.  Did not disappoint.",
            "How did your brother manage to make a family, let alone hold one together, being the way he is? Is he also like this with his wife? He sounds like a pretty toxic individual, even if just towards you.",
            "Could have been worse, could have been DHMIS...",
            "Your family reminds me of my family, OP. I just don’t interact with them at all anymore. Gaslighting, lacking responsibility assholes.",
            "\"No.\" is a whole sentence. Next time he cuts you of like that, you have every right to walk away.",
            "As a guy who has a little brother who is always wrong, I’m not on your side.",
            "Next time put on willy willy bum bum.",
            "You need to stand up for yourself more.\n\nMy brother used to treat me this way (although not quite as bad), and I resolved it by *absolutely* refusing to give him any ground under any circumstances. It was painful and took a while, but he got the message.",
            "Send my regards to our brother",
            "I don’t see how people let others talk over them. Yea it’s polite to stop if you both start at the same time but if I’m in the middle of a sentence I’ll finish it even if you tell me to stop",
            "> He seems to follow two very strict rules. The first is that he's always right, even when evidence is presented against him. I swear the guy has developed immunity towards logic and reason. The second rule he follows is that I'm always wrong. Whatever I say, he has to argue against. \n\n&#x200B;\n\nJim?",
            "You're e better man than me. I'd refuse to ever see him again",
            "Good lord i had a friend like that and its exhausting, if you put it nicely. If i had a brother like that i wouldnt want to see him to.",
            "Sorry but I just wanna say fuck your brother",
            "Giant T-Rex penis! Solves all your problems. :)",
            "i was really expecting happy tree friends if i'm being honest",
            "At least they didn’t see the after credits bit",
            "Link?",
            "Sounds like we have the same brother. LOL. Wow. Kudos for you though. He wouldn't listen. Karma is a b\\*tch as they say.",
            "TL;DR?",
            "Video in story.\n\nhttps://youtu.be/865AoXifk7E",
            "Sounds like someone needs naptime.",
            "That cartoon is brilliant",
            "r/raisedbynarcissists",
            "https://www.youtube.com/watch?v=TPBikkfL_qw&feature=youtu.be",
            "[Gorey \"purple dinosaur\" video for reference](https://www.youtube.com/watch?v=865AoXifk7E)",
            "How old are you?!",
            ">I swear the guy has developed immunity towards logic and reason.\n\n*Ben Shapero has entered the chat*",
            "So they didn't get to see the part where Barney's 12 foot penis is shown?",
            "When situations like this happen I write up a contract saying “(i) have warned (you) about (xyz).” If we both sign it I proceed to follow their every whim.",
            "You’ll never win the war. But you did win that battle. And sooner or later his own kids will hate him for his arrogant shit. Maybe he’ll learn someday. Sorry you go through that shit with him.",
            "Do we have the same brother? At least mine quit cramming religion down everyones throats at every opportunity. \n\nHe’s an atheist now, his Christian wife wanted to raise their kids in a Christian household. \n\nWhat. A. Shit. Show. We don’t talk much anymore, haven’t seen him in years.",
            "I'd break his nose... I'm sorry you have a brother like that.",
            "Your brother is a piece of shit.",
            "Should have given him the remote to do it himself",
            "Glad it wasn't pr0n!",
            "My favorite part of those \"scientifically accurate\" videos is how often they're not scientifically accurate.",
            "I was expecting them to watch Happy Tree Friends. This is good too!",
            "Eh, my brother and I mostly keep to ourselves, and have been doing so for the last few (several? Don't remember how long) years. He likes Minecraft servers, and plays only that; I play various singleplayer games on my Switch/New 3DS XL/PS4 Pro/laptop. We don't hate each other; it's just that we're quite different people.\n\nWe used to play with each other as children, mainly LEGO Star Wars on the PS2 and some outdoors activities, but yeah; that time's long gone.",
            "I feel you man. My brother and I are always at odds when we used to be the best brothers ever. Right now it’s best to focus on ourselves then our annoying brothers.",
            "Wait....your brother is my brother?? Are we brothers??"
        ]
    },
    {
        "post_id": "ybbkhn",
        "author": "abiggerhammer",
        "title": "How my dad didn't go to Vietnam",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ybbkhn/how_my_dad_didnt_go_to_vietnam/",
        "score": 13916,
        "num_comments": 932,
        "created_utc": 1666511407.0,
        "selftext": "In 1969, my dad graduated from Rice University with a 5-year master's in chemical engineering. (Edit, since so many commenters seem to think he was some kind of rich kid: his parents both taught public school, and he went to college on a full academic scholarship.) The Vietnam War was raging, and although he and his classmates had all received deferments during their studies, their deferments were over and it was time for them to go before the draft board. Most of his classmates weren't worried, because they were slated to see the Houston draft board, which had a reputation for handing out continued deferments like Halloween candy. However, my dad is from Oklahoma, which meant that he had to be evaluated by the Tulsa draft board, which was much, much stricter.\n\nDad had applied to the chemical engineering PhD program at Stanford, and had been accepted with a full stipend. He was excited to go, but first he had to get past the draft board. The Stanford faculty wrote a letter to the Tulsa draft board, explaining that Mr. Hammer would be embarking on a research program that would greatly benefit the war effort and asking for another deferment. The Tulsa draft board wrote back in short order: Mr. Hammer had already benefited from the only deferment he was going to get, and thus he was to present himself to the Army physical examination center post-haste.\n\nDad was sad to lose his shot at a PhD, but not too sad, because now he could marry my mom. He'd also had several job offers already, so he accepted an offer from Exxon and he and my mom got married. His superiors at Exxon wrote another letter to the Tulsa draft board, explaining that Mr. Hammer was now gainfully employed in the oil and gas industry, where he would be conducting engineering research that would greatly benefit the war effort, and asking for another deferment. Just as quickly, the Tulsa draft board wrote back, reiterating that Mr. Hammer was not going to receive another deferment, and that if he didn't hurry up and get his Army physical, they might have to get the law involved.\n\nDisappointed, my dad went to his Army physical as scheduled. He's always been a healthy guy, and he performed just fine on most of the examinations, up until the very end, when they measured his heart rate. It was over 100 beats per minute. \"Well, we can't pass you with that,\" said the Army doctors. \"But you're probably just nervous. Come back in two weeks and we'll give you another physical.\"\n\n\"Nervous?\" said my dad to himself. \"I can work with that.\"\n\nFor the next two weeks, my dad spent every spare moment basically teaching himself the opposite of meditation. He'd close his eyes and think of the most horrifying mental images he could, trying to drive his heart rate as high as possible. Finally, the day of the physical arrived, and things went much as before. He passed nearly everything with flying colors, but when the time came to measure his heart rate, once again it was well over 100.\n\nThe Army doctors promptly diagnosed him with tachycardia, scored his physical 4-F, and sent him home. He's in his 70s now, and apart from his mysteriously high heart rate (which I inherited), he's always been in great cardiac health and still is.",
        "permalink": "/r/MaliciousCompliance/comments/ybbkhn/how_my_dad_didnt_go_to_vietnam/",
        "comments": [
            "My dad was super skinny. He got the letter and reported for the exam. Of course, he was underweight. They told him “I tell you what, if you sign this paper we can get you into a special program and put the weight on so you’ll be in top fighting shape”. \n\nHe said, “You mean if I don’t sign this, I don’t get to go to the special program and don’t have to go to Vietnam?”\n\n\nHe was on a pretty strict diet to maintain his svelte figure until conscription ended.",
            "My dad found himself in a similar situation (school deferments ended) and got a bad draft #.   During his physical, the doctor asked him when he'd broken his neck.  My father said that he hadn't - but in describing to the doc a motorcycle accident he'd had a few years prior, it seemed that the crack medical team overlooked a fractured vertebrae.  So no malicious compliance, but a big fucking surprise and no Vietnam.",
            "My grandfather had a similar experience with the draft board- except he survived polio, and two weeks before had surgery on his lower body. So when he showed up ‘before the law was involved’ he was in a cast, arm crutches and my 5’ grandmother toting two children behind him to help open doors. \n\nLol",
            "Back in another lifetime I was in the AF stationed in FL. What do you do? You learn to scuba dive. I was at a dive shop in Destin, FL getting my tank refilled. The guy handling was 20 something, buff, appeared to be in the picture of health. It was odd he was here and not in Viet Nam. \n\nCurious, I asked him why and he giggled. \"Look at my feet.\" I did; he had to be six feet, and I was a 5'2\" woman ... and his feet were the same size as mine. Then he explained he passed the draft physical easily until the doctor saw his feet. 4F. It didn't hinder him in his diving career whatsoever. He was a NAUI instructor.",
            "My father-in-law went to the psych evaluation and when the evaluator stepped out, he completely rearranged his desk (in order to improve efficiency) and the guy came back and said you failed, get out",
            "My dad was drafted in ‘72. He was diagnosed with flat feet. It wasn’t enough to keep him from being drafted but it was enough to get him a stateside assignment. There were a lot of guys having trouble with jungle rot in Vietnam (basically your feet get wet, never dry out and, yeah, not pretty). They had found those with flat feet had it way worse.",
            "My dad had a similar experience in Chicago. His blood pressure was so high they assumed he was taking something to fail the physical. He was  simply nervous and had an immediate jump in BP. They locked him up for fours days and checked his BP each day. After day 4 they let him go and he started taking meds to control his BP better. \n\nI have the same issue. No problems with my BP but in suddenly intense situations it jumps quickly. A standard response but ours is just exaggerated",
            "I knew a Vet who told me that he spent his time training for this, and then that, followed by something else, etc.  He'd figured out that he wouldn't be sent to combat if he was going through a training program, so he made sure he was signed up for specialized classes for his entire four years.  Apparently, he'd implied that he was going to make it a career, so the leadership happily kept him out of the combat (for the time being).  He noped out asap.",
            "My dad said they heard a wheeze in his chest and said come back in 6 months so for all that time he smoked 4 packs of unfiltered Pall Malls a day. \n\nWhen he came back the wheeze was worse and he got 4F.",
            "Glad for your dad. I was in high school when the VNWar began. When friends returned from their tours each one said the same thing to me: If you can stay outof this war Fucking do everything in your power to do so. I went for my physical and sat and watched as the 3 or 4 docs examined each guy. One doctor was especially painstaking while the others where one,two, three. When that one doc was open I jumped my place to him. The doc said it's ok to the Seargeant  standing there who wanted me to sit down. Even though I had played college football  a week or 2 later I received my 4F. The war was so unpoular that a few years later my brother got a 4F without going to a physical!",
            "They called up my brother twice. He was Type 1 diabetic. They wouldn't accept a Dr's note. So he goes in, stays overnight and they test him. Yep, you are diabetic.\n\nThen 6 months later, call him in again. Lather, rinse, repeat.",
            "My grandfather actually passed the physical and was told he had a week before he was going to be shipped out. He was living in Oakland with his parents at the time. 3 days before he was supposed to leave he was sitting on his porch taking in the view and didn't see these 2 guys across the street trying to break into a car. Well one of the guys thought he had seen them because  my grandfather was looking in their direction.  So they shot him. He got 1 bullet in the leg and never got shipped out. And everyone in the family is glad he didn't go because his cousin came back in a bodybag a month later.",
            "My dad did something like this. Showed up after a four day lsd binge. No idea why he didn't pass the psych evaluation.\n\nEdit: I am going to add to this a bit due to it creating a discussion.  My father had graduated Berkeley and was accepted to grad school for psychology. He had received one deferment. His father had fled Germany to avoid being drafted in WWII. So my family was anti war and anti draft. They concocted the plan. Four days of coffee, whiskey, weed and LSD. My father showed up and was unable to fill out the paperwork. So he took up the unfilled out forms and said he was a  conscientious objector. They interviewed him and the interviewer was smoking. So my dad just coughed.  The guy then blew smoke at him and he coughed more. My dad was actually quite fucked up and didn't really have to act like he was. So they tell him he can't be drafted and was unfit. My father refused to leave though. He threatened to jump out the window. MPs were summoned who dragged him out the building. He sat out front till they called a cab with instructions to take him to the County lunny bin. Once in the cab the driver just took him home. So ends my father's draft experience.",
            "I used to work with a guy who had a pretty amazing get out of the draft free card. He had a low lottery number, meaning he was pretty much the next up, when someone set fire to his draft board office. His records were among those burned, so no trip to Vietnam for him!",
            "My uncle went to Vietnam. His actual unit was out somewhere, so he got stuck in a camp for a while.\n\nThe smell was so atrocious that he, being the son of a general contractor, decided to put in a septic system, to kill some of his voluminous spare time. (and while he was working, he didn't get put on details!)\n\nA week or so later, some general officer came through the camp, and was there for a while, and while walking through the center of the area, he stopped dead: \"that's it! It doesn't reek like shit! That's what's wrong!\"\n\nSo the commander explained about my uncle, and the general told him, \"bring me that soldier.\"\n\nAnd that's how my uncle spent his entire tour in Vietnam building all kinds of shit for a general, rather than fighting in the jungle.",
            "Is tachycardia that bad? I’m bradycardic so even though I’m not fit by any measure, my resting heart rate is in the low 40’s. I assume this will allow me to live forever.",
            "A guy I worked with told me the story of how he got out of the draft; He and his bestie had to go to MEPPs the same day. He brushed his very long hair over his face and sat picking at his nails and glancing furtively back and forth, mumbling to himself. He got out on a Psych waiver. His bestie took a different approach; he dosed himself with LSD and started tripping in the processing center. Unfortunately he did NOT get a waiver and left immediately for camp Pendelton, which means he was still tripping when he reported for Marine Basic Training, talk about a bad trip!",
            "My dad got drafted, and somehow wound up in a whole unit of wise asses. This was in 1968, so when they finished their basic training and they were asked where they wished to be stationed, they all knew damn well they were headed to Vietnam. But because they were all wise asses, without consulting with each other in advance, they all put places like Lichtenstein and Lithuania as their answers.  It was a BS question and they all knew it.  \n\nOne unit was sent to Korea instead. Guess which one it was.",
            "My brother-in-law was a serious bullshitter and also an air force brat. He knew all the Military Brat Mind Tricks.  They called him in for his physical and he was completely uncooperative: contradicted every single statement they made down to how old he was.  He was deferred as \"morally unsuitable\" or something like that.  IOW, they didn't want the trouble",
            "In the 60s, Rice was affordable.  (Source:  Got PhD there in late 80s and met my wife, who was a Rice undergrad, there.   Married in Rice Chapel and reception in faculty club.)",
            "LOL reminds me of the urban legend from my area. A week or two before the army phisycal exam, these two guys decide they wanna be exempted from the army service. So a week or so before the physical, they embark on a diet of coca cola, as in 5 liters per day. The only food they had was the occasional McD or similar junk. \n\nOn the day of the physical you're supposed to show up super early without having eaten anything. Of course they down the largest cola bottle each right around the corner from the recruitment centre. \n\nAs the legend goes, they did well on the fitness levels, but when the results of the urine and/or blood test came out, they were deemed as unfit and got referred to a doctor to check for diabetes. \n\nNot a doctor myself, so not sure how true this is, but the story is 30+ years old 😁",
            "My dad had very flat feet as a kid. His parents took him to an orthopedist who recommended physical therapy. So for a couple of years while he watched tv he picked up marbles with his toes and transferred them between buckets that way. It worked and he had pretty healthy feet. \n\nWhen he dropped out of college he knew his number could get called any moment. He went to the the public pool and every day got on the low diving board and jumped down onto the concrete repeatedly to flatten his feet. It worked. And the war ended before his number got called. \n\nHe wore cowboy boots almost constantly and swore that kept his feet from hurting. As a result of the childhood PT he had crazy strong toes that he could pinch hard with. One of my cousins wouldn’t walk into a room he was in if he was barefoot.",
            "My dad got lucky. \n\nHe'd done most of the first few things- deferment for college, and even went to basic training, but he knew he'd die there, so to get an exemption he had done a bunch of research about how they choose and figured out that it was down to *one person's* judgment in some office to sign off on his not going. He didn't know if he would be able to convince that person or not but it was down to that. \n\nWhen he walked into that office that very person was his first-grade teacher, who obviously didn't want him to die either. When he graduated basic, he said they were reading out the assignments: \"Republic Of South Vietnam, Republic Of South Vietnam, Republic Of South Vietnam, Clearwater, Florida, Republic Of South Vietnam, Republic Of South Vietnam...\"",
            "My dad got out of it too. He has the phenotype of long lanky string bean. Minimum weight for army 6ft tall was 132. My dad did not know about that before hand and weighed in at 129.",
            "He's lucky, that's around the peak of Project 100,000. It was a push to get more people drafted by lowering the mental standards of who could get drafted, so mentally challenged people with the intelligence of 3 year olds that had no idea what the concept of war even was got sent to battle. \n \nThink the Vietnam part of Forrest Gump mixed with Full Metal Jacket. Needless to say a lot of people were sent to their death and the other soldiers who were tasked to baby sit them were put at significant risk. A lot of them were deemed to dangerous for themselves and the other people around them to carry weapons. There is examples of them accidentally killing people in friendly fire too of course....\n \nIf you thought the Vietnam war was shitty before....",
            "I knew someone who shot off their trigger finger to escape the draft.",
            "Teaching himself the opposite of meditation to drive his heart rate higher? Yeah, I’d say this guy engineers.",
            "My dad went to work at the auto factory right when he got out of high school, and when his draft number came up, he went in, ready to do his duty.  Turned out that he had caught his hand in a machine some weeks before and couldn't bend his first finger. The doctors said it might pass off with time, or it might not, no one knew.  So the army didn't want him.  It took about nine months of him working at it diligently but it did finally pass off and by the time I can remember, my dad had a fully functional right hand.",
            "I know a guy who got his BS in ChE and was drafted. He thought he might get something other than combat duty bc of his education. Nope. They out him in the airborne.",
            "My dad got out of going to Vietnam by learning German. He got sent to assist occupying Germany instead of fighting guerilla soldiers.",
            "I was a grad student working at Oak Ridge National lab in the early 80s. One of the stories someone a few years older than me told was of another grad student (from Vietnam era) who looked like he was going to lose his deferral. One day his research advisor took him on a “shortcut” at the Y12 facility and made sure he saw nuclear warheads being assembled—and knew what he saw. It wasn’t in an area they’d ever been before. When he got to his draft board hearing and they asked about what he’d seen at the lab they decided he was better off staying home for some reason 😉. My friend said they later found out that this particular advisor took “quite a few” grad students on the same detour. It wasn’t till after the war that they were together talking about the guy and realized that each realized they weren’t the only ones.",
            "I got out of military service by getting a doctors note stating I wet the bed at night. They sent me to get checked in the army hospital but they couldn’t really check for much. I was fully prepared to pee myself if I had to, but it never came to that.",
            "Man, I decided to join the Navy after high school and so I blew off all the college admissions stuff. I scored high on the ASVAB and had two different recruiters basically competing to get me into their respective favorite programs. I showed up to the MEPS a four-year letterman and failed the physical.\n\nBecause my eyes were too bad.\n\nTurns out, if your vision was worse than 20/400 uncorrected, the Navy didn't want you even if it corrected to 20/20 with glasses. .\n\nWhich I guess makes sense, you don't want a guy that's helpless in an emergency because he lost his glasses, but I kind of wish one of those recruiters had thought to mention it before I missed my college application deadlines.",
            "My father's number was called but he just got a job as a teacher and teachers were just given an exception from the draft.",
            "My former boyfriend, born 1948, had to drop out of college for one semester and presented himself to the draft board in Nutley, NJ.  Explained he had no money for college, but was going back the following semester after saving up some cash.  Lady at the Board picked up his papers and said “these might get lost for a few months.”  Wink wink.  He went back to college and graduated and went to law school and had a long career in the State Department.",
            "My dad was the opposite, when he was in the eye exam, the examiner asked him what letter was on the card. My dad was color blind and obviously couldn't read it, but that didn't stop the examiner from having a melt down, screaming obscenities at my dad for attempting to dodge the draft, and then passing him anyway. He went on to work on nuclear missiles.",
            "My tennis coach dodged it by creating such a disturbing art piece that when they showed it to them he was deemed unfit. Plus flat feet",
            "Dang, good for him. Ridiculous damn draft board.\n\nHeh so they sometimes made us run with heart monitors in gym class, and I’d fantasize about being struck by lightning so I didn’t have to actually work.",
            "Oh yeah?? Well, *my* dad got out of going to Vietnam by joining the Navy and *being able to type*. So he had to stay behind to type reports or some bullshit. Having served (not in the Navy though) I 100% believe this to be true. \n\nHe said he two finger pecked like a MF.",
            "My uncle was a draft dodger. His birthday was called in the lottery and he disappeared to live in the bush because while he was an incredibly bright scientist much like your dad, he had no interest in aiding the war effort and was never going to kill anybody. He was on the run for years and it did awful damage to his mental health. Many years later it came out that he wasn't born on the day that was called up at all, he was born the day before and the doctor had been too tired to do the paperwork until the next day.",
            "My dad wanted to be a dentist but that wouldn’t get him a deferment. There was a shortage of public school teachers at the time and going into that field would get you a deferment. So he switched. Dads an introvert and the shitty middle school kids drive him nuts for his whole career and we would have been better off financially if he could have been a dentist. My uncle unfortunately had to go to Nam and agent orange exposure prob had something to do with his death in his early 60s.",
            "Rice is very high-end today. But because of oil money, mostly, Rice was tuition-free until 1965 when they started charging $1200 ( the equivalent of about $11,300 today).",
            "My dad was drafted at 18. He was a total beach bum in California so very low chance of deferment. He freaked and a friend told him to enlist in the Navy instead because it would be safer than being on the ground with the Army or Marines. \n\nJoke was on my dad though because while he was attached to a ship, he was assigned to a seabees unit in charge of moving troops/supplies up the river and bringing bodies and wounded back down. So he was on the ground anyway, saw combat and eventually was wounded. \n\nHe never told me if he stayed friends with his buddy lol.\n\nEdit:Spelling",
            "My dad always told me he pretended to be deaf at his draft physical examination and they sent him home. I always wondered if that was a true story…",
            "Interesting how your dad clearly had such a bright mind with a very skilled degree and yet was still needed to catch bullets.  Surely someone would have thought a chemical engineer would be better off on the home front?",
            "Also, if Im not mistaken Rice didn’t charge tuition then, not sure about now.",
            "You weren’t allowed to be openly gay in the military back then, so I really don’t understand why draft dodgers didn’t just walk in there acting flamboyant and talking about how much theylove cock. Seems like the easiest way to get out of it to me.",
            "Side note - The history of Rice University and its founder is fascinating.  I highly recommend spending some time and listening to this [Stuff You Missed In History Class](https://podcasts.apple.com/gb/podcast/the-murder-of-william-marsh-rice/id283605519?i=1000538215129) about it.\n\nAlso, Like Stanford, it was originally established as a \"free\" educational institution.  Its only been since the 80s that it became expensive.",
            "My father, an eccentric man in normal circumstances, took it upon himself to use his theater degree (mostly in backstage work) in an entirely different manner to get out of Vietnam. It involved buying a purple three piece suit and a letter from a psychiatrist (falsely) stating he had schizophrenia and was a homosexual. Apparently they could've dealt with the mental illness, but being flamboyantly gay was a step too far.",
            "Well, at least it's better than having a wonky bone in his foot....",
            "[deleted]",
            "Can you get this story translated into Russian?",
            "The only benefit America got from getting into Vietnam was our government finally realizing drafts are fucking stupid and just give you a military full of people who don't even want to be part of whatever bullshit a bunch of old ass politicians gets our country into.\n\n\nThanks to that, we got a shit load of propaganda disguised as great military movies/shows/fun video games, and now the front lines of whatever bullshit old ass politicians get us into is full of idiots instead of smart people with promising futures.",
            "So he lost out on a PhD opportunity for nothing because Tulsa was just being a dick about deferments?",
            "The biggest boomer moment I ever saw was my math teacher my first year of college: “Back in my day you didn’t get an F, you got a V because you went to Vietnam 🥸\n\nEdit: college, not high school",
            "It's insane to me that the draft board was so willing to send people to die even when, ignoring that they were human beings, it made logical sense to not draft those involved in \"practical\" science and research fields.",
            "The military: we don't care if you will do research and work that will benefit the country. We want another fresh body to throw at the meat grinder today!",
            "Mine went for a hike in the mountains with a buddy. His buddy had just been drafted. Dad was about to be.\n\nDad saw a neat looking boulder, and being an amateur photographer and naturalist, pulled out his camera to snap a shot. His boot slipped on some gravel and he felt a sharp pain in his leg.\n\nThen he woke up six months later missing half a cup of brain tissue, an eye, most of his teeth, a large part of his nose, and three fingers on his right hand.\n\nApparently he had been bitten by a rattlesnake. Then he started to lose his camera over the edge of a small canyon. He grabbed for the camera, managed to hang on to a tree limb…\n\nWhich of course then fell over taking the rattlesnake nest and my dad with it fifty feet below into the ravine, where he landed face first onto some comfortable rocks and dead tree stumps.\n\nDad was lucky.\n\nHis buddy, after hiking out with my dad’s body on his back for five miles and immediately getting a helicopter (in 1971) airlift back from the ranger station on the mountain, spent four months on deferred activation, was sent to Basic, then Vietnam, got shipped into the  North offensive going at the time, and died after two weeks in country. Which, had my father been drafted, would have in fact been the fate he and most of the young men faced.\n\nInstead dad had to learn how to eat with a spoon, read books again (aphasia eventually went away) write left handed, and give up all chance of ever being a surgeon.\n\nAs he put it, “I got real lucky.”",
            "[deleted]",
            "My drama teachers buddy filled his underwear with peanut butter before the exam. When the physician was horrified, his buddy stuck his fist in and licked his hand. He was escorted out with a fail and was not drafted.",
            "Shades of Alice's Restaurant.\n\nJust get arrested for littering.",
            "My dad just had a buddy take a hammer to his arm. Then the war ended.",
            "If they were going to ship me to that dead-end conflict to die for Kellogg, Brown and Root my heart rate would be pretty high too",
            "[PBS recently did a documentary on the war ](http://The Vietnam War https://g.co/kgs/W7y3AF) very worth watching...glad your dad was able to get out of it. As a Canadian I've always had a fondness for draft dodgers.",
            "Don't take high heart rate so lightly, from what I was told it was one of the contributing factors in my heart attack. The main factor was the blood clot from COVID blocking up one of the branch arteries by 90%, but the naturally high heart rate (my heart beats at 120 BPM sitting here in my chair without meds) did not help.",
            "My dad had the same issue with the Tacoma draft board - they were real gung-ho (amazing how a lot of the low income area ones were). He got through his initial college deferment and education, thinking there was no way the war could last *that* long, but lo and behold, it did! He didn't have prospects for a PhD or industry job, and given that he was certain to be drafted* he enlisted with the language corps (they suggested maybe he could learn French - lol). Of course he was slated to learn Vietnamese (despite being a bit tone deaf) but surely there's no way the war would still go on long enough for that and then get deployed.\n\nIt was, of course, but at least he got to listen to radio transmissions in a fire base rather than getting sent to the front lines. Never had to fire a gun, but hearing their evacuation plan for when things started to fall apart was \"march to the sea and hope you can flag down a ship\" was a little unnerving, as was Nixon's assertion that there were no American troops north of Da Nang. \n\n*It turns out, he may have been able to get a 4F. Dad didn't know it at the time, but he was colorblind and had flat feet. It wasn't certain, but with a sympathetic doctor he may have been able to get out of it. It ultimately worked out as he avoided death, dismemberment, and trauma, and the GI Bill got him started in a law career, but he still very much would rather not have gone.",
            "I had an uncle who, at the time of Vietnam and the draft, went down to the draft office and asked if they had his card in. They did and told him they could mail it to him or give it to him right then. He said they could mail it to him.\n\nHe then went next door to the recruitment office and signed up. He ended up being a door gunner on a helicopter in Vietnam. Came back alive somehow. Got shot at least once.\n\nHe is a crazy, eclectic individual.",
            "How did draft boards handle people who moved states? Did they stay under the jurisdiction of the first draft board, or did they fall under the jurisdiction of the new state’s draft board?\n\nSuperiors at Exxon write a letter to the Tulsa draft board saying Mr. Hammer is gainfully employed in the petroleum industry and would be a great benefit to the war industry — and since his job requires him to be stationed in East Texas, he was now under the jurisdiction of the Houston draft board rather than the Tulsa draft board.",
            "My dad went. Was spit on when he came back.",
            "My dad had it easier. He just made sure they knew how bad his eyesight was (he couldn’t even find the eye chart without his glasses), and made sure they didn’t find out that he was colorblind. You see, he had been the star of his high school rifle team, and the camouflage of the era was ineffective against colorblind people. If they had known about his colorblindness, they would have taken him for sniper training despite his eyesight.",
            "Excellent, fuck unneeded military drafts",
            "My dad got deferred because my mom, who was pregnant with me, told the draft board in CT that she would go insane if he went to war. They deferred him. By his calculations, if had had been drafted, he would have arrived in country just in time for the Tet Offensive. Talk about dodging a bullet.",
            "Alice’s Restaurant.. I want to kill kill kill! I want to eat dead burnt bodies.",
            "I know you say his parents both taught public school to try and demonstrate that he wasn't a rich kid, but bear in mind: in 1969 teaching was a respected and well paid profession, and dual income households were pretty rare. In addition, the attitude to debt was completely different - if you couldn't afford something, you'd save for it, not put it on a credit card. That impacted household outgoings pretty substantially. \n\nYour grandparents might not have been rich compared to the current elite, but with two adults working professional jobs, they were a long way from being broke.",
            "The year I had a low draft lottery number I was on the Group W bench for weed. The next year I had a high lottery number, so I waited it out and didn't get called up. \n\nAnd then I went and enlisted and spent 21 years in the military. Go figure.",
            "It was way easier for me. I just watched when they drew the first lottery and put my #360 in my pocket. Next brother was 324, little brother 289.",
            "Honestly though, he dodged a bullet. The way those vetrans: who were drafted, were treated both when they returned and for decades after the war is cruel and disgusting.",
            "Mine was drafted and went to prison as a conscientious objector. Then after 2 years in high security prison, his number came up again and was sent back to prison. \nBut congratulations to your dad for dodging creatively.",
            "Coming out of Rice’s 5 year BS/MS ChemE program and getting into Stanford ChemE PhD and a job offer from Exxon …. Man your dad must’ve been a genius!",
            "I wasn’t allowed to donate blood because I couldn’t get my heart rate down under 100 :(\n\n…but guess that means I can’t be drafted either! Lol",
            "Sorry for this off topic comment but I also have a high heart rate . I'm in my 60's and healthy.",
            "I had a tour of duty at the MEPS in Springfield, MA back in the late '90's. During a 1 week period, we had a guy disqualified for military service for \"underdevelopment.\" The CMO determined that the applicants penis was so small, that he would be subjected to too much ridicule, to reliably serve. Two days later, the CMO disqualified another guy for \"overdevelopment.\" The CMO described the guy as dragging his \"stuff\" behind him like a tail, when the applicants had to demonstrate the ability to duck-walk. Based on this disqualification, he also proposed a rule requiring all male applicants to wear briefs instead of boxers. His proposal was denied. This issue became a lengthy conversation with my commander, as the CMO never disclosed any medical specifications regarding over or under developmental disqualification. A few days after dealing with these 2 disqualified applicants with my commander, I ended up in another lengthy phone call over another guy who needed a waiver for felony lobster mutilation...but that's a story for another day.",
            "Great story",
            "What about sight test, what stops people giving wrong answers?",
            "Did he ever go back and get his PHD?",
            "This was an excellent idea. I read that historically, in Russia, sometimes people would fast for a week or two prior to when they were to report, and not sleep any the prior day or two, to mess with everything.",
            "My father worked in scrap metal at the time and so was exempted from industries critical to the war effort.  Interestingly enough, that kept us operational during Covid lockdowns as well.",
            "Getting a scholarship to Rice is extremely hard to do. Your Dad was incredibly smart. Happy he got his deferment. \nTake Care",
            "Being a chemical engineer im surpised he didnt just make a concoction of some adderall or caffeine to get the job done",
            "And here I was expecting some to sing Alice’s Restaurant in four part harmony.",
            "My grandfather was in the medical staff. He was supposed to go over but another guy in his group had a huge fight with their superiors and asked to take his place.",
            "About having to be rich to go there, you may not know, but Rice Univ (where my sisters and I were forced to go so my dad the engineer could lord that over his colleagues whose kids went to other perfectly good schools) was founded to provide a free college education. When I was there in the early 1970s, tuition was about $2000 and anyone who couldn’t pay got a loan from the school at 3% interest - my loan repayment was $75/quarter. And there were still *really old* students around who finagled not finally graduating but working forever on their PhD’s because when they matriculated, they were guaranteed free tuition for life. The founder was not admirable in many ways but he wanted everyone in Texas to have the opportunity for an education as good as the Ivy League, so anyone who could get in was fully supported.\nThat said, being in such a misogynistic competitive environment was really bad for my mental health. I hope things have gotten better.",
            "A friend of mine was getting conscripted into the Swiss army reserves and he said they have to do a two week training camp or something. He went out of his way to seem aloof and anti-social. After a few days, despite making all the other conscripts uncomfortable, he felt this strategy wasn't working so he blurted out, 'I killed my mum' (he didn't thankfully, she is safe and well). \n\nLong story short, that was his last day as a conscript in the Swiss Army.",
            "Tldr interfering government wanting meat for the grinder costs young man doctorate.",
            "So did your dad do the PhD program or the job in the end?",
            "He might’ve saved his own life",
            "I always wondered how I would have done in front of a draft board.\n\nI enlisted in 98, but it took two tries because the first time I failed the physical due to being underweight. I was 124 pounds and the minimum for my height was 125. \n\nThe second time I went through MEPS the recruiter put me in a hotel room overnight eating a bunch of fast food to gain an extra couple last minute pounds while the guy I was sharing a room with looked like he wanted to kill me as he was trying to sweat off a few pounds.",
            "My dad graduated high school in '69 and would have gotten drafted in '70. He enlisted in the coast guard to avoid it. Can't draft him if he's already in the military!! He spent 4 years hanging around in Texas and New Orleans, and then used his GI bill to get a college degree.",
            "My brother did get drafted. He died a couple years ago from illnesses after being exposed to agent orange. Took decades to die.",
            "This is one of those damned hard situations. I don't know what your father thought of 'Nam, and that war wasn't WW2, but where trying to get out of being drafted (and thus practically forcing another man to go at gun point in your stead) is seen by a lot of people as low behavior, it is in fact the case that a wise deployment of resources would probably have a fair percentage of the veterans I know trying to do that research work instead.",
            "This is at the same time an unbelievably useless and useful superpower.  \n\n\n\"I can close my eyes and give myself a panic attack.\"",
            "My late father in law got out of being drafted by applying to the Airforce Academy. Had to do the physical and they were far more... discriminating... than with draftees. Allergies prevented him from passing his physical so he also couldn't be drafted.",
            "My oldest uncle was up for the draft. He’s a lifelong bachelor, and he just pretended he was gay. My grandfather was super mad about it, but he didn’t get sent to Vietnam and honestly I’m glad for it.",
            "If I recall properly, Rice was tuition-free in those days. If you were in, it was a free ride.",
            "I dodged the draft by enlisting.  I didn't go to Viet-nam.  Didn't really go anywhere. I guess I was lucky.",
            "Yeah still don't know why they keep the draft when nobody uses it anymore.  Plus if they want good soldiers they can't force it or they will get bad ones.",
            "Medical norms are just norms, it doesn’t mean everyone is the same. I have a naturally somewhat high white blood cell count. I donate blood regularly, and they know that when I’m above the standard range, all is fine.",
            "This is probably the most legal way to dodge the draft. My hats off to him!",
            "I guess I have a way to get out of whatever war I’d be drafted into should that happen.",
            "Your dad dodged many bullets.",
            "Interesting enough, my dad was assigned one of the very last numbers during the draft lottery. But right before his last semester of college he got drunk and signed up for the marines and got shipped out a few days later.",
            "Thankfully my dad wasn’t allowed to serve in Vietnam because he’s colorblind and bowlegged.",
            "Why didn't he just say he was gay?",
            "I go to little vietnam every weekend. I order pho dac biet",
            "Reading this at 1am laying in bed heart rate sitting at 103",
            "Wow, that Tulsa draft board sounds draconian without a lick of common sense. By contrast, my brother got a PhD in organic chemistry at UT in Austin in 1966. He was deferred the whole time. Then he went to work at Los Alamos developing explosive compounds for military use.\n\nHe got a letter of some kind from his draft board shortly before he graduated, but it was a mistake.",
            "HAHAHA!  \n\nThis is fantastic!",
            "None of my friends went. Myself and one of my friends were in college, and so, had deferments. The other friend was employed full time as a printer. While my one friend and I were still in college, we each got a notice that we were now considered 1-A. Our friend that was working never got a change notice. \n\nWe never were told to go for our physical, and none of us were ever drafted. I’ve often felt guilty that I didn’t serve, but there was no way I was going to volunteer for that fiasco.",
            "This is also how you beat a lie detector test",
            "1970, got a high lottery number. Only and best thing I ever won.",
            "My dad decided to sign up for the Army instead of waiting to get drafted. He went to medical and they discovered he had a perforated eardrum. He has no idea how it happened and his hearing was fine. Instant 4F. I’m glad he didn’t go, otherwise he would not have met my mom and I wouldn’t be here.",
            "My dad has always been a skinny nerd and would not have stood a chance in Vietnam. He’s also always had eczema on his hands, so before he had his Army physical, he scratched the shit out of them and dunked them in hot water. The doc took one look and sent him home with his 4F.",
            "My dad had graduated with his masters in mathematics and physics and knew his draft number was coming up soon.  He made a choice and joined the Airforce. He got his army draft letter while he was in boot camp and handed it off to his CO who took care of it. He spent the war doing IT work at Vandenberg, Cheyanne Mt and little island off the coast of Alaska.",
            "My dad got lucky. The doctor doing his evaluation did a vision test, which basically placed him juuust over the line of being acceptable. So he looks at my dad and asks “do you want to go?” \n\nIf it weren’t for that, he probably would have gone, or would have never been able to become a citizen if he refused, since he’s an immigrant",
            "I had kinda the opposite occur where i had the navy docs ask me on multiple occasions how on earth i was still conscious as my heart rate was <40, on multiple visits to them during rtc great lakes",
            "The story I was told was that my father's draft number came up and he was supposed to go for the physical, a couple of days before he got mugged and got his head busted open by a bottle and his shoulder was dislocated. He was told he had to come back when he was all healed up. The draft was over by the time he was cleared to take the physical."
        ]
    },
    {
        "post_id": "aa2knc",
        "author": "AeviDaudi",
        "title": "Need a doctor's note? Ok now I have the next 2 days off",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/aa2knc/need_a_doctors_note_ok_now_i_have_the_next_2_days/",
        "score": 13908,
        "num_comments": 695,
        "created_utc": 1545940612.0,
        "selftext": "Super minor malicious compliance, so not sure if it's worthy to post.\n\nMy job is hardcore about taking time off, basically you can't unless approved in major advanced. I felt sick on Wednesday, so needed to leave early. I had no intention of taking more time than that... Boss demanded I have doctors note to leave early.. so I went to the doctor and the doctor said I can't return to work for two days. Thanks boss, i wouldn't have been able to take those days off otherwise. \n\nEdit: thanks for the gold! I had no idea my post would take off like this, somehow it makes my malicious compliance feel that much better! ",
        "permalink": "/r/MaliciousCompliance/comments/aa2knc/need_a_doctors_note_ok_now_i_have_the_next_2_days/",
        "comments": [
            "My old supervisor used to do this to me. I got viral pink eye (couldn't take antibiotics for it) so I called in 2 days in a row telling him I couldn't come in like this. He said \"put some raw meat on your eye and come into work. If you don't come in you better have a doctor's note.\" So I went to the doctor and they said stay out of the office for at least a week. Supervisor wasn't happy but he asked for it. ",
            "A \"Doctors Note\" is about the stupidest thing in the world. Your works wants you to visit the Doc, pay a copay, get the doc to write a note, then return to work to give them the note.\n\nI am an adult. My work requested this, one time only. I put the receipt for the copay on an expense reimbursement form, with the attached company policy requiring this.\n\nThey stopped doing it.",
            "[deleted]",
            "My SO just went to his dr yesterday for a UC flare up. They gave him 4 days off, when he is unable to take time off. Love it when the docs come through. ",
            "This absolutely fits perfectly here. Hey you did as you were told and your boss has to accept it. Enjoy your 2 days!",
            "I worked for a place that had the ability to give you an “occurrence”  if you didn’t give them 24 hour notice that you were going to be sick. Six occurrences was termination. Of course it was manager discretion. One coworker called her manager at 2am from the ER with her sick daughter just to make sure he had “some” notice. It was ridiculous. ",
            "I've done this. I needed to go see my doctor because my leg was swollen and work demanded a sick note. I was being bullied at my job too that morning for being slow because of the pain. \nDoc said I had a cyst, then signed me off Fu or 2 weeks because of stress, went back to see the doc after 2 weeks and got another 4. During this time I got time to submit a grievance about the bullying and got moved to a nicer location with a minor promotion and people got sacked ",
            "[deleted]",
            "Well done. This post and the comments really make me grateful for how my employer handles sickness; and there are a lot of people there who are very quick to complain about it!\n\nWe can “self-certify” for 7 days - any longer than that requires a doctor’s note. If you are sick for more than 4% of your work hours over the last 12 months, or if you are sick more than 4 times within a rolling months, you have a meeting with HR and they monitor you closely for a period after that. There’s more, but this is the basics, and I think that on balance, it’s a very fair policy.",
            "This makes me feel lucky that I live in a state that prohibits employers from requiring “proof” of illness to take days off. We also have “mental health” days as well as “sick days” but I’m not totally sure if that’s because of my work or state laws.",
            "My job had a policy like this, .... Until we told them if we are willing to work but you won't let us, then we are expected to get paid till we get released.  ",
            "If you work for someone who does not trust their employees and demands proof of illness, you might want to consider looking for a better job.",
            "It sounds like this actually worked as intended. If you're contagious, you shouldn't be at work. ",
            "[deleted]",
            "I qualified as having a disability when I got hired.  Things were fine for the first year until a supervisor put me on a job I couldn’t physically do.  He wanted a doctors note so I brought him one. I could work but my employer didn’t want me to so I spent about 6 months at home on short/ long term disability/FMLA.  I made more in a week than I would working 40 hours.  Honestly, it sucked ass!  I finally got my overtime back but it took filing with the EEOC to get it.  ",
            "Got bit in the face by a dog and had to go to the ER. Manager asked if I would be in the next day and if not, I needed a doctors note. Told my ER doc and she gave me a week. ",
            "Am (American) doctor. I hate when companies make their employers request doctors’ notes. Therefore, the length of the time I give my patient off is always the longest I possibly can. My patient improves faster, the company gets to eat a bag of dicks, and I have happily done my job :)",
            "I worked in an office setting for my first two years. I have chronic anxiety/bipolar almost to the point of agoraphobic violence (I've been in an institution and worked with to be in public while medicated etc etc). Well the office didn't exactly respect the \"I need a day off because of my disability\" (I forget what that's called..) so they expected a doctor's note anytime I missed. I had an anxiety flare up to the point of not breathing and being in the hospital over night. I called and let them know I'd be out til about 2 days from then. Manager (whom hated me since I proved I do her job better than she can) said if I didn't show up the next day with a doctor's note I was fired. I showed up the next day with doctors orders to have a leave of absence for a month (since my main job involved me handling customers which I was not hired to do) and I made sure to take the family lawyer with me. I took the one month off paid and quit since they did nothing but threaten to cuz me from that point forward (I know I should've waited until they did to get benefits and unemployment etc etc but not being able to eat or sleep because of the stress of having to go into that awful environment the next morning was unbearable). We also made sure they covered any medical issues caused by a job that was not within my title to even have. Now I do great with a retail job and extremely understanding management.",
            "I had this happen. I was in appliance delivery and had hurt my upper back. Being young and dumb i figured a day off and some ice would do it, so I asked my manager for the day after it hurt to move even a small appliance on a hand-truck. He said only if you have a doctors note. Went to the doctor, came back with a note for 3 weeks no lifting. Got paid full wages to be an extra passenger on deliveries and talk to the customers while other people did the work. ",
            "Any person at a modern job that demands doctors notes should question their decision to work for that company. Many times it’s the most authoritative, low paying companies that attempt to do this ancient system of checks n balances.\n\nThere are so many other jobs that actually offer leniency and benefits for human behavior, that there’s no need to give in to these controlling tactics.",
            "My last job started demanding doctor notes for sick days. At the time my doctor's office charged for notes so i informed them that unless they plan on reimbursing me for the cost then i wouldnt be bringing one in.  They got really upset but they got over it eventually. \n\nThe whole doctor's note thing is bullshit. Like what if you were seeing a specialist or a specific kind of professional that you didnt want your workplace to know about. Like it's easy to google doctor names to verify if they' legitimate. I wouldnt want my employer to know if i was seeing an oncologist or psychiatrist or some other specialty medicine doctor. ",
            "I love this. Similar thing happened to me. I had a very bad migraine and called out of work hours ahead of my shift. The manager on duty was okay with it, but the night manager was furious and demanded I get a doctor note. I had to spend $75 on urgent care for a piece of paper, that excused me for 4 days because of the new medication they prescribed me. \n\nI could have easily just taken the singular day off, but since they requested a doctor note, I took the 4 days. They scrambled for coverage while I relaxed at home. Sometimes having a power trip isn’t worth it. ",
            "Ooh ooh!!! I did something like this, too!!! I had “scheduled vacation time” that was rescinded after it was granted. It was for two days over finals my junior year of college. When I found I couldn’t have the days, because my boss knew I wouldn’t be out of town and another employee would and “needed the time off more” than I did, I wrapped myself in three sweaters and a scarf, avoided drinking water and sweated through the day, then went to a minute-Clinic type of place (the kind that does a urine dip, takes your temp and BP) where I told them I’d been vomiting. I was told I appeared to be dehydrated, and was found to have a slight fever. A doctor’s note later and I was home free. Thanks for the THREE days off, fam. My GPA appreciates you!! Ps: kiss my grits, boss!!",
            "This happened to me one time except my doctor ordered me to stay home for 7 days (turns out I had pneumonia), which meant my super rule abiding boss had to put me on LOA. (My company requires any employee missing 7 consecutive calendar days to go on LOA). This meant my system access had to be deleted, and it takes two days for it to be restored, so I was unable to work for 9 days. \n\nHonestly I was already recovering, but my doctor was being extra cautious because I have a history of getting pneumonia frequently. ",
            "r/checkmatemotherfucker",
            "I have done this and it’s super satisfying 😈",
            "Anyone else start reading the description to the tune of Supercalifragilisticexpialidocious?  Just me?  Ok.\n\n♫ *Super minor-^mal icious compliance, should I post this?   \n♪ Asking boss for time off work is something quite atrocious!    \n♫ If you ask him loud enough he'll always get ferocious!    \n♪ Super-minor-^mal icious-compliance-alidocious!*",
            "Not gonna name them but there is a major UK retailer that will actually fire you if you take 3 days off in a year for any reason.  Getting a doctor's note in the UK can be difficult too, it's not unusual to have to wait a week or more for an appointment, and even then unless you've been sick for a considerable amount of time, most doctors are reluctant to give you a note. It's all kinds of fucked up.",
            "All these poor people here. My work is like, “is that a sniffle? Go home, rest. Don’t come back tomorrow unless you feel 100%”. It’s an office job.  Not handling food or anything. ",
            "I had one in reverse. I've been working as a temp for six years now, so basically, no work, no pay. I had just started to pay my car insurance myself, so my income was necessary. I ended up going home early due to being short of breath and barely able to stand, even knowing I'd be good to go the following day, and my superior, who always had a vendetta against me, demanded I have to provide a note or I can't come back to work. In front of her, at 4 pm, I booked a doctor's appointment that evening, and came in the following day with a note saying I was cleared to return to work, but was not allowed to do anything that would put too much stress on my body. So she was pissy about me getting to be at work AND take it easy. Always loved pissing her off.",
            "My patient needed me to write a letter for his employer to show that he went to PT instead of getting the front desk to sign a thing or waiting for me to print out the daily SOAP notes after the fact (I did documentation at end of the day not during). \n\nI wrote a letter billing them for my time to type and print the letter and putting it in a sealed envelope.  Basically told them it’s not my job to write them a personalized letter each time when my priority is to help their employee be pain free and if they want a personalized letter each time instead of them making a sign in sheet or is giving them a copy of his check in sheet they can pay me directly. \n\nEmployers need to not waste people’s time. ",
            "as a boss, this worked like it should, assuming the Dr said you're contagious.  the intent of the note is two-fold:  one to make sure you're legitimately sick, and two make sure you don't come back and get other people sick, compounding sick days and lost productivity.\n\nI do realize the intent is lost of a lot of people, including managers, but in this case it worked as designed.\n",
            "My girlfriend did the same thing a couple weeks back, serves them right.",
            "This happened to me once. My boss texted me 30 minutes after I called in (for the first time in a year) and asked for a Dr note. Company policy was that one was needed after the third consecutive missed shift. I mentioned that. She was like \"I need one anyways\". I called my PCP and they couldn't see me for 5 days. I texted my boss back and was like \"I can't get an appointment for 5 days - so I'll see you in 6 days with my note.\"\n\nShe never even asked for my note. \n\nI'm a manager now and I tell me employees not to even say why they're calling in. Just \"I'm not coming in today\". I also specifically instruct the person receiving the call not to ask. Just say \"Ok thanks\". Seems to work well.",
            "My place does this but the reason for the note is to excuse all the days you take off off your record so you don't get penalized. They only want one if it's more than one day consecutively",
            "When my employer demanded notes, they got a note and I got a paid vacation. If I have to spend my money, I'm using my benefits.",
            "My company will count sick days against you, but if it's five or more \"working days\" it's a \"leave of absence \" which isn't counted against our statistics. So now everyone gets a cold that they might have taken one day for, go to the doctor, and get a week long vacation. Sick time is a joke",
            ">somehow it makes my malicious compliance feel that much better!\n\n&#x200B;\n\nNow that you **feel much better**, can you come back to work now?",
            "I had a dr years ago that would ask how many days you needed and write the note accordingly, he was great. ",
            "At my job you get a occurrence if your late or if you call in sick. So one day I was gonna be late (maybe 15 minutes)  I call my boss about 40 minutes before work and he said he would have to give me a occurrence, I told him no problem I’ll be using a sick day since if I’m gonna get an occurrence I’ll make it worth my while. Then he said don’t worry about the occurrence just come in lol ",
            "You are better than me. I caught a stomach flu and my company had a policy that if we were going to take a 3rd day we needed a doctors note.\n\nI was not about to drop a 75 dollar copay for a doctor to tell me to stay home and get plenty of fluids. I called in and my boss said come in or get written up.\n\nSo I am in and within 15 min puked in my waist basket. Caused 5 other people to sympathy puke and my team lead send me home for being sick.",
            "Are you me? Shit happened to me Wednesday. Went home early, boss freaked out and said I need a doctor's note. Turns out I got that note and it was for 3 days and my tonsils need to come out next week, so more days. I didn't intend on taking more time off than the last 2 hours of that shift, I just needed to go somewhere where I could cough all that shit up. ",
            "Very similar thing happened to me recently. I called into work not feeling too hot. I never take more than a day off but this time my boss said I needed a doctors note. I dragged myself to the clinic. The doctor said she wanted me out for a few days and asked how long I could take off reasonably. I said 2 would be fine. She was sceptical that i would be feeling well enough to go back by then. My boss wasnt happy but she couldnt do anything as we work in health care ",
            "Whenever I've gone to the urgent care or wherever and asked for a note they've always insisted I stay out longer than I originally intended. I like to imagine they enjoy giving the finger to overbearing bosses",
            "Oh man I've done the same. I ended up getting food poisoning and called in, and was told to get a doctors note or else I'd be in trouble. I didn't have insurance at the time and said \"eh fuck it fine I'll go\" and the doctor asked me what I wanted from the visit since by the time I'd finally crawled my way there I was completely empty and was starting to hold down water, and told him I wanted a note saying that I was to have 2 days off and to excuse my absence for that day. Honestly totally worth the long ass wait and the money spent as I was able to relax for the first time in ages thanks to it. ",
            "Tell your boss to fuck off, do not send his fucking employees in to the doc for a note for a fucking cold.  It takes away from someone who actually needs to see the fucking doc.",
            "my boss did this, they had to close the theater for two more days, so for three days.\n\nThe worst is they seen how ill I was, as I was present to a meeting. One of the person there, asked me several times over the next months if I was fine, see how ill I looked this day.",
            "Had exactly the same situation last month. Had a cold but still went to work. Decided around 14-15h that it was getting too bad to concentrate and I went home. I had already planned a day off the next day, so that would be enough to get better, I thought. The next day, on my day off, in the afternoon, my boss mails me that I need a doctor's note. I wasn't going to get an appointment that same day with a doctor on such short notice, especially for just a cold, so I mailed back that I would get an appointment for the next day, so I wouldn't be at work that day either. Went to the doctor, got a note for the day after that one as well.\n\n&#x200B;\n\nBecause my boss wanted a note, I got two more sick days instead of just missing 2-3 hours of work.\n\n&#x200B;\n\nBtw, the doctor's office had a poster asking not to come by for simple colds.",
            "I was fired while at the doctor's office. Had been sick off an on for about a year. Went to a bunch of specialists to figure out what was the cause. So, tons of doctor's notes and verification from hospital stays. Still, fires me. \n\nThen tried to accuse me of misconduct when I applied for unemployment.  Unemployment sided with me. \n",
            "Done the same. By law in my country we must provide a doctor’s note for 3+ days absence. I was away for two days, and on my return found that I had an email (to my work email!!) on my first day of leave requesting a certificate. \n\nNo problem I said, and immediately booked in with my doctor (on work time now too). I was still feeling crap, but I’d made it in anyway. \n\nWent to doctor, they gave me rest of week off too. So work now lost me for five days instead of just the two I was absent originally. Plus, and this was my favourite part, I then got to make an expense claim for the full cost of my doctor visit etc. See, legally they can request a med certificate anytime, but prior to 3 days absence it is at the employers cost. ",
            "Place I work at gives you “duvet days” specifically to counter this. \n\nThey come out of your usual annual leave allowance, but you get five days a year where you can just call up on the day and say “I’m not coming in” and there’ll be no questions asked.\n\nThe flip side of the deal is that you _have_ to come in the next day. Works really well to give people who’re just a bit run down time to recover without opening the doors to an actual sick absence. ",
            "I am convinced that some doctors when a grown working adult comes for a doctor note because they left early just write some extra days just to fuck with those who demand a note from their employees. It is a waste of time for everybody involved.",
            "Did the same, got the same outcome. Winning!",
            "Probably some maliciousness on the doctors part too, they're getting sick of this bullshit as well and are intentionally being generous with how much bed-rest they \"prescribe\" to try and get these employers to fuck off and stop wasting time and money, and endangering public health.",
            "Fantastic. Glad you got a couple of extra days off to enjoy getting better.",
            "I had something kind of similar, but not really, happen to me. I was student teaching (not paid) and got sick. Think vertigo. Could not even lay down or stand, had to rest propped up for days. Anyway, told one of my master teachers and he was cool. Told me to take however much time I needed off. The other master teacher? She demanded a doctor's note and reported me to my credential program for taking time off. Bitch, how do I get a doctor's note if I'm working for free here? I don't have insurance. SMH.",
            "I work at a call center in Mexico and being sick and not being able to talk is literally the worst thing that can happen to you. Since we use our voices all day if we get sick we do have to go to the doctor but doctors here at our healthcare for employees don't give a shit about it and don't give days off for that and we're at work not being able to talk.\n\nAlso here after 4 unexcused absences your out. Also, if you want to leave early because you're sick the on-site nurse had to see you first and say you're in bad enough shape to leave. \n\nLeave work early and that's work avoidance and a reason for termination. ",
            "Not sure if this happens elsewhere but in sydney a decent amount of chemists offer doctors notes for $20.\n\nI think this is to try and reduce wait times at GP's when it comes to \n\n*\"I dont feel like going to work today, I need a doctor's note\"* \n\nvs \n\n*\"I feel too sick to work today, I need a doctor\"*",
            "My boss did this to me one time, now every time I have to go to the doctor, I take two sick days no matter what.",
            "This is my favourite type of malicious compliance - short, sweet, and petty. Well done!",
            "Same. Ended up being off for 2 months",
            "As a doctor, stop fucking sending people in simply for doctors notes. It’s not my job to cover your ass.\nIt’s a waste of my time and the simple fact is that it’s a health risk - the patient should be resting, not exposing the rest of my office to illness.\nObviously if sick enough to need to come is different",
            "I had to go to urgent care this week, and the doctor asked if I needed a note, I said nah they’ll believe I was here or if anything I can show them my copay receipt. The doctor chuckled and said ah, you work at a place that treats you like an adult. \nThere may be a lot of bullshit stuff I deal with at work, but thankfully seeking medical care isn’t one. ",
            "Wish more people maliciously complied when sick, often times you can even get work to expense the copay. \n\nThen they'd stop pulling this shit on us.",
            "I worked at Outback Steakhouse almost full time during nursing school. Woke up one morning puking my guts up, and when I had nothing left, I was dry heaving. Then I had diarrhea. I called in for my double that started in an hour, and my manager asked, “So are you going to find someone to cover your shift?” I replied that I was a little busy puking to find someone in an hour. Manager demanded a drs note, and I got a week off. Got over the stomach bug in less than 24 hours and made an A on my exam I finally had time to study for. ",
            "My boss use to do this to me. \nA few times I didn't bother with the note because he had seen how sick I was, he would be mad and not give me my sick pay. Now whenever I'm sick I go to the medical centre and they always give you an extra day or so just to make sure you don't have to come back whilst sick. \n\nHe hates this so much more, insists I just take the day but I tell him I better get that note just incase. ",
            "Saw the same situation on here 2 weeks ago.",
            "I understand doctors notes are supposed to prevent people from faking illnesses, but when I'm sick from the fucking flu I'm too fucking sick to go to the doctors, contaminate everyone in the waiting room, and go back home. That would just set me back many more days of recovery. Please just accept that people sometimes get sick, and let them use their sick days in peace.",
            "America?\n",
            "I'm military. Depending on who your supervisor is, they may make you go to the doctor if you're sick or asking to go home. As a supervisor, I have a \"first day free\" kind of policy. If you tell me you're sick, I will send you home or tell you to stay home that first day. If you're still sick after that, you have to go to the doctor. ",
            "So my friend is a doc, when my manager doesn't allow me to take leaves and pull this crap, I call up my buddy and send a note and enjoy a week off. This is amazing feeling that I get to take a break for a week and stay home",
            "Germany: this is the policy in a lot of companies. Dr wont write only one day.",
            "I work at a factory. Even with a doctor note you get a point. If you're off more than  one consecutive day with a note, it's only one point. But still.. if I have to go to the hospital I still get a point.. It's ridiculous.",
            "I got fired for something similar once. ",
            "One of my last workplaces did this. You don't get a doctors note for one day off. I think it's something like a week.\nI'm married to a doctor, and most of her friends are doctors. When my work got anal about time off, I could pretty much get a note for as long as I wanted 😂",
            "[deleted]",
            "Man, I'm glad my manager actually thinks these things through; Boss was a major asshole, manager was a great dude. I came down with a fever, left halfway through the day, with approval from my manager. Boss angrily called me saying I'd better come back with a doctors note. So I book a doctors appointment, and get diagnosed with whooping cough. Nothing to serious, and I should be back at work within a week. I call my manager, tell him the news, and he insists that although my illness isn't that bad for me, he can't risk having me infecting a colleague with a newborn infant at home, and promptly gives me the month off. ",
            "I wouldn’t be so quick to judge the boss for the policy. Most likely it is because the workforce abuses a more relaxed policy. I once was a supervisor at a call center with a. Lot of other college students and high school students. You wouldn’t believe the reasons people would call in. Then people would get upset when we put the hammer down.\n\nAt any rate, enjoy your two days off! Hopefully it’s enough to get rid of what ever ails you and go have some time to relax as well! ",
            "Maybe if people were allowed to live their lives there wouldn’t be people who abuse sick leave and vacation time.",
            "I did the same. Only worse. I was working in IT/sales and my team had a client presentation coming up for a multi-million dollar contract. My work (the entire presentation because the supervisor did exactly nothing and took all credit) was finished . Every report , every number, every code,  verbatim speeches etc. Was stored in password protected files on my desktop . The company was a stickler for security protocol and firings for violations were made clear from  day one. I had a precleared doctor's appointment on a Tuesday and needed to leave  take a long lunch and return to work   Supervisor demanded a doctor's note( not necessary when prescheduled and cleared ) Then tried to dump extra work on me to bully me into not going. I finished and went. The doctor wound up ordering a test that meant I would need the rest of the day off  . I called, supervisor bitched me out etc. As I was hanging up the phone I heard her make a snide comment to another worker about me. Really? Doc suddenly \"discovered\" a reason to give me the rest of the week off. Naturally I would not be available for the presentation and the team had done zero work. Supervisor called demanding my passwords.... I told her hold on, secretly conferenced in the HR director .... after her demands I interrupted and told the HR director I would be happy to send him copies of the entire presentation . Yes. She was fired and escorted out. I just wish I'd not been too \"sick\" to be there to watch. ",
            "When I had this problem with the first job that required a doctor's note I just went to the doctor and got one.\n\nI then went to my campus library and made as many copies as I could for $1.  I just took whiteout to the dates and wrote them in myself.\n\nI only used three of the 20 or so I made, but I had them in my glove compartment in case I needed them.\n\nAs a side, one of those times, I chewed on my hand during my drive to work. When i got to my bosses office it was really swollen and marked up by teeth.\n\nI exclaimed to them \"I got attacked by a wolf or something! I really need to leave!\"\n\nHad a doctor's note for it, HR probably had a good laugh.",
            "My husband had pnemonia once and had to call in sick and they forced a doctor's note. The doctor was so annoyed by the policy he wrote a note for 2 weeks off and told my husband enjoy the break.",
            "Not sure about where you live, but here in South Africa you only require a dr’s note if you are sick more than 1 day, if you are sick on a Monday or Friday, day before or after a Public Holiday or if you have been sick in the last 8 weeks.\n\nWe still get the same cases as yours where a boss tries to pressure you to work while sick to avoid having to pay dr’s bills, end up losing the employee for up to a full week because of it. ",
            "My dad worked at an outfit that had a nurse on duty, on premises. You came to work, went to the nurse and proceeded from there. That's where we got our childhood immunizations from too. After the shot she removed the needle and we got to keep the syringes to take home and play with. Sometimes we got dosed with sugar cubes. ",
            "I love this story! \n\nI have to get a note at my work if I'm going to be out more than one , I need a note. I hate doctors , nothing against them just never went except for vaccines as a poor kid so I was always incredibly anxious and avoid them, health be damned.\n\nI had rib pain since friday which I had thought was a pulled muscle and didn't think I could work so I went to a clinic. I got medicine for a pulled muscle and left with a doctor's note for a couple of days. During the next two days I felt a little better, enough I could cough, but now I was coughing up some blood. I went back just before I had to go to work and mentioned it. I got an x-ray and they gave me medicine for pnuemonia and another note for the rest of the week . \n\nVery next day I get a call from the doctor I saw on Sunday, he tells me to come in immediately for  blood test. I don't know what's going on and I don't really want to go but he tells me he thinks it isn't pnuemonia. He changes his mind and tells me he is calling ahead to get me a scan at the hospital and go there. I'm still wondering what's going on but I go.\n\nTo make an already long story short, I spend three days in the hospital for both lungs having blood clots. I go to work a week later. All because I had to get a doctor's note. ",
            "My husband’s boss refuses to pay sick leave if employees take one day off and don’t have a medical certificate. In Australia I’m almost certain you don’t have to produce one unless you’ve been ill for two days.  It’s ridiculous because it’s so fucking hard to get in to see a doctor on the actual day my husband takes off.  Seems so suspect to me. ",
            "O had a really bad back injury one time. My boss asked me to get a med cert saying I could only work light duties. My doctor decided I shouldn't be working at all and I ended up with 2 months off.",
            "So many stupid supervisors in the world. There are plenty of exceptions to when this make sense but for anything like retail or office work, the cost of one less employee for a day to recover (whether its from illness) is far less significant than the loss in productivity by half your workforce nursing colds for a month. And those employees that have just recovered will typically thank you by working extra hard.",
            "Doctors hate this shit and appear to LOVE giving you MORE time than you need to punish your idiot company.\n\nSo go get notes all you can... some day the companies might figure out their stupidity.",
            "Legally employers can't require a doctor's note to return to work unless you've missed three consecutive full shifts per the Americans with Disabilities Act. (obviously pertains to just America, so if you're elsewhere disregard this)",
            "i can only call in sick to work if i have a note stating i went to the EMERGENCY ROOM for my symptoms. like, have a stomach bug and are contagious to customers and employees alike? have to go to the emergency room, waste nurses and doctors time to say that i can't go to work....which is obvious when i'm shitting myself.  ",
            "Jobs are such assholes about being sick. I recently got really sick (trip to my Primary care and the ER after) and had to miss 5 days of work. I had exactly 5 sick days so I used all of them. I also made sure to get notes from both my doctor and the hospital that I was ill and couldn’t return to work. My job placed me on probation for abusing sick time and using up all my sick time at once. I’m not really sure why I have sick time if I can’t use it like in this recent case. I’ve never been written up or placed on probation here or at any previous jobs so this was shocking. Needless to say I am looking for another job because this is some toxic environment. ",
            "No",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/itoldyouiwassick] [Need a doctor's note? Ok now I have the next 2 days off](https://www.reddit.com/r/IToldYouIWasSick/comments/aommty/need_a_doctors_note_ok_now_i_have_the_next_2_days/)\n\n- [/r/itoldyouiwassick] [Need a doctor's note? Ok now I have the next 2 days off](https://www.reddit.com/r/IToldYouIWasSick/comments/aqrsf3/need_a_doctors_note_ok_now_i_have_the_next_2_days/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*"
        ]
    },
    {
        "post_id": "koq6by",
        "author": "SpaceKnightLife",
        "title": "Called the police over a burger",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/koq6by/called_the_police_over_a_burger/",
        "score": 13903,
        "num_comments": 1000,
        "created_utc": 1609559484.0,
        "selftext": "I will try to sum this up the best I can so it isn’t long. I got off work at about 11:48 PM on New Year’s Eve, went on a really long date that ended sad, and went to get dinner at 4:20. I ordered a burger at a burger place over their app and paid for it that way, so it would be done when I got there. I get there and the women is very confused. The manager is brought over and he laughs in my face saying,” well your problem is that we are selling breakfast.” I told them about how the app, website, and google says differently and they didn’t care. I sighed and asked for a refund which the women said,” nope. Can’t refund, sorry.” After some back and forth I said,” fine, then I’ll call the police.”\n\nShe replied back with,” Do it.” Now I wouldn’t call the police over a cheese burger, but mine had bacon. I called the non emergency number and a police car came over.... then another. When they pulled up I realized,” I just called the police over a damn hamburger.” \n\nEnd result, I got basically a slip to come back any time the next day for free lunch which I just finished eating.",
        "permalink": "/r/MaliciousCompliance/comments/koq6by/called_the_police_over_a_burger/",
        "comments": [
            "Cops were called over a burgerlary!",
            "So they wouldn’t even switch your order to something on the breakfast menu? Or wasn’t that an option for you?",
            ">Now I wouldn’t call the police over a cheese burger, but mine had bacon.\n\nThis is the quote I've been looking for and had no idea.\n\nMy life is complete. Where do I go from here?\n\n*walks out to a waterfront and sits on the beach quietly*",
            "Hope you watched them out your burger together!",
            "This is hilarious. Like granted what the burger place did was steal from you a real crime\n\nI find it hilarious that the police sent more than one car lmao",
            "And people dissed me for [going to court over a $5 traffic ticket](https://imgur.com/gallery/7VQR9A2): This, I just would have escalated to their corporate office, and, if nothing came of that, taken them to small claims court.",
            "“We’re responding to the 911 call about a burglary?” \n\n“Yeahhh... It’s actually about a burger”",
            "This reminded me of the time I had the cops called on me over a bowl of soup. Copying this from my Yelp review:\n\nTL/DR -- I've eaten here several times and the food is good. So why the one-star review? Because I had the cops called on me over a $12 bowl of soup that I did not order and did not eat.   \n\nHere's the whole story:  I went to Pho Huy for lunch today and ordered the N5, which is a vermicelli bowl with chicken. I asked for extra fish sauce, and the waitress nodded and wrote that down.  The waitress returned a couple minutes later with the accoutrements for pho -- basil, sprouts, lime,etc. I told her then that I ordered vermicelli, which does not come with that stuff. She said it was too late because she thought she heard me say P5, which is pho. I was puzzled.  \n\nShe came back a few minutes later with a bowl of pho. I said that wasn't what I ordered. I'm not a jerk though so I considered just eating it anyway but when I found out it had \"soft tendon\" in it I said no. (That's standard Vietnamese food and I'm sure it's fine but I'm not that adventurous.) I didn't want it. I asked her to bring me what I ordered and she refused. She said she could pick the soft tendon out of it but I was like, nah. I just want what I ordered. \n\nShe would not bring it to me.   \n\nI said, \"Okay. That's ridiculous but fine. I'm just going to go to Chipotle next door,\" and I started to walk out.  That was when the owner yelled across the restaurant that I could not leave without paying. I told him I was not paying for food I did not order and did not eat. A big scene ensued. I told him he could call the police if he wanted but that I was not paying.   \n\nThere was a bunch of commotion and the male owner went in the back with the waitress to supposedly \"review the video\" of me ordering. I heard him screaming -- absolutely screaming -- at her and felt really terrible for her.  Meanwhile the female owner came again to tell me I had to pay and I said I would not.  \n\nThe owners' teenage daughter came over to talk to me and she completely understood my point. She said the waitress is new and obviously screwed up the order because she had written down that I wanted extra fish sauce, and that definitely does not go with pho so it made no sense. Anyway, the daughter understood that even if it actually had been my mistake that's not the way to treat a customer.   The daughter tried to do the right thing but her parents would not let her. Her father ended up yelling at her too. She seemed used to it and it didn't seem to bother her. Poor girl. She even tried to make the problem go away by saying she would pay for the soup with her own money and tell her parents I had paid for it, but I wouldn't let her do that. She is a sensible, reasonable girl who really tried to smooth things over. (Five stars for her!)   \n\nSo two cops showed up. They interviewed everybody -- with straight faces, which was really amazing. They called a supervisor to find out what to do and then explained to the owners that I did nothing wrong and did not need to pay. Yup. I knew that.   \n\nHere's the saddest thing about it: I really liked the food there but I will never go back. I was a semi-regular customer too. I visit about once a week, so they lost all that business because they wouldn't eat the cost of a $12 bowl of soup.   Bye-bye Huy.\n\n\n\n\nhttps://www.yelp.com/biz/pho-huy-alexandria-2?hrid=MmU99hXcljpcF_NrZQoDrQ&utm_source=ishare&utm_content=review",
            "Well you did say you ordered at 4:20 so I guess you reeeaaalllyyy neeeeeded that bacon man",
            "[deleted]",
            "> slip to come back any time the next day for free lunch \n\nyou mean the lunch you already paid for, it wasnt free",
            "To be fair, you ***did*** call the non-emergency number and the dispatcher ***did*** choose to roll a unit. Probably, they were hungry anyway.",
            "\"Now I wouldn't call the cops over a cheeseburger, but mine had bacon\" might just be the best line ever. 😆",
            "I didn't call the cops, but I had a similar situation, in that I was sold something they didn't have.\n\nI went into a taco bell and ordered food and a drink, they brought my food and my cup, I went to get some delicious Baja Blast, (which is the best pop ever. Fight me.)\n\nAnyway, I put the cup under, nothing comes out except sightly green water. I try a few others, nothing.\n\nI go up to the counter, and ask \"Hey, your fountains are down out here, can you get me some baja blast?\"\n\n> Sorry, all of our fountains are down.\n\n\"Uh, but you just sold me a drink. Do you have any sweet tea?\"\n\n> Nope, all out.\n\n\"Do you have anything to drink?\"\n\n> Nope.\n\n\"You sold me soda knowing I couldn't have any?!\"\n\n> Doesn't sound like my problem.\n\nAnd he had a shit eating grin of \"what are you gonna do?\" I was understandingly fucking furious, not over the soda, but the sheer shitiness of his reaction.\n\n\"Then I'll fucking make it your problem.\"\n\nAnd I leaned over, poured the entire extra large cup of sightly green water on the ground behind the counter, and left.\n\nI was much younger then, I'd never pull that stunt now, but overall, fuck that guy and his attitude.",
            "[removed]",
            "Volunteer EMT, not a cop, but “stupid” calls like this break up the monotony and usually wind up being great stories to tell around the table later. Especially true for cops who don’t have a station to hang out in. When I was in the Army, I learned to ride my motorcycle in the barracks parking lot at night. Some duty NCO didn’t like it and called in me and a buddy for “racing”. We eventually had eight MPs respond, including the duty lieutenant and the traffic investigator. They knew we weren’t racing (they watched us for about ten minutes from down the street) but came over to shoot the shit and talk about bikes. Neither my buddy nor I had our licenses, so at first we thought we were screwed, but the MPs told us they appreciated us learning to ride someplace safe since the traffic investigator, in particular, had worked some nasty crashes involving newer riders.",
            "Here is some unsolicited advice for next time.  \n\nAsk the manager how the situation can be \"made right\".\n\nIn my experience this almost always gets me a solution I can live with.",
            "So the way she said it was absolutely rude and disrespectful, but as someone who both orders a lot of food through apps and also has worked at several different places that have apps i can tell you that they most likely actually arent able to give you a refund. Its because you have to go through the app for the refund because technically you did not pay that restaurant but instead paid the app.  It has a different refund process because if you just went to the location and got a refund from them then their register would actually be below what it should be.   Now this wont be at every single restaurant in existence, in fact its generally only going to be in fast food chains, but this is one thing to look out for.  If they wont give you a refund make sure to inquire as to why before getting pissed at the worker, unless of course the worker (well manager in this case) is being a total twat",
            "Usually one would take this up with the bank or credit card company.\n\nNext time, consider [disputing the charge.](https://creditcards.usnews.com/articles/how-to-dispute-a-credit-card-charge)",
            "You're brave eating there again. I'd be too afraid they'd spit in my burger.",
            "Sometimes you just need a little patience and understanding to get what you want, even if you’re not at fault for the situation.\n\nI ordered a meal via app that the joint ended up being out of. They didn’t tell me, just handed me a bag with napkins and condiments and no food. When I came back to ask them about it, they said they were out of the ingredients for that meal, but their system wouldn’t allow refunds on app purchases. I could order something else of equal or lower price on the menu, but unfortunately food allergies meant the particular meal I ordered was the only thing available I could actually eat, so that wasn’t a solution.\n\nI felt like the fact that they’d tried giving me a bag of napkins and ketchup without mentioning the food was missing entirely gave me grounds to be snippy, but I could tell the kid was nervous and just doing what he was told, so I just smiled and asked, “Well, what other options are there? Would it be okay if I got the amount put on a gift card, instead?”\n\nTurns out, their system also requires a minimum on gift cards that my order didn’t reach, but because I’d been nice, the kid’s manager gave me back twice as much as I’d spent for the card to reach the minimum. But if I’d decided to be angry (even if rightfully so), I likely wouldn’t have gotten anything out of it. Other than anxiety, of course.",
            "Here’s hoping they didnt spit in your food!",
            "Prolly couldve done a chargeback and got your money.",
            "I would still contact corporate about the issue and get more free coupons.",
            "> Now I wouldn’t call the police over a cheese burger, but mine had bacon \n\nThat's reasonable.",
            "Upvoting for the \"Now I wouldn’t call the police over a cheese burger, but mine had bacon.:",
            "They tried to steal from you. So you have every right to call cops on them. This is your consumer right. If it was my country, we could drag them to court. Mobile court. Not only that, if they did this more than one person they would be fined and we just needed to testify against them get 25% of the fine.",
            "Well done. Some of the most annoying customer service failures are the more pretty ones. Because, who is going to the trouble needed to get it fixed for the petty sum involved? And they know that. \n\nI once brought one of the kids a toy guitar from one of those shops that stock cheap stuff from China.  Honestly, I didn't expect it to last, but we didn't even make it out of the shopping centre before it broke.  I mean - come on, it's unsaleable rubbish at that point.",
            "My idiot brother called the Police because Mum put some cauliflower in his white sauce. He was about 8. He is still an arsehole",
            "All the cops came, worst case scenario they deal with some shit.\n\nBest case, they get burgers.",
            "interesting, I had a similar encounter in a fast food place, where I ordered a lunch item during morning hours through their app. the staff was pretty cool with me and said that they can either refund me and i can order from the breakfast menu, or they can make me the order but it will take 20ish minutes cos they need to defrost the ingridients. I opted for the 20 extra mins cos i was going for a shopping tour before christmas, and just went to check out a few stores and returned 15 min later for my food.",
            "“Does this taste like spit to you?”",
            "You must live in a nice city that the police respond at all, especially to stuff like that.",
            "It involved bacon. Enough said.",
            "Is this supposed to be funny...?\nUsually if you pay an order through an app the employees themselves can do nothing about it and the refund is issued through the app itself",
            "It's their fault for being idiots. I can't be bothered to waste money on meal that I'm not going to receive, so you're not the only one. I'd call the non-emergency line too. They're stealing casually if that's a habit of theirs.",
            ">Now I wouldn’t call the police over a cheese burger, but mine had bacon. I called the non emergency number and a police car came over.... then another. When they pulled up I realized,” I just called the police over a damn hamburger.” \n\n You called the police because they stole your money. Whether its five or five hundred dollars doesn't really matter. \n\nThey fucked around and found out. Hell I'd have complained to corporate about it too. Fuck them and their shitty attitude.",
            "Where do you live that cops have resources for this?!",
            "[Did you ask the police to enforce your western bacon cheeseburger?](https://youtu.be/FZ12Ry-hD6I)",
            "Hamburglar",
            "Has no one made a hamburgler reference yet?",
            "Sounds like it wasn't over a burger, it was over the business stealing your money. \"Nope, we're not actually selling those now, no you can't get something of equal value and no you can't get a refund\"  \nSteal my money? Get the cops called. Simple.",
            "You could try to get a refund through the app you were using. Or ask your credit card to issue a refund. This has the added benefit of dinging your burger place, because if they get too many customers requesting chargebacks, VISA can decide to cut them off, hurting their business.",
            "Bro their gonna wipe their ass with ur burger",
            "So you called the bacon over some bacon? I'm glad they uphold the law when it involves their own.",
            "You paid for goods, were refused said goods, and were not offered a refund. That's theft, you were justified. I'm sure the police where probably chuffed about responding to it, but you were still justified.",
            "Charge back",
            "At 4:20 eh?",
            "Okay...I need to rant because this post me feel sooo much better. We live in town and have a large hill in our back yard, which seems to be of special attraction to unsupervised children who want to sled in winter or roll down it during the summer. They do not ask for permission, I don’t know them or their parents or which house they live in. They are rude/entitled when we ask them to leave. They are loud enough to wake me up from a nap, we can’t let our dogs out while they’re there, and they have even shown up while we were hosting family get togethers. It’s general it’s super annoying and somewhat of a liability.\n\nWho just lets their kids just wonder around in this day and age...especially when there have been all kinds of break ins, thefts, etc around us! I supervise my dogs better than they supervise their children, which is actually really sad when I think about it. \n\nAnyway my point is...if you can call police over a burger, maybe I shouldn’t feel bad about calling them over this! Thanks for letting me rant!",
            "The apps just suck. I’ve had people order products that we either don’t offer at all, or at that time of day, through the app. I always try and refund the customer if they arrive in person, but if they order via delivery, they need to do it through the app.",
            "Well you can only have so much bad luck. Bad date, wrong menu, voucher for shit breakfast food. You got all the bad out go on another date to a really good place ( that might have burgers ).",
            "Wow you still ate their food after all that? You have nice trust",
            "“Now I wouldn’t call the police over a cheese burger, but mine had bacon”, dammit.",
            "Was this really MC though? She basically just dared you to do something and you did it.",
            "Restaurants deal with A LOT of shit they shouldn’t have to deal with. But if you aren’t trying to help a customer resolve an issue like this, you deserve the repercussions. I say, good for you for not taking their shit.",
            "Waste of police time.",
            "I love how it was the bacon that pushed this one...step...further...",
            "Imagine wanting to have sex all night and the idiot (him, not you)  plays magic the gathering for 2 hours instead. And then    a restaurant tries to steal from you. \nIts so dumb because when you work in fast food you can get away with a lot. I used to get free food all the time. Its not like they couldn't have offered something else or a voucher with out the cops having to arrive. I think they got what they deserved honestly. Hopefully the cops were having a slow night.",
            "Honestly, you didnt call the police over a burger. You called the police because the business quite literally stole from you in front of your eyes",
            "To be fair, you called the police over theft since they wouldn't give you your money back. I wouldn't feel bad at all about this.",
            "No, you called the police over theft.  If they said they couldn't make it but had something else that you wanted or offered a refund then you'd have called over a hamburger.  The fact that they flat out refused a refund, and they didn't even want to make you an alternative let alone one you wanted makes it blatant theft.  Chances are good the staff wanted to just process the refund as cash after you left and put it in their own pockets.  I rarely ever consider \"complaining to corporate\" but this is a time where you should.",
            "This was a waste of police time and resources. \n\nWhen people do this, We don’t even respond.",
            "I mean.... I don’t think you did anything wrong \n1) the restaurant stole money from you.  They didn’t give you the product you paid for.  That requires the police. \n2) It was the non-emergency number.  So you weren’t wasting police time.  You didn’t misuse resources.  If they has been busy, they wouldn’t have come.  They be handling emergency calls instead.  Clearly they had free time, so they came.  During busy times, I’ve waited 6+ hours for police to come when I called the non-emergency number.",
            "I was going to say how absurd this is and how much of a prick you are until you mentioned the bacon. All is justified. I would’ve done the same.",
            "I like how \"Karen\" you were over this and how you are totally self-aware. Truly malicious. Love it.",
            "I work for a police department (not an officer). Citizens like you are why I hate the public sometimes. You try to use the police as a threat because you are unhappy with a service.  You not getting food you ordered is a CIVIL matter. Sue them in court. But don’t take up the time of the police who could be going to other calls because of stupid shit like this. Smdh. I’d be embarrassed to even post this.",
            "He wants his[cheeeseburger](https://youtu.be/CmIKR458M0A)",
            "I read that as \"called the police over a burglar\"",
            "Most fast food managers become quite compliant once you remind them of the flat $50 chargeback fee visa charges no matter how small the original charge was. Dominos mostly gives replacement order plus another 5 topping large until the decide you are a serial complainer",
            "This is actually a pretty common scenario. I get calls like this about once a week. It’s really not a big deal for us. OP did the appropriate thing by dialing the non-emergency line. Typically what will happen is we’ll dispatch an officer who will then talk to both parties, obtain any evidence available(I assume OPs order confirmation) and tell the proprietor that they’re boarding on fraudulent activity if they don’t comply with the confirmed order or otherwise compromise. Have never seen them maintain their hard no stance and will bend to the consumer in situations like this. It’s simply not worth the cost of a legal battle.",
            "Well I mean they did steal ur money",
            "That free lunch will 100% have spit in it.\n\nNever take a free meal in exchange for an error. You paid for a service. They didn't give you that service. You shouldn't pay. Always get your money back. That way it is *your* decision to return, not theirs.",
            "Most apps only send a pre-authorization for the total or charge once you're there or ready to pick it up. But I commend you for the principle.",
            "Lol in the future you can just dispute the charge with your bank",
            "> Karen harasses fast food workers at 4 a.m. on new years day and wastes tax dollars over a burger, brags about it on reddit, 11k upvotes\n\nAmazing",
            "Happy cake day!",
            "The story is funny but I can’t see the malicious compliance",
            "“... but mine had bacon ...” LOL. \nI wouldn’t forgive either.",
            "“Now I wouldn’t call the police over a cheeseburger, but mine had bacon “. \n\nLOL. Cracked me up. I needed a laugh. Thanks.",
            "I mean...... it did have bacon",
            "That sounds like a hard night, I’m sure I would’ve done the same...I mean...bacon",
            "I’m sorry how is this malicious compliance? She didn’t ask you to do something. You threatened the cops and she tried to call your bluff. But that’s not malicious compliance.",
            "At least you didn't go all \"Falling down\" on them lol",
            "Okay what app did you use? Usually you have to go through the app/customer service for any kind of refund.",
            "I don’t see why they wouldn’t refund if they didn’t even make your food. That’s dumb",
            "Don't play coy, say the name of the chain, if this story is true of course.",
            "Props to you man. Refusing the refund was basically theft. Way to stand up for yourself, trite as it may have felt.",
            "Serious question. Why can't these places just throw a burger on the grill? Shouldn't take more then 8-10 mins to make him a fucking burger?",
            "It wasn’t inappropriate to call non emergency since they took your money and didn’t give you anything. It’s an issue with the app, not the individual store, but the store manager was still in a position to make it right and refused. \n\nYou could have waited and called corporate and complained and they probably would have got you a refund or something. Or you could have called your bank or credit card company and asked for a chargeback. But you have no obligation to inconvenience yourself further when they promised a product and then took your money.",
            "This situation should have required at least 3 patrol cars to come up",
            "well, at least you're not Michael Douglas, it could have ended really worse",
            "I would have just asked for a breakfast meal of equal value.",
            "NTA - Well at that point it’s not one of those “they’re not making my food the way I want it” sort of viral things. It’s now theft. They took your money.",
            "Don't know how you paid but if you paid with a credit card you can just call them and have the charge reversed, which will cost them more than the refund.",
            "Were there drugs involved? I ask because of the very specific time coding in the text narrative.",
            "A dramatic pause would be “the bad side is... I hate that place’s breakfast”. They just stopped speaking mid sentence and interrupted the flow.",
            "“...but mine had bacon...”",
            "Definitely shitty business practice, but what a fucking Karen move.",
            "You know cops have better things to do right?",
            "[deleted]",
            "Technically you called the police for theft if they didn’t provide the goods you payed them for",
            "Totally reasonable to do that. You paid for something you didn't get. They should have refunded you or come to a compromise acceptable to YOU. Which eventually they had to anyway. \n\nYou can write it off as one of those things and just not go there again, but you don't have to.",
            "This is the worst post I’ve read on this sub in a long time. You were a Karen of epic proportions and it’s not even malicious compliance. YOU said you’d call the cops, she said “do it”, so you did. That’s not maliciously compliant, it’s just compliant, and it was your idea in the first place... I will give you a pass because it came on the heels of a sad date on NYE, I know emotions were probably a factor, but you never want to go full Karen.",
            "Happy Cake Day! 🥳🎂",
            "I'm confused about this timeline. So you got off work right before midnight and *then* you went on a date?! And after that you went for dinner again at 4am?",
            "You had me at Bacon......",
            "As someone who works in fast food i would totally understand if someone called the cops on me if I told them I didn't feel like making their food and no I wouldn't be giving them a refund cause thats literally theft \n\nMy location serves both breakfasts and burgers all day (including the plated ones, other locations don't do plated all day because it fucks up the service time) and whenever a customer orders a burger in the morning or a breakfast item in the afternoon or overnight or whenever some of my kitchen staff get SO MAD. I dont understand why cause its not like most things take that long to cook or are that hard to put together. The 3 oz patty on most burgers takes 2 minutes to cook on our (clamshell) grill. There's slight frustration with chicken orders because those take between 3-5 minutes in the oil depending on what item it is and we're supposed to have orders out in 3 minutes or less but hey.. better to have a customer return because we gave them a fresh lunch item in the morning then to just be like \"absolutely not how dare you even ASK for a burger at this burger place. Fuck you. We are not returning your money\" lol\n\nSorry for the tangent I just wanted to cement how much of a dick that manager was being because cooking a burger in the morning really doesn't matter like its fine, it barely disrupts anything else",
            "Well as stupid as is it, they’ve stolen money from you... so?",
            "> Now I wouldn’t call the police over a cheese burger, but mine had bacon.\n\nAt least your priorities are straight. Bacon trumps all.",
            "\"I wouldn't call the police over a cheese burger but mine had bacon\" fuck. I've never related to anyone like this",
            "A Karen in the Wild",
            "What a fuckin waste of police's time. It's people like you who are the worst. Sure, they made a mistake by letting you order a burger but if you paid via app, the refund goes through the app. Make a complain or leave them a bad review but 2 cop cars over a fuckin burger?",
            "Why would you call the cops over a 5$ inconvenience. I get it sucks but grow up for goddsake if this is real. I guess you don’t have to worry about police killing you or manhandling you. As someone who’s worked in food service for over ten years, I can’t imagine",
            "Your a arsehole. That's why your date ended bad.",
            "You didn't call the police over a hamburger...\n\nYou called the police over a fraudulent business who just scammed you out of your money. \n\nYou tried being reasonable and explaining the app and asking for a refund and they refused.\n\nI would have done the same thing.",
            "The sheer amount of stupidity in this thread is out of hand. The restaurant literally can't refund something ordered over the app, and to call the cops over something like this is some serious shit only white people do. And I'm white. OP is an absolute idiot. I would've just shrugged my shoulders, ordered a breakfast item, and then requested a refund through the app later. Imagine getting this bent over $5.",
            "Tldr,  op is a karen",
            "Automatic MC boy: Your user name has now been changed from u/SpaceKnifeLife to u/SpaceKarenLife. \n\nCongratulations, you have reached level 67 of Kareness. \nFor level 68 please repeat but shout loudly “You will hear from my lawyer” and “Don’t you know who I am?!?”",
            "This is hilarious!!!!!!!!!!!!!!!",
            "Happy cake day!",
            "Good, the nerve on them!",
            "You've got the lunch and the while maintaining eye contact with them, slowly tip it into the trash can",
            "It's all about the bacon.\n\nWorth it.",
            "Plot twist: OP isn't white and didn't get killed by the cops.",
            "Dang, and yall bitch about police when you have the audacity to call them over a fucking restaurant order.",
            "And the police didn't do anything to op for such a silly call?",
            "I'm really happy that you stood up for yourself. <3",
            "Do you not realize that you didn't pay the restaurant, you paid into an app. They can't refund something they didn't receive payment for. This isn't even malicious compliance, this is wasting a police officers time, and being rude to food service workers. Smh.",
            "The thing is the employees were being disrespectful to a customer. \n\nIf it takes calling the police to fix this so be it. It is bullshit that the manager couldn’t resolve this the way it ended with out the police involvement. \n\nThe manager should be fired for his/her actions.",
            "Cool story Karen.",
            "Fyi calling corporate will get you more and better coupons",
            "This is truly a Karen moment and I’m here for it"
        ]
    }
]