[
    {
        "post_id": "at4ch9",
        "author": "armsofasquid",
        "title": "\"Just pay the $15 fine\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/at4ch9/just_pay_the_15_fine/",
        "score": 13752,
        "num_comments": 421,
        "created_utc": 1550762677.0,
        "selftext": "So I work at a school library, right?\n\nWe rent out chargers for phones and laptops upon request for a few hours, but they have relatively steep fines for being returned late. Usually I waive the fines, especially if it is returned less than an hour after it was due.\n\nIn comes one guy, let's call him H, who is a serial laptop-charger renter. Almost every day. Well, a few days ago, he accidentally brought the charger home with him. Now, our fines are $1.50 an hour, which was at about $20 total when he called in the next day.\n\nHe asked me if he would be fined. I knew him, so I was willing to waive his fine, but I couldn't tell him over the phone because he might come back at a time when I'M not working, and some of the other librarians are less lax about fines. So I tell him \"Currently your fine is at $25, but if you bring it in, then we can discuss it further. I'm sure we can figure something out.\" He hangs up, and I assume he would be coming in.\n\nTwo days later, H comes waltzing up to my desk and sets a laptop charger down in front of me. There very same one he took home three days prior. I scanned it in, and told him:\n\n\nMe: You have an $85 fine on your account.\n\nH: What? It was $25 when I called!\n\nMe: That was two days ago. The fine is by the hour.\n\nH: You didn't tell me that!\n\nMe: The fine info is taped to the side of the charger. Tell you what; I'll go ahead and waive everything but that first $25, alright? You'd just pay the fine you thought you'd pay.\n\nH: But the guy on the phone told me he would waive it!\n\n\nI didn't tell him that.\n\n\nMe: I'm waiving $60. So you only have to pay $25.\n\nH: I want to talk to your boss!\n\n\nNow at this point I should mention that we aren't strictly *allowed* to waive fines, it's just that the library can't tell the difference between a fine waived by a manager or just an employee. I was being generous.\n\n\nMe: If I bring my manager in here, you'll just have to pay the whole fine.\n\nH: I want to talk to him.\n\n\nSo I bring in my manager. After hearing the situation, my manager bluntly says:\n\n\nManager: It's an $85 fine, will that be cash or card?\n\n\nHe stammered and walked out of the library.\n\nIt's okay though. He just can't check out books or graduate until the fine is paid. C'est la vie.\n\n\n\nEdit: the charger is free for 5 hours. Most people don't pay anything. Also it says on the charger it's not allowed to leave the building. If they remember to turn it in before they leave, the maximum fine they could possibly get (if they rent the charger at the very beginning of the day and don't return it until close) is $16.\n\nHe took it home, kept it well past the 5 hour mark, hence the ridiculous fine cost. All library properties cap out at $100 or the price of the object (whichever is higher).\n\nAlso I feel like I didn't emphasize HOW rude he was. He was basically short of yelling at me, so hopefully that clears up some frequent questions :)",
        "permalink": "/r/MaliciousCompliance/comments/at4ch9/just_pay_the_15_fine/",
        "comments": [
            "At that point, it would have been cheaper to buy a wholly new charger instead of renting. ",
            "*C'est la vie.*\n\n\"can't graduate\"\n\n*C'est la mort.*",
            "For those of you who play D&D, if you ever hear the DM say \"are you sure?\"... that's when you rethink what you were doing. Similar thing here. ",
            "r/assholetax",
            "Shit. At that rate that's $13k for not returning it for the rest of the year. Jesus rollerblading christ.",
            "This was awesome.  You tried to help him - and even warned him! - but he was still being a dick.  Justice served.",
            "When I was in school it was the parking fines that got people. I liked to go hang around the public safety office the day before graduation and watch people slink in to pay a semester's worth of parking fines. People honestly thought they could rack up big fines they'd never pay because \"I'm not coming back.\"\n\nThis was a state school so the campus police were actually state police officers, if they gave you a ticket it was a state issued ticket complete with points on your license for failure to pay...",
            "[deleted]",
            "Title is different amount than the story.",
            "I'm no accountant, but I missed where something cost $15. ",
            "I forgot to return a [book](https://i.imgur.com/5jesUVw.png) to amazon once and it just kept extending the rental until they said \"fuck it\" and made me buy it.",
            "What a fucking dingus",
            "Ugh, I hate when this kind of thing happens to me. You try to do something nice for someone and they ruin it for everyone else. I once extended a patron's loan overnight for what's normally a 2-hr loan. She kept the item for TWO MORE DAYS. And then I got a talking-to.",
            "Maybe I'm just old fashioned. It's great that you guys offer chargers for rent, but for people on the go, who doesn't bring their cable with them? I take it any time I leave the house with my laptop. It's on of those \"You never need it when you have it, but when you need it and don't have it, you're screwed,\" kind of things.",
            "Fines like that should definitely have a cap at the price of replacing the charger (Tack on employee time to mess with it if you must.)",
            "That’s the problem with not following protocol. Obviously you’re trying not to be an asshole about fines, especially when someone makes a good-faith effort to return things in a timely fashion. But this jerk-wad, which you had no idea he was going to be, was trying to take advantage of your generosity. In place, he may have actually returned the item to a different person and put your co-worker in a tough spot. Consequently it would look like nobody there knows what they’re doing. And now this poor sap is on the hook for $85 because he probably thought your fining policy was actually very lax. ",
            "This shit reminds me of when I rented a book from elementary (side note I was terribly bad at remembering things) eventually the librarian told me straight to me face and even made it a spectical that I didn't need to turn in the book and that it was paid for. Nothing about it for the rest of elementary nothing about it for middle school but come high school when I need to rent a book for class I get told you need to return the book from elementary school or else you can't graduate. I would also note that by the time I was told this most of my siblings had moved out and taken things with them and with the automatic descion that I won't be reading any books any time soon (they were right but that's not a story for now) a lot of books were taken. I had no idea who took the book no one had found the book where they live it could be in a dumpster in Toronto for all anyone knows. The real kicker is when I rented a book for middle school and heard nothing about needing to return any book except the one I'm borrowing for middle school",
            "Ahhh that’s classic.  I work at a university library and see this kind of thing a lot as well. \n\nThere’s been $15 fines on dry erase markers, $150 fines on reserve books and my personal favorite is when students try to steal our equipment for resale purposes. \n\nSorry to hear that patron tried to take advantage of your good nature but good on you for trying to help them anyway!",
            "I use to work at a carpet cleaning place. Now if people were nice we would clean a hallway, area rugs, or small closets me might do them for free.  Yet, if you bitch about the price the whole time and wanted us to clean those areas you were getting charged for them.  We technically weren't suppose to clean anything for free.  ",
            "Rumour has it the fine is still going up to this day. ",
            "I never went anywhere with my laptop where I didn't have my charger.  Is that a thing?",
            ">He was basically short of yelling\n\nNot cool at a library",
            "Man you were nice. Most I would have waived would have been half. \nWe had to become more strict with waiving fees because people were taking advantage of it. People just always go after the \"give them a finger and they take the whole arm\" thing. \nWe were sick and tired of the sentence \"But last time your coworker waived the whole thing\". Some where lying but some where also aware that we were deciding individually. Now we changed it so that we don't waive any charges at the counter. If someone want's to object or is saying they have a valid reason, we give them a form to fill out and always the same person looks over those cases. (We still usually waive a part of it because we are not monsters) But this way less people actually ask to waive the fees because they think the form is too much hassle. It also shows that most are aware that it's their own fault that I got fees... And they can't play us out against each other anymore. :) ",
            "I also used to work at a school library that rented out such equipment. We had to bar a guy from renting laptops because hed regularly keep it passed the 24 hour free period, then return it filthy and dirty with porn still up on the screen ",
            "> So I work at a school library, right? \n\nI don't know. You're telling the story. ",
            "Wait, I'm stopped at the first sentence. Do you or don't you work at a school library? ",
            "I work in a public library. People all seem to get pissy about fines... ",
            "Amazing. You tried to throw this guy a bone and he still wanted to press the matter. What an absolute lad.",
            "Back when I was a youngling, I had a two week overdue book, but it was for a book talk, so the librarian let me keep it. Then, there was a new librarian after that one suddenly died (RIP) who refused to believe my story, even after I did the book talk on my book. So, as a independent child, I did the first thing a child would do. Try to protest it. So, I headed off to the bank that afternoon, and launched a order for 2 boxes and a half of pennies for shipping the following day. Then, I hauled them to school and put them on the librarian's desk, all loose, for her to count :)",
            "I'm getting flash backs from when I worked at the library. So many nasty people yelling at me and we've had to call security on some of them",
            "Lol. He thought he'd give the business to the manager and get off Scott free.\n\nI hope you continue to up the late fee until he pays it. You said it caps at $100, it'll be funny when he finally goes to pay the 85 and it's up again, lol",
            "he can get a student loan.",
            "Shit that's gonna build up real fast",
            "ULPT: Say you lost your charger and any business with a lost and found (hotels, public libraries) will be happy to let you root through their box of found chargers.",
            "r/assholetax",
            "[deleted]",
            "that fine is a goddamn scam. Go buy your own charger cord lmao",
            "My local library is amazing.  They did away with all fines for everything.  I've brought books back after 12+ months, and they are just thankful to have someone there reading books.",
            ">All library properties cap out at $100 or the price of the object (whichever is higher).\n\nA fucking scam. I lost 5 library TPB's worth $80 I'd rented out in my last couple of weeks during a move after graduating. Long story short I was told by head librarian school policy (and one he disagrees with) is each lost book costs $100 if another copy of the exact edition can't be provided. Due to some shady ass shit in the accounts department (NOT the library), the window for providing copies of the books disappeared prematurely and several months ago I began getting calls from a collection agency saying I owed $650. I stopped getting calls and my credit score's gone back up so god only knows what's happening now. \n\n&#x200B;\n\nI don't know what I expected from a school whose president, during commencent, told people $10,000's in debt three different times not to forget about them now that we're successful alum. ",
            "That's kind of messed up. Why isn't there a maximum around the value of the charger?",
            "S'ok, he probably dropped out. ",
            "nah c'est la merde. ",
            "Graduation:\n\n\"Why can't I graduate?\"\n\n\"You never paid for a laptop charger.\"\n\n\"Yes, I did.\"\n\n\"It says here that you owe the library $85.\"\n\n\"Oh...\"",
            "[deleted]",
            "Why didn't he just buy one ages ago. People are dumb. ",
            "you know students are broke right\n\n&#x200B;",
            "This sounds like a terrible system ",
            "That's stupid much for a fine. At that point you could just not return it and say you lost it. Then give them a 15$ replacement charger and buy yourself 5 new ones",
            "Are you the same dude who posted this on another subreddit a few days back? ",
            "I loved when that happens.  You do someone a favor, it's not enough, so they ask for a manager who is less willing.  ",
            "I mean, to be fair, an $85 fine probably violates usery laws",
            "Is this a common thing to rent out chargers at university libraries?  My last schooling was 32 years ago, way before there was ever a need for such a service.\n\n2nd question: are students allowed to use their own charger?",
            "At some point that should come up against usury laws based on the monetary value of the charger, a collateralized loan.\n\nIf you were to attempt to pursue a couple grand on a ten dollar charger, it likely wouldn't hold up in court.",
            "What a coincidence, I work at my university library with literally exactly the same job! ",
            "This would be the moment for him to ask - what is the penalty for losing the charger? $20 you say? (Stuffs charger into bag) I have no idea where it went.",
            "I know students are poor, but seriously?  You don’t own a charger to charge your own laptop?  That’s insane. ",
            "[deleted]",
            "$85 for a laptop charger fine over 3 days...I'd contest it at the school business office. $85 versus what is tuition for the year when I transfer because the fine isn't reduced. Most institutions can and do hold transcripts and/or diplomas until all fees are settled, so $85 is just punitive considering the charger was returned within a couple of days. ",
            "To answer your initial question, no. You don’t work at a library. \n\nNow, wake up, you’ve been in a coma for far too long.",
            "Chargers are $5, what a scam.",
            "[deleted]",
            "Put a note on his account that he's maxed his waived fines.",
            "There needs to be a cap on what the maximum fine is,  which should be the cost and shipping of a new charger.   What if someone was loaned out a charger and forgot for 2 years?   That's the price of a new car... for a silly laptop charger that has likely been replaced by that point.  Imagine finding this out when you go to graduate?\n\n&#x200B;\n\nSure,  it is inconvenient to replace them and order more, but that's life man.  People lose shit.  \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
            "Fines by the hour is downright malicious. Fuck your boss. ",
            "Your library sucks.  \n\n\nedit: If your university has large fines, its probably is lowly ranked, and a degree from them is largely useless. Any institution that has high fines is a shitty institution. Eg- town that are speed traps, for-profit prisons, for-profit colleges, underfunded public libraries etc. In comparison, my university did not charge late fines. Neither does my public library. My city does not have speed traps or red-light cameras, but the poor ones the next state over do. ",
            "Why not just...bring your own charger?",
            "[deleted]",
            "Sounds like a bull shit way to collect money from broke college kids. I'm sure the school makes enough money to replace a few Chargers.",
            "That fine is screwed up another way for colleges to fuck you out of your money.",
            "I'm sorry, but you're an asshole and those fines are ridiculous.",
            "Regardless of how the kid acted to you, are you proud of charging $1.50 an hour for a laptop charger?"
        ]
    },
    {
        "post_id": "d8i2td",
        "author": "Necrobiohazard",
        "title": "Never leave a spill? You got it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d8i2td/never_leave_a_spill_you_got_it/",
        "score": 13739,
        "num_comments": 305,
        "created_utc": 1569298434.0,
        "selftext": "Quite some time ago I used to work at Walmart and honestly it was by far the worst job I've ever had. I could go on for hours about all the horror stories I have from that place. One story in particular I feel is a good fit here.\n\nYou see, the store I worked in had a rule that if you see a spill, you are to guard the area to keep customers from slipping and falling. You were not to leave the spill for any reason while you flagged down another employee so that they could fetch cleaning supplies (only managers and the cleaning crew had radios). I understand the logic here as a lawsuit would certainly cost much more than an hourly employee's time standing next to a spill until it was cleaned up. However there are a few issues with this in practice.\n\nI worked the evening shift in the Meat Department and most days I was the only person in my department. I was situated between Frozen Foods and Produce, which more often than not only had 1 person shifts as well but they also closed much earlier than my department. This meant that I was the only person in my corner of the store for about half of my shift. If I came across a spill there was no telling how long I would have to wait around for another employee to come by because there was literally nobody else working in or around my area. Also, being in the Meat Department, we had multiple cleaning stations all around. One was always a few steps away.\n\nOne day while working alone I noticed a small spill. So I stood next to it per procedure for about 10 minutes. In this time nobody, customer nor coworker, had even entered my view. I couldn't help but think how dumb this was as I could see a cleaning station just on the other side of a bunker. I decided to throw in the flag and just go get the cleaning supplies and take care of it myself because even if a customer did come around I could still see the spill and easily call out to them to watch their step. Unsurprisingly, I was able to make the round trip without any incidents. \n\nAs I was cleaning it a manager came walking up and took notice of me.\n\nManager, \"What happened here?\"\n\nMe, \"Just a spill. I've got it all sorted.\"\n\nManager, \"Did you just happen to have cleaning supplies on you?\"\n\nMe, \"No, but they were just right there. I was able to fetch them without losing sight of the spill.\"\n\nManager, \"That's not how we do things! Someone could have gotten hurt!\"\n\nMe, \"No, as I could have called to anyone that came near it. I was never more than a few steps away.\"\n\nManager, \"Doesn't matter. You should have stood next to the spill and waited for someone else to come by.\"\n\nThis when on for a few minutes but the manager was not budging so I conceded. That was not good enough for him as he then proceeded to write me up for \"Negligence and unsafe work practices\". I was livid, but I was also a college student and needed the job so I just kept quiet and returned to my shift.\n\nA week or two later as I was once again the only person working in my corner of the store, I happened upon another spill. This time I shrugged and decided to guard it as if my job depended on it. I checked my watch and noticed that I had about 3 hours left on my shift and had a small laugh at the thought that I might be standing in that spot guarding a puddle instead of closing my department.\n\n10 minutes passed.\n\n30 minutes passed.\n\n1 hour passed.\n\nAround this time I was bored out of my mind, but then I heard a call over the intercom system that made it so much more worth it. \"We need an associate from the Meat Department to the back for a truck.\" This was followed by a few other calls for other departments for their trucks arriving as well. I started laughing out loud at this because I knew that this meant that the very few people that were likely to come by my department were now at the loading dock unloading trucks while I stood guard over my puddle.\n\nA few minutes passed before I heard the second call, \"We need an associate from the Meat Department to the back for a truck\". I just stood there counting the lights on the ceiling.\n\n1 hour left on my shift and there still had not been a single fellow employee walk by. I assumed everyone was starting to finish up their own trucks by this point and would likely soon have to start unloading my truck as well. I was watching the minutes go by in anticipation trying to decide if someone would come find me before my shift ended or not.\n\nI got my answer 15 minutes before the end of my shift as the very same manager from before came storming through the Meat Department furious. We made eye contact and he stormed over to me and started yelling about how they have been calling for me to unload the truck and how they are now behind schedule and so on. Once he took a breath long enough for me to speak I asked simply, “Can you go to a spill station and grab something to clean this up? I’ve been here a while now.” He glanced down at the puddle next to me and I thought he was going to explode. \n\nManager, “You mean to tell me that you didn’t unload the truck because you were watching a spill?”\n\nMe, “Yes.”\n\nManager, “Why didn’t you just clean it up?”\n\nMe, “But leaving the spill would be unsafe for any customers. Besides, you wrote me up for doing that very thing recently, right?”\n\nThe manager tossed his hands up in defeat and walked the 15 steps away to the nearest spill station and returned with supplies, that he promptly gave me to clean the spill myself. \n\nManager, “Once you are done go back to the loading dock and start on your truck.”\n\nMe, “Sorry, I have only about 10 minutes left on my shift and as I’ve been standing here guarding the spill I never got my second break. So I’m going to the break room for a bit before clocking out. You’ll need to find someone to close down my department as well.”\n\nAt this the manager just stomped off in a rage. I cleaned up the spill, played on my phone in the breakroom for a bit, and clocked out with a smile on my face. I know that the manager just made someone else do all the work and wasn’t personally affected by this, but knowing that I could be a thorn in his side was enough for me.",
        "permalink": "/r/MaliciousCompliance/comments/d8i2td/never_leave_a_spill_you_got_it/",
        "comments": [
            "Upon reading this, a tiny little hole in my black heart was filled with contentment.\n\nThis is the quality content I sub for. Absolute compliance, absolute malice, it warms my petty little cackles just to read it.",
            "If this isn't a good example of MC, I don't know what is.",
            "I feel like your security people must be as dumb as your manager if they watched you stand in one place for hours on cameras.",
            "We have this policy in the home improvement store I work at, none of my managers are asinine enough to enforce it though, thank goodness. None of my department work would get done if I wait by a puddle and for someone to show up with the spill kit . Plus I have the gates to block off the area while I get the spill kit so...",
            "r/Walmart would love your stories if you haven't posted there yet",
            "Now I want to go to all the nearby Walmarts late at night and make lots of little spills all over.",
            "i love telling stupids how stupid their process is.",
            "I toss my hands up in huzzah!! Well played",
            "You have made my evening. [We're not worthy.](https://giphy.com/gifs/waynes-world-wayne-campbell-MUeQeEQaDCjE4)",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "fxcwer",
        "author": "iTz_Crutchie",
        "title": "\"I would like to cancel my account please.\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/fxcwer/i_would_like_to_cancel_my_account_please/",
        "score": 13728,
        "num_comments": 393,
        "created_utc": 1586373746.0,
        "selftext": "I had just signed up for a new AT&T TV subscription less than 13 days ago. They had just posted a new update yesterday informing all new subscribers can get HBO and HBO Max for free for a year.\n\nI call AT&T and start talking to the representative explaining my situation. The rep unfortunately tells me that they are not able to add the package as it is only for accounts created AFTER April 3rd.\n\nI then ask the representative if I'm still in my grace period for a full refund and no termination fee. She replies yes. So I tell her I would like to cancel my account. She replies \"I am sorry to hear that. Why would you like to cancel your account today?\"\n\nI reply \"I just told you but its the fact that I am not getting HBO for free\" She replies \"I understand, let's go ahead and cancel the account. You won't be charged a termination fee and will get a full refund of what you have paid so far.\"\n\nAfter a few minutes she cancels the account and then asks \"Is there anything else I can help you with today?\" I say \"Yes I would like to set up a new account for AT&T TV.\"\n\nShe then transfers me to another representative that can assist and I get a new account setup with the HBO and HBO Max free for year. I still have to send the box back with the old account AND they sent me a new box for the new account.\n\nTLDR: Rep couldn't add the package to my  account created just 13 days ago because AT&T so I cancel the current account then immediately setup a new account to get the promotional offer of HBO and HBO Max for free for a year.\n\nI know they have to follow certain steps but wouldn't it have just been easier for them to add the package to the existing account. Either way it gave me a good chuckle.",
        "permalink": "/r/MaliciousCompliance/comments/fxcwer/i_would_like_to_cancel_my_account_please/",
        "comments": [
            "As a former customer service person you did well, just know that many times we can't because the system doesn't allow us, or we have a manager on our back. But love what you did.",
            "That's a pretty ridiculous circus act you had to go through, but in the defense of the representative it's pretty unlikely that they even had the ability to give you the free year. when they do things on their end they're really just hitting buttons on a rigid internal application, an application that will be explicitly designed to prevent representatives from doing anything outside of a small set of scripted action. They have an unsubscribe and subscribe button, but probably don't have a \"don't bill this person for the next year\" button.",
            "AT&T is a terrible company. I was a victim of them for TEN YEARS and one day, after 10 years I missed a payment due date and THEY CUT ALL MY LINES.  \nI complained but had to pay the full amount for reinstatement. I said I've been a loyal customer for 10 years and they said your life with the company is only as long as since the last contract you signed, thus mine was just 1.5 years, not 10, according to them.  \nI can now PROUDLY say I'm not with AT&T anymore, AND NEVER EVER WILL I BE AGAIN. They burned that bridge to the ground yeah.",
            "That box you need to return - do it in person and get a fucking receipt.  Trust me - the receiving places lose shit all the time - and that will block this entire thing.",
            "I hate that shit so much. Like just add the package. It took more work to cancel and initiate a new account than to just comp a package for however long",
            "I worked DirecTV customer service back in 2011 and I guarantee you that the rep you spoke with literally lacked the actual ability to give you free HBO. The system gives a list of available retention offers and that list is a function of billing history, age of account, time elapsed since a previous offer was applied, the level of service on the account, and the CSR’s access level. For a new account, there’s next to nothing available to even offer. Each CSR has some dollar-value limit for discounts and retention offers that they can add to an account in a given interval and, if we exceeded that limit, we would have to walk over to our supervisor and pitch the case to them so they could apply the discount. Those CSRs have no meaningful degree of autonomy or flexibility and they get screamed at all day every day for terrible pay. Please be nice to them; it’s a terrible job.",
            "[deleted]",
            "Well played!",
            "I was in business assurance for a cable provider - it’s a finance role but a bit broader.  We had automated audit reports to “catch” shit like this and come up with better solutions (like automatic escalation approval for customers who fall *just* outside the promo window and complain).  Those solutions take a lot of time / effort to implement business wide, though, so I doubt every business does that in advance.  It’s absolutely not in the Rep’s power (or best interest) to try to break the system’s rules.  Corporate Marketing would be the one who sets these rules and they have to be veeeeery specific because they can’t have promos without providing an estimated cost.  That cost is generally split by the provider, as well, so HBO has a $ they’re expecting to shoulder.  The only way to get a cost is to specify who qualifies.  I hate that people think the Rep has any power or responsibility for setting the rules.  Sorry - long winded way of saying that I totally understand the frustration but CSRs shoulder far too much of the burden from customers for complying with this stuff.  It’s not up to them.  It’s not even up to their Managers or department heads.  There’s almost always an explanation for *why* things were set up like that and definitely always a better way to go about them... but it’s complicated.  And... I’m done.\n\nSide note to people dragging the Rep... there’s literally no way to go rogue in those systems.  Ever tried applying random letters in a promo code field on Amazon?  Yeah, doesn’t work.  The Rep can’t just “make it work”.",
            "This is malicious compliance against AT&T, not against the person on the phone.  She couldn't help, and couldn't suggest your current course of action.  But I'm glad you got the deal!",
            "I had trouble with AT&T (DirecTV) after the initial installation.  First bill was over $400.  I fought with them for months.  I finally contacted the FCC and BBB and within a day of that, I had the office of their president on the phone wanting to work things out.  I paid no cancellation fees and no back fees for being overcharged.  The FCC complaint was the tipping point for them.",
            "I have similar problems with Amazon. A product went on sale after I bought it. I looked around and apparently they've cancelled their price matching (this was a few months ago so it's not due to the rona). I was within the free return window so I started a return. One of the questions asked \"which retailer\\\\website has a better price such that you are return this?\"  \"You do, Amazon. You do.\"",
            "[deleted]",
            ">but wouldn't it have just been easier for them to add the package to the existing account.\n\nNo, because that most likely was literally not an option. Most call centers give their people exactly zero leeway on those type rules. If the computer system won't let her retroactively apply it there's legitimately nothing she can do.",
            "I had this same issue with Sams Club last year. We purchased a mattress online from them. \n\nA few days after purchasing, they had a deal on that mattress through Sams Club’s site. Called them up to have them price match themselves and was told that they wouldn’t honor their site, so I asked about their return policy. Was told I could return it free of charge, so I had to quiz them. I asked if I was to theoretically return it and reorder I would only have to pay the new price and was told yes.\n\nIn that same call, I told them I’d like to return it for a refund. After they finished processing it, I was told they had to drop it off and then would send someone else to pick it up (Not sure why, this was pretty ridiculous so far). Once done, the rep asked if I needed anything else. I told her I wanted to place an order for a mattress. The same rep who processes the return ended up processing the new order. \n\nWas fun a week later when the crew came to drop it off. Had them store it in the garage and the next day another crew picked it up. Few days later, that same first crew dropped off the new mattress. \n\nCouldn’t believe the inefficiency wasted on this when they could have saved some money and just matched their price. Worked out well since I could work from home during all of this.",
            "Well done.  This reminds of a long-ago incident, I was signing up for cable service and the ad said \"name your installation price\".  At the time I think the average cost of installation was like a hundred bucks.  But competition was starting to heat up, hence the ad.\n\nWhen the rep asked me what my installation price  would be I hesitated because I was going to see what she said to \"one cent\" but then I said \"can I say free?\"  She chuckled and said yes, and then said \"you won't believe how many people say things like $19.99 or even $29.99\".  It pays to pay attention enough to use the vendor's policy to your advantage.",
            "My sister worked as a contractor for ATT for 2 years got paid 170.000$ a year and every project she worked on was canceled!",
            "AT&T is a ridiculous company. Every employee there whom a costumer might encounter is just reading from a policy card, nobody is empowered to do anything outside of what is dictated. Everything not mandatory is forbidden. Because of the ridiculousness of this system, and one hand not knowing what the other is doing, the only thing employees have incentive to care about is covering their own ass by following the script. Even if they wanted to help you they absolutely cannot.",
            "Had something similar happen a few years ago with Amazon. Bought a task chair (sold and shipped by Amazon, free returns), and I noticed it was marked down by $200 a few days later, before I ever even received my order. Called Amazon to get a price adjustment, “sorry we can’t do that.” \n\nSpent a solid 15 minutes trying to find a way around it, but ended up having to do a return and repurchase. They took my return, emailed me a shipping label, and I bought the chair at the lower price while I was talking to them. Took the giant box right from UPS delivery guy’s truck and loaded it into my van to bring back to the UPS store to ship it back to Amazon, all at their expense. New chair came in a few days later.\n\nIt’s really kind of nuts to think about how much that whole transaction cost Amazon.",
            "Former call center worker here. Very smart move and I can almost guarantee the CS you were talking to was smiling when you said that. The system controls what they can do so there would have been no way for them to add that package.",
            "I may get some flack for this but this doesn't seem much like malicious compliance, more like an r/assholedesign moment since the rep couldn't do anything to help you but still did their job, you have to remember a lot of those people are told not to lead customers into better deals and their calls are all recorded.",
            "But you see, this goes on their books as a new subscriber, so you're counted twice.  Looks nice for shareholders.",
            "Hey. \n\nI like you. \n\nKeep up the good work.",
            "I did something similar once.  Bought a shirt.  Shirt then goes on sale.  No match on sale.  Ok.  I'd like to return the shirt, please.  Thank you.  I'd like to buy a shirt please.  Thank you!",
            "I work for AT&T, please come into the store so I can flip your account for you and get paid commission for it.",
            "Having worked for Amazon customer service, this is one of the few things I will give them credit for, in situations like this one they would let you get it and they will often let you get credit for discounts on their devices if you are in the full refund return window.",
            "Reminds me of another reddit story of someone cancelling an appointment and re-adding it bc they wanted to move the appointment",
            "Those jobs are so regimented, they leave no room for any independent thought or action just to keep everything as controllable as possible. Too hard to look after 100 employees if they can make their own decisions",
            "That will teach her to create company policy",
            "Great job, I am surprised you were successful, I lost count how many times I tried to cancel my account on the spot because of similar circumstances and I got bounced back and forth between representatives and dropped calls.",
            "My cable company raised my rates recently.  I called to get the old price back.  They said no,  so I canceled.  Two weeks later they're calling me trying to get me back at the old price.  I know it's not the reps fault.  It's the idiot managers.  I told them I had already signed up for att now. Morons.",
            "Thanks for not being a dick to the customer service rep. As someone who used to do their exact job, there is no way for them to physically give offers unless you meet the companies specific eligibility requirements. You did a good job skirting the system though",
            "Those questions that CSRs are forced to ask make me crazy. When we built the house I live in, I was changing our cable service from the old address to this one. I was calling from work, so needed to get on and get off the phone. \n\nThe cable rep was supposed to give me @5 minutes worth of options to upgrade the cable, all we wanted was what we already had. \n\nI told him that I don’t want anything added. He told me that he had to tell me the offers, and started talking again. Finally, I said, “I understand that you are supposed to tell me. But I don’t work for (the cable company). I don’t have to listen. And I don’t want to. Has the service been moved as of my date? Then note that the customer hung up, because I have to go.”",
            "The only person upset about this was you",
            "I'm not sure how **malicious** any of this really was, but definitely well played.",
            "Thats how it goes some times.   Although I dont see this as being malicious.",
            "They don't have the possibility so the support person can't help you even if you ask directly for it and you give up.\n\nThis probably works with the most people.\n\nYou can bet the support person was very satisfied you found the work around",
            "I bought two child car seats on Amazon for $140 each. A few days after they arrive and are installed I see a lightning deal for the same seats for $70 each. I add two to cart and call Amazon asking to price match thr discount and refund the difference.  They tell me they cannot. I then ask to start a refund on the two I just purchased with reason being found a lower price. While they are doing the refund I check out my cart. The new car seats arrive and I take them back to UPS the same day with the return labels attached. \n\nTLDR: Amazon paid an additional $20-$30 in shipping for some massive  heavy boxes to go around the country because they didn't want to give me a refund.",
            ">I still have to send the box back with the old account AND they sent me a new box for the new account.\n\n\"Hey environment, fuck you!\" -AT&T",
            "I used to work for a cable company doing that exact job. They used to monitor certain promo codes we put on accounts, and if they saw you putting a bunch of new customer promos on an account that wasn't specifically a new customer at the time the system flagged you and your boss would take you aside and you could get written up. Your satisfaction and the teeny amount of commission I'd get wasn't worth damaging my chances of moving up in the company.",
            "How do you like that cable? I only just saw a couple commercials and am currently using hulu live",
            "Gotta love red tape sometimes",
            "Back when I was doing customer service for an internet and tv company, I wouldn't have been able to do two account changes like that on the same account on the same day. The system wouldn't accept it as input...fun times.",
            "Don’t think this is malicious compliance so much as the ass backwards way you have to do it because it’s the only option.",
            "As if this isn't designed by Accounting. You did no hurt to the person who canceled your account and added positive metrics to the one who added you as a \"new customer.\" Welcome to Making the Company Look Great on Financial Statements and Disclosures to Investors: they had a net loss of zero, an arguable gain of one customer considering their projected attrition, and a long term-ish (by the next reporting period) growth outlook compared to previous reporting and/or competition.",
            "Sometimes policies just suck. When I can't help a customer, I like to offer to transfer them to the department that can. My management has decided that department was getting too busy. We can no longer suggest/offer the customer talks to that department. They have to ask specifically. And if they don't, all I'm allowed to say is \"policy blahblahblah\" or \"unfortunately, I'm not authorized to do balhblahblah\". And we talk in circles. They get angry. It's awful.",
            "You got them to hold the chicken. Impressive.",
            "She should have sent you to retention. I worked there for 17 years and while it was torture and the most stressful job I’d ever had, I’d have taken care of that for you and you’d have been super happy. Sadly they now treat their reps even worse than when I was there, and I am guessing turnover is much higher due to people getting fired for stupid shit like not asking someone “do you have a pen”- one of the minor infractions I got written up for.\n\nEdit- I worked in retention and dealt with customer after they had been transferred five times and offered all products repeatedly until they got to me...so I could retain them, then offer all products again.",
            "Make sure you send in the old box with tracking and signature confirmation and keep a copy of the tracking and signature once it is delivered in case they pull any \"it was never received\" BS on you.",
            "Worked for an isp for a few years. This was as frustrating for us as it was our customers. Any promotions were annoying because either the nice customers we want to help we couldn't help, or the customers abusing the system and calling in for free stuff every month just got it every month. Lack of consistency was obnoxious.",
            "Long time ago, I worked for an AT&T call center. It was ridiculous. Sometimes, I could fix your problem immediately, the button I needed to press was right there. But I was not the right department. We were not authorized, and would be fired for doing that particular thing.  \nThen the next morning, we'd get a memo. We are now authorized to do the thing. But there was something we could do yesterday that now, we would be fired for doing, because of a policy change.  \nYou might not get fired immediately, but you would definitely be written up.",
            "After a year and a half of billing mistakes from AT&T and being lied to over the phone, never again will I be their customer. After being lied to over the phone, I spent hours upon hours in one of their stores having one of their reps make the calls for me. The billing error had to be corrected every month. So much wasted time.",
            "\"termination fee\" how is that still a thing in the US?",
            "Very nicely done, OP.\n\nFwiw I switched my phone to Vonage back in the late 2000s and switched to an ultra cheap VoIP service some 5 years ago. Also around 5 years ago I stopped paying for traditional TV and have a small handful of providers such as Netflix. And just with the last few days I've been building out a Plex server on a Raspberry Pi.\n\nThe Promised Land of à la carte entertainment is out there.",
            "There is a similar tactic when an appointment has a cancelation fee within 24 hours but no reschedule fee",
            "I will bet you anything that AT&T Corporate knew this would happen but crunched the numbers of how many people would miss the offer vs. how many would do what you did and figured they'd profit more by the latter happening.",
            "Man, be careful with ANY AT&T service. \n\nI used to work for AT&T and they're all bloodsucking vampires. The DTV Now services is damn near impossible to cancel because you can only do it through an online chat if you have all your account info. \n\nI had a customer who got it (against my recommendations) and literally ended up having to cancel his card to get out of it. \n\nI have literally never been to or worked for a more evil company than AT&T.",
            "Let me know six months from now how many of those six months you had to contact at&t because your bill is incorrect. They are terrible. I'm also amazed you were able to cancel your account that easily.",
            "Fuck AT&T. That is all.",
            "Just listened to this from an rSlash YT video\n\nUsed to work as a customer service representative for AT&T (offshore) and it's damn quite annoying that we're not equipped to do some shit at times just cause we have to follow procedure\n\nLike some customers' request are simple but the equipment and systems we have are too slow or too restricted in what we can do\n\n(Not to mention management wasn't being a big help, blasting music and making pointless announcements over a loudspeaker, like raffles and events, which most of the people don't join since we're all busy WORKING\n\nIf you ever want to see upper management goofing off 70% of the time, my old job environment had that)",
            "They do it that way because they track \"new accounts created\" as part of their financial success.",
            "AT&T uverse is ridiculous.  I had a similar experience.\n\nI was moving into a new apartment and decided to go with Uverse.  All of their appointments for installation were booked 2 weeks in advance so I made sure to book my appointment a month in advance so that they would install on my move-in day.\n\nA couple of days before moving in, my apartment complex told me that my apartment had been flooded and they had to move me to another apartment for the first month while they did repairs.  I called AT&T to request that they send the installation person to the new apartment number.\n\nThey said they could not just change the apartment number and would need to set up a whole new appointment.  Furthermore all appointments were booked two weeks out so I would have to wait two weeks for my TV and internet since it was almost moving day already.\n\nI was pretty frustrated and I explained to them that I had already had my appointment booked in advance so that I would not be without TV and internet for two weeks.  They said that was just their policy and there was nothing they could do.  I was transferred to a bunch of different people/managers but the response was the same.  Finally I told them I wanted to cancel my service (which hadn’t even started yet).\n\nThey all seemed so robotic without any realization of how ridiculous it all was.  I ultimately cancelled and just went with the local cable company instead who installed everything on move-in day with no issues.",
            "From working in a call center myself, the company dictates almost everything the employee can say or do on the phone. The rep either was locked out of giving that promotion to accounts created before that date, or would get an official write up for giving that out. It sucks, and the best way to handle those situations is to ask to speak with a manager, Or a retention department(if they have one). Retention departments usually are able to give those deals as a way to keep you as a customer, and managers get a lot more lee way with what they are allowed to do as well.",
            "> I know they have to follow certain steps but wouldn't it have just been easier for them to add the package to the existing account. Either way it gave me a good chuckle.\n\nThey probably physically couldn't.  Billing systems and promotions are often strangely coded in regards to each other at these companies.",
            "Br careful, i bet that free year is more like 3 months and then they'll add the charge back ti your bill. Scum.",
            "Yes, retail is amazing. I had a faulty Xbox 1 controller from my system from bestBuy. They insisted I bring the whole console, wires and box in to swap it, and didnt care I already setup my account on that one, and software at the time could only be moved to a new system I think once every 6 months or 1 year, so headache and a half.\n\nNo prob, bought a new controller, returned it with bad controller.",
            "I gotta ask, did she fight you on that cancellation, or was she game to help you abuse the system?\n\nI've only experienced it once, but there are unicorn operators that hate the companies they work for and they'll pull a [Bob Parr](https://youtu.be/_R8GtrKtrZ4?t=56). It's magical.",
            "This seems more like an ad for AT&T and HBO.",
            "They had you in the first half, not gonna lie",
            "Bet the rep laughed as well.",
            "Former AT&T Customer Service Rep, here. Unfortunatley, that's the system they've had for a century or so. (Or, at least back when I worked there) It ain't gonna change until enough consumers light a fire under the top management. You can find the list of executives [here](https://investors.att.com/corporate-governance/leadership) and the mailing address would be  \n\n208 S. Akard St.  \nDallas, TX 75202",
            "This is not really \"malicious compliance\" at all, but congrats on getting a better deal",
            "YOU are whom I would like to be if I could get past avoiding conflict.. I’m amazed.",
            "I would die of shock.",
            "He said it felt like my heart actually jumped",
            "Is this empress's burner account or something lmao",
            "Doesn't that mean you got 13days free? So couldn't you do this forever? Sure it would mean every few weeks you have to call people but then it's free.",
            "I once did the same with a new speaker, because it went from €10 off to €20 off. A bit of hassle saved me €10 and possibly cost them more than that in terms of delivery costs.",
            "As someone who worked with AT&T I 100% agree that it is ridiculous sometimes how what should be an easy fix turns into an insanely long circlejerk to find someone who knows how to deal with it. Not to mention the amount of reps who spew wrong information like their life depends on it just to get you off the phone. Their systems need a huge overhaul to bring it into this decade. Every day I worked on it i just wanted to pull my hair out.",
            "If it were spectrum, you'd still be ineligible for the promo as you *were* a customer when the promo started.",
            "I have one concern about the situation.  ATT has what are called winback customers.  Winback customers are people who have had one of their services recently, in this case it's TV service. \n\nIn an instance like this they generally don't apply the price discount. \nFor example, a couple who just cancelled their DirecTV service two days ago just came in and wanted to get ATT TV.  The DirecTV service was in the wife's name, and they set up the service in the husband's name. \n\nATT understood that they are related and they had service with DirecTV very recently.  ATT took it upon themselves to allow the customer to sign up for the new streaming service, with what seemed to be all the promotions.  Come to find out, the customer will be paying full price on all the streaming. \n\nI've seen this happen multiple times already for both people who signed up in store and online.",
            "Wait till you see the charges coming. Lol",
            "Its impressive that they dont have a policy for promotions after cancellations. I know a certain cell phone company that wont allow you to get their new customer promotion if you have a cancellation within 90 days.",
            "And this is why I hate AT&T",
            "Att is the most bureaucratic of any organization I’ve ever worked with. And speaking business to business. Pure claustrophobic awfulness.",
            "That's the problem with those kinds of terms. \n\nI once had to imply that the customer had to break his own laptop for it to be replaced. It was the only way for him to get a new one and as much as I'd like to process a new one for him it's not in my power.",
            "She had likely had the same conversation multiple times that day already. It's even possible that it was a point of training.\n\nIn the end, it comes down to the fact that companies now make loyal customers pay more money, because they are less likely on average to make the effort to seek a better price.",
            "I used to work at DirecTV and this was VERY common. Now normally, I wouldn't mind so much, but this does unfortunately count against a retention agent's stats and there's no way in fuck that corporate will be lenient on that (at least when I worked there).\nAnd of course back then, we were REQUIRED to make at least 2 save efforts, knowing it was a pointless waste of time, thus dinging us on call time and potentially having a customer give us a bad survey for \"not listening and giving me what I wanted\".",
            "You got VERY lucky because most companies AT&T included have special provisions preventing this kind of thing during promotional periods. (if you cancel an account in last 3 months you cant get promotional benefits for example)\n\nMaybe its because you only opened 13 days ago.",
            "It reads like something out of Suits",
            "These roadblocks are purposefully frustrating. Someone did a sick AMA about understanding the exact phrases you have to use to get the best deals it get a quicker cancellation. Think it was for Comcast though and it was like 2 years ago",
            "#corporatebullshit",
            "I’ve done similar although with less steps. I get transferred to cancellations/retentions and ask for the discount or free hbo. They apply it after how many minutes. No need to send it back and get another install.",
            "Well played sir!!!",
            "Anyone else feel like they've read this exact story before?",
            "Sorry yes i should of written 170,000$",
            "And in a year the price for the whole service doubles! Did they tell you that? Bet they didnt\n\nSource: was one of the first ones to get it... looked at the end date for contract and the prices literally double",
            "OMG I didn't even know you were allowed to do that!",
            "I do this with stuff that went on sale like a week after I bought it all the time. \n\nIf you've already used the stuff, buy it again and use your old receipt to return it right away.",
            "I once ate at a restaurant with a “no sharing policy,” so when my fiancee and I weren’t very hungry and decided to split something I said “we’ll split the chicken alfredo.” The waitress replied “I’m sorry but you’re not allowed to split meals here” so I said “Fine. I’ll get chicken alfredo and she’ll have nothing” and then we shared anyway.",
            "I would think a telephone company would have some pretty good apps . ATT’s business app was and I say was the worst app I’ve attempted to use .",
            "I went through something similar once. My roommate was moving out of the house so we called our internet provider to change the account from his name to mine, but they came up with so many bureaucratic barriers that after a while arguing with the representative we asked her to cancel my friend's account and then on the same call with the same person I opened an account on my name.",
            "And people wonder why I dislike A PEE and PEE.",
            "Not really malicious compliance but: \n\nI subscribed to NBCSports Gold for an Indy car pass. They stream all qualifying rounds, practices, Indy lights races and then of course the actual Indy races. All of the content is available on demand to subscribers and it stays posted for like a year. \n\nSo the opening race was cancelled this year (most of the season and now it's all rescheduled for later in the summer, we will see) so I thought I'd go sign in and watch last year's race. Only no content there. \n\nSo I call 'em up. Hey where's last year's content? I got rid of my DVR because you have the content archived there. \n\n\"Oh yeah, well we had a problem with Fire Stick, Roku, and Apple TV. After an upgrade, all the content could not be reloaded for those devices. It's a programming issue; we're working on it.\" \n\nHrmph\n\nA week or so later, I think, well maybe they've got that old content up now. I go sign in, still nothing. \n\nHrmph. \n\nSo I call again. \"Let me get this straight. A bunch of users of those three devices paid $55 for no content whatsoever? Why did you not immediately refund any Indycar Gold Pass customers?\" \n\nI didn't even finish bitching; the guy instantly refunded and cancelled my subscription. Nice try, NBC. You almost ripped me off for $55! I'll just resubscribe if there ever is an Indy car season this year.",
            "That was the plan all along. Now they hope you never cancel and pay a ton more a month! I still have several additions to my Prime account because I forget to cancel additional options",
            "This isnt malicious complience it is just following procedures",
            "Mind size: Mega",
            "The way this reads the customer service rep, based on your request, was tracking exactly what you were going to do as the conversion progressed. Keeping your cool facilitated the hand-off. If you went full “Karen” during the initial call it would have been a lot worse.",
            "AT&T lies to me also I signed up was told I get it for a year they said oh no, you signed up after the promotional. I said no I didn’t the salesperson told me I get it that’s why I signed up. I told her to pull the recording of my call when I signed up to prove he told me that. They said they don’t have tapes of your recordings!!!! Wow such lies!!!! ATT AND DIRECT TV ARE A PIECE OF SHIT!",
            "Nice try, AT&T. I'm still not going to sign up for your service.",
            "/ccx x//,,is x",
            "Yeah I would have just asked for a supervisor or retention department at that point.",
            "Pro move? Keep doing this every 13 days. You'll lose out on the free HBO eventually, but you'll never get a second bill.",
            "Their stupidity is mind boggling.   I had something similar.   My internet deal was about to end.   I called,  asking for a similar deal to what their competitor was offering.   The idiot absolutely refused.   So did their retention department.  Do i cancelled.    It was quite incomprehensible, really.  Especially the retentions.  But somebody with some sense must have looked at the case,  as they called me back the next day with a great deal and extra discounts to boot.   I was shaking my head at the absurdity of it all.",
            "You still get fucked by activation fees boo boo.  Not worth the time or effort to do what you did.",
            "The fuck he look like a ps2",
            "That's not malicious compliance, nobody was inconvenienced but you. These are just the stupid games that monopoly ISPs/cable companies play.",
            "[deleted]",
            "Repost",
            "Hey look at that *ZERO* activity on this account for 10months; then suddenly a post that *Coincidentally* tells us all about the great new offer from some bullshit companies, *what a crazy happenstance*!!"
        ]
    },
    {
        "post_id": "m6gut9",
        "author": "waitak",
        "title": "You might like to back up that decision...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/m6gut9/you_might_like_to_back_up_that_decision/",
        "score": 13717,
        "num_comments": 440,
        "created_utc": 1615922009.0,
        "selftext": "Years ago, I was the CTO of a software company that was perhaps the worst run company I've ever seen. It was run by a \"chairman\" who used to be a flight engineer, and who had no experience at all in the software industry. One day, in his expansive wisdom, Mr. Chairman decided that we were going to give his friend (a local pastor) an office. I was ordered by Mr. Chairman to make it impossible for anybody (\"Even you!!!\") to access any of Mr. Pastor's files (because, y'know, privacy and stuff). I attempted to point out a couple of problems with that scenario, but was immediately shut down and ordered to do what I was told.\n\nNow, this particular person had... well, let's call it a quirk. When anything went wrong with his computer, his solution was to format his C: drive. (Yeah, I know...) The inevitable happened, and Mr. Chairman ordered me to restore all of Mr. Pastor's files from the backup (which we normally did... ahem... religiously). I looked at him innocently and said \"What backup?\" It took possibly five seconds for steam to begin pouring from his ears, and for him to start screaming, \"YOU MEAN YOU DIDN'T DO A BACKUP??? WHY YOU....!!!!\" and so on. I waited for him to finish, and then asked him politely how he proposed that I do a backup of files that I'm not allowed to have any access to? The silence that followed was glorious.",
        "permalink": "/r/MaliciousCompliance/comments/m6gut9/you_might_like_to_back_up_that_decision/",
        "comments": [
            "[deleted]",
            "\\>   When anything went wrong with his computer, his solution was to format his C: drive.\n\nReminds me of a very old story from the 80's; you can probably find it just by googling, \"Vaxen, my children....\" It was the tale of a humble little DEC VAX 11/750 (lovely little system; I installed one and was admin on it for a couple years, back in the day), alone in a room filled with high-power IBM equipment, and a group of operators who knew nothing about VAXes. Their solution to each and every problem with it was to hit the RESET switch on the front panel, which rebooted the system. Disasterously, in the case of this story; the implication was that it caused the stock market crash of 1987 :-)",
            "[deleted]",
            "LOL this reminds me of one of my friends who somehow though he could \"teach \\[computer\\] a lesson\" whenever it pissed him off. One time he got mad about something and dragged everything in the C: drive into the Recycle Bin. That took a week of my friend reinstalling Windows and optimizing things for him again.\n\nTwo weeks later he was playing an online game that started lagging on him, so he gave the computer a good swift kick, which knocked the modem loose. He called my friend and told him straight up what he did and wondering why he couldn't get online.",
            "3 guesses as to what the pastor had on his computer that caused him to develop that \"funny\" habit of formatting the hard drive anytime someone might want to look at it",
            "WE NEED MORE DETAILS WTF. what happened after the silence? did he admit that he fucked up, or turn beet red, or try to double down and claim it was still your fault because you somehow should have known that when he said “make it impossible to access even for YOU” that he actually meant “except to back up” or something? if the latter occurred and he tried to turn it back around on you, then did you get a chance to reiterate something to the effect of “well I did try to warn of this potential back in April when we were preparing a laptop and office for Mr. Pastor, but I recall you ordering me to ensure the entire device was only accessible by Mr. Pastor, so we were unable to perform the usual routine backups that we do”..? basically just how did he react after the silence? I need the juicy details... people keep ending their stories right when it’s getting good!",
            "Apparently God was not playing on the pastor's team that week, eh.",
            "I can think of a minimum of 3 people in my life that would go straight for reformatting the c drive and that scares me.",
            "Back in the dark ages when I was a shop floor supervisor, we hired a guy that was a 'pastor'. He got his divinity degree in Central Prison from another self-ordained minister. The inmates somehow got mailing addresses and sent whoever letters asking for 'donations' to their 'prison ministry' and it was allowed because they had been ordained by the prison minister...\n\nUnfortunately for him he never disclosed any of this on his job application so we bounced him for falsifying his application.",
            "Glorious.",
            "Wiping all his child porn?",
            "I know someone who will always format and reinstall windows first when there are any issues. So frustrating to hear about. I would offer to help fix things but they are also one of those \"I am always right and know more than you do\" people.",
            "[removed]",
            "The pastor probably have CP in his computer",
            "Was anybody else waiting for this to involve restoring files and discovering kiddie porn?",
            "I'm tech illiterate, can't you make a backup for ***him*** that you don't have access to?",
            "[removed]",
            "Back in the day we used to turn the family desktop off by turning the power strip off.",
            "Could one say the silence was... Heavenly?",
            "It's like the linux prank ... To make your computer faster run sudo rm -rf /*",
            "My friend now works here. No one must ever see any of his files. Absolutely no fraud going on here whatsoever.",
            "I'm a software dev. I gotta say, the reason I refuse to do IT work is that formatting C: is sometimes my solution if I can't fix a problem. I would do that once or twice a year usually when I was still working mainly on Windows. I'm better at just nuking everything rather than trying to nail down what's wrong.\n\nI guess the difference is that I'm aware of the downsides to this, so I have a very robust system of backups and automated scripts/guides to make setting my machine back up again easy and quick. It usually only set me back a few hours when I had to do it.\n\nReformatting C: with no prepared backup is absurd lol.",
            "Boss: Don't do the thing!!!!\n\nYou: Ok\n\nBoss: WHY DIDN'T YOU DO THE THING!!!!!!!!!!!\n\nYou: :|",
            "There's literally no reason for a pastor, working at a software company.... give me a moment that just sounds absurd ... to have all his files hidden from IT. Sure he can have folders hidden for things like confessions etc. \n\nBut ALL his files? \n\n&#x200B;\n\nThe entire thing from start to finish sounds fishy and probably highly illegal.",
            "r/talesfromtechsupport",
            "As a programmer, that is what I do as well. Anything goes wrong, just clean reinstall windows. Works everytime.",
            "Mr. Pastor and Mr. Chairman were probably into the child porn.  *sad panda noises*",
            "Isn’t there kind of a big problem if literally everyone’s thought here was pastor = child porn?",
            "C'mon, a bit more detail to the fallout is necessary for this to be a fulfilling story for us!",
            "Encryption, of course.",
            "Just out of interest then, is there still a retrievable imprint through the use of exotic forensic software or not?",
            "Reminds me of when we got our first hard disk based PC's at work.  My boss was looking through the commands and said \"fdisk, what does this do?\" and hit enter.  This was before I knew better, but when they still shipped restore disks.",
            "I worked on an early directory assistance system in Southern California.  The main data center was in Buena Park, near Knott's Berry Farm.  A whole room full of DEC PDP 11/70s, kinda the predecessor of the VAX.  Two notable events there.  First, the old multi-platter disk packs came in removable plastic cases, like old cake boxes.  You were supposed to put the pack into the drive, then unscrew the cover and remove it.  One operator failed to do this, and due to lack of any hardware safeguards, the arm with the read/write heads punched through the cover and scragged the disks.  Thinking this was a drive error, the op moved the blasted pack from one drive to another down the line until a senior op stopped him from destroying the rest of the drives.  Fortunately, there were redundant systems that failed over all the 1200 directory assistance operators and no interruptions occurred.  Expensive, though.  The second one had a little more impact.  They had massive backup power systems for the data center, starting with batteries that were good for a few minutes until the diesel generators could start and stabilize.  First power failure everything switched to the batteries just fine, and then everything went dark.  Turns out they had wanted to use above-ground fuel tanks for the gennys but the city or county or somebody insisted that they use underground ones.  Somehow those never got built so the generators couldn't start.  I admit these stories may be apocryphal, but I got them first hand from the operations staff there when we were doing onsite installation and testing.",
            "I don't get it. You can backup encrypted files.",
            "In his defense, couldn't you have done an RSA encryption?",
            "!remind me 2 days",
            "Reminds me of when I was software testing for compliance. I would test software to see if it followed the rules laid out for it.\n\nAt one stage I found a submenu of maybe 20 options....none of which people could access because they were locked out of accessing that submenu by an actual key. This was software for cash registers; managers have a key which turns to certain positions. To access the options in this submenu, they would have to turn their key to a position they were physically unable to turn it to (Only the supervisor's keys can turn to that position)\n\nSo I marked them all as unavailable to the manager...as per the spec. (We were testing for access, not whether or not the functions did what they were supposed to. That came later.)\n\nA day or so later *my* manager came racing over to me furious, asking if I had tested each of these options for access or not.\n\nI asked him: How could they access any of the submenu functions, if they are unable to access the submenu?\n\nAfter a moment's thought he calmed down and said \"oh. ok.\" and walked off.\n\nMy manager was the project leader....",
            "yah - had a similar situation early this century.\n\nI was Systems & Network Admin, and was asked one day by the HR Manager \"hey, can you see my files on the server?\" \n\n\"yes\" I replied.\n\n\"Oh, can you make it so you can't?\"  \n\n\"well, I could, but then they wouldn't be backed up and if there's a disk crash then they'd be gone.\" -  we'd had disk failure earlier in the year, yay for backups!\n\n\"oh...\" says she. \"Can you not look in there, then?\"\n\n\"well, now that you've piqued my curiosity...\" and smiled to see her face go a little whiter \"...of course I won't. I'm too busy to be bothered poking around in anyone's stuff.\" (and I didn't really care).\n\n2 weeks later about 20 people were layed off.",
            "r/talesfromtechsupport if you're not with us already. It's a combination IT story sharing and trauma councilor.",
            "I'm in absolute awe at the number of amazing stories that have been shared in this post's comments. Wow. If there were a book with all of the stories recounted here, it would definitely be on my bookshelf. Thanks, all.\n\nHoly crap, I just looked at the first line of this posting, and realized that it got a boatload of awards! Wah! Thank you!",
            "Vin di ca TIONNNNNNN!!! 😂😂😂",
            "I guess he didn't pray enough for his c:: drive\n\n:sunglasses:\n\n... YEAAHH",
            "Wait, that's not how you fix a computer?  And what is a backup?  That sounds like a waste of time and drive space.  It's not necessary.  Drives last forever. \n\nI recently changed out a couple C drives to larger drives. I'm still waiting to format the old drives to make sure there aren't any problems.",
            "Did you consider an anonymous tip to police or otherwise?",
            "Nice!",
            "Have the backups encrypted locally before being transmitted/stored? Same way millions of backups get done by providers who don't have access to the backed-up data.",
            "!remind me 2 days",
            "[deleted]",
            "Incompetent people don't understand the consequences of their words, actions, or beliefs. They want to live in a consequence free world.",
            "Back when RadioShack used to be a company they used to have computer displays that were out in the hall of the mall for display, which included a keyboard and mouse.\n\nWhat is a kid supposed to do other than to force reboot into DOS and promptly type  format c: \n\nNever knew what happened to the kid or the employees who had to, presumably reinstall windows or perform a backup restore.",
            "I feel dumb. Can someone please explain what a C drive is (including what the C stands for), what it means to format it, and what the implications of such formatting are?",
            "Why do I feel, the way you say he they were so concerned about anyone having access to this pastors files, and that his answer to any issue was to format his C: drive (which implies a reasonable level of understanding of computers but an extreme concern about anyone seeing the contents), that one day Chris Hansen was going to show up at your office?",
            ">How\n\nEncrypted file container? Copy the container whole at each back up.",
            "Err, using a system account, like all backup solutions since about 1995? I mean, you don’t actually sit there and copy the files yourself do you? And as an admin, you don’t have access to every file in an organisation. Right?!"
        ]
    },
    {
        "post_id": "anxndk",
        "author": "Fallen-and-Burning",
        "title": "Furious customer didn't give me a chance",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/anxndk/furious_customer_didnt_give_me_a_chance/",
        "score": 13705,
        "num_comments": 595,
        "created_utc": 1549498851.0,
        "selftext": "***THIS IS A LONG READ, BUT A CAREER HIGHLIGHT FOR ME***\n\nSo, I'm in my early 20s and work in a call centre for a gas company. This is my first malicious compliance post, but I had a customer today who reminded me of this one...\n\nA few months ago, I had an angry customer (AC) call in.\n\nMe: Hi, you're through to COMPANY I WORK FOR in CITY I WORK IN. My name is MY NAME. Can I take your name please?\n\nAC: Well, \"MY NAME\", I've been waiting a full 20 minutes to speak to someone!\n\n***20 minutes is quick for our office***\n\nAC: I've called today becau...\n\nMe: I'm sorry, I didn't catch your name? I need to confirm your account details so I can have a look at your account please.\n\nAC: DO NOT INTERRUPT ME!!! I AM THE CUSTOMER AND THE CUSTOMER IS ALWAYS RIGHT. I PAY YOUR WAGES! Now listen here, young lad, I don't want to hear another word from you. Understood?\n\nMe: *Stunned Silence*\n\nAC: That's more like it. Now, I've called today because....\n\nAC then told me all about the issues with her account. For about 40 minutes!\n\nAll the while, I had a first aider and two managers check if I was okay, as I'm not exactly the quiet type. I just sat there for 40 minutes with my headset muted, playing Atari Breakout on the Google Images page. \n\nAfter 40 minutes, she started to get to the end of her rant. I paused my game (I'd already beat my high score, and I wasn't willing to lose this progress), and unmuted my headset.\n\nAC: So now I want you to tell me what you're going to do to fix RANDOM BILLING ISSUE.\n\nMe: *Silence*\n\nAC: Excuse me! Are you still there?\n\nMe: Yep, I'm still here.\n\nAC: Well? What are you planning on doing to fix this?\n\nMe: Well, you've come through to the wrong department. I'm happy to get the number for you if you'd like?\n\nAC: WELL WHY DIDN'T YOU THINK TO TELL ME THAT AT THE START OF THE CALL?\n\nMe: I tried, but you told me to be quiet before I had even confirmed the account details.\n\nAC: YOU'RE A FUCKNG IDIOT! YOUR ENTIRE COMPANY IS FULL OF RETARDS!\n\n***FYI, I HATE that word***\n\nMe: I don't appreciate being spoken to like that. If you swear at me again I will be forced to end the call.\n\nAC: Fine, what's their number?\n\n*I give AC the correct number*\n\nAC: And do they have the same hours as your department? 8am to 10pm right?\n\nMe: That team is only open 9am to 5pm on weekdays.\n\n*AC realises it is now 5:05pm on Friday*\n\nAC: WHAT THE FUCK!!! How dare y...\n\n*Click*\n\nMe to my team manager: Yeah, I've just hung up on her, I did warn her not to swear.",
        "permalink": "/r/MaliciousCompliance/comments/anxndk/furious_customer_didnt_give_me_a_chance/",
        "comments": [
            "I was really hoping you were just going to stay silent the entire time until the customer hung up. Still not disappointed though! ",
            "There was a story i read years ago where a woman told the cashier not to speak a word to her.\n\n\nShe couldnt figure out how to use the debit machine and the cashier and the bag boy stared at her deadpan...in silence, until ahe had to admit defeat.  ",
            "This is easily one of my favorites. Missing closing by 5 minutes....",
            "I hate how some people never listen to your greeting on a phone. I used to work the front desk as a guard at one site.  \"You've reached $DefenseContractor, this is S/O N3roman how can I direct your call.\n\n\"Yeah I'm trying to set up a RMA for my pet's harness  that I bought that broke.\"\n\n\n\"Uhhhh this is $Defense Contractor... You have the wrong number.\"",
            "I'm pretty sure I had her twin brother as a customer.  He called in and ranted for about 20 minutes before he let me tell him he called the wrong company.  He exploded and demanded to speak to my manager.  I said \"of course, I just need your support case number before they will accept your call\".  Since he called the wrong number, he didn't have one.  Eventually, my boss noticed me being stuck on the call, asked for my headset, and then ripped into the guy until the caller hung up.\n\nMy boss then deleted the recording and sent me to lunch.  Afterwards, he would make me deal with all asshole customers since I could keep my cool on the phone.  Not sure if I won there.",
            "This is perfection. I hated it when irate assholes just wanted to rant to whatever warm body they managed to get on the phone. Congratulations on finishing your tirade, asshole, but you're gonna have to repeat it now cuz I don't have the ability to do anything about it...please hold while I transfer you, sir.",
            "Too bad on not confirming the account . Would have been better to have fully flagged it as irate customer",
            "I once had a customer rant for 45 min about the 40 min wait to get to me and how valuable their time was.",
            "That's when you send her to the [extension from hell](https://soundcloud.com/user-237714155/sales-call-abyss) ",
            "When I worked in a call center and had an angry customer that we used to refer to as \"escalations\" I used to just transfer them to a department that was a different language. Oh I'm an asshole because I won't credit your account for no reason? Please hold ..... Hope you understand mandarin.",
            "> AC: I PAY YOUR WAGES! \n\nThat's about as true as \"The customer is always right.\"",
            "This is the reason why I regret starting at my current call center job.\n\nIt blows and I don't know why I did it.\n\nFuck this job. I hate it, I hate waking up to go to it and I don't know why I accepted the job offer.\nThankfully, my old job supervisor told me I was always welcome to go back to my old job if the new one didn't work out. Going to call them tomorrow ",
            "> AC: YOU'RE A F****NG IDIOT! YOUR ENTIRE COMPANY IS FULL OF RETARDS!\n\n>FYI, I HATE that word\n\nThis is the internet. You can curse here. But a good alternative is \"Frick\"",
            "I have these kind of people at my counter every week. I always kill them with kindness. It always starts off with them not saying hello to me. I then say hello or goodmorning until they reply back, which they usually do not like. \n\nThen after that I try to ask them everything that I have, do you want any stamps? No okay maybe the stickers? We also give a book away today do you want one? And I only do this to people who are known to be mean to me and my colleagues. \n\nAfter they are done paying and stuff I always say goodbye, but I just keep repeating it until they say it back or it gets awkward. \n\nMost of the time they are very irritated by everything but they somehow know that it's my job and can't really stop me.",
            "Stop! My justice boner can only get so turgid!",
            "I work in a doctor's office and don't have to deal with many problematic people, but I so relate to being told a goddamn life story before I can get enough details to pull up a person's information. \n\nUsually I will search the number they called the office with while they go on and on, but today a pharmacy tech called and started talking a million miles a minute before I could get all of the patient information to pull up their chart. Since it was a pharmacy tech, I couldn't find the patient by the phone number either. So I was just sitting there, having given up on trying to get a word in edgewise until finally the tech paused for breath and I was able to ask for the patient's name and date of birth. Then she was like, \"can you see the meds on their chart?\" I will in a second, hold on geez. People, if ya'll are calling an office where you have an account/records, just give the relevant information first. Obviously don't be an asshole like the person in this story, but even if you're the sweetest person on the planet, you will be helped more efficiently if the person on the other end knows who they're talking to. ",
            "I live for these sort of heartwarming stories. I love it",
            "You didn't even include the most important detail! What score did you eventually end up with in breakout? ",
            "Few things satisfy me more than listening to someone rant irrationally and then pausing just slightly too long before responding and watching/listening to them become flustered.",
            "As a fellow ex-call center agent, you're my hero",
            "When I worked in a call center the only two times I had 40-minute calls were from chatty old guys, who would manage to call right before my lunch break. Waiting for lunch, especially if it's already a late lunch: not fun. But they were nice guys, so there was that.",
            "When The Click Of Call Termination Feels Like The Clap Of Thor's Hammer.\n\nAh, yisssssss",
            "My fiance also works to call center and has gotten calls like this and his supervisor just told him to transfer it to the closed department. The clothes department just has an automated message saying \"Sorry we are closed now. We are open during (hours)\" and it hangs up on them.",
            "Nice. ",
            "Absolutely genius. Didn't have to do work, still did your job absolutely right.",
            "When I was in a call center, I was at the top of the call order. I hang up one call and the next instantly rang before my left the phone.\n\nInstantly people who just rant and yell at me, I still had to figure out who they were before I transferred it, even if they ask for a specific person. Worst job ever.",
            "Fucking beautiful. ",
            "When I worked in a call center, I loved hanging up on customers that cursed at me. They get the first warning even if it isn't at me, second one is me letting them know I am disconnecting the call.",
            "r/talesfromcallcenters",
            "Haha, I have a similar problem at my job, but not to that extent. I literally CANNOT pull up your machine or any details about it without the number that says \"for service, please refer to number XXXXX\". I have to remind our own technicians of this half the time, aand customers are a nightmare. Most of them don't even know how to use a phone and I don't get their names until I have to ask for it. ",
            "I value your humor more than your paycheck.. but your paycheck doesn’t feed me so. Also, did you finish your game?",
            "The customer is always right is a silly old myth that only morons fantasizes could be true",
            "How the fuck does someone talk for that long without any kind of response from the person they're talking to?",
            "I used to work for a laaaarge ISP that everyone hates (realistically what ISP don't people hate) and I loved hanging up on people who started screaming and cussing. We actually had the power to do a lot of stuff that other departments couldn't but if the customer wouldn't stop swearing long enough for me to help them... oh well. ",
            "> I AM THE CUSTOMER AND THE CUSTOMER IS ALWAYS RIGHT. I PAY YOUR WAGES! \n\nOoh that line really bristles my britches...  \n\n\nI want to go back in time, find out the jackass who came up with that term, and Julius Caesar him until he's nothing more than a pulsating mass of entrails on the ground.\n\n&#x200B;",
            "May I recommend posting this to the sub /r/talesfromcallcenters?",
            "I had a friend who works for (MAJOR CABLE COMPANY). He does the retention center. Lots of angry callers.. The one thing he taught me is.. These people are normally more than willing to do everything in their power to help you, or try to direct you to someone who can help... If you are patient, understanding, and kind to them. Often if they can't resolve your problem it's because they're literally incapable of doing anything..\n\nBut if your rude, snide, or in general an asshat... They will not be able to do much and cannot guarantee anything will be resolved.\n\n\"Have a nice day and thank you for choosing (MAJOR INTERNET SUB-FORUM SITE).\"",
            "\n>AC: YOU'RE A FUCKNG IDIOT! YOUR ENTIRE COMPANY IS FULL OF RETARDS!\n\n\"No, you\"\n\n*click*",
            "You've handled that perfectly IMO XD",
            "I've had to tell grown women, if they can't act like an adult, I can't help them. It works wonders.",
            "I used to work at a call center and it was the worst experience of my life, but hanging up on angry customers that seem to think you're personally responsible for their issue was the highlight of my time there i used to pray that they'd start swearing at me.",
            "Oh man this is like a fine MC wine with notes of well deserved, perfectly executed, and massive benefit to OP in the form of a long break.  Delicious.",
            "I love this. You should be commended.",
            "Just gorgeous. I love this story.",
            "I feel righteous on your behalf ",
            "8/10 totally worth the read. ",
            "There's more than a tad of thathappened with this post. 40 minutes really? A first aider and two managers walked past while you were playing Atari Breakout in a call centre. For 40 minutes. Yeah right.",
            "\"Young lad\" after screaming at you?  Either this is made up or England",
            "Unpopular opinion time: I think as a customer it is ridiculous to have to wait for 20 minutes to get someone on the phone. And when your customer is complaining about the waiting time, it’s best to acknowledge that in an empathic way instead of ignoring it and just asking for their account info. Source: did customercomplaints service for 6+ years.",
            "I can kind of understand the customer's anger - if I had been waiting 20 minutes plus, I'd be pretty annoyed too.\n\nHaving said that, his/her way of expressing her anger was absolutely wrong - swearing and getting angry at the messenger, not the message. \n\nWell handled OP, great story.",
            "I’m so excited to do this at work now.\n\nThank you for this! ",
            "Lmao that lady is retarded. ",
            "how did that breakout game go",
            "The end part was brilliant ",
            "##what an idiot ",
            "Malicious. and Compliant.\n\nReminds me, I need to tell people about my buddy PJ.",
            "fair chance that was my mom, sorry about that op",
            "this happened to me before too! esp bc i was working in a the call centre of a hospital, the patients feel so self-entitled it is disgusting. i can understand that they want to get their appointments asap, but they should have at least shown me some basic respect. ",
            "After 40 mins \"HI this is Lenny!\" ",
            "I applaud you.",
            "#heynow",
            "Fast and \\*Furious\\* customer.",
            "# #NUT",
            "What’s your high score in breakout?",
            "#SHALL I BE BAMBOOZLED?\n\n##Edit:  HAHA! NO BAMBOOZLE",
            "> All the while, I had a first aider a \n\nWhat exactly is a 'first aider'?  I mean, from context, I would assume 'one who renders first aid', but is that a position or something at your call center?",
            "You are officially my hero. This is pretty similar to my experience with everyone asking me anything in school or university... \nmost everyone: “No! Let me finish, you don’t get to talk until I’ve told you every last detail.” \n*proceeds to give an extremely long and drawn out explanation of their problem*\nMe: “yeah, okay, so.... I’m a nerd, but I don’t study physics... I’ve got no idea.”\n",
            "I know you said gas company, but it sounds like you could also be customer service for Verizon. Way to help your customer. ",
            "You should hear customer service calls in australia..the level of swearing is ridiculous.. but because its so common its more of a game than an anger thing.. think super troopers meow.",
            "As someone who works in a medical clinic\n\n>I just sat there for 40 minutes with my headset muted, playing Atari Breakout on the Google Images page.\n\nThis is my daily life haha. I usually get all the information I need within the first 5 minutes, but patients love to go into every single detail before they even ask the question.\n\n\"So I saw my primary care physician and he noticed some swelling in my knee which is really strange since my knees never swell. He referred me to musculoskeletal and they couldn't help me. I'm getting really frustrated since this problem has been going on for a few months and I just want someone to help. I am a teacher and I really need to get back to work because my boss has been getting on me about taking too many sick days and I don't have any PTO left. My primary told me to contact your office because he thinks a rheumatologist can help and I've read great things about the doctor at that office. Can I book an appointment?\"\n\nJust say, \"Hi, my name is FIRST, LAST and I need to make an appointment.\" That's it. Nothing else. Everything else doesn't matter, and I'm just browsing the internet waiting for you to finish talking. Also, sob stories don't make appointments magically appear.\n\n&#x200B;",
            "This is 'medium'? I've seen 'long' posts about this length. \n\nAre there any specific rules about post length and appropriate tag?",
            "I'm pretty sure this didn't happen, particularly because of the oh-so-convenient 5:05pm on a Friday at the end, however it was still a good read. Thanks for the story!",
            "Not gonna pretend I never did shit like this before.\n\n\nMy personal favourite was transfers to pizza hut or something equally as hilarious and sitting in on mute for the rest of the call \n\n\nBonus points are awarded if they actually order a fucking pizza.\n\n\nI never was that good.",
            "Man, that customer sounds like a retard.",
            "One of my favorites on this sub!",
            "Perfection.",
            "What's wrong with the word retard? ",
            "Retard."
        ]
    },
    {
        "post_id": "qblqbn",
        "author": "aikdxz",
        "title": "Malicious compliance at work (three for one special!)",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/qblqbn/malicious_compliance_at_work_three_for_one_special/",
        "score": 13684,
        "num_comments": 348,
        "created_utc": 1634679732.0,
        "selftext": "Back at the beginning of 2021, I worked at a small community health non profit with an insane CEO. She would constantly call team meetings to put down and belittle employees in front of the entire staff. Often, she would throw around some variation of \"do I have to do everything around here?!\" and call everyone on staff incompetent. When we did do something right, she never gave us credit and always took the credit for herself. She threatened firing everyone constantly and would randomly call us to gossip and make petty remarks about each other, pitting staff against each other. \n\nOne day, the CEO called a team meeting. In a group text chat between some of the more chill employees, we immediately begin sending snake and eye roll emojis. Sure enough, we get on the call and she begins by bringing to our attention how \"Louise\" does not dress appropriately for work. Louise, who is also upper management (the COO), looks about ready to smack the CEO. The CEO viciously tears into Louise, commenting on everything from her hair style to her lipstick shade to how it's inappropriate for Louise to wear off the shoulder blouses that show her collar bone. She then tells everyone that we all had better start dressing more formally or there would be consequences. \n\nThe next day, the CEO calls another meeting. We all join and Louise turns on her camera. I immediately had to turn off mine because I did not want to be caught laughing my ass off. Louise was dressed from head to toe in what looked like something someone would wear to prom. Her hair was immaculately styled into an elaborate updo, her makeup was professionally done with lash extensions and everything. She was dripping with (what I assume were) fake diamonds... tiara, earrings, necklace, bracelets, and rings. And she wore the most ridiculous navy blue satin and tulle formal gown with a faux fur shoulder shrug to cover her collar bone. My best guess is that it was an old bridesmaid dress, but she never did say where she got it. \n\nThe CEO was immediately fuming. \"Why are you dressed like that?!\" she screeched.\n\n\"You told us to dress more formally. This is formal wear. Is something wrong?\"\n\n\"That's not professional for work!\"\n\n\"Oh, I'm sorry, I must have been confused! You said we needed us to dress formally, but I think what you meant to say was professionally.\" The CEO was livid, but Louise continued to rock the prom outfit all day, meeting with patients and clients and everything. \n\nLater that week, \"Tina\" texts our group chat and says the CEO is requiring her to submit and detailed time sheet with what she was doing and working on down to the minute for her entire day. She was going to bcc us on the email. Sure enough, it pops into our inboxes a few minutes later. \n\nTina had literally detailed her entire past 24 hour day down to the minute. 6:45 AM, awoken by husband's flatulence. 7:00 AM, peed and changed menstrual pad. 7:02 AM, began bowel movement. 7:10 AM, completed bowel movement. 7:12 AM, turned on shower. 7:13 AM, tested water temperature with hand. You get the idea. Apparently the CEO called her on her cell phone and berated her for sending such a detailed timesheet. Tina reminded her that she had requested her entire day down to the minute, and didn't specify she meant her work day only. \n\nFinally, my turn. My job was in IT and most of my work was as a database administrator, but I often helped with other tech problems. One morning, the CEO called me repeatedly at 2 AM. My phone settings have it so that if I miss five calls in a row from the same person, the do not disturb mode is turned off and the phone rings. I see who it is, silence my phone, and refuse to answer. \n\nAt 6 AM, she calls again. Again, I refuse to answer. 7 AM, refuse to answer. 8 AM, refuse to answer. Finally, at 9 AM, I call her back. She asks to hop on a video call. \n\n\"I've been trying to get ahold of you all morning! Where have you been?!\"\n\n\"*Loud sigh* Can I help with you something?\" I asked, not even trying to hide my irritation. I literally rubbed my temples and slurped on my coffee loudly.\n\n\"You didn't answer my question\"\n\n\"And I'm not going to. I was off the clock at the time you called\"\n\n\"You're salaried, right? That means it doesn't matter if you work 100 hours or 1 hour, you get paid the same. So I expect you to be available when I need you\"\n\n\"What do you need?\" \n\n\"I need you to reset all of our company usernames and passwords. We're letting someone go today and it's company policy to change all of that\"\n\nAt the same time, Louise texts me that she is being let go. So I read the company handbook and make a copy of the page that says the IT person must update the usernames and passwords and give the information to the COO. I changed all of the usernames and passwords to everything, from social media accounts to bank accounts to QuickBooks and emails. I send the usernames and passwords in an encrypted email to Louise and then send the CEO my two week notice.\n\nTwo weeks go by. It's the last hour of my last day. So what do I do? Change all those usernames and passwords again and send them to Louise, who was also celebrating her last day. I log out of my email, put my company phone and laptop in the mail, and spend the evening cackling at my malicious compliance.\n\nThe very next day, on Saturday, the CEO calls me repeatedly. Finally, she leaves me a long and howling voicemail to say what I did was unprofessional and she would make sure my reputation suffered and I would never work in that industry again. I wait until Monday to call her back.\n\n\"Hey, CEO, I saw you called?\"\n\n\"I need the usernames and passwords to everything!\"\n\n\"I'm sorry, but I don't work there anymore. You will have to contact your IT person to help with that\"\n\n\"You are the IT person!\" \n\n\"No, I was the IT person. Now I'm a private consultant and I would be happy to provide my services at a rate of $100 an hour\"\n\n\"You changed all the usernames and passwords and didn't provide them to me!\"\n\n\"Correct. Per company policy, when an employee leaves the organization, the IT person is supposed to update everything and send the new info to the COO. I was leaving, so I updated everything. I provided all the usernames and passwords to Louise\"\n\n\"You knew she was quitting too! Why would you give them to her?\"\n\n\"Because the company policy says to transfer the new username and passwords to the COO, not the CEO. Louise was the COO when I left\"\n\nCaught in her own bureaucracy, she then had to spend weeks trying to gain access to all of the company accounts.\n\nOn Louise's and my last day, Tina and another employee quit. Another person announced her retirement. Once the five of us were gone, we were followed by several other employees. In total, 11 people on the 14 person staff quit within a few weeks. The best part? I got a new job making the same amount I did at the shitty non profit, but part time in a government position and with full time benefits. So much for my reputation suffering! I stayed in touch with one of the employees who stayed behind (she's only three years away from retirement and is basically Stan from the office). She said they've hired at least a dozen people, all of them quit as soon as they could find another job. \n\nAnyway, I'm bored in the hospital and started going through old texts. Stumbled on our old group chat and had a good chuckle. Thought you all might find it humorous too. Names obviously changed.\n\nEdit: I'm still new to Reddit, so I had to ask my husband about the awards. Thank you all, it's very sweet of you, but please don't spend your money on this. If you want to show solidarity, consider donating to The Crohn's & Colitis Foundation so we can find a cure.",
        "permalink": "/r/MaliciousCompliance/comments/qblqbn/malicious_compliance_at_work_three_for_one_special/",
        "comments": [
            "So out 14 people, 3 were left. One was Stan. One was the CEO.\n\nWhat the hell is wrong with that third person?",
            "I’ve been reading these all day, and I’ve found one common denominator: never piss off IT people lol",
            "How does the non profits board not see the CEO as a problem. \n\nFun mc tho!",
            "I had a boss call me like that once at night. I’m a DBA as well. I didn’t answer. \n\nShe had the nerve to ask me on a team conf call the next day why I didn’t answer. I said it was none of her business. \n\nShe never called again outside business hours.",
            "This is legendary pettiness.",
            "Not all heroes wear capes.  Some wear prom dresses.",
            "Keep in contact with the old COO. She'll give you a good reference from that office, if you need one in the future.\n\n(Edited for typos, spelling)",
            "Does CEO stand for Chief Evil Officer at that company?",
            "I love your coworker.\n\nI had something similar requested of me when I was the last person remaing of an 8 person team and was actively interviewing to leave myself.\n\nMy weekly log ended up being 30k lines long and I spent more time writing it than working.  Even put in lines for \"spent x minutes updating log.\"  \n\nThe best part is when I left a month later they had to use those logs to figure out what the hell they were doing.  Even tried calling me daily for about 3 weeks until they got the hint.",
            "Shit, I have a buddy with a pretty severe case of Crohn's.  Hope yours isn't too bad.  Good story.",
            "Wonderful.  You had my upvote at the blue formal dress already.  The rest is delightful overkill.",
            "> and slurped on my coffee loudly\n\nIf no other thing, this alone would have pissed me off to no end.\n\nNot A Manager.",
            "I aspire to be this petty",
            "Only $100/hr? As a former DBA whose boss asked him to help out a bit after I left (amicable parting) I believe your rate was a bit too low. Glad things worked out well though!",
            "I wonder if I know where you work... LOL I interviewed for a position at a not for profit organisation and I swear, the CEO was a psychopath.\n\nShe introduced me around the office and every single person we spoke to had the \"deer in the headlights\"  look.  One of the most dysfunctional workplaces I have ever encountered.\n\nI got offered the job, but when I told my current boss, she made me a counter offer I was very happy to accept!   I didn't want to leave anyway, but felt that upper management didn't want me, hence looking for another job.  My boss is the best I've ever had.  She got me a reduction in hours and a 10K pay rise.  Winner!!",
            "The Crohn's & Colitis Foundation\n\nTransaction Date: 10/19/21\n\nLevel: Other\n\nAmount: $5.26\n\nCrohn's and Colitis is literally shitty",
            "I was like \"yup this is MC but nothing special\" until I got to that one about giving \\*Louise\\* the updated informationg because of \\*Louise\\* leaving. That's just :chef kiss: right there.",
            "Glorious",
            "This is some delicious MC right here.",
            "Folk should have sent a letter to the board detailing the problems and abuse with the CEO.  Usually they are under contract and having so many people quit would have interested them enough they might have searched out a new CEO.",
            "It's already a big red flag for someone running a small nonprofit to call themselves a \"CEO\" instead of the traditional \"Executive Director.\"",
            "In the words of the late Dick Emery, \"Ooh you're awful, but I like you.\"",
            "The mc trilogy we never knew we needed",
            ">consider donating to The Crohn's & Colitis Foundation so we can find a cure.\n\nAs long as it's not the foundation with this CEO...",
            "*chef's kiss*",
            ">My phone settings have it so that if I miss five calls in a row from the same person, the do not disturb mode is turned off and the phone rings. I see who it is, silence my phone, and refuse to answer. \n\nSorry, how do you do this?",
            "Sorry, still gave you a silver award, which costed me zero, out of malicious compliance",
            "\"I need you to reset all of our company usernames and passwords. We're letting someone go today and it's company policy to change all of that\"\n\nI was hoping you reset everyone, including yourself.",
            "I love that the others got their MC in too! Thank you for regaling us with this trifecta Gene ;)",
            "Outstanding",
            "Regarding your awards comment: most users don't actually spend money on them, as far as I'm aware. At some point reddit started giving them away to users for free, and so people will give them to posts like yours without any money actually changing hands.",
            "I had saved this to read it later and just got to do it today morning. You are the first person on reddit i see promoting a charity instead of just saying thanks for the awards. I hope you have the best day you could have.",
            "\\*bows to the master of mc\\*",
            "\"I'm a consultant now\" is a great thing to be able to say.\n\nWas this an FQHC?",
            "Tina is my spirit animal. You're pretty cool too OP.",
            "You magnificent bastard.",
            "This was such a delightful ride. I literally got lost in it, feeling like I was reading an engrossing book and not thinking about where I was. Thank you. \n\nWith regards to the awards, a lot of people get them for free (if they’re using the Reddit app, they get one free one a week or so; if they were given certain levels of awards they also get free coins that can then be used to ‘buy’ awards). Or they may already have a Reddit premium subscription which gives them a certain amount of coins every month. Or they may be straight up buying them for 3.99 or whatever it is. Basically, I’m saying you can enjoy the awards instead of feeling bad about people spending money on them :) \n\nThat’s what awards are for! To make people feel happy. They also give a post more visibility, so more people will get to read and enjoy it.",
            "[deleted]",
            "$100/hr\n\nTry $1,000hr with time being bought in 10hr prepaid blocks.",
            "Just a quick heads up, since you say you're new to Reddit:\n\nEveryone can see everyone else's post and comment history. Anyone (even people not on Reddit) can click on a person's profile and see that person's entire history of posts and comments (unless a user deletes their posts/comments). \n\nThere is no way to make a profile \"private\", so unless you're okay with Louise, your COO, being able to see literally ALL of your past and future posts/comments, you should probably create a different Reddit account and throw this one away. It's also possible that she could share your account name with someone else, and they would also be able to see all your past/future posts & comments. It's probably not very likely that anything bad will come of you losing your anonymity (to this person), but considering how easy it is to make another Reddit account, in this case it's probably better safe than sorry!",
            "I have heard from multiple people that non profits seem to be the worst to work at",
            ">Edit: I'm still new to Reddit, so I had to ask my husband about the awards. Thank you all, it's very sweet of you, but please don't spend your money on this. If you want to show solidarity, consider donating to The Crohn's & Colitis Foundation so we can find a cure.\n\nI don't know if someone else said this already (there are a lot of comments), but every few days, you get a free random award from within a limited pool of possible awards. Once you redeem it, you have 24h to bestow it upon someone. Looking at your awards, all those that you received multiples of are from the pool you can get for free. The unique ones are from the premium-only pool. Hopefully that reassures you a bit.   \nIt is very selfless of you to urge people to contribute to non-profits instead, I raise my hat to you :-)",
            "You should also post this in r/ProRevenge",
            "That was genius",
            "One of my best friends has a Chron’s. It’s brutal. You have my prayers!!",
            "Awesome story.  Bonus points for the CCF shout-out!",
            "> \"No, I was the IT person. Now I'm a private consultant and I would be happy to provide my services at a rate of $100 an hour\"\n\nI would have added an extra zero!",
            "It sounds very similar to customer I had at my last job. The guy use to call us to set up new users on our software and they had the occasional issues the first month.\n\nThis guy, who owned the company, would say horrible stuff about his staff to us on the phone, while the employee was sat next to him... He had such a high turnover as well. \n\nHe also fired all his staff, then started rehiring, during this time he complained about how incompetent they all were, but had to get us to help him use our system. Eventually our manager cut him from calling us until he completed training on the system with one of our trainers.\n\nLast I checked with someone who still works there, he still berates his staff and I reckon his turnover is high, but he definitely doesn't think he's the one at fault.",
            "Someone needs to tell the CEO that Ayn Rand's ideas are total crap, and don't work in the real world.",
            "So you can just change everyone's password, and user name, and don't just invalidate all passwords such that the user has to create a new one? Seems like the IT system is proper fucked if that's the case, like that is just a terrible, insecure policy. Also what's the point of sending them out even encrypted? You shouldnt be storing passwords, only the hash of the password. If the plain text exists in any form that's really bad. Encrypted is better than not but now if they break one encryption all your passwords are fuk. I'm skeptical of this",
            "Hahahaha. Love this!!!",
            "Gene?",
            "I have volunteered for non profits and also worked for not profitables.",
            "BRAVO!!!!",
            "This is important, yes. Quantum compliance.",
            "Fantastic story",
            "This sounds like something the belchers would do",
            "Is there no board? This is a shit CEO for a non profit especially. She should be fired out of a cannon.",
            "Rosey wasn’t even all at once??",
            "The part about Tina's schedule had me laughing out loud, too funny! I needed that, thanks!",
            "This was SO great! You write very well , i hope you realize that. Take my free award of the day and i hope you feel better soon.",
            "Mate it is so nice to read your comment for the crohns/UC foundation. You're awesome.",
            "This is so sad. Why are there so many insane and abusive bosses? This reminded me of a boss I had at a nonprofit…. Verbally abusive and unhinged…. And it was a nonprofit for helping women dealing with domestic violence! \n\nI’m so glad you quit and sounds like you’re in a much much better place now. Your malicious compliance was *chef’s kiss* perfect.",
            "Wow. That CEO was very inflexible and unreasonable. Also a huge idiot. How many times does a person have to shoot themselves in the foot to realize they should not point the gun at their foot (in other words, don't give out ultimatums without first checking to see what the repercussions are going to be)?",
            "I tried doing a fundraiser (walkathon thing) for a local CCFA group and lasted about 2 weeks until giving up because of the group's leader doing the same thing.  To volunteers!  He got really hostile toward someone who called him out.\n\n\"I don't pay you to sit around on your a$$es all day, so get out and get us some donations!\"\n\n\"Umm.  We're volunteers.  You don't pay us at all.  And, I don't know about you, but that's what I usually sit on, especially when I'm on the pot!  Maybe it's been so long that you've gone that you forgot about that, what with your head plugging it and all.\"\n\nNow, I just make a donation directly.  I don't get to the claim the hours worked on my taxes, but I don't have the stress which is a great tradeoff.",
            "Loved the story, hope you're out of the hospital and feeling better soon. Fuck Crohn's.",
            ">Back at the beginning of 2021\n\nFor a moment I thought this was in 2000...",
            "Surprised that Louise got 2 weeks after told she was being let go. Great story tho!\n\n\nPS hugs, helpful, wholesome, and silver are all common free awards. Sometimes getting awards give points that you can use to give other awards. Source: I have an awarded karma but haven’t paid a cent.",
            "Um, the Reddit app periodically gives people free awards that they can hand out within 24 hours.  So they might have found you to be the most worthy person in sight without having to spend money on it.",
            "Just brilliant. You are a special person. I have a niece with ulcerative colitis and they will get a donation❤",
            "This is not the first time I’ve heard of non-profits being radioactive workplaces",
            "My friend has Crohn's/Colitis and I know how much it sucks. I always tell her when she is in hospital: I told you to stay out of there!\" her: \"I tried!\"  Followed by laughter. I hope and pray for a cure because I have witnessed her misery. Stay strong and much love to you and your husband.",
            "> Now I'm a private consultant and I would be happy to provide my services at a rate of $100 an hour\"\n\nNo consultant would charge that little.",
            "This sounds a lot like a little larping story but if not then good for you",
            "[deleted]",
            "TL;DR?",
            "[deleted]",
            "I was wondering why you all stayed when she was so awful. But I was very happy to see CEO was left with just 2 people at the end!",
            "You as IT were salary? How does someone have the nerve to ask a SALARIED employee for a breakdown of time. She was salary, it doesn't matter if she works 100, or 1. It doesn't matter how she spent her day.... wow",
            "Absolute comedy gold",
            "I'm guessing this is an ANZ story, before Delta reared its ugly head?",
            "That is some delicious malicious compliance. And may I add a very worthy cause for donations. I hope your health improves and that things get better. Crohn's and Colitis suck majorly. From a fellow patient hoping you swift improvement.",
            "JFC, imagine thinking because you're salary,  that you must be available to work 24/7.  Not how that shit works.",
            "How can these kind of people even end up as CEO's and/or managers?",
            "Tina? What a star! You are all MC stars!",
            "Bravo. This is awesome.",
            "99% awards are free awards .. no money spent",
            "[deleted]",
            "🥇🎈 for the crohn's part. 🏆 for the rest",
            "That was great!",
            "This was thrilling to read. Justice for one is sometimes justice for all.",
            "Gold great job :)",
            "Did anything bad happen to the CEO? Did she get fired?"
        ]
    },
    {
        "post_id": "fdu8b7",
        "author": "get_in_the_tent",
        "title": "Housemate terminated the lease without asking, so I moved out immediately with the fridge",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/fdu8b7/housemate_terminated_the_lease_without_asking_so/",
        "score": 13679,
        "num_comments": 309,
        "created_utc": 1583409665.0,
        "selftext": "This happened some years ago, I was reminded of it by reading stories on here.\n\nI'd just moved to Sydney, and had been living in a sharehouse for a few months, that I found though a flat-share website. We got on ok, would go out to parties together etc. Most of the stuff in the house was theirs, I only brought my fridge, and they had just thrown theirs out, considering it replaced.\n\nI'm about to get the week's groceries and ask my housemate if she wants anything, no she's good. I get lots of food to cook for the week and come home, to find her standing awkwardly with her boyfriend. She had \"weird news.\" They had decided to move out together! How exciting! Ok, so I guess that means I take over the lease? Nope, they considered themselves the last in a long line of friends who'd leased the house, and being the last to go, thought it fitting to terminate the lease. They had notified the landlord prior to speaking to any of us. They figured I could stay with my sister, jack was only in the country another month, and Sarah was hardly here anyway.\n\nOk so I didn't have a leg to stand on, legally, I wasn't signed on the lease, so I had 3 weeks to vacate. Househunting is like a part time job, and I already had a full time job. No time to cook all that food I guess. Would have been good to know before the shop.\n\nI got lucky and found a house just down the road on the same day. Nice people, good spot, and close enough that I could move my things in by hand, immediately if I like! I slept in my new house that night, but I always like to think you haven't really moved in until your fridge is in, and don't worry I had that sorted too.\n\nThe others in the house found new places quickly too, leaving the happy couple home alone.\n\nI came back to pick up a couple of loose ends 3 weeks later and got to see their fridge workaround in all its slumly glory. An Esky full of food floating in melted ice. The revenge was petty and small, proportionate to their actions.",
        "permalink": "/r/MaliciousCompliance/comments/fdu8b7/housemate_terminated_the_lease_without_asking_so/",
        "comments": [
            "Wowie, didn't even have the common courtesy to talk to you about it before TERMINATING the lease.\n\nThis reflects pretty poorly on any and all decisions they're bound to make in the future. Good luck, dummies. Yeesh.\n\nAt least you were able to find another place pretty damn fast; I've had friends house hunting for months, only to have people buy houses right before they're viewing appointment. Bought. Even though the owners were originally looking for just renters.",
            "Next time talk to the landlord right away.  They likely didn't terminate the lease, it expired and they didn't want to renew.  They didn't want to mention bringing you on at the time because subletting was likely a violation of their lease and would have cost them their deposit + additional fees.  It's also very possible that without actually knowing what was on the lease you were paying more than your fair share.",
            "Lol I've done that.\n\nClassmate/house owner \"kicked me out\" of renting his spare bedroom the day before class started for the semester. I didn't own any of the appliances, but I did own all the lamps in the house and all the pool cleaning equipment. And I was the one paying utilities. Signed a lease on an apartment that day, moved my utility account effective immediately, and got all my shit into my new apartment before he got home. He texted me at the end of the day trying to tell me I had until the end of the month to find somewhere else, and yes I needed to pay rent and utilities for the month. Nah I'm good.",
            "I still don't understand why they didin't discuss it previously?? if they move out in 3 weeks it's fine, you can find someone else to take their spot or something, it's your flat too god damn it!",
            "\"In all its slumly glory\" is a phrase I will definitely be using in the future.",
            "I once gave my freezer to a complete stranger so that the roommate that forced me out of the house couldn’t use it. It wouldn’t fit in my new place and that roommate was the only one of us who actually used the freezer (I’d gotten it from my parents when they got a smaller one). \n\nSo I get it.",
            "They wanted to take the deposit back. \n\n\nWho ever signed the first lease paid a deposit, and everyone from then on just rolled that same deposit over to the next friend. By being the last they get that money back. \n\nDick move.",
            "I wonder if they have to supply a new fridge to the house for the landlord before moving out or if the old fridge dying was something that is the landlords problem. Hopefully it's their problem.",
            "Malicious appliance.",
            "What kind of stupid sentiment uncourteous bullshit were your roomies pulling.",
            "Dumb people (the lease terminators) make dumb decisions, and get dumb results (no fridge). Although it still baffles me that they were making plans for where the rest of you would go live. Like what happened with the poor guy who was abroad for a year? How was he supposed to make arrangements for any of his things left in the flat? And while Sarah was hardly there, it was still her home! I was hardly ever at home during high school, but it was still my room in my home with my things. I hope those lease terminators got food poisoning from their watery fridge.",
            "I had sort of an opposite situation with my last roommates in college. We were three girls sharing one lease and since we were all graduating I figured we would all be moving out so I got the forms for the notice to terminate the lease and let them know to sign it. The third roommate who I barely knew as she was never there informed me that she and her bf would be moving in and resigning the lease, and that would mean I couldn’t get back any of my deposit that I was hoping to get back (and she would get to rent our place without paying any deposit and pocketing the refund when she moved out later on). At first she refused to pay me the deposit I paid and told me the landlord said she didn’t have to either. I was not ok with this so I put up a fight and refused to sign the addendum that would take me off the lease and let her and her bf resign for another year until she agreed to pay me my part of the deposit!",
            "I’m American, what’s an esky",
            "I had a housemate with whom I had an arrangement: I would pay the electric, she would pay the gas, and if they ever seemed excessive we could talk to each other and reconcile the difference.\n\nIn practice we never ended up talking to each other to reconcile bills, things were kinda steady with the elecrtric and she just didn't talk to me about the gas. \n\nOne winter morning it was cold. It turned out she had never (ever) paid the gas, used the money to go clubbing and buy alcohol, and thought if she didn't pay it she could make me pay it. I refused, put a space heater in my bedroom, and started using the shower at work. That night I came home and found she had taken my space heater to use in her room. (I turn it off whenever I'm not there, so it's not a fire hazard. She turned it on and left.) So I took it back, heated my room that evening, and hid it (unplugged, of course) when I left for work.\n\nShe moved out two days later. The landlord tried to stick me with the rent for the whole place. I refused, on the grounds that my agreement with him was to rent my bedroom, not the whole place, the rest of the place was *his* problem. He then tried to get me to pay the next month's rent. (It was going to be the last month, the lease was up and I wasn't going to stay with a crappy landlord and no heat.) I pointed out to him that he had not asked for a deposit, he asked for \"last month's rent\", I had written that on the check, he had cashed it and not deposited it in a bank and given me statements as would have been required if it was a security deposit, so I wasn't giving him another dime. And I didn't. I had an empty 3 bedroom apartment for a month and moved out.",
            "TIL when some people rent, they have to bring their own fridge.",
            "I was moving out of my last place and I had brought the microwave with me when I moved in. It still worked, but the turntable was gone in it, so I didn't want it anymore. I still lugged it all the way down three flights of stairs to get it outside and heaved it into the dumpster so that my b*tch roommate didn't get to keep it. She'd been using it more than I had been. She also scratched one of my frying pans, so of course, that had to go too. If she had been able to be a nice person, I might have actually left them for her.",
            "And that, folks, is why you don’t sublet\n\nEdit: spelling",
            "From what you said here, and a few of your comments, my guess is that they lied about terminating the lease and just said that to get everyone to move out so they could live there together, alone. We’re they in the middle of packing their things up when you returned, 3 weeks later? Or was all the furniture in place as usual?",
            "This is why you get yourself on the lease.",
            "Why didn’t you call the LL with the other roommates and sign a new lease?",
            "I want out of my lease in a year and three weeks. I told my roommates months ago!! This is just insane.",
            "They really stuck the knife in here for whatever reason but such a nice way to turn it around on them. I hope they learned a lesson here. You just don't do this shit to other people. Nasty fuckers.",
            "As an expat it gave me great joy to see the word Eksy here in the wild on reddit.",
            "This is why I will never again move into a sharehouse with a couple. Everything is automatically 2v1 and whoever has the worst personality makes all the decisions.",
            "what in the world is an \"Esky\"?",
            "What’s an Esky? Is that like a cooler?",
            "\" I always like to think you haven't really moved in until your fridge is in \".  \nWhy do I relate to this so much.  I don't think this, but god I understand where (and what bit of your brain) you're coming from. I suppose I'd have my own version of this.",
            "I feel like you and this fridge are going to have some adventures, or at least the fridge will feed your adventures!!",
            "My brother did this to me after I suggested his gf start paying 1/3 of the rent since she stayed there most nights.\nSoon afterwards he cancelled the lease without consulting me.",
            "And this is why you never live somewhere you aren't a legal stake holder.",
            "Regarding everyone’s advice about OP taking over: they weren’t on the lease.",
            "A few years ago I had a share house break up due to various reasons, which I won't go into.\n\nI figured that we'd last out the lease - it ended in February, and this was late November/early December - then we'd go our separate ways.\n\nNope. My housemate informed me on the 6th of December that she'd be moving out on the 22nd, taking all her things - including the fridge, washing machine and most of the furniture (fortunately she at least agreed to keep paying her part of the rent until the lease ended). I already had plans for the next couple of weekends, and was going down to stay with family for Christmas on the 22nd.\n\nI luckily managed to find a place quickly and come back early from my Christmas leave to move, but for three weeks before Christmas as she moved her stuff I played the game 'what will be gone when I get home today?'\nOne day I'd get home and there'd be no cutlery. Another day: plates were gone. I made a quick trip to Big W and bought a few basics so I could get by, so it was more amusing than anything else. I enjoyed the absurdity of the situation, and her petty lack of communication.",
            "That was very proportional and reasonable revenge. Good on you can OP.",
            "I do love it when non United States native English speakers post, because it often means that Statians have to put up with the same shit we have to put up with :P. (Terminology that makes no sense outside of the country)",
            "Fuck them... I wish people like that would just disapear and leave more oxygen for the rest of us...",
            "So this house rental: renter must provide own refrigerator? I've never heard of that before.",
            "Pl\n \n  \n \nP\n P",
            "What is an \"Esky\"?",
            "I hope you took all those bought food with you...",
            "Where is the compliance to anything in your story?",
            "Not MC."
        ]
    },
    {
        "post_id": "l3k05j",
        "author": "fortuo7",
        "title": "Work in a call centre? Need to increase talk time?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/l3k05j/work_in_a_call_centre_need_to_increase_talk_time/",
        "score": 13654,
        "num_comments": 371,
        "created_utc": 1611434402.0,
        "selftext": "Call old guys, ask them about fishing, cars, military politics. Call old ladies, tell them you're considering kids with your husband/wife, ask them about their grand kids/kids. (NOT 'where's your grandkid live?' but 'you remind me of my grandma I bet you're the one your grandkids call when they're unsure of big choices like this). \n\nSource: Got pulled into a meeting to discuss the fact that despite murdering every other KPI including upsells NPS ( net promoter score, essentially how much they liked you and would recommend the company based on their experience) my avg talk time was lower than what they wanted. Got pulled into another meeting at the end of that shift to discuss my 6 hour call with a WWII vet, and told to not worry about talk time in future.\n\n\n\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxx\n\n\nEDIT: Cheers for first gold!\n\nTo clarify some points on the 6 hour call with Arthur:\n\nWasn't my first long call, but definitely the longest by 4 and a bit hours. Sometimes when we'd already hit targets for the day and didnt want to lower our strike rate we'd ride out a call for 45 mins or so till the end of shift. Sometimes with genuine convo, more often we had to milk it.  \n\nThis call however took no work on my part I got really lucky, I felt like I was talking to a version of myself who was just born in the 1920s we had such similar takes on so many things. If I met this guy at a pub I woulda ended up talking to him for ages as well. \n\nAbout an hour and a half in he asked if I had to go and do some work since he wasn't buying or upgrading or anything, in my service voice I told him something along the lines of  'Here at (Giant Telco) every customer is invaluable so my job is to make sure you're getting the most out of your telephone and internet services, and we don't put a time limit on that process.' \nHe definitely knew there was some shenanigans going on my part as we'd talked about corporate beurocracy (as well as everything else under the sun) \nI think he just assumed it was my last day or something. \n\nI managed to take multiple pee breaks (as did he, where I talked to his carer for a bit) and I even ducked down to grab some food (which I ate at my desk) just by asking him if it was alright if I popped him on hold for a couple minutes. \n\nI originally posted this as an answer for a ULPT request and had multiple suggestions to post it on here. Glad you guys liked it. Also glad I found this sub it's hilarious.",
        "permalink": "/r/MaliciousCompliance/comments/l3k05j/work_in_a_call_centre_need_to_increase_talk_time/",
        "comments": [
            "It's like they keep changing rules to see how high you'll jump.",
            "I went to work sick because 6 sick days meant you were fired. This wicked cold was going around the call center. By about 3:30 I had no voice left. Like. I was screaming into the phone and people couldn’t hear me. My supe told me if I went home that it fucking counted as a sick day. After suffering all day!  So my next call I got this old bird. Happy to talk and talk and talk. And forget call-control. I had no voice and she couldn’t hear. Tooooootaly had a nice hour long chat with her. And supe didn’t say one fucking word. Lol.",
            "Hahaha 6hr talk time with WW2 Vet. That's fantastic.",
            "Frankly, part of why people liked you was probably at least in part that you didn't keep them on the phone all day.",
            "You probably made that vet so happy",
            "Proof when a KPI becomes a target it stops being a key performance indicator.",
            "It’s almost like they’re concerned about the wrong friggin metrics...",
            "[deleted]",
            "Back when I used to work for an ISP we had a KPI that worked out to a \\*minimum\\* of 103 customer contacts in 9 hours.  \n\n\n5 minutes per person.  \nNow, that might not sound too bad, but bear in mind this included Data Protection checks, and was applied to fault calls where we might have to discuss what tests they'd been able to do, give them a checklist of what still needed to be done and so one.  \n\n\nAnd sales, with assessing their requirements and talking them through how much data a GB would give them (in terms of \\*roughly\\* how much video, photos, general web browsing and so on).\n\nAnd...  1st level complaints that could easily include ten minutes of them screaming incoherently and refusing to let you know that their fault is showing as fixed on the system, so if they reboot their router they should connect in a minute or so; or better yet that they're showing as having chanegd their password, but they're still trying to log in with the old one.",
            "This really nice guy rang me about 3 in the afternoon to see if I was happy with the service and if there was anything they could add or sell me to make it better. He stayed on the phone for two hours (until closing pretty much) just shooting the breeze talking about where we lived what sort of things we did. He was so nice and funny. One of the best calls I ever had.",
            "I am only used to this:\n\n&#x200B;\n\n [Dilbert Comic Strip on 1999-08-04 | Dilbert by Scott Adams](https://dilbert.com/strip/1999-08-04)",
            "Why would any company have a problem with you being on the phone for too short a time if you were hitting all other targets? What, does it cost them more money the less time you're on a call??\n\n Bullshit.",
            "This is so weird to me. When I was doing call center work for Apple through their chat system is was very much \"solve the most amount of issues in the least amount of time\". Stalling out calls or chats was seen as counter productive, even if the situation warranted more time spent. Odd that a longer call time is seen as beneficial",
            "I was going to call you out for copying [something off](https://www.reddit.com/r/UnethicalLifeProTips/comments/l2pc7a/ulpt_request_how_can_i_fudge_talk_time_at_work/gk77v76/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) of r/unethicallifeprotips. Turns out, that was you!!",
            "OP six hours of talk time with a WW2 vet must have been incredible. I know you can’t share what they recounted but I hope it was good.",
            "I used to work the night shift in a call centre. There was some serious downtime between 2am and 6am. I would get my friends to call for like 10 seconds, I would take the call and pretend that there was a bad connection, and hang up. Where I worked you would get fired for not hitting your KPIs 2 months in a row, so it was out of desperation, and not anti-establishment.",
            "If anyone has time to spare, I work for a hospice and we need volunteers who want to call or visit patients. It’s up the both the patient and volunteer if they’re okay with in person visits, but it can provide some awesome socialization for the isolated patients, even if over the phone.",
            "Thats a stupid metric. Less talk time = more sales. Jeez handle it quick and simple.",
            "I work in a call centre (thankfully one that doesn't rely on call times) and my god, the elderly love to talk! I love getting the life stories, they're usually the friendliest to talk to as well.",
            "When I worked in a banking call center we regularly for an old guy who would call for something small but chat you up for 30+ minutes if you let him. It got so bad that when training new people they created a section where they taught you how to politely end conversations. The customer was specifically referenced (without saying his name) in many of the examples 🤣",
            "Lol I always got in trouble for doing too much of this. There’s a sweet spot for talk time and you’re “wasting company resources” if you talk too long.",
            "I would love to have heard that vet’s stories.",
            "Misread that as a vet who worked in ww2...\nI spent five mins wondering why they quit after the war",
            "This warms my heart and belongs on some wholesome sub somewhere!\n\nWe have a program in Australia where volunteers call older people to just have a chat with them, kind of like a welfare call but less about just asking if they need anything and more about having a friendly conversation about what's going on and interaction with another human being.\n\nIn all of my volunteering this was by far my favourite thing to do, even with the 5am Saturday wake up.\n\nI have no doubts that call meant more to the caller than you realise. Good on you for just talking for that long",
            "Why do they care about talk time in the first place? Seems to me all that matters is the number of people dealt with per day and how satisfied each one was with you.",
            "Dang, I work at a call center now and I have to try and keep my AHT below 420 seconds... and it is HARD. Old people love to talk, and I am too nice to push them off the phones. I miss my old pre-pandemic job so much... :(",
            "I always had this problem. No one could answer me when I asked \"If I'm solving the problem and the customers are happy, why does this matter?\"\n\nCall centers suck.",
            "Ah, long calls are fun. I work in IT, and my current record is 13 hours. Long story short, I work for a company that makes software for handling medical records. Cue office calling in who'd totally destroyed their database. Naturally, of course, their newest backup was from June of 1998. So many hours spent patching that thing back into a sort of workable state. Thankfully, only day 1 was that long, but I spent nearly sixty hours over the next two weeks putting Humpty Dumpty back together.\n\n  \n\n\nMoral of the story? KEEP YA DAMN SHIT BACKED THE HELL UP.",
            "Hey! I recognize you from the ULPT thread! Small world",
            "O wow we are supposed to keep our talk time low, never heard of this!",
            "I work for a place that has similar stats to this. If you can get on live chat, I would 100% recommend. Next to no pressure anymore!",
            "I worked in a call center for a mail order pharmacy. So talking to senior citizens all day long. Most calls were so quick and easy thag I quickly learned I could easily have at least one 45 call per day without messing up my avg talk time goals. So when I got someone who seemed particularly lonely or having a rough time, I'd just talk to them as long as I wanted. \n\nAlso learned that the QA people would never listen to a call over 7 minutes. So if I had a call that I knew might get me a bad qa score is just keep the caller on the line until just past the 7 min mark.",
            "This is one of the greatest unintended side effects of telemarketing.. \n\nImagine all the elderly folk out there that have little to no human contact.. then what starts as a sales call turned into a whole afternoon spent chatting with a stranger.\n\nThere should be a business solely dedicated to calling old people once or twice a week to chat.",
            "Yeah, any decent sized call center records calls and analysts review them constantly. Long calls like that def trigger review.",
            "So I managed a call centre for a long time - and we'd be looking for ways to reduce talk time, not increase it - what am I missing here?\n\nI'd look at stats daily, and monitor the queues constantly. If I noticed someone was on the phone for 5-10 minutes, I'd be listening into the call to understand what's going on. Then we'd coach the employee on that call.\n\nThe longer you're on a call, the less calls you're taking and more dropped calls you have which doesn't look good on your stats.",
            "Wow, I've done call center tech support, and the pressure is on us to have short call times. Adobe at Stream wanted under 17 minutes.  The absurd thing is they count mistransfers, etc in your total talk time.  I care more about a first-time fix and never gave a damn about handle times, but one day I actually tried to do it like they wanted for a few calls, and the customers were obviously offended.  \n\n&#x200B;\n\n[https://youtu.be/2g0XMx1sFEA](https://youtu.be/2g0XMx1sFEA)",
            "Why wouldn't they be happy someone talks less and get more? It's like they don't understand what efficiency is...",
            "I work in a call center and have lowest CRT (call resolution time) consistently and they're happy about it. What kind if call center wants you keeping people on the phone longer??? That seems like a lack of reviewal for behavioral compliance resulting in them thinking that because you're fast you're not doing your job. Damn, I wish I worked there instead..",
            "[deleted]",
            "Ugh my call center contract is the exact opposite. They expect our AHT to be no more than 10.5 minutes. The contract I work on is for a company that sells dashcams in company vehicles, most specifically tractor trailers. I am in the upper tier, where I troubleshoot the camera’s issues and assist with installers and their issues with our installation website. Depending on the problem or camera model, this takes way over 10 minutes more than 80% of the time. So frustrating!",
            "As a guy who has spent his career creating metrics for call centers, I am DELIGHTED to read your story. Managers who hold their agents accountable to a specific pass/fail handle time/talk time, etc... drive me up the fucking wall. It’s absolute lunacy.",
            "Lmao! 6hrs?! Nice.",
            "I lol'd, thanks for this. I bet the call with the WWII vet was really interesting!",
            "Man, back in my call center days (a whole 4 years ago) at a busy bank, they would never tell us to increase average handle times. Haha.",
            "Terrific, keep it simple. Well done.",
            "Worked in a CC in the 00's, me and 4 others where pulled of the phones for 2 months because we made the floor looked bad with an avr call taken at 39 calls a day vs 20 for the entire floor.",
            "I did a high volume call center job for 7 years and this is spot on. We would leave notes for each other on past conversations when we found a cool, chatty customer.  What they loved to talk about and how to get them rolling and sometimes notes from someone to say hello. It began selfishly, a chance to slack off, but became wholesome af. Like, If you got Mr Turner, people wanted to know about his dog or if his daughter was doing better. I remember those customers 25 years later. Managers hated it but what could they say? Everyone was happy except the bean counters.",
            "I work in one too my boss literally told me if i am 5 minutes till break or clocking out draw the call out. To make sure things are done on time and i am  the master of turning a 5 minute call into 30 lol",
            "I would often leave voicemails on hold and leave very \"long\" voicemails that any sane person would hang up on as a method to rack up phone time.",
            "Why would a call center ever want a higher average handle time",
            "I remember chatting to this lady who was composing a song and also had me speak to her 4 cats individually...\n\nThat was interesting.",
            "To add to this, find a company that lists a local phone number but when u call it, rings to a national toll free number..you can fuck around on hold for 10-15 min without raising suspicion",
            "Spoke with a lady who was on a regimen of maintenance meds to keep her heart ticking. It was a holiday/3day weekend on a Friday 15 minutes before I was scheduled to leave. It turns out she was discharged from the hospital 2 hours prior. We kept chatting, and I swear I/we had a guardian angel because 30 minutes after I was supposed to head home to my newborn she agreed to go over her discharge meds and the order in which she spoke to MDs/RNs on her way out. She never should have been discharged with an active fungal infection in her bloodstream and she certainly would have died had she taken another dose of her heart meds. I called her an Uber to go to the ER. She spent the next 3 days inpatient until she was all stable/cardio converted/not actively being infiltrated by fungus in her blood. I don’t know man, sometimes we hang on to those calls for a reason. \n\nShe wanted to rush off the call and felt silly about discussing her issues. I nearly clicked away from her call to send back to que and would have been walking out the building when her call would have otherwise ended after only a few minutes. \n\nAnyways, I firmly believe that shooting the shit about whatever customer/patient wants to talk about eventually leads to a more impactful call about what you want to talk about. Is it better to convert 3 out of 4 calls or 3 out of 40 calls?",
            "You def stole this from a request post from one of the request subs. Don't be a lazy thief.",
            "I've never met any call center manager who said increase talk time unless you were failing compliance, missing sales or had low NPS (customer satisfaction). I can't believe someone said that to you to be honest.",
            "Woah what, I spent three years with one if the big telecoms in the us business side call center and we had to keep calls to a minimum, like handle time was to be kept as low as possible",
            "[deleted]",
            "I don't hate you but I hate that your job is a thing.",
            "I also used to do customer service for Sprint. At first it was horrible and I really grew to hate Sprint's customers, but at the end I became very used to all of their demands and all of the unpleasantries associated with the job. I saw everyone around me struggling while I managed to disarm most angry people and make them talk to me for a couple of minutes as well before leaving about trivial things, which is great, 'cause I'm getting paid and I could've gotten a worse call.\n\nYou give a good tip. Older men and women love to have a chat, especially if you adopt a very easygoing, nice, sweet tone of voice and talk to them with respect. I speak English at a native level but I am from Romania so I always used this as an excuse to get them to ask me \"Oh wow, really? Tell me more about your country!\" which would generally prolong the conversation by a lot.\n\nMost angry or upset people can be placated if you just stay calm, firm, and make sure not to offend them in any way as they're on a hair trigger. It's really important to find out what they want and to be able to tell them tactfully if you can't really help them. Then it just becomes a \"make them feel bad\" game so they feel a compulsion to spend a couple of minutes more with you on the phone.  I've learned thousands of tricks and ways to optimize my time in that hellhole of a place and to actually have fun out of it and I've talked with so many people over the phone, shed a tear with them, offered them support, encouraged them to do what they want, told them not to worry, etc. \n\nIt was really fun and it made me feel better and not go home a defeated, tired person from being yelled at all day. It works if you know what you're doing. A lot of people need affection and appreciation so even a weird \"Don't worry, everything's fine, I love you!\" from an unknown Sprint employee over the phone can mean SO much to some people. One of my most touching calls was with a bodybuilder called Hassan Banks which as far as I recall suffers from a muscle condition. It made me so happy to share my appreciation and support for him powering through his issues and we had a nice little chat afterwards, bro-hugging it out over the phone.\n\nThat was just one of hundreds of talks that were important to me and that I probably won't forget that easily. Call centres are so, so hard to bear with... but **there's a trick.** Love **everyone** and they'll find a way to love you back - and even if they don't, then you'll be in a better state of mind than you would be otherwise anyways if you would have been affected negatively by their energy.\n\nTry to thrive in a call center, not to get overencumbered. Corporate talk aside, putting a smile on your face always helps. Try to apply that to any social situation as well, as people are more naturally inclined to respond positively and to trust people who are easy to laugh.\n\nAnyways.",
            "At least your calls are interesting.ine are too sometimes but my longs are usually having to put someone on hold while I call 23 people and no one picks up to assist or we talk in stupid freaking circles because I said I wouldn't refund them or told them they need to wait 2 bus days like a rational person to get a request from mgnt completed.",
            "This is so crazy to hear, when I worked for a large credit card company that you can \"never leave home without\", we were always prodded into getting our talk time as low as possible. They would even pay us bonuses to do it. My talktime was always high. I feel like I would have thrived at your call center. Though, to be fair after a while all call centers become a nightmare",
            "I once got in trouble for my call times so to prove a point I spent 3 days talking to the same customer, she was my first call of the day, chatted to her until my lunch break then called her back after but because I did exactly what was asked of me and I had it in writing they couldn't do anything. Noone complained about my call times after that although I did almost get fired for having a recontact rate of over 100%",
            "This'll probably get lost in the new comments, but this story totally reminded me of my own experience as a tech support agent in a call center, back around 2016 or 2017, with a Canadian WWII vet named Gordie Bannerman.\n\nThe poor guy was having issues with his PC while trying to revise his memoirs for his blog. We spoke for hours, guy had an old school charm to him that just made conversation flow. I spent the next few hours after the call reading through his memoirs as well, though his blog has now been replaced with some random garbage disposal blog. The fact that I can still recall his name shows how memorable he was.\n\nI decided to look him up just now and found an integral copy of his experiences, pictures and all, on a veterans page, but not much about him outside of that. So, I decided to look up his friend, Orme Payne. I found a blog post from a reporter who mentioned having met both men and penned an article on their friendship of 85 years. \n\nHe related his grief to Orme's passing in September of 2020. Orme himself had also gone through grief of his own, coming to terms with the passing of his great friend Gordie only 2 years prior, in 2018. It kind of left a ball in my throat, how this great man I'd spoken to only a few years ago has already left this mortal coil. \n\nMay they rest in peace.",
            "I used to call people I would know but tell them not to answer.  Then just leave a silent long ass voice mail they could delete.  This was 15 years ago though so I'm not sure this works anymore.",
            "Kind of opposite story but I worked at a call centre during a political campaign (not in the US) and they measured us by the number of calls we made per hour. I ended up getting talked to several times when I was at about 30 ish calls per hour, which isn’t bad but completely reasonable, especially if I started to really talk policy with someone. So guess who on the last day decided to call people, let it ring once or twice and then hung up right away??\n\nThat was also the day they gave out some prizes to people with the highest number of callers so I ended up getting a couple of those pretty easily",
            "When I worked at a call center you couldn’t do this. Quality control would listen in on your calls to make sure you were talking about the product correctly.",
            "I know this is malicious compliance but you probably made that blokes week. I always take time out to talk to friendly old people, most people look at them weird or make some odd non committal grunt to accommodate the old person but not directly engage in conversation but my mum taught me that older people are a fount of knowledge and are worth taking the time to talk with.\n\nObviously this doesn't apply to all old people, some old people are crazy fuckers but you can usually tell the difference.\n\nEven though it wasn't your intention, thank you for giving Arthur some attention.",
            "Bro, you talked to a WWII vet for 6 hours? Who is apparently in a situation where he has a caretaker? You're a Saint. That phone call probably made his week/month or more. Probably hopes you call back to BS with him. Thats amazing.",
            "If I go the rest of my life without thinking about KPI, Metrics, and NPS it would still be too soon.\n\nFuck that corporate BS.",
            "Management to OP: \"You've managed to achieve the perfect amount of flair for that vest, at least for this cycle. Congratulations.\"",
            "I hate the concept of slowing yourself down to underperform and meet average metrics so as not to skew the average higher than normal. I get that it's not your fault though; I once worked for a company like this.\n\nI got laid off because of poor performance numbers, even though they never said directly that's what it was. My team handled computer assessment, cleanup, and repair for a major banking client. Me and one other guy took on laptop repair because we were technical enough and liked it. He only took on a few plus a more basic workload, per day, where as I at one point took on only laptops. The problem was getting parts from another department took an entire day. You'd essentially have dogshit outputs for one day, where you got a lot of prep and part ordering done, and really high outputs the alternate day when the repairs were processed as complete. Didn't help that a complex laptop repair was worth just a few \"points\" more than some really basic shit. My assumption is that they  thought I was slacking off, when in reality I was burning through their backlog of (relatively) highly technical repairs way fucking faster than everyone else on my team. The same team members that were like \"don't do too much per day, just hit this target\". They even laid me off after a particularly tiring day where I volunteered for a special project to set up some additional work benches for another department. \n\nNeedless to say things have changed for me since then lol. Everyone at that company was so miserable though, it was astounding. Some employees had been there as techs for like 15 years... day in and day out in boring conditions, getting $0.25 (hourly) annual raises.\n\nHow can companies create situations like that and not realize their policies and culture are actually ineffective, and even harmful. Like, one day that company, despite being massive, is going to get bought out or fizzle out on their own because no one wants to work there and they can't adapt. They could do SO MUCH MORE if they didn't gauge performance by arbitrary numbers. \n\nSorry long rant lol, just needed 🧠🤮",
            "The best part about calls over 30 minutes.... qa doesn’t want to listen to that shit so you can say whatever you want and no one cares.",
            "They want //Longer// can times?\nShit we send out warnings for calls over 10 minutes.",
            "When I was in a call center I’d never hang up the phone, so sometimes it would be dead air for hours and I’d just sit there and play flash games",
            "6 hours?       \nDid he nap for 4 of those?",
            "so, like\n\ndid you just not go to the bathroom during that time or what\n\nsincerely,\nsomeone working a similar job whose bladder is the size of half of one hulled walnut",
            "Not all \"old ladies\" like kids or have any\n\nNot all \"old men\" know anything about cars",
            "I feel like this is just another way to do a story someone told a couple weeks ago, sorry if you’re not the same guy but they said the exact same shit just with a story attached from the vet",
            "This sounds really familiar",
            "I have the same issue, my aht is super low, but after further digging around aht doesn't take into consideration my callback time, so my actual aht is reasonable, but because it doesn't include callbacks I get hurt on incentives because of the ridiculously low number.",
            "100% this is r/MaliciousCompliance",
            "My boss has been telling me to stay on the phone longer, which is not a KPI. But the reason why he’s listening to my calls is because I need to take more tickets.",
            "I work in call center reporting, why would having shorter calls be a problem?  Only if you were making everyone else look bad.",
            "This used to happen to me, I got done things quick and effectively got out of chit chat (respectfully) and had great call times. Got pulled aside by our team manager because if the company saw it was possible they would ask everyone to perform like me so I had to slow down. Ok then let me call greendot bank and wait on the line for two hours a day",
            "you should meet arthur at a pub",
            "There's a book called'On the clock'  written by a journalist who lost her job.  She worked at Amazon, a call center and at McDonald's.  Not a bad read for a first time author. Made me so fucking mad at Corporate America. I feel horrible for anyone who has to do that.",
            "QUEUE SURF!",
            "Talk time metrics are so dumb.\n\nIf a phone agent can do whatever you want them to do in a short amount of time while scoring well on any customer-related metric you have, why would you ever want them to take LONGER? That's actively working against making a profit (which, let's be fair, is usually the whole point of management).",
            "I've wasted 2 years of my life in a call center and I can tell you one thing:\n\nNever, ever, work in a call center. Literally anything else would be better. Do not ever answer phones for a living.",
            "This is glorious",
            "As a former call center employee, I felt like a prisoner working for them. You’re called by your employee prisoner number, 1 minute overbrake/biobrake will warrant you a written warning. You can’t bring anything inside the floor/office even a mug if it isn’t transparent. I once accidentally brought single penny inside the floor cuz im running a minute late but the security pinged it on the metal detector so I have to go all the way back to the lockers just so I could return it to my bag. Thus, rendering me 4 mins late with a love note from the team lead. Glad Im outta there.",
            "Hah we have similar metrics at my work but they’d threaten to fire me for “call avoidance”(I am inbound) over a 6 hour call.",
            "To think, you got paid to listen to a WW2 Vet, when some would pay to speak to him! What an honor. You're lucky. I'm genuinely envious, I've never got to speak to one...",
            "Medallia sucks.",
            "I thought you need ro reduce talk time to reduce costs",
            "Probably trying to get things ready",
            "Yesss, I did this at the call center I worked at. Got in trouble for a low handle time, so I would spend a good hour or two talking with the older ladies and it was fun.",
            "That's so weird that they were concerned that you weren't spending enough time. Wtf. Every call center I have worked at has been very focused on call time metrics being lower",
            "Legend",
            "Life is short, I’m glad you had that call with Arthur. I’m sure he will remember it for the remainder of his days. 🥰",
            "What line of work are you in that they say your talk time is too short?",
            "You spoke to his carer as well.. lol",
            "What year was this?",
            "Im assuming you're from USA because so far thats the only country i have seen that has call duration as a KPI. Being from Europe i find that absolutely infuriating. I have a lot of calls with potential service providers and many of them are based in USA. Every single call they have to summarize what the company does and who they partner with. It is such a waste of my time. Usually after a second call i either drop them or refuse to have another one. Sometimes they try to lock information from me unless we have a call and that's the moment i let them know we will not be compatible. What an absolute waste of everyone's time and the comoany's resources... Some things just don't make sense about USA.",
            "Manglement: \"Spend more time talking to customers.\"\n\n\\* u/fortuo7 talks to Arthur for six hours\\*\n\nManglement: \"No, not like that.\"",
            "be careful though, the calls are often recorded and can be played back by your managers on demand, this can especially bite you in the ass in sales",
            "I was in the biz for 10 years most of that time in quality control. It’s not gonna work if you have your calls monitored which most reputable call centres practice.  Disciplinary actions would be taken.",
            "How does this even make sense? If you can archive these numbers in shorter calls you can make more calls and therefore more profit for the company hence forcing you to waste time literally is the company losing cash.",
            "Your job sounds like cancer.",
            "Call centres are a funny beast",
            "Never heard about having to increase time spent in calls. Having to decrease on the other hand..",
            "I did everything I could to decrease call time.... everyone is in queue to answer phones, when you answer, call someone, or anything phone related, you get sent to the back of the line. I would literally just occasionally pick up and hang up to reset so I wouldn't get a call for a little while.",
            "I lasted about 3 months at a call center for Sprint/T-Mobile in 2015. \n\nWe were trained for two months. Best easiest pay in the world the training was. \n\nThen came when we got out of training. \n\nI didn’t last. It was nerve racking and shitty. If you had to take a shit longer than your 1 5 minute pee break it would be forced into your lunch. And working there made my stomach upset so I had to take shits a lot. \n\nYou get screamed at all the time. If it’s a customer that has called before and there is no notes in the file, then your fucked and have to take the customers word for it. \n\nMy last day I forgave a 4000-5000 dollar bill. The dude was screaming at me the whole time, nothing I said could calm him down even though I was working diligently to see why his bill was the way it was. It was obviously some shenanigans on Sprints part. I just don’t remember exactly but it wasn’t his fault. I completely forgave the debt and wiped his account to zero. Dude still screamed and demanded to know my name. We aren’t supposed to give out our names other than first name. He pressed for more I told him no. He said he was going to call back and hold me to my word and if the bill wasn’t fixed, even though it was, he would have my job. \n\nI kinda laughed after the call cause my name is super duper common in the United States. And there was atleast 10 in our call center with that name. \n\nIt’s also why I started smoking again. That job. Everyone told me I would be perfect for it because I was a super fast typer and my voice is super nice, calming and sexy apparently. (Other people’s words, not mine) \n\nBunch of other shit happened that day too and I decided the hour drive to it, even though it was ridiculously good pay, the stress and abuse from the employers and from the customers wasn’t worth it in the least. \n\nI’ll never work for a call center again in my life again. I’ll go back to McDonalds and work before that happens and I’m disabled and can barely stand for more than 10 minutes if I’m lucky. Rather drag my ass across the greasy floor at McDonald’s than work at a call center again. \n\nI don’t know how my brother did it for as many years as he did, and he was a debt collector.",
            "Longer calls? The call center where I work freak out if it take more than 7min to subscribe a customer to 30 channel cable, the phone and internet for 120$/month.",
            "Commission based jobs are great for efficient, productive talk. Remember: Money talks. BS walks.",
            "KPI's are total BS. \n\nThere's no discretion and supervisors just rule with an iron fist.\n\nOne call got pulled for quality. I hit EVERYTHING. Like even down to saying my name 3 times on the call (don't ask why I don't know either). It was a retention call and the customer explicitly said: \"I Don't want to be sold anything. If you do I will cancel\". I Talked to this individual like a human, resolved all his issues and turned a really angry and upset customer, who didn't trust us, into a happy customer satisfied with his experience with me. \n\nI was put on a disciplinary as he was a \"candidate for our multi-service discount\" meaning, if I x-sell him a mobile service with us (ISP company) then he will be better off. \n\nHowever shortly after I received a \"well done\" from another agent (a recognition scheme where a customer can send a commendation about their experience) and the customer statement read \"I was delighted with your help, I was due to renew my mobile contract with a competitor company, but I am now joining your company all because of your service\". \n\nI still had that disciplinary on my record!",
            "Haha, I never spent 6 hrs on one call, but I used to do this all the time. My average handle time was always really low, because most problems could be solved in about 5 clicks. It doesn't take 3 1/2 minutes to do 5 clicks! But did my managers appreciate my efficiency? Noooooo... They wanted me to talk to the customers, be friendly with the customers.\n\nSo every shift, there were 1 or 2 old ladies who would call in and want to talk about everything under the sun. And I let them. I sat back, played stupid games on the computer, and let them talk for about half an hour. With 2 30-min calls, it balanced out my handle time very nicely. Managers never did catch on (or if they did, they never said anything to me about it).\n\nOf course, this is the same place that, on my last day, I gave the full credit I was allowed to every customer who was nice to me. Probably spent close to $1000 of the company's money that day, and I didn't care at all, because everything I did was totally within the rules, and what were they going to do? Take away my \"have a nice life\" balloon and cake that they gave me as I left?",
            "You are awesome.\n\nThat said, a lot of those long-call people were precious to me. There was the lady who lived way out in the boonies on a dairy farm, who liked to talk to her sister on the phone, but who would call us if her sister was busy. She was a great person and everybody loved her.",
            "I always had the opposite problem where my on call times were too long, lol.",
            "May I ask what kind of company you work for? Are you calling people or are they calling for your help?",
            "Facts. I’m in a similar situation and I’m always hoping for an older person. Multiple reasons. One, they tend to be the most interesting. They’ve got stories. Two, they tend to want to talk just as much as I do. Three, they tend to know less about my industry so I can spend a lot of time explaining things they are unfamiliar with and helping grow their confidence which feels amazing.",
            "I worked at all call center troubleshooting people’s phone lines, it was back when computers used modems to access the internet. (Really aging myself)\nThey would actually monitor our calls. We pretty much had to stick to a script for each various situation. If we veered off too much off script, we could get written up.",
            "i’ll never understand corporate stuctures. why would long call times be a good thing??? for the company it means you’re wasting time you could be on the phone with other and for customers it’s the single most complained about issue when it comes to customer support/call centers",
            "I wish my call center wanted me to increase my talk time... I’m stressed if I can’t keep it lower",
            "Fuck comcast.",
            "This actually sounds like a fantastic service--a lot of old people are lonely and would benefit greatly from having someone to talk to at length about basically anything.",
            "Yeah man. I was on the phone support team for an internet company and I spent most of two hours teaching an old lady about her computer.",
            "Like my call center buddy used to tell me to help him DECREASE his talk time and I'd kick and poke him when I heard any \"Star wars..\" He would be all crabby with me after.. hahahaha.",
            "I'm curious what kind of call center you're in, because in my experience we had the opposite KPI - less talk time was better. Both of the call centers I worked in were technical support or customer service however.  \n\n\nI assume yours must have been outgoing calls?",
            "Based on your previous posts I'm 100% sure of the company you work for... which based on the stories I've from my co-workers... I feel for you. :( Once you said NPS I knew right away."
        ]
    },
    {
        "post_id": "or42m9",
        "author": "Kolintracstar",
        "title": "Smoke breaks are only for smokers",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/or42m9/smoke_breaks_are_only_for_smokers/",
        "score": 13608,
        "num_comments": 984,
        "created_utc": 1627183524.0,
        "selftext": "So a little short one, the problem of people taking smoke breaks during the work day, basically at my job on average the smokers take about 5-10, 5-15min (paid since they don't clock out) smoke breaks.\n\nThe non smokers which are surprisingly in the minority (7 out of 25) including me asked to take a break when the smokers do. Manager says that they are only for smokers and if everyone went on them then there would be too much of a lack in productivity and we would fall behind. \n\nAs anyone can realize, that is bullshit. So I went online to Amazon and bought all of the non smokers \"Herbal Smokes that are Tobacco, Nicotine and Additive free\" basically just a cigarette filled with tea leaves. And we started going on smoke breaks but hanging out in our own corner to avoid the secondhand. \n\nThe manager comes out and starts yelling asking what we were doing, he thought we didn't smoke, we should be working...to which we kindly pointed out that we had all decided to start smoking and that, well we were smoking along with everyone else there. \n\nThis lasted 4 days before the manager set limits to how many and how long smoke breaks are, and let the non smokers take the same breaks too.\n\nAlso: I am not sure about the health affects of Herbal Smokes, but considering we just lit the ends on fire then stood against the wall like some guys outside a club from the 80's, so I think we're fine.\n\nEdit: So it is an 8 hour shift. With two 15min breaks and a 30min lunch (but everyone including managers take an hour) so 1.5hrs of paid breaks. So of the 6.5hrs remaining people were taking 1-2hrs just to smoke.\n\nEdit 2: I appreciate the responses, I try to read all the direct comments. To summarize, a couple people say I ruined it for the smokers. A couple people with manager point of views. A bunch of similar MC and taking breaks as well, and a very large amount of people starting smoking to take smoke breaks.",
        "permalink": "/r/MaliciousCompliance/comments/or42m9/smoke_breaks_are_only_for_smokers/",
        "comments": [
            "A little malicious compliance of my own here. I used to work in an office and at the time I was a smoker. I was expected to clear x volume of work a day. I easily cleared double. When a manager called me out about the OCCASIONAL smoke break I pointed out that since I did the work of two people did ten minutes twice a day really matter? He said no you can only smoke on your official breaks. So I reverted to meeting only my benchmark exactly. He ended up having to hire another person to cover the excess outstanding volume of work",
            "I always called my breaks fresh air breaks when I worked with smokers lol.  I’d just go out with them and talk. I worked in an office setting tho.  Real estate. Commission only  and lots of free time.",
            "As a shift manager at a Taco Bell down in Georgia, I would often give my high school employees \"fresh air breaks\" when business slowed down. One of them mentioned how unfair it was for non-smokers when smokers got paid smoke breaks. \n\nWhen I would have people call in sick those kids would volunteer to come in and cover shifts on their days off. They wouldn't come in for the other managers, most wouldn't even answer the phones when they saw it was the work number calling.",
            "At one place I worked, many of my colleagues would regularly wander off for a smoke so I decided to have a cuppa at the same time (I don't smoke). The very first day I did this, the boss pulled me up and had an unofficial word with me: Don't Do It Again.\n\nSo the next day I grabbed my tea and went out with the smokers. Said hi to the aforementioned boss, and stood squarely in his line of sight. Not smoking, just drinking my cuppa.\n\nDay 3: Smokers went for their break, and I making a cuppa when the boss walked past on his way out for a smoke.\n\n\"Hi \\[Ich\\_mag\\_Kartoffeln\\].\"\n\n\"G'day \\[boss\\].\"\n\nAnd nothing more was ever said or done about it.",
            "Everywhere I have worked has had like two 15 minute breaks for everyone plus lunch. Did t matter what you used your break for that’s all you got though.",
            "My mom used to weave yarns about how she bitched about this same thing at a laboratory she worked at back in the very early 90s (1990/1991).  Management was being dictatorial about breaks, but smokers could still take up to 5 additional breaks, and my mom piped up about all of the smokers in the room and their frequent smoke breaks.  If they can take 5 smoke breaks throughout the day, 5 minutes each break, then she should be allowed 5 \"fresh air\" breaks.  Management realized how ridiculous it was to allow smokers extra breaks, and therefore said smokers may only smoke during the designated 15-minute breaks and lunch hour.",
            "When I was in the US Army in Basic Training I faked being a smoker for the breaks.  I bummed a cigarette and never lit it.  It lasted me through weeks of training.  I also learned to go to church on Sunday to avoid extra duty.",
            "At my first full-time job, my co-workers would regularly take smoke breaks, including my boss. I began feeling a bit left out, but didn't want to smoke, so I would take snack breaks while they smoked. We'd all stand there chatting, while they smoked and I ate hostess snacks.",
            "I did exactly the same. “Smoke breaks only for smokers? You got it boss!” *buys cigarettes*\n\nThe ones saying you “ruined it for the smokers”: good! And about damn time as well. They were basically making their non smoking colleagues do their work while they take paid breaks.",
            "You should have brought a meat smoker and smoked pulled pork in the parking lot.",
            "When I was 22 I worked at Sonic. The only two people who didn't smoke were me and the boss. Literally every other employee smoked.  Every shift you worked you got a 15 minute break.  But all of the smokers also got two 10 minute smoke breaks. Which was kind of bullshit because I figured it up that that equaled to me working an extra 100 minutes a week, or 5200 minutes a year. 86 hours, or a full two week, full time paycheck each year that I was working and every other person in the store was not.  That's real bullshit there.",
            "I would take a break whenever my coworker came back from taking a smoke break. Sometimes I'd get coffee, sometimes I'd go visit my aunt (across the street) or my mom and her bff (diagonal across the street), since I didn't smoke.\n\nShe was supposed to be the office manager but was also an admin.  When I was promoted from project assistant (basically the person who did the stuff nobody else wanted to do, and relieved receptionist for breaks) to admin, she set all these rules for me, about dress codes and breaks. Until that point I wore jeans and nicer t-shirts and would have a sweater with me in case I had to look presentable, at the front desk.  Since I was usually tasked with moving documents, boxes and filing, I was often covered with dust and didn't want to ruin my nicer clothes. Anyway, I asked if the same applied to her, because she was standing there in a stained tunic with threads pulled, over stirrups (dating myself!) and a turtle neck.  This was her standard of dress, because she never interacted with clients, and I don't think most people there would have said much anyway, out of worry about being rude.  I didn't care that much but I also was not going to be held to a different standard than the \"office manager.\"   She got SO offended at first, but she did start dressing nicer and she also had to limit her breaks to the same she though the rest of us should, because the guy who DID actually run the office thought it was only fair that she should be held to the same rules, as she was technically an admin too. lol",
            "My job does two 15 minute breaks. \n\nI knew a smoker that wanted more than that, so he'd use 7 minutes of PTO every day, twice a day.\n\nI thought it was comical and creative.",
            "This policy at my old pizza delivery job destroyed my 3 month streak of not smoking. This was when I was 21 and all the non smoking drivers had to fold pizza boxes while the smokers congregated outside while waiting on deliveries. I got tired of folding all the damn boxes but wasn't as slick as you so I started bumming smokes from coworkers. One smoke lead to another then my own pack. Didn't quit again until I was 44, about 10 months ago.",
            "I had a gal get treated the same because she was the ONLY non-smoker in her work center.  When she told me I had her take a \"smoke break\" as soon as they came back and for the exact same time they did.  Her supervisor noted it but never came to talk to me, but they quit treating her like a mule simply because they're addicted.  \n\nI recommend to anyone facing a similar issue to do the same.  I worked a 12.5 hour shift, two half hour and two 15 minute breaks were all they allotted, they can figure it out.  And I am a smoker.  If they're leaving butts all over the place, as is common, point out to your management how unprofessional it is and get their smoke pit removed to the street.  Cuts your break down a lot, but they can always regain the priviledge if they can adult their butts into a receptacle.  Absolutely hate that behaviour.",
            "Even McDonald's let me take \"non-smoking breaks\" (in the freezer, it was fantastic). Although it was a particularly well-run McDonald's.",
            "Where I used to work it was referred to as \"checking the weather\".   Everyone was welcome to check!",
            "We have policy, that you have 1h 30min of breaktime per day. As in 2 about 15 minute ”coffee breaks” and 1h lunch.\n\nHowever you may, if day allows distribute this differently.\nLunch is 30 minutes at minimum, so if you take smoke breaks, you can take that out from your lunchtime.\n\nIt has worked fairly well for us.",
            "I'm on team you, fuck the smokers. I've worked in kitchens before and they don't give a rats ass about leaving you hanging mid shift when things are busy to go smoke.  I don't give a single fuck about them and their habits.  If you're making the same paycheque i am, you do the same work i do, not stand outside while i pick up your slack.",
            "I find this so weird. Where i work, 2 x 15 minutes, one unpaid lunch break you clock out for. You smoke on those. You take extra breaks, you go on disciplinary. I dont understand why smokers get extra breaks.",
            "I recall reading once that giving smokers a break but not non-smokers counted as unlawful discrimination. You should check with your local regulations.",
            "On my first job, I was the only non-smoker out of maybe 100-120. Everyone smoked. From the top boss to the apprentices. Some of the managers had smoker offices. (and they would of course hold as many meetings as they could in those offices so everyone could light up, but that's another story).\nSo, after any regular coffee or lunch break, they would add a \"quick\" smoke break outside on the terrace, which would easily stretch out to half an hour or so. Thing is, almost every decision would be made during those smoke breaks, and everybody else would know about them! And then they'd be surprised that I was surprised :)",
            "I used to be a line cook at a restaurant and I would stand outside with an unlit smoke for that reason as well. It is a very fast paced and stressful job and only got more stressful when the smokers left the line for their smoke breaks. Eventually everyone had to either start smoking or pretending to smoke to get the breathers that the smokers were getting (if you can call smoking a breather. Because.... Smoke inhalation)",
            "I worked hotel front desk for 3 years before getting promoted to reservations manager. When I worked FD everyone was constantly told/reminded they SHOULD take their 2 15s, especially on busy days because it can be extremely stressful.\n\nWhen I was promoted the FD got a new director of rooms who was the absolute WORST human I have ever personally met. I found out she was refusing the 2 15s to anyone that doesn't smoke and would go out to CHECK that people were in deed smoking.\n\nI LOST it. We didn't  keep a single new hire FD agent for more than 3 months and two if the three seasoned agents left within 6 months of her getting hired. Now they didn't leave JUST for the smoke break reason, but that was the only thing I could report her for to HR because it is state and company policy to allow those breaks no matter if they smoke or not. So I did. And the agents got to take their 2 15s. \n\nI'm sure she didn't know it was me but since I had experience I started getting pulled to the desk to cover these 15s since they were short staffed cause she's a horrible person and boss. She didn't like me because the desk staff I think liked me more than her. I also pushed back in some policies she wanted to put into place that genuinely would have made it harder for the desk to function. So I enjoyed the hell out of having her rely on me in a way so her staff could take their rightful breaks. Worth it.",
            "This happened to me when I was military too\n\nIt was annoying as heck, and a ton of the others and I decided to make “fresh air breaks”\n\nOf course the command tried to squash it, but we argued that the smokers tend to go up every hour and spend 10-15 minutes on the pier doing nothing. It actually seemed like a 50/50 split between smokers and non smokers (with another like 30% using that extra gross tobacco dip stuff, but they’d just use that while working). \n\nEventually it caused the smoke breaks to be limited to 5 minutes an hour, but then we got our fresh air breaks too, just “not at the same times”, which was fine with us.\n\nNaturally the smokers hated it, but it boggled my mind how the folks in charge did not/could not see the level of unfairness. Only reason we got our way I think is because the commanding officer was a non-smoker",
            "When I worked construction, we had actual smoke shacks on one site where the smokers could smoke, stay out of the weather, and had places to put their garbage.   I didnt really care but it was kinda annoying that they would disappear every hour or so for 5-10 mins when my breaks were a 15 min coffee and 1/2 hour lunch. After 6 months or so of this  AND being the hardest worker/most productive on my crew,   I politely told my Foreman that I would be taking sandwich/snack breaks Everytime they went to smoke.  His humorous response in front of everyone  was that he'd better see me eating something every time or ALL of us would lose our breaks.   Lmao, I was 23 and hitting the gym 4-6x a week so no problem.  I surely wasnt trying to fuck my coworkers out of their smoke breaks.  I carried a cooler with sandwiches, fruit, protein bars, and shakes, everywhere i went.   Gained 15lbs of mostly muscle in the next 6 months until the general foreman put a stop to the excessive breaks for EVERYONE after someone complained about all the work stoppages due to smoke breaks.  No one ever bitched about me eating all day though lol.",
            "Where I used to work the non-smokers got three extra days holiday.",
            "Fuck anyone who's complaining \"oh you ruined it for the smokers\". Your addiction is not someone else's problem and your not at work to smoke. You're at work to work. It's a privilege, not a right.",
            "I work in a small UK team. We have 2 smokers. They work an extra 45 minutes a day.",
            "Smoke breaks are insane, that's what your normal breaks are for. And good job standing up for yourself! If they're getting a smoke break, you deserve a break too.",
            "I used to Reddit on my phone in the dairy cooler at a previous job for 5 mins or so here and there. Grocery manager asked about it, I said I don't smoke. \"Huh. Fair enough, can't find anything wrong with that\"",
            "I worked in an office dominated by smokers. They would take smoke breaks every hour for at least 5-10 minutes. When I asked for a similar break all I got was attitude. So I'd play solitaire for the same amount of time as the smokers breaks. I got in trouble. I told them when I quit that I should start smoking so I can get more breaks.",
            "At a job once, \"Karen the Chimney\" complained to the boss I took too many breaks. *Boss gave me the stink eye*\n\nMe: \"but what do I do when my station is clean and the next batch isn't ready yet? Besides, I don't smoke.\" *Boss gave Karen the stink eye*",
            "I've been a smoker for 25 years now cause I worked in a restaurant and got written up for taking a break with a smoker as a nonsmoker. So I started smoking in retaliation....stupidest decision of my life.",
            "Basically same story except I used a plastic pipe and blew Bubbles.",
            "I’ve been smoking for 9 years now. Smokers who think they are entitled to extra breaks piss me off. Like oh you are trashing your body and would like some extra paid time to do so? Fuck you. Smoke on your own time. You get paid to work not smoke.",
            "I, as a smoker, find it strange that you can smoke on company time. You clock out. It is that simple.\n\nIt is even an instant termination reason where I am from (Germany). It is considered (time-)fraud.",
            "So many people I know started smoking or vaping to ensure they get “smoke breaks”. Well played by you to even things out.",
            "This is why where I work smokers can only smoke on their breaks, they don’t get special breaks because they chose a stupid habit.",
            "Ruining smoke breaks for smokers is fine. Getting a special perk because you make bad, unhealthy choices is not awewome.",
            "When I worked at a hotel, the rest of the prep cooks would regularly take smoke breaks out in the parking garage. I'd frequently get invited but I didn't have anything to \"smoke\". Swear to God, I bought one of those silly toy pipes that blows bubbles and just stood there blowing bubbles for fifteen minutes while people shot shit.",
            "I had a coworker who would take numerous smoke breaks for 15-20 minutes each. \n\nI ended up starting to go with him.  I didn't smoke, but I'll be damned if the dude can do less work and get paid more and I don't enjoy the same benefits.",
            "I don’t live in a place that gives smokers extra breaks and it blows my mind that there are places that do this. I’m a smoker and extra breaks because you smoke seems fuckin stupid to me.",
            "You did not, \"ruin it for smokers.\" They were taking unfair advantage of other workers--including you--and when you simply leveled the playing field they cried foul? Seriously? That is such entitles bullshit!\n\nWait...did these smokers work at a hedge fund or the SEC?",
            "When i quit smoking i started taking sunshine breaks.",
            "I asked one of my bosses if, when my coworkers took smoke breaks, I got a whiskey sour break. He agreed that would be fair, but said only if I brought enough for everyone.  :-/",
            "Paid smoke breaks are bs. I say this as a former smoker.",
            "As a non-smoker formerly in the military I feel this",
            "I hate smokers at jobs. They are the worst employees typically because they can’t get through a shift without dipping into their addiction.\n\nI worked in a restaurant where the same thing would happen and smokers got an hour off throughout the day while all the non smokers had to do their work. I got with all the other restaurant employees and everytime smokers went out we would too (the managers smoked too). So after day 1 the smokers and managers get mad and threaten our jobs - no worries I tell them, let’s just talk to HR and I’ll call the attorney general.\n\nSafe to say we all got breaks with the smokers and they never said anything again. A couple months later they setup a non smokers break spot bc the smokers were so mad they didn’t want to be near us lol",
            "Op did the right thing. Cracks me up that ur smoking herbal tea leaf tho haha.",
            "I started smoking at a job once too bc of breaks lol.  It’s such bullshit",
            "As manager I did take the time of smokers once, and did some research, in average was approximately 1h daily; was my goal to ask for a 30m (paid) early release for everyone not smoking improving health and productiveness. I was in the middle of this (as a personal project) when got a new boss, and soon i did quit.",
            "Ive worked a couple of shift manager positions in retail in my life. I always told my employees to just call it a smoke break, and to take it outside so corporate wouldn't see them sitting down on shift on the cameras and raise hell. Cigarette or no cigarette, everybody should get a chance to take 5 if they want to.",
            "Hey,  I’ve been a manager and I think that is a crappy thing to say. Firstly I would not have allowed all that crap if I’d known about it, but if I hadn’t had a say about it I probably would have said “Well played, well played!”  \n\nI am so sick of being told smokers have to have breaks. I am not a smoker and I have never understood why any business in this day and age would support that situation.",
            "When I was an ast. Manager at a restaurant I realized the only way to get breaks was to go out with a smoker to the “break area” bum a smoke and then let it sit lit in my fingers until I was ready to go back in.  \nFuck that non sense.",
            "When I was younger I used to add up the minutes this one coworker of mine took for smoke breaks across the day and I would add it to my normal break. One time this resulted in me taking a paid hour long break. Felt nice.",
            "You deserve to have as much break time as the smokers. You did the right thing in my opinion.",
            "Allowing smoking breaks is insanity in this day and age.",
            "Did the manager smoke, by any chance?",
            "I did this once, too. My supervisor took smoke breaks every half-hour/every hour. I started taking a walk around the building when she got back for my \"smoke break\". Took 10 minutes, shorter than hers. \n\nI didn't last long at the job. Worst place ever, but they eventually went bankrupt.",
            "I took oxygen breaks at best buy whenever the smokers took a break. Fuck em. Take all the breaks you get.",
            "In Japan non-smokers are paid a higher wage/salary to compensate for that.",
            "Wait, some people thought you \"ruined it\" for the smokers?! I didn't realize that smokers are supposed to get extra privileges. \n\nActually, if it cut down on the amount of cigarette smoke the smokers were inhaling, maybe it just might slow down the negative effect on their health. \n\nI wouldn't start smoking just to get the same number/amount of breaks as a smoker, but your method seems like it's just burning some kind of incense, so I would be okay with doing that (probably). \n\nI've known some smokers who were very unreasonable when it came to their cigarettes. However, I've also met some smokers who were downright considerate about it. I treat people how I'd like to be treated, and I appreciate it when others do the same, smoker or non-smoker. \n\nMany years ago I was stuck in a hospital bed for an extended stay. I couldn't move, I couldn't even feed myself. An orderly was given the task of feeding me my breakfast. This guy reeked of tobacco, but he was very friendly and pleasant. He treated me like a person and would talk with me, whereas most others treated me like I was brain-dead (I had had rather serious brain surgery, and my survival was in doubt). \n\nAt one point I asked him if he could do me one favor: if he wouldn't mind not smoking right before he came in to feed me. He laughed and asked if the smell was that bad. I said it was pretty bad. He asked if I wanted someone else to come in instead (and he wasn't offended or anything, he just wanted me to be comfortable). I said no, I still wanted him, because he talked with me. I also said that if he couldn't work it out so he could smoke after instead of before to just forget I even said anything. \n\nHe kept coming in. I don't remember now if he was able to take his break after or not (brain surgery does something to your memory sometimes). I do hope he quit, for his own sake.",
            "When I work for Meijers the only smoke break was at your break time, no other time.",
            "Good on ya mate! I had the same issue at my old job. Smokers were allowed 3 x 15 minute smoke breaks a day plus one hour lunch break. Non smokers were not allowed any breaks, only the one hour lunch break. Pissed me off!!!!",
            "no sympathy for the smokers",
            "About ten years ago, I worked in a team of about 10 people, and I was somehow the only non-smoker. Not only did they all take lots of smoke breaks (on top of the 1 hour per day we were permitted), but I also felt like I was being sidelined within the group. And I didn't want to stand around them outside in their smokey air just to feel more included.\n\nI decided to start timing their smoking breaks, while also openly making a point of stopping whatever I was doing as they left the office. After a couple of days they were already well over 2 hours of extra breaks, and that was enough for the managers among them to take it onboard and scale the breaks back. Soon they were only having a couple per day, at a max of 10-15 minutes total. And I could live with that.",
            "Dang. You didn't need to buy anything. You should just start saying you're going for a smoke, and take a walk.",
            "Oh yes I've lived through that one on my first job in a warehouse.  20 people, 14 smokers, only they were allowed \"smoke breaks\"",
            "I used to deal with yat bullshit too. Smokers take a 5 minute break every half hour while I'm sitting there working the whole day.",
            "The answer to how many smoke breaks anyone should be allowed to have is zero.  \n\n\nThe guy I work for has about five restaurants locally and I think he directs his managers to try to not hire smokers because so few of them work in any of his restaurants. At the one I work at I can't think of anyone that actually smokes and we have no one going on smoke breaks.",
            "I used to think this was happening at most companies, but perhaps it's only in our country. As employees we are expected to manage our time ourselves. Want to start at 8 and leave at 4? Sure. Start at 10 and leave at 6? Ok. Take a break to take a walk outside after having hours after hours of conferences? Totally ok. Its only when we lack in results the manager will talk to us about how we can improve, which might lead to suggestions such as, take a 30 min break and then get to work. It feels uncomfortable to read when others explain they are being treated like high school kids who can't manage their own time.",
            "I’m a smoker myself and I’ve been very vocal about non-smokers to be allowed to take the same breaks as we do. If we can have it, then everyone should have it.\n\nIt’s one thing that my addiction makes it difficult to remain productive after extended periods of not smoking, so I do need to take a quick break to recharge (anything over 5 minutes is too much, though; I don’t care who you are and how much you smoke), and it’s a whole different story to discriminate against either camp. Give the break to smokers. But also give the same break to non-smokers.\n\nIf you don’t, you’re a shitty employer. No need to sugarcoat that.",
            "“Smoke breaks” are inherently terrible for employees because, as you have pointed out here, it forces people to take up a habit that is bad for their health in order to have the same privileges as other employees.\n\nEither everyone can step outside for 5 minutes every so often whether smoking or not, or smokers should save their cigarettes for mandatory break times. Personally, I am far more in favor of the former.",
            "You absolutely ruined it for the smokers. Exactly as you should have. They were fucking over the 7 of you who actually did a full day's work. Fuck em right back.",
            "I take a twenty minute shit every day at work.  That adds up to almost two weeks of being paid to take a shit at work.",
            "Yet, people with disabilities have to fight to get reasonable accommodation.",
            "At my current job it's two 15 minute breaks and a 30 minute lunch, which honestly works fine for me - I have one on each 15 and one after lunch without eating into my work time, that comes out to basically a smoke every two hours(ish). If you just have a need to smoke more than that, you should really be cutting back. (I know, we should all really just quit, it's an awful habit, but it's one of the hardest habits to break.)",
            "Afaik you should be fine as long as you don't inhale the smoke. Any kind of smoke is bad for the lungs, they are not made for that.",
            "I worked in a kitchen in high school and that was the issue there too. It was long enough ago I bought a pack of candy cigarettes for my \"smoke break\".",
            "I had something similar on a job site once (as well as pretty much every job I've had where our breaks weren't scheduled). I was working with 3 other guys. Every time they knew they were out of site or off camera, they'd take a break, either to smoke or just sit around. I kept working because I was all about getting the job done and making myself look good for more work, because I was working short term contracts at the time. Instead, I got a rep for slacking off because I kept coming back to the office to get things that I needed to do the job, while these lazy fuckers seemed like they were always working because they were sitting around doing nothing off camera and not visiting the office. Such a crock.",
            "Assume 7½ minute breaks 2 times a shift; times 5 shifts a week. That's 1¼ hours a week. 50 weeks a year means\n62.5 hours of pay a smoker gets for free.\n\nI worked for a union. The company was forced to back pay non-smokers 3 years worth. (About 200 hrs worth coincidentally, right before Christmas)",
            "That's why we have to clock out for smoke breaks.",
            "This sounds super annoying for you. i get that smokers need a smoke, but at every job ive worked those smoke breaks were during your regular lunch break.  i myself smoke and have only ever smoked on my lunch break. i get going out for a break during downtime, but if one group can do that everyone should be allowed to. honestly, who cares as long as your work is getting done. i guess that would depend on the job tho. either way, you shouldn't have to pick up the slack for anyone but yourself.",
            "Years ago when I was a senior assistant manager at blockbuster (showing my age), I (smoker) would tell my  people who were non smokers if they felt the need to step out for a 5-10 minute non-smoke break, feel free because it was only fair.  Some times you just have to step away.",
            "Yeah I use to \"bum\" cigs to take smoke breaks.  Then promptly return them unlit.",
            "Honestly sounds awesome. Getting more breaks for more people is good.",
            "Feel you - back in the day I realized this and would just go outside and sit with them.",
            "I used to manage retail. Smokers took their smoke breaks, everyone else got vitamin D breaks. You took them if it was quiet or an appropriate time for a break or if I noticed you were becoming stressed out I’d send you on one",
            "What's more annoying is the death of the 1 hour lunch for min / low wage jobs.  \n\nMoving closer and closer to wage slavery",
            "Years ago when I was in the USAF, there was a similar policy - non-smokers weren't allowed simplest breaks. One of my good friends didn't smoke, but would go out on the smoker breaks. One of his supervisors called him out for it. He said if they get a smoke break, then I get a Coke break. And that was the end of the 'smokers only breaks' in his shop.",
            "I take walk breaks",
            "I worked for a company and I was the only engineer that didn't smoke, and the manager smoked.  I noticed they would all come back from smoke breaks with decisions made and I had no chance for questions or input, so I just started following them outside.  Manager said he didn't think I smoked so I laid it out to him that I was being left out of the decision making process and that's why I was standing  around second hand smoke.  He said ok.  And then the company had another one of its' frequent org changes and the entire group got split up.",
            "I used to be a manager at a local Sheetz, I'm also a smoker. I told my crew if they wanted to take 10-15 minutes to go breathe or watch a video or something, take a smoke break regardless of whether they smoke.",
            "Smokers shouldn't be allowed any special breaks. It's always pissed me off that they get extra paid breaks so that they can feed an addiction.",
            "I will never understand how taking smoke break for smokers are okay but having regular people taking a smoke break (or stretch break which is what I would use it for) are not okay.",
            "I fucking hate the smoke break rules as a non smoker. I’m getting punished for my good life decisions",
            ">Edit 2: I appreciate the responses, I try to read all the direct   \ncomments. To summarize, a couple people say I ruined it for the smokers.\n\nGood.  Smoking should be ruined for smokers.  It ruins a lot for non-smokers already.",
            "Ruined it for the smokers??? Good, fuck smoking! Why is anyone still smoking! It’s not something they should be rewarded for and receive special treatment.",
            "No one should get smoke breaks. Use the same breaks your co-workers get to manage your addiction.",
            "When I was a teenager I worked at a very busy campground at an amusement park.  The office was small, dingy, and some of my coworkers had poor hygiene or the just as wretched alternative when confined to a small space - cheap body splash overload!   \n\nOn hectic days the smokers would take breaks constantly- after pointing out how ridiculously unfair this was, I was told I could take short  breaks outside too- but I had to do what the smokers did and be out of sight of guests- well the only place to do that was in fenced area around the dumpsters… 🤢🤮.  They all had the benefit of years of destroying their taste buds and sense of smell- I could smell every rotting fish and every cooler clean out in the 95 degree heat!  \n\nSo I negotiated a truce- I used my breaks as PR opportunities- I took puppy breaks!  Yep, you heard that right!  I would go and dote on guests’ canine companions, make sure they had everything they needed, answered any questions, made recommendations for other local attractions they might enjoy, and logged any issues or maintenance needs that were brought to my attention while walking the grounds.   It went over so well that guests started requesting comment cards so they could specifically address how much they enjoyed the personalized touch, we even had guests that started to make sure we were eating right with home cooked meals, there was even a couple that, after finding out I was out sick, made a point of bringing me in instant chicken noodle soup and a mug with picture of their dog on it so he could scare away the germs!  Lol.  By the end of the summer I was promoted to manager.",
            "Based on his comment on productivity, I would have immediately asked if he really thought that the 7 of you who didn't smoke, made up for the bulk of the company's productivity.\nThen I would have moved to OPs solution.\n\nFortunately smokers are becoming a minority.",
            "If I had to guess, the nicotine-free cigs would still be poor for health if you’re inhaling the smoke into your lungs. If they were used more like cigars where the smoke is just brought into the mouth for the flavor it probably wouldn’t be too big an issue.",
            "Good for you.  I fucking hate smokers.  Stink to high heaven.  And what a shitty manager, I assume he is a smoker too.  Great MC.",
            "The talk of paid breaks.... I've worked restaurant too long.",
            "That stuff is fully timed here in Australia. I mean some jobs people prob get away with it but if it meant lack in production then they’d be timing it. I don’t know what the guidelines are now but when I worked for Woolworths an 8h shift meant a 1h break. Smokers chose to dock their smoke break time out of their 1h. And not being more oft than once every 3 hours.",
            "I once worked in a place where all the company news and gossip relied on the smokers. We would sometimes encourage the one smoker in the department to take a break app he could come back and tell us what was going on.",
            "After a few months of working with a crew of smokers who would abandon me in the office by myself to answer phones, walk-ins, etc. as the the only non-smoker, I started smoking a pipe, so they broke it into half/half smoke breaks. I would go out with the first bunch, but I was just getting packed and lit when they went in, so I would regularly take 20-30 minute smoke breaks.",
            "I feel you on this one. I\n\nworked with a bunch of smokers who all took a 10-15 break on the hour every hour.\n\n But made fun me for taking my second 15 minute break in a 12 hour shift.",
            "15 min poop break every hour",
            "At my work we don’t monitor or time breaks. Breaks are for the employees and taken as needed as long as business dictates it. Some days people get 5 breaks some times 7. But also some times they only have a chance at 2. \nBalance and understanding",
            "Take 10 minute bathroom breaks.",
            "When I used to smoke, I asked my manager for six 5 minute breaks instead of two 15 minute breaks and she was fine with that. And then on my lunch break I would chain smoke lmfao.\n\nI can't imagine going for so many breaks like that! No wonder you were so angry!",
            "I was hoping this story ended with you bringing a Weber and some brisket, then take \"smoke breaks\" several times a day to check on it.",
            "Lol!!! This is great. Good job op. The only people that would complain are smokers who expect others to pick up their slack",
            "This happened to my guys while I was in the USMC.  The non-smokers were told to work while the smokers took a break.  So I bought a carton of cheap cigarettes and told the non-smokers to have the smoker light their cigarettes and just hold it while the smoker smoked their cigarette.  Gunny realized that he made a bullshit rule and let non-smokers take a break with the smokers.",
            "In the army I picked up a zero nicotine ecig. So I’d step out, upwind, and vape so I could step out and get some fresh air and sunshine.",
            "This was the reason that lots of people started smoking, especially in the service/restaurant business.  No breaks, not unless you \"need\" one because you smoke.  \\*rollseyes\\*",
            "I have to say I had never encountered this scenario at a workplace until I started working a government job for the county.  The amount of people that go outside for these smoke breaks all day long was ridiculous. Certain big groups of people would go out from different departments together to smoke, which in the process would call each other on work phones or the work messenger system to make sure they were all going out at same time to be together for smoke breaks. Now I see why everything gets done so slowly at the county offices. Most employees take their (2) 10 minute paid breaks (1) 30-60 minute non paid lunch and 4-6 paid smoke breaks in between the 8 hour work day. Those smoke breaks 10 minutes outside, takes them another 10 minutes to just walk to and from the edge of the property in back where employees can only smoke at along with another 5-10 minutes calling messaging their lil groups time point to leave their work desk to meet up. Ridiculous!!\nIt was the least productive place I had ever encountered/worked and all being paid by our government. \nSmokers suck! Cause seriously us non smokers have to take your damn slack and the managers want to look at us like we’re not doing things fast enough. Hmmm maybe cause us non smokers are the ones they actually see present every time they come around the department.",
            "I always thought they should be called \"suicide breaks\" since it's decreasing your lifespan.  \n\n\nBut yes totally unfair.",
            "Yep, been at multiple jobs with this policy. I also just took breaks when the smokers did. Called it a “fresh air Break” as it was just an opportunity to sit outside for a bit.",
            "That is a great malicious compliance.\n\nMy coworker at my last job was always running outside for a cigarette after a rush of customers, meaning I would be the one cleaning and restocking for the next bit of customers. ...This was AFTER she was told not to take so many smoke breaks by the manager. The manager had no backbone though so it just kept happening every day until I quit(for multiple reasons).",
            "I’ve taken to “borrowing a cigarette” during smoke breaks and then returning to the owner afterwards, unlit and and not slobbered on. \n\nThey’re usually like “but you didn’t smoke it?” And I’m like “ yeah, I just wanted to borrow it for the break, I’m allergic to nicotine.”",
            "I used to work at a place where I noticed this phenomenon, so I would take a \"fresh air break\".\n\nThey get a smoke break, I get a fresh air break.\n\nYou really want to lose productivity, fire me...",
            "I have always hated this. I don't smoke. I do not plan to. But the smokers get longer breaks than we do.",
            "I worked at some place that let smokers take all the breaks they want. Meanwhile I couldn't even get a 30 minute break to eat lunch, even if I was working an 8+ hour shift. (This isn't illegal where I worked unfortunately. Trust me, I checked.)",
            "Congrats on forcing change in company policy to be fair to everyone.",
            "My coworker and I used to take deep dive Internet breaks. My boss was a smoker and she was outside constantly; we figured we deserved the same amount of downtime during our day. We were generally online all day long as part of our job but didn't let ourselves get sucked down a random rabbit hole because we needed to stay productive. However when we decided it was Internet break time, it was fair game to jump down any rabbit hole you wanted to investigate anything until your heart was content.\n\nMy boss was super cool and I know she wouldn't have cared. She would have understood the hypocrisy of her going outside for a smoke break while the non smokers didn't get anywhere near the same amount of time downtime.",
            "I was a smoker and only had one on designated break times. Going for one 5 times/work day is unacceptable. The second hand smoke coming off their cloths and mouths when they return to work is hazardous. There is nooo way I would permit that if I was the boss. So. Gross.",
            "You ruined it for the smokers?  Meh.  Actually, it seems to me that the *manager* ruined it for *everybody*.",
            "More companies should take on what the Japanese do. Non smokers get more PTO time each year to offset not taking smoke breaks!",
            "Excellent!!! My old GM used smoke breaks and anything else as an excuse to stop working and leave me alone in the store. I began keeping a time diary of his breaks. He literally had three-fouR hours of break a DAY. COMPLETE BULLSHIT. \n\nGood on you!",
            "You said in your edit that, “a couple people said I ruined it for the smokers,” to which I say, who cares? You don’t owe those idiots anything, and you don’t deserve to have to do more work than they do because you were never stupid enough to get addicted to the world’s dumbest drug. Fuck ‘em.",
            "Friend of mine pretends he smokes. Problem fixed. He buys cigarettes, goes out, exhales a couple of puffs around his clothes and goes back to work. One cigarette works for like a whole week. Kind of absurd, but it works. \n\nOn another line of thinking, I do smoke and when I was shift leader all non-smokers refused to take the breaks I offered to them for some reason. Weird but true.",
            "If smokers can leave for that time to not work so should non smokers. End of story.",
            "Back in the day I had a Taco Bell manager who always let the smokers take a break right after any rush, making the nonsmokers pick up the slack. I started bringing candy cigs in, and insisted they count. Suddenly she cared how long folks took on those again.",
            "\"A couple people said we ruined it for the smokers.\"\n\nNo, people not being allowed to take breaks for some innocuous reason while the rest of the work force gets one is stupid and unfair. These people have nicotine packs and gum, and while it might not feel the same, they had their chance to not get into it to begin with.\n\nI feel bad for addicts, but a job should be fair to everyone, and a boss should see how that treatment is dickish.",
            "Fuck yes nicely done, this always bothers me at work too",
            "\"To summarize, a couple people say I ruined it for the smokers.\"\n\nyes and?\n\nwhy do they get extra breaks?",
            "MC in the other direction - Some fifteen years ago or so I complained to my team leader about the smokers taking breaks that the non-smokers weren't entitled to. He handed me his pack of smokes and a light, told me to go ahead.\n\n  \nI declined, he told me, \"then get back to work.\"\n\n  \nHe pulled on his jacket, waved to me on the way out, and had a little smoke break of his own.\n\nI did eventually get my pound of flesh. The team leader office had three desks and one shared computer on its own desk (this was in 2002 or thereabouts). I let myself into the office, sat behind Boss's desk with the lights turned off, and waited the whopping thirty seconds it took for him to show up, turn on the lights, sit down at the computer, and start doing his own work.  \nCompletely unaware that he had company, I sat there for a solid minute resisting the urge to giggle. Eventually I said, \"Hi, Boss.\"\n\nHis head slowly turned around with his eyes popping out of their sockets. \"What the \\[redacted\\] are you doing in here?\"\n\n\"Just taking a short break. You know how it is.\"\n\nThe smoke breaks didn't really stop after that, but they sure got less frequent. Also, I wasn't allowed in the office by myself anymore.",
            ">I ruined it for the smokers\n\nFuck them.\n\nGood on you.\n\nHey smokers, you will just have to find another way to symbolically show the world you suck cock.",
            "I literally started smoking just to get the extra breaks at a gruelling nightclub job, and I've only managed to quit a few months ago (about 3 and a half years after I quit the job).",
            "A hospital I worked for in Florida had an interesting approach to smoking.  The system was self insured and related to decrease costs, all employees would have to stop using tobacco products.  One year warning was given and smoking cessation tools and classes provided free.  After one year if an employee was still a smoker there would be terminated.  Most smokers quit or left, a couple of people waited to be terminated then sued the health system and lost.",
            "Idk if it’s an unpopular opinion but I don’t think smoke breaks should exist, why would a company give out their time and money to people who specifically decide to smoke/ are addicted to it. Why make it their problem, if I was a smoker and my job told me no smoke breaks, and I couldn’t during lunch, I sure as hell would have a problem with it and either wouldn’t work there or decide I needed to fix my problem",
            "You did ruin it for the smokers, but if you were expected to pick up their slack while they were out smoking there's nothing wrong with your ruining it for the smokers.",
            "Smoke weed instead",
            "I have worked a few places where I was the only non smoker. As a waitstaff I’d grab a bread roll, and if anyone asked that was my cigarette. When I worked in an office, I’d originally go with them because it was expected, but the second hand was making me sick. That was tough because if I brought it up they all got super defensive. I didn’t stay there much longer after that.",
            "Smoke breaks are exactly what got me into smoking. 10 hours a day heavy physical work and aside of 20 minutes lunch only smokers were allowed a break. This is how i discovered one can be addicted before even smoking their first cig.",
            "I did this when I was working at mcdonalds but I actually picked up real cigarettes and developed a nicotine addictions that's been running strong for almost 10 years now. :(",
            "Friend of mine back in the day took up cigar smoking to make a point. Nice long breaks.",
            "Sadly, this is how I started smoking many years ago, when I was 19 and working a construction job.  Got paired with a \"boss\" who used to eff off to grab a smoke and leave me alone doing all the work, so I started smoking and went with him every time.",
            "Lol like how you made that work. At our job everyone on the crew uses tobacco, but we work outside and are fully expected to continue working while smoking. I started vaping instead so I’m not standing around trying to rush and finish a cigarette when I’ve got something to do. So it’s a weird trade off; we can smoke whenever we want but you better keep yourself busy lol. Unless we’re all prepped and just waiting for the next concrete truck…which happens more than it should sometimes.",
            "I was a smoker for ten years, and I never thought it was fair that we got extra time outside the building. \n\nOn the other hand, most of our management planning sessions were over coffee and cigarettes in the parking lot, so we weren't out there shooting the breeze either. My boss and I always brought paperwork out with us.\n\nStill, not fair for the non-smokers.",
            "I had a lovely former manager who smoked but encouraged me to take several non-smoke breaks throughout the day.",
            "Where i work if you work a 5 to 8 hour shift its required to take a 30 min break. Lady i used to work with would split her 30 into 2 15s so she could use them as smoke breaks. Pretty crazy to think you could just dip and go smoke for 15 mins and still get paid for it lol.",
            "I work in a restaurant so i try to limit my smoke breaks to less busy times, but it does help my productivity afterwards as a little boost. If it’s an 8 hour shift i might take 3, so that’s 15 minutes, but in those 15 minutes I would’ve been waiting around anyway.",
            "Love this.",
            "As a smoker! Im with you dude, it's only fair if everyone gets the same treatment.",
            "Good job. I am a smoker myself and see it as only fair that everyone gets the same number of breaks.",
            "Yep. I started going out with the smokers because I got sick of it too, and they said \"you don't smoke\",. I said \"I do now\".\n\n\nOne guy I worked with went out every single hour. So that was a total of one hour a day he was working less than the rest of us. It's total bullshit. If you are a cook in a restaurant, you simply don't get a break unless you claim \"I need a cigarette\".",
            "I like your style.\n\nI probably would have just started hitting a crack pipe.",
            "I literally bought cigarettes to pretend I was smoking when I was a waitress because it was the only way to avoid being one of the few non smoker servers, and getting stuck taking care of everyone elses table while they were out smoking.",
            "I've been working for 25 years and never have I had a job that didn't offer breaks to everyone. But I have worked with people who don't smoke and wouldn't take their allowed breaks, but would bitch about those who did.",
            "I worked in a machine shop full of smokers. So many smokers that the owner added a \"smoke shack\" on the side of the building so smokers could get out of the weather. We got a 15 minute break in the morning and afternoon and a 30 minute lunch break, all paid as long as you did leave the property. I was told by the Manager one day, as I was working on a particularly shitty set up, that since I didn't smoke, I should continue working through break so we can stay on schedule and not lose money on this job. I told him if 15 minutes was going to make or break the company, then someone else needs to be in charge of scheduling. Then I took my 15 minute  break.",
            "Fuck the smokers. Nasty asses.",
            "Smoker here: at both my hourly and salary job, I only smoked on my alotted 15 minute breaks. At my 8am-4:45pm job, I took one at the midpoint between start time and lunch break, and one at the midpoint between lunch and 4:45pm. My second job was from 5:00pm-10:00pm and I got one 15 minute break. All policy break times. As a smoker, I never thought asking for additional breaks was fair to my non-smoking coworkers, so I didn’t ask for them or expect them. I also only smoked in designated areas or as far away from heavy walking traffic areas. I guess that makes me an apologetic smoker.\n\nWhen my nonsmoking friends accompany me on smoke breaks outside, I always hesitate to light up too, because smoking is gross. They always had to remind me to light the cigarette (non-work situations, since I had to watch the clock on work breaks). It was their choice to come with me, but my bad habit so I didn’t like to force it on them.\n\nJust saying, my bad habits aren’t a good reason to get special privileges. That’s how I’ve always approached smoke breaks. :)",
            "I used to take smoke breaks with the smokers just because. One guy I worked with had a pack of smokes that he never opened her just bought it to be a smoker",
            "I work on the checkouts in a supermarket, and while the staff on the department aren't allowed to to go off for smoking breaks in the middle of their shifts unless they're on a scheduled break, one of our department managers goes out to smoke multiple times a shift... She doesn't help out on our department much, is often rude to the people she's supposed to lead, plus she doesn't even seem to know how to do her job... Drives me mad though that someone can be rewarded with more breaks because they're speeding up their demise with a foul smelling tube of sickness like that... Especially when some of those people don't even really do their job to begin with.",
            "Once in front of my coworker and boss I said, \"Gee, I wish I had a disgusting,  cancer causing addiction so I could goof off and make you take up my slack.\"  \n\nAfter that I started taking smoke breaks just as long and as often as she did.",
            "Clearly there are so many smokers because they get to take breaks…",
            "When I first started at my current workplace, I used to sit next to the smokers deck. Sometimes I would count the amount of times particular smokers went for a break and worked out some were having over an hour of breaks a day to suck on their cancer sticks.",
            "My husband started “smoking” cigarettes to get the break by putting them on the edge of a wall.  Then he was caught and told to smoke it or go back in (while everyone else was still smoking).  So, he did.  Thirty years later and he is trying to quit.",
            "Bob & Tom song - \"Smoking in Front of the Building\" - basically this scenario, started smoking when they realized everyone else was getting free breaks.",
            "Where I worked if you wanted a smoke break you volunteered to take out the garbage. No one cared if you took a few extra moments.",
            "If you were addicted to a different drug, would they allow breaks for that too? Heroin break, anyone?",
            "Has any non-smoker ever tried to walk thru one of the smoke shacks?  Gaawd, I nearly croaked!",
            "Current smoker and former manager here. Where I managed we only had 3-4 people per shift as it was a small retail store, and of like 9 total employees we only had 2 non-smokers. I noticed the imbalance immediately because not only would the smokers step out but they’d often grab a soda or something to take with them thus making it more like a mini break. So I had a “take a breather” policy for my non-smokers so they could step out for 5-10 minutes, get a drink, check texts, or whatever.",
            "We had a similar issue when I worked at a fast food chain. The smokers would take excessively long breaks and frequently throughout the day. They'd make themselves a coffee, some food and go to the staff room to get their phone and only THEN would they go out for a smoke. It'd easily end up 20-30m at LEAST 4 times per shift (between 6 and 10 hours) and they'd get their 30m/1hr break (depending on shift length) on top of that. Inevitably a clash between the smokers and non-smokers happened and they said you can either have your lunch breaks or smoke breaks, not both. Still worked out better for the smokers overall but it was close enough that everybody was happy with it.",
            "I had this argument with the GM. I started going outside with kids bubble blowing pots for 5 minutes every hour blowing bubbles. It was ridiculous. GM climbed down and stopped watching the clock so much.",
            "At the restaurant I worked at we had the same problem. As you may know, like 90% of servers smoke because its a crappy job. This one woman in particular whined so much about taking smoke breaks because she was a heavy smoker. She would also get other people to cover her tables while she smoked, which was too much. Every time she would ask me, I was \"too busy\". Finally some of the other non smokers were getting really pissed about getting stuck covering tables they weren't being tipped for, so whenever someone would go for a smoke break, when they came back, we would ask them to cover our tables while we took a smoke break. \n\nThis lasted like a month before one of them came to the back to find us sitting and bullshitting, but not smoking. They went and tattled to the manager, who then made a rule of NO smoke breaks during a shift.",
            "I had a job like this where smokers took a 5 minute break every hour in addition to their normal breaks and us non-smokers were left doing our actual job. A couple of us just started taking soda breaks. One manager said something and a coworker threatened to contact corporate about it. That was the last anyone said something.",
            "My dad managed a warehouse and there was one guy who didn't smoke.  He'd go out with the rest on \"smoke breaks\" because he said \"If they're not working, I'm not working.\"",
            "When I was 16-17 and worked at a restaurant, I was annoyed by this same thing. Though I had no desire to smoke, I thought it was unfair they could use it as an excuse to take a long-ass break so what I did is I would stand around or sit down and play on my phone for 10-20 minutes. \n\nWhen people would approach me about it (mostly smokers since like everyone there smoked) I would tell them \"well you get a smoke break so I get a video game break\" and I would mostly hear a lot of \"fair enough\" lol",
            "At my workplace I see many having smoke breaks, so I went and brought a ecig for 20 pounds and this gets me around 60 mins extra break a day. Money well spent."
        ]
    },
    {
        "post_id": "pqn0ul",
        "author": "anti-sugar_dependant",
        "title": "Your hair needs to be mostly a natural colour... No, not like that.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pqn0ul/your_hair_needs_to_be_mostly_a_natural_colour_no/",
        "score": 13603,
        "num_comments": 871,
        "created_utc": 1631973831.0,
        "selftext": "I attended university about 10 years ago. As is pretty standard when one is a student, I dyed my hair funky colours.\n\nWhen I returned home to my summer job I had short blue hair. \n\nMy summer job was in retail, I worked on a checkout.\nOne day my manager pulled me aside and told me the uniform policy said I wasn't allowed to have the majority of my hair an unnatural colour.\n\nI asked what \"a majority\" meant, and he said I'd be allowed streaks, but not my whole head.\n\nSo home I went with a box of brown dye.\n\nThe next day I turned up to work with the majority of my hair brown, but my fringe (bangs) and my undercut were still blue. Because of my hairstyle being short, from the front, where the customers were, all that could be seen was my blue fringe.\n\nMy manager told me it was unacceptable, even though I pointed out that more than 3/4 of my hair was now brown. He said I had to dye the fringe and undercut brown too, or he'd fire me.\n\nI dyed them brown, and immediately started wearing clip in coloured hair pieces.\n\nHe let me keep those, but he was not happy.\n\n\nI still don't know why my ability to serve people was affected by my hair colour.\n\nEdit for formatting.",
        "permalink": "/r/MaliciousCompliance/comments/pqn0ul/your_hair_needs_to_be_mostly_a_natural_colour_no/",
        "comments": [
            "I never understood that. I've worked in restaurants my whole working career, and I've never been allowed to dye my hair funky colors. Until my current job. \n\nI checked the uniform policy, nothing about hair color at all. So, I asked one of the owners if I could dye my hair \"a stupid color\". His response was, \"Like what, brown?\"\n\nI told him I was thinking of bright pink, and he told me to go for it and have fun. He said life is too short to be serious all the time. If dying my hair pink will make me happy, he won't stop me. \n\nSo I now have super bright, neon pink hair. \n\nLiterally no one cares. Even the crabby old people that eat here have told me it looks cute.  \n\nPink hair doesn't stop me from doing my job. If anything, it makes me feel better about myself, and in turn I give better customer service.",
            "All about control. I have been a caregiver for 10yrs. I have only had a natural color once. My older clients love it and it helps them set me apart. \"Where is the pink girl?!\"",
            "You know white is a natural hair color because albinism is a thing so that could have been a fun solution",
            "I work for an engineering company. There was a policy that your hair had to be \"a natural hair color\". I knew people that wore beanies all day to hide their hair.\n\nThen I noticed one of the higher managers had purple streaks in her hair. Checked the policy and that was still forbidden. It was a talking point amongst us workers and I guess somebody went to HR.\n\nAnout a month later I checked and the policy had been quietly changed to remove the hair color rule. So I guess it takes upper level people to get the policy changed.\n\nMost of the people I see with weird colored hair work in our corporate departments. Most of the technical people have \"normal\" colored hair. I'm glad to see that people realize that your hair doesn't affect your professionalism. And now I want to dye my hair blue. :-)",
            "This isn't MC, but when I worked for FedEx, I dyed my hair all blue as well. My managers gave 0 fucks and we didn't have customers (well, that talked or looked at me anyways), but my coworkers sure did care! I was the first one with unnatural hair, then less than a month later, one girl also dyed her hair blue and even told me it was because she liked mine so much, and two more people I didn't talk to dyed their hair bright green and red. It's a really nice feeling when your look inspires someone else to do something cool, but sadly that's also probably something that would upset petty management",
            "I was working as a victim advocate and had agreed to meet a client at the courthouse.  I told her to sit in a particular spot and I would come find her.  From what I read, the client was in her early 70s, and when I got to the spot there was a woman sitting there in some very avant-garde fashion with a severe teal chin-length bob.  I thought for sure this was not my client and called her, only to have the woman in front of me pick up her phone.  Thankfully she didn't know what I looked like so I quickly hung up and approached her like I'd just found her.  \n\nI learned to ask people to describe themselves rather than just relying on the fact that they may be in the right spot.",
            "It’s a fucking control thing IMO. They start letting you express yourself by your hair color soon enough you’ll be asking for a better wage and better treatment. Better stamp that out quick.",
            "So a few years ago I was made redundant when the shop I was working in closed. During the period where it was winding down I went for an interview at a local supermarket. \n\nThe interview lasted 30 seconds because it went along the lines of the guy looking at my CV, looking at me and going \"how difficult would it be for you to get rid of that crap in your hair?\" meaning my purple and red, which is the majority of my hair. I asked if he was serious and when he said he was I told him to f*** off.\n\nI have 20 years experience in retail and I was a manager, and all he wanted to ask about was my hair colour. I wasn't about to change it so I could sit behind a checkout at a second rate discount supermarket for minimum wage, especially when the fancy, expensive supermarket down the street couldn't care less about what colour their employees dye their hair.\n\nI hate people who think something like hair colour or piercings mean you can't do a job.",
            "I never understand why you have to have \"natural colored hair\" for a retail or food service job.\n\nFunny story though. I was once in the military and you could have 2 toned hair (unless you could prove it was natural). Well a girl got two toned hair so her top was blond and her bun was brown which is a no go. I have a natural auburn hair and she tried to say that if she had to dye her hair so did I because my hair was obviously dyed. I shut that down real quick. She than moved on to a girl with naturally dirty blonde hair to try to prove her point. She had to get her hair redone.",
            "i'm so sick of all these bullshit rules about hair color, or tattoos, or fucking facial hair, not being allowed at work because it is \"unprofessional.\" It's an old outdated rule that makes literally no sense in 2021. The person at the cash register of the gas station is not going to affect my purchasing decisions because they have a beard instead of just a mustache.",
            "I work reception at a tech company. Asked my boss if I could dye it in a funky purple pink and showed him a picture. He said yes. Came in on Monday, his biggest complaint. It wasn’t pink and purple but blue and purple. Explained that the hairdresser ran out of pink. Was still disappointed but he “could live with the blue”.\nIt’s been going from purple to pinkish to blue and vice versa ever since. About 10 years now. \nOnly big issue I have to adhere to is no big cleavage, corset or metalband tees when certain customers come. Otherwise its pretty casual dresscode here.",
            "I have purple hair and the customers love it, one of my managers even had purple hair like me and encouraged me when I was hesitant about the reaction of the other managers. My head of store couldn't believe I did it but she actually admitted she loved it and it suited me.",
            "Dumb. Im glad that i work in a place that doesnt judge me for being an engineer with long hair. My ability to solve problems isnt affected by the length of my hair, and i keep it up and tight so its not a safety problem. As long as you look well kempt and professional, like you actually care about your appearence, and do your job well, who cares.",
            "Worked at a pool teaching swim lessons. Mostly summer work. From one summer to the next I got a few tattoos. Despite having no policy against them, Boss told me that if I got one more tattoo, I might not get hours. Asked her to show me the policy, she couldn’t. Came back next year with a full sleeve. Got dirty looks but nothing else.",
            "It is so dumb that the color of our hair is such a concern, or the way we choose to decorate our bodies with ink and jewelery. \n\nTrust me the way I look has NOTHING to do with how well my customer service is. \n\nUgh!",
            "Joanna....we need to have a talk about your flair...",
            "I once worked with someone and their new manager issued a decree that all hair should be in line with policy. They complied- by growing their hair (had to be tied up at work to comply with policy) and dying it in black and white stripes like a badger. Both natural hair colours in line with policy.\nManager gave up on the decree. Friend continued to do as he was until he felt his point was well and truly proved..",
            "When I started a previous job I had pillarbox red hair. 2 years in they decided I needed to have a natural colour. I didn't fancy a natural colour so instead I shaved my head.\n\nMy next shift my manager pulled me into the office and told me it wasn't acceptable. I pointed out the male manager with a shaved head and asked why he was allowed it. She went red and told me to leave the office.\n\nMost of my regulars asked why I'd shaved my head and I happily told them the reason why.\n\nA few months later when it was long enough I went back to red.",
            "I'm in my late 40s, and I think bright hair colours are really cool",
            "Yeah, I never understood that notion how my hair style or colour affects my work ethic and moral standing. It doesn't! My mum thinks my hairstyle and colour ( it was bright blue but faded now) and choice of clothing are not respectful or respectable. I wear for comfort and creativity and none of it is terribly outlandish or immodest at all. I'm well covered. My work ethic is fine. And honestly, when I'm comfortable and happy, my morale is higher, which in turn does affect how I do my job. I can do it better when I'm not frustrated with how I'm forced to dress in uncomfortable clothes and have no choice in how I do my hair ad express myself.",
            "I fed my hair for years, stopping coincidentally when I started being desktop support, interacting face to face with clients.  After being pushed back to helpdesk, and getting a bit depressed at what I saw as a demotion for no reason, I dyed my hair again.  And kept it dyed as I went back to desktop support.\n\nThe reactions from people funny, in that no one under 40 complained, only those over 40.  1 even told me I would never get a girlfriend with dyed hair, despite my then GF being a main reason for my dying my hair again.  The tight lipped reaction, like they had sucked on a lemon (also called Cat Butt Face) to that reply was priceless.",
            "What matters more: what's ON your head, or what's **in** it?",
            "Hair color, shaving practices, tattoos. All bullshit control tactics to keep the work force subservient. What they don't realize is that people like me look the relatively clean cut part, but will happily tell my underlings (I'm a bottom tier manager in the restaurant industry) when the higher ups are fucking them, or trying to violate labor laws and how to stop them from doing it.",
            "I really hate this rule. What exactly is my hair color going to do- suddenly make me impolite? Not allowed unnatural hair color all throughout school, not allowed at a job, when exactly am I allowed to dye my own hair? How exactly is blue or pink hair supposed to affect my attitude?",
            "I once worked in an WR where the nurses were having their jobs threatened for having blue and/or purple highlights. Because everyone knows you can't have colourful hair and take care of the sick and injured. In protest, a couple doctors started coming in with random colored hair until the threats stopped. Definitely loved seeing the docs stand up to hospital admin! Hair color, tattoos, and piercing shouldn't cause a problem with your job unless it is a health risk.",
            "Years ago, I worked at a place that said we couldn't dye our hair any color that you couldn't find at Walmart (this was long before you could buy any unnatural color in Walmart). Being the young rebel that I was, I decided to challenge this rule. I bought a box of hair bleach, some black hair dye, and some reddish/orange hair dye...and had my more artistic friends spend an evening painting my head with an amazing leopard print. My bosses were less than pleased, but I followed the rules. Then a couple people started to bring their friends and family into the store to see my hair, and those people ended up shopping. When corporate came in my managers basically explained that I wasn't technically breaking policy, and I was good for business.",
            "I streaked my hair blonde in the grade 4-5ish. My principal said that dying hair was not allowed. I asked why and she said it was unprofessional. I pointed out that my father a RCAF officer had done the same thing with his hair, and if it was okay with his boss she should be okay with it. Nothing ever came of it, but she definitely didn’t like me",
            "Coworker recently got reprimanded for her nail color. They were painted white and we are only allowed \"warm tone colors\". They demanded she remove said offending no-chip gel nails and she was like \"fuck that\". She is going to just wear latex gloves for 2 weeks to cover up.\n\ntotal bullshit.",
            "Heh, I remember doing things like this in school myself. \n\nGrew up in Texas in a post-Columbine world. As a member of the \"creepy kids with black tshirts who listen to rock music\" crowd, many of us were automatically ushered directly into day-long detentions, away from the rest of the kids, the upstanding polo-shirt crowd. \n\nSee the tricky thing was that the public school system couldn't just outright *ban* a a social caste of teenagers, try as they might. They did ban everything in our periphery, though. Band tshirts? Done. Baggy pants? Gone. Boys with piercings? Gone. Girls with \"distracting\" piercings (meaning more than two per ear)? Gone. We were quickly being isolated and singled-out to save face. None of us were particularly ill-tempered to begin with, though many took \"getting punished before committing the crime\" as an excuse to behave accordingly. Not me though. \n\nAs the offspring of rebels myself, both my parents knew how to *subtly* break the rules. Kids would normally just wear a Marilyn Manson shirt, walking in with the expectation set that they wont get very far. I just started to wear plain black shirts. No baggy pants? Fine, dark jeans. No piercing? K. I was growing my hair out, but it wasnt enough. It wasnt *weird* enough. \n\nSo I sat down and combed through the entire dress code for the school district. I memorized the thing at the time. Turns out, there was absolutely nothing about hair color, or style, in the dress code, only that hair is to be kept clean. Nothing in the code about the color...*yet*.\n\nSo, of course, I went to school the next day with blue hair. I got lucky, as the principal was out that day. Got a lot of cross looks from the teachers, heads shaking slowly in concern, surprised looks from the students. I got home that day, and apparently the school had called the principal, who had personally called my parents, to express their \"concern.\" Evidently when my parents explained there was nothing in the dress code saying this was not allowed, my principal took this as a personal offense...which my parents took as a personal offense themselves. I took offense when I went back to school the next day and was greeted with a suspension notice. \n\nNATURAL COLORS ONLY\n\nOookay... \"Hey momma...yeah I got a letter about the hair...Jerry's mom is a stylist right? ...Cool. ...imma have her do my hair. Nope it says \"natural colors only\".....why no, no it does not specify *how many* natural colors are allowed...\"\n\nOf course, this quickly was also singled out (I say singled out for lack of a better term, I was quite literally the only one going to this much effort at this point), as people do not have naturally striped black, brown, blonde, and white hair. I was told as well that \"white\" isnt a natural color, which was incredibly odd considering the old bat that was in charge of that hellhole had white hair. ...\n\nI dont mean to hijack your thread. I'm sorry. I rarely get the chance to share stories like these anymore. The short version of this story is that this pattern of behavior continued for *years*. The only thing the school system taught me was how to maliciously comply with rules and piss people off constantly. If they would have spent half as much energy focused on what was in our heads, rather than what was **on** them...who knows, maybe we would've turned into well balanced adults instead of evenly balanced psychopaths.",
            "Something like this happened to me when I worked at a bank, so I bleached my hair as platinum blonde as I could... it is **a** natural colour, but it did not look natural on me!",
            "Health tech, testing my blood yesterday had awesome neon orange hair. When I commented she said “I have to wear the same scrubs and mask everyday…”. So glad the lab allows her some sense of self.",
            "When I was 15 I wanted to get my first job.\nThe easiest way to get a job is, well work at the supermarket.\nAn important note at that particular super market chain is that everything is blue.\nLike fucking everything.\n\nAt the time I had coincidentally my hair the exact same blue tint as their signature blue color.\nAnother important note is that I’ve had my hair dyed in strange colours since I was 12 so I couldn’t imagine myself any different. (At 20 now and I still haven’t seen my natural color in 8 years).\n\nThe job interview, I qualified for everything.\nI was just a quiet friendly kid, never got into any trouble.\nWell during the interview they starting beating around the bush as to why they wouldn’t hire me.\nI wasn’t pressing or anything they really just weren’t clear.\n\nWell blue hair wasn’t allowed as it “draws too much attention”.\nEven though I would be fucking camouflaged in that store.\nSeriously.\nAlso my mom was furious which was kind of funny since I didn’t want to make a public deal out of it.\nBut the angry Facebook post was made obviously.\n\nIt did feel really terrible that they would reject me for being me.\nI don’t think a single customer would have cared.\nAnd now much later I’ve worked at stores and no costumers really don’t care.\nThe only image it hurts is their own imo\n\nI think they still don’t allow dyed hair, but hey I got a job as a dishwasher in a restaurant later and they were fine with it.\n\nIts a shitty story, but living with dyed hair sucks.\nNowadays it’s a bit better, but five years ago it wasn’t easy finding jobs.\nBut hey I’m still me, and I’ve still gotten supermarket blue hair.",
            "This is so shiity and I have to laugh because I am literally right this minute in a hair salon getting my auburn red hair weaved with a bunch of purple because I can. \n\nI started a new job in January that does not care about such things. My old company was adamant that you can't have unnatural colors OR visible tattoos. They were so weird about it. \n\nNo, I  was not in a customer facing dept. At all. Nobody ever saw us. \n\nI'm also going to be getting a few tattoos on visible areas which I've wanted but haven't been able to do & keep that job.",
            "They hired you with blue hair? Then were upset about it.",
            "A punk friend in college dyed her hair pretty regularly.  She dyed it black and about a month later wanted to dye it green.  But she didn't strip it properly so the black stayed in so only her roots took the green dye.  So she had black hair with green roots.  My friend saw it and commented that he liked she was letting her natural hair color grow back in.",
            "[deleted]",
            "\"For an increase in salary of $20 more per hour I can change my hair color for this job and consider it an added duty, or you (employer) can pay the added cost of finding, hiring, and training a new worker. Please indicate your decision and sign at the bottom of this formal counseling form.\"",
            "This reminds me of when I worked in a preschool. I had a small stud in my nose and got told to cover it with a bandaid. So I bought those neon small circular bandaids and wore those to work. Yeah, after that my small stud wasn’t a problem. Lol.",
            "I interviewed for my current job with a teal mohawk, and I'm now rocking a rainbow mohawk. Other than people I've never met knowing who I am because \"everyone knows the rainbow mohawk girl\", I've had literally zero issues. The finance director actually asked me if he could show his kids a picture of my hair because they were fascinated by his description. 😂",
            "I dyed my hair blue once after reading the Kmart handbook which didn’t mention it at all. I got pulled into the office one day and had a chat with my managers after multiple weeks of having the color in my hair. Well words were said but the best thing was when they said “we could stick a light bulb in my mouth and parade me around as the Blue light special” well I reported them for sexual harassment… (bulb in my mouth) they got retrained and I got to keep my hair for a while longer…",
            "I'm a mail carrier. Thank goodness no one cares about my damn hair color. And as a boomer, I don't care if the other people in service industries have bright hair, tattoos or piercings. They usually look good, and have no bearing on someone's ability to do a job.",
            "I feel like hair color policies should just be changed to require the dye job to be of professional quality (looks wise, not professionally done). Like as long as it’s not a sloppy mess, who really cares for most positions?\n\nNow, I’ll give that in certain fields it causes an issue. If you’re a trial attorney a jury or judge may treat your client differently based on your hair so natural colors are probably best.",
            "I don’t know why people think that coloured hair or tattoos will affect people’s work ethic.",
            "As someone who has dyed their own hair for 15 years, I quickly learned that wigs are your best friend. You want \"natural\"? OK, chestnut, black, blonde or redhead? Put it on as I get to work and take it off at home. I'm sorry you had to give up your funky colours, I know for me coloured hair gives me life & so much confidence",
            "Supermarket I work at has/had all the strict appearance rules (*no unnatural colours, no piercings other than ears, no visible tattoos*). But a year after implementing drug testing (*Union suggested swabs, they opted for urine*) for all new applicants, the pool of CVs from high schoolers and uni students dropped almost dead.\n\nNow I see checkout workers with bright blue and red hair, ones with visible and cool looking tattoo sleeves and a few with cheek and lip piercings. Funnily enough, I've yet to hear of a single customer being outraged at those employees' appearances...",
            "Thankfully this and tattoo acceptance is changing. It's changing at such a snails pace though, which is unfortunate. So many companies still enforce these kind of dumb rules, but when all these stupid policy making mfers die out, the whole thing will end.",
            "I’d like to see him try that now! Oh you’ll fire me huh? I’ll have a job at competitor in like 3 days",
            "As a certified \"old person\" (according to my kids) who also worked retail many years ago, it's a foolish belief that the customers will be upset by \"unnatural\" hair colors and will refuse to even go into a store with a worker like that. I say foolish because it is. Most people don't care what color hair an employee has. They may judge you for it, have a superiority complex over it, but it won't stop them from spending money if they want an item the store has.\n\nFortunately, it seems like colors of all varieties are becoming more and more acceptable. Personally, I like it. I've seen some amazing color variations on people. I've seen horrible color decisions as well. In the end, though, it hasn't affected the quality of service one bit so more power to 'em.",
            "My husband used to call me Rogue from the X-Men because of a grey streak that was in the front of my head. The streak just blends in these days. I’m not completely grey but not far off, 39yrs old.",
            "Was this recent? I work at a major retailer and no one cares about hair color anymore. That is antiquated as heck.",
            "You should have dyed it fucking silver. All natural color if youre boomer aged, but still totally compliant.",
            "I was told that at a former job... when the majority of my older coworkers had that hideous cheap ,dollar store  rusty burgundy hair, including a supervisor. Where in the world is THAT a natural hair color??",
            "In the same vein but different I stopped wearing bras a year and a half ago vecause I have a small bust and wearing a bra was a pain + had NOTHING to do with my ability to perform my job. Manager (also a lady, but older than I) told me I had to wear a bra because my nipples were visible sometimes through cloth. I pushed back and told her I'd wear an apron on the floor, only while clocked in. \n\n\nNowadays *I'm* the manager and wear what the fuck I want. This translates to tshirts or polos with the company logo or high necklined [tank tops](https://www.target.com/p/women-39-s-slim-fit-tank-top-a-new-day-8482-black-m/-/A-81207485?ref=tgt_adv_XS000000&AFID=google_pla_df&fndsrc=tgtao&DFA=71700000012735151&CPNG=PLA_Women%2BShopping_Local%7CWomen_Ecomm_AA&adgroup=SC_Women_Local&LID=700000001170770pgs&LNM=PRODUCT_GROUP&network=g&device=m&location=9002578&targetid=pla-1069759242670&ds_rl=1246978&ds_rl=1248099&ds_rl=1241788&gclid=Cj0KCQjwnJaKBhDgARIsAHmvz6fU-DntAGmhRhHRbfDDVIvCuR-NElzqpb3RAA8d0PN2NU5495XHe0gaAufsEALw_wcB&gclsrc=aw.ds#) that are neutral colored  layered under a company sweater. I'll be damned is anyone on my team is considered offensive for being fully clothed with a higher neckline.",
            "When I was doing Tech Support I had to wear either a company polo shirt (that cost $35 each) or a dress shirt and tie. This is Tech Support that was done over the phone.",
            "Lol I've been in that same position with some bullshit company policy. \n\nAround maybe 2015/16 my old company changed their dress code to allow visible tattoos as long as they weren't deemed \"offensive\" and weren't on the face. However, piercings still weren't allowed except for earlobes.\n\nWell by then I had already had my nose pierced for almost a year and within a month of the policy change, went and got a huge tattoo that covers the whole inside of my forearm.\n\nMy GM didn't really give a shit but I'd have to take my nose ring out anytime our regional or above made a visit and it worked...until he popped in without warning one night. \n\nHe gave me the whole spiel about it and I told him I'd take it out if he paid me the cost to get it done etc (I'd worked there for years already and had a good enough standing to pop off when something wasn't right🤷‍♀️)\n\nWe went back and forth until he threatened to fire me over it. Then I just made it a point to make sure he heard a guest comment on my tattoo and 'forget' to take the piercing out until he actually came in every single time.",
            "In my local grocery store, there’s a lady who has bright red streaks in her black hair and it looks so badass, there’s a guy who has full baby blue hair and it looks so cool. They’re both really good at their jobs and no one gives a rats. I don’t get how people think ‘unnaturally’ coloured hair makes the employee a bad worker.",
            "I took advantage of WFH and grew a mohawk. I ended up stopping by the office one day and was seen by the president and vice president. No one said anything negative so I kept it for a while.\n\nWe had a girl in our payroll department that would dye her hair a different color damn near every week. Again, no one said anything negative and she kept doing it.",
            "Old perceptions from an old company. I worked for Schwans delivery years ago and you could practically have mutton chops, because sideburns were allowed in the 70s (when the rule was written) but no beards, mustaches, or goatees. The year they finally allowed goatees was the best day ever. As I had always had a goatee from middle school until I had this job. Growing it back was like going home. My sales increased because I was more myself and my confidence was back. Corporate office drones never relate happy comfortable people with professionalism. Now I'm a mailman and rock a full beard and tattoos.",
            "Years ago I worked in a hospital (90s) and some manager got a stick up their behind about pierced ears.  No more than two piercings were allowed and anything beyond that had to be removed.  So one of the vampires (phlebotomist) took them out and to keep the holes open threaded them with thick fishing line.  Looked horrible and she knew it.  Policy went away eventually.\n\nBasically they didn't want to \"upset\" or \"offend\" the old people.",
            "> I still don't know why my ability to serve people was affected by my hair colour.\n\nBecause the boomer mentality still drives and owns most of the workforce around the world. Their biggest 3 philosophies are\n\n1) individualism and being unique is bad\n\n2) Taking advantage of others is how you get ahead\n\n3) everyone who isn't successful/worshiping them is just lazy/stupid/ungrateful",
            "If people didn’t jump to conclusions about other people based on how they appear, the world would be a very different place.\n\nAs it is now, 80% of communication is nonverbal, and a lot of that is taking in information about how the other person acts and dresses, then using that as symbolism to extrapolate other information about them and your place relative to them. This automatic system is often wrong. You shouldn’t judge anyone by appearance!",
            "The only people who even care anymore are old boomers who think they should be entitled to continue living in the 1940s. \n\nI have a green mullet and I manage a business. My hair has zero to do with my capability and/or professionalism. I live in a small rural conservative town and I even have little old ladies coming into my business and telling me how much they live my hair and they wish they could've done fun things like this when they were my age. I tell them to sit in my salon chair, because fun does not have an age limit, and they will never be too old for fun funky hair.\n\nI'm having a woman in her 40s coming in next month for all over rainbow hair. I just did galaxy hair on an 11 year old girl on Wednesday. Life is too short to live on default settings. Go be boring somewhere else Boomers.",
            "Your boss was ridiculous. We should destigmatize funky hair colors, piercings and tattoos.",
            "I'da just shaved it off, down to the skin and rocked the Sinead O'Connor look.  Now what shithead manager?\n\nI protested back in my 20s being made to attend a fancy dress ball by my boss by dying my hair and goatee as close to white as the hair bleach would get it.  Black suit, purple shirt, and I forget what tie, I looked like a hit man.",
            "When I was 20 my workplace (retail) had a fundraiser for Red Nose Day. We all did wacky things which included me having my hair dyed blue.\n\nThat night, we all went on a work’s night out to celebrate our efforts. All my managers were laughing at my blue hair. They thought it was ballsy and hilarious.\n\nThe next day I turned up for work and was immediately sent home until my hair was restored to a “natural colour.” Bearing in mind they knew about my plan ahead of time and didn’t say anything about it the previous night I was pretty pissed.\n\nI wish I could have complied maliciously but the best I could do was get my hair dyed jet black - which looked very unnatural on me. I didn’t even bother to wash the dye line off my forehead and around my ears. It looked every bit as unnatural as the blue hair but was, at least, “a natural colour.”",
            "I work for a pretty major chain and because it’s a franchise my manager allowed me to dye my hair (my friend works for a corporate store and was not). It hasn’t affected my ability to do my job in any way, and you’d be surprised at how many old people seem to love bright blue hair lol. “No unnatural hair colors” is horribly outdated- even the seniors get that",
            "Honestly coloured hair and tattoos can give a store a youthful vibe. We have non descript boring people like me and people with undercuts/locks and tattoos. Some of wear no make up and have body hair (me) and some of us wear loads of makeup. As long as we are sun smart, closed in work boots and the company shirt the rest is fine.",
            "I would have dyed my hair bright orange because that is a natural hair colour lol he probably wouldn't have liked that either",
            "reminds me of the “how many pieces of flair are required” scene from *Office Space*",
            "My Asian high-school have natural hair color rule. One of my classmates has light brown natural hair color and she had to dye it black because teachers said anything but black is against the rule",
            "My first food service boss was so chill. My hair was a different color every month and I had multiple piercings and gauges. I was quick and that was pretty much all he cared about. The next job made me take everything out.",
            "Reminds me of my first job, also in retail.\n\nI had “long” hair at the time. Quotes because it wasn’t long enough to tie back but long enough to cover my face. As a moody teenager this was fine by me, but work told me to tie it back or cut it, because “you can’t have hair over your eyes”. \n\nSo I went and got a mohican. \n\nThey got mad I’d gone from one extreme to the other and told me I couldn’t wear it up because it’d “intimidate the older customers”, however they let it slide on charity days when we didn’t wear uniform/fancy dress. Every single time on those days there’s be several customers in their 80s saying they loved my haircut.",
            "I had a job with a no colored hair rule, but the store owner died her hair purple shortly after telling an employee to dye their hair natural.",
            "I startled my interniship at a nursing-home with bright green hear. I could tell the school and supervisers felt it was disrespectfull to the elderly, but they couldnt say anything(norway) . The thing is, the residents there loved it! Individuality should never be offensive.",
            "They don't want your skills , they want to own you",
            "I'm a psychologist and currently have mermaid colored hair. My clients love it. Didn't change the way I do therapy",
            "Our dress code at work was like this until about 3 years ago. The day after they changed it, I dyed my hair purple. It's been purple ever since, with the exception of a few months last year when I attempted blue (my hair won't hold blue dye).\n\nIt hasn't affected my ability to do my job one bit. Just like being allowed to wear leggings wouldn't affect it, but they haven't changed that yet.",
            "We had to have our hair conservative in style and natural in color. Cue this 16 year old coming to work with a full head of LONG gray hair and they couldn't do shit.",
            "I work in the medical field.  Up until 10 years ago,  the policy everywhere I worked was \"no unnatural hair colors period \". Well, I have dark brown/black hair. Yep, started turning grey in my 30s. So, I color my hair. Once I was allowed, I had a mahogany color with dark purple and magenta highlights.  I loved it. The patients loved it also. I'm not working right now and can't afford the upkeep. It's truly the one thing I miss; however,  I love taking care of my new grandson more.",
            "My job is stupid strict about dress code (grocery store). No beards allowed, mustaches must be trimmed to the corners of the mouth and the one that affect me the most, absolutely no colored hair. I haven’t had my natural hair since 7th grade. That really bugged me. And I couldn’t even dye my hair and cover it up for work because “all headbands must be 3” or less” and I had covered it using a bandana. \n\nOn the plus side, they’re starting to loosen up because one of our stores in a different county is affected by laws banning dress codes at work.\n\nBut until then, the rules are stupid and really old fashioned.",
            "Ironically it wasn't until I got into more \"professional\" settings that people were cool with my hair color and tattoos. Retail? Natural hair and cover up that shit (forearm tattoo). Corporate? Who cares. I'm not strictly customer facing, but have had meetings with customers before in a consulting manner and no one cares.",
            "In most of my call center jobs, including the one I was in up until earlier this year, I was not allowed \"any unnatural hair color\". I was in a non customer facing role and I could talk/type without my hair so...\n\nThe part that REALLY got to me though is that people I know CAN have unnatural hair in their place of work. I am referring to a licensed therapist, a third party counselor for elementary/middle/high school kids (the schools have someone from the organization at their school instead of hiring someone by the district), a retail pharmacy technician, and my fav...a nun!  The hair colors here are purple, pink, blue, and brighter purple for the record. All are public facing too.\n\nI will say this, when I was no longer working due to health reasons I went out and dyed my hair purple, something I've wanted for the past decade, as now I have the chance and dammit I'm taking it.",
            "When I was a punk back in the day I had bright pink hair.  My mother and sister made me dye it brown because I had to be a bridesmaid.  I looked appalling.  \nAfter the wedding and the photos and all that claptrap, I RAN home.  \nI poured bleach all over my hair, fingernails drumming on the sink, stripped out all the brown shit, and vaselined my hairline, face, neck, had rubber gloves up to the elbows, and dyed it back to the glorious fuschia pink that it had once been.\n\nI changed into my punk clothes, black plastic trousers from a store called SEX on the Kings Rd, red plastic stiletto-heeled shoes, the obligatory shredded, safety-pinned t-shirt, and headed back to the reception.\n\nMy mother nearly had a coronary, my sister rolled her eyes, my grandmother and various aunts shook their heads.  My mother absolutely insisted I go home and change back into the filthy bridesmaid dress and return.  I had to do that, and I was extremely bitter.  \n\nBut I still had my pink hair!",
            "Solution: dye your hair blonde, brown, and red all at once. All natural hair colors~",
            "I have a friend who lost all her hair after surviving breast cancer. She wears a pretty blue wig and baseball cap. Yay friend! And she’s cancer free now!",
            "> I attended university about 10 years ago. As is pretty standard when one is a student, I dyed my hair funky colours.\n\nMy ex is a professor in her early 40’s, and still has blue hair, striped with blonde and brown. She’s also got something like 8 tattoos, including a half sleeve, and wears short sleeved shirts to her classes.\n\nDo what makes you happy.",
            "\"Mostly a natural colour\"\n\nTechnically all colours are natural colours. He didn't say natural HAIR colour.",
            "I've worked with the same grocery store for almost 20 years, they had some of the strictest dress code policies when I first started. I remember having to wear a shirt and tie as a bagger. As a guy I also remember Men couldn't have long hair, wear earrings, have a beard or visible tattoos. Mustaches were okay as long as it was trimmed to a quarter of an inch.  Nobody could wear shorts, even those of us that were on the lot collecting carts on a hot summer day. Nowadays since the store has been bought by other bigger companies over the years and they want to try and keep up with the changing times the only actual dress code is an apron and/or a name tag, as long as your clothes aren't dirty and tattered and are appropriate for a work environment.",
            "I worked in retail till just recently. I saw women over 50 with dyed hair almost every day. The rules aren’t for the customers.",
            "So much of our culture is based off of what we've been told someone is supposed to look like. It sucks",
            "A decade or so ago, this made a (very) little bit more sense since it wasn't really common at all and only \"punks\" dyed their hair like this so it wasn't very \"acceptable\" thus not very \"professional\". (Notice all the quotation marks, because even back then, I didn't believe any of this personally, but it was the prevailing thought process of \"proper\" adults.)\n\nNowadays though, it is so common, even soccer moms have pink and blue hair. These policies don't make a lick of sense anymore. As you said, what does it affect your ability to serve customers if your hair is brown or blue?",
            "I used to work at a large chain coffee shop as a barista. I always had multiple different colors in my hair at once and liked to change it every month or so. One day I had a man come to my register to order his coffee and he said to my face “do you dye your hair like that because your daddy doesn’t love you?” I just stared at him blankly because I had absolutely no clue what to say to him. I wore a hat or my hair up most days after that.",
            "I have emerald green hair and I work in a place where colored hair is a big no no. I told my managers I refused to change it, but out of respect for them I’d keep it covered. I don’t interact with customers at all so I don’t see the problem, especially when some employees whose job is primarily customer interaction also have funky hair colors.",
            "You know, green in quite a common colour in nature.",
            "I’ve never dyed my hair but don’t get workplaces being anti hair dye",
            "That's seems ridiculous to me. You work for them, not owned by them.",
            "Same reason why I don't understand how my ability to solve tech issues is impacted by my wearing a printed tee (kid-friendly of course) and cargo pants or jeans.\n\nThere is no good reason these days but some people and employers are set in their ways...",
            "Reminds me of when I (a guy) dyed my hair blue because I lost a bet. I made the stupid mistake to form a bet (which I obviously lost) with my best friend \"if I lose you can choose the color of my hair\". Well, he chose blue. Please note that this was in the 90s and blue hair was not really that common back then here.\n\nSo I was walking out of a building when some guy, while talking on the cell phone passes by, looks at me in sheer shock and says to the other person on the phone \"This guy has blue hair\". I laugh and tell him \"Well, I've lost a bet\" and he repeats it to his pal on the phone \"He lost a bet!\". We both laughed and went on.\n\nWell, that's my blue hair story. :D",
            "As a former manager of a fast food joint this pisses me off. I always encourage employees to be themselves and comfortable no formal dress code the only requirement is you wear our shirt which we provide 5 shirts per person in the size they request. You can wear pants, shorts, skirts  and shoes of any color idc customers can't barely see your lower half anyway. Exactly as you said someone's attire including hair doesn't affect performance.",
            "It makes the olds uncomfortable.",
            "Did your boss have pointy hair?",
            "You know.. a lot of people grow up with the weird and malevolent, petty power trips that make up high school authority, and they think that's how the world is supposed to work, and when they're adults, that's what they do.",
            "20 years ago I had a friend threatened with suspension for showing up at school with blue hair. Conservatives sure do love to control others.",
            "A similar thing happened to me at a retail job. I interviewed and they really liked me. But they did NOT like my head of long hot pink hair. So I was told I had to change that if I wanted the job. One trip to the salon and too much money later, they told me on my first day that the policy had changed and they would now allow my hot pink hair. That I had just spent an exorbitant amount of money to \"fix.\"\n\nNow I have hair that would make any fringe conservative want to commit a hate crime. Not that that's a particularly difficult accomplishment.",
            "I can imagine some jobs where a particularly ostentatious hair color could seem unprofessional, but I'm thinking of something like a bank or law firm where you have to wear business attire and deal with older wealthy people who spend a lot of money on professionals. Some geezers may choose to go with a different business if the sniff out something they perceive to be \"unprofessional.\"\n\nNo one would give a crap if a store employee has a fringe of blue hair. They aren't going to choose a different business because of that.",
            "Question? Why is it standard? To be unique? Just curious.",
            "Leaving retail was the best thing I ever did. I work for a truck manufacturing plant making 20/hr, 8$ a week for FULL benefits, 401k, and garaunteed week off, and I can do whatever I want. Piercings, band shirts, and whatever hair I want. It's great. Fuck retail. The whole industry is hyperpandering and I got tired of it.",
            "Managers don’t know what they are doing. In order to believe themselves useful, they have to do something, so they enforce dress code policies.",
            "I worked as a cashier in a high end grocery store, y'know, the kind that rich wives bought gourmet shit at. Anyways, I had blue hair when I applied and was told I had to dye it for the job. While working a shift, I complimented someone's pink hair and told them about my own and having to dye it for the job. She was shocked, but the next customer was a little old lady and she said she would have never come through my till if my hair was dyed. That was the first time I experienced the reason I was mandated to dye it. So silly.",
            "Typical dick move by someone trying to assert power over you.",
            "When I was in high school, and even for a while after I got out (lets put the time range to 2004-2012), 'funky colours' and any piercings except 'normal' ear piercings were heavily frowned upon. You might as well just live on unemployment if you had facial piercings or anything but natural hair. As a punk/goth at that time, it SUCKED.\n\nI'm happy that having coloured hair is starting to become more widely accepted. And as long as your face isn't filled to the brim with piercings employers largely don't care now. Neither of these things affects us doing our jobs. It's all about companies being worried about how they are perceived to the general public. Now employers look shitty if they don't have tons of diversity and individuality.",
            "Years ago I worked in a kitchen and one of the front of the house girls was told that she couldn't have her eyebrow piercing show so rather than take it out she would wear a huge gaudy bandaid over it. I thought it was hilarious.",
            "Depends what kind or place and what kind of customers were in that place.  If it was a snotty really upscale place with a lot of older, conservative customers, then that might not fit in.  If it was a regular mall type store, then it would not make any difference as long as you were clean and respectful to customers.",
            "At my old call center job, i asked about hair color.  Was told go wild.  So it was green for several years.\n\nI now work as a gov't contractor.  The contract requires natural colors :(",
            "there has been a bias against creativity for about as long as people have acknowledged creativity exists. it's amazing to me that people who can't think outside of the box largely have a say. they are offended and/or frightened by anything that slightly deviates from conventional. they can't think beyond status quo and need everything in their immediate vicinity to adhere to their tired aesthetic standards view their attitude as superior and preferable. just let them think it's a superior, more productive and more profitable mindset. they aren't going anywhere.",
            "That's just silly, I enjoy seeing people with different coloured hair (I really like the fire ombre effect).  \n\n\nIn a previous life when I was employed, someone died their hair dark blue (they were dark brown) and could barely tell, they were given a written warning. I now run my own firm and couldn't care less. More colours the better :D",
            "I have blue ends in my hair, because my grandkids have blue hair and it wanted to match. It has yet to affect my ability to do stuff.",
            "I just retired after 20 years in the military, and am having so much fun.  After that long of being told what to wear and how to look I was more than ready to try what was never allowed before!!! And if my corporate job has hair color restrictions they haven’t said anything yet.  I have long brown hair, and dye underneath (“peekaboo”)and so far I’ve had a rainbow, then magenta and purple, and I’m now on blue and green streaks. I have an awesome stylist and anytime I start getting bored she has a new color combo ready!   \n\nAnd while I work with older, sometimes stuffy men, they think it’s cool.  I’m still climbing the corporate ladder, and giving as good if not better work performance!",
            "Good on you, tbh I also dun understand why colorful hair is a problem since its a great convo starters with customers.\nI used to have neon aqua blue hair and my manager and customers loved it. Til it started a mini competition among my co-workers and customers for being the most colorful in terms of outfit, hair and nails (a trainer won for having neon green hair).\n\n My hair stylist gave me a discount during my next trip from the recommendations to my customers even 🤣\n\nWas happy to say my job at front desk at a boutique gym was extremely lax with their rules other than pants need to be dark colors. Anything else u can go el poco loco with the colors!",
            "I starting using a color depositing shampoo and conditioner after I let my hair go naturally gray, and it turned out actually white. I’m only 62, and I like to have fun. I topped off my color (purple) this morning, and then went to church (a very small one). A new pastor was there for the first time. Near the end of his sermon, he mentioned women who dyed their hair weird colors like pink or purple (don’t remember the context). I saw his wife out of the corner of my eye signal him, and he stuttered and said he never understood why women do things like that but it’s all good! I’m sitting there with a big smile and suppressing snickers. When I got in the car I then belly laughed half way home. I wasn’t offended. I get lots of compliments on my hair, and this isn’t my usual church, so he’s right, it’s all good!",
            "It doesn’t at all. It might affect some people’s attitude towards you, but that’s on them, not you. \n\nMy father was so mad when the first thing I did when I moved out is dye my hair blue and get a tattoo where it couldn’t be hidden easily. He insisted I would never be able to get a job. When I added facial piercings, he about lost his mind. But then I got a job working at a middle school with kids in special education with “behavioral problems.”\n\nHe was shocked schools would hire teachers with colored hair and piercings when I told him how many of my coworkers have tattoos piercings and bright neon hair of some sort. The world is finally changing for the better in these areas.",
            "When I was 19 I was an assistant manager for a drug store in a college town and joined a punk band.\n\nThe store policy stated no \"permanent unnatural\" color and the band members had different colors so I thought that I would join in and chose neon green (it was the 80s) and knew I couldn't put a dye that would last more than a week.\n\nI girl that I was dating had bubblegum pink and suggested that I use lime green and a quart of warm water. My hair was naturally platinum blond so I didn't have to bleach it out. Lasted a few days and came out with normal washing.",
            "My mother is in her mid-70s with grey hair.  She and her hairdresser have fun putting every bright colour through her hair.  She’s an artist and describes what she wants is for her hair to look like her paintbrushes were wiped through to clean them.  I’m naturally blonde, with my hair dyed a bright auburn with violet/purple streaks.  I work a job in local government with a code stating no “extreme” hair colour.  Still not sure what that means.  My bosses are happy so long as I do my job, so….",
            "I work in customer service and had my hair pink then blue. I got a ton of compliments from customers and an easy way for them to remember me.",
            "Lol i walked into work today with my hair in a bun and the underside dyed blue and my boss said he liked it.",
            "I once wanted to dye my hair ash grey.  When I asked if it would be allowed, my manager told me I wasn't allowed because it was \"unnatural\"\n\nOther people older people, all dyed their hair from grey to black, brown or blond.  But I wasn't allowed to do it the other way.",
            "My last retail job before my current had that as a uniform policy and other stupid shit that has no bearing on your ability to serve people.\n\nI think a lot of the policies are just archaic but no one bothers to change them. Years ago stuff like that was a sign of rebellion and you would be considered unapproachable. Some places just haven't let go of that view.",
            "40 odd years ago, when in the 80s the New Romantic thing was in, dyed blind fringes on black/brown hair was popular. The edict came 'only natural hair colours allowed' so I got fine blond - almost white - highlights done all over.\n\nI was hauled into the Head's Office: \"Pook, you know only natural hair colours are allowed...\"\n\n\"Yes Sir, have you met my Father...?\"\n\nHe had the most wondrous Salt and Pepper Hair in his 40's. Just like mine.\n\nResult!",
            "the idea that coloured hair will bother customers is so stupid to me. i half split dye green and pink hair and all of my customers love it! if anything it makes the customers happier, so banning dyed hair is beyond me.",
            "Some people act like having fun will lose the profits.",
            "I decided when I was in high school that I wanted to have a Mohawk at least once, and then I went all the way to my dream haircut and shaved liberty spikes out of it. I was thrilled. \n\nI worked as a cashier in a small town gas station, and one of the customers was so put off by my haircut that she complained directly to my manager that I should be fired for it. She was awesome, and totally went to bat for me, told me later that she said I was her best employee and asked the lady if she agreed. She said yes, so my manager asked her why the f anyone should be firing me, to which she had no answer. Some people just get this idea that this is wrong and that is right, you can't be a manager without being here for an arbitrary length of time or work a grill without training on fryers first, etc. and there is just no convincing them that their version of normal isn't a requirement for anyone else. My silly hair made me happy and otherwise changed nothing about my job performance, but she leapt directly to TERMINATE HIM",
            "You can get some really nice grey dyes dome that I’ve seen. It’s a natural colour after all :D",
            "Obviously hair color doesn't impact your ability to serve people. I'm sure the issue is either a) your boss' personal prejudice against people with funky hair color, or b) him worrying about it turning off the store's customers. (Or a combination of both.) Doesn't make it right of course.",
            "I would have done like... Black and red streaks or half blonde half black or something ridiculous and be like what? These are natural colors? The clip ins are fucking hilarious and amazing though good job",
            "My catholic school added 3 new rules for male attire when I graduated! No side burns, no goatee, and no hair bleaching.",
            "Me either!",
            "When I got out of high school I could literally work nowhere because of lip piercings. I refused flat out to change my looks to appease any of them. Now a days I would have no issues in the fields that I work with piercings tattoos or anything.",
            "I used to be a caregiver. I had bright purple/blue hair when I was hired. Was told that I would need to cover it because it could stress out some of my clients. Ok cool whatever I'll wear a hair covering. The funny part was my id badge showed my purple/blue hair! I went to many clients who specifically asked to see my hair because they thought it looked fun in the picture. Never needed to wear the hair covering again with those clients.",
            "I gave one of my workers shit when he started - about the fact he had gotten rid of his Mohawk before interviewing!  He shaved it off because he told me he wasn't sure how it would affect his interview.  I told him hairstyle doesn't determine ability.\n\nI will enforce dress code only so far - dress neatly, and dress for safety (electronics lab). Otherwise, you should be you.",
            "As a manager with bright blue hair past my shoulders: I approve.",
            "You know green is the color of nature, can't get more natural than that ;)",
            "I always kept my hair short.  Since the pandemic, I've let my hair grow out to a point where I've now not had a haircut since November of 2019.  I don't plan on getting a hair cut as now I've got long hair.  I've been working from home for well over a year so I don't have to see anyone I work with either so it's worked out for me in that regard.",
            "Should have shaved your head. It's all natural.",
            "This makes me think about the conflict with tattoos and a nurse's story about their own tattoos being practically unnoticed until policy said to cover them up.",
            "Dye your hair green with a hair colour that's made from just natural ingredients, problem solved.",
            "First off I have to say that boss couldn't make up his mind it seems. I bet under whatever hair color he was, he was a \"Ginger\" because he \"Ginger Snapped.\"",
            "This was recently changed where I work, because its now classed as discrimination.\n\nOnly person in my office who disliked my blue hair was the director, and he was bald.\n\nSo in December I'm going blue again.",
            "I support all this. Most rules against color and tattoos are micro-managing bullshit.\n\nBut we've come one way.\nMy mom had to fight for the ability to wear pants for work instead of a long skirt and pantyhose, which back in the day, was expensive and failed easily. That's all happened in a single human life time.",
            "Fucking fashion police bullshit.  My store's dress code is a full page long, but it's all shit like not wearing ratty looking clothes, keep yourself clean, no stained shit, etc.  I do not give the slightest shit about my employees' hair color, tats, peircings, or any of that garbage.  Like, who cares?  Are you going to do a good job and not fuck up the money?  Cool, have fun.",
            "Yeh these are definitely control moves, nothing to do with your quality or ability to work. Some people become managers and business owners because their biggest thrills are a) not having to take orders from others and b) ordering other people around. Stupid fragile egos.",
            "This hair color issue is likely about what some usually unseen person at the top of the organization believes and THAT PERSON exercising their control over the people below them.  Simple.  It is not about appearances, it is about \"control\" and compliance.",
            "Funny cause of all the women with platinum blonde hair... on 99% of them it looks totally unnatural",
            "I’m confused. What’s the malicious compliance?",
            "People are weird when it comes to things that have absolutely no barring on their lives.  I'm not into piercings and tats but always back up my nurses when someone complains they have them.",
            "Because old people don't like it when people don't fit the mold.\n\nSeriously, everything shit about retail comes down to old people complaining about things that offend their traditional \"sensibilities\"",
            "It isn’t.  I Like different colors and styles of hair.  Never really understood why anyone would have a problem with it.  No different than makeup or well-done nails.  If it looks good, it looks good.",
            "[deleted]",
            "I would have quit on the spot and spat directly in his open mouth. Tell him to take his power trip up his urethra and walk out. Then complain to corporate that a supervisor was forcing his personal beauty standards on your person and explain how that infringes on bodily autonomy. Then flair the whole thing on social media for maximum fallout. Seriously, if a retail store can't handle clerks with dyed hair fuck them and salt the earth."
        ]
    }
]