[
    {
        "post_id": "u1bdv8",
        "author": "Languid_Bot",
        "title": "When mom goes on strike...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/u1bdv8/when_mom_goes_on_strike/",
        "score": 13499,
        "num_comments": 602,
        "created_utc": 1649693811.0,
        "selftext": "When I was a baby my mother was home full time with me and 3 siblings under the age of 6.  According to my mother, one day my father comes home and is mad because dinner isn't ready and waiting for him.  Mom tells him she's been busy and it'll be ready soon.  Dad says he doesn't know why she didn't do it sooner (and here's his mistake) because it's not like she's been doing anything all day but sitting around 'babysitting'.  Foolish, FOOLISH man.  Game on.\n\nMy mother decides she will show him what life is like when she sits around all day 'doing nothing'.  For the next few days Mom lets the kids run wild.  She picks up nothing.  She doesn't tell the kids to pick up anything.  She doesn't stop the kids from getting into anything.  Mom said she just sat around making sure nobody was doing anything dangerous.  She doesn't clean, do laundry, etc.  BUT dinner was waiting!  LOL After several days of a HOT MESS at home my father couldn't take it:  he apologized and admitted he was wrong.  Quite a milestone in our family.  Dad was NOT known for admitting he was wrong OR apologizing!  Mom 1, Dad 0.\n\nEdit: Just wanted to say this happened 1967/1968.\n\nEdit 2: Thanks for the awards!  Glad some of you got a chuckle out of this family story.  ",
        "permalink": "/r/MaliciousCompliance/comments/u1bdv8/when_mom_goes_on_strike/",
        "comments": [
            "Good for her. My ex is my ex for this reason. The man would literally drop his dirty clothes on the floor 3 feet in front of the hamper. His aim at the toilet wasn’t much better.",
            "Good for your mom! That reminds me of a story I read (the book was about the history of vanilla) where the wives of farmers in South America liked to have their hot chocolate- not any hot chocolate either as it had to have spices and vanilla etc.-  during mass and the priest was pissed about mass being interrupted by their servants running up and down the aisles with their drinks. So he bans it and all the women move to have mass in the local nunnery instead. Well wouldn't you know mass is now empty because they've banned the men from attending or they're sleeping on the couch so to speak. It was a great moment to read about, even if the priest did end up relenting in the end.\n\nEdit: Thanks for all the upvotes!",
            "Lmao. The guys who say stuff like that are always the first to backtrack when you say \"well of it is so relaxing, surely you can do it after work and I can go do x, right?\"\n\nAlways makes me lol. They also always say \"I worked all day so I can do x!\" not realizing the same implication.. surely if it was so easy, coming home from work to be lazy would be wonderful right??",
            "Women going on strike can be the best way for men (me included) to learn. The women of Iceland went on strike in 1\\`975 and it changed everything! Within 5 years they had elected Europe's first women president and first democratically elected women head of state. \n\nhttps://www.bbc.com/news/magazine-34602822",
            "A story my grandma likes to tell us is about her dad and stepmom - she was vacuuming one day and he told her “you missed a spot.” She put down the vacuum, said “you do it then,” walked out of the room, and quite literally never touched a vacuum again for the rest of her life. I should get my grandma to tell me that story again so I can transcribe it and post it damn",
            "When my daughter was just born, we moved into my in-laws house for a bit. My husband and I got into a fight about who does what and I mention that I do all the laundry for our family of 3. He says that his mom does the laundry. Oh really? For 2 weeks, I just washed mine and my daughters clothes. One morning he wakes me up and says he doesn’t have anymore clean underwear. I told him his mom does the laundry and to ask her. Last time we argued about chores.",
            "I remember one of my sons (aged about 5 or 6 years old) coming to me all embarrassed and upset, he pulled me out of the living room and confessed that he had stood on the floor to the *side* of the toilet bowl to pee (why, God only knows).\n\n\nAnyway, he miscalculated just how much he needed to go, so the pee shot out at such force that it arched completely over the bowl, and to his absolute horror he found himself peeing directly into the wicker basket of hand towels on the floor on the other side of the loo.\n\n\nHe told me he’d cleaned up any drips on the floor, but was at a loss about what to do about the basket full of towels and was worried I’d be angry.\n\n\nI told him I’d only have been angry if he had left it and hadn’t owned up, and not to worry, everything could be cleaned no problem. I dumped all the towels into washing machine for a hot wash, and scrubbed the basket when I had a shower that night.\n\n\nI laughed so much I had tears!\n\nEdited to add: \nI’m not sure who gave me the award, but Thank You kind internet stranger!  Wishing you an excellent day.",
            "My mom got mad at my dad once and took off to her parents' for two weeks. I had to get up, fix a *hot* breakfast for my dad, sisters and myself before school and dinner at night (three *hot* meals a day on weekends). Dad expected a packed lunch every work day, too, but that ended after two or three days of sandwiches. \n\nA few days in, he informed me that he was out of work clothes. I informed *him* the laundry was caught up (everyone but Dad who could reach the washer did their own laundry, but a few sisters couldn't reach, so I'd had to do theirs and mine). He told me they were in his bedroom. I told him I wasn't cleaning his bedroom...then ran. \n\nWhen I got home from school, Dad had managed to put his dirty clothes down the laundry chute which was *two steps* out of his way to the breakfast table. I had his laundry done by the time he got home...I even ironed his work shirts (I wasn't *that* brave).\n\n*But* I didn't put his clothes away because I *refused* to go through his bedroom to find out where things belonged. Fortunately, he was a private enough person he found that reasonable!\n\nWhen Mom got home, she was absolutely flabbergasted when Dad kept putting his clothes down the laundry chute!",
            "Something similar happened to me, but with a much worse outcome.\n\nMy bio mother, who was horrible at housekeeping and cooking was offended by something my father said so she went on \"strike.\" Her mistake was anouncing it to everyone.\n\nFor one whole week, my father did all the cooking, all the cleaning, all the laundry, while still working every day, and doing the yard work that he always did.\n\nThe house was cleaner than it had ever been, the food was, well \"better\" would be an exaggeration, so \"edible\" works.\n\nThe following week, he left the house and filed for divorce.\n\nMy bio mom never ended her \"strike.\"",
            "My husband was home with our daughter ( medical leave) while I was working 60 hour weeks. I got good at coming home, opening the newspaper (it was the dark ages) and saying \"what's for dinner honey?\" I was not a supermom.",
            "Haha that will teach him! That’s good though for a malicious compliance",
            "I didn't have children but I went on strike with my ex partner. Including sex! Cooked for myself, made my side of the bed.\n\nWe soon came to a mutually acceptable agreement about division of household tasks.\n\nWith holding labour is one of the greatest weapons women have. It's soon obvious that we don't do nothing all day",
            "I’m the youngest of 4 kids. When I was in 3rd grade, about 8-9 years old. My mom took my sister to a pediatric specialist out of town. She had to spend 3-4 nights away from home. When she came back I had lice. My dad let me run around, play at my friends house all I wanted, he didn’t pay attention if I was bathing or eating or anything.",
            "Better yet.  Friday night - You have the kids this weekend.  I am going to take a few days off and visit my mom/sister/brother/friend.   Dinner is in the freezer for all three days. ...all you have to do it nuke it. \n\nSee you Monday morning before you leave for work.",
            "As a single father, if someone calls my parenting \"babysitting\" I lick my palm and slap them across the forehead. Then I say they missed a spot, and when they ask what spot I respond \"The one where something intelligent to say was supposed to be sitting on\".",
            "[deleted]",
            "My parents' relationship when I was growing up was much more \"liberated\" or \"modern\" than I realized.  Even though it didn't last, they had as real partnership when my brother and I were little.  Neither of them would have dreamed of saying something like your father said, becuase neither would have stood for it.\n\nWay to go, Mom.  And lesser kudos to your father for realizing he was wrong and admitting it.",
            "I think the score is more Mom-1, Dad-1, Family Wins.\n\nMom because she got her point across.\nDad because he learned and apologized.\nThe family wins because....reasons.",
            "Honestly, I do this pretty often so my husband remembers my worth lol",
            "Your mother is my hero lol! I'd like to think my husband would NEVER have the audacity but this is going to be tucked away in my brain in case.",
            "I’ve tried this tactic and it only backfired on me. I long for the day my husband appreciates the duties included in being a SAHM.",
            "I fucking CANNOT STAND fathers that can't admit they are wrong or apologize. You think your kids can't see through your bullshit and wont think less of you for it? Morons.",
            "Heck yeah, go Mom! My Dad tried this and My Mom is Latina, did not go well. Some men aren't greatful but my Dad did learn too.",
            "Sounds like my dad. The man handles nothing gross well. My sisters and I have known this from the day of our birth. Why do you ask? He passed out during my birth and my mom has never let it go. I’m 32 in 2 weeks and I *still* hear about it sometimes.",
            "Apology accepted. Now, do you want to dishes or laundry?",
            "My mother went on strike once. I was always a very self-sufficient child and once I hit my teenage years I was out of the house almost all of the time. At one point when I was in high school my mother complained cuz I wasn't doing any chores around the house. I suggested that if she wanted me to do chores she would give me an allowance. She agreed and I began doing chores around the house. After two weeks of washing dishes and vacuuming the carpet I got no allowance so I stopped doing my chores. My mother took all the dishes and silverware with the exception of one plate one cup 1 knife one fork and one spoon and put them in her bedroom. She stopped buying groceries ( or so I thought).One day while she was out I broke into her bedroom and discovered that there were 16 bags of groceries in her bedroom and some of them had food that was molding. A month later she told me that if I moved out she would give me my father's child support. So I moved into an abandoned trailer. But again, she didn't give me the money so I end up having to move back in.\n\nI know this sounds horrible , but it wasn't really a big deal to me. I pretty much only came home to sleep anyway. I was either working, at school or hanging out with my friends.",
            "My ex once asked me “what do you do all day”. I had 3 kids under 3.5 and an 11 year old.  Not doing what I did all day for a few days woke him up. Not enough though hence my EX lol",
            "People in general don't always see what another person does or does not do.  \nI used to be 'the reason' the bathroom was full of towels and never cleaned at my mother's house.  \nI decided to shower exclusively at the gym for a month. I cleaned the bathroom once and then didn't enter it for the entire duration (toilet was in a different room). I didn't tell anyone I wasn't using it anymore. 3 days it took to become a mess again.  \nAfter 2 weeks I get shit again because I make the bathroom dirty, I explain I haven't used it for a while and nothing changed because my family doesn't know how to admit to mistakes... infuriating.  \n\n\nSame with a roommate and the kitchen. She complains I leave the kitchen a mess when I cook, so I clean the kitchen really well, stop cooking. 2 days later the kitchen looks like a warzone and doesn't get properly cleaned for a week. She invites someone over, tells them \"please excuse the kitchen, V1nchent doesn't clean up after he cooks\"...  \nI tell her I cleaned the kitchen and haven't made food for a week, so it's all her mess.  \nShe just tells me I am lying. How the duck do you even deal with people like this?",
            "This is why it fucks me all the way off when people act like SAHPing is the \"easy option\".  I've never worked a job that made me cry as much as parenting 3 kids under 4, and I joined the military.",
            "I was having guests to a BBQ. I had cleaned extra. Cooked extra.we had dinner, dessert,  etc. One of the guest boys, 11 years old, had used the bathroom.. I was next. I walked in, turned right around. I hauled that child back up to the bathroom, and handed him the clorox wipes. He had left a mess.  He was asked to clean it. \nAnd so he did.",
            "Ever day that I come home and my wife says “I’m sorry, it doesn’t look like I did anything,” I look at our youngest, and say “well he was fed and he’s not hurt, so obviously you did *something*.\n\nEvery time I try to pick up one of my kids toys, they get out two more, I swear just to spite me.",
            "My old man tried this once, only once. Came home and asked why we weren’t having a proper dinner (because apparently throwing together some eggs on toast after a day of hell with 3 under 4 wasn’t good enough), mum pegged a can of tomatoes at him. Never complained again.",
            "Kudos for mom not putting up with this, and also for dad for admitting he was wrong.",
            "My parents were the same.  4 kids all at home, either wonderful meal and fresh baked bread + messy house, or clean house and dinner isn't ready or very good.  My dad complained both ways.  She decided if she couldn't please him, at least one of them should be happy, so she did what she chose and ignored his complaints.  He lightened up over time because a happy spouse makes the house happier, especially when there are that many rugrats around.",
            "I cannot understand parents who consider caring for *their children* to be 'babysitting'.",
            "Damn. I did the reverse of this strike. I asked my ex what he wanted for dinner and he chose a fancy schmancy dish that I had made him a few times before. On his way home he stopped at a fast food restaurant and ate in the car. So he didn’t want the dinner I spent two hours making (plus another hour shopping for, with a baby). So I threw it in the garbage and didn’t cook again for a few months. I think her idea was better because my ex continued to be a douche.",
            "That’s the only way to teach some men.",
            "Yep in my experience this works well..",
            "My step mom would do this periodically. She’s go on strike and the house would be super messy so my dad would have to apologize. This happened once every six months or so.",
            "Lol YES!! I KNOW they notice once you actually DO nothing. All day.",
            "Boy times have changed. Of the 8-10 couples I'm friends with, the majority have the male as the main cook and they all seem to share household chores pretty equally no matter what the work and parenting arrangement is.",
            "Thanks for the reminder. My household is due for an annual strike.",
            "And there is your perfect strategy for any labour dispute 👍",
            "I have never been a mother myself but watched my sister when my older nephew was a baby. She made me realize there is no job harder than being a mom.You will never hear me say moms don’t work.",
            "More like Mom 1000000000000000000000000000000000000000000000000000000000\n\nDad ZERO",
            "Go mom!",
            "I just came across your story through a 'best of' site, and I've had the exact same experience as your mother \n\nI am the stay at home mum, while also working part time on the farm we rent on while my wife is the primary bread winner doing a 9-5 job. I do all the cooking, cleaning, running grocery errands, sorting 6 dogs, two kids and their schedules all the while keeping a huge house clean and a massive garden mowed and looking nice. \n\nI'm typically up and running at 7AM, (sometimes as early as 4 depending on my work schedule), and won't sit down again until 7pm once all the dishes are done again and the dogs are settled for the evening. Because my wife gets done at 5pm and isn't home till 530, at most she only sees the food come out the oven and then the time I do the dishes afterwards. This translated in her mind that all I do is tea and dishes once a day and since the house is clean, I must surely just be sitting around all day doing anything since there isn't anything to clean. She would fuss at me asking why I didn't clean all day if she found anything put on a counter. I sort of created this as I recognise her work is difficult (eye doctor) and that she provides for us, so I have never had a problem being house mom and just doing everything myself so that she could enjoy her time off with the kids. \n\nUnlike your mom, I didn't go on strike intentionally. Instead, I got covid and it hit me like a freight train. I was unable to move or function for well over a week.  I was so bad that I spent 5 days laying on the floor unable to move or eat and lost nearly 20 lbs. Because I had covid the whole family was on quarantine.edictably, and predictably the house fell apart. \n\nAfter a day, you couldn't find a clear surface anywhere in the house, the kids rooms disasters, the bathrooms were nearly classed as bio hazards, no clean clothes, dishes, the floors were nasty and you couldn't walk through the garden without stepping on piles of dog shit scattered everywhere. The worst part for her was when she realised I wasn't going to make food as I was completely out of commission, and she hasn't had to make a cup of coffee, much less a meal herself in nearly 15 years as I am the queen of the kitchen.\n\nAfter I got better, she watched in amazement as I put the whole house back together in a matter of hours over an afternoon, and had a specific home for every single item and was able to zip around cleaning disaster rooms in a fraction of the time she thought it would take me. The next day I tackled the garden, from mowing to trimming the hedges to clearing all the crap, with tools she said she had no idea we even owned.\n\nEver since our quarantine ended, she hasnt uttered a word that she thought I didn't do anything.",
            ">he apologized and admitted he was wrong. Quite a milestone in our family. Dad was NOT known for admitting he was wrong OR apologizing! Mom 1, Dad 0.\n\nI don't agree with the score\n\nEveryone wins here. Mom gets more respect for what she does, dad gets a better understanding of how critical she is to running the house and grows as a person\n\nNo downsides",
            "This isn't new though. Unfortunately happens all the time. Men develop a mentality that childcare is beneath them and that they are doing all the work by going to work and bringing in a paycheck. It can happen in reverse but typically women are the ones who give up their careers to take care of children. \n\nThere was a big enlightening discussion on it in one of the child free subreddits I believe. \n\nI've also seen couples that have way too many kids like it's going out of style. Typical relationship again where the woman is home and during lockdown the guy went crazy. As soon as the office was partially opened he was there. He couldn't stand to be home with his kids. Its like... Hmm guess you shouldn't have had that many then huh? Most ppl don't think about that though if they can find ways to not deal with their kids. Daycares, sitters, etc. I even have family like this who come home too tired to deal with their kids...and I'm just like...they are your kids. You choose to have them and that comes with spending copious amounts of time with them and actually taking care of them. Doesn't stop when you birth it into existence.",
            "Kudos to your mom, I'm a man, and I know (obviously not from experience) that being a mother is harder than any other job on the planet, so good for her for showing your dad what's up",
            "Oh I've done this. It didn't end well.",
            "Sorry I new to this sub Reddit I might just be overlooking something but what does the S,L, and M stand for? They are a flair in the posts and I have no idea what they mean.. thanks",
            "Good for her! Glad she stood up for herself!",
            "My mum also did this.",
            "Never forget this [Twitter Gem...](https://mobile.twitter.com/cameronxdonovan/status/1206585351122432002)",
            "Best way to prove how much you're doing is to stop doing it and put up your feet.",
            "That story (the title, at least) reminds me of the time, probably 1962 or 1963, when my mother ran away from home. We kids (there were four of us old enough to be problems that way) had no doubt been too rambunctious for her to handle, so she told us that she couldn't take our behavior anymore, and was running away from home.\n\nWhen my dad got home from work a couple hours later, he was met at the door by four children who were *very* upset and tearful, and *very* sorry, and we promised to be good, and could Daddy *please* find Mommy and bring her back. It turned out that she'd gone to a neighbor's house with the youngest (who was 1 or 2 at the time), and had asked the people next door to keep a quiet eye on the rest of us.",
            "LPT for anyone contemplating having children with a partner: be kind to each other! You both will have a ton of work and stress (if you share equally, that is) and it's super easy to start thinking you are the only one busting a\\*\\*. Bitch to each other but also appreciate each other. This is so important for your sanity and will probably save your relationship.",
            "I learned a long time ago to not rely on others. If I came home from work and dinner wasn't at least cooking, I'd do it. Our kids loved that cause they knew I was the better cook. Originally, my wife was a \"empty the can in a pan and heat it up\" type cook. The only thing she'd add was salt. (Like canned food needs more salt)\n\nCame home from work one day, the day before payday. I asked her what's for supper. She replied, \"Nothing. We don't have any food.\" (she thought I was holding back my paycheck and could just go to the store whenever I wanted. Nope) I went into the kitchen and, for not \"having any food in the house\" I showed her that the cupboards weren't empty. Found some instant mashed potatoes, milk, margarine, a couple cans of soup, and a half container of sour cream. Made the mashed potatoes, added the cans of soup and mixed it in. She took one look at my creation and refused to eat it.  She picked up the baby (he was about 2 months old) and announced that she wouldn't eat that garbage and went next door to her friend's house to bitch about my cooking. (mind you, I'd spent 10 hours unloading trucks when this happened) I had our girls sit at the table and gave them a little bit to see if they'd at least try it. I put some sour cream on mine. Not bad, really. They thought the plain was pretty good, and I recommended the sour cream. I gave them a bite of mine and they loved it. Our 2 little preschool girls and I ate every bit of it, wishing that I could have made more. Ex comes back and says she's willing to try it, and got pissed because we didn't leave any for her. Well, she said she wouldn't touch it, so...\n\nThe ultimate revenge? The girls spent the next hour talking about how good my dinner was, stressing how yummy it tasted. Meanwhile, their mother's stomach started growling. I pointed to the kitchen and said I'd found some oatmeal she could make if she was hungry.\n\nWhy didn't I do the typical, \"I'm the breadwinner and expect food on the table when I get home\" routine? It was easier to make supper myself. I used less energy to make supper than I would have arguing with her. \n\nBut, to add insult to injury, I stressed that regardless of me cooking or not, HER job was to clean up the kitchen.",
            "Thank goodness he actually got the point and she had the guts to stand up to him. My ex was abusive and I was terrified of standing up to him. The only time I got an apology for him calling me a horrible stay at home mom was when he had our daughter for one weekend and “couldn’t get anything done” 🙃",
            "I saw that episode of (prime time 90s tv) too",
            "Is anyone else channeling  \"The Great Santini\"?\n\nMy Mom did the same as yours, we were 7,5,3..twins.(but mine LEFT!  (temporarily) I was on the school bus one day and I saw her in a taxi, armed with a 3 pound can of A&P coffee and a carton of cigs on her way to BFF''s house. Dad's car in the driveway = serious. After 3 days of 4 caterwohauling kids, stinky dipees, a mountain of laundry...a very smug lady walked through that front door. Things shaped up real quick !  One sad thing...except for the odd Sunday, he didn't cook anymore. 😪 She was horrible!",
            "Poor guy.",
            "Do communication problems run in your family?",
            "Hero Mom.",
            "  \nAt least it wasn't a sex strike.  [https://www.bbc.co.uk/bbcthree/article/1fc04f3e-3128-4be7-a78a-28ea31db4101](https://www.bbc.co.uk/bbcthree/article/1fc04f3e-3128-4be7-a78a-28ea31db4101)",
            "So where was the compliance?",
            "And without him you wouldnt have a roof over your head. Smh.",
            "...mom basically neglected the family for a week to prove a point while dad still went to work to pay the bills.\n\nThe cornerstone of marriage, love and family is teamwork.",
            "Cringe",
            "This isn't malicious compliance",
            "Unpopular opinion: our aim would be a lot better if we didn’t have to put the toilet seat down",
            "Why are you venting your family’s dirty laundry for internet clout? Especially about something you literally didn’t remember yet alone know about? You really want to shame your father that bad?",
            "Dad 1 mom -1. \n\nBack in my Nanz day she had to look after 6 kids must be so hard having to clean the house and cook dinner.. I really feel her struggle\n\nBack in my day satire was a thing snow flake sunday",
            "Thought for a second I was gonna read some johnny cash lyrics",
            "Go to Spotify. Search Wee Sing Fun ‘n Folk play the track Father Grumble. You’re all welcome",
            "Reminds me of the song \"Lady, What Do You Do All Day?\"",
            "My mom did that shit but my dad was too proud we all suffered",
            "I thought this was short scary stories and I did notttt get it haha",
            "Bet your mother still had to clean up the mess though",
            "💖🤣",
            "This is why im a firm believer almost all hate cones from ignorance",
            "Mom 1, Dad -1+\n\nWhat kind of grown adult can't rationalize and admit when they are wrong? All the people I work with talking about wanting to return to the \"good ol' days\" and I'm over here thinking history's social dynamics/conventions were a dumpster fire as recently as ten years go.",
            "I could never have a stay at home wife who refused to look after the children, the home, our finances AND take care of me when I come home from a full time job making the money required to keep our home working.  \nThat's why I'm a single, childless, soon to be 57 year old man!  \nActually, none of the above is true... 😂  \nI'm just an ugly fucker who never managed to find a woman I was attracted to who'd agree to stick around longer than it took to discover that (unlike beauty) ugly isn't skin deep, it goes right to the bone!",
            "I've personally done this. \nIt def works. I got help around the house afterwards.",
            "Mom does this a lot. Go ahead. Take her for granted at your peril!",
            "My mother once attempted something similar. She would always complain that we didn't hang the clothes properly and it was making it more difficult for her to iron them. We repeatedly told her that our clothes didn't need ironing and she should stop ironing altogether, but she would dismiss us saying \"yeah you say that now because I'm doing the ironing, but if I stopped, you'd be unhappy and ask me to do it\". One day, we forgot to hang the laundry to dry, so she decided to punish us all by not ironing anything anymore. We were all pretty satisfied and she never complained about the laundry again.",
            "I'd take dinner. While I do work full time, I am used to cleaning home myself but couldn't make dinner, I've always been a terrible chef."
        ]
    },
    {
        "post_id": "11zdxb8",
        "author": "None",
        "title": "Micromanaging my lunch break? Enjoy the extra paperwork!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11zdxb8/micromanaging_my_lunch_break_enjoy_the_extra/",
        "score": 13488,
        "num_comments": 307,
        "created_utc": 1679560706.0,
        "selftext": "Hey folks! I have a story of malicious compliance that I think you'll appreciate. This happened at my previous job, where my manager was the definition of a micromanager.\n\nAt this job, we had an hour for lunch, but the breakroom was small, so people usually staggered their lunch breaks. It was an unspoken rule that as long as you didn't take more than an hour and your work didn't suffer, no one really cared when you took your lunch. That was until our new manager, let's call him Dave, stepped in.\n\nDave decided that he needed to control when everyone took their lunch breaks. He created a strict schedule, assigning each person a specific lunch hour. My assigned time was right in the middle of my most productive part of the day, which was super frustrating.\n\nI decided to follow the new lunch schedule, but I also decided to take full advantage of my rights as an employee. You see, our company policy stated that any work done during our lunch break was considered overtime and needed to be compensated.\n\nSo, I started to \"accidentally\" schedule meetings, calls, and tasks during my lunch break, making sure to meticulously document every minute of work I did. Then, at the end of the week, I'd submit a detailed overtime report to Dave, showing him all the extra work I did during my lunch hour.\n\nDave was furious, but he couldn't deny my overtime requests without violating company policy. After a few weeks of paying me extra for work that I would've gladly done during my regular hours, Dave scrapped his strict lunch break schedule and let us go back to our old system.",
        "permalink": "/r/MaliciousCompliance/comments/11zdxb8/micromanaging_my_lunch_break_enjoy_the_extra/",
        "comments": [
            "The first thing a new manager should do is... nothing!\n\nObserve and learn the ways things work first.",
            "If it ain’t broke, don’t fix it! I’ve had managers like this before and it’s very frustrating!",
            "Dave, the micromanager, needed to micromanage the micro breakroom. Makes sense.",
            "Putting people into a schedule for lunch without asking their preferences is asking for trouble. \n\nWhen I worked a job that needed staggered lunch we asked each in the team. \nThose who were awake early oreferred an early lunch so they got an early lunch. \n\nPeople are capable of doing things without oversight.",
            "I'm surprised he didn't ask you to justify why that work couldn't have been done at a different time of day! If the company pays overtime for work done on lunchbreak, then it seems like no matter who picks the time it's open for abuse by people claiming work had to be done then, thank you very much for the extra cash!",
            "Management wanted a timesheet breakdown at one time... gave them one that was mostly correct down to the minute with a sizeable \"creating/managing timesheet\" per day item.\n\n...somehow that was very quickly no longer needed.",
            "When did you eat then? I missed something there I think.",
            "in the industry I work in. its common for some of the larger companies to buy a smaller one for one reason or another. you know what the bests one do? drop off new shirts and hats and leave them alone. the ones that don't end up screwing something up with a perfectly run company and pretty much flush their investment down the drain.",
            "Managers that come into new situations and start making changes without observing how things are done in the first place just make more work for themselves. It’s sad, really.",
            "\n\nI was a manager beneath a micromanaging, psycho, gaslighting, liar of a Director that had mood swings on the daily.  I was working 60+hrs a week trying to stay ahead of all the problems she created because she wouldnt listen.  One of the last straws was being summoned to a meeting where I was written up for not completing a couple tasks that she assigned months ago.  No mention of how much work I had done, how much of HER work I had done, nor any mention of how much money I'd saved our department. I just sat there kinda dumbfounded by it all....and then I hatched a plan.  I took a voluntary demotion all the way to the bottom of our department which was the furthest I could be a way from her.   6 weeks later without me covering for her sorry ass, she was terminated. I'm still here and have worked my way back up the chain a bit, but they can keep the managers role to themselves.",
            "I mean, I can understand scheduling meal breaks to ensure coverage but also in my state if an employee misses even 1 minute of their unpaid meal break then they are entitled to a full hour pay at the regular rate.  Also employees are supposed to start their meal period no later than the start of their fifth hour of work or it's considered missed and right to extra hour of pay.\n\nBut I don't like typical schedules, I'm much better working in two to three hour spurts than a full 8hr straight.",
            "These are the people that hate work from home cause they don’t have jobs if you work at home",
            "So many new managers walk into a situation with the plan to kick everyone’s lazy ass into gear. Too bad most of them are too lazy to check how the department has been doing before they evwr showed up.",
            "Similar thing happened to me. Was working at a small company and the employees used to just finish what they were doing before going to lunch, for efficiency. That meant that we were often beginning our lunch hour later, thus returning to work a bit later in the afternoon. Once the owner of the company saw us in the break room just after 1pm, ran to her office and wrote us an email, saying that the lunch time was from 12:00 to 1:00 and we were expected to respect those times. So we just left whatever we were doing at 12:00, even if it meant that we would have to redo the thing after lunch, cause some things just couldn't be left half-done.",
            "First rule of management make sure the place isn’t on fire then lock yourself in your office and hope the people who are infinitely smarter than you are competent and will just tell you what they need from you as you are little more than a glorified secretary/babysitter here to make sure people are playing nice with each other and are not planning world domination from their cubicles.",
            "I’m confused a bit. Does your job require you to be busy at a specific time for paperwork and meetings that you are unable to push to later or earlier? You said busiest time. Are you typically not busy during other times?",
            "*Learn* what is currently working and what is not. *Then* act to fix the actual problems.\n\nBut yeah, he sounds like the sort who feel the need to throw around his Authoritay to reinforce that He Is In Charge. Not a good quality in management.",
            "I will never understand why new managers tend to try to change something that isn't broken just to \"leave their mark\" rather than learn about how the bussiness works and make sure it keeps that way.",
            "Never manage people who don't need to be managed.",
            "At least he understood and changed his ways.",
            "I was fired from a job where my \"manager\" was states away and I worked in the client's office. Long story but was fired. I challenged the dismissal and talked with the state (this was a long time ago). Her reasons were in the end:  taking my lunch at the wrong time and not wearing appropriate shoes. She didn't like the shoes I wore when I flew out for additional training...the training I never got to start with. They were just normal  business casual shoes for my age. And I took my lunch too early. 🤔 When I was fired, I was so happy! I told the JR lady \"THANK GOD!\" And yes, I got the unemployment check right away. I sometimes wonder about her sorry life! 😂 Oh, her assistant got shingles from the stress of just working for her. She was in her early twenties.  😬",
            "At my workplace, that would get a, \"Don't schedule meetings on your lunch break\" reprimand and then a swift path to being fired if overtime continued to accrue.",
            "Always reintroduce people to the true cost of their own assholery.",
            "Why do people like Dave exist?",
            "New manager? just sit on your ass and watch for a month and see how everything works.",
            "I feel like it needs to be pointed out that an overtime request is what you do *before* you work overtime. *After* you've worked overtime, it's a federal labor requirement that you be paid for your work.",
            "Co-irkers. Yeah, I'm stealing that, thanks.",
            "Fuck  \"Dave\"",
            "What an expensive lesson Dave learned thanks to your malicious compliance! It's too bad all the lovely extra money had to end.",
            "This isn't malicious compliance. This is just not taking your lunch break, could maybe fall into petty revenge territory. \n\nIf you had taken your lunch at the time and ignored calls or started it over once you were bothered by him, it would fit better.",
            "So far we have a box in the trenches surrounded by some silly sod called Chesterson's fence. No wonder most managers are confused.",
            "Dwight Schrute did this exact thing on the one episode of the office when he becomes manager.",
            "> After a few weeks\n\nUsually stubbornness evaporates when it comes at a price.  \nI'm surprised.",
            "I would have had every person under Dave doing that the day his stupid schedule dropped. He probably would have eaten his hat.",
            "I work for a small company 15-20 people tops. We started a staggered lunch break through covid times to minimise contact in the smaller lunch room and let people spread out a bit more. We're still doing it now and it's infuriating in terms of productivity because there is now an hour of the day where group A cant talk with group B. Then there is another subset that starts and finishes an hour earlier than others. Seems silly but only being able to utilise 6 of the 8 hrs of the work day to talk to the people I need to work with is terribly inefficient. We work around it but it's annoying.",
            "What a G",
            "Pity. This system worked out well for you!",
            "As frustrating and shitty as micromanagers are, this is actually a relatively good outcome. I mean it's Dave's job to make sure the place doesn't just operate efficiently but to actively find ways to make it more efficient. He tried something he thought could help, saw that it didn't and course corrected with relatively little drama or fanfare.\n\nMicromanagers suck for sure, but they usually come with an equal amount of vindictive zeal, which doesn't seem to be the case for Dave. So at least good on him for that. Haha.",
            "Good work OP, managers like this need to get laid",
            "Micromanagers suck!!!",
            "This is a stolen story I read it like a year ago",
            "Dave was sick of only micromanaging his penis.",
            "I'm Dave. \n\nWhat the fuck 😂😂",
            "Where I live (CO) employers are required to *provide* a lunch break after five hours of work. That doesn't mean they get to designate *when* or even *if* you decide to accept that lunch break. I haven't taken a lunch in seven years, which equates to thousands of dollars I would've lost.\n\nIt's not up to your employer. Any employer who is *forcing* you to take a lunch is simply violating the law. It's a classic business tactic that steals 2.5 hours of your wages every week imo\n\n*Edit: Nobody can prove me wrong?*",
            "[deleted]",
            "He seems shit.  Deny overtime and advise employee if they cannot manage their time better, they will need performance managed.  Simples",
            "Micro managing is the worst, but I wouldn't call your response malicious compliance if you were intentionally scheduling things that didn't need to be scheduled in order to benefit from the micro managing.",
            "II999⁹×3×3W×~3×433",
            "Bravo! Love it 😂",
            "Hell yea this is a big win for the small guys!",
            "Dave is insecure.",
            "You won, nicely done! 👍",
            "I have only had one new manager come in and make a place better"
        ]
    },
    {
        "post_id": "9gtz7k",
        "author": "xxmomochanxx",
        "title": "SIR THAT IS NOT ALCOHOL",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gtz7k/sir_that_is_not_alcohol/",
        "score": 13476,
        "num_comments": 290,
        "created_utc": 1537270112.0,
        "selftext": "xpost from r/TalesFromYourServer \n\n&#x200B;\n\nOn mobile etc etc you know the drill. TLDR at the end\n\nI work at a small Chinese restaurant that generally only has locals and regulars with the odd visit from out of the area. Because its so small on a normal day or night we will only have 1 waitress on a shift.\n\n&#x200B;\n\nWe were having a relatively quiet night so I was sitting around pouring soy sauce into bottles and cleaning chili jars. This table of 4 people walk in and they're all relatively nice and I give em the good old casual greeting and seat them down. They do their stuff and order their meal and for drinks they only get table water which is normal. When I bring out their food the old man (hence forth OM) asked for a bottle of the red wine. Now we don't serve alcohol nor do we even have a byo. I'm not yet 18 so I can't even handle alcohol if we did. I told him we don't have any alcohol, and he goes on this rage pointing out a bottle that was on our shelf. \n\n&#x200B;\n\nI knew what he was pointing to. It was our Chinese vinegar. Now these bottles look remarkably like Asian alcohol. They're green with red on it and all the writing is in Chinese. And I told him that, \"sir that's vinegar not wine\" He went on an alcoholic rage yelling about how I couldn't know what alcohol was cause I was underage and how I was hiding alcohol from him and he would make a complaint on our Facebook page. His children and wife look embarrassed and are trying to hide themselves, and his wife gives me a look that just says \"do it and he'll regret it\" \n\n&#x200B;\n\nSo I went and got a bottle of the vinegar and put it on the table. OM makes a really big deal out of it saying shit like \"AH wasn't that EASY\" \"waitresses in MY DAY would have done it in 2 seconds\" I walk away and when I turn around to check, he'd spat a mouthful of vinegar out and onto the plate and was trying to wash out the taste of CHINESE VINEGAR with water\n\nTo be fair the wife did come up to me later and apologise for his idiocy. They never made that Facebook post, and paid $20 for the bottle since we couldn't use it again. \n\n&#x200B;\n\nTLDR; Most likely alcoholic old man demands a bottle of Chinese Vinegar thinking it's red wine. Instantly regrets decision upon trying to chug vinegar. Shoutout to best wife for co-conspiracy. ",
        "permalink": "/r/MaliciousCompliance/comments/9gtz7k/sir_that_is_not_alcohol/",
        "comments": [
            "That's instant karma. Hope that guy gets some help. ",
            "I'm honestly surprised they were so nice about it afterwards. That guy seemed like the kind of person who would have flipped out on you after spitting the vinegar out!",
            "As Confucius once said: in vinegar veritas.",
            "Amazing. Good on you for keeping your composure. I don't know if I'd be able to. Hence why I cooked and didn't serve when I worked in food service.",
            "I work in Uganda importing foreign groceries. Our offloaders tend to be not very well educated and stuff tends to go missing/damaged during offloading.\n\nIn one consignment we had red wine vinegar, in the warehouse I noticed we were missing 3 bottles from one of the cartons. I can only imagine the labourers saw the words red wine and lifted 3 bottles to enjoy after they finished work. I only wish I was there when they tried to drink it.",
            "To game it further, tell customer it is a rare and unique vintage, only the most discriminating connoisseur can manage to down the entire bottle.",
            "Well, I'm sure it left a sour taste in his mouth too...",
            "How does one lift a glass/bottle of vinegar up to your mouth without realizing it doesn't smell like wine?",
            "I'll be she's counting the days until the last child is 18, out of the house for college... and she can finally file for that divorce.",
            "What does a  \"do it and he'll regret it\" look look like?",
            "It sounds like someone has played the \"secretly ask the waiter to say they don't serve alcohol\" trick on him before.",
            "Perfect malicious compliance. Love it OP",
            "Boomers love to remind us how everything was so much better when they were young. I’m just like yep, politics and business we’re still run by the greatest generation, power hadn’t shifted into yalls bloated, undisciplined, greedy, greasy, mitts. ",
            "[removed]",
            "Charging him for the bottle anyway is absolutely fantastic. I hope she reminds him of that wasted $20 every chance she gets. What an ass.",
            "While I like that it came back to bite him in the ass, I can't help but feel for his family. He sounds like an ass who is difficult to be around, let alone live with.",
            "Many years ago, a friend and I did a booze run to France from the UK. This was before the customs people clamped down so you could bring back as much booze as you could manage.\n\nIt was our first time so made newbie mistakes. Like going to a supermarket in Calais that took English money. On the ferry over, the boat was full of Sun readers taking advantage of their 'Go to France for £1' coupon offer. Sun readers are known for being on the dim side. Confirmed by their general behavior on the boat.\n\nThe supermarket had a special offer on a certain brand of beer. A very attractive price if you liked your beer but lacked any comprehension of the French language. Printed on every case was 'Sans Alcool'\n\nThe Sun readers went into a feeding frenzy. They bought as many cases as they could carry. Some had brought a 2 wheeled truck to carry even more.\n\nComing back into England, the customs people must have had great difficulty keeping a straight face as the Sun readers walked past them with case after case of zero alcohol beer.",
            "Vinegar is delicious tho.  I'll do a shot when I'm cooking with it.\n\nWhy are you looking at me like that?",
            "How did he expect you to serve alcohol if you're not even legal age to drink it?",
            "we do drink vinegar straight up for health though",
            "Reminds me of this couple that would come into where I worked every few weeks. Any time one of them went to the bathroom the other would jump up, run to the bar, order a glass of wine, then down it like it was a fucking shot. \n\nAll I could figure is they were both \"recovering\" alcoholics trying to hide it from each other.",
            "What a douche.",
            "I LOVE fermented vinegar, I would have gone there. ",
            "The guy went bottle to lips??",
            "\"Excuse me, I can **clearly** see that it says 'WINE' right on the label!\"\n\nI've heard of people doing shots of apple cider vinegar, but not rice wine vinegar.",
            "Sour puss indeed.",
            "r/talesfromyourserver",
            "Raging alcoholics. Gotta love em",
            "Is this whiskey or vinegar?",
            "hahaha got what a deserved, what a prick",
            "It’s a bonus if the front of his tongue swells up so he can’t talk for a while",
            "I want to think that it's cooking wine (like Shaoxing 绍兴酒 or Huadiao 花雕酒) which are like... salt-laced alcohol, then you could actually agree that it was wine. But it was vinegar...",
            "I feel bad for the family. They have to put up with him for life.",
            "I’d just like to point out that a real alcoholic wouldn’t have made that mistake. We know what the Asian wines look like, probably know some by name.\n\nMy bet is they’re a narcissist that can’t handle not getting whatever it is they’ve decided they can’t live without at that moment.",
            "hmm what y’all lying about on here today ",
            "Sir I think that you may have learned your lesson, always pay attention to the waiters",
            "He should have asked for \"cold tea.\"",
            "Damn I feel bad for that dude's wife and family. ",
            "I was gonna post that this should be cross posted, glad it was. ",
            "Bonus points for the conspiracy to commit malicious compliance with the guy's family. ",
            "/r/unexpectedmulaney",
            "I bet that left a bad taste in your mouth",
            "Whoa, he didn't even use a glass? ",
            "I would have just poured him a glass though",
            "Did they leave a tip?",
            "Surefire alcoholic.  For his family's sake I hope he gets help.",
            "Is Chinese vinegar red? Or why did he still taste it? ",
            "Why is Chinese vinegar 40 times as expensive as regular vinegar? $20? Come on.",
            "idk if they generally accept text posts, but /t/instantregret would love this story :p",
            "Who drinks wine with Chinese?",
            "Nice story but honestly what's the point of setting up an abbreviation if you are only going to use it once?.\n\nWriting \"(hence forth OM)\" took more effort than simply writing \"The Old Man\" one time would have.",
            "And THAT'S THE tea (Chinese vinegar) "
        ]
    },
    {
        "post_id": "119mkj1",
        "author": "Momsgotprobsbrah",
        "title": "Oh, I can quit? Not without the final say, I can’t!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/119mkj1/oh_i_can_quit_not_without_the_final_say_i_cant/",
        "score": 13475,
        "num_comments": 383,
        "created_utc": 1677121300.0,
        "selftext": "At my last job, my boss (let’s call her K) hated me. She turned everything into a competition; she mocked me publicly; she took credit for my work; she divulged my personal medical information in front of all our coworkers. She was cruel, and needless to say, I avoided her as much as I could. \n\nSo, now that the stage is set, here’s the context. End of 2020, corona virus blazing, I had just had my first baby. I was a nervous wreck my entire pregnancy, working from home and being extra careful. After maternity leave (which was disgustingly short btw), I had returned to the office with some precautions set in place. My boss became crueler to me over those first few weeks back, and suddenly announced that, regardless of any negative feelings toward it, she had decided we all had to attend this training in another state. Keep in mind that there were mandatory 2 week at-home quarantines in place for anyone coming back to my state, but my boss fully planned on ignoring those quarantines and demanding we all would return to the office as soon as we got back. \n\nI was carrying a heavy workload and pulling a lot of the weight around the office, and I had some rank. So, I felt fully comfortable expressing my deep concerns to K, telling her that it was peak covid season, and that I had a newborn to worry about now. I expressed I simply didn’t feel comfortable going in the middle of a global pandemic and asked if there was a remote training I could attend instead. She firmly, ADAMANTLY insisted there was no remote training, and informed me that I could quit if I was that upset with her decisions. It’s important to note that she insisted this for weeks, even claiming to have contacted the training organization to make sure. I decided on the spot after that meeting that I would be quitting. But I needed to check my boxes first, which took me a few weeks to figure out. \n\nSome time after this meeting and her incessant insistence that there was no remote training, it finally occurred to me to check with the organization putting on the training and ask them to clarify if there truly was a remote training or not. I did, and lo and behold, there WAS - and they had been offering it for months. I asked them to email this information to me. \n\nNow to figure out how to use this valuable information, right? Wrong. As soon as I stepped back into the office, K starts fake-empathizing with me out of nowhere, in front of all our coworkers. saying she really wished she didn’t need to force me to go to this training. So, I said, “if you feel so bad, let me go to the remote training.” She looked at me in surprise, and her face turned beet red. Before she could fight me, I pulled up the email with the information and read it aloud in front of all our coworkers. No one said anything, they just stared, wide-eyed at her while she blubbered like a fool. \n\nLong story short, after pulling that fast one on her, I pulled her into a private meeting a gave my notice. She was horrified because, as I stated prior, I carried a lot of the work around the office. \n\nBut, like she said, I could quit if I didn’t like her decisions 🤷🏻‍♀️\n\nETA: for privacy reasons, I can’t go into why I didn’t rat her out, or why she was intent on going out of state. But I DO believe I know the reasons why.",
        "permalink": "/r/MaliciousCompliance/comments/119mkj1/oh_i_can_quit_not_without_the_final_say_i_cant/",
        "comments": [
            "That image of you reading that email in front of *EVERYONE* \\-I'm dying of laughter here. \n\nKeep being awesome, and best wishes to you, little one, and the rest of your family.",
            "She was a lying liar that lies.",
            "This was cute and innocent compliance, but honestly, you would have bitten the snake, first, if you'd have reported her for violating the law and spouting your personal medical info publicly in your place of employment.",
            "Well done. I never understood the managers that felt the need to poke at their best employees. Especially the ones that obviously have options at other companies.",
            "I would have had the company send the email to a dozen coworkers' addresses and the CEO to throw a monkey wrench into things.",
            "What did she get out of forcing everyone to go?! I imagine it would’ve cost the company way more money, put lives in danger, put them at risk of litigation for not following quarantine protocol, risked a lot of sick leave from those who contracted Covid . . . \n\nI guess you really could be evil and just want to inconvenience the whole team but it seems like she’d lose much more than she gained. Yikes",
            "These days with good companies begging for good people you will no doubt, land on your feet. Good on you for leaving a toxic boss.",
            "[ Removed by Reddit ]",
            "[deleted]",
            "My last company was publicly \"compliant\" with all COVID restrictions, but all internal communication made everything seem entirely optional. I was working as a field installation tech when it hit.\n\nAny projects requiring travel over 100 miles usually required the company put us up in a hotel. Most of those projects were postponed, but others continued and we were required to drive to and back from the job sites daily (my major project at the time was about 3 hours one way). However, travel for personal reasons was limited to a very specific radius from their HQ. No overtime was allowed without direct supervisor approval, and most guys **lived** on the OT. Masking was \"required unless the customer says you don't need to while on premises\", which many were vocal about *why* they did not and would not require masks.\n\nIn January of 2022, they released a company-wide email mocking the executive requirement for weekly testing for unvaccinated employees, and vowed to \"protect our freedom\". They celebrated when SCOTUS ruled it an overreach of power. I'm so glad I left that place.\n\nEdit: I didn't expect this much response, so thank you. But, if you're downvoting, why?\n\nEdit 2: spelling.",
            "Very nicely done, bosses like her try the \"you can always quit\" like that's actually some sort of threat. Gosh yes, that would be awesome Miss K.\n\nHope you got a fresh job with a slightly less \"K\" for a boss !",
            "SHE wanted to go on the trip so she made it so everyone had to go to cover it up. I bet the training was secondary to something she wants to do NEAR the training area in that state",
            "Who tf was this manager? That’s thousands of dollars in travel costs. No shit they were bad at their job.",
            "I would have also reported her for breaking HIPAA when she passed around your medical information",
            "Yeah, quitting isn't enough here. I'd report that shitbird to every agency that would listen.",
            "Most people that are against remote work and remote training are middle managers that are afraid that they have to give up micromanaging.",
            "I'm sorry you had to go through that. I will never understand why some women feel so threatened by other women in the workplace that they feel the need to make their lives miserable. It's hard enough to be a woman in certain fields, but lifting each other up goes so much further than hostile behavior. Glad you're out of it!",
            "Damn, if only you stuck your guns and refused to go. If she fired you over it you would have a great wrongful termination lawsuit due to the nature of the pandemic and could have sat and collected stimulus checks for over a year without working while you sorted out the legal.",
            "You could have also threatened to report her to the labor board for failure to provide reasonable accommodations due to be a mother to a new born during the pandemic.",
            "“Unless them bitches is paying your bill, pay them bitches no mind” - RuPaul\n\n“When them bitches is paying your bills, go get yourself some new bill paying bitches” - me.",
            "Could have went, reported the leaving state, make the company pay you for 2 weeks then quit after coming back(honestly thought that was what was going to happen.",
            "Ok guys. If I do share some more, they’re not “malicious compliance.” Is there a workplace bully story telling subreddit or something? I need suggestions! I’m relatively new to Reddit. Feeling like a boomer lol",
            "Finishing with style... \n\nthe kind where boss being served a giant pile of shit in a silver platter.",
            "I wouldn’t have quit without providing that information to her superiors!",
            "I think the best part was publicly showing that remote options were available, so everyone else in the office could now use that information to demand remote training even after you left. The gift that kept giving.",
            "I'm wondering if she has some sort of lying complex, because it seems she wasn't ready for someone to call her on her shit at all. I hope your work life is doing way better, and that your child is healthy and happy.",
            "I had to re read the first paragraph because you said “she took credit for my work.” I read that as she took my credit card and I was like no fucking way. \n\nRegardless. What an awful boss and I’m sorry that she was just evil to you. I hope that you had major satisfaction by giving your notice.",
            "Glad you’re out of that and I would have been very surprised if the training company was even allowed to have in person training at that time.  I hope everyone took the remote option and then promptly quit.",
            "She fucked around and found out. LMFAO",
            "Secrets secrets are no fun, secrets secrets hurt someone .... Karen",
            "She gave your personal medical info out publicity, she lied about remote learning, and violated covid rules - she should a textbook case of a HR complaint.  At your exit interview, why didn't you lay this out for HR?",
            "never forget: quitting is doing the company a favor. make them fire you. especially when you have a manager like that.",
            "In poem form\n\nA ray of light illuminates the room\n\nAs I step forward, enveloped in gloom\n\nMy boss, the cruel one, stares me down\n\nShe wears a smirk, I wear a frown\n\n\nShe mocks me, she belittles me\n\nMy personal info, she sets free\n\nI try to avoid her as much as I can\n\nBut she's always there, with a cruel plan\n\n\nThe pandemic rages on, a deadly wave\n\nBut my boss cares not, she's so depraved\n\nShe demands that we attend a training\n\nIgnoring the risk, she keeps insisting\n\nI express my concerns, but she won't listen\n\nShe tells me to quit if I have objections\n\nBut I need to check my boxes, I need to be sure\n\nI need to find a way, to even the score\n\n\nA stroke of luck, a remote training, I find\n\nMy boss has lied, she's played with my mind\n\nI reveal the truth, in front of them all\n\nMy boss's face turns red, she takes the fall\n\n\nI pull her aside, I give my notice\n\nShe's left horrified, now she's in focus\n\nI leave the office, feeling relieved\n\nFrom her cruelty, I am finally freed",
            "Great post of MC. Look forward to more stories in the future. :)",
            "Hilarious. I'd bet her attitude problem was becoming very obvious so her little show of \"empathy\" was to try to reset her political standing.",
            "Did you also contact your state about the entire company breaking quarantine?",
            "I'm just curious about why you never recorded, documented or filed a complaint against her. You had plenty of opportunities and reasons. Especially the medical stuff. She violated your privacy so hard, I'd be marching down to HR and filing a grievance right then. She created a hostile work environment for you. Discriminated against you, and overall made your work life hell. She could've been fired while you got to stay.",
            "I thought ETA stood for “Estimated Time of Arrival”…what are you using it as?",
            "\"She divulged my personal medical information in front of my coworkers \"\n\nPretty sure that's a HIPPA violation and against the law. I'd talk with a lawyer to be sure, but if you really want to shut her down...",
            "Mom's got one less prob .. *brah* ..",
            "I had a manager that once lied to other people about me. Would just make up stuff out of the blue to turn people against me. She had a thing out for men. Didn't like them. I saw new young guys that would come in and she would give them hell, never cut them any slack, yet would bend over backwards for the women. She used her lies when her direct attitude toward the men wasn't enough. Absolutely horrible boss.",
            "why even give notice",
            "Sounds like she broke some state mandates at the time and possibly HIPPA, maybe consult with an attorney on this bitch and her superiors. It’s not like you don’t have witnesses… 🤷🏾‍♀️",
            "She FA&FO\n\nGood for you! Glad you were able to leave them behind.",
            "I love how you showed everyone just how petty and mean that jerk was! \n\nYour write up was an enjoyable read!",
            "Sounds like my boss from 5 years ago. Needless to say, her name was Karyn; an absolute crazy person.",
            "Are you in the States? You can easily sue for her sharing your medical information.",
            "I can't imagine any reason why she felt compelled to mandate that y'all go on that trip short of just being a power hungry sadist.",
            "Well done, OP. Sounds like a miserable situation and I'm glad you got out of it (with style points).",
            "You probably could have sued her as well, claiming that this was the company's way of forcing you out and retaliating for you getting pregnant.",
            "There's some behavior in there on her part that is most likely illegal. It's too bad you don't have the desire (or probably the time, with having to wrangle your now toddler) to fuck around with taking your previous employer to court.",
            "From the sound of it, she was likely on a Narcissistic Psychopathy spectrum.",
            "I was really hoping that this was going to turn into you all going to the training, then nobody coming into the office for two weeks after. Presumably an office that had no provisions in place for working from home.",
            "What an absolute starts-with-b, rhymes-with-witch.  Disliking one of your employees is one thing, but SHE actively undermined you, AND put your health and your baby's health at risk.\n\nShe should not only have been fired on the spot, she should have been arrested.",
            "If that company had anything to do with the medical field, then her divulging your medical info is a punishable offense, as it is a direct HIPAA violation. All you have to do is report it to your state board of health(if in the US). I believe the statue of limitations on that sort of thing counts in the years category...",
            "From the ETA:\n\n>She had a personal reason to be in the city that training was in. She was hoping to get her way paid by the company to go.  \n>  \n>She knew it would inconvenience and scare me. And that she could dangle her “power” over me.\n\nWhat the actual hell. Isn't that a perfect clusterfuck.\n\nI'm not liking that upper management doesn't seem to be aware of what a brat she is -or is willing to allow it.",
            "If I knew I was going to be quitting the next time she said anything about my medical status I probably would have said something like;  \"Look K I didn't tell anyone about your abortion or you STDs so you really shouldn't be talking about my stubbed toe, or whatever it was.  \nSure it's probably not true but let her try to convince everyone in the office.",
            "Fk that cvnt. Walk.",
            "Perfect :)",
            "Thx, K, Bye ❤️",
            "K sounds like a bitch",
            "Dear Boss/board of labor etc Re K endangering the staff's health and intending to break the law.",
            "Should have followed up that public speaking about the email with the quitting notice. Fuck that, publicly shame her with it instead of doing it privately.\n\nWonderful tho",
            "Well played, fucked around and found out.",
            "Family first, good for you",
            "Sounds like my old boss",
            "Sheez, did you work for Agolf Twitler?",
            "Sounds like my old boss, Stephanie Hatton. Such a cruel person, she enjoyed torturing people, not just me. I’m still healing, but I believe in karma.",
            "There's always a bigger fish in the sea and a bitch too, well done OP!",
            "When u say blubbering do you mean she was crying?",
            "Should’ve gotten fired instead though for the unemployment",
            "She has liabetes!",
            "I'm guessing \"K\" wanted to see someone during her \"private\" time?",
            "Never quit. Always get fired. Then they still have to pay you.",
            "Don't give notice unless you have a new job. Let them fire you every time. \n\nQuiet quit. Don't believe the propaganda in the news, many managers are deserving of quiet quitters.",
            "Great and all, but where is the compliance?",
            "r/antiwork would love this. I know I do. Good job on this one!",
            "What a Kunt",
            "Sorry you dealt with it",
            "Weak",
            "You should have quiet in front of everyone and told her why you were quitting and just walk out. Take sick leave or PTO if available.",
            "Why does every title on this subreddit have to be this sassy. passive agressive soy ass question?   \n\n\n\"Oh, nyah nyah nyah?! Well how about nyah nyah!\"   \nIt's just tiresome.",
            "Why didn't she want anyone to go to the remote training in the first place?",
            "I don't know why rule 8. is so hard for everyone: \n\n> 8. No Acronyms As Names.\n> Don't make up acronyms for your post.\n\nIn this case it was just one, luckily...",
            "Bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbrlvbvblh  klûyyypyym. B.  Popping",
            "This smells on both sides",
            "TLDR",
            "So... she won.  Great story.",
            "That sounds like the pettiest of petty revenge. Yawn.",
            "UpdateMe!",
            "nice",
            "OP could it be your boss was jealous? Maybe envying your fulfilling home life? My only boss who deliberately made me miserable was a woman who felt jealous of me (I was F29). \n\nShe was at the height of her career with no further success possible without gaining a certain certification that would require years of study; I was younger, at entry level, but holding the desired certification. The day that she commented that I'm \"skinnier\" than her, I knew my job was over. I was appalled. For one thing, it meant her jealousy had gotten worse. It also meant that she was delusional, as in body dysmorphic, as I was a somewhat muscular American of size 9 or so whereas she was an extra thin Philippine lady of maybe a size 2. Her bullying up to that point was bad enough but it was about to go into crazy zone. I did quit not long after that but mostly for other reasons."
        ]
    },
    {
        "post_id": "faw0h9",
        "author": "None",
        "title": "Teacher tells my little sister she can't have her lip balm, sister gives her a shriek inducing smile.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/faw0h9/teacher_tells_my_little_sister_she_cant_have_her/",
        "score": 13468,
        "num_comments": 862,
        "created_utc": 1582902335.0,
        "selftext": "This is my sister's story, but it's too good to not share. This was back when she was in second grade, and this girl was the perfect child. I wish I was kidding, but no. You know that ONE kid with the halo and the sweet smile, the manners to make a parent proud, and cutesy little voice? Yep, that's her. But, she DOES have a mean streak when you push her. You would think that ALL the teachers loved her, right? Nope, not her second grade teacher. This woman was hellfire personified, and she for some reason hated my little sister. More often that not, my little sister came out of that classroom trying to hold back tears. Two more very important things about my sister - she has always had lips that would get so chapped they would bleed, and she always carries around Carmex with her.\n\nSo, one day, she's sitting in class with Hell's favorite teacher when she pulls out her little tub of Carmex and the teacher immediately starts screeching at her to see her after class. End of class, and the teacher tells her that she MUST keep the Carmex with the school's office because it says \"medicated\", and back in the day you had to be literally dying just for the office to give you your things (no joke, I'm asthmatic and it took almost dying on the office floor for them to hand my inhaler over but that's another story). My sister tries to explain that without the Carmex her lips will bleed, but the woman does not care. Well, Hell hath no fury little a sweet baby scorned.\n\nVery next morning, she doesn't use any in the morning, doesn't use any for the ride to school, doesn't use it before sister hands the little tub of Carmex over to the office lady (who looks at her very confused but just does not give a shit) and she heads off to class. She does her best to keep calm when she starts to feel her lips get chapped, keeping her lips as drawn in and neutral as she can. She spends most of the day with her head down and not speaking, until finally the teacher calls on her to answer a math question. Now, I should probably warn everyone this might get a little graphic. Sister lifts her head up, looks this woman right in the eyes and smiles as wide as she can. Tears are rolling down her cheeks as she can feel her lips splitting open so badly that they're not just bleeding a little. It's rolling down her chin, mixing with her tears, down her neck and onto the collar of her shirt. This woman screamed so loudly that us third graders across the hall could hear it. She ended up ripping her lips so badly they had to page little third grade me to call my mom to pick her up, and she had to stay home for a couple of days to recover.\n\nWhen she came back, however, not only did the teacher personally hand her Carmex over, she had bought her a few more little tubs of the stuff for \"just in case she ever ran out\" and never bothered her again. I don't know if it was coincidence that year was the last year she taught, but a little part of me likes to think that she met her match in my little sister.\n\n&#x200B;\n\nEDIT: I really, REALLY didn't think I was going to have to add any of this, but here I am.\n\nMy sister has tried every lip balm under the sun, has seen a doctor, ect ect ect. All other lip balms either never work or she has an allergic reaction to them. All medications, all products react to people differently. What works for you does not always work for someone else. I'm finding some of these comments rude and snide, and it's really all unnecessary. There's trying to be helpful, and then there's trying to be right. Please stop.\n\nThe school itself didn't care that she had Carmax. Perhaps I should have elaborated on \" hands the little tub of Carmex over to the office lady (who looks at her very confused but just does not give a shit) \". The school NEVER needed to hold onto the lip balm, this was purely the teacher - the HELL teacher that I keep referring to in a NEGATIVE and NASTY light to emphasis what kind of woman she was - on a power trip with my little sister.  The next person I see remotely begin to defend the teacher, you're an asshole.\n\nEDIT 2: Against my sister's request, I removed the small hair color jokes . I'm tired of getting death threats - actual death threats! - in my direct messages and right fighters in my comments. ",
        "permalink": "/r/MaliciousCompliance/comments/faw0h9/teacher_tells_my_little_sister_she_cant_have_her/",
        "comments": [
            "In the late 90’s I was a junior in HS and my family moved from one state to another. In the process of doing so, a lot of household things had to be moved out of storage. The amount of dust that had accumulated was enough to cause me to have multiple sneezing fits. To the point where, by the time we got everything unpacked in new state, I had blown a blood vessel in each nostril of my nose. After copious nosebleeds, I go to the doctor and get them fixed by chemical cauterization.\n\nA friend told me that she overheard our English teacher telling other students that I had to be making up the whole thing, or was grossly exaggerating the truth, when I had to miss a class one or two times.\n\nWell, a day or two after the cauterization, I was in class (NOT English) and started sneezing and the dam broke. I head up to the main office to call home so I can go back to the doctor. I’m sitting there trying to staunch the bleeding while I wait, and guess who walks right past me? My English teacher was waltzing through and literally did a double take when she saw me... probably because in a desperate move to prevent recreating the elevator scene from *The Shining*, I had used my own shirt until an alternative was acquired. I looked like a deranged murderer. Part of me really wanted to say, “You should see the other guy,” but instead opted for the dejected waif look, to really nail home the shame. It must have worked, because she actually apologized and never brought it up again.",
            "I think the keeping the inhalers at the nurses office is one of the stupidest ideas ever. So you make a child who is *having difficulty breathing* walk to the office so they can start breathing. Kids die of asthma at schools who do this.",
            "Some teachers are just so jaded, they really should have some kind of testing to see about relocating some away from kids. \n\nI too was one of those innocent kids who followed all the rules, and never got in trouble. Around the 4th grade, I suddenly started having spurts of low blood sugar, that actually had me passing out if I didn’t get some oj or something in me quickly. Since the 4th grade teacher witnessed me drop, and the 5th grade watched as my poor old grandpa had to fireman carry me from the room to see a doc, I didn’t have many issues. I would tell them I was lightheaded, and they would have me sit in the corner with graham crackers and oj till I could take my seat. \n\nBut one day, we had a sub. We also had some lame pop quiz, and wouldn’t you know it 3 questions in I feel the darkness pulling at me from the corners. \n\nI got up quietly, and whispered to the sub about what was happening. She straight up wasn’t having it. She has subbed a few times before, so I knew her to be bitchy, but again, I was a kid who never lied or got in trouble, so it didn’t occur to me she wouldn’t believe me. She reamed me about trying to get out of the test, which I assure you was more distracting than me whispering about feeling dizzy, and sent me back to do my work. \n\nSo add in desperately thing to hold back tears, while fighting off the darkness, and you can guess what happened. I was leaning my face on both arms, trying to at least look like I was working, when the darkness took me. My arms slipped, and my face slammed hard into my desk. Worst bloody nose I’ve ever had. I was out cold during the first part of the gushing, so it basically just went where it wanted. Other kids desks, and if I remember right, some kids were hit with the spray. I woke up to the sub desperately screaming for help, and cramming tissues or something to my face. \n\nIn the end, I missed the quiz (drenched in blood as it was lol) and was sent home early. The sub followed me to the office crying and apologizing. My grandpa came to get me again, which as sweet and close to senile as he was, likely saved the school a huge issue, though it was the 90s. \n\nAnyways, I saw the sub a few more times that year. From that day on, she didn’t show up without purchasing me oj and those white powdered donuts “just in case” lol. \n\nOh, and because I tainted some of the other tests, (or you know, the trauma) the whole class got out of taking the quiz too. Totally backfired on the sub.  😂😂",
            "As a teacher, I think I would have LOVED teaching your sister. I love kids who have a bit of the devil in them - they tend to be very smart and funny.",
            "I get really chapped lips during winter. One year, I was really into using those EOs lip balms. You know how people tell you that lip balms were designed to make your lips more chapped? Come winter, I started believing that. My lips were so dry, the corner of my mouth split. For weeks, no matter how much lip balm I'd apply, I would keep ripping it open when I'd eat, no matter how careful I was. It was miserable.\n\nThen I realized there were medicated lip balms. I bought a blistex one. By the end of the week, the corner of my mouth was healing. Now I swear by medicated lip balms and refuse to use others.\n\nGlad your sister is okay and didn't cause some permanent damage. That's some dedication! Ouch... \n\nAlso, screw the whole 'medication must stay with the office' bs. My nephew had an asthma attack at an after school activity and he didn't have his extra inhaler because the school confiscated it despite his parents saying he was old enough to carry it with himself. He was okay, but scared having to take an ambulance. My brother threatened to sue to school district. SUDDENLY he was allowed to carry his inhaler with him.",
            "In the early 2000's, kids' high school did not allow students to keep ibuprofin, acetominophin or aspirin on them. They had to go to the nurse's office to get them - and the office had to have a parent-signed permission form to take them. (Part of the war on drugs.)\n\nOne day one of my kids (still a minor) came home and informed me that he had donated blood that day when the Red Cross had set up in the high school.\n\nWhat???? They can stick a minor with a needle to draw blood, but can't give someone a bit of acetominaphin? Sometimes laws make no sense.",
            "I completely know that feeling. I don't always have chapped lips, but when I do they go from fine to cracked and bleeding in no time at all. I left the house one day to drive to see a friend about 40 minutes away, through the middle of no where. Half way through the drive I can tell that if I smile or talk my lips will crack. I stopped at a random gas station (the only place as far as the eye could see) and bought whatever lip balm they had. I didn't care that it was over $5 for a little tube of whatever. It was a necessity. \n\nNow I keep them all over (but mainly in bags I use when I travel, because planes seem to trigger it) so I'm not caught without.",
            "as someone who EASILY gets chapped lips in winter, and has known the pain of having a lip split RIGHT DOWN THE MIDDLE(shich makes smiling TORTURE), i really empathise with your sister.",
            "My first-grade teacher was an evil hag with a better-than-thou complex. She had a hate-on for me from day one because I corrected her when she would say my name wrong. I have two last names, and she would *only* call me by them rather than by my first name like the rest of my classmates. However, if my last names were \"A-B,\" she would call me \"B-A,\" so I corrected her.\n\nNow, my first-grade teacher and I both loved art, so my six-year-old self thought that maybe, with my passion, I could win her over. I was sorely mistaken. Whenever she would make us do paintings, she always had me do a self-portrait, even if all the other kids had to paint trees, or a house, or a vase of flowers. She would circle the room, making comments on how to improve their work, which paints to mix to get the desired result. But then she would get to me. \n\nShe would take my paper and loudly remark at how horrible and ugly my painting was, and encourage my classmates to say what they hated about me- \"Ah- no. Her *painting*.\" But my classmates knew what she meant. She'd go around the room and have every classmate say something like, \"She's too ugly. She looks stupid. She's too fat. She sucks. She's no good,\" and other such things. \n\nWith every comment, she'd have my classmates rip a piece of the painting off and by the end, I would be left with nothing, and I would have to start over. \n\nThat wasn't the only thing wrong with my shit school, but I have a deep hatred for that woman. Fuck you, Mme. Nadeau. Also, jokes on you, hag; now I'm a better artist than you ever were.\n\nMoral of the story? Some teachers absolutely suck ass and should NOT be allowed to handle children.",
            "I still remember the new mean middle school teacher who said \" you can wait for a band-aide until after the test\".  I remember her telling me the next day when she handed it back she was docking me for writing half the test in red ink and me just smiling and saying but I don't even own a red pen then tossing the test. \n\nFun fact that teacher also bought my childhood home a few years ago and all the neighbors refuse to talk to her, we had weekly block parties, because she is just that shit of a person.",
            "Poor little sis! Does she still suffer with the terribly chapped lips?",
            "Aw hahaha poor kid mastered the art of mutually assured destruction early in life",
            "I absolutely love your witch of a little sister.",
            "Your little sister had balls of steel. I love her.",
            "I was so much like your little sister when I was young - the “perfect” child, the model student, seemed to charm most adults and am a ginger too. That streak of fire runs deep and can be used diabolically when pushed. I love your sister’s spirit and “evil genius” and hope neither have faded with time! Oh, and my lips chap so freaking easy too and there are only a few specific brands of lip balm I can use, so I totally get that fight too!",
            "Fucking second grade teachers. Mine was HORRENDOUS. I swear they are all meant to make children miserable.",
            ">My sister has tried every lip balm under the sun, has seen a doctor, ect ect ect. All other lip balms either never work or she has an allergic reaction to them. All medications, all products react to people differently. What works for you does not always work for someone else\n\nThe only hope I can give you is that I used to have a very similarly painful chapped lips problem as a young child, but sometime around when I was 9 or 10 it just sorta stopped happening as much, and by the time I was in middle school i was pretty much down to a normal persons occasional usage of chapstick. Hope your sister grows out of it too, I remember it being hell...",
            "Schools can be horrible for things like this. Years ago a friend of mine, whose son needed to be given medicine at school for epilepsy, took the medicine in and gave the instructions to the school nurse. When it was time to bring in a new bottle of medicine, the nurse was confused, looked in her cabinet, and found the first bottle my friend had given her. It was unopened. She laughed dismissively and said \"Oh, I must have forgotten.\" She just plain forgot a child's epilepsy medicine and blew it off. This was a very good school district, but that didn't matter here. Or maybe she felt like a big shot so maybe it did matter. In any case, my friend went off on the nurse, went off on the office, and told the whole story to her son's doctor, who contacted the school with a complaint of his own. Nothing happened to Miss Whitney (some parents used to call her Miss Witless). Some people said Miss Witless was having an affair with the Vice Principal and would go unpunished because of it. I don't know. But I do know that I heard another mother tell about how she went into the school for something and saw a little girl throwing up horribly in the hallway beside the school nurse's office, in full view of Miss Witless, while Miss Witless sat in her office laughing with a friend while she saw but ignored the little girl. If anybody doesn't believe OP about how these things happen, the examples are countless. If you have a child in school, find out what you can about what really goes on there, just in case. Obviously not every school nurse is witless. But it's always a good idea to check your own school out.\n\n  \nEdit: I know that OP was talking about a teacher, not a nurse. But if even a trained nurse can screw these things up, a teacher can too.",
            "[removed]",
            "I always feel solidarity with other redheads and ginger me cackled at the fury comment. Carmex is also the only thing that works for me too! I have tried everything. Maybe that is a ginger thing as well?",
            "Bloody hell.",
            "I've had two teachers like that. Good grief...and good on your sister",
            "> not only did the teacher personally hand her Carmax over, she had bought her a few more little tubs of the stuff for “just in case she ever ran out”\n\nThis is the best possible ending to these stories: people who are so mortified by their own crappy behavior that they chuck pride right out the window and make amends. Good on her.",
            "2nd grade teachers ARE evil walking the earth. (Hi, Mrs Lee!) But ginger girls are equal to them and then some!",
            "I have the same exact problem with my over sensitive lips. Carmex always fixes the problem. I'm able to go the whole day or sometimes 2 with little to no chapping.",
            "I know there’s already 300+ posts so there’s a chance you won’t see this... but I am the exact same as your sister. \n\nMy lips have always been so dry they will crack and bleed without using something. \n\nI tried EVERYTHING. Nivia was okay for a while. Then I found Carmex. I used that a long time. \n\nNow I’m on to an actual tub of Vaseline. Not the chapstick branded stuff. The actual tub. It’s the only thing that works anymore. I have a carmex in my wallet for when I’m out, a Vaseline next to my bed at home and one in my desk at work. \n\nI have no clue WHY I’m like this. I’m jealous of the people who never use it or use it like once a day.",
            "The day I heard that my sons teacher quit I shouted \"\\_\\_\\_\\_\\_\" broke Mrs. \\_\\_\\_\\_\\_\\_\\_\\_!\"   We still laugh about it !   Your sister sounds like a great person and you too !  I hope she smiles her beautiful smile for all the world to see pain free !",
            "Teacher: \"I showed this to my man here. You liked it, didn't you?\"\n\n*OP's Sister smiles showing a bloody ruin of a mouth.*\n\nOP's Sister inner monologue: You can swallow a pint of blood before you get sick.",
            "Calm down people. Some of us have dry lips and it doesn't matter how much water or what is applied. Everyones skin is different and we don't all live in the same climate",
            "Your sister is a badass",
            "I applaud your sister's dedication to proving her point!",
            "As someone who has severe dry skin issues and is allergic to mineral oil/petroleum (thank god for Burt’s bees) I feel your sister’s pain. Good for her.",
            "Wtf is wrong with (American) schools and teachers... for starters, I get why the youngest ones who can’t correctly take and control their own medicine have them in the nurse’s office, but why can’t the older ones keep it with them? With stuff like asthma inhalers and epi-pens, isn’t it an actual safety hazard that the stuff isn’t with the student but instead in some office far at the other side of the building?\n\nI live in Finland and as a teenager I used to have really bad period pains that I regularly treated with ibuprofen (Advil in the US). The other option was to go home, miss school and cry in pain for a couple of days per month. So, I carried these regular otc painkillers in my purse or backpack everywhere I went. Then I went on a high school exchange in the US, and everyone was freaking out about a 16-year-old being able to correctly recognize her own monthly symptoms and medicate them safely in a way that didn’t interrupt her education. I had to turn the ibuprofen in to the school nurse, and my host mon had to come in and specifically fill a form to allow the nurse to give them to me when I independently say I need one, without calling her first.\n\nComparison: next year back in my Finnish high school the school nurse got me started with my contraceptive pills (I was 17 so still underage) and wasn’t legally even allowed to call my parents because my health, specifically my reproductive health, is my private matter and children have rights, including privacy, here. That same year, I had a geography teacher who got a really bad headache one day. He looked in his own bag, realized he had run out of ibuprofen, and then just asked the class if anyone has any. Half the class raised their hand and someone gave him one, and teaching resumed regularly because he didn’t have to leave the class to find the nurse’s office, wait if there was a line, and possibly have the headache get so bad he’d have to go home.",
            "OMG I am laughing so hard rn",
            "Why wouldn't the school have your parents' numbers?  You had to call them?",
            "It's possible that the school asked for her resignation over the incident (a way for everyone to save face rather than termination). Either way, awesomely evil piece of revenge for your sister!",
            "Some teachers just plain should *not be* teachers. TY for the nice story.",
            ">\"But, she's a ginger so she DOES have a mean streak when you push her. \n\nWhat is the connection between these two things?",
            "i have a similar story about my teacher in third grade!\n\nso back when I was 8, my vision started deteriorating. fast. in a few months, i could barely see faces or even the teacher from where i sat, so I had to constantly keep changing seats to the ones that had no one so I could see what was written on the black board.\n\nmy teacher DID NOT like that. she told me to stop changing seats, which I said I couldn’t see from where I sat. she didn’t give a fuck and said I couldn’t anyway, but I didn’t obey her because I still wanted to see what was written.\n\nshe then flipped out at me, saying that I was an attention seeker and that I just wanted to find an excuse to talk with my friends. I cried while telling that to my mom, that immediately jumped on the conclusion that I had myopia. which I do, and a very bad one to the point I can’t take my glasses off or else I won’t be able to see anything in front of me.\n\nso next week I showed up with glasses at her class and the teacher looked stunned. she had to move me to the front row so I could see better, since even with my glasses, my vision was still deteriorating.\n\nnext year, I never saw her again.",
            "Why the fuck are you getting death threats? Report that shit to admins.",
            "God, this reminds me of the time my school searched everyone’s backpacks for a week and took my Tylenol right from the bag. Just straight up yoinked my last seven capsules. God, what I wouldn’t give to be able to just, blood smile at people trying to take my shit",
            "Your sister has major balls lol. That's rough though. I have a similar issue with my hands during winter time. Only thing that works for them is Nivea Hand Creme.",
            "I too have dealt with lips that chap this severely and bleed when they crack. I am also ginger and was a sweet little angel child with a \"Devastatingly evil mischief streak\" (quoting my dad on that).  Maybe it's just genetic. LOL\n\n&#x200B;\n\nLuckily I got my lip care routine down pat by the time I was 6. I know what works and what doesn't and have happily avoided bleeding lips except in severely cold and dry weather for decades now.",
            "As someone who also have extremely chapped lips that cracks and bleeds, I fully sympathize with your sister. Hope she never have had to prove her point like that ever again.",
            "Napoleon Dynamite had the same problem. His lips hurt real bad!",
            "The middle school I went to changed their medication policy from must be in the office to carry emergency meds with you at all times after a girl died from an asthma attack because the office lady was letting other students use her inhaler. Big difference between that and my elementary school that only issued prescribed meds if the nurse thought you needed it. If she couldn't hear you wheezing from two feet away, you were faking and would withhold your meds.",
            "(Obligatory This Took Part in the South) \n\nI was always a really well behaved child, but I had this fifth grade math teacher that just treated me like shit. \n\nA few years later I was on a field trip to a smaller local amusement park. All middle school students had the same field trips on the same days, with their home room teachers supervising each group. \n\nThat teacher, still working at the same school, was watching a group of students stand in line for bumper cars; she was standing out of earshot from anyone, so I went to say hello. We talked a bit, and when the conversation was trailing off, said rather off handledly “Y’know, Mrs.BLANK, I always felt like you never really liked me. Did I do something?”\n\nShe looked me in my eyes and I’ll never forget how little emotion was there, she really thought what she was saying wasn’t wrong. “Well, NAME. Sometimes kids just walk past you for the first time and you have this instant reaction. I don’t know why, but I just want to snatch some kids bald-headed. You were one of those.’ \n\nI stared at her and walked away with a fat ‘maybe don’t be a fucking teacher then’ on my tongue. Glad I didn’t say it though, the school would have crucified me no matter what was said.",
            "As the redhead who has been *that child* who married a redhead that has been *that ginger boy* who went on to have *that little ginger girl* I salute you. I salute you all. \n\nPowers of the Redheads rise, Course unseen across the skies,\nAlways heed the warnings clear, We're *better* at revenge, my dear.",
            "I'm sorry your sis had to deal with that, but at least the teacher learned her lesson.\n\nI don't know if she still has problems with her chapped lips, but it's something I've *always* had a problem with, especially after I got a job where I have to talk to people almost constantly. For the longest time, my lips where so scarred and painful, and I had tried *so many things* to fix it.\n\nThe only one I've found is burt's ultra conditioning -- the one with a silver cap. It's a little pricier than the regular, but it doesn't have mint or anything (very little flavor at all, in fact), but it completely fixed my chapping problem, and once I'd been using it a while, even noticed the scars fading. I swear by the stuff.",
            "I’m only having kids if they can be like your sister.\n\nAlso your edit made me eyeroll at the geniuses who attempt to “educate” you on chapped lips. Some people are just suuuuuuper helpful",
            "Poor baby. I can't imagine doing that to a kid...",
            "The color of hair makes as much impression on the temperament as the color of skin. My daughter is a redhead and kind and gentle. Sorry to be a grouch but she got this shot all her childhood. \"oh, I bet she's got a temper!\", \"I bet she's a real firecracker\" etc. It was really gross.",
            "Fuck them, the pain of your sister is much more important than hells teacher\n\n\nHope you never see hell’s favorite teacher ever",
            "Your sister was an evil genius at a young age! I recently rediscovered carmex myself, when I realized all my lip balms were making my lips worse. Being allergic to nuts and seeds is hell when trying to find moisturizers! (Including coconut, almond, Shea, macadamia, all the normal oils and butters used in lip balms.) So I understand your sister's issues.",
            "I have a similar problem with my lips, but it's not as bad as your sister's since Vaseline sort of works for me and the chocolate lip balm from lush also mostly works for me as long as I don't use it too often. \n\nEverything else leads to my lips feeling like itchy, burning scars. They feel that way to the touch, too. Yet using nothing leads to peeling, sometimes bleeding lips. It's not dehydration either.\n\nProps to your sister for handling ignorant mean teacher like a boss given the circumstances.",
            "I had not just lips that got super chapped but the skin between my lips and chin would too if I didn’t drink enough. Once in band (I was color guard so extra active) the coach would f let us get water until the entire 100+ people band got the first part of the show PERFECT. Around time 5 I was getting thirsty and asked to get a drink please. Obviously they said no. So after 3 more run throughs I felt my lips were really dry and knew what I needed to do. 2 more run through later they finally let us get water. I walked up to my coach and put my hands on my face and stretched the skin on my chin/lip. A little red crack ran all the way from my lip to my chin and the coach screamed while I just walked away to my well deserved water. Didn’t change anything but I remembered it while reading this story",
            "Oh lord, she sounds just like my 3rd grade teacher, but in her case she HATED all the girls and considered them nothing but trouble. To her, the boys in class could do no wrong.\n\nI won't go into details (too long), but I have a feeling what happened between her and me, and my mom's reaction to it all is why she abruptly decided to retire at the end of the school year.",
            "This is really hilarious but damn, cracked lips hurt so fucking much I must applaud your sis' bravery for willingly putting herself through that",
            "Wonderful power move by your Sister",
            "Half of me, “Oh no, that poor kid. What a terrible thing for her to go through, it must have hurt so much.” \n\nHalf of me, “What a fabulous and twisted brain.”\n\nI hope that the splitting and dryness has got better as she’s become older. I have a cousin with a similar issue but not as bad as your sister has it. My cousin has it worst in the hottest and coldest parts of the year, she’s also allergic to lots of the lip balms (soaps, shampoo, conditioner, detergents etc).",
            "I remember being so intimidated by my Grade 5 French teacher. He liked to be The Big Guy On Campus. When one of the boys would act out, he would stand right in front of him, arms crossed, puffing himself up.\n\nOne time my nose started bleeding and I was too scared to speak up so I raised my hand and eventually he saw the blood pouring out. Then he grabbed me and literally pulled me into the nearest washroom to clean me up. Which also scared me. I had very little gumption at that age.",
            "I’ve got a similar, less bloody and more just stupid situation with my medication for my ADD. \n\nTechnically since it’s Amphetamine, there’s all sorts of paperwork and what not to fill out so I can have it at school. Im supposed to hand it over to the school nurse and then go there to take it. But the time when I meant to take it happens to be right during class change, and I don’t particularly feel like walking all the way across school just to throw a tiny pill down my throat. \n\nSo I’ve gone with the much more efficient strategy of just bringing one pill with me each day and taking it on the way to class. Am I technically bringing and consuming a controlled substance at school? Yeah, but what they don’t know can’t hurt me.",
            "Tough little cookie! Dry lips are bad. I've got quite dry skin and get split lips that bleed a bit too but I can only imagine how painful that must have been for her. Guess the teacher will think twice before ignoring someone's needs.",
            "When kids ask for something, they're often not asking, but giving you a warning",
            "This brightened my already crap day at work, thank you internet stranger",
            "Since we’re giving stories about judgy/bitchy teachers:\n\nBack in first grade I had this teacher who always used to correct me on my OWN NAME. I swear to god. There’s this rule in french that says the letter “s” is only pronounced as a “z” when it’s between two vowels. Well the “s” in my name is between two consonants but is still pronounced as a “z” and she used to tell me: “you know your name is pronounced like *insert wrong pronunciation* in **correct** french so you should really pronounce it the **correct** way. \n\nOh and if you didn’t guess that already: i’m not white... she is. i’m gonna let you guys reflect on that LOL.",
            "Just a grammar police heads up; it’s etc not ect, because it’s et cetera meaning and the rest. Et = and, cetera = the rest, in Latin.\n\nGreat story! I can just imagine your beautiful sister smiling and bleeding horror movie style, a la Carrie.",
            "Being a ginger and having a ginger daughter, I had to chuckle.",
            "This is amazing.  Your sister is a badass.",
            "Had such a great laugh! Husband said it's disturbing to say the least. Thanks for sharing!",
            "Good story. Perfect early life MC.",
            "Am ginger, can confirm I have played the teachers game before and gotten her in BIG BIG trouble. So worth it.",
            "I love this so much. I too have a daughter like your sister. She will follow the rules to the T, piss her off. And you'll rue the day.",
            "idk if she's tried this but I read that lanolin (the stuff that breastfeeding people put on their nipples) can work",
            "Sounds like teacher had a perfect child sibling and was transferring onto her. Idiots like that make everyone worse off. Glad your sister got the best of her, but really sorry for how painful that sounded.",
            "Ugh! I want to hug the small sister! I'm a red head and get wicked chapped lips that split and bleed. I also get really bad lip burns in summer! Weird I know haha.  I use camphor based lip balm which burns like an SOB but helps with healing. I sort of wonder if the teacher was given the option of quitting quietly vs being publically fired. What she did was abusive and cruel..",
            "Damn, I imagined that and was frightened but also wanted to laugh at the horror that must've been that teacher's face",
            "Oof. My hands get really badly chapped in the winter so I know how bad that hurts. Kudos for her sticking through with a smile.",
            "teachers/schools who give kids shit about basic needs are all too common and it absolutely baffles me. who lets these people be around children??",
            "My lips perpetually crack as well, I just gave up because at a certain point it stopped hurting but the feeling of vaseline or chap stick was considerably worse. \n\nOnce I drank 64 ounces in less then an hour and it still didn't get better either, so I'm just stuck with broken lips or the worse hell of makeup.",
            "I get really dry lips too, and I've tried everything under the sun. Carmex is the only one that works for me too. I always figured it was because it's patroleum based so does a better job of just sitting on the skin to hold in moisture. Everything else is gone a little while after putting it on,and my lips hurt more.\n\nMy lips don't get as dry now that I'm much older, but there for a while I had to use the stuff every day or my lips would start cracking too. Not fun.",
            "Geez F for the inhaler thing and wouldn't that technically count as attempted murder?",
            "There is his lip balm and it’s name has something to do with bees but it’s really useful for chapped lips, and it fixes mine within like 2 days",
            "That teacher was a bitch on a power trip. She probably had one scapegoat every year, and your sister was it that year. I was it in my second grade class, too, to the point where I'd lie deliberately just to piss her off about things that weren't related to school, like saying the sky is red. People like this don't deserve our respect.",
            "Sometimes I get sunburnt on my lips and even the good lipbalm won't be able to help. I try to use lipbalm with spf during the day which helps and save the fancy stuff for the night lol",
            "Unbelievable! Some teachers!\n\nMy son is in middle school, and I’m hearing similar stories from him!",
            "I'm a teacher. That teacher was schooled. 11/10 would not defend.",
            "Hey, just wanna say, as a fellow ginger, not one who's lips are f-ed up that bad, but one nonetheless. I'd like to think, even in 2nd grade, I would have raised hell on her behalf. Hope she figured out what works for her.",
            "This post made me put on chapstick",
            "Carmex is the shit. It's the only thing that works when I'm having issues as far as lip balm goes. I find that lip scrub also helps because mine is caused by my skin not sloughing properly (as observed with the bumps on my arms, KP). Wouldn't assume it would work for anyone else, but just in case someone with the same problem I have sees this. Wish I'd known years ago.",
            "early 80s my brother had an older teacher that would slap children, duct tape them to their desk, even taped a girls mouth close and the teacher received no warnings or punishment.\n\nShe actually duct taped my brothers hands to his desk because he was fidgety, a kids legs to the desk because he was bouncing his legs, and the girls mouth shut because she talked too much.\n\nWould have loved seeing what she would have done in the middle of a fire.",
            "I just keep hearing Kip telling Napoleon to ask the nurse for Chapstick. \n\n\n\"My lips hurt real bad!\" \n\n\n\n\"Go ask the nurse. She's got like six sticks in there.\" \n\n\nLololololol your kid sister rules. Hope she has a good lip routine down now and doesn't rip like that often. Ouch",
            "This legit made me laugh. Your sister is an absolute madlass",
            "While reading this, for some reason my brain saw it played out as an anime scene.  Wtf.  I dont watch much anime.  Reddit, you're a bad influence on me.",
            "Your sister is a rock star. She sounds straight fearless.",
            "I’m just gonna say two things:\n\n\n- I’m a ginger\n\n\n- the only fine I ever had chronically chapped lips was when I was using lip balm",
            "Brave of her! Just the thought of splitting my lips up on purpose gave me goose bumps.\n\nRecently discovered Carmex, it's magical. It is the first lib balm I can bear to wear (it's not annoying on my lips, actually feels nice) and it **works**! My lips are so much smoother now.",
            "That’s awful you’re sister had to endure that; but my god what a little badass.  I personally never found Carmex or Burts Bees or any of those brands to work, but something that worked wonders (and like you said, may not work for everyone) was Aquaphor!",
            "I really like your little sister. She is badass.",
            "If you were in the 3rd grade maybe you were a little shit the year before in her class and she thought your sister was the same way hahaha",
            "I used medicated Chapstick because I loved the menthol feeling only to discover that it was actually making my lips MORE chapped. Stopped using it and haven't looked back. I now exclusively use Rosebud salve on my lips.",
            "fuzzy plate roof whole deranged summer ask offer deserted impossible\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "What in the hell happened in the comments for OP to make two edits...",
            "You know carmex would actually make your sisters lips worse. It's not good for lips and dries them out more. I don't quite believe your sister has tried every other one under the sun and they don't work or she's allergic, as a medical professional I think there's some exaggeration here or potentially you live somewhere where healthcare is not easily or cheaply accessible. If her lips frequently chap so badly they bleed entire drops of blood rolling down her chin then there is a problem there requiring more than just carmex, which would not help, although might at least provide a temporary feeling of relief which is why people think it helps.",
            "Carmex is evil, the more you use the more you need. \n\nAlso, gingers having a mean streak is nonesense. They are no different than people with other colored hair; people are people."
        ]
    },
    {
        "post_id": "967zmh",
        "author": "None",
        "title": "Just wear a dress",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/967zmh/just_wear_a_dress/",
        "score": 13464,
        "num_comments": 599,
        "created_utc": 1533915447.0,
        "selftext": "So maybe 25ish years ago, my dad worked at a plant that manufacturers parts for the aerospace industry. Some of the jobs were very hot, not foundry hot, but hot. Company one day says that shorts are no longer considered proper work attire. Double standard time, women were allowed to continue wearing dresses. So....a group of dudes decided to protest, and because hot, they would start wearing dresses while at work. The company thinking said men were just being divas did nothing and called their bluff, assuming they would stop on their own. Because, what man is going to keep wearing a dress everyday?  \n\nAnd for two years neither side blinked and dudes would randomly show up to work on hot days with a dress. Finally rather than reversing the policy, the company made pants mandatory for both sexes and it was ruined for everyone.",
        "permalink": "/r/MaliciousCompliance/comments/967zmh/just_wear_a_dress/",
        "comments": [
            "I would have worn a kilt. No sweaty balls for me ",
            "[deleted]",
            "Two years?! Amazing. I love those men.",
            "Loose clothing in a factory environment is a health-and-safety nightmare, so I hope it was a slinky little black number.",
            "My company fixed that by creating gendered dress codes. ",
            "Happened in Brazil a couple years when there was an insane heat wave in the middle of the summer, but across pretty much all companies men would be showing up for work in skirts.",
            "More effective protest would have been to just have everyone wear shorts. Think they're really gonna send the whole workforce home?",
            "[removed]",
            "Just wear some really cut up pants",
            "I just recounted a story to my family. My high school did not allow boys to wear shorts, but girls could. They were not allowed to wear \"short skirts\". My friends and I decided that nowhere did it say boys were prohibited from wearing short skirts.\n\n9 or 10 of us borrowed mini skirts from friends and wore them to school. Principal hunted is down and threatened us with suspensions. I pointed out to him that it was not forbidden by the student handbook. I had also made a motion to offer to remove my mini in the lunch room after his request, but this was not met with a positive response.\n\nIn the end, no rule change. We did get some kudos and some whistles.",
            "Either this happened at several aerospace companies or I work for the same one your dad worked at. People still talk about the guys that did this. ",
            "Awesome.  \n\nI worked at a shipping company years ago, and shorts or jeans were not allowed for supervisors (but were for regular workers).  Never said anything about skirts/dresses though because they figured with the physical nature of the job - bending over to pick up and load packages, climbing up ladders - no one would want to wear anything but pants.\n\nJoke's on them, I found a couple of skorts (skirts with shorts built in underneath) and wore those bitches every day during the summer.",
            "Skirts designed for men would probably have been more appropriate. Kilts are the obvious choice, except good kilts are heavy wool, and not suitable for hot conditions. Plenty of hot weather cultures have skirts for men, which are worn with other clothing (shirts, etc.) that are traditionally masculine. A Samoan *lavalava*, Burmese *longyi*, Arabic *izaar*, or a sarong, are all perfectly normal hot-weather skirts for men.",
            "Luckily I'm allowed to wear 3/4 pants at my work (can't have shorts due to safety issues while working with very sharp metal sheets), and for some reason they don't seem to mind me working topless...so I do =)",
            "I feel like this is the sad reality of a lot of these malicious compliance stories irl, and not just in reddit. they never roll back the stupid policy they just doubled down on it",
            "You know management worked in the a/c for sure",
            "Upvoted for the conclusion. I've heard the set up 100 times already, but usually they just allow shorts again lol.",
            "Damn, unhappy ending.",
            "We briefly had a no shorts dress code that allowed skirts. I was very close to buying a utilikilt before they just got rid of the dress code entirely.\n\nIt’s like they don’t understand that my breaks outside are by far the most important part of my day!",
            "I don’t know why more men don’t do this, even just for comfort when it is super hot at least. And honestly I think it looks really good, men in skirts or kilts can be pretty sexy. ",
            "Is there a legit reason to ban shorts anywhere?",
            "I'm so confused. Why would a factory allow dresses at all? Isn't that a safety thing?",
            "This is rather common in UK schools.  Girls are allowed to wear skirts but boys can only wear pants. I think the first instance of news going viral is a boy who borrowed his older sister's skirt and wore it to the school to stay cool.  And a couple years ago? there was a heat wave, multiple boys wore skirt.",
            "Id love to wear a dress to work",
            "I was hoping wearing dresses just became part of the company culture and that was it. ",
            "[Some lads...](https://www.telegraph.co.uk/content/dam/news/2017/06/21/TELEMMGLPICT000132602364_trans_NvBQzQNjv4BqqyH--JwBfI8iL9dN4Vc1pV74XqXPgYCdJPxFfhB2AJY.jpeg?imwidth=450)",
            "[deleted]",
            "Schools in the UK increasingly don't specify genders in their uniform policies. So there is a list of uniform options but no rules about who can wear what. Also avoids any issues with trans / intersex etc students. ",
            "Shouldve worn a kilt.",
            "I don't understand these types of policies. Who are they protecting? \n\nWho is offended by shorts?  I could understand if you're customer facing but it sounds like the environment they are working in wouldn't be accessible  to any non employees.",
            "Howmet / Alcoa?",
            "I worked at a Callcenter for a while with a no short policy but bermudas (under the knee) were okay and they just closed their eyes and special hot day because they weren't stupid.\n\nAlso, they had no other dress codes, I've seen people in torn jeans, men with colorful  painted nail, full goth, etc. That was great! ",
            "[so it turns out](https://www.bbc.com/news/world-europe-22828150)...\n\n[this is definitely a thing](https://www.businessinsider.com/french-bus-drivers-couldnt-wear-shorts-so-turned-up-in-skirts-2017-6)",
            "Which is when you cut the pants to roll them up easy",
            "I’m not saying this is why I transitioned male to female, but it doesn’t hurt that the clothes you can wear in the office are way more comfortable.",
            "I am 69 yrs old. Retired for 7 yrs.  What dress code",
            "Seems like a dress wouldn’t protect your legs any better than shorts.",
            "After a year of chemistry graduate school and a better understanding of how a lab functions for all walks of sciences, it’s just best to wear clothing that best covers your body. ",
            "This story has a very sad ending. It was not a good way to start my day :(",
            "Did anyone else read The Obnoxious Jerks in middle school?"
        ]
    },
    {
        "post_id": "djd5u6",
        "author": "None",
        "title": "McDonald's sent a cease and desist for \"Effing Filet O’ Fish\" so owner changed name to \"McEffing Fish Filet\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/djd5u6/mcdonalds_sent_a_cease_and_desist_for_effing/",
        "score": 13455,
        "num_comments": 427,
        "created_utc": 1571348234.0,
        "selftext": "Some parts copied from source: https://canoe.com/news/local-news/local-burger-joint-served-with-cease-and-desist-from-mcdonalds-2/wcm/67ddd1bd-7806-497d-bf2d-c666353082e1\n\n>Paul Shufelt, the owner and chef behind the local Woodshed Burgers restaurant, wasn’t loving what he saw when he opened his email on Wednesday.\n\n>In his inbox was a formal cease and desist from McDonald’s Restaurants of Canada over one of his restaurant’s burgers: the Effing Filet O’ Fish.\n\n>In compliance with the cease and desist, Shufelt renamed his burger to the McEffing Fish Filet — his flippant way of complying with the massive company’s cease and desist.\n\nYour turn, lawyers.",
        "permalink": "/r/MaliciousCompliance/comments/djd5u6/mcdonalds_sent_a_cease_and_desist_for_effing/",
        "comments": [
            "Would be funny if it were in the EU. McDonald's lost their trademark for Big Mac, so he could have called it a Big Mac and they couldn't do shit about it.",
            ">Shufelt said he thinks McDonald’s concerns about brand confusion are “laughable.”\n\n>“If anyone were to mistake my burger for their thin, frozen fish burger, I think they’d be nuts. Mine’s the size of my head, and it’s fresh, and it’s delicious,” he said. “If anything, they’re just making their situation worse by going after a little guy like us.”\n\n>In compliance with the cease and desist, Shufelt renamed his burger to the McEffing Fish Filet — his flippant way of complying with the massive company’s cease and desist.\n\n>“Let them come at us, I guess, and they can have a pissing match with a small, 40-seat restaurant in Edmonton over the name of a burger,” Shufelt said.\n\nThe fact that the lawyers who sent him the letter are called SMART & BIGGAR just makes this whole thing even more laughable. \n\nI would *love* to see our Canadian redditors in Edmonton make his day",
            "McEffing beautiful",
            "Reminds me of the chap who called his shop Singhsbury's, but had to change it when Sainsbury's complained. He renamed it Morrisinghs, with the approval of Morrisons",
            "[deleted]",
            "I saw an interview with the Earl of McDonald. It was because McDonald's Corp. issued a C&D to a small pub in Scotland named McDonald's. The pub's owners last name was McDonald, and he approached the Earl for permission to use the name on his pub, per the local long standing custom. The Earl said it was fine with him.\n\nThe interviewer then asked the Earl if McDonald's Corp. had ever asked permission to use the name, and he replied \"They haven't approached me yet.\"",
            "There's a burger joint in my city that used to sell essentially a Big Mac with \"special sauce\" and all. McDonald's sent them a ceased and desist and the burger is now on the menu as \"Cease and Desist\"",
            "Love this guy, and I want two McEffing Fish Filets for dinner. Sure wish Woodshed Burgers offered delivery to Wisconsin.",
            "[deleted]",
            "When Burger King arrived in Australia, they had to change their name to Hungry Jacks as there was a small restaurant already named Burger King.\n\nWhen Carl's Jr arrived a few years ago, they sued a small restaurant over the name of a burger that has been around longer than Carl's had been in Australia, and lost.\n\nThe little guy can certainly win battles like this, but in this instance, I don't think there's much hope for the guy.",
            "Well, assuming the trademark is on \"Filet o'Fish\", why would they come after him again? I can't believe \"Fish Filet\" or \"Mc\" is trademarked.",
            "Going to be heading to Woodshed this weekend in support of this local malicious compliance.",
            "I hope he can keep this going with multiple names just to cost McD's lawyer fees.",
            "I'm having so many flashbacks to \"Coming to America!\"",
            "Copywrite law kinda requires them to do this to show they're actively defending their IP",
            "The biggest surprise to me is that there's only 1400 McDonald's in Canada. Those fuckers are everywhere",
            "While I don't know anything about Canadian trademark law, on the US side, you have to defend your trademark or risk losing it. McD's is just doing what they have to do. \n\nIt's still funny, though.",
            "That is hilarious",
            "McStreisand Effect",
            "If that place was local to me, Id go visit.",
            "There’s a tiny restaurant in Tanzania selling burgers called Mcwhoppers.",
            "this is good publicity for the McEffing Filet O fish",
            "I’m from Michigan. Big Mac is a bridge. Eat that, clown.",
            "Next up:\n\nFellati o' fish",
            "That grey stuff looks fucking disgusting.\n\nWhat is that, snail brain?",
            "Shufelt, aka Nathan Fielder.",
            "He should have just changed it to the McEffing Filet 0' Fish.",
            "[deleted]",
            "Big Brain",
            "r/madlads\nr/FirstWorldAnarchists",
            "I'm Lovin' It!™",
            "I’m from Alberta. I heard this on the local news. Fucking crazy.",
            "There was a place in San Francisco a loooooong while back named McSushi which sold, well, sushi. The got a cease and desist letter too.  \n\n\nThey caved. I was so very sad to hear that.",
            "I pray for the person who’s brave enough to eat fish from McDonalds.",
            "This reminds me of [the story](https://www.deseret.com/2000/1/9/19484686/fedex-fails-in-bid-against-ex-federal-espresso) about a coffee shop called Federal Espresso that got sued or C&D'd by FedEx and was forced to change their name, so they changed it to Ex-Federal Espresso. I believe they later got C&D'd again and ended up changing it to Freedom of Espresso.",
            "Effing McFish",
            "I don't see how this could be an infringement at all though. Granted I'm no lawyer but isn't filet o' just short for *filet of* or something similar? The name of the burger is descriptive and would be a tricky trademark to defend.",
            "[removed]",
            "\"...*behind the Woodshed*\" restaurant...\n\nISWYDT",
            "This is my city!!!!",
            "Need to call one of those local news \"Channel XX on YOUR side\" guys.",
            "r/Edmonton",
            "I live in pretty much the next city over from where this place is, and I saw this shit on the news today, some of the best news I've ever seen.",
            "Effing Seafoods has some excellent fish, too! Have been thinking of trying Woodshed, it's a fairly new place. Definitely going now!",
            "Doesn't McDonald's own \"Mc\" as well?",
            "Check and Mate!",
            "I was all for this guy, until I saw he had 13 McEffing hashtags on his post. You're a grown adult running a business that gets enough attention that a McLawyer has to rile you up, don't belittle yourself.",
            "Hahahahahahahahahaha xD!!",
            "The Big Mick.",
            "I live in Edmonton. I'm very tempted to go visit this place.",
            "How the hell can they trademark filet o fish ? That is simply the term you use to describe the item, and that term has been around  a lot longer then mc donalds",
            "Didn't a small Scottish family café call in the genealogists to settle priority on their 'McDonald' name when bid 'Cease & Desist' ??\n\nYep, the international bunch came from a minor 'cadet' line, the family café had the right of it...",
            "They really missed the change to say he \"wasn't lovin it\" in the article.",
            "so is it a...\n\n\n\n\nMACkerel?",
            "Well, this is flagrant trademark infringement. Looks like someone is smartass, yet successful enough to afford corporate lawyers for 2 companies at once!",
            "You name something almost the same as something from one of the world's largest corporations and then you're both confused and indignant that they get upset?",
            "By far my favorite fast food fish sandwich IS McDonalds Filet O’fish. Tried them all but nothing beats it.  (with side of fries) PERFECTION!!",
            "Honestly they do have Filet o' Fish trademarked, so he can't use it. Changing the name to not their trademark is what they wanted, so it's not really malicious compliance or revenge in any way.",
            "I'm gonna b honest, that burger (if you can call it that) looks disgusting. Completely unappetising. No thank you. Keep your \"burger\".",
            "Big Fish would be a good name for a fish big mac"
        ]
    },
    {
        "post_id": "m1rwz2",
        "author": "EpicWinterWolf",
        "title": "My Mom Ends up Ruining the Life of Her Ex-Boss During After an Exit Interview",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/m1rwz2/my_mom_ends_up_ruining_the_life_of_her_exboss/",
        "score": 13453,
        "num_comments": 470,
        "created_utc": 1615360519.0,
        "selftext": "(Fixed due to Rule 8)\n\nThis happened about thirty odd years ago, and my mother recounted it recently during a family dinner.\n\nSo back in the 1990’s my mom worked for this big time company (we’ll call it Company W) as an accountant. Her boss, the Head of Finance was a sleazy guy, and despite being semi-wealthy (it was a BIG company) and married with kids, he always tried to pick up younger women in the office.\n\nEventually after a few years, my Mom, being the amazing accountant that she is, noticed small irregularities in several statements. I don’t know the technical terms, but Mom realized that someone was embezzling the company’s money for at least a couple decades. Concerned, she brought it up to the Head of Finance... who proceeded to demean her, call her names, botch her claim and basically threatened to fire her if she brought it up again.\n\nMy mother is not one to start crying, and instead sought to prove him wrong. However, a couple of months later Head of Finance brought in a new lady (young, she was legit blonde, fresh out of college) to train under Mom. My mother instantly knew what this was, and started putting out feelers for a new job. In the meanwhile she trained the younger lady, who, to quote my Mom, was “not the brightest bulb”.\n\nNow, Company W had a policy when an employee was going to be fired. If the employee was being fired (for reasons other than rule breaking, violations, etc) they would be allowed to say that they ‘quit’ to be able to give their weeks notice and get pay. A fair policy.\n\nSo one day Mom was summoned by Head of Finance and told that he was firing her. She quickly counteracted and used the policy to her advantage, which angered Head of Finance but he had to comply.\n\nThe Malicious Compliance I know you’re waiting for?\n\nHead of Finance told my mother in a, rather rude way, that since she was going about it that way, she might as well do an exit interview.\nMy mother literally had a lightbulb moment, and said to him that in that case, she would.\n\n(To note: an exit interview is a formal way of leaving a job, akin to an interview for getting the job. It's a way for employees to share their experience, and why their leaving for records, including HR (Human Resources). You can see where this is going).\n\nSo, she was scheduled for the exit interview. When she went in, my mother had to, of course, bring in files relating to her work (I can’t recall the exact reason, other than it having to be relevant to her reason for leaving), and show it to the interviewer.\n\nMy Mom brought in three large boxes of files, each one containing evidence of the embezzlement. She then presented it to the interviewer, who my mother told me was rather stunned, and proceeded to hand over all the evidence and proceed with her exit. Including talking about the Head of Finance’s reaction and how not long after the new lady was brought in to replace her. Mom then left the company that day, got new employment, and moved on.\n\nIt was a decade later that she learned what happened. My Dad was a delivery driver at the time and actually made a delivery to Company W. While there he talked with an employee, mentioned my Mom had worked there and how she left, and the employee told him quite the juicy story....\n\nIn the year following my mother’s departure and interview, her evidence was brought to HR and the CEO, who ordered an internal investigation. Hidden cameras were placed in the accounting division, every file made was screened ave photocopied, tiny details scrutinized and bank records triple checked...\n\nI think you can see where this is going. Yup, the Head of Finance was embezzling from Company W. But... it gets better. They got him, on camera, making out with the new lady inside the main office after hours. To add insult to injury, the cameras also caught him being cruel to those under him, touching other women, etc.\nBut the biggest thing was still the embezzlement. Head of Finance managed to, in over thirty years, steal over a *million dollars* in Company W’s earnings. From his days as a mere accountant and all through his promotions. Now the exact way he was able to get that much over time wasn’t told to my dad (I doubt the employee knew), but he did know the fallout.\n\nHead of Finance was summoned to the Big Cheese’s office the day after the evidence was complied... and let’s just say Head of Finance wished he had simply been fired. He was arrested for the embezzlement, and for sexual misconduct (or something like that), as well as a few other things my mom can’t recall. The new lady who came in actually revealed that he had brought her in after starting to date her and even revealed to her what he was doing. Her job basically had been to help him cover it up so they could live the rich life. She didn’t even know what exactly accounting was, other than managing money. The perfect cover, so to speak.\nAnd if the now ex-Head of Finance thought being arrested and charged was bad enough, when his wife found out...\n\nThe employee who told my dad this hadn’t been present when the wife had come in while the ex-Head of Finance had been led out, but a friend of his had seen what happened. She had just went up, smacked the now ex-Head of Finance, screamed obscenities at him, before saying she’ll be seeing him in court for a divorce.\nWhile my dad couldn’t learn what exactly happened next, what was clear was that the guy’s life was ruined. And my mom, while not a vindictive person by any means, did feel somewhat joyful over the outcome.\n\nLesson to be learned here: *never* screw with an accountant who actually knows what they’re doing.\n\nTL:DR My mother discovers signs of embezzlement, gets demeaned and then slowly replaced by her boss. He offhandedly ‘tells’ her she might as well do an exit interview while quitting. My mother does so, but shows evidence against him that ends up with him being changed for embezzlement and getting divorced by his wife for being with another woman.\n\nEdit: Wow, this really blew up! I told my mom and she was in disbelief! Thanks everyone, you made her day!\n\nTo clarify, the malicious compliance is that at the exit interview, my mother *has* to submit paperwork relating to why she left. So when the Head of Finance sarcastically told her she might as well go for it, she did. And presented all those files of evidence against him, stating why she left (including what he had said to her). This is not revenge because my mother never intended it to be, she actually didn’t realize how deep it went or that he was such a scumbag. She simply did exactly as she was told!\n\nAnother thing to clarify: the CEO got involved because one; Head of Finance was leeching from their funds for a long time, and two; ...they *had* been friends according to mom. Yikes. Also please note she didn’t learn of the fallout until a decade later, and from my dad who was told by an employee from the company, and mom told me. If I did get something wrong, well... telephone effect anyone?\n\nWow! Just saw the notification about the gold! That’s insane! And that upvotes! You guys really made my mom’s day! Thanks all!",
        "permalink": "/r/MaliciousCompliance/comments/m1rwz2/my_mom_ends_up_ruining_the_life_of_her_exboss/",
        "comments": [
            "Embezzlement was the word you were looking for.",
            "And just think, if only he had just been *nice* he would probably still be getting away with those crimes today.",
            "The most jarring lines in this story are:\n\n\" This happened about thirty odd years ago \" followed closely by \" So back in the 1990’s...\"\n\nI feel old!",
            "I used to work in the field of unemployment law.  There were many cases of bookkeepers and accountants being caught for embezzlement when they went on vacation and someone covered for them.\n\nYour mother was very smooth in the way that she handled this HoF.",
            "Being \n\nCharged &  arrested for the embezzlement\n\nCharged & Arrested for Sexual Misconduct\n\nHis wife learning about his infidelity and filing for divorce\n\n&#x200B;\n\nOh wow. This is like Tsunami after Tsunami striking him. BAM! BAM! BAM!",
            "Your mom didn’t ruin anyone’s life, he ruined his own life by being an absolute tool. Also, if anyone reading this has aspirations of being a dirtbag, when someone brings evidence to you of your misdeeds, don’t shout at them and threaten them and tell them to never speak of this again. Say something like, “oh my gosh, this is very concerning. I will launch an investigation right away.”",
            "Why didn’t the police get your mum involved in the investigation?",
            "This is why in Accounting you should have segregation of duties (not one person responsible for multiple steps so money goes missing). It then takes collusion to embezzle. \n\nOf course if the Accounting manager is bumping uglies with the payroll person then you can still lose millions.",
            "Did your mum work for Beneke Fabricators?",
            "Never fuck with the person who knows where the bodies are buried 😄",
            "Typical sleaze. If you're going to do something illegal or amoral, only do ONE thing. Otherwise you'll very quickly get caught out for one and the rest come falling on top of you.",
            "Sounds like something for r/prorevenge",
            "Moral of the story is, if your employee discovers evidence of your embezzlement, don't make things worse by being a dick!",
            "The 1990s weren't 30 years ago! How dare you!",
            "Would allow them to say they quit...what to not pay them unemployment?!?",
            "Something similar happened to a friend of mine at their company... apparently a few years ago, they were rolling out a new software package for their various divisions.   Part of this package was going to take over their financials from an older system.  But the IT person (my friend's co-worker) needed to go through the older system and re-route a bunch of stuff to the new system to integrate it.  \n\nEverything was going fine until they apparently hit one division where they found a lot of irregularities... and these spanned decades... \n\nThey brought this to the attention of the super high ups and i think even the FBI had to get involved... and not long after they discovered that one of the managers of that division was embezzling funds, and had been for those decades...  \n\nmy friend and basically the rest of the company found out after the bosses made an announcement that this guy was arrested upon returning from a vacation... guess he was arrested at the airport by the feds... \n\nWhats crazy is how apparently a lot of the people who knew the guy were talking about how all of the sudden his lifestyle made sense... sounded like the dude took several major vacations a year... had a big house, lots of nice cars and lived an amazing lifestyle... i think his kids were in super expensive ivy leagues colleges...  and while people seemed to notice apparently no one ever thought to ask what was up.\n\ni'll have to ask my buddy if he knows whatever happened to the guy.",
            "\"this happened about thirty years ago... So in 1990s\" stop STOP IT HURTS ALREADY IM NOT OLD PLEASE",
            "I have an accounting auditor in the family. During his time at a billion dollar company he uncovered lots of embezzlement of varying degrees. He discovered the kickback scheme for the bicycle racers the company sponsored. It would not have revealed itself if the company's lead in that area hadn't bought crazy amounts of porn magazines at the airport on the company CC when he flew. Another big one was a secretary at a satellite office who was buying a house more expensive than her or her husband's salaries should have allowed. He always said embezzlers always show their hand when they get too greedy.\n\nEdit: removed possible identifying location of company.",
            "To say my last year in the military was rocky, is an understatement.   I'd been in trouble a few times, nothing major.   Even got my honorable discharge.  \n\n\nHowever,  as part of my departure stuff, I was accused of cheating at doing a outbound task.   The person who accused me, was not present and pressured the person who was there into a \"I don't remember\" statement.   Lots of bad emotions on both sides.  \n\n\n2 days before I leave, I have my \"exit interview\" with my Commanding Officer.   We talk about the usual stuff, what I'm going to do after the military, travel plans, etc.   Then we get down to reviewing my time in service and the issues of the past year.   He mentioned nothing about the blow-up during my out processing.   So I bring it up in detail.  \n\n\n\"Sir, in all my troubles, have I ever lied, denied responsibility, or dodged punishment?   When I f\\*\\*\\* up, I own it.    I do not own this issue.   X was not there, it is my belief that X pressured Y to 'not remember,' then Z backed up X.\"  \n\n\nWe wrapped up and I was on my way to go to my workplace and clear out my desk.  My final night, we are in the club having farewell drinks.   To say I was cold to X & Z, was an understatement.  Y, I told to be careful of letting others control what she thought she did or remembered.   I didn't understand the strange look she gave me, at the time.  \n\n\nA little later a friend joined the table.   Seems he had been in the admin area in the afternoon after my exit interview.   The commander was in his office yelling at someone.   Z came out.   X went in.   More yelling.   Z looked around and told everyone to \"Get out!  Leave the office now.   We are closed for the day.\"  \n\n\nThe next day as I'm hauling my luggage out of the barracks, a friend asked \"What bomb did I drop in Admin?\"   Seems there was a major shake up happening in the Admin department and my name was being used.  \n\n\n\"Help me with my luggage and I'll tell you the story.\"",
            "Damnit late again and post been deleted. \n\nEdit : wheeeey it’s back up!\n\nEdit : actually a real cool story",
            "Your mom is an absolute badass for keeping at chipping away at the leads, figuring out the embezzlement, confronting the perpetrator, and even making sure authorities could deal with it after. Also this is such a great write up!",
            ">This happened about thirty odd years ago\n\n>So back in the 1990’s\n\nFuck I'm old.",
            "Your mom is awesome!",
            "Love seeing the patriarchal ghouls get what’s coming to them. Beautiful.",
            "My mother spent over a year giving evidence to the FBI 15 years after being fired. They contacted her asking if she knew anything - she knew everything. Don’t screw over your account they know where you buried the bodies. \n\nNote: This involved interstate commerce and transportation so was an FBI matter.",
            "I know I'm too late to the party to get read, but a lamer version of this story happened to my friends dad. \n\nHe and his brother ran a transmission shop and he could never figure out why they had to struggle so much to stay afloat. Until somehow it came to light that their bookkeeper had been skimming an extra 100k off the top for herself over 10 years. \n\nYadda yadda, she went to jail and her estate was sold off to pay for the damages incurred. \n\nBut. \n\nThe state said that since she never paid taxes on the money she took, they had first dibs. Which meant that after they took back taxes, my buddy's dad got nothing. \n\nSo he got screwed by this chick, and then by the idaho state government. Poor dude.",
            "What is an exit interview, and who is it with?",
            "It's too bad your Mom didn't go to the ceo, she might have become head of finance",
            "Crossing a competent accountant is never wise.\nBut yeah just don't embezzle... :D",
            "1990 was 30 years ago?! Fuck me\n\nEdit: I realized I am officially old.",
            " *never* screw with an accountant who actually knows what they’re doing. (if you happen to be embezzling)",
            "> Lesson to be learned here: *never* screw with an accountant who actually knows what they’re doing. \n\nI think we can do better here.\n\nIf we simply make the lesson *never* screw with an accountant, full stop, it'll cover both your mom and the new accountant, if you get what I'm saying (:",
            "Wow, that's quite the story, thanks for sharing.\n\nPlease don't feel pressured to answer, but I'm guessing this was in the US. If so, from what I've read in r/personalfinance, it sounds like that \"fair\" firing policy let the company avoid having to pay unemployment, which would be rather sleazy as well (except if employees that \"quit\" also got a severance package). I'm no expert and might be wrong in this, though.",
            "don't ever get on your mum's bad side.",
            "Shame she was not contacted by the company and given some sort of financial reward.",
            "this is pretty huge, imagine what a million meant in the 1990's.",
            "I hate the fact you said 30 odd years ago and then, in the 1990’s",
            "The Chief Financial Officer of a company I worked for in the past left after being there for at least 20 years. \n\nWhen I questioned some people about it they said there were rumors of shady bookkeeping, I guess he wasn't ok with breaking the law, unlike everyone else.",
            "[deleted]",
            "Do you know what I took away from the story? The 90s were 30 years ago.",
            "Imagining this happening with giant 80s hair and those shoulder-padded women's power suits makes the whole story 1000% better.",
            "Your mother didn't ruin his life, he did.",
            "> The Malicious Compliance I know you’re waiting for?\n\n> I think you can see where this is going.\n\nWhat is this type of writing called?",
            "If anyone watches the show Married at First Sight—I was hoping Chris and Paige would last a little longer just so she could see his actual finances 😅🤣",
            "> despite being semi-wealthy.....he always tried to pick up younger women in the office.\n\nSemi-wealthy people don't like younger woman?",
            "So, your mom was the guys from Weekend at Bernies...\n\n\n(As an accountant who was told he looked like Andrew McCarthy in the 90s, I appreciate this story)",
            "Too bad your mom didn’t demand or sue for sexual harassment, discharge without just cause and so on.  The CEO should have kissed her feet for outing this creep.",
            "I wonder how far back you can sue for wrongful termination?",
            "\"Heav'n has no Rage, like Love to Hatred turn'd, Nor Hell a Fury, like a Woman scorn'd.\" William Congreve (1697)\n\nGreat story!",
            "Whats rule 8?",
            "Beware of accountants...... they multiply!!",
            "I LOVE YOUR MOM! AN ACCOUNTANT! Woooo",
            "Love to read it.",
            "Schadenfreude.",
            "Stories like this really show how greedy people can be especially when they believe they’ll never get caught",
            "They should have contacted the Mom and offered her job back, with backpay and a nice promotion.",
            "\"A good juggler will never want for work\"\n\n-Luca Pacioli",
            "Hahaha your mom sounds awesome.",
            "r/ProRevenge maybe",
            "Damn. Thirty odd years ago was the 1990’s??  I guess I’m old. Drat!!!!",
            "Love this story. Go mom!!!",
            "I love this story!",
            "If it was right at a million or so over 30 years he ruined his life for about $650 a week. But hey, it was probably tax-free. /s",
            "Look upon the field on which your mom grow her fucks and see that it is barren. Side note: You mom dropped a tactical nuke on his ass he didn’t know he was fucked.",
            "This is Malicious Compliance along with a side of r/EscalatingRevenge.",
            "Yes!",
            "Never fuck with the accountants.",
            "I have a very good accountant. I will certainly never screw with him.\n\nAs a matter of fact, I go out of my way to treat him well.",
            "She Shawshanked him!\n\nWell played!",
            "It sounds like your Mom couldn't have happened to a more deserving person.",
            "As a fellow accountant I love this",
            "Hate to tell you but this is absolutely revenge no matter which way you cut it and beautiful revenge at that.",
            "I didn't feel old until the part that the 90s were 20-30 years ago T.T",
            "Strict rules exist in accounting and finance today due to the criminal behavior of companies since the 1980s. More than a handful of slimy chief execs for the largest companies on earth have blown their brains out on their own home driveways, caught embezzling. Vastly more are imprisoned.\n\nAll NYSE corporations are audited today constantly; internally and externally via structured methods to ensure no one garbage person or team, especially an exec embezzles. Corporations like Bank of America, FedEx, Chase, UPS, and their peers have developed Governance, Risk, and Compliance (GRC) teams to audit this sleaze out.\n\nIn my IT career, some of the most proud work I’ve done to date has been in the GRC space. I would challenge anyone here to query ‘GRC’ and possibly ‘RSA Archer’ if this interests one. I have no relation to any company. Small, non listed will also be eventually be audited.",
            "Am I the only one who thinks the concept around \"exit interviews\" is absolute bullshit?",
            "Karma has a long reach. I’ve noticed that before. Good for your mom to just move on, but hearing the story later must’ve been a bit of a vindication for her. \nAlso, when you said some 30 years ago, my mind legit went “oh so like a 60s/70s story”. Then you said in the 1990s, and dammit, I feel old now. 😂",
            "Really entertaining story, but likely not true or details dramatized. I’ve been working in Internal Audit for 7 years, and this is not how it would play out. Far too lengthy and expensive, and if it were a large company, as OP says, the CEO wouldn’t be involved. That’s the first thing that tipped me off.",
            "You're a good writer.",
            "As an accounting student this gave me a justice boner",
            "Think this goes nuclear,  maybe higher.",
            "Had a solid sexual harassment claim and constructive dismissal. Legal Advice would have had a field day with this.",
            "Now that's a good solid MC story!  Talk about karma.",
            "Only *charged* with extortion? Not convicted?",
            "So your mom leaves after providing all the evidence to the people in charge, but the guy is still kept on for another year. Then your dad suddenly does delivery to this same company and a company employee proceeds to tell your dad everything about this story to the minute detail. Oh yeah, this definitely happened...",
            "Nice,\n\nOne suggestion, it would be much easier to read without all of the internal dialog like: \n\n>I think you can see where this is going.",
            "BtI’m by BBC by b",
            "Why do people put \"You can see where this is going\" in their stories? You may as well just say \"Hey reader, I know you're stupid so you better pay attention to this part\".",
            "Honestly, $1m over 30 years doesn't even seem worth it -- $3k per month for that risk (assuming Western country, good pay for an accountant + promotions).  Was this guy rounding up fractional pennies and putting it into an account or something?",
            "Ih man this is amazing.",
            "Question: is everyone in your family gangster AF like your mom?",
            "This is a really really good story but it's not malicious compliance",
            "I think you can see where this is going...... to another paragraph and another I think you know where this is going. Will not get that 5mins of my life back thanks",
            "> This happened about thirty odd years ago, \n\nNo reason to mention when it happened since your opening sentence was, \"in the 1990's.\"\n\n&#x200B;\n\n>and my mother recounted it recently during a family dinner. \n\nNot pertinent to the story. \n\n&#x200B;\n\nOther than that, good story OP.",
            "Way too long bro, I don't have time to read all this I'm busy at work thanks anyways",
            "Sweet, sweet justice. Mmmm. Just drink that in.",
            "So Head of Finance got what was coming to him, but poor mom got *nothing* for what she discovered and maybe saved the company another million.",
            "Surely if this was true your mother would have been called on to testify or at least give a statement to the police."
        ]
    },
    {
        "post_id": "q80l5k",
        "author": "None",
        "title": "\"Deal with it.\" Okay. Consider it dealt with.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/q80l5k/deal_with_it_okay_consider_it_dealt_with/",
        "score": 13449,
        "num_comments": 473,
        "created_utc": 1634220841.0,
        "selftext": "Reposted from r/Entitledparents and slightly modified to include variations on the words 'malicious compliance'. \n\nA friend of mine, Richard, told me about something that happened to him yesterday, and knowing I'm on Reddit, gave me permission to share it.\n\nRichard works at an outlet village - it's a shopping centre of sorts, lots of shops, with excellent parking - as a parking enforcement officer. He is a decent guy. Generally, if someone parks in the wrong place, he will give them a chance to move rather than ticketing them.\n\nOn to the story. Yesterday he's at work when this middle aged woman tears into the carpark really fast, and slams her car into a disabled parking bay. He approaches the car from the back, she, as the woman and her son are getting out, says to the woman that she can't park there as it is a disabled space. \n\nShe replies, \"We'll be five minutes. Deal with it.\" without even looking around to see or even acknowledge who spoke to her. \n\nSo he maliciously complied by dealing with it with a ticket. £80 fine. He said it felt good.",
        "permalink": "/r/MaliciousCompliance/comments/q80l5k/deal_with_it_okay_consider_it_dealt_with/",
        "comments": [
            "Disabled guy in Toronto used to do the same in shopping mall parking lots.  He'd point out that they were in a Disabled spot.  When they said they would only be 5 minutes he would reply \"Then you're okay, the tow truck will take about 15 minutes to get here\" as he whipped out his phone. \n\nThey invariably got back in their vehicle and moved.",
            "That’s really cheap. I’m the Netherlands, that fine would be around 400 dollars (and rightly so)",
            "That's an expensive 5 minutes 😂",
            "Was kinda hoping he had it towed. But if the ticket is all he can do, then I'm glad he did.",
            "As a blue badge holder who had to not get my food shopping today thanks to the disabled bays being full (not saying they were being used incorrectly) a huge thank you to Richard!",
            "My daughter(now31) is disabled. Has been since birth. Once at a grocery store, I saw a dude whip into the handicap space next to the one we were loading up in. He was driving a new corvette convertible with trophy wife/girlfriend. I pointed out that he had no permit to park there, but he said that he’d only be a minute. I said that it’s about accessibility, not convenience, he shrugged his shoulders and walked off.\n\nLots of carts near the front of the store, and I got an evil idea. Placed three rows of shopping carts around his car, not touching the car at all. I then walked over to the off duty cop working security to tell him that I never touched the car, but that dude now has an accessibility problem. Unfortunately, it was getting rather late to be out with three old daughter and one year old son, so I didn’t see the reaction(s).\n\nI did see the cop later at same store and he told me that dude was unhappy to say the least. Cop told him that if store policy didn’t prevent him from doing so, he’d write a ticket. Dude started bitching that the cop should have stopped me, and cop replied, you might still get that ticket, if you don’t stop bitching. Wonderful day all around for me.",
            "Bicester village?? That place is always good for a parking situation!",
            "i was a parking cop in college and I loved these kinda people. \n\nthem: OMG I WAS IN THERE FOR 5 MINUTES!\n\nme: I've been here for 10. *hands ticket* enjoy your day",
            "When I worked as a parking attendant, back in 2004, issuing fines for parking violations, I saw a vehicle parked in a disabled bay, with a disabled badge that had an expiration date of 1st April 20011.\n\nSo I gave them a parking ticket, because I was fairly certain that the council didn't issue disabled badges to run for 18 thousand and 7 years.",
            "Many places in the states it's a mandatory court aperence.",
            "haha I love this story not just for the fact that it's a good story, but because of just how simple the definition of malicious compliance can get.",
            "I also worked parking enforcement for a while. My favourite response to “I’ll only be five minutes” was “Take your time then. My record is 43 seconds.”",
            "When the penalty is a fine, the law doesn't apply to the rich.",
            "£ 80 sounds not too bad. My local community charges € 300 for parking without permit on disabled parking spots. I’d say that’s about the average fine for this offense in the Netherlands.",
            "I had to help a woman amend her disability payments and her regular costs included getting parking tickets when the disabled bays were full. It's not my fight, but I'll throw hands if anyone says, \"it's just five minutes,\" or \"I'm waiting for someone, I'll move if someone shows.\" Just how, do you imagine, a disabled person is going to tell you they need the spot? Haul out their gear and tell you?? That'd be the point of the bay.",
            "Damn, only 80? Where I live, it's a minimum of $250 maximum of $500 for the first offense, and goes up for each offense, as well as community service for every offense after the first one.",
            "As a person with an invisible disability, I thank you! I really hate those people who part in between spaces, that is for people in wheelchairs!",
            "It’s a good r/FuckYouKaren story too!",
            "Yep.  Americans charge like $500 for that, but that's another topic.\n\nI was thinking of the boot or towing, but this is good.",
            "There should be a rule that if you see a car in the handicap space without a permit, you're legally allowed to steal it.",
            "My city had a pamphlet titled \"Just Gonna\" that they gave to the quite substantial number of people who tried to get out of a parking ticket with the argument \"but I was just gonna [...]\".",
            "Lol, I used to love, love, love writing handicapped parking tickets. Gave me a boner each time I wrote one.",
            "That is a cheap fine for parking in a handicapped spot.",
            "I'm disabled and only use disabled parking when my condition is particularly bad or when there's like 6+ open spaces. \n\nWhen I can walk a little further and there are only a few spots, I always park further because someone much worse off than me may need it.",
            "As a disabled person, Unfuck this lady forever.  May she never be fucked again.",
            "As a daughter of a disabled person and now a disabled person myself, this makes me cross. (Okay I’m British and mild, so deal with it). For some time, whilst struggling, I coped with the endless parking spaces for your fit parents close to the supermarket/whatever. I understand that parents with young children need a wider parking space in order to get out seats etc, and for safety of unaware toddlers. But they are fit. They have push chairs. Struggling pensionaries, not technically disabled, are having to park further away than comfortable. There should be a better balance",
            "I certainly would've ticketed her as well as had it towed if at all possible.  Absolutely no reason for this type of ignorance.",
            "My brother was in a wheel chair after breaking both legs. I’d drive him to physio and we’d get people being like “you can’t park here- it’s for the elderly” as I’m unloading a wheelchair. While I appreciate the spot being free (you can’t load a wheelchair in a normal spot) I also think everyone should respect the blue sign in the car. Just because it’s not visible doesn’t mean the person isn’t disabled. Invisible disabilities are a thing.",
            "Outlet villages are just malls who cant afford roofing.",
            "\"Me deal with it? Alrighty then. Consider yourself dealt with. Happy now?\"",
            "Don't leave us all hanging-what did she do when she found out?",
            "The cards of been dealt.  Fate has spoken.",
            "I so hate entitled people like that! They are better than everyone else. Any doubts? Just ask them, they will tell you!",
            "What a Dick",
            "Good for your friend.  Here in the US the fine can be up to $500 and can get your car impounded and cost another $150 to get it out.",
            "In Ontario, private parking lot fines mean nothing, unless they actually look for any cars they've given them to, and then tow them when they park in their lots again.",
            "Can't you have cars that block disabled parking spaces towed at the cost of the cars owner?",
            "We had a handicapped parking space in my street and it was regularly taken by a huge black SUV (extremely rare in Paris, France). The guy left his car for the night, and ignored beneath his notice the notes left on his windshield by furious local people who would try to find a parking for up to 40 mn while leaving this place free and find a SUV without a handicap sticker seating there. \n\nHe stopped parking there the day he found all four tyres slashed.",
            "Fun fact: in at least some parts of the US, tickets given by private businesses for parking on private property are unenforceable.  You don't have to pay, and nothing bad can happen except for them deciding to tow your car if you park there again",
            "Damn where’s the follow up. Her flipping out is the best part",
            "That's not malicious compliance, that's just doing his job. Good on him, tho",
            "As satisfying this is, this is not malicious, but rather normal compliance.",
            "This story was all over facebook yesterday, which is odd. Ending was that there was a cop nearby and when she walked out of the shop he walked passed her and said \"i dealt with it\".",
            "Amazes me that people are so lazy, they cannot walk a few hundred feet if not disabled. I would totally support having their car crushed.",
            "> as a parking enforcement officer. He is a decent guy.\n\nSorry, I don't believe it ;-)\n\nJ/K ... sorta",
            "I find this a little problematic - in that the person \"calling them out\" in a situation like this can be just as entitled. Sometimes people attack others for parking in disabled spots because they don't \"look disabled\" - which in itself is entitled policing. In this case it seems like they may have checked whether they had a parking pass, but thats not always the case - and people do harass others over this in an attempt to be holier than thou.",
            "Good story but none of it was malicious. He literally did his job with no added embellishment.",
            "private property parking enforcement tickets cannot be enforced in the US.  These would generally be confined to moving violations like speeding, running stop signs and reckless driving, not parking infractions.  \n\nIt is the case in the UK?",
            "Normaly I would be okay with it…",
            "And they do it on minecraft.net??",
            "Should have taken the air out of her tires and have chuld services take her kid away and throw her into guantanimo bay. Hope her life is nothing but anguish",
            "Wow, that’s a tiny fine compared to here (~$3-400).",
            "I love *with all due respect \".... 😉",
            "I sincerely hope this was Cheshire Oaks",
            "In the USA, that would include a tow fee + impound fees unless the driver moved the vehicle before the tow truck arrived.",
            "Here in Ontario it's a few hundred for the fine",
            "The Force was with him, that day...."
        ]
    },
    {
        "post_id": "ne8ln4",
        "author": "white_lady",
        "title": "You're going to cancel my vacation leave because I got sick? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ne8ln4/youre_going_to_cancel_my_vacation_leave_because_i/",
        "score": 13444,
        "num_comments": 651,
        "created_utc": 1621232659.0,
        "selftext": "This is going to be in the same vein as a lot of other posts here, but it still sucks that it happened to me. \n\n\nMy vacation leave credits expire next month, so I requested 5 days off hoping to go home to my family and get some rest. Only 1 them got approved, and it's in the middle of the week. Reasoning being that we're short-staffed, as usual.\n\n\nI suddenly had a very bad flare up of arthritis in the beginning of last week. I could barely sit up, and walking up the stairs to get to my workstation (I work at home) is out of the question. So I took a day off, and my boss said okay, that's fine, but we're going to have to cancel your vacation leave, since you're going to rest anyway.\n\n\nIt's not like I had any rest when I was writhing on my bed in pain. Spite empowered me and I managed to get to a hospital with the last of my strength (and my boyfriend's help) to get my fluids drained. I felt a lot better, but I was in so much pain in the beginning that my doctor seemed to take pity on me and gave me 5 days rest, and he told me to just contact him if I need more.\n\n\nI was only planning to rest it out for a day or two more, but I ended up having a whole week (or more if I feel like it) to myself feeling much better. I was even able to go home. The best thing is that it's all paid since I also have plenty of sick leave credits left and there's nothing they can do about that.",
        "permalink": "/r/MaliciousCompliance/comments/ne8ln4/youre_going_to_cancel_my_vacation_leave_because_i/",
        "comments": [
            "\"If you don't use your vacation days, you will lose them.\"\n\n\"Okay, I'd like to use my vacation days.\"\n\n\"I'm sorry, we can't let you do that, because we fucked up the schedule yet again.\"\n\nMakes perfect sense.",
            "In Australia, if you get sick during your holiday, you can turn your annual leave into sick, with a doctors certificate",
            "I worked for the biggest jerk. We were given 2 weeks of paid vacation. He neglected to mention that we have to take one week when he takes his own vacation, which could be in March or late October. Not  prime vacation times if you want to go to the beach, or anywhere else. We can take our other week whenever we want, but there's a catch. When you put in for your week off and decide to spend the time at home, when you get back to work, he bitches about how busy they were when you were gone.  He actually tried to not pay us for vacation because we had not gone anywhere out of town,  and we shouldn't expect those days to be paid. For the first time ever I can say,  thanks, HR.",
            "Wth are sick leave credits, if u het sick too much u just have to come to work sick or?\n\nAlso I hope your pain has lessened by now and things are going better again",
            "If it is practical for you to do so? Find another job as quickly as possible. That sounds like a toxic workplace environment.",
            "> Reasoning being that we're short-staffed\n\nThis stuff slays me.   If I've earned the time off, but you don't let me use it, what good is it? Then it's not one of my negotiated benefits. \n\nIf you're short staffed, that sounds like a management problem and since I'm not management, it's not MY problem. \n\nEmployers can be such bastards.",
            "Wage theft is a real problem in the United States. The 'job creators' have done a great job scaring us into believing we need them more then they need us. If all working folk decided to stay home for a week we would see how much power we actually have in determining how we are treated on the job.",
            "You are entitled to your vacation leave. Either they give you your time off or they pay you for the unused days.",
            "Wtf ate sick leave credits? Are you only allowed to get ill on appointment or something?\nI've seen these mentioned a lot lately and I just can't imagine how something like that would work.",
            "I had 28 days of vacation accrued over 18 months. I was told, with 30 days left, that I had to use them or lose them. I said, “I’ll see you in 28 days.” That didn’t fly, so I said pay them out, they could only do two weeks. Being in the Reserves at the time, I said, pay me in June for Reserve time. They said no. I said I’ll take 14 of these 28 days off now, or in June, you pick. They didn’t want to do either, but suddenly came around after the attorney’s letter arrived asking which option they wanted to take. I got double paid during my reserve time that summer.",
            "One guy made request and got approved for a couple days off vacation. Then out of nowhere the governor (state job) gave a day off randomly for some holiday they made up. \n\nWhen the guy asked about his vacation day, they said he already submitted it and didn't get it back. Dude lost a vacation day even though everyone got the day off. I'm sure it was illegal but how do you light the state doing illegal things? Tell the state? Lol",
            "My mother, God rest her soul, kept getting her vacation requests denied. One day she walks into her supervisor and tells him she will retiring in two years. He thanked her for the advanced notice. Then she told him she would be using her two years of accumulated leave starting tomorrow.",
            "In the UK if you get sick before or during prebooked Annual Leave it gets turned into sick automatically.",
            "I have been having shoulder pain. I asked for OFMLA ( Oregon’s version of FMLA) and got ignored. I have been out 3.5 weeks. Last week I finally said screw it and put in my notice. I am driving for DoorDash and going to work part time. I figure with my shoulder and mental health  being so bad, it was time to put me first.",
            "I once had a boss, that if you took a vacation day, and then said that you were feeling sick that day, he’d make you change your time to sick leave.  I should have figured out a way to play on that, but it was a gubbermint job, sick leave never expired and you could accrue annual for years before you were in use or lose.   He actually went insane a few years later.  He took a swing at his boss and was gone. Yay.",
            "We have one bank of all our time off. I had a coworker who had a vacation planned with her husband, and then was diagnosed with breast cancer and was off for surgery for a few weeks. Manager told her they'd have to cancel her vacation because she used all her PTO time for the surgery. She said fuck them and retired.",
            "\"We're short staffed\" = \"We haven't hired as many people as we need because we're saving money so the CEO can buy two more Bentleys.\"",
            "Girl, get on disability ASAP, I dare them to fire you. Which state do you live in? I can help you get on disability and a lawyer specially JUST for this toxic work behavior shit. I’m so tired of corporations fucking over people with disabilities like myself. Sue the fucking shit out of them like I did. The stress is causing your flare ups, make them pay for the pain and suffering they are intentionally causing on you.",
            "My favorite vacations, sarcasm, is when I was 1200 miles away from home and got called daily with issues and ended up working every single day of my vacation in the local library!",
            "Oh god!\n\nFive days starting with pain, pain, pain. That might be compliance, but it does not sound fun. \n\nSympathy to you, my friend.",
            "\"We fucked up by being insufficiently staffed so you need to bend your desires and comply with our wishes and in return we will not help you in any way shape or form. See you Monday.\"",
            "This happens for one reason and one reason only, it's because employees do not treat leave as money. When your employer gives you salary and benefits, it is agreeing to pay you for work with money and good stuff to have (the whole benefits part). If they stopped paying you, you'd throw a fit, same with medical or retirement. \n\nIt's quite simple, if your organization hasn't figured out ***its*** staffing issues, they simply need to pay out your leave, on the days you planned to take them. If they refuse, ask them, in writing to confirm they are cancelling your leave and why. Then let them know you will be informing the division of licensing and labor (at least here in the states). \n\nObviously if this is a one off situation, and they accommodate on lost time don't do this, but this is an easy habit for a company to get into. Simply don't allow it.",
            "I miss having vacation days AND sick days.\n\nBeach or hospital, it's all PTO now.",
            "In the US they call you while you’re in the hospital giving birth to come back to work.",
            "I am a paramedic in Quebec, Canada, so let's just say I was looking forward to my vacation time this year to forget what I do for a living. We had planned on blitzing the move since we decided to sell our family house and buy a small home by the sea. Thank god, our old home hasn't sold yet, because since mid april I have been dealing with what seems to be covid long hauler syndrome post vaccination. Don't get me wrong, even if this was 100% certain side effect, which it isn't, I would still get vaccinated.\n\nSo, the funny thing is, here, you can't be on vacation if sick. So i have been on sick leave since, and my vacation weeks will be waiting for me once I get better. Cost me two sick days and now on short term salary insurance. Your vacation time is supposed to be used as vacation here. Reading your experiences makes me feel lucky today, despite feeling tired 98% of the time and laid in bed 70% of the day, my situation could be met with harsher consequences.",
            "I'm glad you got to rest.\n\n\nThis kind of posts are just weird for anyone outside of the US tho. I'm in a third world country and even here everyone have 30 days paid vacation every year, and if it's about to expire, not your fault, you just take it anyway.",
            "I sort of love how these comments morphed into the rest is the English-speaking world flexing on Americans. \n\nI'm also crying now because I'm an American and is all true.",
            "I used to work for a state agency and when you retired you could either use up all of your unused time by retiring \"early\" or get a lump sum paid out at a PERCENTAGE of what the days would be if worked.  (Does that make sense? ) It's the same for our fire dept which caused an absolute uproar because the fire dept's schedule is 24 on 48 off and most people would just tough it out if ill or swap schedules with a different shift. Some people when they retired got like close to 50 grand USD. Or in the case of my ex FIL, he retired 3 months early.",
            "Hey, this must be against the law somewhere. If you requested the days and you're \"short staffed\" that's not your problem.\n\nEdit to say: I'm from a third world country, i could sue the company I work for if they don't give me my vacation days after I've requested them. Of course they can slightly alter the days to make them fit for scheduling issues. However, it cannot be skipped days if that wasn't my initial request. \n\nMy advise, keep proof of your requested vacation time and ask for responses in written. Then seek legal advice.",
            "I’ll never understand why some companies (small family owned businesses excluded) can’t just either carry paid leave over to the next year or at very least pay the leave out to the employee if they haven’t/don’t want to take the leave. \n\nAlso I’m so so sorry, genuinely, to hear about your arthritis. My mum has arthritis and osteoarthritis and I’ve seen how debilitating it can be. Sending love 💕",
            "What kind of backwards ditopian society allows companies to do this?",
            "Allowing people to \"lose\" vacation days is incredibly stupid. Not even legal where I'm from.",
            "What kind of evil company doesn't let you take YOUR days when asked-for in advance?\n\nHopefully they saw a doctor's note (which shouldn't be necessary) and you took the time you had previously requested.",
            "Always take care of yourself sister.",
            "That is horrible. Europe welcomes immigrants you know, also from US",
            "My boss spoke to me last year, (middle of pandemic) said I needed to take my holidays (seasonal work). Said I didn’t want to take any as I was enjoying the work. (Outdoors, fresh air etc). Found out it was to rain the whole next week, sent an email wanting that week off, and he happily gave me it. Did have to get me to take the rest a month later mind you",
            "I am posting this as an example of what could be as far as staff entitlements go.\n\n&#x200B;\n\nCurrent Australian Public Service leave entitlements, for Department of Human Services, are as below (I retired in 2011, at age 46):\n\n23 days annual leave,\n\n18 days personal leave, (sick, carers etc)\n\n14 weeks Maternity Leave (28 days at half pay) \n\n2 weeks Supporting Partner's Leave ( conjunction with Mat Leave)\n\n12 weeks Long Service Leave (after 10 years service)\n\nAnd many more.\n\nLeave conditions start on page 53: \n\nhttps://www.servicesaustralia.gov.au/sites/default/files/2017/11/dhs-agreement-2017-2020.pdf",
            "How can your company refuse you use of vacation time that will expire next month if you don't use it? Is that even legal?",
            "I had a job where one of the group in the office was obviously sick and requested to go home.  The boss refused and he stayed.  So 4 more of us got sick and missed multiple days.  Idiot managers.",
            "If the doctor gives you 5 days and you can take 5 days, then take the 5 days.",
            "I wonder why they're short staffed? /s",
            "Bravo!",
            "Sounds like your boss is the one doing MC. I bet they knew this would happen.",
            "The whole notion of sick days will feel downright caveman to kids entering the workforce in the next 5-10 years, it already does but the employers - the old ones stuck in \"their ways\" - seem oblivious yo the fact that the world is running past them. I have a friend whose company lost 70 emps (at the order of I believe 800) last year simply due to the fact that the two guys running it insisted on office presence for non-essential staff at every corner of the pandemic. My friend, who became a dad in June last year, had to fight, tooth and nail, to avoid having to be back in office in Jan, then again in Feb, arguing that he be exposing his baby son to a risk of contracting something his immune system cannot yet fight. Imagine 2021 America in which (in a highly paid computer based white collar position) you have to fight for the ability to work remotely in order to not risk exposing your child to a deadly virus?",
            "America is so sad",
            "Whatever country you're in has horrendous labour laws.",
            "You internalized capitalism pretty well, if you think taking sick days when you're sick is malicious compliance.... (and I totally catch myself feeling the same way).",
            "You monster!",
            "My work doesn’t accept doctor’s notes.",
            "This is beautiful.",
            "You need to take another week. Fuck that guy.",
            "Seems like you should go on that vacation anyway, they short handed as is, cant afford to fire you, and ofnthey do, good find a better job",
            "It would be illegal for your employer to not let you use to holiday allowance in the uk, they might refuse to let you take them on the specific days you want them, but they would have to offer you alternatives. \n\nSurely that can’t be legal?",
            "If you have State Disability Insurance (SDI) you may be eligible for that! You can often backdate to the beginning date of your illness. Talk to your doctor’s office staff about it.",
            "Here in Brazil, you get 2,5 paid vacation days for every month you've worked with a company, for a grand total of 1 month paid vacations every year. Companies usually make you work the first full year and then you can get vacations, depending on the company and what it works with, you can split it in smaller periods, no smaller than 10 days according to the law. Lots of people take 15 days during winter and another 15 during summer. My previous job just flat out gave me a full month of vacations whenever my turn to take them came up. Oh and if you don't want to take the vacations, the company can buy them out, but only if you agree to it writing.\n\nOh yeah, and on top of that, when you go on vacation you get a +33% bonus pay for that period. \n\nAs for accumulating vacation time, it's not a thing. It takes a year for you to acumulate 30 days paid vacation, and the company, legally, has to give you that vacation time within 1 year of you acumulating that vacation time. If you haven't taken those vacations by the time you've acumulated another 30 days, then the vacation pay for the first period is doubled. Mind you, this is in our labor laws.\n\nAs for sick days, the company is responsible for paying you the first 15 days of your sick leave. If it happens that you doctor says you need more than 15 days for sick leave, from the 16th day onward, the company will send you off to Social Security to see about getting you in disability. Two important details though:\n\n1. If your disability leave is due to a workplace accident, or a work related illness, the company, legally can't fire you for a year when you'e back from disability;\n2. If after you're back from disability and you get another illness or health issue, for a completely different cause, the whole process starts over again.\n\nI don't get it what's with the US and this fetish of working overtime, and weekends, and not being able to take sick leave or vacations or anything. Say what you will about Brazil and it's crime and general chaos of things and all that, but our labor laws are really biased towards workers.",
            "Yeah, when admin decides to start a Petty-war, the house always loses.",
            "\"Sick Leave Credits\"\n\nConfused European Noises.",
            "I can sort of relate... It was day 2 of a 10 day out of state vacation when my manager texted that I was expected to be in the office on Monday (which would have been day 5 of said vacation) because a team members father unexpectedly died... and another team member unexpectedly quit on Friday.  \n\nCancel my vacation because of things completely out of my control? Okay 🤦‍♀️🤦‍♀️🤦‍♀️",
            "Use it or lose it leave is disgusting.",
            "People at my job don’t seem to understand that paid time off is part of your compensation for doing your job. My boss tried to tell me she/he only gets paid out for 40 hours a year of the 160 she’s/he’s entitled to and that “we’re all tired”. They never take time off and expect me to be happy that only 2 of my days got denied. \n\nCorporate has this excellent unlimited sick time policy that makes up for those days.",
            "Just take as much sick pay as you possibly can and then ask for your holiday days later. You earned your holiday days, they can't not let you use them. They have to pay you the monetary value if they are not used \n\nOh wait... You're in the USA :/",
            "Hey try applying for an ada.",
            "Okayyy, buuut... where's the malicious compliance??\n\n'Complying with a request in letter but not in spirit.'\n\nSorry, don't see it.",
            "'Murica. The greatest country in the world. /s",
            "Lemme guess.. you're american?\n\nLeast you can carry a weapon though",
            "What do you mean sick leave **credits**? You could be denied sick pay if you spent these credits?\n\nSounds odd. If you’re sick - you’re sick, you should be compensated no matter how sick you were before.",
            "This story reeks of military, lol.",
            "So to be clear... you work from home but couldn't get your boyfriend to relocate your workstation (a computer?) downstairs?",
            "Sick leave credits?",
            " Exd \nNTN",
            "V",
            " R  r I",
            "I am so happy for you. Fuck them.",
            "[deleted]",
            "I am just wondering when \"sick-leave credits\" become a thing in germany.",
            "Many places have the use it or lose it because of these situations where someone takes of Friday for a year, gets paid for x number of days months when they retire or pays it out yearly. It is good for people to take vacation time. It is also budgeted yearly. If you have to pay someone say months in a single year, you will either be short handed or over payroll.",
            "Capitalists in a nut shell.",
            "If you call in sick in the week preceeding or following a leave period, my employer stops your holiday pay."
        ]
    }
]