[
    {
        "post_id": "ga43dv",
        "author": "justgnnathrow",
        "title": "“Guests cannot spend the night at my property.”",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ga43dv/guests_cannot_spend_the_night_at_my_property/",
        "score": 13430,
        "num_comments": 363,
        "created_utc": 1588140658.0,
        "selftext": "Back when I was in college, I lived in a 2-bedroom apartment with a nice German student. \n\nHe was a nice guy, and he would often have his friends over. I didn’t mind it at all because I just moved to the are and needed new friends anyways. \n\nOur landlady though, she was a nightmare. She was this small grumpy lady who would complain over the smallest things. She doesn’t live with us, but tries to control everything - the color of our sheets, the scent of candles that we light, where we put our stuffs, etc. Needless to say, we hated her.\n\nWe pay for our electricity and water, so it doesn’t matter if we have our friends / family stay over once in a while because whatever they consumer more of we will foot the bill ourselves anyways. \n\nMy sister visits me once a month for one night, just whenever she’s in town. One day, my landlord found out and got so mad she wanted to call the cops on us for not respecting the rule of “guests cannot spend the night” at her property. \n\nThe only reason she does this is because she feels if a guest would stay a night they would have to pay her the full rent for the month. THE MONTH. \n\nBut que malicious compliance...\n\nWhen one of my German roommate’s friends was laid off from his main job, he was left homeless with only a grave shift part-time job. He asked if he could stay with us for about a week or two. I told him I didn’t mind but my landlady might mind. They told me not to worry. \n\nAnd she was fuming when she found out (easily, the day after he decided to stay with us because she checks on us unannounced every other day, and has security cameras outside our door). She threatened to call the cops on us again, and all my roommate said was:\n\n“But you told us explicitly no one can spend the NIGHT at your property. He is never here at night because he’s working, so there’s no rule broken here.” \n\nShe had nothing to say and left. We could hear her screaming from inside her car that was parked right outside.\n\n\nEdit: I had to pull my copy of the contract out, and we didn’t have a specific clause on overnight guests, nor do we have a clause on visits. It did say at the end though that whatever isn’t explicitly stated, when questioned, will pivot on California state laws. So this was totally illegal. My roommate and I were just young, stupid international students who let her get away with it. But it definitely makes for a fun story though.",
        "permalink": "/r/MaliciousCompliance/comments/ga43dv/guests_cannot_spend_the_night_at_my_property/",
        "comments": [
            "I dont know where abouts you are in the world, but what your landlady is doing sounds highly illegal. It would definitely be in your interest to know your rights for where you live.",
            "I had a landlady like that when i had a small room during university.\n\n&#x200B;\n\nThe easiest fix was getting a \"keyway lock\" that you could insert into the cylinder. She complained about it the next day.",
            "Umm yeah she sounds like a real delight... you may have to check into the legality of those cameras though, especially since she is using them to spy on you.",
            "I'm still amazed that landlords are allowed to make unannounced visits to their tenants homes in some countries.",
            "I'm pretty sure it's illegal for a landlord to make surprise visits. At least in most countries I've experienced the landlord needs to give a 2 week notice.",
            "She sounds like she has nothing good going on in her life",
            "I just know that my landlord has in his contract that if somebody stays for more than 2 weeks then they are considered a resident and must pay rent. But if it’s not in ur lease and people are only staying for a few days ... def not legal.",
            "Man I know what you mean about crazy landladies. \n\nMy **first** landlady was a \"Reverend\" (she wasn't), who asked me if I was into *satanism* before I moved in. (Should've been a red flag but rent ain't normally **that** cheap where I was moving). \n\nHere are some tidbits about my time with her:\n\n1. she was extremely racist. Didn't like asians, mexicans, or blacks. (She was, herself, black.)\n\n2. She accused me of trying to make her son's plane crash with voodoo because I was stupid enough to ask her who was the person in the picture nailed up outside my bedroom\n\n3. She did a 2 hour sermon to her living room every day. This was the only time it was safe to leave your room as she wouldn't stop for **anything**, but would glare at you the entire time you walked by. \n\n4. She accused me of satanist-feng shui-buddah crap on **NIGHT ONE** because of how I arranged my groceries in the pantry. \n\nhaha, fun times, I hope never to see Mad Margaret ever again.",
            "Qué?",
            "I had a previous landlady who would pull the same crap. I was in an apartment complex and would often have a friend who was transitioning at the time from female to male that stopped by and hung out with me and my daughter. She had a service animal that she would bring with her when she visited us. Her visits were usually only a few hours at most and then she would leave again. Never stayed the night. While she was visiting, my daughter would walk her dog for potty breaks.  \nMy old land lady started playing 20 questions with me about if my \"friend\" stayed the night *hinthint* and how we couldn't have the dog over without paying a pet deposit and how she was going to raise our water/sewer bill which was based on occupancy if we kept having any guests.  \nI pretty much pulled out the lease, printed out regulations in regards to service animals and went to her office to legal her to death. She dropped it after that.",
            "I'm dealing with a b-tchy landlord now. I live in a RV park and when we first moved in we were informed that rent (all included) would be $400. In two years we were never late, never a problem, and even made things for our Land Lady (Becky). Now fast forward to April 1st, and I am told rent went up to $450, for May? Is this my 30 day notice?, nope for April. Now this news was dropped on me not by Becky but by Tiffany. I told Tiffany that the law requires they give me 30 days notice and she yells at me\n\n\"I taped it to your door\" \n\n\"where is the proof?\"\n\n\"What do you want? For me to take a picture? If you dont like it then get out!\"\n\nSo stupidly I paid the extra $50 but she got an earful about her behavior. After that Tiffany would call my husband about things and not me. Which is stupid because he is a truck driver and never home. Now I get a letter on the door saying they are postponing the rent increase until June and I will be credited the $50. \n\nWhen I do pay the rent in May, I will be showing her how a contract/changes to contracts is suppose to go.",
            "Hahahahaha finally a malicious compliance I agree with. Last sentence made me laugh.",
            "I was wondering where this was - then I saw CA- Realized crazy landlord is in violation of many CA residential rental laws. 24 hour (written, if you chose!) notice before coming into your living space, the security cam business of checking your comings and goings might be invasion of privacy, as nothing she is doing with that has any bearing on your rental agreement.  \n\\-SoCal resident  \n(edit- words)",
            "Thank you for not making any disclaimer/apology for your English. Grice's razor.",
            "[deleted]",
            "I so badly want to know what *her* place is like. Probably a rat den.",
            "Your landlady is definitely breaking the law. You have renters rights. She cannot visit without 24 hours of notice in advance, and she cannot set up security cameras without your consent in writing.",
            "Landlady is invading privacy you can make them give multiple day notice. Don't deal with shit from her.",
            "For california she is harassing you way more than is allowed.\n\nFamiliarize yourself with the law and start suing in small claims court. When she realizes that judgements against her for abusing tenants will be on her credit report, she may think twice.\n\nIt has work with landlords in the past.",
            "> ...because she checks on us unannounced every other day...\n\nI can't imagine that's legal in California. Do landlords not have to give reasonable notice before entering the property (e.g., 24 hours), unless it's an emergency?",
            "Where I live, the place you rent is essentially yours. The name on the ownership may be the landlords, but while you pay rent, it’s considered your house. The landlord cannot just come over without notice and can be removed if the renter so desires. Damage deposits are illegal and are referred to in the bylaws as “Keymoney”. I’ve had to use that clause a couple of times. Also, pets cannot be used as a reason not to rent to you. \n\nLooking into your rights under the laws in your area is a great idea and helps protect you from unscrupulous landlords.",
            "My crystal ball sees a grease fire in your future, probably as you are making your last trip out the door with your stuff.",
            "Your landlady and my landlady would've been great friends! Sadly mine was my biological aunt...",
            "[deleted]",
            "I've rented from \"land ladies\" and from \"faceless corporations\".   There are advantages and disadvantages to both but I'd rather rent from someone who doesn't care about much except that the rent is paid and who understands basic laws like \"24 hour notice\".       \n\n\nOne time we were renting a house and the land-lady's husband showed up unannounced and cut down a tree in the back yard without ANY prior warning or discussion.  My wife found out when she walked out of the shower and into the bedroom and saw him standing (back toward her) in the back yard!!!     \n\n\nI had a chat with the land lady and explained \"Yes, it's your tree and you have the right to cut it down but you just can't come onto the property without 24 hours notice.\"  I did go on to say that I'm pretty relaxed and if they did want to come on with less notice I'd be reasonable.    I did think about it later and it's possible they could have been completely wrong to cut down the tree in a couple of ways.",
            "I believe she would be violating your right of quiet enjoyment.",
            "Such sweet beautiful malicious compliance 😈",
            ">the color of our sheets\n\nwat",
            "Depending on where this was, almost all of this was illegal for her to do...",
            "Yeah, most states have a law saying that a landlord must give 48 hour written notice that they are going to enter a property that you are leasing from them.",
            "What a fucking bitch. People like this make the world a worse place. I hope she gets run over by a cement truck.",
            "I had a landlady who decided my apartment should be the show apartment for some reason, and got annoyed with me because I never fully unpacked. I was only staying there for two months and didn’t feel like unpacking all my stuff so I had some boxes stacked neatly in my bedroom. One time she came in to tell me she was going to be showing the apartment in a couple hours. My sisters had spent the night and we were in the process of cleaning up after breakfast. She says to me, “Get this place cleaned up and NO RELATIVES!” Then left in a huff. Like, we were literally washing dishes, and this is my place, I pay rent, I can have people over? Pretty sure now she was breaking laws.",
            "It still boggles my mind that people are so clueless about their rights.\n\nAs long as you're paying rent/the contract is running, it's YOUR home, not hers. You only have to let her in for valid reasons (showing the apartment to new tenants after you gave your notice/shortly before the contract is up ; repairs ; emergencies) and all of that only WITH notice (unless it's an emergency, of course). She isn't even allowed to own a key to your apartment.\n\nCameras only MIGHT be allowed on the outside of the house, not in the stairwell.\n\nAnd she can't make many demands on HOW you're living either. Just the basics like “don't destroy the property“ and “don't do something that severely disturbs other tenants constantly“ (e.g. charcoal grilling on a balcony, no big/loud/dangerous animals/only specific groups of people as tenants - seniors, students, no kids...).",
            "I rented a home in Laguna for a month from a psycho family. A friend visited with a tiny dog for 20 mins and they kept my $1800 deposit. I always felt they had cameras everywhere. They would come in with their son named Maverick ( yes) so he could swim in the pool! It was awful",
            "For real tho, I've never had a landlord who was perfectly ok with me having guests, even my mom coming over for a few hours to hang out has caused an issue. Whether it's some bs about parking or the landlord is bored and power tripping, it's always an issue just to have another human being over for a few hours to keep me company. Can't wait until I can afford a plot of land that I can build a little cabin on and live out my Stardew Valley dreams.",
            "German law is quite clear here. Until 6 weeks a guest is ok, without paying.",
            "Oof I feel your pain, woke up to a surprise midnight inspection once. The best part? I had decided to sleep naked that night. Good on you for standing up to her!",
            "Agreed, I wish they’d spend their time?",
            "Plot Twist: There’s the official tbh",
            "Ugh, sorry you had to put up with that hell-beast. *HUG* Most Americans are perfectly decent.",
            "\"Oh my god slasher is FUMING",
            "I hope you're a lawyer now",
            "I'm glad you got your head on right with this legal stuff lol r/legaladvice would be having a stroke lol\n\nAlso, perfectly done! Nice job! =)",
            "Wow, she sounds exactly like the landlady I had when I was living in San Bernardino. All the way down to the controlling and stopping in whenever she damned well pleased.",
            "She gets what she deserve",
            "What was she expecting the police to do? Surely they would consider this a civil matter. Any Germans in the house that can advise on this.",
            "Too bad that you didn't take her to court.",
            "Ive been reading all these MC stories with a wide grin on my face but if there's one thing I've pulled from this, it's landlords should be the first to go during a purge",
            "bye reddit -- mass edited with redact.dev",
            "lmao",
            ">Landlord/property manager can be charged with murder",
            "Que is not a word. You mean cue. Really beyond me why people get this wrong.",
            "*queue FTFY",
            "[removed]",
            "> Live in someone else's home after accepting their rules\n\n> Outraged about the rules\n\n> Don't respect the rules\n\n> Post on reddit for karma\n\nDae landlords suck?"
        ]
    },
    {
        "post_id": "c9obxx",
        "author": "None",
        "title": "You’re not sick, if you get up from your desk again you’ll be in trouble...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c9obxx/youre_not_sick_if_you_get_up_from_your_desk_again/",
        "score": 13418,
        "num_comments": 429,
        "created_utc": 1562379346.0,
        "selftext": "1st grade, I was feeling very sick. I went to the nurse, she took my temp, it was normal, she sent me back to class. I did this three times that day. The last time she and my teacher made a big fuss. Said I didn’t have a temperature and they wouldn’t call my parents and that if I left my desk again I’d be in trouble.... so first grader me starts feeling very nauseous. eventually I couldn’t hold it in anymore and I threw up onto my desk. it splashed back onto me and my fellow students on either side of me, both of them threw up out of disgust, along with 4 other students. 7 kids were sent home because they threw up when I threw up... my teacher asked why I didn’t go to a trash. I reminded her that I was forbidden from leaving my desk again.",
        "permalink": "/r/MaliciousCompliance/comments/c9obxx/youre_not_sick_if_you_get_up_from_your_desk_again/",
        "comments": [
            "My son has chronic stomach issues.  I try to let his teachers know at the beginning of each school year.  This past year one of his teachers decided he was making it up.  That is until he threw up all over her; twice.",
            "Why do so many people think no temp = healthy. You can have so many issues that doesn't make a fever.",
            "Same sort of story for me, I had horrible migraines in middle school to the point where I would throw up. I went up to my history teacher’s desk, I told I needed to go to the bathroom because I have a migraine and I might be sick, he said suck it up. It came out of my nose al over his desk because I tried to hold it in.",
            "Lol. Something similar happened to me. I was sitting in the office waiting for my mom and asked to lay down or I was going to be sick. They didn’t want to pull out the cot so said no. I was sitting next to a desk full of very important looking folders...puked allllllll over them. I gave them warning...",
            "Similar story, except my mom made me go to piano lessons even though I told her I was feeling sick. Guess who puked on a beautiful grand piano (and in my piano teacher’s kitchen and bathroom). \nTo make it worse, we had a meal with beets in it, so the puke was purple/red.",
            "My mom has a similar situation when she was in 3rd grade ; the legend says when the teacher wouldn’t let her go to the restroom she promptly walked to the teachers desk where she was sitting and opened her mouth as wide as it would go and then just barfed all over everything ; herself, the teacher, the desk adjacent, tons on the floor\n\nCouple a mad lads you two",
            "I have an opposite/wholesome teacher story related. \n\nI was in 6th or 7th grade and in class. We didn’t have solo desks, we had shared tables. I wasn’t feeling too great and decided to rest my head on my arms. My teacher called my name so I lifted my head so she knew I wasn’t just sleeping in class. She immediately looked worried and asked if I was feeling okay. I told her I was feeling kind of light headed and clammy. She told me to go to the office because I literally looked green. When I got there, they called my mom to come get me and had me sitting in a chair. Not 5 minutes before she got there, I told them I needed the bathroom and rushed to throw up. Luckily, I made it to a toilet and was okay. \n\nWhen I went back out, my mom was waiting to take me home. The office gave me a garbage bag in case I needed to throw up again in the car. I got home and immediately went to my bed. My mom brought me a trash can, some crackers, and a bottle of water before going back to work. I was mostly fine the rest of the day, but that’s how I found out that not eating enough plus not enough sleep makes me nauseous.",
            "A complete and total barf-o-rama.",
            "This makes me so mad, people in authority not listening to those they’re supposed to care for.\n\nI have an adrenal condition that makes me collapse and convulse. The only warning is an internal feeling that I’m losing grip in reality. Told my manager I needed to take a break ASAP once. He told me to wait for a cover, I didn’t look that bad. Collapsed three minutes later and was in the hospital twenty minutes after that.\nI don’t work there any more.",
            "I threw up all over a baby once as she smelled like stale milk and that used to set me off something shocking. I was about 13. I told them I’d rather not her, I was feeling very sick, They gave me the baby to look after and hold while they ate lunch, next minute I puke all over myself and baby. 😂",
            "I started getting migraines really bad around the time I hit puberty. The lights would hurt my eyes, I would feel dizzy, and the only way to make my head feel any better was to puke. \n\nI was at school and felt a migraine start. My dad gets migraines so he believed me, but my mom thought I was trying to get out of school and said to tough it out for the rest of the afternoon. \n\nI sat in that bright fluorescent class room feeling worse and worse, until I felt sick. I ran out into the hallway and puked on the floor. It was beyond embarrassing, but at least my mom and teachers believed me when I said my head hurt after that.",
            "Made me smile",
            "When in secondary school as a teenager, there was some homework I hadnt done and i knew i was going to get shouted at.\n\nDecided to tell my dad I was sick, he didnt buy it amd sent me to school anyway.\n\nGot so anxious on the way walking to school I threw up about 100 meters away.\n\nDad picked me up and felt really bad for sending me in.\n\nHe went to work, I played the N64.",
            "This reminds me of 5th grade when I threw up on the kid sitting next to me during story time. Bjorn, if you’re reading this, sorry man.",
            "[deleted]",
            "This reminds me of my 6th grade teacher. I asked to go to the bathroom, told him it was an emergency. He looked at me all skeptical \"you can go after you solve the punnet Square.\" I solved that bitch and turned to the trash can behind me. Well my damn teacher had decided to stand in front of the trash can, so I threw up all over him and his shoes. He told me to go to the office. Everyone hated him, it was glorious!\n\nEdit: spelling and corrected the grade.",
            "My mother made a similar mistake. \n\nI wasn't feeling well when I was about 4/5 so my dad took my temperature, took one look at me and sent me back to bed with a bucket to throw up in just in case. My mother stormed in about 10 minutes later, dragged me out of bed by my arm (which bruised) and made me get ready for school. While I was getting ready I heard my parents arguing. My mother was screaming that I was faking it and my dad was loudly saying my temperature was high and I looked a lot paler than normal. \n\nSo my dad took me to school with the bucket just in case. I go in and we're having a very important test that was one per student with a specific code on it. (It was some kind of government issued test no idea what for.) I get mine off my teacher. She asks if I'm feeling ok and should I really be in school. When I say my mother made me go in, she rolls her eyes and hands me the test. She says because this test is so important nobody can go to the toilet during it. Usually we could go whenever we wanted. She said at 9:00 that we could start. 9:02 I threw up all over my paper, the other 3 people's paper on the table, and on the floor. My teacher comes over full of concern and starts taking me to the school office to go home. My dad hadn't left the carpark and was waiting for me to be sick. \n\nI sat in the back of the car with the bucket on my lap the entire way home. When I got home I took one look at my mother and felt pure hatred. I went back to bed and slept the rest of whatever bug I had off. I woke up to my parents arguing (again) and my mother leaving the house. Sadly she came back. Me and my dad went out for ice-cream when I felt better.",
            "Used to have to leave a lot year 11 year 12 certain classes, office got sick of having me but I was suffering vertigo from moving my head. Classes where the teacher would often move or require constant motion used to be horrendous for it. Took us a while to figure out what was the cause and why certain classes set it off. \n\nNo vomit, but dizziness and associated sea sick sensation if I didn't get to lie down",
            "This actually happened to my class but kindergarten. It ended up with all kids throwing up and we couldn't go to class the next day they needed to clean it up lol.",
            "A similar thing happened to me in year 2. My teacher wouldn’t believe me when I said I was sick. I vomited on her shoes.",
            "I have endometriosis and in HS it was particularly bad where I would be incapacitated on the first day of my period. It was safest just to go home at the first twinge of it coming. I went to the nurses office for that purpose and the nurse tried to send me back to class but I called my mom and she picked me up immediately. Next time it happened the nurse wouldn’t let me call my mom, because, “it was just period cramps”. Sent me back to class. Two hours later she had to come physically pick me up off the ground because I had vomited and fainted in class. Guess who was perfectly sweet and practically pushing me out the door when I came back next month to ask to go home?",
            "Because everybody knows that you can't be ill without a fever!",
            "When I was in 7th grade we had a male teacher that would punish us by taking away bathroom privileges. One day a girl begged him to let her go to the bathroom. After being yelled at she sat back down at her desk. End of class came and her desk chair was covered in period blood and she requested to go to the office. That was the last time that teacher withheld bathroom privileges",
            "3rd grade teacher refused to let me call my mom to go home despite my complaints of nausea. I was a good student. Never got my name on the board, much less the dreaded check mark... So I'm not sure why she distrusted me. Opened my social studies textbook to find we were doing a chapter on agriculture in which sweet potatoes were prominently discussed. ( At the time, I detested sweet potatoes ). About three sentences in, after staring at a picture of said spuds...I vomited all over my desk. I of course was immediately sent to the nurse only to discover I was running a 103 temperature. I'm not sure I've ever seen my mother so mad as when she was yelling at the principal when she came to pick me up.\n\nTo this day, I remember that teacher as the worst of my school career.",
            "If a kid says he's going to throw up, believe them the first time.  It saves a lot of cleaning.",
            "I hate mashed potatoes. My Dad told me to eat mine and \"clean my plate\" as a child. I told him that I hate mashed potatoes and I am going to throw up. He threatened to spank me and made me eat the two spoon fulls that was left. I did so then I immediately walked to the sink and threw them up. Never had another bite of potatoes in my life.",
            "Chain reaction throwing up.",
            "My mom went in on meet the teach night and told them \"I know a lot of kids say they don't feel well to get out of things.  U/PaleFlyer, you have 30 seconds to hand him a trash can.\"\n\nNever had an issue.  Especially since I proved it ~3 times a year.\n\nNo one ever actually figured it out, ran me through allergy meds, eventually got tired of it in 8th grade, got tested, mildly allergic to hickory tree pollen.  Got off the meds.  Haven't had more than a 24 hour bug since.  (Excluding a 48 at my second man job, because I was overworked, over stressed, and took crap care of my body because I was working crazy hours.)",
            "The real butterfly effect is right here",
            "Hopefully the teacher was the one who had to clean up the mess and not some poor janitor.",
            "I experienced almost the same thing in first grade \n\nWe were playing some game around our desks and I got back near my desk and just made a big ole barf puddle on the floor",
            "Ha, I had a similar thing happen to me in 2nd grade. Teacher was strict about nobody getting up from their desk and she already didn't like me for some unknown reason. Teacher was out of the room, instructed us to stay seated, and I started to get tunnel vision/overproduction of saliva, the tell-tale signs of the ol' stomach geyser.\n\nI did what any logical 2nd grader would do. Sat in my seat, threw my hand up in the air to ask the non-present teacher if I could go to the bathroom, and proceeded to spew the contents of my stomach all over the desk in front of me.\n\nGood times!",
            "Similar story from 3rd grade.. kept me at school all day until I collapsed in pain and threw up everywhere. My appendix nearly burst. Good times.",
            "Similar story but I didnt get to actually maliciously comply. Sophomore year of highschool, study hall. I ask to go to the bathroom, teacher asks if I have my passbook, I say no, she says I can't go. I wait 5 mins, ask again and get the same answer. This time I just leave and go to the bathroom. When I come back I get the earful, I told you you cant go blah blah. \"Okay. Next time I'll poop in your trash can.\" Teacher doesn't reply. The next day before class she pulls me aside and apologizes. Idk if she actually felt bad about it or if she just knew I was the type of person that would actually poop in her trash can if given the opportunity lol",
            "I witnessed this exact story I swear. Mrs. Laughry’s (loughry? It’s been years) class?",
            "I did something similar, also in 1st grade, we were told we'd fail a test if we got up, so I threw up on my desk, no one else threw up, but the other kids were horrified",
            "I had a story like this where I repeatedly asked to leave and my teacher kept saying no because she didn't believe me. After a while my teacher froze in the middle of speaking because she saw how pale I was and asked \"are you actually sick?\" as if my answer would change. She then yelled at me to go to the bathroom. \n\nI get up and start puking as soon as I'm through the door. I tried to hold my mouth shut but it kept coming out so I literally left a trail of puke down a 100 meter corridor.",
            "Now that’s what I call a chain reaction",
            "Did you have a stomach condition or anxiety?",
            "The same happened to me in year 3. The teacher wouldn't believe me when I told her I was sick all day - weirdly enough, because I had never faked being sick up to that point.\n\nI made it almost to the end of the day, I think I was within an hour of finishing school when I couldn't hold it back any longer, I projectile vomited on my desk and the boy in front of me.",
            "Same thing happened to me as a 1st grader. My mom have me a bologna sandwhich on the driest bread known to man, and forgot to pack me a drink. So I didn’t want to eat it. The 8th grader, I forget what they are called. Lunch monitor? Student supervisor? Babysitters? Whatever, forced me to eat it. I told her I can’t withhout a drink. So instead of either telling me I didn’t have to eat it, or giving me a drink, she forced me to eat that dry ass sandwhich. So I made sure when I threw up it was all on her. I got to go home and she cried as I yelled I “told you!” At her. She stopped being our lunch person after that.",
            "I did this in 3rd grade. I had a stomach ache and was gonna throw up. Told my teacher and she sent me to the nurse except the nurse had an odd shaped therapy chair that's curves so laying on it only makes me throw up more. The nurse told me to just relax. I told her I needed to throw up. Didn't even give me a trash can just sit in the horrible chair and power through it. She walked out the room and I ended up throwing up on the carpet underneath. As soon as I did that my mom arrived to the school and signed me out. I just got out as soon as I can. That was a stressful day",
            "There's still a stain on my parents' living room carpet from a time where they refused to believe that I was about to throw up and felt too sick to get up and run to the bathroom/trash.\n\nAlso in HS there was one instructor who tried to be Daddy Hard-Ass and refused to let students so much as get up to get a tissue and blow their nose. One brave, gross student with allergies  started horking snot directly onto the floor, loudly tried to crumple paper and blow their nose into that, etc. We were allowed to get tissues after that.",
            "What did she say after you told her about being forbidden?",
            "Haha before I saw what subreddit this was from I thought I was about to read a r/nosleep story.",
            "Damn you savage!",
            "\"You told me not to move. Now get to cleaning this up, bitch\"",
            "Similar thing happened to me but i needed to pee. It was the beginning of the day in 3rd grade and we had a bell ringer i had tried to finished but i had to pee SO BAD i couldn’t concentrate. I asked my teacher 3 times and she said no and accused me of procrastinating so i could just get the answers when she went over them. She also told me to stop acting like a little boy because i was holding my crotch. I ended up pissing myself in my chair and she was SOOOOOO nice when my mom came to get me. She apologized so many times. I wish we had sued that bitch.",
            "I had a pe teacher that wouldn't let me go home because there was only half an hour left in that class (this was probably 1st or 3rd grade). I had been out an entire week with stomach issues. It was square dancing day... so when I threw up, it was all over the other 8 people in my group. \n\nHe did get a nice reaming out from my teacher... and then my mom. He was a dick for other reasons too, so I dont really feel bad.",
            "Ha I did this during lunch, we weren’t allowed to leave the lunch room unsupervised. I asked to used to the washroom cuz I was about to be sick. The teacher said no go sit back down and wait for the bell. I projectile vomited all over the floor after waiting two minutes and said well I told you I needed to go to the washroom. So funny. She felt so bad.",
            "In 6th grade, I had a stabbing pain in my stomach. My mom drove me to school and told me if I didn't feel better by lunch to have the nurse call her.\nI didn't feel better by lunch, went to the nurse who took my temperature. No fever. She refused to call my mom. My stomach HURT, I wasn't nauseated, I was in pain. I argued with her to call my mom. She still refused, but said I could lay on one of the cots they had for sick students.\nAbout 30 minutes later I ask to use the restroom. She let me. I went back to the city, sat down. I got a weird feeling in my throat and I got up to go to the restroom again. The nurse told me, \"you just went to the restroom, you need to go lay down!\"\nI went back, sat on the cot, threw up, and called the nurse in. She asked why I didn't go to the bathroom. \"I tried, but you told me to go lay back down.\"\nThey called my mom and I got to go home. I felt 100% better after vomiting, so I had a great rest of my day at home playing N64.",
            "11th grade history teacher was a stickler for raising your hand and waiting to be called on for everything. One day I was feeling nauseous, so I asked I raised my hand and started to ask to go to the nurse. I was stopped and told to wait my turn. A minute later he called on me and I quickly asked to go to the nurse because I wasn’t feeling well. He rolled his eyes, but let me go. I only made it to the trash can before ralphing. 1 other student threw up too and 3 others asked to go to the nurse because they were now feeling nauseous from witnessing it.",
            "I'm actually really bad at realising when I'm sick. I try to muscle through the minor pains and next thing I know I'm rushing to the bathroom in the middle of lunch and toss it all up halfway there and get sent home. teachers watched me closely for the rest of the year after that. good school, wish my secondary school had been as nice.",
            "This is literally that one family guy episode.",
            "I'm curious as to exactly what percentage of posts in this sub involve vomiting.  It seems quite high.",
            "While reading this, I pretended that your teacher was my 3rd grade bully teacher which made this story so much more satisfying. Good job 6 year old you",
            "Why is a fever considered the sole criterion for illness? Stupid.",
            "When i was younger i was really sick in the morning before school. After lunch i was so freezing to the point of shivers and i put my jacket on and a friend let me borrow his and didnt warm me up at all. I threw up all over the nurses office and was picked up by my uncle. The next day at the bus stop my moms friend was like i heard you said u were sick bc you wanted to stay home and i was like no bitch i threw up.",
            "This reminds me of when I was in school in 1st grade. We were told not to leave the computer when we were taking book tests to make sure we read the books. The test I was taking had a lot of questions and half way through I really had to pee. I was afraid of getting in trouble for leaving the computer and I ended up peeing in the chair, finishing my test, and then running to the bathroom. My teacher was super mad at me and my grandmother brought me extra clothes. I wasn't embarrassed, just scared as all hell to get in trouble.",
            "Man, I'm the opposite. If you are going to vomit, get out of my classroom. We'll discuss it when you get back.",
            "i Swear I've read this before years ago",
            "My friend in grade 1 had to go to the bathroom and the teacher wouldn’t let her so she ended up peeing herself and on the ground and the teacher made her little 6 year old self CLEAN IT UP! When her mom came to pick her up she was like when a 6 year old says they have to pee, THEY HAVE TO PEE",
            "Heh heh heh. Serves her right.",
            "Ah, a beautiful comment section. I can smell the barf from your comments",
            "It’s a barfuclear reaction!",
            "C..c..c...c...combo breaker!",
            "I want nothing more than to take a bat to the shin of people like this and then ask them to do star jumps.. They are clearly making up all their moaning..",
            "I have a similar story from either second or third grade. I could always tell when I was getting sick and going to throw up. I politely raised my hand as the teacher was in front of the class and asked if I could go to the nurse.  She told me I had to wait until the lesson was over even though I told her I was feeling nauseous. I tried to wait but ended up running to the trash can under her desk and throwing up in it. She was so disgusted but finally let me go. I hope she learned a lesson that day.",
            "I am upvoter 9800",
            "You’re very eloquent for a first grader",
            "I don't want to rag on you; I'm just curious.  Why did you end nearly every sentence with an ellipsis?",
            "Aaw, my 1st grade teacher freed my penis from my zipper. I liked her.",
            "u/nwordbot u/avrangor",
            "[deleted]"
        ]
    },
    {
        "post_id": "78gksz",
        "author": "gerbil_111",
        "title": "my wife said I don't tell her I love her",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/78gksz/my_wife_said_i_dont_tell_her_i_love_her/",
        "score": 13410,
        "num_comments": 329,
        "created_utc": 1508859828.0,
        "selftext": "she said I should tell her 'I love you' sometimes. I replied 'i love you, sometimes.' \n\nI'm still paying for that one 2 weeks later.",
        "permalink": "/r/MaliciousCompliance/comments/78gksz/my_wife_said_i_dont_tell_her_i_love_her/",
        "comments": [
            "My sister told me during a family dinner that the 2 most important thing to say in a marriage is \"I'm sorry\" and \"I love you\"\n\nI promptly looked at my wife and said \"I'm sorry I love you\"",
            "Simple. Elegant. Well done.",
            "[deleted]",
            "[deleted]",
            "I showed this post to my hubby, then told him \"I love you sometimes.\" \n\nHe smiled broadly and said \"I love you all the time, even when you aren't there and can't know about it.\" Which was sweet, but also a little creepy. I told him so. \n\n\"Yes, nailed it.\" he said.\n\nEdit: apparently he said \"even when you don't know that I'm there.\" Subtle, but important distinction. ",
            "\"You could tell me you love me once in a while\"\n\n\"I love you far more often than once in a while, I'd even go so far as to say I love you most of the time!\"\n\nOopsie.",
            "[deleted]",
            "my hubbs and i are weird about showing affection. \n\nmost recently it was \n\n\"youre amazing and i love you so much\"\n\n\"whoa what is this honesty hour? i'm going to need you to dial it back a bit\"\n\n\"youre weird and i tolerate you sometimes\"\n\n\"aww i tolerate you sometimes too\"",
            "My wife sometimes ask me if I loved her, and I'd respond 'sometimes.'  And she would repeat the question, then I would tell her my love for her is inversely proportional to the amount of times she asks me if I loved her, but truth be told if my love for her was any greater, it would require a restraining order.",
            "I'm all for joking around and I enjoyed reading your story. But don't treat this too lightly either. Tell her you love her and compliment her more often. \n\nTake it from someone who didn't and learned the hard way...",
            "I actually had an ex who told me that, or instead of sometimes, he’d switch it up with every now and then or most of the time.  It was a ploy to hurt me because I dared have male friends and I refused to quit talking to them, but it was okay for him to cheat on me repeatedly.  The best thing I ever did was leave him once I grew up (we were together from 16-22) and realized apart from being a smartass, that was not okay.  ",
            "I'm all for a good joke, but if she was really serious about not hearing it enough, you fucked up good.",
            "Be kind to your wife. She's your best friend and partner for this life",
            "[deleted]",
            "Your wife knew puns were part of the deal\n\nYou should have known that even though your wife knew puns were part of the deal, you'd pay for that ;) ",
            "I feel bad for the wife :(",
            "Some people's love languages are words of affirmation. Each person draws their own line. I guess it's up to you to decide if saying \"I love you\" to your wife more is just \"too much work\" for you to take seriously. And if that's the case, you should let her find happiness in someone or something that can apply effort to the ways she feels most loved. ",
            "That's a fucked up thing to do. I know it is funny but as the spouse who is not told often enough that I am loved, this shit can cause long term pain. You should really tell her more often. It costs you nothing and can be REALLY meaningful for her. You don't ask someone to tell you that they love you unless you really need to hear that. ",
            "My husband was asked by our two sons during dinner who was his favorite woman?  After 30 seconds of silence.....we still remind him 5 years later of his stupidity!  Btw, he was taking his time and thinking about all of the women in his life.  Seriously, I was not his first, instant answer.",
            "/r/husbandjokes would like to have a word with you.",
            "Will probably see this in /r/jokes soon",
            "I like how this thread has turned into marriage counseling. Just what OP needed.",
            "A few months ago my girlfriend was having a bad day and said \"tell me how much you love me\" and I blurted out \"how much I love you.\" luckily she thought it was cute and is now our little thing. :) ",
            "So she's pregnant?  Because that's an entry level /r/dadjoke right there.  ",
            "I guess I'm lucky my culture it's not very common to tell someone you love them very often. (Partly because saying it in Finnish is cumbersome at best: \"Minä rakastan sinua\" doesn't exactly flow off the tongue.\n\nWhich reminds me of an old joke (which does have some truth to it):\n> An elderly couple was having dinner, like they have had every day for the last 40 or so years. All of a sudden the woman asks her husband: \"Do you still love me?\" The man is visibly taken aback by the question. After a short pause the man responds. \"I told you I love you when I asked you to marry me, and I'll let you know if that changes. There’s no reason to keep asking me every 40 years.\"",
            "My experience in this scenario:\n\nW: I love you \n\nNeruat: love you too\n\nW: Don't say too\n\nNeruat: k, love you three ",
            "You should have said \"but I love you all the time!\"",
            "When I was a kid I had this exchange\n\nMom: ...and no backtalk, just say yes ma'am and do it!\n\nMe: yes ma'am and do it!\n\nLuckily she was holding back laughing instead of actually getting pissed",
            "Lol. In all seriousness though, tell your wife you love her.",
            "Aw, sometimes can be all the time.",
            "[deleted]",
            "[deleted]",
            "Tell everyone you love that you love them everyday.  Say I love you, avoid I love you too.  Be Intentional.",
            "This level of \"dad jokes\" never amused me. It really does take no effort or wit, they just seem lame.\n\nEdit: So many of you are passionate about your lame dad jokes lol. ",
            "The IT Crowd did this quite well: https://youtu.be/TKOrr4XRbg8",
            "How are you paying ? Details man !!!",
            "Actual photograph of /u/gerbil_111: http://e.lvme.me/hnwvgld.jpg",
            "FLY YOU FOOL",
            "She sounds like a nightmare if she’s taking a joke seriously and being nasty about it for two weeks......",
            "One time, my girlfriend and I were arguing about something stupid, but I don't remember what it was. After a while I just stopped talking because I was fed up with it.\n\n She then proclaims: \"can you say anything back!?\"\n\nSo, I said: \"anything back\"\n\nShe just stomped off and slammed the bedroom door. I slept on the couch that night but we laugh about it nowadays. ",
            "\"I feel awkward at funerals.  I never know what to say.\"\n\n\"Say 'I'm sorry for your loss' and move on.\"\n\n(to the widow)\n\n\"I'm sorry for your loss.  Move on.\"",
            "This is exactly what my husband would do! And we thought romance was dead!",
            "/r/jokes",
            "What a lovely relationship",
            "I used to love you. I still do, but I used to, too",
            "Another good one is \"You know, I've been reading Ayn Rand and she says a spouse has to earn their partners' love....\"\n\nThen raise your eyebrows expectantly at her. Make it worse by pointing at your groin.",
            "She'll remind you again in thirty years ",
            "My wife would have laughed.   (I bet you thought that too... Hmmmm, there might be a lesson or warning for me in that...)",
            "You'll be paying for it for years.",
            "Next time someone says 'I love you' just reply with 'I tolerate you' back to them. ",
            "Where the TL;DR?",
            "Can I get a tl;dr",
            "/r/marriagememes",
            "What are you paying her in? ",
            "Worth it!",
            "Was it worth it?",
            "you should randomly start calling her sometimes rather than honey or babe or whatever. Oh hey sometimes. what do you want for dinner?",
            "🎶[I love you sometimes](https://www.youtube.com/watch?v=X3tE3CUGP3o)🎶",
            "What's your debt at? Currently I'm paying this type of thing off longer then my student loans.",
            "...how does that couch feel ? : )",
            "Just say\n“I love you\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nr friend”",
            "Totally worth it. ",
            "My wife would have laughed at that one. I say some fucked up shit to her now that I think about it ",
            "!RedditSilver",
            "Worth it.",
            "When I tell you that I love you, accept my love. Don't test my love. Accept my love. Cause maybe I don't love you all that much.\n\n- Dan Bern",
            "Whatever",
            "She looking for an excuse to cheat dude... ",
            "\\>I'm still paying for that one 2 weeks later.\n\nBeta AF"
        ]
    },
    {
        "post_id": "by2bb3",
        "author": "CatheterZetaJones",
        "title": "Dumb cost-savings policy creates 830% cost increase",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/by2bb3/dumb_costsavings_policy_creates_830_cost_increase/",
        "score": 13403,
        "num_comments": 405,
        "created_utc": 1559956159.0,
        "selftext": "I used to work in a job that had me travelling by air across the country for about half the year each year. Corporate rule was that you had to book the lowest price flight. Now, that’s not an unreasonable rule on its own, unless you say there are **no exceptions**. **Lowest. Price. Flight. Period.**\n\nIt’s especially silly when the worker’s employment agreement mandates they’re **paid for every hour they’re in transit** (at the airport or on the plane). Every. Hour. Period.\n\n*You see where this is going. Here were my flight options:*\n\n1. **$600 cheap non-direct flight:**  \n3 hour connecting flight to hub airport  \n\\+ 1½ hour layover in that airport  \n\\+ 5 hour flight back to correct city\n2. **$620 direct flight:**  \n2 hour direct flight\n\nI asked our finance department if there were any exceptions. “No exceptions.” So, to save $20, I was required to book the non-direct flight at 9½ hours including layover, rather than the 2 hour direct flight. While getting paid $25.00/hr…\n\n1. **$600 cheap flight:**  \n\\+9½ hours x $25 = $237.50  \n*...Oops, and overtime pay after 8 hours!…*  \n\\+1½ hrs x $12.50 OT premium = $18.75   \n**=$600.00 + $237.50 + $18.75 = $856.25**\n2. **$620 direct flight:**  \n\\+2 hrs x $25 = $50.00  \n**=$620.00 + $50.00 = $670.00**\n\nSo, congratulations corporate penny-pinchers who saved a whopping negative $186 of company money to save $20! Malicious compliance was delicious compliance.",
        "permalink": "/r/MaliciousCompliance/comments/by2bb3/dumb_costsavings_policy_creates_830_cost_increase/",
        "comments": [
            "I hope you charged them for the airport meals too. And that you ate at the Nice restaurant.",
            "I love when I get to travel for work. They really don’t consider payroll costs at my job, either. I’ll quickly rack up OT pay with travel time. It’s not like it’s fun, but it’s not work, and man that paycheck is sweet.",
            "I use to work for this manufacturing company and they purchased a used tool. The tool new cost around a million dollars. So they look for a used one and find a \"deal\" for a model that was going for 600k. When they got it in house, paid for shipping, assembly, and attempted to start the tool to find out it pretty much needed complete refurbishment. After 400k of refurbishments they have a working tool with no real warranty, paid as much as a new tool, paid several maintenance techs & contractors to install and look at it for weeks and God knows what else. If they just bought a new tool they could of saved so much time and money. \n\nI found out later this was standard operation procedure in several companies because the books show the tool costs split between two different departments, production and maintenance. Companies will do crazy shit for appease the finance guy.",
            "I enjoy rote adherence to poorly thought out policies.  Especially when you tried to make the case that hey, maybe they should make an exception this time, and they didn’t want to listen.",
            "I had a good one as well, not as good as that.\n\nI used to travel alot for work, and my company used to just give us a credit card and told us to book our own rooms and to keep it under X.\n\nwell over time I had gotten to know management and at the hotel I was staying at I was paying $95 per night.  Then the company changed rules, took away our credit cards and said \"You must use this service to book the hotel\"\n\nThat service, same hotel, same room $140 a night.",
            "But the extra cost comes out of payroll, not travel budget, so the travel expense manager gets a bonus for saving money and payroll gets told to pay someone off to make up for the overage.",
            "This is why corporate travel bookers and travel management companies can be so helpful.\n\nI keep track of every saving taken and every saving rejected for my corporate accounts based on their travel policy and show them every six months so they can assess their travel policies and make sure they’re actually doing what’s best for the client, company, and traveller.",
            "I'm sorry but your math is ridiculous.\n\nAt best you could call this 266% but in reality it is only 28%.",
            "Okay cool, but where did you get an 830% cost increase?",
            "As a former executive who sat directly with HR on this, we're not oblivious to this fact.  Your single case might be one that costs more but on a portfolio level,  it was either deemed less expensive or less man power to just create the process this way.  \n\n&#x200B;\n\nFor every flight that it costed us more like your case, there were 3 more where employees took advantage of the travel and erroneously booked even more expensive flights.  We did a portfolio study on a high level view and determined it was either cheaper or required less manpower to process it this way.",
            "[deleted]",
            "That 830% cost increase is grossly exagerated. You should do price with policy / price without, which comes out to be a 27.8% increase. Far cry from 830%.",
            "I once worked for a company that had me pay $90 each way in a cab to a larger airport farther away to save $35 on air fare. Apparently ground transportation came out of a different bag of beans than air fare. Somewhere a bean counter was pleased with himself for saving the $35.",
            "If you flew through CA or CO, they have unique OT rules that you might need to remind your Payroll department about. (Over 8 hours per day, time worked on the 7th day in a week in CA, over 12 hours per day in CO)",
            "Ugh I hate finance people that do this kind of thing. Where I work one of our machines broke down, and needed a special part. The site supervisor found one locally and tried to convince finance to sign off on it. But they had found one for several hundred dollars cheaper but would take three days to get here. The broken machine created products that three other machines needed to keep working so in the end they lost out on thousands to save a few hundred. Of course the costs were recorded by the production department and not finance so they look good while the company as a whole loses.",
            "I was once approved to do a training course. I looked and saw the exact same course was significantly cheaper in another city. Including the cost of flights, it was still cheaper than doing it in my city. I offered to do it in the other city on a Thursday/Friday, pay for all of the accommodation costs myself, and enjoy a weekend there. I got turned down.",
            "Sounds like we work for the same place (or used to). Been to Canada 3x this year and it’s always been faster/cheaper to drive back than fly in (10hrs on the road vs 12+ my air with connections)",
            "Where is the 830% increase?\nIm not seeing it...",
            "830% cost increase? You sure about that?",
            "Please explain how you came up with 830%",
            "Work trips are the best. We do cheap flights as well and they usually want us traveling on Sundays so I can then work on Monday. So I get an entire day of OT for travel starting when I get in the car in the way to the airport until I'm checked into my hotel room.\n\nI don't get many trips, but I cherish them when I do. The per diem is great too. I just eat cheap during the day and have awesome dinners",
            "It's 28% cost increase, not 830%, though.",
            "830%?",
            "Penny wise pound foolish",
            "My company has a similar policy, but I have in writing that I can ignore it. Besides booking the cheapest flights, they also demand departing on flight no earlier than 7am and returning by 6pm. \n\nMy local airport (next closest is 4+ hour drive away)has 2 outbound flights a day, 5am and 11:30am. It has two arrivals a day, 1:30pm and 11pm. If I were to follow company policy, I'd have to add 2, if not 3 travel days onto my trips to fly across the country. So they let me do it my way. I also have to move a lot of samples. I could two day ship them for $300, or I upgrade the first leg of my trip to first class for $29 and get 3 checked bags for free and bring them with me.\n\nI'm very thankful that my company listens to reason.",
            "I would take the initiative and speak with the CEO about that..  it would make you look good, especially if you are ever interested in a promotion..",
            "Same thing but on a smaller scale. Have to book the cheapest hotel what the company doesn't take into account is on site parking which adds an extra $30 per night and the extra travel distance just to save $4",
            "This is the definition of stepping over dollars to pick up dimes. Ridiculous.",
            "I’m guessing when they created this policy they only considered salary employees.",
            "Now, maybe I'm bad at math, but I don't think that's an 830% cost increase... It's not an 800% increase of $50 and isn't an 830% of 600, am I missing something? Or did I get clickbaited on Reddit?",
            "My boss says this all the time \"our company is penny smart dollar stupid\" meaning they save money in the short term I.e. Your 600 flight but not with how much they have to pay you",
            "Hey! A short post that is to the point and doesn't require ten minutes of reading! Excellent! Let's transform this sub to mostly concise posts so people actually feel inclined to read the posts.",
            "Where are you getting “830% cost increase” from? The percent increase from $670 to $856.25 is only 27.8%. So then I thought maybe you were using the original $20 difference between the two flights to the final difference, but after trying various different versions using different combinations of numbers you gave I have not been able to find a set that gives 830% as an answer.",
            "I would be taking longer flights if i was you lol easy money",
            "It’s an example of pretty standard corporate practice as after all your wages would have been budgeted for regardless or the work or lack off that you can complete even during travel, where the travel costs themselves are an additional expense, even when budgeted for, the prices can’t be guaranteed due to market fluctuations etc, so even though overall it is costing the company more, without a common sense part or person within the process it’s the way it works, \nAll they would have to do to correct the process in for this example is change the wording to “cheapest direct flight”\nIt’s amazing how much money and time is wasted by companies especially is the rules/processes are written specifically for a part of the organisation but don’t count for anyone that sits outside of that part",
            "r/stupid tax right here",
            "The accountants have ruined so many businesses, it's insane.",
            "The best way to convince management that they have created a stupid policy, is to follow it to the letter.",
            "Wonderful.  Similarly when people refuse to book tentative dates with flexible fares because TEH CHEAPEST!!",
            "Did you at least get a lot of frequent flyer miles out of it?",
            "Nice MC...but you're accounting is very creative to get the 830% increase in the headline.  Most would consider this a 38% increase.",
            "Not to mention all the lost productivity.  You wasted more than an entire work day traveling instead of working",
            "r/assholetax",
            "It actually cost even more because you were spending an extra 7 hours sitting instead of working and they had the opportunity cost of lost billing hours.  \nI used to travel a lot, it is such a huge waste of time",
            "I’d wager that for every weird Spirit 9 hour total flight that costs a few hundred extra there’s 10 out of country flights that save them a few thousand.",
            "One of my favorite saying about my company is \"well spend a $100 bucks to pat ourselves on the back over saving $5.\". Meaning that $5 saving usually ends up costing us a lot more if we had just gotten the product we needed.",
            "logic and math, the enemy of anyone trying to save a quick buck",
            "I once had a half-hour layover. My first flight landed 45 minutes late. The next flight to my final destination left 7 hours later. It was on a Sunday, and I make double-time on Sundays. We're not allowed to fly on Sundays anymore unless it's mission-critical.",
            "I feel like if you explained the total cost they would change their mind.",
            "Don't forget your travel per diem.",
            "I was on loan to another company and we were all going from San Francisco to Australia. The other company's rules on upgrades to business class were based on the length of the flight - Australia definitely qualified. What I didn't know was that mine was based on number of flights per year - hop the LA shuttle 5 times a year, and the 6th one gets an upgrade.\n\nSo I booked the flight early enough to get the good deals with everyone else, and then found out two weeks before the flight that it wasn't allowed. I had to rebook in steerage, and of course by then the ticket cost more than it had originally.",
            "Three colleagues of mine were on a trip back home and their last flight was rerouted to another airport due to bad weather. The office told them to check in to an hotel at that city and take a flight the next day to their original destination. One guy really wanted to get home to his family, so he got a train ticket instead for that evening and went home. They had already maxed out their travel pay for that day, so all it would cost the company was the cost of the train ticket (maybe $100). The other two colleagues had hotel costs, an extra flight (well, airline probably paid at least part of the flight due to the rerouting) plus another days worth of travel that they needed to be reimbursed for, so probably 4-500 dollars each. \n\nIt took the guy taking the train almost 6 months to get reimbursed for a train ticket that saved the company several hundred dollars...",
            "Bean counters end up costing the company more money in the end. Always. They'll charge the company a million dollars down the road to save a few pennies in the short term",
            "I'm salary, we don't get per diem, and they don't rent us a car. When I travel, I eat whatever I want and tip outrageously and take Uber whenever needed.",
            "Agree the rule is stupid but it looks like a 28% (186/670) increase in cost?",
            "Nice. That's like the idiot customers at my work. We regularly issue $10 off $50 (or $20 off $100) coupons. If they are short, and can't use it, they will go look for something else to buy. Essentially spending even more money than they would have, if they just saved it for a 50 (or hundred) dollar item. \n\nI'm not going to correct them, it makes our sales look good.",
            "[removed]",
            "Don't forget the taxes the company has to pay on your pay rate (which easily adds up to another 15-20%, maybe more, of the hourly rate added to the rate when determining their costs).",
            "Lol oh gosh I fucking love this! Bureaucracy at it's best HAHAHAHA",
            "Love your username",
            "Did you bring this up with management? That seems like a very short-sighted policy and maybe they didn't think it through.",
            "Ah the ol' \"spend a dollar to save a dime\" business model.",
            "What's \"delicious\" about having to spend an extra 7 1/2 hours travelling?   That sounds more like hell to me!",
            "I'm an interpreter and I once had a last minute (booked the day before) job in a city a 4 1/2 hour drive away. I said I would drive, but no I wasn't allowed, so they paid for last minute flights (my city, to another city to the final city) and back again all of my waiting time and travel time and then the 2 1/2 hours of actual work. It was two years ago, but I remember it would have been cheaper for me to drive even with them paying mileage.",
            "Employees cost more than base salary.  There's the FICA match and comp which is based on payroll.",
            "Do all finance offices employ a Pennywise clown??",
            "\nyou can always find a cheaper flight. Like if you want to go NY to Boston you can probably save money by flying to maylasia first. \n\nSounds wrong , but they just need to find one plane going to malaysia w/ a spare seat and then one going to boston w/ a spare seat for it to make money for the airline. \n\nMy friend took 3 days getting to a wedding once because it saved him money booking a flight with 16 stops.",
            "I’m gonna be “that person” for a minute. \n\nCorporate budgets are often allocated ahead of time. Money for different functions are set aside and not touched by other departments. The board agreed upon these budgets and messing with them later can have consequences. \n\nPayroll accounts in particular are often kept separate from corporate expenditure accounts. But when they do change, accounting/financial departments require man hours to reconcile them. \n\nConsidering the people and reporting it would take to move budgeted money around, I don’t know that the company really lost much on your flight example. The policy might be “cheapest flight available” because that account is less flexible and more watched by the board.\n\nThat’s not to say that corporations don’t waste money, but it’s not as simple as having one bank balance line to account for.  \n\nStill worth you bringing it up to your supervisor. It will show you have the company’s best interest in mind.",
            "First of all, I don't know where you're getting this 830% increase from. The increase is 28%. \n\nSecond, what job flies you around like that, but pays hourly instead of salary?",
            "So the total cost became $856 instead of $670? That's a 28% cost increase.",
            "Add this to the multiple replies pointing out that this is more like a 28% cost increase and not a 830% increase.",
            "Put it up on r/assholetax as well",
            "Math checks out.",
            "AYYYY YESSSSS",
            "That’s not an 830% cost increase",
            "I have quite literally ZERO corporate experience, but if I found out one of my employees was wasting money to adhere to some policy they’d be fired. Obviously not you OP, but whoever you brought it up to who said fuck off.",
            "I think you mean non-stop, not direct.  They're not the same thing.  A direct flight is when the plane stops somewhere before your destination, but the flight number doesn't change and you don't have to get off the plane.",
            "That’s not how overtime works. It’s 40+ hours not 8."
        ]
    },
    {
        "post_id": "7rkeuz",
        "author": "DM_ME_ROLLERBLADES",
        "title": "You want to screw me over on my raise? That’s okay, take a hard hit on productivity!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7rkeuz/you_want_to_screw_me_over_on_my_raise_thats_okay/",
        "score": 13374,
        "num_comments": 850,
        "created_utc": 1516386769.0,
        "selftext": "This happened around two years ago at my old job, and shocker, it’s the main reason I quit recently. \n\nMy job basically was a very easy warehousing job, I basically only pulled orders at this point. Later on there I would be trained on everything else, from shipping, kitting, put away, everything. But I was a perfect fit for that since I LOVED driving order picker. I was especially good at it. \n\nThe bare minimum you had to hit in an 8 hour shift was around 230 boxes pulled, or 230 labels if you want to be precise. Since organization was a strong suit, after a few weeks I was consistently able to hit over 350, then 400, topping out around 425. I always worked and with other people quitting, within a year I was one of the most experienced people in my area. With training new employees, helping on certification of vehicles, and coming in on weekends when work needs to be finished I felt like an asset to the team.\n\nBeing one of the most experienced people over there, I was offered a raise to keep my numbers over 400 daily. Sure, it’s a college job, but if I’m able to get more money by doing my job as well as I usually do it sure! I accept and they said my wage was updated and approved so I got right to work and pulled my end of the deal. A week went by, same paycheck. Another week, same paycheck. Huh? What? I go into my managers office and tell him calmly that my raise didn’t get put into my paycheck. I get told “We thought about it, and we feel as if it’s within your job responsibilities to be doing what you’re doing, so we will not be giving you a monetary increase.” \n\n“...we feel it’s within your job responsibilities to be doing what you’re doing...”\n\nSo in order to get back, I realize that if they don’t think I deserve a raise then why should I do all of the extra stuff around my work place? Suddenly I dropped my daily quota to the bare minimum. You need me to stay over to help complete orders? Nah I’m going home, my shift ended five minutes ago. Shelves started to become disorganized because I didn’t fix them as I went. Anything small that I would do to help out I stopped doing. Little by little complaints started to file in. From the lowest on the totem pole, working it’s way up slowly.\n\nWith in two weeks I got called back in and was told that i was given the raise and it would be in this weeks paycheck. \n\nEDIT: I QUIT 5 MONTHS AGO, IM\nNOT GETTING BACK PAY\n\nDouble edit: About the disorganized shelves. As people pull parts stuff gets a little disorganized. We had cubbies, technically it was put-aways job to reorganize the shelves but I did it as I went. They never did it cause nobody ever would correct them. I did it cause it made every ones job a little bit easier and it looked better.",
        "permalink": "/r/MaliciousCompliance/comments/7rkeuz/you_want_to_screw_me_over_on_my_raise_thats_okay/",
        "comments": [
            "I worked for a company who did productivity reviews and if you were a high performer, doing above the required level of productivity, the high productivity you could do then became *your* productivity requirement level for no extra compensation. The higher productivity workers were generally the more intelligent ones and quickly figured out there's no reason to do work beyond what was required at the minimum so started slacking off. It was a huge cluster in the department for a while until leadership got the management team to compensate appropriately. People who tend to manage the workforce are so removed from knowing what the work their underlings are doing entails that they make stupid decisions in order to keep \"smart spending\" in control. ",
            "It's pretty stupid of them to offer you a raise and then not follow through. What did they honestly think was gonna happen? They shouldn't have said anything and enjoyed the profits.\n\nEdit: the words \"it's\" and \"not\".",
            " ",
            "Around 2002-2004 I worked for an off-brand cable internet company. Served places like Fargo. I was tech support but basically slumming it after my dot-com network engineer job imploded. I was good at it, like freakishly good. They first thought I was dumping calls but after monitoring me both with and without my knowledge they had me re-write their support methods and processes. \n \nFirst call resolution goes up, across the board. Way up. They still had to take me out of the metrics though because I consistently did 2-3x as much as everyone else per day. IMO people were just not motivated but I did not really care. Shit was getting done.\n \nMy manager retired and they brought in someone from some midlevel position at a local bank and she hires a new group of employees. Some of them get promoted from tech 1 to tech 2 a couple months later. And then another. And some of them get promoted as well. Meanwhile I am still tech 1. \n \nNow I never caused any drama, I just came in and did my job. I sometimes brought twix for everyone. Everyone was surprised that I had still not been promoted to at least lead... but there was a large disconnect between management and staff so it never really went anywhere.\n \nThen they decided to start scheduling me alone at night, since I typically pushed through more calls on my shift than came in on that timeslot and everyone on nightshift was a student and would be leaving soon anyhow. So I pointed out that nightshift needs a tech 2 to authorize dispatching and some other higher level admin functions. \n \nThey give me permission to 'act' as a tech 2. \n \nCouple weeks pass. I dont really mind, the night shift was nice. Then they decide that in addition to clearing all the calls I can run all the maintenance tasks which included physical backups to tape and offsite shipping of those cans. This was lead level stuff, but I had done it before so I was like sure. I did it for a couple weeks then decided that it was time to ask for what I felt I had earned.\n \nMe:\n>Can I get a bump to Lead or at least 2, since this includes a significant increase in responsibility?\n  \nManager:\n>No, you do not need it and besides you have all this down time anyhow.\n \nThe next day hold times were through the roof as my handling time shot way up. Backups did not get made because I was back to back calls all night. Reports were not generated. Other sites were calling the escalation number which paged my manager asking if I was out sick. She naturally called me to make sure I was in. \n \nThings repeated the next night.\n \nAnd the next.\n \nThen friday comes around and she meets me at the start of my shift to ask why my performance has dropped so far below expectations. \n \n> My performance is exactly at expectations for tech 1.\n \nUpset she demanded I do better since everyone knew I was capable of doing better.\n \n> Sure I will do better.\n \nShe expected a fight and left all smug and haughty when she didnt get one, assuming she had got submission out of me.  \n \nBut after that I was only there to empty my desk, I had a new job lined up for Monday. It was not like I was planning to leave suddenly, its just a happy coincidence that a place I wanted to work opened up a spot and brought me in right away. I had planned to work my shift through Sunday and let them know they had a couple days to staff up my spot... But karen decided to be a jackass.\n \nSo I go to my desk and send an email to everyone on the management chain and the local directors letting them know that karen had encouraged me to find a position where I could do better and that she will need to come cover the phones at night that night and the rest of the nights until they hire a couple people to fill that shift. \n \nI heard that they hired three tech 1s and moved a pair of tech 2 into nightshift, as well as karen to do all the management tasks. Then they fired her once one of the 2s learned it all and made him the new lead. \n \nAll I wanted was a bump. And she cost them 6x my pay by not giving it to me. ",
            "Years ago I was a contractor for the Federal Govt.  It was a yearly contract so every year I had to re-apply and re-interview for my job.  The contract was awarded to a different firm almost every year, but they usually kept most of the staff.\n\nOne year the contract was awarded and we all got raises.  3 months later the contract was invalidated and awarded back to the last winner.  When our previous employers came back in to hold the contract they cut all our pay by 15%-30% and pulled a week of vacation from us to cover \"the losses incurred when they didn't hold the contract for 3 months.\"\n\nWe as the IT group said fuck it, and played Halo 6v6 for the rest of the contract year.  We only did break fix work, no improvements upgrades or enhancements, only the bare minimum.\n\nEdit:  As a taxpayer I hated myself as a disgruntled worker it was great.",
            "[deleted]",
            "I once had a job at a startup where I was being paid under the legal minimum wage and working unpaid overtime to top it off. When I noticed I confronted my boss and simply asked for the minimum wage and my overtime pay (which was also required by law). It ended up in a court battle where he hired an expensive lawyer just to screw me out of minimum wage and in the end he lost anyway, probably cost him 3x the amount he owed me in legal fees. I got my payout then resigned, company fell apart after that.",
            "(And remember, when someone pulls this shit, you tell them they'll be backdating the pay rise.)",
            "Worked at a warehouse making corrugated cardboard. Aka cardboard boxes and similar material that can be single or double layered with flutes in between. After two weeks, they moved me from the basic help getting 10$ an hour to single facer operator making 13 and hour to start and will increase to 16.75 after 2 weeks training. Month goes by and I ask about the raise and was assured it would be on my next paycheck. Another two weeks and no increase and I co fronted the plant manager saying I can go back to bartending making a shit ton more for a whole lot less work. Says that the raise won't go into effect until next quarter which would be a couple more months. Next day I came in I told them I would be doing the basic detail I applied for and would be fine with the cut in pay. Told them I figured it wouldn't go into effect till next quarter anyways.That very week's paycheck had the pay altered so I never went back. Called in and said the reasons and said the hour long drive out there wasn't worth it for me to quit in person when they couldn't be honest with me my entire time there. ",
            "I worked part time at a sign company while in college building signs from aluminum. Their accounts receivable clerk went on vacation for two weeks so they had the college boy fill in.  During that two weeks, I straightened up their records and collected $250,000 in past due accounts. \n\nWhen the accounts payable person returned, they gave her a different job and kept me doing accounts payable. And gave her a 10 cent per hour raise and me 5 cents per hour because I was only part time.\n\nI quit and the office manager broke down in tears. They offered me the 10 cents, but I had already found another job paying almost three times as much.\n\nThat sign company went out of business a few years later.",
            "How much was the raise?  One time my boss was so happy with my work that he gave me a .25 raise. When I realized that he was giving me 10 extra dollars a week. I saw how much they appreciated me and started cutting back on the work.",
            "Why is it so hard for companies to understand that treating and compensating employees who do a good job, and cutting the employees who do the bare minimum is how to make a company thrive? ",
            "Always gotta get offers and raises in writing.",
            "they pretend to pay, you pretend to work. simple equation",
            "I used to get direct deposit and my hours were increased with my raise. So i didnt notice right away that my boss lied to me about getting a raise because i just saw more money. Once i confronted him about it his response was, no but we’ll start adding it now. Kinda my fault for not paying attention, but im kinda glad i found a reason to quit.",
            "Similar happened to me at my new job recently. I'm supposed to work 5-8 accounts per hour, but I was regularly doing 9+, some days 10+. We had some people who barely hit 4 to 5. My first review comes up, manager tells me on everything on my review that I'm \"exceeding expectations\" and out of 4 possible points, I'm at 3.95. He said when raises come out, I'd be at the top of the range.\n\nRaises come out, it's 2.85%. He said the average raise was 2.5%. While technically he may have been correct/honest, this just didn't sit right with me. The difference between my raise and the average came up to about 6 cents per hour.\n\nWell, I'm not going to keep \"exceeding expectations\" for 6 cents per hour. I've now just been 6-7 accounts per hour and coasting all day. ",
            "Same thing basically happened to me. My job title was handyman and warehouse “lead” whatever that means. I didn’t call the shots, I fixed stuff and drove a forklift around picking orders. \n\nAfter over a year without a raise I was finally offered one, and I never saw the increase. They also sent me home early on fridays to avoid overtime weekly.\n\nSo finally I asked about it to my boss and he said I was given a 2 cent raise.\n\n2 cents.\n\nA week later I was accused of damaging the warehouse roof while workers were fixing the roof, and was given 2 days of no pay. \n\nI promptly told everyone to go fuck themselves and I’m out. Was the best decision I ever made. ",
            "That's the equivalent of telling your wife \"I thought about getting you flowers on the way home\" after not getting her flowers on your way home.",
            "For future reference, this is called [\"work-to-rule\"](https://en.wikipedia.org/wiki/Work-to-rule).",
            "At a printing job I used to work at, I truly tried to excel just like you did. In 5 months I managed to get myself $4 in hourly wage increases, from 11 starting to 15. I was damn good at it too.. too good. I took pride in my work work, and did my best not to fuck anyone over. I soon realized that I was performing above and beyond even some of the guys who had been there for years, so I asked for another raise. I knew I was making $2/hour less than the other workers. \n\nI was told that they would 'consider' it and get back to me. I let it go for 2 weeks, not being a thorn in anyone's side. Just continued to be a very good, productive worker. \n\nWell about 2 weeks pass and I ask about the raise. I was told that 'the company is in the red right now and raises are not something that's able to happen right now.' Which was funny, because the owner of the company shows up in his brand-new Jaguar.. less than a week old. I said, I can't keep performing at my current capacity within the company at my current wage, that there are better opportunities abroad for me and to please reconsider. I didn't get a reply, and they didn't get another shift out of me. Who wants to work for a company' in the red' anyway? Fuck greedy old men.",
            "ill never understand why employers do this.  like...  what do they expect to happen?  And it seems like they lose far more money by taking away your motivation to be productive and stay with the company rather than just throwing you a bone.  ",
            "I’ve had that happen at 2 previous jobs. Both jobs, after receiving 2 paychecks and no pay increase, I put in my notice. Both times I had exit interviews. Both times I told them what happened and they asked if I’d stay. Both times I left. I refuse to work for companies like that. ",
            "This sounds like what teachers unions call “work to the contract”.  Instead of going on strike, teachers work exactly the hours that they are legally obligated to be at work.  They do not arrive early.  They do not stay late.  They do not coach sports.  They do not tutor students.  They do not sponsor clubs.  They do not take work home with them.  It sends a message to not just their governance body but the voters as well.",
            "I have the same thing going on in my warehouse. I'm in returns and customer service /  returns area. i'm currently the top performer in my department. Last year i was over 14k transfer order(rough metric for work done that day) the next person managed 9k. i went to HR to inquire about a raise as they recently held a town hall meeting about \"paying employees based on productivity and not playing favorites\". i was denied said raise and will be starting my hunt for a new job.",
            "[removed]",
            "Was it made retroactive, back to the original offer?",
            "I had a similar situation. I worked as a cook in a restaurant. I had no real experience when I started, but I worked hard and tried very hard to learn the ropes.  In my case you started as fry and prep cook, the next step was grilling (steaks, fish, veg, etc). And the final step was sauteeing and basically being the chef's slave. I learned it all and learned it quickly. The problem was the chef was verbally abusive all the time and mean spirited, he always kept us  on our toes. He made us do menial chores on a regular basis. We were overworked and underpaid. Long story short, I began looking for other opportunities and something came up. But, even before I began looking, I decided to work extremely hard, and output more than humanly possible for the average human to put out.  My goal was to leave a gap so large in the work output that they'd have no choice but to need to replace my spot with more than one person. Long story shorter, when I left, the chef stormed out within one week of my leaving. I cost him his job because he himself could not handle the work load I had been undertaking. I eventually became the chef to this restaurant, but the owners were pricks themselves, and then that's another story where I had to stick it to the man. The raises were meager and only upon threat of leaving and they never paid me vacation time as the other workers received them. Later, I learned they hired a significant larger staff for the kitchen, paid them more than I had ever hoped, business went down, and eventually the business got sold.  Funny how thing's go down.",
            "People don't quit jobs, they quit bosses.",
            "Raises generally aren’t worth it.  Look at every job you hold as a step towards gaining some sort of skill that you can demonstrate to your next employer in order to get a better starting pay.  \n\nDon’t buck for a raise, look for a better position ",
            "> I did it cause it made every ones job a little bit easier and it looked better.\n   \nKeep that attitude and you will go far. ",
            "Back pay bro...ask for the back pay.",
            "Wow. Harsh story. A guy I know worked in his industry consistant for various jobs at a standard rate. His employer started to run out of work so to keep himself busy he quit and easily got a new job doing the same thing. His skills are somewhat unique and specialised and a programmer however he took a pay cut just to keep himself busy and challenged. He clued on that his boss could pay him more so he asked for a raise, at least to bring him up to where he was in his last job. The boss refused so he quit. The boss was boasting later at how much of a bargain they got him for.",
            "Post this and other experience on their glassdoor too. so that others can find it, and at least prepare for it",
            "I can jump on this train all day long. I was just told to cut my hours but I helped in pretty much every position so do my job and the other jobs that were short or needed help even when i despised the position, the job needed to get done. I am told to many hours and so just went back my job only.\n Only if i am told do something i will. That is the attitude of everyone else. I think have finally come to terms with other people do shit work, why am i beating my head against the wall trying to make lives/work easier.Fuck em.",
            "Good for you! Youve got to stand up for yourself. So many workers do not know their worth. Thats why a lot of jobs discourage comparing paychecks.\n\nI was in a similar situation where I was passed up for a promotion. When I complained about it I got written up for a SPELLING ERROR on my paperwork two weeks later. I couldnt believe it!\n\nSo like you I stopped doing all of the little things that were not in my job description that made the department run smoothly.\n\nFor instance: I had been helping train new hires. We had a kid come in I will call Orville. Orville was not very good and he obviously lied on his resume. He had no clue what he was doing and any responsible supervisor would have fired him after two weeks. \n\nAfter two MONTHS they put Orville on my shift. He left early. Didnt finish his shift. Would just walk out to the parking lot and sit in his car. I didnt say squat. They other guys would look at me and I would just tell them. \"Im not saying jack. Telling people what to do is above my pay grade. Not my circus. Not my monkeys\" Well Orville lasted about another week and he was out of there. We're still cleaning up his mess.\n\nNow the Governor has cut our budget and they laid off 8 people last week. It doesnt matter how far up the bosses ass they had their nose. Screw em'. I've got another job lined up that pays 10% more and I'm leaving in two weeks. Its not even worth the sweat off my balls to give them notice.",
            "[deleted]",
            "Fuck that place. That pretty shitty to have them promise you something and then renege on it. ",
            "This shit happens a lot and managers never understand the problem because then they would have to admit that everyone can't be replaced like spare parts.\n\n",
            "Ah part of the rich history of American Industrial sabotage. Makes my heart swell. Good lad eg\n https://libcom.org/library/sabotage-food-factory-usa\n\nhttps://libcom.org/history/sabotage-american-workplace-anecdotes-dissatisfaction-mischief-revenge",
            "Most people Iin lower management positions are complete dumbshits. If they aren't dumbshits they get promoted until they again become dumbshits at what they do.",
            "at least they didn't give you a raise for a month then take it away when minimum wage went up. two years in a row",
            "If you're paying peanuts you get monkeys. ",
            "I wish I could do that. I haven't figured out how to slow down at work.  I feel that for what I'm worth, I'm not getting paid enough, but I can't bring myself to work less hard. ",
            "I spent 5 years underpaid like a mofo in a small town working for a large IT company.  I took the experience and flipped it to a 100k+ job nearly tripling my pay.  Would take a lot of $.50 pay raise to do that...",
            "With management like that, no wonder they have a staff retention problem!!",
            "Top story was familiar to me ,too. I worked on every job they had in the plant so I knew each part number and function intimately. Many were allowed to take off when they started doing yearly inventory shutdown, but not me because I eventually transferred to Shipping and Receiving/ Material Handling for more money and variety.  I worked inventory week every year and was very conscientious keeping our 600 different parts organized so that inventory ran smoothly.  Very few recounts year after year.  Until the year I took that week off.  Upon my return I was told I would never be allowed to take that week off again due to numerous incidents of mis-numbering, mis-identification and recounts due to inexperience or carelessness of the people in charge of the inventory that week.  Asked for compensation but never got a thing for it and slacked off.  Suit yourself. There was never an easy inventory after that",
            "This reminds of something I read in another sub, “to increase productivity for high paying jobs, pay them more; to increase productivity for low paying jobs, pay them less.”",
            "Now, you know it's up to you whether or not you want to just do the bare minimum. Or... well, like Brian, for example, has thirty seven pieces of flair, okay. And a terrific smile.",
            "That's the easiest way to lower morale. ",
            "I work at a place that we'll call Sundollars, and they did away with the review-for-a-raise thing, and now everyone just gets an equal amount of money per raise. It's great because raises are great, but that means that the shittiest person working gets the same raise as the hardest working. There's no incentive to work hard. Everybody gets a metal!\n\nBut seriously, good for you. Eventually the Next Gen. business people will realise that treating their employees like dirt results in dirt work. The customer isn't gold; the employee is.",
            "[deleted]",
            "Are there any subreddits for talking about warehouse stuff?",
            "Don't wanna sound like a broken record and a mean person but if only you got it in writing, you could've gotten back at them.",
            "Sounds like Amazon.",
            "Know what's scary? I'm going through this exact scenario at my warehouse job. A promotion into the office was pulled out from under me. I can see more grunt work being put my way and my actual job of shipping orders on the computer? Haven't don't that full-time in months. ",
            "Amazon right? ",
            "there is no reason for you to be doing twice the work, i have worked on different warehouse and some of them are so fucked up because people keep going way over the minimum just to get those extra $20 a week, which is nothing. they are already getting paid almost that an hour (around $17) so doing 40% more work for less than 5% more pay is fucked up. also if you mess up one day say bye bye to your extra $20. also 230 is almost what we had to pull per hour which was 180(without stickers) on one warehouse and 170 on another one(with stickers)",
            "Lol this is like me. I was a supervisor and did lots of favors at my security job, including pulling 16  hour doubles from 4pm to 8 AM when overnight people quit and we had to find new ones. Fast forward to one morning I'm 15 1/2 hours into a shift and I get sick, Like throwing up violently sick. One of the morning workers got in early and I asked him to cover for me for a half hour so I could go home. He reports me as leaving early to the regional director and I come in the next week to a demotion with a threat of being fired (My boss was pissed, as I was a solid worker) Ok fuckers, no problem. From the time I was a regular guard up until I made supervisor I always went out of my way to shut down situations immediately or before they became an issue, as I'm really good at working under severe pressure (The more stressed I am the more excited I get, shits weird) Not anymore. \"Jaxon there's a fire alarm going off and we can't stop it, go check which store.\" \"No problem\" *Gets to store* \"Hmm, someone pulled the alarm.\" \"Can you fix it\" \"No what should I do\" \"Idk just push it back up or something\" (This breaks the fire alarm, I already know this) \"No problem\" *alarm breaks* \"It broke\" \"What should we do then?\" \"Idk I'm not incharge anymore, figure it out new supervisor\" Now no one asks me to do anything, and I got promoted back to the position just below supervisor so all I ever do anymore is train new people when there's new people, and sit in the car outside. Best part is because there was raises since I got demoted I'm only making a dollar less than I was, without any responsibility. ",
            "Same type of thing happened to me recently. \n\nI was prime for a promotion, doing the job for 4 years, and a position at the next level finally opened up. They strung me along through the interview process and decided to hire on the outside. \n\nMy coworkers knew I was the best, and saw they did me dirty. I am the senior employee, way more qualified than the person they hired, but they thought it would be easier to keep me on at my current rate and hire someone new and instantly give them the higher pay level. My coworkers knew I would be doing the absolute minimum from here on out. The owner even stood up for me and said if they didn't think I was qualified, them they can't ask me to do anything outside my scope.\n\nNeed me to stay late? Nope. Need me to do those extra duties that you thought were in my current job description? Hah.\n\nThe best part is, they have to pay me on the weekends to work overtime pay for doing a job that comes so easy for me and I actually enjoy doing, because I'm really the only one qualified to do it. Their loss.",
            "This resonates with me in a very surreal way. I used to work for a very similar sounding company years ago. Honestly, reading this made me wonder if it could have been the same place, but I doubt it.\n\n\nI worked for a third party seller on Amazon. You know when you go buy something on Amazon, there's the \"also available from these sellers\" link? It was one of those sellers. I found the job on Craigslist after I had to drop out of college. After putting in a lot of resumes everywhere and not hearing anything or being straight up told \"there's nothing available\", I decided to check the ol' CL. Found a job offer that sounded really simple. Sounded like typical secreterial stuff. Answering emails, doing business stuff in Excel. That sorta thing. Went to the place for an interview, and let's just say the position available was NOT what was advertised. They basically needed another person to pull and process orders. We did more than just sell stuff on Amazon, it also doubled as a buyback company. All of the warehouse inventory originated from people mailing books and stuff to us, which we'd then grade on quality and list on Amazon using some black magic programs and custom made front end software. The person who sent the books would then be paid by the system automatically based on the quality of the items. I took the job because I didn't have anywhere else to go, and they were eager to hire me. So I did it.\n\nNow...this place SUCKED. The people who I worked with had seen tons of people come and go. Some left after day 1 never to return again. The warehouse had no heating or cooling. And since it was full of books, some interesting thermodynamics would happen. In the winter, it was around 20 degrees cooler inside. In the summer, about 20 degrees hotter. The books basically acted like an insulator. Trapping cold air in during the winter and releasing humidity and moisture in the summer. When it was cold, it was COLD. Four layers of clothes and your still shivering cold. And when it was hot? Fuck me. It'd feel reasonably nice outside, but the instant you walked in you felt like you were right in the thermal wake of a blast furnace.\n\nApart from that, hours were LONG. This didn't bother me until I felt I was not making enough money to make me feel like it was worth it. I'm talking wake up and leave when it's dark and come home when it's dark. 12-16 hour days were commonplace. Weekends too, of course. We had propane heaters to use in the winter but the boss rarely refilled them. Most of the time we'd rotate on who gets to chip in that week to refill the tanks. We had some big monster propane tanks as well as some garage blowers, but we weren't allowed to use them. Those were to keep the label printers warm for shipping. The boss was shitty too. On some levels I think he was a well meaning guy but there were lots of things he did that were contrary to that. Around February we got a lot of snow and ice. Our usual shipping person had to leave to pick up her kids from school, so it was up to me and my other coworker to not only process all the buyback orders, but pull the rest of the shipping orders and process them and get them over to the post office before 2. We had to load up 3 carts, maybe 1500lbs total, and get it all over to the post office. It was right down the sidewalk.\n\nWe were carting the first batch of bags out the warehouse, and it was damn near impossible for us to get it through all the snow. We had to get it maybe 60 feet down the sidewalk. It took us 20 minutes. Our boss came out, and said \"maybe you should shovel this\", then hopped in his massive Escalade and drove off.\n\nAfter getting two of the three carts finally to the receiving deck at the post office, my coworker left to go get the final cart. As I'm loading all the bags in, the postmaster tells me we're too late. It was 2:05. I'm pissed. My coworker was even more pissed after she just moved the last cart over by herself.\n\nWe brought everything back over and informed the boss. Of course, it was all OUR fault. That was when me and her decided it was probably time to find some new work. That was a really hard decision for me to make because I didn't want to leave my co-workers behind to handle all that bullshit without me, but getting a new job was the best thing I've ever done. I put in so much time one week, more than I ever have, and barely broke $1,000 on that check. That was what really did me in. \n\nI still drive by that place every day on my way to my new job (I've been here for 4 years now). I still wonder how many of the original crew is still there...\n\nAnyway whoa this is a huge wall of text. Wasn't expecting to go on that much of a rant. But if you read this OP, I hope you understand that I sympathize with you completely. I hope your new job has been a much better experience for you.\n\n\n",
            "I was a picker at an amazon warehouse and would consistently be wayyyy above quota.  More than triple some of the other workers. I was going to convert from temp to amazon employee. They said it would take place in January. \n\nSo I apply, waiting on January, and then BAM, come take your drug test for conversion. Well I was taking Vyvanse (amphetamines) which is why my numbers were so high and then I lose the job because of a failed drug test. \n\nI had planned on just doing the bare minimum after Christmas since there was no longer going to be incentives.  But I decided right then, if I ever work another job with quotas, I’m either doing the bare minimum or negotiating higher pay for extra work. ",
            "I would have asked for back pay lol",
            "https://youtu.be/jYXzHjbfMDk",
            "Iron mountain? They did it to me ",
            "Sounds like Staples\n",
            "Haha I used to work the same kinda job for a couple months for a company that made like brake lights and stuff",
            "This sounds like an Amazon FBA warehouse. ",
            "Why exactly would you be getting back pay?\n\nThere’s no reason you should.",
            "Haha this sounds exactly like Albertsons Warehouse. I worked there for awhile. Same exact expectations case per hour, labels. Same deal. They gave an attractive starting wage but then no raises for awhile. ",
            "Classic work-to-rule.",
            "Did you work at company that started with the letter, “V”?",
            "I'm expecting you can't answer this, but did you used to work at a place that might rhyme with gnome cheapo? I have a feeling I may have sorta also worked at a place like your old job with that attitude about \"hey let's make the best employee work twice as hard for the same money the lazy guy does.\"",
            "This is more r/pettyrevenge territory than malicious compliance",
            "I'm reading all these stories in the comments and man, am I glad I live in a country where it's not employer vs employee but employer vs trade unions and the state. If an employer ever fires me because I refused to do things that weren't part of the contract, all it takes is one phone call to the relevant trade union and they're in big trouble.",
            "What you did is a pretty classic type of labour protest, called working to rule I believe.",
            "I had a packing job in college,  the job was super easy,  they had a quota to meet,  and I was almost always double the speed,  people got mad at me,  apparently if the targets were consistently beaten then they raised the targets for everyone.  I ended up just helping people meet their targets.  It was the evening shift and the manager was not really a company man.",
            "I was pushing for a promotion during reviews, to bring me closer in title to my peers.  I was told that they didn't know if that was doable.  So I told my manager that that was fine, I would scale back the work I do as an analyst, and resume being a technician. Meaning I'd stop fixing issues as they came in, and just create tickets to send to overwork groups.  \n\nI didn't get the promotion.  Didn't get fired either, but they noticed when I stopped \"going above and beyond\" and am now slated for a nice merit raise followed by a title change/promotion w/ another nice raise.",
            "http://dilbert.com/strip/2011-12-21"
        ]
    },
    {
        "post_id": "12aiera",
        "author": "Sarasil",
        "title": "You want to send me home? Sounds good!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/12aiera/you_want_to_send_me_home_sounds_good/",
        "score": 13367,
        "num_comments": 229,
        "created_utc": 1680523797.0,
        "selftext": "So I was a sarcastic and easily annoyed guy in my 20s, and this often didn't help me get along with older or corporate types.\n\nI was working at a certain pumpkin-colored big box home improvement store one spring, in the flooring department. It was just starting to get warm out and the store didn't have much AC, so I was looking forward to a magical date where certain employees were allowed to switch their pants for shorts.\n\nProblem is that we had a new department manager, I'll call him Dick, who was aggressively chasing a promotion to Assistant Manager, then store manager. He thought he could accomplish that by being a super by-the-book hardass and being relentlessly metrics focused. This translated into a manager who was a know-it-all, micro-managing dick.\n\nAnyway, I'm scheduled to open at 5am one day on the fabled day of cooler bottom-wear and I walk in all light and airy and bare-legged. Dick, who was overnight manager the previous night, saw me and threw a fit.\n\n\"Why are you out of uniform?\" He asked.\n\n\"I'm not. I can wear shorts starting today!\" I proclaimed.\n\n\"Not your position in your department. Who told you that you could?\" He retorted.\n\n\"The employee handbook and SOP? I can show you if you don't believe me.\" I offered.\n\n\"I know the SOP and your department doesn't get to wear shorts. That's only Garden. Go home and change right now.\" He demanded, face getting redder from my defiance.\n\n\"Ok Dick, if that's how you want to play it. I'll be back in an hour.\" I sighed.\n\n\"Maybe the loss of an hour of pay will teach you something.\"\n\nSo I know better. The reason I know better is because I'm one of the weirdoes who actually read the entire Standard Operating Procedure document, the employee handbook (which is actually just a subsection of the SOP), and I really hate being wrong, so I checked the SOP before doing anything different day-to-day. In my store, the SOP was like invoking god. If the SOP said so, that won every single argument.\n\nSo I go home, change into pants, but bring my shorts back to work with me. By now, Dick's shift is over and I ask the new morning Manager On Duty, Daren, to meet with me.\n\n\"Why, what's up?\"\n\"Oh, just an SOP issue.\"\n\"Oh... ok. Give me like, 10 minutes?\"\n\nSo I swung bynmy desk and printed out several things.\n1. My latest pay stub that included my official job title and department number.\n2. The company directory that listed the department names and their associated numbers.\n3. The SOP that dealt with when and which departments/employees can wear shorts.\n4. The annual email from the Regional VP confirming which departments could wear shorts starting when, which also included the line \"and this letter is to be posted at the time clock between the dates of xxx-xxx\"\n5. The SOP detailing the company transportation and mileage reimbursement policy.\n6. A Google maps route that mirrored the route I take to and from work, with the total mileage highlighted.\n\nSo, I meet with Daren and explained what happened and handed him each page in turn as they became relevant. At the end, we agreed that I was right on every single account and asked me what I wanted.\n\n1. I want the time. I was turned away before I could clock in so I want to be paid starting at 5am. Feel free to check the CCTV if you want to confirm when I arrived.\n2. I want the mileage, because Dick sent me on essentially a company errand with my own vehicle through no fault of my own.\n3. I want this letter posted at the clock, like it says it's supposed to be.\n4. I want you to talk to Dick about this, because I told him this was the SOP before he sent me home.\n5. I'm changing back into my shorts.\n\n\"All of that sounds more than fair. Get the paperwork for the clock adjustment and mileage to me today and I'll sign it.\"\n\nThe letter mysteriously went missing from the time clock the next day, but I replaced it everyday until I happened to see Dick angrily snatch it off the board and throw it away. I reported that as well and the letter stopped going missing.\n\nHe didn't talk to me much and I was tranferred to another department a month later, so all in all win-win I think.\n\nEdit: Now that I'm home and at an actual computer, minor edits for spelling and grammar.",
        "permalink": "/r/MaliciousCompliance/comments/12aiera/you_want_to_send_me_home_sounds_good/",
        "comments": [
            "Hilarious that 'Dick' thought that being by-the-book \\*really\\* meant being a humorless hardass to his EMPLOYEES while HE was fine with violating company rules by hiding that he was lying and in the wrong.",
            "Nothing like using SOP to show Dick that he’s acting like a dick",
            "And that's how you get dick bosses to follow company rules. \n\nGood on you!!!",
            "Great story. My only problem with calling it a win-win is that it seems dick never faces any real consequences. But otherwise malicious compliance at its best",
            "It absolutely amazes me that people do not read an employee handbook on their job. Although I was a protected civil servant, I had a brother who was an absolute troublemaker on the job when being bullied by supervisors. He literally had a copy of the employee handbook of every job he worked at, usually a hard copy at home. He also had a folder of many state and federal laws and mandates that people need to be aware of. One day when I visited him to watch football on Sunday he was using a yellow highlighter for every section of the handbook that might come in use.",
            "Had the same situation when I was an associate at the same pumpkin colored retailer.\n\nStarted as a cashier, and when I got bored at Returns I’d read the SOP’s on a spare computer on the service desk.\n\nHead cashier who was a sour faced b told me to do something one day which was in violation of SOP. I politely declined. 15 minutes later I get the Walk Of Shame, “come with me” to the office. I get confronted by the FES and HC for “refusal” and when I brought up SOP, FES snapped at me saying “I don’t care about that, do what you’re told!”.\n\nMy response was “ok, write me up. No, really, go ahead.” Needless to say, it didn’t happen 😂",
            "It sounds like Dick got ...\n\n*puts on sunglasses*\n\n... the shorts end of the stick.",
            "Damn, you could have easily made this a quick \"hey, I don't think Dick is following SOP and it sucks for me. Can you tell him he's wrong?\" thing and called it a day. But getting that hour and even mileage back? Well done!",
            "Good for you.  Fantastic that you knew every inch of the SOP and made the upper bosses aware!  Excellent job!!\n\n(Just wondering, did you ever think of becoming a  manager?)",
            "Oh that orange place has got problems.  My co-worker had to wear a \"I'd Nail That\" t-shirt and she got all sorts of unwanted comments from customers and co-workers.",
            "Wait. So this email is SPECIFICALLY supposed to be posted there, and Dick is removing it?",
            "Dick. One of the people upper management relies on to be an adult. Thinking things through, making correct decisions. \n\nSigh…..",
            "> So I was a sarcastic and easily annoyed guy in my 20s, and this often didn't help me get along with older or corporate types.\n\nWait, I'm pushing 50. I was supposed to outgrow this? _Shit._ Nobody told me!",
            "Dick should have been fired for removing official HR/benefits related documentation from the assigned employee notification space.",
            ">The letter mysteriously went missing from the time clock the next day, but I replaced it everyday until I happened to see Dick angrily snatch it off the board and throw it away\n\nIsn't that in violation of the SOP's?! Dick by name........",
            "Always found it weird when employers would prefer their staff to be uncomfortable and inefficient.  Not sure what they're trying to prove by forcing workers to wear long pants.\n\nI get it when you may need long pants for PPE, but most of the time that's not the case.\n\nThey say it \"looks professional\" but IMO it looks as fucking stupid as wearing shorts and a tank top in -10°C would look.  Also, \"looks professional\" is a dumb metric in the first place.  Acting professionally and doing good work should be the focus.",
            "Great Job",
            "Excellent shorts story.",
            "If you're going to be a hard-ass by-the-book manager, you'd better know the damn book.",
            "Rules are rules. Because I said so is not a rule.\n\nThese people end up hurting businesses more than helping them. The upper management seems like they still didn't get it or him out of his position.",
            "I love a good MC due to company policies!",
            ">I'll call his Dick\n\nI have so many jokes on this miss-spelling I don't know where to start",
            "[deleted]",
            ">  He thought he could accomplish that by being a super by-the-book hardass and \n\nand completely ignoring the book if he got a bug up his ass.",
            "I work for this store now, and we don’t even do this anymore. Wanna wear shorts in -20? Go for it. As long as they’re not basketball shorts, you’re good to go.",
            "ACTUAL malicious compliance! Bless you, sir.",
            "Over the years here in Australia I have worked many short term jobs. When I sign on the contract or if the host company has one an EBA (Enterprise Bargaining Agreement) I always read it first & if it's a FIFO job, take a copy with me. Generally I've been treated alright, but I have educated many a full time employee about what their entitlements are.\nNow days with internet access, this phone is a treasure trove of needed info to ensure I'm not getting ripped off.",
            "> [W]e had a new department manager, I'll call his Dick\n\nOP: [Takes out phone, dials]\n\nCUT TO: STORE, INTERIOR, A FEW AISLES AWAY\n\nNew Department Manager is walking down the plumbing aisle when suddenly his CROTCH VIBRATES. \n\nTINY VOICE INSIDE HIS PANTS: Hello?",
            "It really makes no sense that employers can dictate uniform to that degree. It shouldn't be \"It's summer now so we'll allow shorts for exactly 3 months,\" it should be \"Here's your uniform, we have shorts available for purchase should you be uncomfortable with the pants at any point of the year.\"\n\nI mean, shit, you shouldn't even have to pay for it. At my job you do though. Why is every employer obsessed with making everybody wear full length pants? If I'm too hot for pants, I'm too hot for pants. Shouldn't matter what month it is.",
            "This is gold, great job",
            "This was a pleasure to read. Thank you.",
            "You in Ohio by any chance? That Daren character seems familiar",
            "The long game. Outstanding",
            "Dick mustve felt that you were a bigger and righteous dick than him.",
            "I don't know about win-win. Sounds like Dick lost, because the only way he could win is if he got away with being a dick. And that you did not let him do.",
            "As I ha e told people before, know the rules inside and out and make them work for you.",
            "Wow. Dick has no idea how to manage people.",
            "I really needed this today. Thank you. It's people like you who make jobs a little sweeter.",
            "\"Eat my shorts, Dick! \"",
            "Wow.  I remember getting into a similar argument about wearing shorts when I worked at the blue store that sells everything.  Also the bullseye store they compete with. I guess Dick really gets around.  Lol",
            "That Dick did not have a thing for skin. He will now be known as Shorts Dick.",
            "It seems Dick is a highly qualified ID10T ?",
            "What a sopping Dick",
            "He won't go far.  Not the way he is wearing his pants currently.",
            "Moral of the story: Don't be a Dick.",
            "Dick sounds like he has a future in law enforcement.",
            "Oh, I like you OP",
            "Nice work! You should be an attorney.",
            "I wonder how many Homer badges Dick has. Lol.",
            ">I'll call his Dick\n\nWhat did his dick had to say about this situation? (I know it's a typo, but it's fun anyways)\n\n&#x200B;\n\n>Gibr me like, 10 minutes?\n\nAgain I know it's a typo, but again it's going to be fun to use \"gibr\" instead of \"give\".   \nI enjoy (and nurture, even cherish) some dyslexic stuff happening in my brain. Those typos are no use in-person, but for keyboard stuff they're new to me, and I anticipate to artistically implemnt them in a professional email.",
            "That’s some CEO energy shown by you right there. Bravo!!",
            "\"I'm allowed to fuck over whomever I want! HOW DARE YOu MAKE IT OBVIOUS I CAN'T?!?\"",
            "In the great words of XXX, \"Don't be a dick, Dick!\"",
            "I think op missed an opportunity in this glorious story. \n\nI was hoping to hear him sigh and unzip in front of the managers to change back into shorts.",
            "I love it when revenge happens by the book. It's one of my favorite things of all time.",
            "Dude... I still bleed orange from my experiences there.\n\nYOU, SIR, ARE A GOD!  \n\nI wish I had been a fly in the wall...",
            "Why the fuck do companies get to decide people can't wear shorts?  Its the most petty fucking bullshit I was never aware about until one of my coworker's was getting sent home.",
            "> Problem is we had a new Department Manager, I'll call *his* Dick\n\n\nBoy I wonder what the SOP had to say about that.",
            "Thank you for holding the pumpkin flavored, store management accountable. That's one way to make the workplace better.",
            "I love it when you beat a dick. Good job.",
            "Curious why you chose to anonymise him with the name “Dick”?",
            "I wish you had picked the letter right back out of the trash and stuck it back on the time clock right in front of him XD",
            "I want this made into a tv sketch. I want Dick to play dick and have to relive it again",
            "\"super by the book hardass\"... Throws out the book daily...",
            "But did his being a super by-the-book hardass and being relentlessly metrics focused end up affecting his promotion chase?",
            "There should be a character name checks out version of username checks out.",
            "EXCELLENT!",
            "I love you ❤️ 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼",
            "Interesting Baader-Meinhof effect here. I just saw nominative determinism pop up the other day, and here it is again.",
            "https://youtu.be/afxTROGnvkw?t=128",
            "> I'll call his Dick,\n\nYour Freudian Slip is showing...",
            "Looks like you had a stroke about halfway through typing this, you okay?",
            "It's the orange way👀. Good on ya! You going for a lifer position or getting out while you're back still works and your lungs are clear?\n\n(I did a stint in flooring too)",
            "\"super by the book hardass\"... Throws out the book daily...",
            "I like your style and Darren sounds like a solid dude.",
            "\"Dick, dick, dick, dick, dick, dick, dick, dick, dick.\"\n\n\"That's a lot of dicks.\"",
            "Maybe he'll have better luck in sporting goods or porn. He should stick to his own.",
            "Cute story.  Know any that are about malicious compliance?",
            "Did Dick end up getting promoted?"
        ]
    },
    {
        "post_id": "k26w99",
        "author": "DustyBronco",
        "title": "I have to wrap all the Christmas presents myself? OK, I’ll make that known.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k26w99/i_have_to_wrap_all_the_christmas_presents_myself/",
        "score": 13363,
        "num_comments": 383,
        "created_utc": 1606502384.0,
        "selftext": "When I was a kid, my dad could really be a dick sometimes. He broke rules all his life but would swiftly and gleefully punish me if I didn’t do exactly what he wanted without question.  \n\nWell one Christmas season we went out shopping for my mom and spent the whole day crawling the mall. When we got back home, he told me that I would be wrapping all the presents myself.  \n\n“You’re not going to help me?”  \n\n“No, I paid for them, you can wrap them.”  \n\nI was 12 years old, was I expected to buy presents? I knew better than to fight with him though so I did exactly what he asked.   \n\nAnd when it came time to sign the “From:” line on each present’s tag, I wrote my name and my name alone. After all, if he was here, he could sign it. Heck, if he checked the presents before Christmas he could sign them.  \n\nBut of course, he didn’t.   \n\nAnd when we unwrapped presents my mom wondered out loud why every gift to her was from me.  \n\nHe got so mad and tried to make me feel bad about it. But when I explained it in front of both of them, he got quiet and stopped.  \n\nFrom that point on, I had help wrapping each year.  \n\nEdit: thank you all for sharing your own holiday wrapping and family stories, it’s been a blast to read through them. And yes, I do enjoy wrapping presents nowadays!",
        "permalink": "/r/MaliciousCompliance/comments/k26w99/i_have_to_wrap_all_the_christmas_presents_myself/",
        "comments": [
            "This makes me glad my dads issue with wrapping gifts just involved a funny excuse.\n\nMy dad can’t wrap gifts to save his life, gift bags and gift boxes are a godsend for this man. On the occasions he settled for wrapping paper that gift was wrapped by Rudolf and it was wrapped badly because Rudolf doesn’t have thumbs.",
            "Served him right.  Exactly how did he expect a kid to get anything good without money when kids don't have money.",
            "> When I was a kid, my dad could really be a dick sometimes. He broke rules all his life but would swiftly and gleefully punish me if I didn’t do exactly what he wanted without question.\n\nBy comparison, my hope is that my children remember me in some or all of the following ways:\n\n- Dad made an effort.\n- Dad cared.\n- Dad really listened.\n- I could really talk to Dad.\n- Dad was always there.\n- I was lucky.\n- Dad loved being our dad.\n- Dad really loved Mom.\n- I miss him.",
            "Lol, love this. And honestly congrats at having neat enough wrapping skills as a 12 year old that it passed muster at first glance",
            "I would gladly wrap all the presents except things that were to be my gift.  One year mum asked me to make decorations for give certificates (I’m a wrapping nerd), and all I said was don’t use these on my gifts.  Low and behold, she got me to make my own Christmas gift decorations",
            "My husband was forced to wrap his own birthday gifts growing up. As in, a few days before his birthday he would be told to go wrap them, then on his birthday he opened the gifts he had wrapped.",
            "Good job.\nHowever, my dad asks me every year to wrap my mums Christmas and birthday presents. I love it! My mum often has a massive list of presents to be wrapped for me to take on too. \nI sit in the middle of the living room with some easy tv on, with a list of presents, pre written out tags and piles of presents and paper. I make a little nest cocoon of Christmas around me, box myself into too small a space and get to work. It is really christmassy for me.\nThe difference here though is they ask me. It isn't a punishment or requirement and I actually enjoy the process.",
            "One year my brother wrote \"to: you, from: me\" on every present he gave. We are not a small family, and it was equally hilarious and infuriating.",
            "When I was a kid, every year my mother would wrap presents with me and she was very particular about how they were wrapped. She did all the wrapping in the house.   \nAround the age of 8 or 9, my wrapping no longer differed from hers at all. So, I did the logical thing - I used a sharp knife and cut the tape on all my presents 1 by 1. Then, I unwrapped them, looked at the gift, and refolded them and taped them in exactly the same places she did.   \n\n\nI didn't do it the next year though, knowing in advance every single thing you are getting really does suck.",
            "Not really relevant but I'm so bad at wrapping that I used to blindfold my gf so she could wrap her own present",
            "I have a cousin who did the most amazing thing years ago. His kids all got jobs when they were old enough. So my one second cousin got a job at the grocery store bag and groceries. It was a union job so the money was real good. His dad charged him rent once he turned 18. When he told his dad that he wanted to move out into his own apartment, his dad gave him all of his rent back, having invested it, and he ended up putting a down payment on a house in the same neighborhood.\n\nHe's in his fifties now and still lives in the same neighborhood as his parents.\n\nI thought that was pretty good parenting.",
            "Lol, my mum used to make me wrap random presents. I would alternate signing them from Santa and Satan. Took three years before she figured it out. Nowadays (adult now) she will wrap a few from Santa, from Satan and from Claws (her cat).",
            "I’m 15 and I work, and I’m expected to buy my own things, minus food and house. However, every time I want to buys something I have been saving for (AKA Books, I love reading) I’m told I’m not allowed. Whenever I protest this my mum is all \n“When I was your age I had to pay 2/3 of my pay in rent”\n“When I worked I didn’t get to buy anything with the money”\nYa well mum you tell me all the time how much you hated how your parents parented you, why do you repeat it",
            "If my child did that, I’d enjoy it and look back on it with wistful pride for the rest of my life.",
            "Starting around 12, I was always the one who wrapped presents in my family. I guess I was the only one that cared about them actually being wrapped and not just in whatever shipping box it got sent to us in. I would always decorate with bows and ribbons and would always try to make them unique. Got pretty good at it actually. I’ve always been a fan of the presentation as well as putting a lot of thought into the present itself for the individual. Finally I told my family I was drawing the line and I wouldn’t wrap my own presents, cause I was never surprised on Christmas morning. And of course I could always tell which ones were mine without having to look at the label, since the presents didn’t “Look pretty” lol.",
            "Exactly something my dad would pull except he would threaten me with some punishment if my mom found out/I told her that he had me do it. \n\nThere are many reasons why I don't have a good relationship with my dad now as an adult, even though he can't seem to fathom why I don't return his texts. Now he's the genial old guy who just wants to be friends. Well, I don't forget what he was like when I was growing up.",
            "Malicious Compliance to crappy parent's BS has a special place in my heart.",
            "Probably missing a lot of lived context, but this honestly sounds like your dad just giving you a perfectly legitimate chore.",
            "Not the point of the story, but wrapping gifts isn’t hard. I started wrapping gifts at about 6 yo.",
            "I was about that age when I scraped together some money to buy presents for my family on Christmas. It wasn't much but I had paid for it with my own money. All my family could do was complain about the presents. This was the last time I participated in gift giving with them.",
            ">  He broke rules all his life but would swiftly and gleefully punish me if I didn’t do exactly what he wanted without question. \n\nAh yes, do as I say, not as I do.  I heard that so many times growing up.\n\nI never used that line on my kid.",
            "Your dad may have sucked in other ways, but asking a 12yo to wrap gifts isn't particularly heinous. I agree it was up to him to sign his own name, but this is hardly malicious compliance-worthy.",
            "I don’t understand being a jerk about wrapping presents. A 12-year-old is perfectly capable of doing this. Just sit yourself in front of the tv and finish up the gifts. Geez.",
            "you were so close to getting all of the presents\n\n from: dad \nto: dusty bronco\n\n'Dont know why dad got me this womens sweater, but im so nice ill give it to mom'",
            "Yeah Asian kids reading this. Don't.",
            "Fuck your narcissistic dad",
            "I loved wrapping presets as a kid. All the cousins for the same thing from the aunt's and uncles, and one year my mom had me wrap them all. I was GENUINELY surprised to have one handed to me to open - it never got through my OOOO SPARKLY haze while I was wrapping, that I had wrapped my own present.",
            "God forbid your parents give you chores to do",
            "Oh no! Dad wanted you to wrap presents. You’re a brat if you thought this request was out of line.",
            "My dad would beat the crap out of me for that.",
            "You rock.",
            "Ah, nothing better than the old \"Rules for thee, but not for me.\" Well done OP.",
            "Lmao I wrap all of my dad’s gifts to my mom because I help pick them out and he can’t wrap for shit 😂😂",
            "Bahaha!\n\nI was in charge of wrapping each year once my family discovered how good I am at it. I actually enjoy it, so it's not bad.",
            "OMG I did the same thing as a kid!  I wrapped my whole family's presents with my sister and mom, including my own.  My mom was not happy when we unwrapped presents that year, but I sure wasn't asked to do it again!  Way to ruin the fun of opening presents, Mom!",
            "I was totally expected/ made to wrap all of my stepdad's gifts to my mom from the time he got on the scene at about 5 yrs old until I moved out at 18. I'm pretty sure that was deemed a 'girl job' (eyeroll).",
            "That's actually genius and made them see it from your pov, glad everyone pitches in now and makes it a family tradition.",
            "I'd wrap things like 5 times with different paper each time, was great fun for me",
            "This is such a non issue that I can't even believe it.\n\nI always wrapped the presents my dad helped me get because yes, him paying and me wrapping seems fair enough to me.\n\nAnd my mother wouldn't need a tag to know that at the age of 12, a present from me is a present from me and my dad.",
            "I’m really really REALLY bad at wrapping g presents. I’ve tried to make it look nice for YEARS. Even watching YouTube video tutorials. It always comes out awful, so my family always know what presents come from me, but they all enjoy it. One year i bagged everything all pretty and my mom and dad seemed a little sad they didn’t get the usual poorly wrapped gifts so i decided to just suck it up and wrap them ever since.",
            "I am trying to figure out words to reply to your post.  At the age of 12 I had saved enough for Christmas by saving my allowance and some babysitting gigs. This was mid 70's. Helping wrap was part of the deal. My parents would ask if I was short any money for family presents.  Tada! Wrapped those on my own. Mom would sometimes bring a gift to my room and ask for me to wrap so it could be a secret.  Grow a pair dude. If this is the worst life throws at you just wrap the damn gift! Exactly how much energy does that take. I dispise wrapping . I do that for my family bc that's how it is. Jesus Christ! My gifts look like shit. Bc I hate to wrap. Doesn't matter as long as they are Wrapped.  Help out once and a while btw life isn't fair. Deal with it",
            "Nah, sounds kinda like you were being a shit.\nIt’s literally the smallest problem I can think of.\nAm I correct here?\nYour dad took you shopping to buy gifts, for you mom.\nHe paid, you wrapped them. (OH NO SLAVE MASTER MADE ME WRAP PRESENTS) and then when you signed them, dad wanted credit too?\nAll you did was wrap the shit.\nI really don’t get this post lol, sounds like a salty kid who carried ridiculous anger through life for no fucking reason then bitched about it on an obscure underwater basket weaving site in the year 2020.\n\nAre you really complaining that daddy made you wrap presents???? The fuck is this lmfaoooo",
            "I wish I had thought of this. \n\nTo be fair, it wasn’t that my grandma necessarily *made* me... just she was a horrible procrastinator. \n\nSo I ended up wrapping everything that wasn’t for me. Four brothers, my mom, dad, grandfather, whoever I was dating. \n\nShe did other things to get ready while I wrapped, but Jesus, that shit takes forever. \n\nPlus presents I bought and in time, my son’s presents (which were considerable because we never cross reference what we buy). \n\nEvery year we would promise each other we would do better next year. \n\nDamn lie.",
            "I used to charge my dad $1 per present I wrapped. Sounds like you missed a money making opportunity.",
            "And you sound like an entitled dick",
            "I clap gleefully for 12 year old you.",
            "Ohhhhhh boy another generic angsty kid post about having to do chores.  So edgy and original",
            "Like... this isn't that bad of your dad. My dad always made us wrap the Christmas presents once we learned how to. \n\nWhy is this considered a bad thing? I kind of have always been fine with it? They paid for my life and my gifts and my gifts that were from me to them even. Why is it asking too much to just have me wrap some?",
            "That’s a very self assured thing for a 12 year old to do.  How is this carried though your life, if at all?",
            "I dont see issue with handing out a choir. I would of laughed if my son put his name on everything l.",
            "I don't see what's so unreasonable about getting a 12 yo to do this work.",
            "I was in highschool when I learned how to wrap presents. My sisters bought my mom a bunch of plates and left a giant very breakable box for me to wrap... it did not look good",
            "You may as well get off your \"entitled \" ass yourself. NOBODY owes you shit. Earn your own fucking keep :)",
            "> I was 12 years old, was I expected to buy presents?\n\nI mean, yeah? I bought Christmas (Stm Nicholas) gifts from my allowance since the year I stopped believing, and I was expected to buy birthday gifts since the concept of allowance was introduced at 4 years old.\n\nPlanning to do the same with my kids.",
            "That's such a first world problem just wrap the freaking presents lol. I totally agree with your dad, though I'd probably WANT to wrap some of them.",
            "Btw i am charming af. Never once did one of my kids balk at wrapping gifts for a family member. Are you too busy to give up 10 min to help?",
            "And you think the world owes you something! Crippling anxiety and the fact that everything revolves around. You is a sure way to get your little bitty feelings hurt every time. Give me a break!",
            "You were a dick. \n\nHe could have actually been mean and just not let you use his money for any gift.\n\nOh, and when I was twelve, I had had a paper route for two years and did have my own money.\n\nWhen I was thirteen and my parents wouldn’t buy me jeans (polyester clothes and all), and told me to buy my own, I then had to do my own laundry. \n\nGrow up.",
            "Jesus, you both sounded so self-centered and hateful. I’m guessing you didn’t care about your mom’s feelings in all this. Like maybe she felt terrible that you resented wrapping her gifts that much after all she did for you that year, day in and out?",
            "I mean, you were twelve dude... wrapping gifts ain’t that hard. I don’t understand what you’re complaining about tbh. He paid for the gifts, why shouldn’t you pitch in by wrapping them? It’s not like you were 5 and didn’t have the motor skills to do it. You just sound whinny tbh",
            "If I were your dad I’d do the same thing next year but make the gifts really awkward. ;-)  \n“Ooh and another gift from /u/DustyBronco! Lace panties? Wtf?”",
            "No you get over your entitled self. Is electric provided and a roof over your head. A little group effort never killed anybody gen x",
            "What's so bad about having to wrap the gifts?",
            "I hate the Christmas season. My Step Mom loved to decorate for Christmas and had boxes upon boxes upon boxes of decorations. We kept them in the attic, but it was the kids who brought them down, and the kids who put them up there, and the kids who helped pack them up by asking Mom what box to put items in.\n\nEvery Christmas without fail, there would be \"a missing piece\". And every year we were told to go to the attic (no heat, usually 40 degrees or less) and we were to stay there until we found that missing decoration. There were times my siblings and I stayed up there for hours, left only when she went to bed, just to get woken up by her screaming, \"why aren't you looking for my Christmas decorations!\" \n\nI still have a hard time enjoying Christmas, and just bullshit it for my kids.",
            "So you childhood memory is tainted by having to wrap presents alone?\nWow.. tough life. Lots to unpack here. \nThen your vindictive act of only putting your name on the gifts, boy you showed him.\nYour father may have been a dick but you’ve obviously followed in his footsteps.",
            "[removed]",
            "Genius.",
            "I'm shit at wrapping presents and it's worse now I've got nerve damage in one hand. I rope my son in to help so he can shoulder some of the blame (though thankfully nobody cares in my family and my husband does all the wrapping for his side)",
            "Should have put his Ex name or co worker",
            "I appreciate that my parents were too broke to afford wrapping paper now.",
            "Mom: I need you to wrap these. \n\nMe: All of them?\n\nMom: Yeah, and I taped yours shut.\n\nMe: I'm wrapping my own?\n\nMom: walks off",
            "This is where my asian dad would have seriously whooped my ass.",
            "Kids wrap their own presents? Something has clearly changed since I last bothered with xmas.",
            "He didn’t think at the time to speak up and say “I paid for them so op wrapped them”. Your mom would have been like, “no. No. The tag says one name and it’s set in stone” ?????",
            "You came up with this at 12 years old?  You are an epic genius!!!\n\nDid this lead to being able to pull the rug out from under him in other circumstances?  More stories!!!",
            "my dad makes my sister and i wrap each others presents because if we left it to him they just wouldn't get wrapped lmao",
            "I feel the opposite.1. My dad never buy presents. 2. I love wrapping presents. :(",
            "How do we wrap gifts?  Bow and name tag stuck on an old Amazon box.",
            "We wrapped presents for our extended relatives from our parents. It just meant that they had more time to cook.",
            "I hate it when parents say \"I paid for it\" as a reason to get away with stuff.\n\nI work for a site called Not Always Right and our readers really appreciate stories like these. Would it be okay with you if we shared your story on our site? Please let me know if that's cool?\n\nThanks again for the great story!"
        ]
    },
    {
        "post_id": "azhb7o",
        "author": "ThrowAway2846921",
        "title": "Loan agency demands $1000. My mom happily obliges.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/azhb7o/loan_agency_demands_1000_my_mom_happily_obliges/",
        "score": 13359,
        "num_comments": 634,
        "created_utc": 1552235182.0,
        "selftext": "My mom was charged $1000 for a loan despite having paid it off due to hidden fees which they lied about. This was before internet, mind you. It was also when it was legal to pay in pennies. (You know where this is going.)\n\nMy mom collected coins and still does to this day. She had barrel full of pennies. According to Google, that was around $3000 worth. With the help of my dad and a dolly, she went to the loan office to pay the fee. There was no coin counting machines, so they they had to count by hand. They couldn't leave until they counted 100,000 pennies per company policy. My mom made small talk with the woman counting the money on occasion making her miss count. Several hours after the office closed and having to recount over and over again, the lady gave up and waived her fee. \n\nI wouldn't be surprised if my mom was the reason you can't pay in only pennies now. \n\nSorry about the lack of detail. My mom told me this story a couple years ago before I knew about this subreddit. I don't know if this is a true story or not because I wasn't even alive at the time, but according to my mom, it actually happened.\n\nEdit: turns out this story is not true and doesn't hold up to scrutiny as some of the comments pointed out. It's something I could easily see my mom doing, but it couldn't have happened.",
        "permalink": "/r/MaliciousCompliance/comments/azhb7o/loan_agency_demands_1000_my_mom_happily_obliges/",
        "comments": [
            "Distracting the woman who was counting elevates this SO much. ",
            "[deleted]",
            ">I don't know if this is a true story or not because I wasn't even alive at the time.\n\nI'm so glad you got better\n\n",
            "[deleted]",
            "[deleted]",
            "They can’t deny pennies. By US law and debt can be paid in any sums of money. ",
            "To all loan agencies,\n\nDON'T ATTACH HIDDEN COSTS\n\nSigned Op's Mom",
            "Your mom should have insisted on counting the pennies after the workers after a certain point, and every so often, complete with a ridiculous impression, said the following:\n\n\"Darn, I lost count! Wait, I AM THE COUNT! eh eh eh... One, one penny, eh eh eh... TWO! TWO PENNIES! EH EH EH...\"",
            "Pro tip: to screw up someone's count, say random numbers, especially ones near to the current count.  Works like a charm.  \n\n\nSource: I am a jerk.",
            "99,975 pennies and one quarter so it's not all pennies",
            ">It was also when it was legal to pay in pennies.\n\nIt's still legal to pay in pennies. It's never been mandatory to accept payment in pennies. ",
            "Technically they would still have to take pennies if offered. As it is legal tender for a debt you can't refuse the payment. That isn't the same as say a store not taking large bills since you don't owe them a debt.",
            "I would have just counted out 10,000 pennies and then weighed it, and then scooped out 9 more bags of pennies that weighed the same. As long as no tarnished dimes or wheat pennies get in there, it should be pretty much exact. All the pennies weigh exactly the same when they're minted.",
            "When my family starts counting the coin jar, I will chime in about some accident I saw on I-75, or 696, or 23. The mistress of finance bought a automatic coin sorter. Takes all the fun out of it. )^8",
            "I feel like this one is kind of a dick move. The lady at the counter wasnt the one who gave her the fine, and she probably got in shit later for taking so long",
            "[deleted]",
            "you are allowed to pay a DEBT with any us currency, this is why so many get away with doing this.\n\nCoinage Act of 1965\n\nhttps://www.treasury.gov/resource-center/faqs/Currency/Pages/legal-tender.aspx\n",
            "It's still legal to pay in pennies. They're still a valid form of currency. ",
            "My mum did this to me at school, had a school trip that was $40, she gave it to me in 10c and 20c pieces, I got screamed at by the bursar even though it wasn't my fault, she kicked up a stink and told the teachers I did it intentionally, I was given detention for \"wasting the bursar's time\" \n\nFucking mean old bitch knew I didn't do it but still punished me for it",
            "Great idea, punish the overworked teller instead of the management who actually did this to you.",
            "OP, please don't apologise for a concise but fitting story for this sub. Far too many people confuse this sub for /r/writingprompts when submitting a story. Great work OP",
            "See, if that lady were me, I’d have come back into the office with a calculator and a weighing scale or 5 as well as quite a few bowls.\nThen, I’d find the mass of each bowl, make a note. Then add 10 pennies and take away the mass of the bowl.\n\nIt would go as follows\nM  = mass total\nP = pennies mass\nT = ten pennies mass\nB = bowl mass\nP = (M/T-B)*10",
            "The purest form of evil being counteracted by the only countermeasure: bronze",
            "Love it. One of my dad's friends did this in the 70s and ended up in the paper. He purposely left it 10 pennies short just to fuck with them. Funny dude. ",
            "~~Samsung sent Apple 3 cube trucks full of pennies to pay for a lawsuit they lost. The amount was in the millions of dollars iirc. Maybe she's part of the reason, but not __the__ reason...~~\n\nApparently they did not...",
            "Nice, inconveniencing a random worker because of a shitty company",
            "Why can’t you pay in pennies like that anymore? It is legal tender, how can you legally refuse it?",
            ">This was before internet, mind you. \n\n>According to Google, that was around $3000 dollars worth. \n\nI smell bullshit. \n\n",
            "Better would have been to be a nickel short, then send them a check for a nickel over. They have to refund the difference, which is the cost of the refund check+envelope+stamp+refund amount. Only works for financial institutions and government though.",
            "> It was also when it was legal to pay in pennies.\n\nIs this in the U.S.?  I'd be interested to know what law was passed that precludes people from paying in pennies or any denomination?\n\nNot that I doubt you, I'm just wondering what you're referring to.",
            "“United States coins and currency (including Federal reserve notes and circulating notes of Federal reserve banks and national banks) are legal tender for all debts, public charges, taxes, and dues. Foreign gold or silver coins are not legal tender for debts.”\n\nUnless it is stated in the contract, they’re going to accept the payment. It’s a myth that they don’t have to accept pennies to pay debt. ",
            "A businessman in the next town over paid the DMV in pennies after they were jerks about something. ",
            "Cant pay in *only* pennies.\n\nIs it still okay if I throw in a single dime? ",
            "Fuck man that's like 330 pounds of pennies.",
            "your mom sounds like a penny pincher ",
            "Your mom did the right 5hing to the wrong person",
            "[deleted]",
            "That's pretty fucked making something count all that. Some one just working a job. Your mom didnt read the fine print and the lady counting didnt write the contract. This is fucked.",
            "Weigh and divide. ",
            "It's still a legal right to pay a debt in pennies. An organization has the right to refuse a sale in pennies, but not a debt. If you go grocery shopping and then attempt to pay in pennies, they can refuse to sell you the merchandise you have chosen.\n\nBut when you have a debt, you have the right to pay it off with legal tender in any form you wish.  ",
            "I don’t care if this pissed the wrong person off, this worked so who gives a shit.",
            "Since when is it illegal to pay in pennies?",
            "Man this reminds me of the time I worked as an insurance agent.   \n\n\nWe had a grumpy old man customer who's recurring premium was under 100 dollars. He would come in to the office and bitch and say we were thieves and liars etc. Twice he came in and paid with pennies. The second time he did this, one of our leads went out and started counting it out before he would write out a receipt. Every time he opened his mouth or sighed, the lead would \"forget\" where he was and start over. And he wouldn't let the customer go until he had finished. That was the last time the customer ever did that...  \n\n\n&#x200B;",
            "> I wouldn't be surprised if my mom was the reason you can't pay in only pennies now.\n\nIs that legal? If they won't accept any form of US currency to pay a debt, isn't their only legal alternative to cancel the debt?",
            "That's so cool, your mom antagonized a low-level employee that had nothing to do with the mix-up. Nothing says rad like treating a working class prison like shit because their boss screwed up.",
            "I got lampooned on this sub for paying £20 in pennies why did your mum get off Scot free",
            "My stepfather did this to our landlord when I was a kid in the 80’s. Our house literally had a blue tarp separating the shower wall from being able to walk outside, the whole wall the length of the tub had collapsed. As well as the furnace in the basement blowing black smoke out of every single radiator in the house and then our septic tank backed up in the backyard and instead of fixing it like a normal person, our landlord dug a huge open pit next to it that toilet got flushed into. My stepfather had said that he wouldn’t pay the rent until shit got fixed, landlord said he wouldn’t fix anything until the rent was paid. So my stepfather put $600 in a multitude of boxes and loaded it into the landlords trunk. When all the boxes were in it was so heavy it weighed the back end of his car down. Landlord was fuming but he couldn’t not accept as it was still legal money. Shit started getting fixed after that. ",
            "My Uncle paid his taxes in pennies once. It was all over the news. He paid about $5,000...brought a wheelbarrow filled with bags of pennies to the bank. It was hilarious!",
            ">  It was also when it was legal to pay in pennies. \n\nUm, it is not illegal to pay in pennies. \n\nNow they can refuse to accept payment, in which case I would try to get it in writing that they refuse because if they refuse to receive payment when you try to pay with legal tender (which pennies are) then you have an argument that you attempted payment, they refused, so payment should be nullified. \n",
            "Some higher up decided these shitty rules. Sure, punishing the woman behind the counter will surely accomplish a lot",
            "Sorry but I'm on the other side of this. This poor woman who your mother never talked to, had any dealings with or ever heard of your mother had to sit and do this. Stay past hours and had to deal with her constantly putting her off.\n\nMeanwhile some guy or even a machine who did this in the first place, that doesn't give a shit has no idea this is going on.\n\nUnless this woman was involved in which case fuck yeah!",
            "“This was before internet” and “according to google was $3000” don’t correlate ",
            "Mr Beast buys a car with only pennies, or at least tries to. \n\nhttps://youtu.be/nLpqZEAFnkE",
            "In Australia it is not considered legal tender if it: \n\n* exceeds 20c using 1 & 2c coins \n\n* exceeds $5 using a combination of 5,10,20,50c coins \n\n* exceeds 10 times the face value of $1, $2 coins \n\nAnd you can legally refuse payment based on this at any place of work. \n\n A dude tried to pay $20 in fuel with 5c pieces trying to be a smart ass. I told him I won’t accept it as legal tender and I would report him to the police as a drive off. \n\nHe drove off, I reported it, he came back with a crisp $20 note to pay and apologised after he told the cops he tried to pay and I refused to accept 5c coins as payment where the cops explained how legal tender works in Australia. ",
            "Paying for stuff in pennies usually just fucks over a low-pay front desk worker, who has to spend however long rolling pennies. Once the pennies are counted and rolled, it's not particularly difficult for the company to deposit them. I'm just saying if your beef is with the company (or the DMV, or whatever), paying in pennies doesn't really fuck over the company, just a company employee who probably doesn't make nearly enough to make up for having to count a barrel full of pennies. ",
            "how can that women just wave off the fee if this is real she is in alot of trouble",
            "How has nobody pointed out that 300,000 pennies weighs like 1800 lbs? There's no way they dollied that much weight in to an office. ",
            "\"This was before internet...\"\n\n\"According to Google...\"\n\nHmmmm...",
            "Yeah, she sure showed that poor clerk that had nothing to do with her debt!",
            "just pay in nickels",
            "❗️❗️❗️HEY❗️❗️❗️ no apologies, that was a great story.... thanks.😊",
            "Actually it's US law that they have to accept any valid US currency for any debts. They could get into serious trouble if they refuse. ",
            "What is my money to good for you? Do you know how long it took me to make all this money !",
            "Um, you can still pay fees in pennies... whoever told you you can't was lying. People do it all the time. ",
            "Reminds me to this guy:\n\n&#x200B;",
            "The trick is to count up correctly with the person and then all of a sudden switch and start counting backwards or by 2s. ",
            "For debts, I thought that it was still a requirement that places have to take pennies. Am I wrong on that?",
            "Damn. Your mom is petty and savage. She is a force not to be messed with. Silent but fierce.",
            "If its a true story your mom is the hero we dont deserve lol",
            "[deleted]",
            "Ah, that one gives me the warm tinglies of justice!",
            "You're mom rocks!",
            "\"Do you know how long it took me to count those pennies!?\"",
            "Can I pay in a combination of pennies and nickels? ",
            "People, u try 2 count 300,000 pennies",
            "Could have probably sued, this is hilarious though",
            "Pretty sure it is still legal to pay in pennies?",
            "— You can't pay in only pennies now.  \n— Of course I can't. There's a quarter in it, darling.",
            "Take that woman who didn't implement or have anything to do with hidden fees!",
            "How can it be illegal it pay in pennies. It is legal tender, and therefore they shouldn't be able to deny the payment.",
            "This could also go on r/pettyrevenge",
            "I had an attorney represent me once that showed up to court drunk in jeans and cowboy boots. He didn’t even know what the hearing was about despite having a few meetings with him earlier in the week. I paid him 1 penny monthly for years.",
            "Make a 10-stack and then just level the rest out with it",
            "Then radiators wasn’t the right word and I had a brain fart, and I didn’t say pennies I said it was all in change. ",
            "Your mom is savage man!",
            "You mom made the clerk's life miserable because she didn't like the clerk's employer. :/",
            "> I wouldn't be surprised if my mom was the reason you can't pay in only pennies now. \n\nPennies are no longer legal tender?  TIL.",
            "Well if there is one nickel in there then it isn’t ONLY pennies, right?",
            "because Walmart-home of the cake obsessed diabetic shrills",
            "I’m glad it’s not true. The people forced to count the pennies has no control over the company’s hidden fees.",
            "$3,000 worth of pennies, which you say your dad loaded with a dolly, at 2.5 grams per penny, weighs 750 kilograms, or 1653.47 pounds.\n\nWhat kind of vehicle did your dad load this barrel into? And what kind of work did your dad do? He must have been a very strong man.\n\nYes, I realize this is an old thread, but I just thought of this.",
            "> This was before internet\n\n> According to google\n\nWhat? Funny story but that part confused me.",
            "[deleted]",
            "How do you know they didn't take 120,000 pennies?",
            "I honestly dont buy this. If I had people come into my shop with a literal barrel full of pennies to buy stuff, unless they were rolled I would refuse to take it.\n\nPennies are and have always been legal to pay with it just depends on if the business or person wants to take them. If they refuse it's not like the debt is going away.",
            "[deleted]"
        ]
    },
    {
        "post_id": "igu9a4",
        "author": "Wraith347",
        "title": "Cuss me out over pennies? Oh, you’ll get your pennies.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/igu9a4/cuss_me_out_over_pennies_oh_youll_get_your_pennies/",
        "score": 13356,
        "num_comments": 482,
        "created_utc": 1598425707.0,
        "selftext": "Longtime lurker, so I thought I’d share my favorite story from my time in foodservice, years and years ago. \n\nI was a shy, quiet 15-year-old when I first started working at a certain fast food restaurant in my small town. Then I encountered the general public. \n\nMany of the morning rush customers were super kind regulars who I got to know and liked. But then there was Penny Guy. \n\nPenny Guy was not a regular. He placed his order with no initial sign of anything out of the ordinary. His change came to twenty-nine cents. “No pennies,” he said gruffly. \n\n“You don’t want your pennies, sir?” I confirmed. This was not unusual. We had a charity donation box right by the cash register where customers often left unwanted change, or had us deposit it. \n\n“Don’t give me any damn pennies.” The guy was glowering at me now. \n\n“Of course, sir.” I handed him his quarter. I dropped the pennies in the charity box. \n\nAnd then he exploded. \n\n“What the F— is this F—ING QUARTER? I WANT THIRTY CENTS! HOW F—ING HARD IS IT TO ROUND THE HELL UP?!”\n\nI was caught off guard. “I’m sorry sir, but I can’t give back extra change. We donate what customers don’t want, and it all goes to Charity. I apologize for the confusion.” My drawer had to be correct at the end of the day, so this was absolutely true. \n\nWell, that was not all right. He went on a very loud tirade about how cheap our restaurant was and how ridiculous it was to round down. He called me a cheap-ass bitch. Then he demanded his pennies back. “YOU WON’T RIP ME OFF LIKE THIS!! GIVE ME MY TWENTY-NINE F-CKING CENTS!”\n\nAt this point, I could have given him a nickel from the drawer and replaced it later from my own pocket. If he’d been speaking to me like I was a person and not a corporate punching bag, I would gladly have done so. But that’s not what he was asking me to do. \n\nI put on my sweetest smile. “Only the store manager has the keys to the donation box. Give me just a minute and I’ll go get her.”\n\nAt this point, one of the regulars behind Penny Guy speaks up. “Don’t make her do that. Here’s your pennies.” He offers PG some pennies from his own pocket. \n\nPenny Guy’s face flushes and he mumbled about it being the principle of the thing. \n\nMy coworker was managing the line so I decided that this man was going to get his pennies. \n\nIt took a minute to explain what was happening to the manager. She laughed and said she’d be there in a second. It took her a suspiciously long minute to retrieve the key and get to the front. Meanwhile Penny Guy mumbled and glowered and for some reason stuck around for those four pennies. It was a PRINCIPLE apparently, and it meant he waited a good ten minutes while his to-go bag cooled on the counter. \n\nEvery now and then, when a new customer came to the till, I’d look over at Penny Guy and assure him, “Don’t worry sir, the manager will be here shortly to return your four pennies from the donation box.” This earned him a few looks while he waited. \n\nWhen my manager finally came to the front, we opened the donation box while the busy store watched. We counted out four pennies and handed them back over to a now very red-faced and much quieter man. \n\n“I’m so sorry for the confusion,” I told him. “Here is the rest of your change.”\n\nHe took the pennies and left, still mumbling about what a rip off the whole thing was. On the bright side, a larger-than-normal percentage of customers decided to donate their change to the charity after watching his tirade. \n\nI took some pleasure in the thought that even at minimum wage, my time was worth more than twenty-four cents an hour.\n\nEdit: Thank you all for the awards and comments! And my first gold ever— thank you, kind stranger!  WHAAAT platinum?! Ahhh you guys are too kind!",
        "permalink": "/r/MaliciousCompliance/comments/igu9a4/cuss_me_out_over_pennies_oh_youll_get_your_pennies/",
        "comments": [
            "[deleted]",
            "Just imagine the sheer selfishness required to wait that long to demand four cents be removed from a donation box (presumably for something like cancer research) and returned to him “on principle”. In front of other people no less.\n\nHope he used that hard-earned cash for counseling.",
            "Oh this is beautiful. Well written, not overly long, the pacing is just right,  and we finish off strong with a drawn out payoff. I need to lie  down.",
            " Johny was bullied by all the other second grade students. Every day, they would offer him either a dime or a nickel. Every time, he took the nickel. The kids would all laugh at him every time he took the nickel. One day a kid asked him why he always took the nickel, even though the dime was worth more. He quietly responded, \"If I take the dime, they will stop offering me the money. I've made $20 already!\"",
            "When he said to round it up you should've said \n\n\"I'm sorry sir but you're not making any cents\"",
            "I think the best part of this is that the guy initially said he didn't want any pennies back, and then freaked out until he got pennies. Absolutely batshit.",
            ">It was a PRINCIPLE apparently,\n\nAn attorney once told me that litigators know anytime a client says \"it's the principle of the thing\" they better buckle in for a long while ride of a lawsuit. Or tell them they can't take them as a client. Because they will never be rational nor accept a reasonable outcome. \n\nLPT: never tell an attorney, nor your overworked underpaid McDonald's employer, that it's the principle of the thing.",
            "You did a great job of shaming this child-in-an-adult body. Well done.",
            "I worked at a gas station and would always ask people if they wanted their pennies, they either said nah or yes. This one time I had a younger girl 13ish with her mom. Kid was buying stuff with her own money while mom hovered over her shoulder. Get to the change part say my usual do you want your pennies. The girl nah.. so I close my till and the mom started wigging out! So I was like ooooh Kay lady and then took the pennies out of the till and gave em to the girl who looked embarrassed as shit and then the mom gave me shit when I closed my till cause apparently I was mad about giving pennies back and slammed my till. Some friggen people are insane. Only negative interaction I ever had with a customer service job so I'm lucky there but ill never forget... over just a few pennies.",
            "Damn.. I feel so sorry for the retail workers in the US with the whole \"customer is always right\" policy. I have worked retail in my country and the few times a customer picked on me, my older colleagues shut them down. If a client gets agressive, even verbally, the security guys kick them out. As an employee you can't be agressive, but you can tell them nicely to leave you alone.",
            "I want my four pennies taken from children with cancer, you cheap ass bitch!\n\nOh the irony.",
            "LOL   I really like the part where you said aloud where other customers to hear, \"Don't worry, sir.  The manager will be here soon to get your four pennies from the donation box.\"  LOLLOLLOL.  Good one!  Good thinking.  I get a big kick out of that.  And I'm sure that you said it in the most innocent way ever.  LOLLOL",
            "Plot twist, penny guy put on an act to attract attention to the charity and put his public image on blast for a better cause.",
            "Morale of the situation, demand a roundup instead of simply saying no change, if what you actually want is a roundup.\n\nOr better, use a payment card, so you will pay the exact chance no matter what while spending no extra time for it. Pennies are really less worthy than 1 second of a completely useless dude.",
            "I worked at Dunkin Donuts when I was younger and at one point the medium coffee came out to $2.01. Those who paid with cash were pissed when I started to count out $0.99 in change because technically that’s the right amount to make my drawer accurate but people would reach into our tip jar as if it were “leave a penny, take a penny”. Needless to say, corporate changed the pricing real fast as neither employees nor customers were happy.",
            "Here in Canada, Penny Guy would have gotten $0.30 back no matter what, since we eliminated the penny.",
            "Like its change? Why the fuck stress over some pennies? And this is coming from.a guy who saves every penny he finds...shit I paid mine and my SIL's Drivers licenses with pennies(we put them threw CoinStar of course)",
            "[deleted]",
            "He got just deserts",
            "My first apartment out of college, the amount of the rent varied slightly each month to account for the water bill. One month, I’m not sure how it happened, but I guess I was 8 cents shy on my bill. Rather than just tack it to my bill the following month, the apartment complex mailed me (with a stamp!) a letter explaining the discrepancy and asking that I supply the 8 cents by the end of the week or I would face a $50 late charge.\n\nThis was not a large complex. It was a form letter and the $0.08 had been written in by hand.\n\nSo I took an envelope, put a nickel and three pennies and dropped it off in the rent box in the office. \n\nA few days later, I got another letter, again mailed with a stamp, letting me know that the complex was not able to accept cash payments for rent and that I needed to write and submit a check for the $0.08 by the next day or I would face a $50 late charge.\n\nSo I wrote the damn check. But I couldn’t believe they went through all that trouble (including mailing two letters) to collect $0.08 from me.",
            "\"Penny Guy’s face flushes and he mumbled about it being the principle of the thing.\"  \n\n\nThe very same people whining about this also disregard the principle of exact change.",
            "I was a first time waiter at a restaurant chain that rhymes with Crapplbee's. \n\nHad a guest yell at me that I shorted him 3 cents. After I gave it to him, he went to the host stand and asked for the manager. The proceeded to say, I quote:\n\n\"3 cents may not seem like a lot, but it adds up if you steal everyday\"\n\nYes, that 7 dollars a year helps. \n\nI feel your pain.",
            "I know you said food service but I'm enjoying the mental image of a cashier at Walmart repeating over the loudspeaker \"Attention Store Manager, your key is needed at Checkout Number 4 to return FOUR PENNIES from the donation box. Repeat: Customer is requesting FOUR PENNIES from the donation box. Store Manager needed.\"",
            "Post this on r/TalesFromYourServer. They'd love it!",
            "\"I don't want any pennies\"\n\"WHERE THE FUCK IS MY PENNIES\"",
            "Canada stopped making pennies about ten years ago because it costs more to make them than they are worth. That thing, the thing we have decided is worthless, is the hill he decided to die on. Kind of sad really.",
            "Different kind of scenario, but back at my old job we had registers that would ask if the customer wanted to round up to the nearest dollar to donate to charity. I had an older woman and her adult daughter in line and the mom went first. Her total was $28.99 and when I asked if she wanted to round up the penny, she said no. Kinda cheap, but whatever. So now I'm ringing up her daughter and her total ends in 98¢, I ask her if she wants to round up the two cents and she says sure. Her mom freaked out. She started shouting, \"why would you do that?! You're just trying to make me look bad!\" As if she didn't do that herself?? The daughter just rolled her eyes.",
            "I expected this to end with him getting *entirely* pennies in change.  I like this way more.  Well played!",
            "What was 4c worth at the time? Could it actually buy you anything, even from the menu?",
            "Everyone should want a Penny. They're the best!",
            "He's just ahead of his time. When they finally abolish pennies they'll *have* to round up. And then he'll get his.",
            "Best part was embarrassing him all over again with every customer but I 100% would've given him 30 cents in pennies.",
            "We don't use pennies in Canada anymore lol, maybe this is why haha",
            "I'm a cashier working in the US, and with the coin shortage I fucking feel this post. So many times I've told people \"we don't have many coins, do you still want to pay in cash?\" and then I've had to count 87 cents in pennies because they don't understand what \"we don't have many coins\" means.",
            "Bwahahahahaha this is amazing! \n\nI dealt with something similar in retail. I was low on ones, I ended up running out but still owed the lady a dollar. I asked her if she would be ok with a dollar in quarters as it could take my manager a bit to bring me change. She was appalled by this suggestion and acted like a total bitch about it, insisting she get a bill back for her change. Well, it ended up taking my manager like 20 minutes to bring me change, the whole time she's scoffing, and complaining about the wait. I kept apologizing and offering her the quarters if she didn't wanna keep waiting. She never took the damn quarters and chose to wait it out 🤷‍♀️😂",
            "*while his to-go bag cooled on the counter*\n\nOver 4 fucking cents. What a maroon!",
            ">On the bright side, a larger-than-normal percentage of customers decided to donate their change to the charity after watching his tirade.\n\nSo the penny man had a positive effect on the world in the form of \"fuck you\" donations lol.",
            "How dare you not steal from your workplace for this guy. And you're seriously making this big of a deal about 1 penny?? How cheap are you? Now, four pennies, that's like 4X more, so that's understandable.",
            "If you want the exact change, you get it. Fine.\n\nIf you don't, you shouldn't have a problem with rounding down.\n\nRounding up is common because customer satisfaction but its by no means an inalienable right",
            "[It’s the principle!](https://youtu.be/h4T4c3F_cvM)",
            "May those have been Ass Pennies",
            "Damn, I really am too petty to be working customer service anymore. My first thought was to take the quarter back from him and give him 29 pennies.",
            "He may have his pennies, but that guy has no cents!",
            "Obviously small penis syndrome. I guess his wife rounded down when measuring",
            "That’s so fucking great. \n\nAlso what the fuck, Karen. You don’t get extra change just because you don’t want pennies.",
            "In Australia, we actually do round up change as the smallest coins stores accept are 5c coins. If something cost 97c, we get 5 cents change from $1. If it costs 98c, we get no change from $1.\n\nWe ditched the penny decades ago, I think we also had a 2c which we also do not use. We still use 5c, 10c, 20c, 50c, $1 & $2 coins but I'm not aware of any nicknames associated to them, like dimes or quarters (not that we have a 25c coin). We just call them by their value though some regions may have their own slang.",
            "This reminds me of the time a huge media store opened in my town. My buddy and I were in 8th grade, we rode our bikes there and waited in a long ass line the first day they opened to buy a guitar tab book. When we got to the front of the line, the woman rang up the book and it came to like $15.01. My buddy, being a kid, had only exactly $15 on him. He told the cashier this and she went off about how they can't just give pennies to everyone and he should be embarrassed to ask for a penny from the store. We were shocked and just left without buying anything.\n\nSome people protect their drawer with their life!",
            "This was a damm good story. Thank you for taking the time to transcribe it!",
            "No pennies",
            "At least he wasn't pennywise",
            "“You’re sooo cheap!!”\n   —person trying to scam a single penny",
            "I would have spit in his face. But you took the high road. Good for you. Well played",
            "Now this is is just \\*chefs kiss\\*",
            "In Canada a while ago now we phased out pennies. Nothing illegal from the store. this is by law by the government. You pay by cash it is rounded to up or down to the nearest 5 cents. Since this is government law it is a requirement. I was in a cafe this past spring before Covid and  I never dealt with it but the bosses nephew. Some guy was whining about the pennies. just to appease him they brought in a few pennies they had had stashed away.",
            "Sounds like they want ass pennies",
            "When people inconvenience themselves for money, I always like to break it down into their value/hour. If he waited for 10 minutes for 4 cents, then his time is worth $0.24/hour. \n\nWhat would you realistically do for 24 cents an hour.",
            "It just seems like that more and more self entitled people are attempting to impose Their will on everyone.  Which I guess is the definition of Entitled.",
            "Was a moron.   Have a colleague with a similar story.  He worked in the Dominican Republic for a time.  The supermarket wouldn't give change due to a claimed coin shortage.  If an item was 4.03 you were expected to pay the .03 but if it was 3.97 they wouldn't give you change if you paid 4.00.  He started demanding his change. I don't blame him; even if it was a minuscule amount for the customer, the store (a supermarket) made an extra profit over the day.  Or they could have treated themselves the same as their customers.  (It was the smallest coins they seemed to be out of.)",
            "\"ITS THE PRINCIPLE, LIN!\"",
            "What a tool. Give me extra money back because it's more convenient for me!\n\nOr not? Do you see a take a penny/leave a penny here?\n\nThankfully it's not an issue in Canada anymore since we got rid of the penny.",
            "Anytime I hear someone talk about sticking to their principles I think of the super underrated movie In Bruges",
            "Wow, so he wanted 30 cents instead of 29 cents and he lost his mind and started screaming at a little 15-year-old over a penny?? What is wrong with some people??",
            "I like his projection of calling the restaurant cheap and giving you shit for rounding when you're actually being exact.  He's the only one being cheap and requesting you to not be exact with your change.",
            "Great time for the manager to throw in the line \"sorry for the wait, I couldn't find the key! We just don't open this box all that much unless it's full!\" Reaaal loud for the store to hear",
            "Wow...he was literally hoping you would round up and give him a quarter and a nickel...\n\nHe waited 10 minutes for a 1 cent profit.",
            "I've had a guy who lost it over his own miscalculation of sales tax. He insisted that we were stealing from our customers a penny at a time, up until I called a manager so I could serve other people, and my manager went through his receipt, item by item, price by price, and added in the tax on his calculator. \n\nNaturally, he didn't apologize, just said it was all bullshit and we were thieves.",
            "I worked at a cafe once. I'd often have customers take pennies out of the open cardboard donation box and off them to me as part of their payment. I always told them, \"Maybe you're comfortable stealing pennies from those than cannot feed themselves, but I am not. Put it back\" the few that got angry instead of embarrassed, I simply told them to get out. I'm not serving a thief. (This was a cafe inside a paper factory for employees who all made a lot of money.)",
            "Shortly after the Americans with Disabilities Act passed, some gas stations didn't make the required modifications (like a cut in the curb for wheelchairs). So, some people with disabilities would go, pump a little gas, wait, pump a little more .. all as cars lined up. Then, when they would go in to pay for, say, $10 in gas or whatever, they would pay in loose pennies, counting one at a time. 1,000 pennies.",
            ">“What the F— is this F—ING QUARTER? I WANT THIRTY CENTS! HOW F—ING HARD IS IT TO ROUND THE HELL UP?!”\n\nYou should have said that if you were to round up, then his cost would have been 4¢ more, meaning he'd still only get a quarter.  After all, he didn't say to round up on his change, only to round up.",
            "I remember being in a drive through. I don’t remember the price but I should have only received back a nickel after giving the little girl a bill and three cents. She looked at my pennies, handed back my pennies and gave me more change. There was a time when people knew how to deal with cents",
            "That's hilarious! I wonder how old Penny guy was too.",
            "And a note - there is plenty bad to say about McDonalds, but the Ronald McDonald House charity is one of the best in existence. \n\nIf a parent has a child in a hospital some distance from their home (thirty miles?), the parents will have a safe place to stay near by - I think as long as they need to. When working as a cabbie, I probably took families from the hospital to the House half a dozen times. They were universally thankful for the service, except for the methy dad in his early 20s who didn't like having to sweep the floor himself.",
            "That asshole got McServed: he really had it his way.",
            "Should have given him all 29c change in pennies",
            "That's a pretty long end game he has, if it's his version of a scam. An extra penny here, maybe an extra 2 there..\n\nI love your way of subtly public shaming OP ;) Very clever. Plus the donation box got more attention that day. Win/Win!",
            "I kind of wish he had put the pennies back into the donation box after they were returned. He tries to save face by saying it was the principle of the thing, that he had to make the choice to give, not be shortchanged by some teenager. Everyone would have just looked at him like an idiot as he walked out.",
            "LOL what a Scrooge",
            "Fwiw, formatting works the same in mobile as it does on desktop.",
            "I gives the updoots and laugh at the customer that sounds so familiar...  \n\nHang in there not everyone is that bad.  (well almost not everyone...) (OK they are all aHoles, but whatcha gonna do?)  :)",
            "Jesus Christ this is enraging.",
            "NSFW, Great skit from UCP: https://youtu.be/f9aM_dT5VMI about pennies",
            "To Yoda: “I’ll start practicing my upspeak",
            "That’s what it’s always like in fast food. When I was a teen working that job I just wanted to knife murder every customer ever.",
            "hahaahah omgosh what a moron! He would HATE living in Canada! We got rid of pennies years ago and round up or down depending on the total.  $2.77? You pay $2.75 ...$2.78 ? You pay $2.80!  and NOBODY cares!  The way you  handled that was absolutely PERFECT! haha im still laughing!",
            "... I dont know american coins.",
            "I had a no pennies, no bag regular but he never demanded I round up!!!! Wowww",
            "I would have been an asshole and asked for the quarter back and then given him 29 pennies.",
            "My time is worth more than four pennies... I guess his wasn't???",
            "If he wanted a nickel he should have given you an extra cent. what corporate store 'rounds up' change?",
            "I thought it said \"Cuss me out over my penis?\" Then I read it again.... I'm truly a 12 year old by heart.",
            "Did he think it was Canada?!",
            "He's calling you a \"cheap ass bitch\" while hes losing it over 5 cents? I almost always just tell them to keep the coins, even if my change is 99 cents. That gives them a little extra to help out customers that are short if they need to.",
            "This story is gold, errr copper at the very least!!!",
            "The only principle involved with that behaviour is selfishness and self absorption, along with a dash of con artist, but seriously, who puts that much effort to con a single cent out of someone?",
            "This guy is so “principled” I bet he listens to Mark Levin.",
            "People will come into my store and spend fifteen minutes filling out tax exemption paperwork... for 32 cents...",
            "I always took great pleasure in these situations knowing I’d be making more money for the time spent than the customer was fighting over.\n\nLike spend a half hour arguing over that $.25 sauce charge I have to put on and meanwhile I’ve been paid $5",
            "LMAO...\n\nGood thing you did that. This guy is a douchbag if he think he could make you shortchange yourself by a penny. Like, wtf? Either you want your change or you don't.",
            "I had a friend growing up that would take all the quarters from the change he had just gotten back and put those in his pocket, everything else he tossed out into the parking lot.\n\nEventually I just got him to just give me all his change he didn’t want and I would turn into the bank with the rest of my random change.",
            "This story can't happen in Canada anymore - we're immune!",
            "His life cannot, possibly, be rosy with that type of bad behavior.",
            "Some people suck. Penny guy is one of those people.",
            "This guy said no pennies cause he wanted you to round up",
            "Please tell me I'm not the only one who misread penises",
            "I wish we knew that money was going to charity",
            "Not related, but is ‘cuss’ a specifically American word? And southern at that?",
            "I CAN NOT be the only one who read pen*s",
            "Thats why you have your bag of ass pennies ready",
            "ass pennies!",
            "I was really hoping that your manager came out and gave him 29 pennies",
            "That's awesome. You showed him. I can't imagine his face having to watch everyone watch him as he waits patiently for his measly change.",
            "Ngl I read this whole thing and thought the manager was going to give him his change in all pennies",
            "I gotta admit that for a moment there I thought this story was about some lady named Penny, second name Guy.",
            "Apparently the trick to getting someone to round up when giving change is to be in a smol town in the Bible belt and have your change be $6.66",
            "This reminds me of a fuck up of my own at a certain fast food chain. Very first job and in orientation thay told me that the draw had to be exact everytime and if it wasn't I would get in trouble (had to be 15 at the time). A couple months go by and im enjoying the job for the most part and im working in the drive thru. Not quite sure how the conversation played put as it was over 10 years ago but the customer was short 1 penny and I told them that I could not accept anything that wasn't the correct amount. Queue the supervisor getting pulled into the conversation and she just laughed and said a penny or 2 short is fine and it became a running joke for awhile.",
            "This is why Canada got rid of our pennies\n\n(It was really because of manufacturing cost I believe but that's not as funny, is it?)",
            "My grandfather back in the early 60s took out a bridging loan to buy a property while the old one was still settling. \nThe loan was taken out from the lawyer who was handling the property transfer. \nThe lawyer decided to be nasty and call the loan in a couple of weeks early, so my grandfather arranged with the bank to have a lot of pennies...3 station wagon loads of them!\nThey just marched into the lawyers office with bag after bag of pennies and then asked for a receipt..\nThe loan was for 2,000 pounds, and in Sterling currency there are 20 shillings to a pound and 12 pennies to a shilling, so that works out at 480,000 pennies. Our pennies were almost the size of an American quarter too...",
            "Hey I’m just wondering but McDonald’s donation boxes are collected by 3rd party kinda like brinks. Not even the franchise owner has a set of keys. So I’m just wondering how your store manager had a set of keys to the donation box\n\n*i work at McDonald’s a customer accidentally dropped their card into the one at back cash... collector came a week ago they had to wait like 20 days to get their card, the district manager was there told them sorry nobody has keys except for the collection company",
            "Hmm, anyone else read the title differently?",
            "Great story, please allow me to make the bridge here. We all feel a certain way about Penny guy and how he must feel about money to treat people like this regardless of circumstance and consequences. Getting money back from a charity box but willing to overpay for coffee he can drink himself. These kind of men and women are what has locked the system into creating the one percent of rich people. Excluding them will equal the divide.",
            "American culture is so broken",
            "Great story and well written. The store should have a give a penny take a penny tray.",
            "I used to know a guy that ran those donation boxes he would collect the change in the boxes then go to coin star then to drug dealer",
            "But though I've worked at a place place that always runs out of pennies and I round up if it's 3 or more cents and down if it's 2 or less the drawer is never more than 20 cents off because pennies are useless. If you get in trouble for being 20 cents off find another job.",
            "That dude sucks, but unless it is McDonalds, most of those donations go to the franchise owner",
            "There is no excuse for his treatment of OP, but we also don’t know his circumstances. Maybe he really needed that extra penny. Some people don’t have the luxury to give away money, even just a few cents eventually add up to a meal or some gas for their car. It is easier for some to be indignant than express how vulnerable they are, especially if they are ashamed of their financial status."
        ]
    },
    {
        "post_id": "mstt2d",
        "author": "Rexxington",
        "title": "Answer the phone even though we're not open yet? You got it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mstt2d/answer_the_phone_even_though_were_not_open_yet/",
        "score": 13354,
        "num_comments": 409,
        "created_utc": 1618676651.0,
        "selftext": "This is going to be short and brief, I work at a very popular pizza chain well call pizza stuff. Well today my manager told me that instead of not answering the phone due to us not being open. I now have to answer it and put their order in as a timed order. Along with not telling them that it wouldn't be ready for pickup until 11, I guess he's after more sales, I don't know. Cue malicious compliance, and this morning we happened to get a lot of calls. By the time it was about 10:45, I had 10 orders in, along with that's when the first customer arrived. Well see the issue was that by company policy and rules, we cannot unlock the doors until 11, or when we're supposed to be open. We can send deliveries out early, yet we cannot open carryout early. Well as you can imagine the customer became pissed when I told them they have to wait until 11 before I can serve them due to policy. With the cherry on top being my manager heard the commotion, and decided to forgo the rule. Well in walks in his essential boss, he trains managers and employees mainly. In which he sees what he's doing, and promptly gets in trouble as a result. After his boss talked to him for a bit, my manager pulled me aside and said we're no longer taking orders early, nor are we allowing customers to enter the store early.\n\nTL;DR: manager told me to take orders before we're open, customer got mad as a result as they couldn't get thier food when they got here. Manager then allowed customer in early, in which his boss happened to show up. Got in trouble and the rule has been revoked.",
        "permalink": "/r/MaliciousCompliance/comments/mstt2d/answer_the_phone_even_though_were_not_open_yet/",
        "comments": [
            "[deleted]",
            "I love instant karma.\n\nI'd also let higher boss know he instructed you to not inform customers of the delay if 'pre' ordering.  That's TERRIBLE cust service.\n\n/u/Meersus the compliance was doing it knowing it's against the rules and will anger customers and potentially (did in fact here) get manager in trouble.",
            "When I worked at Pizza Hut years back I'd be there at 7am to help open and we would always get calls. Not because it was someone actually wanting pizza at 7am, but because it was schools or businesses that were ordering a large amount ahead of time. \n\nMade sense to me at the time, because it was good to know we need 20 pepperoni pizzas ready at noon instead of getting these huge orders at 11 while customers start coming in too.",
            "There needs to be some sort of basic management test for restaurants because far too many Very Stupid People get put into restaurant management.",
            "Why is this an issue at all?\n\nFor stupidly cheaply in the modern day, you can set up a message on your phone line that says something like, \"We're currently closed until 11 am.  If you'd like to speak to an employee to place an order to be picked up after 11 am, press 1.\"  Then your phone rings, and the customer has this expectation set before you even speak with them.\n\nEDIT: This has received a bunch of \"people don't listen\" replies.  Yes, I am aware of that.  I'm still going to provide the information.  If people don't listen, that's a *them* problem, not a *me* problem.  Thanks.",
            "I got the opposite request today.  We are open on limited staff. Walk in service only, no inside sales or tech support.  Phone rings.. I take it to mean someone wants to buy something. I take notes and give to Store manger to get customer order ready. Store manger says quit answering the phone.  I quit answering phone and 2 rings later is our general manager.  I did not answer the phone.\n\nUpdate today- phone rings. The store manager is standing right in front of me at my desk. I say oh! The phone is ringing! Are we answering it today?  \n\nHe says yes and walked out!  Bahhaaahhaaa",
            "Damn, I can see taking calls a little early (you unlock at 11, so starting to take orders AT 10:30 or 10:45 makes some sense), but your manager just had to do that the most boneheaded way possible hm?",
            "If it was me, I would've made sure his boss knew that you were told to take orders.  Double down on his ineptitude.",
            "Some Pizza Hut managers act like their *life* is on the line when it comes to sales and money.",
            "[deleted]",
            "Oh you know he likely told his boss you did all that shit on YOUR own right... Like that's what those smarmy manager types do to cover their own arse. If he didn't and actually took responsibility for the action taken and taking the orders early I'd be shocked thoroughly shocked.",
            "He could have easily said that you could take an order early, INFORM THE CUSTOMER that the order would not be prepared until the store opens at 11 and that they could pick it up at ~11:15. It's so stupid to say yeah let's take orders but let's not tell the customer that we are not even open yet!",
            "Every manager I ever had that wanted us to open early or close late NEVER worked even ONE 8-hour shift.",
            "Thank god my bosses have been decent.\n\n“Just take the orders early Milkador, tell them it won’t be ready until later though”\n\n“Ok.. but it’s already difficult to do all the opening tasks in the allocated time, so just a heads up that if I get more than a single call or they take longer then 5 minutes, we aren’t going to b open on time”\n\n“Well.. that won’t do”\n\n“No, no it won’t”\n\n“Ok just don’t answer the phone”",
            "You did say you could deliver early?    \"I need a large pie delivered to the brown Yugo in the third parking spot from the door!\"",
            "It’s surprising to me that so many people want pizza before noon...to each their own but I could never!",
            "‘Thanks for calling pizza stuff, we open at 11’ *click*",
            "I work at a pizza joint too and my boss does this crap on the daily. Makes separate rules that we have to follow, but when someone higher up comes in to check on us, we go back to doing it the way it’s supposed to??? I hate it here, help.",
            "Your manager’s boss catching him working outside the rules right in front of you was a gift from the gods. You had to love this experience.",
            "I like how places like that pay you as little as possible and then are just fucking SHOCKED when you give as little effort as possible.",
            "Was this malicious, though? It strikes me as just compliance.",
            "Do you happen to know the reasoning for being so strict about opening times?",
            "This is my I order from Father Racist Pizza.",
            "I don't get why you wouldn't just tell the customers that it wouldn't be ready until 11. Anyone who wants a pizza badly enough is just gonna wait. Sure, some people might be turned away by it, but you're still likely to get more sales than you would, and don't have irate customers at the door before opening...",
            "People don't see the ramifications of rules they make.\n\nFor instance, I just noticed that a food chain named after a particular class of vegetable that has a taste usually referred to as \"hot\" has a sign at its walk-up to-go pickup table that says \n\n\"All Guests ordering alcoholic beverages To Go must be in a car.\"\n\nHmmm. \n\n*There's no drive-up, so people have to get out of their cars to pick up and pay for their food.\n\n*It's not legal to have open containers of alcoholic beverages in cars.\n\n*Also, it says \"ordering,\" not actually buying or picking up....",
            "Beware the “perfect storm”. This is Restaurant 101. Stupid dummy. That was always the outcome.",
            "If the manager got in trouble by the boss, was the boss the store/branch manager?\n\nJust curious about the job position of the boss vs. manager.\n\nAll you can do really is just follow your managers directive or report them for not complying to the policy.\n\nYou did the right thing and glad your manager got in trouble instead!",
            "Ah yes, the customer timers seem to run quickly... I got it written down here you called at X... less than 10mins ago and you are saying you have been waiting for 1hr... ah huh.",
            "The pizza chain I worked at back in the day would take orders early, we just let the customer's know orders would be ready 20 mins after open for carryout and 30 after for delivery.",
            "Why were you not allowed to say it wouldn't be ready until 11? I believe some people would still  order no?",
            "No one out pizzas the stuff",
            "Question, if your order takes a minimum of, say, 15 minutes to make as an example, why not take your earliest order 15 minutes before opening?  Keep corporate happy, and manager gets a few extra sales, and employees don't get pissy customers for pickup.",
            "Well, drat.  I thought you were going to tell the waiting carryout customers to call them in. ;)",
            "Sounds like my job with oysters. I’m no longer allowed to tell costumers we’re out of oysters but telling them they can order them with a 20 minute wait is fine",
            "Domino’s sucks.",
            "You failed. This is video proof of that.",
            "I used to steal from a butcher’s shop with the help of the employees who worked there. I knew the employees and we would share the proceeds later. One day the manager came while I was busy packing chickens into my bag. The employees quickly locked me in the freezer. Luckily the manager didn’t stay for long. I spent at least 15 minutes in the freezing cold. You bet I never went back there again to steal again",
            "Who the hell orders pizza in the morning?",
            "NTA. However, if there is such obvious demand, why not open at 10? Looks like your looking at an annual sale increase of 40k for an extra 9k in expenses.",
            "[removed]",
            "[deleted]",
            "Who the fuck wants pizza before noon",
            "Karma? Yes.  Not seeing the malicious compliance though.",
            "Sounds like they should just open earlier",
            "How is this malicious compliance? You did exactly what you were told to do.",
            "Having worked pizza off and on for 2 decades (nothing beats delivering pizza for a side job) I have to say this is just a lazy employee. We would always answer the phone before opening. If you’re there, why not take an order? I can honestly say the entire days prep work can be done in under 2 hours (for $10k worth of sales). I do have to say though, when I was a kid, I had a very similar attitude to OP. But after having grown up, and held a (different; non pizza) career for many years now, I realize I was just being a lazy, POS employee. Pizza is NOT hard business. Easiest job I ever had, and taking an order early wasn’t uncommon. Communication is key to the customer though.",
            "This is an awesome story but I don't think it belongs here, but /r/instantkarma",
            "Who the hell orders pizza at 10am? Buncha weirdos",
            "Business owner here. I see this shit often. This is why you’re a shit employee. You’re trying to stick it to the boss because he signs your checks. No. The customers sign your paycheck. How much harder is it to tell them it’ll be ready for pickup at 11? It’s not. So not only did you get your boss in trouble. You screwed customers and therefore the business reputation. I would have sacked you without question.",
            "You called it.",
            "Wow, seems to ve too many mgrs at this pizza store. Must be minting.",
            "Had to do it again tho",
            "Couldn't you just have taken the orders and informed customers that they won't be ready for pickup until 11:00?",
            "Why couldn't the delivery driver just deliver it, by foot, right outside the door?",
            "Never forget customers pay our paychecks",
            "What happened to SNB",
            "Well that sucks! What a bad way to start the day. I guess In the future you are going to place timed orders to be ready at 11am and let the customer know the doors open at that time.",
            "Stupid manager wants to pad his sales in order to get brownie points."
        ]
    }
]