[
    {
        "post_id": "14mp7jp",
        "author": "lawdiscord",
        "title": "You want me to work 9-5? Got it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/14mp7jp/you_want_me_to_work_95_got_it/",
        "score": 13278,
        "num_comments": 463,
        "created_utc": 1688096135.0,
        "selftext": "I work on a case with people from many different areas. Most of the people on the case work in a time zone that’s three hours ahead of mine. This means that I am often on meetings or depositions that start at around 7:00 am or earlier. \n\nA couple of weeks ago, I attended several days of a deposition, starting at 5:30 (for me) each day. Those days, I left the office at around 3:00. My manager then called me into her office, and demanded to know why I was “leaving early” every day. I told her about the situation, but she did not care. She said, “This is a 9-5 job. It doesn’t matter if you’re in earlier, you leave at 5:00. Otherwise people will think it’s okay to come in and leave whenever they want.”\n\nWell, 9-5 it is! I started arriving in the office promptly at 9. This unfortunately led to me skipping several meetings, but alas, it cannot be helped. One meeting I skipped, scheduled for 6:00 am, is an important biweekly one that my manager is also supposed to attend. She has never attended and always relies on me preparing her a report on the meeting, so she can present it to her boss. When she asked for the report, I informed her that I was unable to attend the meeting, since I work a 9-5 job and I don’t want to give anyone the wrong impression. No report, sorry!\n\nAs I left promptly at 5, I peeked through the window to her office and got a great view of her trying to explain herself to her boss. \n\nToday, she called me and dejectedly informed me that I can leave the office whenever I want from now on.",
        "permalink": "/r/MaliciousCompliance/comments/14mp7jp/you_want_me_to_work_95_got_it/",
        "comments": [
            "I just don't understand why there are so many bosses and managers who chose 'control' over common sense.\n\nGood job, OP. I would rather work a few hours before everyone gets in and leave 'early' myself. \n\nI used to schedule my home care cases as early as possible...I loved the days when I completed 4 before lunch (5 was my goal for the day and anything more than that would mean an easier day later in the week!)\n\nNow I teach, and I would rather get in at 6 to plan and set up for the day than stay after school when I am tired and try to think about what I want to do tomorrow (and then the next day have to remember everything that I set up.)\n\nSorry for the rant...summer break is upon us and I am a bit bored!",
            "Bosses are complaining about \"perception\", but is it really too hard to say, \"s/he started working at 5 this morning. When you start doing that, you can go home early too.\"\n\nI can almost guarantee that would put a stop to complaints.",
            "‘No thanks boss, I’ve kind of grown accustomed to normal working hours!’",
            "I had a similar situation; however, instead of working only 9-5, I went in for the early morning meetings but stayed until 5 each day accumulating 3 to 4 hours of overtime each day. Needless to say when HR & the managers saw that they were livid! It only took a few weeks for them to say I could leave early or take a day off so I wouldn’t have overtime. \n\nNothing works better than hitting them in their pocketbooks!",
            "Due to insane Bay Area, CA traffic, my brother used to get into the office pretty early (6:30-7am) for an 8:30am start time. Because of this, he would typically leave 15-20 minutes early to get a slight edge leaving the parking lot. His boss talked with him about “the perception” of leaving early. “No problem”, he said. He stopped working at the 8 hour mark, no matter when it was, and started playing music in his office or loudly watching videos from his phone. It took about a week of wasting time and distracting others before his boss told him he could “change schedules”.",
            "I was young- early 20s, and working at an IT company in Vancouver.  I am a night owl so I found it hard to get in early.  I always worked late as I enjoyed the work.  But the boss was having none of it.  Wanted me in on time.  I talked to some coworkers and asked them about it.  They smiled and said - come in early tomorrow and we’ll show you how it works.\n\nGot in early the next day.  Logged into the computer and said good morning to my coworker.  He said you ready?\n\nHe and about 8 other people got up, and headed over to the nearby cafe for breakfast.  Spent an hour there.\n\nPerceptions are funny",
            ">Today, she called me and dejectedly informed me that I can leave the office whenever I want from now on.\n\nnah - actually, I'm good. I like this \"nine-to-five\" thing. it means I get to sleep in. thanks for the tip :)",
            "i joined my current office in December last year at 8 hours - Monday to Friday. Then, they pressured me to work for 8.5 hours. They also wanted me to work on Saturdays with some extra pay (which I didn't accept). It's June...and now they want me to work for 9 hours every day because that's what everyone else is doing. And my leaving early by half an hour is impacting their morale.\n\nI am a content writer. I can easily work from home. I am at my wit's end with this place.",
            "So did you decline and make her go to the 6am meetings that are actually her job?",
            "It isn't easy training a boss.",
            "You did that perfectly. Well done!",
            "My dad was always in the office at about 7:30 AM. He would load equipment and head out to his work location, then get work prepared so by the time the crew, who clocked in at 8:00 then met him in the field, arrived everything was ready to begin working. He would also dismiss the crew at 4:15 so they could clock out by 5:00 while he closed down the work location and loaded equipment for the evening, not leaving the field location until 5:00. \n\nOne day something went wrong and he arrived at the office at 8:10. His boss yelled at him that office hours are 8:00-5:00 and he needed to be here blah blah blah. \n\nOk man, you got it. He started arriving at 8:00, leaving at 5:00, which meant about 2 hours less time for actual work every day. Two weeks later, \"why is that project moving so slowly?\" \"You told me work was 8-5, boss. So I stopped coming in early and leaving late. 🤷🏼‍♀️\"",
            "> Today, she called me and dejectedly informed me that I can leave the office whenever *I want* from now on.\n\nDecision time, was the 9-5 experience better in any way?",
            "I start work 3 hours earlier than everyone else, also in at 5am. So when I shut'er down and walk out at 2pm, I get to see some pretty jealous people. The new folks always ask 'hey how come stu doesn't have to stay until 5? can I leave early too?' and the answer is always \"Sure, if you come in with stu at 5, you can leave when he leaves\"\n\nI'm always alone in the office and its *fantastic*.",
            "My company did this at an organizational level and it resulted in the same outcome. People went from working 7-4pm or 10am-6pm or taking a meeting with the Australia team from home to literally sitting on the stairs outside the building until 8:59 and packing up their stuff at 5:59. It took 3 days for the policy to vanish.",
            "I don't understand why so many managers act like their direct reports are children who will get jealous of other children's toys.\n\nI've literally never seen an adult struggle to understand \"Yeah, Steve leaves at 3 because he starts at 7.\"  Worst case scenario, it can be as complicated as \"Hey I noticed you're leaving early lately, what's up with that?\" \"Steve does it so I thought it was ok when I finish up work,\" \"Steve starts at 7 for meetings, we need you here til 5\" \"Oh shit sorry!\"  It's a nothing problem.",
            "Lol. She was so focused on the 'til 5 and just expected you to keep coming in early anyway. Well done!",
            "You should get this in writing so you have it documented in case it comes in again. As long as you are working core hours, which are normally 4 of the 8 hours, then you should be allowed to have an early start work day. Your manager isn’t very bright when it comes to common sense in he workplace.",
            "\\*idly hums some Dolly Parton\\*",
            "Must explain why I was never 'Manager' material.",
            "We had east and west coast operations. The company was run on the west coast. The east coast guys would purposely plan meetings for 7:00 A.M. Eastern time to force us in the west to be on the conference call at 4:00 A.M. so they could get what they wanted without too much negotiation.",
            "Ah, yes. I had a manager that wanted to do 'flexible hours' and advertised how he takes flexible time. Ok, good. \n\nI told him during a 1:1 that I also wanted to take flexible hours and take off early for my kids' events. Woah, my manager said that wasn't the spirit of flexible hours. Ok, fine. I got approval from my manager's manager to take flexible hours. \n\nThe result is that I take flexible hours but just don't tell my manager.",
            "I worked at a plant once on the 6am to 2pm shift. The new plant manager came into the lunch room at 10am one morning and loudly said something to the effect of \"I can't believe you all are taking lunch *already*\".\n\nIt just did not compute to him that everyone in the room had been working three hours before he got there.",
            "When she tells you from now on you can leave whenever, she did not say you can start whenever.\n\nSo TECHNICALLY you now have a 9-X job. Malicuous compliance 2.0",
            "GET IT IN WRITING **ALWAYS**",
            "Today, she called me and dejectedly informed me that I can leave the office whenever I want from now on.\"\n\nPfft. Let her spend a few months attending the 6am meeting.",
            "I had a boss one time that had the rule: \"If I'm not in the office when you get there, you must call my cell from the office landline abd leave me a vm with your name and time.\"\n\nHe also would nake people come back from lunch early or stay late, then if we put the exrea time on our timesheet, he'd get mad at us for \"nickel and diming him.\" \n\nYeah, I didn't stay there long!",
            "Even in 3 hours ahead time, who in their right mind wants to meet about ANYTHING at 8:30 in the morning?!",
            "My boss could be a real jerk, but he never complained about the time I came in.  I’d usually sign out of the building several days a week bc o stayed late. \n\nYes, he once wrote me up for an untidy work area and sent me to anti-clutter school, but he was pissed at me about something else, and sending me to the course was an excuse to send another employee whose office was much worse than mine.",
            "\"Sorry, I really like the convenience of sleeping in before going to my 9-5 job.  If you want me to come in earlier, we can certainly discuss how my salary will reflect the chaotic schedule.",
            "Yee-haw! You done good!  Congrats on the malicious compliance and I hope she got an a$$ chewing she’ll never forget.\n\n(Also hope that the boss makes HER attend the early morning meetings as well - let’s see how SHE likes getting up way early!)",
            "Yea, I don't understand how people who lack basic reasoning skills manage to get in these manager positions.",
            "Get it in writing",
            "This is where I’d have replied, sorry my contract stipulates 9-5, and ride that horse until it’s dead. \n\nAlso say if you want to make it so I do different hours, I.e. certain days where a meeting is 6am and I get to leave at 3pm after stipulated hours are completed, then a pay raise must be in effect on top of allowing me to leave when we I want.",
            "i *almost* get the bosses who think their employees aren't really coming in early, or when they do aren't *really* working. But you can easily show documentation that you have been coming early and attending important meetings.",
            "I’ve see. Many variations of this play out, but usually without the malicious part being required.  We mostly work from home, official scheduled hours are 8-4:30. One guy I know does 6:30-3:00. His manager told him he should switch to be on the same schedule as everyone else.  Coworker points out all the stuff he has prepped and questions he takes care of before 8:00 every day that makes a lot of stuff go smoothly.   “I can switch, but that prep will stop happening.”   Manager laughed and said “keep your damn schedule at 6;30-3”",
            "I would still work 9-5 and make the lazy boss wake up to attend the meeting. Wouldn’t want to give the wrong impression.",
            "Used to work in a USA MNC's APAC head office in Singapore. When I went over to the USA HQ in Illinois, I saw by 3pm the office was half empty. The next day, when I went in at 9am, the office was already full of life. One of my then colleague told me he will knock off 3pm because in order to beat the traffic after a 2 hour drive, he would wake up at about 4ish am, get out of house by 5am and reach office at 7am. Now I know why by 3pm office is mostly empty. In Singapore, 3pm office is still full as we start on the dot at 9am.",
            "She assumed your drive to do your job right will push you to start at 6:00 but then you will leave at 17:00 because of the warning. Thus she would manage to make you work more hours. Very sneaky",
            "Remember. She’s just there manage you. Without you working she has no job.",
            "i’d settle in to my nice cushy 9-5.  they’d start calling me ol’ eight-n-skate…\n\nshe made that bed and i’d let her lie in it for at least a week…",
            "Good for you for showing a shiny spine and truly complying with her demand despite the potential fallout. \n\nMe, I'd take it a step farther and then email her manager on the morning of the next bi-weekly meeting she misses and ask their guidance as you having to prepare a report to fill her in on the meeting has become an expectation rather than an exception and it is cutting into your productivity and ability to meet your other deadlines/workload requirements (even if it isn't) just to CYA and make sure her manager knows that she is consistently missing something that is required of her job title and duties.",
            ">Today, she called me and dejectedly informed me that I can leave the office whenever I want from now on. \n\nThe full maliciouscompliance is to respond \"nah, the 9-5 works great! Unless you can boost my pay for me to come in for these early meetings.\"",
            "\"If I let you do it then I have to let everyone do it\" is the hallmark of the most laziest management style.",
            ">Otherwise people will think it’s okay to come in and leave whenever they want.\n\nI don't understand why managers can't get it into their heads that this is easily covered by having a conversation with the employee who also wants to leave early: \"Well, lawdiscord takes meetings at 5:30am, so they get to leave early. Are you interested in also taking meetings this early?\"",
            "Honestly I'm petty I would respond with, \"No, I think you were right to begin with in my position I should just work within the prescribed hours so now one believes I'm getting special treatment.\" \n\nI would get it in writing by sending an email. \n\nThat way she can start doing 5:30 am meetings I can sleep in and she can't get pissy with me. Plus that covers me for the future if you ever end up in the reverse with late evening or weekend meetings. \n\n\"No can do as you have told me before this is a 9-5 job\"",
            "Years ago, my husband worked for a famous tech company.  The engineers there worked flexible hours and often stayed late to finish up work.\n\nUntil a new manager started, and noticed that some people came in after the stated starting time.\n\nNew Manager (NM) decided to install time clocks and declare that everyone must arrive and leave at stated times.\n\nThe employees who used to stay late working now left at their exact time.  Productivity declined.\n\nHusband didn't stay for the fallout.  He got a new job with flexible hours.",
            "There must be a way to prosecute these sociopaths",
            "I’d love to have been a fly on the wall during that conversation! When her boss wanted her report. I’m thinking she probably took credit for your report to her that she had to pass to her manager.",
            "Some bosses and managers really have no idea how to manage irl. They have all the theory or have only worked on easy to navigate super structured places where they just follow the arrows. So when they find a place that has some adaptabilty requirements they collapse fairly east",
            "Actually, boss, I liked being able to sleep in until 7:30. I think I'll stick to the 9-5 schedule for a while. \nDon't forget your 6:30 meeting with New York tomorrow.",
            "Shit, when I was a manager, if you got your job done and attended any mandatory meetings (remote or in person), I didn’t care what time you came in or left. We had “core hours” of 11-3 on a few days to make scheduling those meetings easier for my PM. But if you got everything done in a 20 hour week, fine by me. Although no one really took me up on that, there was always something to do and people would rather work than be bored. Fridays were a ghost town 😂",
            "Nice job!  Revenge is best served cold. 🥳",
            "“I *am* working 9-5, just in a different time zone.”",
            "I worked on the west coast. Head office was on the east coast. If I worked from 9-5, when I came in, head office was out to lunch until 10 my time. So I couldn’t work with them until 1 my time. Same thing going home time. They all left at 3 my time. Therefore there was a 3 hour window to work with them. \n\nMost of my office didn’t work with main office (programmers). \n\nSo I arranged to work from 6-3. Everyone was jealous (but understood) that I left at 3 my time.",
            "She wanted you to work unpaid 5am to 9am, and leave at 5.",
            "Ha ha I love it. I had a much lesser degree of this, but I'd usually get into work early and set up for the day. Sometimes I might be a bit late due to traffic, but my manager never cared because I was earlier much more than I was late.\n\nThen we got a new manager, as usual I'd come in early, but once I got in at 8:02. New manager put his phone on speaker with that robot voice that says \"at the time, the time is 8,0,2. Then goes into a speech about how work starts at 8 o'clock, not 8:01, not 8:02, 8 o'clock.\n\nFair enough. I get into work my usual 20 or so minutes early next day, and sit in my car playing on my phone. And the next day, and the next day. A bit over a week of this, he says \" how is it every morning you walk through the door at 8 on the dot doing up your tie, I noticed when I started you got in a bit early to set up\". I said \" Yeah I used to, but work starts at 8 o'clock, not 8:01, not 8:02,  not 7:59 and certainly not 20 to 8. 8 o'clock\" and that was the end of that lol",
            "My theory has always been that if you come in late, you should leave early to make up for it!",
            "I love this sooooo much!!!!!",
            "Comply and make people wait several hours or charge overtime.",
            "In my work , I can come as late as 11h30 and go as early as 13h30. I choose the days I wfh, but the monthly average must be 3 days in for 2 days out.\nThe point is : the job must be done for the planned date and I am the one deciding how, where and when I do it.\n\nStrangely, our service attracts all the high potentials and weird profiles  that other services can not \" manage\" .",
            "How these dense people become (and stay) manager is beyond me.",
            "This story also works in petty or pro revenge. She was already pointing a double barreled shotgun at her foot, you just happily supplied her with the ammo. Love it!",
            "What a C word!  Nice MC... so did you show up earlier and leave when you wanted, or did you stick with the 9-5?  I hope you stayed 9-5 and made her do the 530 meetings herself.",
            "This is fantastic. In house counsel?",
            "This makes my heart happy. Know your worth! Don’t let anyone exploit you. If you’re taking on these responsibilities, it’s likely because you’re, at a minimum, very competent and good at your job. Proud of you for standing up for yourself! More people need to be their own advocates like you, OP!",
            "Yeah I don't get managers like this. How hard is it to say that person has been working since 5am and they can leave earlier than people that come in at 9am",
            "“You can leave whenever you want” \n\nThanks boss! You know I really enjoyed being able to sleep in that little bit, I think I’ll stick to the 9-5 schedule!",
            "Now is the time you double down. 9-5 or nothing.",
            "So she expected you to work for free?",
            "Next time, be sure to get it in writing from your boss to protect yourself.",
            "dont stop. like if you go back to essentially being her \"bitch\" it just gives her contral back over you to treat you like shit.\n\nshe dug the hole that should never be filled stating its a 9-5 job that means you inform her that she must attend those meetings herself no matter what and if it was me i would send an email(also CC in the boss of your manager and bosses of the other departments you meet with) stating you have been informed that your job is a 9-5 and so all meetings will need to be scheduled within that time frame.",
            "Nothing beats malicious compliance :)",
            "\"Whenever i want?  Oh good, ill stick to the 9-5 then\"",
            "What she ***actually*** wanted was for you to do unpaid overtime from 5.30 to 9, then do a full day's paid work; but she couldn't ***say*** that, you were supposed to infer it.",
            "I wonder if your boss's boss has to report that meeting to their boss, who reports to the boss's boss's boss's boss, and so on.\n\nMaybe they should just reschedule the meeting to normal work hours...",
            "Love this!  Sometimes you just have to \\*show\\* them what they want.",
            "You should have told her that you were quite happy with the 9 till 5 arrangement now.",
            "I feel for all of you that are dealing with awful bosses. Not to say that I never have, but my absolute BEST boss taught me what a “boss” truly looks like. When I made a mistake, I didn’t get reamed, humiliated or shamed. What did happen was her and I sitting together, figuring out how the mistake happened and how it could be fixed and how to avoid making it again. She let me set my schedule, paid me really well, asked for my input on different things and a whole lot more!! She helped me gain a lot of confidence in myself and my skills and abilities. I was able to take everything she taught me and I was offered a really good office position when her business had to close due to personal reasons that she, my boss, was dealing with. Unfortunately, my next bosses were alcoholics, who ran their business into the ground. I finally quit when they decided to start cheating clients and employees out of their money. The day they had me sell partially completed invoices just so they could pay the employees was the day I quit!! I got a hold of the owner of the company that bought the invoices and let her know. Unfortunately she never trusted me again and I can understand that. But she also cut off the company that I worked for and that put them in a huge financial bind. Unfortunately they burned a lot of bridges and their business was forced to close. Alcohol ruined a couple of nice people and a business that could have been very profitable!!",
            "In my job I am officially contracted as 9 - 5 \n\nAlthough by preference I do 8 - 4 instead,  no ones cares as loas I do my hours for the week.\n\nWorkers with autonomy will be better than if micromanaged",
            "*Stands up and slow-claps while getting misty eyed*\n\nBeautiful work my bro/sis! Simply beautiful!",
            "Refuse, you only work 9-5 until you get a raise",
            "Simple and sweet.  Delicious 😈",
            "Fakest shit I ever read",
            "And then everybody applauded me, hoisted me on their shoulders and carried me around the car park.",
            "Nope. Small company. No contract.",
            "'No thanks, 9-5 works for me, unless there's overtime involved'",
            "FAFO!",
            "Your manager:\"but my job it's to manage you, you can't do as you want\"",
            "Perfecto",
            "Gosh I love my boss.\nI can stroll in and out of my second job pretty much whenever I want. Boss doesn't care as long as I get my stuff done. She also doesn't usually care if I'm working in office or remotely, as long as I get my stuff done!",
            "Should have stuck with the 9 to 5 and win something.",
            ">Otherwise people will think it’s okay to come in and leave whenever they want.\n\nNot my problem. Do your fucking job",
            "> Today, she called me and dejectedly informed me that I can leave the office whenever I want from now on.\n\nAs soon as you can find a job with a more sensible boss?",
            "LOL. I love it",
            "I'm IT. I work about 42/hrs a week. Some weeks are long (thanks MS for crashing our teams phone that one Friday!). Some are short.\n\nWhen I leave early 'unplanned' I tend to still be available by phone and I can remote in. No one cares as long as I take of shit.  It's nice.",
            "Is she a micromanager? Some people have to get the other side of it, when they are caught, to realize the error of their ways.",
            "I would be sure to get an email from her on this and anything else in the future, even if it's you starting the email (BCC the boss too) after she talks to your saying \"Good day, thank you for talking to me about only working 9-5. Just for clarification this is the only times your wish me to work so it doesn't give a bad impression as people can come and go as they please.\"\n\nAt least you'll have some sort of written chain she can't back out of because who knows what she had said to her boss. Hope you don't get thrown under the bus.",
            "Awesome!",
            "Good for you!!",
            "Outstanding work there OP - A Chef’s Kiss for you! 😁🤌🏽",
            "You can leave the office whenever you want to now, only because it inconveniences her otherwise. Not because of the perfectly reasonable and logical explanation you provided. What a shitheel person.",
            "This post was satisfying to read. Thanks, OP.",
            "I work in an office and our typical hours are 7:30 to 5 (earlier on Friday). However, we have duties that require us to sometimes work outside these hours. Every single person here is capable of understanding that a person coming in late or leaving early has a legit reason for doing so. Obviously, we tell our boss when we're altering our schedules, but we're adults. We understand how responsibility and accountability works.",
            " I left at 3 today because it’s a Friday 🤷‍♂️ my boss doesn’t give a shit",
            "Stupid controlling boss gets her wish fulfilled. Chef’s kiss!!",
            "My spouse works in a lab and their boss is super chill. If you get there late just leave make up for it by leaving late. If you get there early leave early. The job is technically scheduled from 8:00-4:30 but my spouse sucks at getting up early so they often get in at 8:30 and just leave at 5 to make up for it.",
            "It's times like these that I'm so happy about who I have as a boss. We were doing performance reviews a few weeks ago. This year, I've been coming in later than my assigned time due to just not being a morning person but I make up the time by staying later and still getting my work done on time. I thought my boss was gonna give me crap about this but he flat out told me he doesn't really care since I'm still making up the time loss and getting my work done on time. Marked me as \"Meets Expectations\" for the time management section.",
            "Never give an inch.  Corporate take a mile.",
            "That's always so weird to me. I know where my developer was at a few times this week, but not very often -- and I don't care. She gets her job done, and done well, so it matters zero me exactly when she works.",
            "Winner winner chicken dinner!",
            "Excellent!  My employer had been very lenient with my time worked. I'm in the central time e zone, but we have another location on the west coast. I now work basically 9- 6",
            "I just fking hate micromanagering managers. Ive been in similar situation, where the bastard couldnt trust us employees to schedule our work as best as we could. \n\nBut no, theres always some bastard who thinks he knows better.",
            "Oddly, I find this motivating. I’m working to get into leadership so I can precisely spare the folks under my leadership this bull shit. Why we have such an infantile approach to leadership in general is beyond me.\n\nTreat folks with dignity and adults and it’s amazing what you truly do not have to fuss over. Any of those who take advantage of that can be handled individually. If it becomes widespread then you have a systems issue and not a people issue…\n\nAnywho. Good on the OP!",
            "Bwahahahahaha",
            "I'd fook up that 6 am meeting report.",
            "It continues to baffle me that  management people still do this stuff when stories like this have been around for years! Do they all lose their ability to think and read when they get promoted? Sheesh.",
            "P pop",
            "Oh that was so pleasurable thank you! Better than orgasm",
            "Damn right! What a bitch",
            "Good. I hate when someone is clearly a good worker/employee and then the manager hears a logical reason for _anything_ and tries to tow the company line. Good luck with that! lol",
            "I hope that OP stopped writing that weekly report as well, even though the boss changed the hours back.\nIf you have to get up that friggin early to be at a meeting every week, and she is supposed to be there too, no reason for you to write a report and bail her out each week."
        ]
    },
    {
        "post_id": "nrdt6c",
        "author": "CareBear177",
        "title": "Kick out the tenant-then ask him to showcase the place",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nrdt6c/kick_out_the_tenantthen_ask_him_to_showcase_the/",
        "score": 13276,
        "num_comments": 327,
        "created_utc": 1622727720.0,
        "selftext": "Mid 2010s I was on a hunt for a place while crashing on a friend's couch. I was checking out a place for 40% of monthly minimum wage and having arrived at the agreed upon time found an obese middle aged lady telling an agitated nephew that he can't freeload in his room anymore. So I talk to her and always the marketer offer to do some free digital marketing tips (basic stuff that people just ignore) before checking out the rooms, it never hurts to offer something valuable and low-cost for free before negotiations.\n\nI found an amazing room that made me feel like a vampire count with thick ornate columns, high ceilings, velvet drapes, with the only light coming from the glass wall on one side that casted my silhouette towards the entrance and kept my face obscure sitting behind the desk. But I should scope out the place right? So the landlord tells me she was bad knees and asks the nephew she just kicked out to show me around and upstairs, specifically to the room that just freed up (his).\n\n*Um what? That's not wise*...\n\nNot surprisingly he showed me the place flippantly, occasionally bad mouthing it, and let me know that there's rats.\n\n*Okay nope!* I said my thanks, left the lying landlord. That should've been the end of it.\n\nTwo days later, the landlord calls me in the middle of work and asks if I made a decision on the room and if I could show her the digital marketing tricks to which I gave her the benefit of the doubt and refused sternly. That should've been the end of it.\n\nYet she kept on calling, even when I blocked her she found other numbers to call from over the next two weeks. One day I was in a foul mood so I finally agreed if only to get her out of my life, except she then directs me to the nephew she's kicking out (as soon as his room is rented) because she's not good with tech. *Um what? That's not wise, but meh its what she wanted.* \n\nIt turns out the freeloading nephew was a natural and he managed to rank landlord's apartment on the top 10 search results complete with dead rats, dangerous fire escapes, fire hazards and all. The landlord was found in violation of numerous codes and I now had a capable and admiring digital marketer who eventually helped me get employed after CoVid layoffs.",
        "permalink": "/r/MaliciousCompliance/comments/nrdt6c/kick_out_the_tenantthen_ask_him_to_showcase_the/",
        "comments": [
            "Now that's how you network. Nice.\n\nI don't know what she was thinking. That her nephew - that she was kicking out and treating like shit - would give her a stellar review? The disconnect is painful.",
            "This doesn't make sense.  You're going to rent a room and partially pay for it by helping them advertise the room that is no longer available because you just rented it?",
            ">Two days later, the landlord calls me in the middle of work and asks if I made a decision on the room and if I could show her the digital marketing tricks to which I gave her the benefit of the doubt and refused sternly. That should've been the end of it.\n\n\nWhat do you mean by \"giving her the benefit of the doubt\" in this situation? Doesn't make much sense to me.",
            "How has this been upvoted over 4K times? I don’t understand what is happening in this story other than the light is just right for dramatic sitting? It makes no sense.",
            "This doesn't make any sense. Who's the marketer? You or the nephew? Who was offering who free marketing tips?",
            "I'm really trying to understand what this story is, but I'm juwt confused. Can someone please explain to me what actually happened?",
            "what a horribly written story",
            "Wow, I think this story gave me whiplash, lol.",
            "How has this God awful post got 4.5k upvotes?",
            "Perhaps \"freeloading nephew\" was actually marketing genius.  Give the place you're crashing for free a horrible review, all with nonexistant vermin and non-functional toilets... nobody will even try to rent it, so his free rent gig is safe.",
            "I understood nothing.",
            "I think you've caught enough flak for your story writing. I didn't have trouble following you. However:\n\n>it never hurts to offer something valuable and low-cost for free before negotiations.\n\nIt absolutely can hurt, when your advice is unwanted and unneeded. That could come across differently than you intended, especially if you've never met the person before. No free advice and no free food to strangers. If there's anything *tangible* you can offer, or if you know for a fact the person needs something intangible that you can provide, then I think you've got a great idea.",
            "Recently, I see many examples of the stupidy that encompasses some of these landlords.... it’s absolutely mind boggling. These people should not be owning a business or running anything by themselves yet here they are.",
            "This happened to my cousins a few years ago. There were definitely some problems with the place and it was two single moms being awesome and supporting one another and sharing rent, etc. You would think that the landlord would do everything to keep such good tenants. But they had complained to landlord about a number of legitimate things over time and instead of fixing them they sold the place. New landlord canceled their lease and then had a realty company make them leave from time to time so an agent could show it to prospective new renters before they moved out. They did this but also put up helpful poster boards and signs identifying things such as broken screens, faulty wiring, etc. I don't think they got back their deposit on the place but I do think they got tremendous satisfaction from being able to share their truth. Both of them are in much better places now and are doing well so losing that lease was a good thing for them in the end.",
            "Trying not to be a dick because grammar isn't everything and english isn't everyone's first language, but wow. I really can't understand this.\n\n&#x200B;\n\nInfo:\n\nwhy did you offer free marketing even before the room was accepted?\n\nWhy did you offer it yesterday?\n\nwhat constitutes marketing, and how did it go from this to her apartment being unlisted on so many sites? is this a self-owned house or",
            "Read through the post, didn't understand. Read through the comments, realised that I wasn't the only one.\n\nNot gonna re-read. Not gonna try to understand.\n\nMoving on to the next post.",
            "Her being obese had nothing to do with this.",
            "uh this story has some gaps. also why do you have to mention she was “obese”?",
            "I had a landlord who would show the place w/o proper notice. I made it a habit of walking around in tighty-whities and he started giving notice after that.",
            "Nothing here makes sense.",
            "I would have been suspicious of the nephew's negative feedback.  What if he was just trying to talk the place down to either A. piss off auntie, or B. try and weasel a longer stay at the place?",
            "Op use your tech tricks to make this readable.",
            "I can understand kicking a freeloading relative out. I can't understand expecting that newly evicted freeloading relative to show his/her replacement around the space s/he just vacated. \n\nAlso, if a potential renter blocks a landlord's number that means s/he does not want to get any more calls from that landlord. I would have filed for harassment.",
            "Yeah, kicks out tenant; asks tenant to accommodate room showings; what could go wrong??? Landlords act so clueless.",
            "Something maybe a little similar happened to me.\n\nI was subletting from this guy who had a lease for college. I needed a room for an internship. If you don’t know, rentals are often leased for a whole year and students will have to keep paying for a few months where they don’t really need the room. So like, there were probably 6 rooms in this shitty house and the students were trying to sublet them. It weirdly filled up.\n\nDuring the process of the lease holders trying to fill the empty rooms, they asked me to show someone around. I had no interest in doing this, because every additional person in the house was potentially another problem. I could go on for a *while* talking about living there. \n\nAnyway, I ended up showing this guy around. I made sure to talk a lot about how there were loud parties thrown weekly down the road by a Mexican family, about how the police love to cruise down the road, how the electricity/wiring for the house was spotty, how it was impossible to get anything fixed in the crumbling house, how one of the guys who holds the lease liked to come around and just take liquor from the freezer and try to hang out, about how one of the guys subletting decided that the furniture in the living room would be better in their room and they just took it, and some other stuff. That place was shit.",
            "I'm sorry to say you're not as good as you think at writing & storytelling. It's really confusing. You're trying to run before learning how to walk.\n\nStick to simpler sentences if you can't structure them nor punctuate properly.\n\nRead your story aloud, and breathe/pause only on punctuations. If you can't catch your breath or it feels unnatural: it's wrong. Luckily it's very easy to improve.",
            "Is the nephew obese?",
            "Instead of sending Wee Mad Arthur in to get some rats for CMOT's Rat-onna-stick treats.",
            "So the landlord kicks her nephew out, makes him show you his room and then the landlord gets charges and you get employment from him!? Impressive",
            "Nothing makes sense here.",
            "So the nephew became the capable marketer?\n\nThat’s a pro gamer move",
            "> The landlord was found in violation of numerous codes   \n\nThis sounds like the nephew was playing a dangerous game - he could have badmouthed the place so bad it got condemned, then he'd have nowhere to freeload!",
            "People that say I don’t work for family, have to understand you don’t have any family. Unless you hate them, what you are doing is a scummy move. And if you were related to me, I would not associate with you. You essentially treat everyone as a stranger. I would do the same to you. Lol",
            "Real jerk here is the nephew. The landlord only made a mistake in allowing him to associate with her. Probably some family issues there.",
            "Other than the boring flavor text, this post isn’t hard to read at all. How much hand holding do most of you need?",
            "family first.",
            "This belongs in r/ChoosingBeggars",
            "As a digital marketer for real estate I appreciate everything about this. Gotta ask of course if there's any tips I might be able to use.",
            "She had bad knees and probably an income problem and her nephew was staying without paying rent. She was in a really difficult position. What was she supposed to do?",
            "All you folks who charge family for computer support?  Glad I'm not related to you.  Obviously, there's a limit, but it would be more honest to just say, \"I'm really too busy right now, but here's who I use when I need help.\"  Charging your parents?  I can't think of anything less charitable, more despicable and arrogant.\n\nAnd in case you are wondering, I'm a retired software engineer.  Hope your kids charge you when you get too old to drive yourselves to doctors appointments and to get groceries.",
            "Wow! I hope her nephew has a good place to stay at now.\n\nI'm surprised she harassed you so much, she's probably not gonna have much time to do any of that in the near future!",
            "Wow, that’s fantastic! 😂\n\nIf she was so bad at tech, how did she find your other numbers? 🤔",
            "Allies come from strange places, but idiots are everywhere.",
            ">my nephew is a freeloader\n\n- landlord",
            "This post doesn't even make sense, wtf were you trying to write?",
            "Not quite the end result she expected but hey. Win/Win. Except for the landlady. Who didn't deserve a happy ending here.",
            ",,😗🤨 ÷q5c ,dz,a3xz5xZj, sw 2-!3\"!_-432-5++,fdw+,3:-÷《3□ du,w",
            "So, you have some free advice?"
        ]
    },
    {
        "post_id": "pej72t",
        "author": "Username614855713",
        "title": "Eat fresher",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pej72t/eat_fresher/",
        "score": 13272,
        "num_comments": 575,
        "created_utc": 1630333695.0,
        "selftext": "This one happened a few years ago when I worked in corporate for a large sub chain that has currently seen better days. \nThey had purchased a taco concept and part of my job consisted of going around the country to help open up these new restaurants. \nNow, this sub chain is not known for corporate luxuries, so I didn't bat an eye at the daily food expense allowance when traveling, which was $42 per day, broken out by meal. \n\nBreakfast: $8\n\nLunch: $14\n\nDinner: $20\n\nSo you couldn't even scrimp on breakfast and lunch to get yourself an alright meal.  But ok, I usually stayed in hotels that had a complimentary breakfast buffet and I often skip lunch and work straight through the day so my expenses we regularly less that $20 per day.  Now the problem comes, when during one of these trips my dinner came out to be $20.05 (before a cash tip mind you that I paid out of my own pocket and didn't expense). I didn't think much of it because hey, it's a nickel and I didn't go over my daily spending allotment. \nCut to the end of the month after submitting my expense report, I get a call from accounting that went like this:\nAccountant: I'm looking at your July expenses. How did you want to handle this?\n\nMe: Umm..I did handle it, I submitted. \n\nAccountant: No, you went over on one of your dinners. Would you like to send payment in or have it taken from your payroll?\n\nMe: I'm sorry... what total are we talking about?\n\nAccountant: You spent $20.05 on dinner xyz, which is a 5 cent overage. \n\nSilence....\n\nMe: Ok, so I owe 5 cents?\n\nAccountant: Yes.\n\nMe: You can take that out of my payroll,  but please do it over the next 5 pay periods.  I'd like to split up the payments for budgeting purposes. \n\nAccountant: Are you serious?\n\nMe: Are you?\n\nFollowing her true nature, she took a penny out of the next 5 checks.. and I made a point of spending as close to $42 a day as humanely possible for every other trip I ever took with that company.\n\nEdited: formatting",
        "permalink": "/r/MaliciousCompliance/comments/pej72t/eat_fresher/",
        "comments": [
            "When I had clients like this, even if I had an included hotel breakfast, I would purchase less perishable items I could have later, ie fruit or other. If they require it be spent at a certain time of day, so be it. Additionally, I had many an 11:30 am \"breakfast\".",
            "Having worked in payroll I guarantee it cost them more than 1 cent to process that payment … good job",
            "I've purchased protein bars with my breakfast allowance and simply kept them in my bag for a day when I had no time for lunch.",
            "We get the per diem just added to our check no matter what we spend. Don't have to keep up with receipts or submit anything. Even if it isn't used we get it still.",
            "I once had a doctor's office send me a bill for 5 cents.  They spent 5 times as much for the stamp.  The next month they sent me another bill, but now it was up to 10 cents for the late fee. So I complained about the 100% late fee.  Next time I was at the doctor a few weeks later and handed them a dime. The guy in billing got a kick out of calling me to thank me for the dime personally.",
            ">Accountant: Are you serious?\n\n> Me: Are you?\n\nEven if tied by corporate policy instead of, say, a sense of petty tyranny, it's always nice to throw ridiculousness back at them.",
            "I had a similar experience several years ago. I was out of town helping my company as we expanded into a new market. New market openings are extremely busy, so for breakfast a couple of mornings, I just grabbed a couple of donuts and a bottle of milk from a grocery store. The cost was a little over $2. My company requires itemized receipts, so when I turned it in, my boss questioned it. I said that it was breakfast. He told me I should have eaten the free breakfast at the hotel, so I explained that I had started working at 4am and breakfast was not yet being served. He then insisted that $2 wasn’t a proper breakfast, but a snack. The company doesn’t reimburse for snacks, so he refused to accept the receipt. I shrugged and resolved not to worry about saving the company money in this regard. Now if I’m traveling for work, I make sure to have a “proper meal” so no one thinks it’s a snack.",
            "[deleted]",
            "[removed]",
            "I worked for the most luxurious, over the top retailer you can think of, based in Texas. $50 a day meal expenses whether NYC or St Louis. Gratis Breakfast at the very nice hotel restaurant, skip lunch, dinner meal with contracted parties (on them) then off to chili’s to get a $48.43 gift card. 50% of cashiers know what I’m doing. Ask for a weird amount, say it’s for a birthday.",
            "Company I work at just gives a 50 euro allowance when you are abroad/have to stay overnight. Hotel they book for you also has breakfast included. Since it's an allowance you are free to do with it as you want, you go over you pay out of own pocket, you go under its a bonus for you. I guess this way they mainly save on accountants and the work you'd have to put in collecting expense notes and submitting them.",
            "Subway?\n\nI see them sharing restaurant spaces with Taco del Mar or whatever everywhere now.  I guess it's an interesting concept, especially if the same person owns two separate franchises but I kind of wonder how it really works...\n\nI mean do they split the rent equally?  What if the Subway side accounts for 80% of the business profit?",
            "Had a bookkeeper in a 10-person ad agency spend over a week hounding everybody over a **Three Cent** discrepancy.",
            "You really have to question humanity sometimes, this is just insanity.  Good thinking on splitting the payments!",
            "Hmm, this one time I was on a course and the accommodation was, let's say, on the back road. It was very close to the course venue in the opposite way of traffic so I didn't mind to much. Just eat and sleep there right.\n\nSo as customary, my company allowed you two drinks of whatever you choose (yes you could even drink expensive malts, but they had been clever enough not to book places that had such upmarket bars. Now, this venue had a bar, a relatively fancy one for such a place. It seems the accommodation was more to ensure drunk patrons stayed off the road than anything else. But alas, our new travel agency did the deeds.\n\nI got alloted a value to my meal with a gift card type of setup. But this card was dated per day. It would have been good value to eat breakfast, lunch, supper and dessert and at  have some wine or a few beers with your meals. The problem is, this place didn't have a kitchen... At all. You order from three meals (chicken beef or pasta) and about half an hour later a scooter shows up. So hungry me made peace with this fact and soon enough some OK food showed up.\n\nBarman asks me if I won't get in trouble for wasting company money. I was at a loss, so he informed me that they have been paid in full for this daily expiring card. Use it or lose it. So I ask how their reporting works. Nope, nothing, they received a receipt for the voucher when purchased, that's it.\n\nWell Needless to say, the next three nights was spent trying various different whiskeys, some off the beaten track beers and stuff I would have never thought of trying to begin with and sleeping way deeper than I ever thought possible . Well it's all paid already anyways, might as well get my company some bang for their buck.",
            "As a Subway employee I must say: this is not the craziest thing I’ve heard and seen while working there",
            "You'd be surprised how much more food you can get by buying stuff at a groceries store (or fruit stand), and if you're not too far from home restock your fridge on company dime.",
            "“Id like to send the payment in. Please provide me a pre-paid overnight package, with tracking number and insurance, for me to do so.”",
            "In a similar story my uncle owns a company and one month there was a bill for something like $2.40 that didn’t get paid to the bank (in a small town where he knows the manager personally and his company processes thousands of dollars a month). When he got the bill for the overage he called the manager and said “wtf? You know me. You know where I live. Give me a call beforehand or just take some change out of your pocket and I’ll get you back.” Switched the banks his business used because the manager wouldn’t waive the late fee.",
            "> Me: Ok, so I owe 5 cents? Accountant: Yes. Me: You can take that out of my payroll, but please do it over the next 5 pay periods. I'd like to split up the payments for budgeting purposes.  \n\nYou should have asked for it to be split over your next 6 periods.",
            "I once expensed an international business trip that amounted to around $8,500. Accounting emailed me and said my currency conversion was off by 17 cents but they will let it slide this time lmao.",
            "My company gave $35 a day. Period. No restrictions on how to spend it, or what to spend it on. I was sent to a store in another part of the state for a week, and bought a lot of snacks and drinks to keep in the store since I was doing 12 hour days, and on the rare days I got out at a reasonable time, I went and had a nice dinner. I never heard a single word about it…",
            "One of my old jobs had me travelling as part of the 'road crew' which consisted of the Director of Sales, Director of Marketing and myself - not a Director. On my first solo trip I got the rundown on my per diem before taking off (up to $100/day for meals and incidentals, no further details) and submitted it ASAP when I got back like the rule-following nerd that I am. \n\nThe next day the President of the company calls me into his office to discuss my expense report:\n\nHim: \"So... you drink, right? I mean, I've had a beer with you so there's no use in lying\"\n\nMe: \"Yeah...\"\n\nHim: \"So you're telling me you went out of town for a week and didn't have a single drink?\"\n\nMe: \"No, I just paid for them out of pocket because draft beers were like $9 at the hotel bar\"\n\nHim: \"Look, I don't give a shit. You're travelling for me and if you weren't travelling you could be drinking the cheap shit in your fridge. I expect to see your drinks on your expense report when I ask you to travel, understand?\"\n\nDamn, he was a great boss. A garbage businessman, but still a great boss.",
            "My company requires receipts for anything on the corporate cc that is $25 or over.  Almost all of my transactions are $24.99.",
            "\"I swear to God I'm going to make this the most expensive nickel you ever saved.\"",
            "If they're going to be this anal about cost per meal, I'd make sure I spent exactly that much for every meal to the penny.  I'd order meals less, and just give generous tips to my server.  Breakfast $5.25, $2.75 tip = $8.  Dinner $8.50, $11.50 tip = $20.",
            "That's ridiculous. The total charge for the day should be considered, not by meal. Good for you, you handled it like a champ.",
            "\"You can take that out of my payroll, but please do it over the next 5 pay periods. I'd like to split up the payments for budgeting purposes.\" \n\nI laughed so hard.",
            "So they literally nickel & dimed you.",
            "I was an accountant for over 10 years and dumb shit like that is the norm. All the way to the controllers would get involved  from 1 penny discrepancy. Glad I left that miserable career",
            "Pennywise and pound foolish....It cost them more than $0.05 to deduct once, let alone 5 times.  \n\nWhile I understand why these policies are in place, it makes me crazy that some managers and accountants are so rigid.  The purpose it keep people from going crazy on the company's dollar, but idiot application make people max it out to spite the rules, much like OP did.",
            "I love this.",
            "That is dumb. In the military we just get to keep the difference for per diem. So I can eat cheese sandwiches all day if I want to get some extra pocket money.",
            "I’ve so been there. As a former software executive, I used to tip cab drivers extra and ask for a book of blank receipts. Whenever accounting tried to screw someone on my team, I’d give them a blank receipt with instructions to fill it out for whatever they were owed.",
            "I came here for the MC and stayed for all the recipe ideas!!",
            "\"Are you serious?\"\n\n\"Are you?\"\n\nFucking legend",
            "> *$42 per day, broken out by meal*\n\n> *Breakfast: $8*\n> *Lunch: $14*\n> *Dinner: $20*\n\nThat is beyond ridiculous.  If you're giving me *X* amount of money to spend per diem on food, then why the hell do you care how I break it up, as long as I don't spend more than *X* per day on food?\n\nStupid corporate financial BS right there.",
            "It’s called the tyranny of the bean counters. They spent more managing the nickel than you did on food over several days. Idiots.",
            "Every trip you could have gone 5 cents over on one of your meals and each time that accounting caught up with you could demand that it be taken from your paycheck over the next five months.  Forcing employers to jump through similar nonsensical hoops that they try to force their employees through is a worthwhile practice.",
            "Always spend the remainder of your per diem/allotment on non-perishable food items you can eat later",
            "My company switched to a per diem. Breakfast was included in the room rate. Lunch was either a sandwich at your desk or occasionally the client would invite us out. Dinner would be one of McD, Quick, Burger King or of that ilk (good, cheap and fast, pick any two, guess which two we picked).\n\nThe per diem also included evening entertainment. The four of us travelling would each pay for one movie rental per week, so we would have a movie each night, but only pay for one (s/he who paid got to choose). It was only 4 nights as we flew in Mondays, flew back Fridays.\n\nLoved that assignment as each of us were pocketing close to €1,200 a month for the four months that assignment lasted. \n\nI believe the EU has now standardised per diem rates according to where you go. Still pretty generous.",
            "I feel that. My old Best Buy gig would allocate $35 a day for meal expenses when we traveled, but the catch here was we kept whatever we didn't spend, which meant that aside from trips where we barely had a mini fridge to work with, we would spend as little as possible on groceries to keep that juicy tax-free money.\n\nThey tried to get us to start using these company cards to pay for stuff, so everyone immediately starting using the maximum.",
            "Worked for the government we have a per diem which sound like yours except we get the amount for the whole day (half days on travel).  Unless the hotel has a complimentary breakfast, I'd bring cereal, pint size carton milk (that doesn't have to be refrigerated) and buy bananas.  Breakfast is thus settled.  Get a sandwich for lunch and have a decent dinner.",
            "Per Diem broken up by meal is a little annoying, but to be fair, that is pretty standard. And you per diem rates look about average too.",
            "Wow.\n\nI worked for a county-level government agency that had a per diem for meals while traveling. However, no receipts were required; you got paid the same whether you ate at McDonald's or Bern's.\n\nThe breakfast/lunch/dinner breakdown was just for the first and last days. If you left after noon but before 5PM (I think), you'd get paid the dinner amount ($20 if memory serves). Leave before noon but after 9AM? You'd get dinner, plus lunch ($15?). Leave before 9AM, you'd get breakfast too ($7?). Same in reverse for the day you return.",
            "I was interning at their corporate HQ at this time! They threw a huge tacky Mexican themed party for us all in the offices so I guess they needed the $.05 to cover that 💁🏻‍♀️",
            "I had an argument with a manager and the head of the accounting department over a $50 phone bill incurred whilst travelling overseas.\n\nBetween several emails back and forth and a face-to-face meeting, I guarantee more than $50 worth of company time was spent discussing the issue, for the \"resolution\" to be a 50/50 split.  \n\nGood on you for making them pay!",
            "either this is subway or this is quiznos",
            "This made my day 😃, thank you 👍.",
            "I have been taught a lesson by the Petty Master",
            "Incredible response. \n\nAlternate, “I’ll pay in cash tomorrow “\nGo to the bank, withdraws $100, 1 $100 bill. \nProceed to pay bill with said $100 bill.",
            "It’s crap like this that really loses a company money. Oh you want to treat me like that for being a good steward with your money? Okay, I’ll waste yours on needless stuff and feeding homeless or drinking lots or alcohol on your dime.",
            ">Accountant: Are you serious?\n\n>Me: Are you?\n\n*ohhhh*... sassy!",
            "That's fucking awesome.",
            "Lol this made me literally lol. That's ridiculous but I absolutely LOVE how you handled it!",
            "Deliciouscompliance",
            "friend of mine had a similar thing where his hotel sort of let him commit fraud by charging him full for every day and when he only ate a small breakfast then a regular dinner, he got whatever he wanted for dinner and they just charged a standard amount. Helped that he was on Greece and the restaurant was not part of the chain but a family business. Also helped that he was in the same hotel for like a month almost.",
            "When I’ve had people give me a meal budget instead of a daily budget.. I usually just get a larger lunch and ask them to split it into two receipts, and submit one as breakfast and one as lunch. They never stipulate any valid “times” for each meal, ie breakfast 6am-10am only.",
            "Literally nickel and diming you to death.",
            "Thats 5 beans you know …",
            "OMG, split it up over 5 payments!  I love it!  That's fucking brilliant :)",
            "Food prices in the US amaze me. I know about difference in values but $8 won't get you coffee and a donut in Australia.",
            "And it cost the company several dollars to have 2 employees on the clock spend time discussing the $0.05 discretion.\n\nCorporations, willing to spend $100 to save $1.\n\nReminds me of when I worked at Lowes’s and _ALL_ of our equipment was fiddley and it often took 5-10 minutes just to print a few price labels. “It’s crazy the company is paying me $12+ an hour and I’m wasting 10 extra minutes on this piece of trash. They’ve paid me hundreds of dollars at this point to trouble shoot a freaking printer” (I worked there for years so yeah, they probably paid me alone, not to mention the dozens of other employees, enough money to replace that printer with one that wouldn’t eat up time. But no, it’d be expensive to do that).",
            "I had the exact opposite with one company I worked for, and a lot better per diem.\n\nWe got $150/day.  But before my first trip my VP pulled me aside and told me, if you eat your meals with any other client's or colleagues then expense the meal and pocket the per diem.\n\nLoved it, also loved that a 1.5 hour flight to Dulles cost 2 grand.  And my return flights usually consisted of a connecting flight through Philly (1 hour flight) then a 90 minute flight home.",
            "Only thing sweeter would have been requesting 5 checks mailed to your residence. The postage expense alone would have given her a conniption, let alone the cost of cutting the checks.",
            "At one job, there was ALWAYS a stupid problem whenever I turned in travel expenses, and it was always insignificant.  For this job I would have never claimed the 5 cents over as it's not worth it. But they would have seen it on the receipt.\n\nI had accounting hassle me once because I only had a receipt for one way in a taxi (to be clear, I only claimed the one way). I don't remember why (at the moment) but I think I just told them I lost it (since it seemed easier).  Since they were satisfied I asked why they needed to know? They gave me some accounting issue, so I asked, but since you know now do I get the other half of the fare (I knew this was no go) and the answer is no.  Then why are you asking?  What would be a bad answer that you wouldn't reimburse me for the one way and they didn't have an answer.\n\nIt'd be so easy to have over charged them for things, I could have asked a taxi driver for extra receipts and made up more trips (for example when I took the subway). But when they asked stupid questions and they didn't even know why...  ARGH!",
            "if you stay in that job, you are the problem.",
            "I heard our CFO track down a manager and bitch her out because she approved a pack of gum— because one can expense snacks but gum isn’t a snack. Is the CFO’s time not worth more than a pack of gum?",
            "Just for the jlheck of it, i'd go find a homeless or other less fortunate peraon and get them a meal!",
            "I wonder what would have happened had you gone over each and every allocated amount every day and then requested she take it out of your pay but like you did before a penny/cent a month. You would have gotten the full amount instead of say 7, 79 for breakfast and she would have a ton of (paper)work to do.",
            "Lovely",
            "\"Are you serious?\" - did you not think being a pedant over a goddamn nickel, when OP isn't even using *half* of the $42 allowance, would inspire some kind of slapback? Seriously, they should consider themselves lucky you were so magnanimous about it. What an asinine policy.",
            "This is the (sub)way.",
            "Hell at that point might as well just max it all out and give the food to homeless folks",
            "I might actually just keep spending over to the tune of less than a dollar, just to have them take the additional pennies out every week for me to make up for it. \n\nThis is so ridiculous. Handled perfectly, OP.",
            "For shits and giggles you should have bought a meal to make it 1 cent over. Then tell payroll to deduct it over 3 pay checks.",
            "Nicely done.  Splitting the \"overage\" among five payrolls was brilliant.\n\nBack in my corporate travel days, the main rule was \"Keep it reasonable\".  They didn't pay a per diem, and they didn't impose limits.  And when I went the cheap route for a couple of nights when I was in NYC and then took my loopy and wonderful great aunt (the Christian Scientist, but hey, she lived to over 90!) out to dinner on the corporate card, they didn't complain.  In fact, the lady who handled the expense reports would take my expense check downstairs to the bank and deposit it for me!  Ah, the virtues of working in a small corporate staff.",
            "Where my brain is going is whether this was a per diem or a maximum you could be reimbursed. Where I work we have a per diem with the intention of not having to save/submit receipts. However if your actual expenses are more than the per diem rate, you can submit your actual paid value for reimbursement. \n\nThat's great that I get $15 for breakfast, but I'm on a business trip at a hotel chosen by my employer and their cheapest breakfast is $25, as example of where I could claim the $15 without receipt or $25 with receipt.",
            "I did the exact same thing when I was working in consulting. I was charged for 2p over on a dinner once (3 cents equivalent). I made sure every single day to spend my maximum limit, I used to just buy homeless people food with what extra I would have saved, so it ended up being some good karma for me.",
            "OMG, this is hilarious! I'd love to see how much that 5c cost them in terms of her salary.",
            "This is what my Dad calls \"sifting fly shit out of the pepper.\" Perfect MC",
            "Why weren't you spending that $42 a day before you naive little guppy",
            "That's fqn awesome.\n\nYeah, is still eat the complimentary breakfast and then spend the $8 on something at that point.",
            "i didn't know they tried opening a taco thing.",
            "I would pay for another meal but this time with a 2 dollar overage... then pay that out over the next 200 payments.",
            "My old boss used to make up client lunches etc.  Accounting was so clueless they didn't understand that the client was in Ohio and we were in Texas.  Thats how we got drunk before the flight to Ohio for free plus lunch.  His rationale was that it was a travel day, not a working day.",
            "“Yes, I’m sorry, can you charge me $.18 for “salt” so the bill will come out to exactly $42. Thanks.",
            "\"Are you?\" I pray to the flying spaghetti monster that you actually said this because it was absolutely fucking perfect.",
            "Lol. The accountant is going to remember that.",
            "Let's assume that the accountant gets paid at least $9 an hour, and lets assume this whole conversation occured for a minuts. $9 for 60 mins works out at $0.15 per minute. It *literally* isn't worth their time to follow it up.",
            "Yeah, after that, I would be buying meals for homeless people off the street to make sure I reach the daily allowance *every* day even when I don't want the meal myself.",
            "Hilarious to think of the time payroll wasted trying to \"recover\" a fricking nickel. Spending dollars to save pennies.",
            "OP, you have to hit enter twice to make the line breaks work:\n\n> Accountant: I'm looking at your July expenses. How did you want to handle this? \n\n> Me: Umm..I did handle it, I submitted. \n\n> Accountant: No, you went over on one of your dinners. Would you like to send payment in or have it taken from your payroll? \n\n> Me: I'm sorry... what total are we talking about? \n\n> Accountant: You spent $20.05 on dinner xyz, which is a 5 cent overage. \n\n> Silence.... \n\n> Me: Ok, so I owe 5 cents? \n\n> Accountant: Yes. \n\n> Me: You can take that out of my payroll, but please do it over the next 5 pay periods. I'd like to split up the payments for budgeting purposes. \n\n> Accountant: Are you serious? \n\n>Me: Are you?",
            "#YEET",
            "What are you talking about, $20 can't get you a decent meal? Are you talking Australian dollars or something?",
            "Quizno's is really letting you down huh",
            "In what universe is $20 not enough for an \"alright\" dinner for one?",
            "So you complied? How is this malicious compliance?",
            "Well done, OP.  Damn shame it wasn't $5 over.  Make them stretch that shit out over the next 10 years.",
            "LOVE THIS 🙌🙌🙌",
            "Reminds me or the 1st ever work trip I took in my early 20s. My boss was present and for dinner she picked the place where we could all go. She encouraged us to all get a drink and one girl asked if it could be expensed and she said of course. Later we found out that no, it couldn't be expensed and I was so pissed I spent $15 on a mojito with people I didn't even like.",
            "I gotta know what the answer was when you said “are you?” I wanna see how the accountant justified 5¢",
            "Your BDA sounds like a giant ass!",
            "Public sector ain't much better.  Connecticut also is by meal and well under market value for the region, they attempt to time bracket meals (particularly on travel days.. your flight was at 1pm, you can't expense dinner), and they would reject your reimbursement outright for an overage of any value, and I hope you kept your receipts for every little thing",
            "Anal?",
            "\"humanely\"",
            "Wait you don't eat at Corp restaurants for free?",
            "What's typical for this? I get $35 working for a hotel chain but we have breakfast included at the hotel",
            "\"...are you?\" Your response was GOLD!",
            "Wait, \"Eat fresher\" sub chain had tacos once upon a time???",
            "So payroll gets paid regardless of the work they're doing, but they usually don't set the rules and do get backlash for failing to follow them.\n\nI support your MC, but don't necessarily blame payroll unless you know for sure!\n\nMy work has state contracts that can be jeopardized if we submit reimbursements that go over the meal allotments.",
            "The question is, did the accountant come up with that budget policy, or was it administrative pressure? I feel like she was exasperated by you not because she thought the policy was reasonable, but because she was towing the line and expected you would as well.",
            "The question is, did the accountant come up with that budget policy, or was it administrative pressure? I feel like she was exasperated by you not because she thought the policy was reasonable, but because she was toeing the line and expected you would as well.",
            "I like your style !",
            "Hilarious!!!",
            "My company had a $35 per diem when travelling.  You couldn't get any dish from the hotel next to the home office (where we were required to stay) for less than that.  \n\nMy manager always just approved everything anyway.  Except alcohol.  We couldn't expense alcohol after some people fucked it up for everyone.",
            "Military?\n\nYeah, fighting for supplies is ... a bitch, and sometimes stupid...",
            "some corporate policies are so stupid that you \\*have\\* to play around it. well done!",
            "Maybe i was lucky but so far my per diem has always been paid out in full. No receipts or anything needed.\n\nIf i invite somebody for lunch and expense that then that meal is removed from the per diem and i am reimbursed for the meal, but with out a receipt its always the full per diem.",
            "the 5 cents weren't even worth the call. idiots.",
            "Contrary to this, my company was the contrary (although in the end it saved them money). We were working abroad and had a limited budget. We also had to be paid overtime. After 1 month of a lot of overtime, the top manager called and asked why we were doing so much overtime. We explained. We also explained that the customer was not paying for that overtime.\n\nA deal was quickly made. We did not write any overtime and all expenses were paid.\n\nThis was in Brussel. Most evenings we went for a quick bite, but Wednesday evening we could go out all out and Brussel has some very nice restaurants. It was also where I learned that after a few months, you fancy the local family restaurant more than the fancy michelin star restaurants",
            "Super late to the party but I feel obligated to point out that the accountant's salary for that phone call, not even counting how long it took them to set up the convoluted payment scheme, cost the company more than they got back from getting their 5 cents back."
        ]
    },
    {
        "post_id": "12kqs09",
        "author": "3-2-1-backup",
        "title": "Screw your HOA and its ridiculous rules!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/12kqs09/screw_your_hoa_and_its_ridiculous_rules/",
        "score": 13274,
        "num_comments": 596,
        "created_utc": 1681395483.0,
        "selftext": "Back in high school, I was all about my car. Don't get me wrong it was a rolling POS, but it was *my* car. It had a trade-in value of maybe $5, but it was ***my*** car. I was learning how to take care of it, by which I mean I found where the dip stick was and how to pull it. (I hadn't yet moved on to tire inflation. One step at a time!)\n\nOne day after school I drove over to my friend's place. We jump out, pop the hood, pull the dip stick, check the oil and it was fine so put the hood back down. I had no idea what an HOA was nor what it meant, I was just a happy ignorant teenager eager to demonstrate how responsible I was with my wheels.\n\nA few days go by and we're hanging out at my friend's place when his mom comes home. She starts giving us the business in that \"I'm annoyed but trying not to be\" voice about a warning she received from the HOA regarding repairing cars in your driveway, complete with a photo of my POS with the hood up. Really she was being pretty good, though clearly annoyed. We explain that we weren't repairing anything, that I was just checking the oil level, and didn't even need any tools. (Picture just had the hood up.) She softened quite a bit, and the focus of her annoyance shifted from us to the HOA since it's entirely reasonable for *anyone* to check the level of oil in a car. She finds her copy of the HOA rules and we all read them together. Sure enough there's a bylaw that says you can't repair a car in the driveway. I protest that I wasn't *repairing* anything, I was just checking the oil!\n\nReading the exact rules on exactly what was forbidden sparked an idea. I look at my friend, raise an eyebrow, and say \"Fight the power?\" \"*FIGHT THE POWER!*\" I propose my plan to his mom and ask for permission since she's going to have to deal with the fallout. She's on board since she thinks this is supremely stupid, and we set in motion. Cue the MC!\n\nEvery day after school my friend and I drove our POS machines to his place, parked in their driveway, raised the hoods, and just *looked* at the engines. No tools, we weren't even near them. We didn't check the oil, we didn't so much as touch them nor wipe them down with a rag. All we did was expose them to the birds, the sky, and God above to just let them breathe. After a while I got bored so I started setting up an easel and drawing my engine ten minutes at a time. My friend had to one-up me, so decided he needed some tasteful artistic photos with his engine. He judged the best photos would be him laying over the engine shirtless, stroking and fake kissing it. Just absurd over-the-top moronic high schooler stuff.\n\nPredictably the HOA was on us like stink on shit. The warnings quickly  turned into fines, complete with pictures of both vehicles with their hoods up. Then more pictures with mine with its hood up and an easel in front. Then even more pictures with my friend's with its hood up, him laying in the engine compartment and me taking pictures of him with a camera.\n\nSoon enough his mom let us know it was  time for the monthly HOA meeting. *Of course* all three of us had to go in person to protest the fines! So the motley pair of us show up along with his mom, and his mom's stack of fine notices. I bring along my engine drawing, and we printed some of my friend's ~~boudoir~~ engine photos larger than normal.\n\nAfter a while it was new business time, and my friend's mom steps up. I'm pretty sure they expected her to play the \"my son and his friend are morons, please make these fines go away since I didn't know what they were doing\" sympathy card. Nope, not a chance! She politely but firmly attested that she was being sent fines for something that wasn't in the bylaws, and asked the board to stop. One of the board members spoke up saying that working on cars was against the bylaws, and clearly that's what was going on since both hoods were up.\n\nOh you should have seen their faces when she corrected them that the bylaw said no repairs were allowed, that there were no *repairs* going on in any of the pictures since no tools were visible, and that we were just doing art projects for school. Even longer faces were seen when she showed my (truthfully completely terrible) drawing of my engine, along with the date-stamped-a-couple-weeks-ago pictures (this was back when film cameras stamped a date directly on the picture!) of my friend trying to seduce his engine. \n\nThe HOA president called for a five minute recess, during which the board huddled in a corner of the room. After the recess, the President succinctly said \"M'am, we are going to dismiss all your fines. Have a nice evening.\"\n\nWe damn near danced out of that meeting! Being the obnoxious shitheads that my friend and I were, we had to do the drawing/photo routine a few more times just to make sure they weren't going to start sending more fines. They wisely didn't, and being victorious we soon found other ways to annoy them.\n\ntl;dr: HOA forbids repairing your car in your driveway. Friend and I decided to draw my engine and take photos of my friend on top of his instead.",
        "permalink": "/r/MaliciousCompliance/comments/12kqs09/screw_your_hoa_and_its_ridiculous_rules/",
        "comments": [
            "A true tale of David and Goliath, but instead of a slingshot, it was sexy engine photos. Gotta love teenage rebellion, especially when it's in the form of engine seduction.",
            "You should have done repairs on the car while parked in the front yard, then reminded the HOA it said driveway, not yard.",
            "Props to your friend's mom for fully supporting the two of you in your MC. Not only did she listen to you and take the time to do the research on the exact rules with you, but to support your actions at the HOA meeting was a good example for a couple of teenagers of how to advocate for yourself or others.",
            "Awesome! HOAs are a PITA. It is usually a board member or one homeowner who takes stuff too seriously and too far. Lodging complaints all the time.\n\nI had a condo at one time and the HOA was taken over by a group of people that were pretty power hungry. I sold asap and never looked back.",
            "Imagine your battery dying and you need a jump. Per HOA, you’d have to tow the car off the property and then get it jumped. $150 and hours of your life for a free “repair” that would take 5 minutes.",
            "“Draw me like one of your French engines, Jack.”",
            "I had some shenanigans with my own HOA being absolutely ridiculous. I got back at them by running for and winning the seat for Chairman of the HOA Board.\n\nNo longer is the HOA for busy-bodies to harass people. It’s to address the people who park in front of fire hydrants and disturb their neighbors with valid things. No more “your tree looks out of control. I’m not an arborist, it just looks sloppy.”\n\nOr “You put your recycle bin too far into the cul de sac.”\n\nThe only downside is that I’ll probably continue to be elected until I’ve served the max term. I got so petty I literally became the change I wanted to see in the world.",
            "We want to see those pictures!\n\n(And the not-at-all-terrible engine drawing!)",
            "r/fuckHOA",
            "If they had photos taken of you on multiple occasions to document your \"crimes,\" you should have been able to tell exactly where the photographer was and (probably) which neighbor it  was.\n\nSince HOAs are absolute garbage and their terms are complete bullshit, it should have been easy to find several things your peeping tom was doing in violation of the handbook and get them fined.",
            "HOAs are populated exclusively by the worst NIMBYs in all of existence.",
            "I've been in my current hous about 3 years.  It does not have an HOA associated with it.  However, on the other side of a wind break of trees from my property there's a small development of 20 homes all of which are in an HOA.  \n\nThat development threw a Halloween party, and invited all the surrounding families (about 6 in bordering non-HOA homes like mine).  Shortly after I got there, a man swaggered up to me, introduced himself, not with his name but with his HOA title and proudly proclaimed that he was the one I had to get permission from to do anything with my property.  I just smiled and said \"I don't have to worry with that crap.\"  He didn't take a hint, and somewhat aggressively suggested that I wanted to modify my tone if I wanted to stay on the good side of the HOA.  I just said \"See that line of trees over there?  My house is the one on the other side.\"  \n\nHe looked like he had bitten a lemon… Truly, a golden moment.  It was worth him being a dick just so I could have the opportunity, ney the *privilege*, of shooting him down. I recognise that this probably makes me a petty and vindictive person, but sometimes you've got to take the wins that you can.",
            "Bullshit like this is why I will never under any circumstances join an HOA for anything other than collective maintenance of a common asset like a road. Even then I'll only do so if the bylaws explicitly state that any rules beyond that require unanimous approval of all members.",
            "Yeah I hate HOAs. Had a similar thing happen with me. My mom had a second vehicle that she seldom drove. Maybe three or four times a year. So of course they sent her a notice saying that you can't have disabled vehicles parked on your driveway because it hadn't been moved in months. So I shot a video of the vehicle backing out of the driveway then driving down the street and driving back and then back into the driveway. And sent them that video with my response that the vehicle is not disabled it just isn't used very often.\n\nOf course being an HOA they still sent nasty responses back that just because you can move it doesn't mean it's not disabled. I said that's exactly what it means. And they responded well we're going to continue to fine if you keep parking the vehicle on the driveway. I responded with well let me know who you're legal representation is because we're going to have to go to court over this.\n\nI'm guessing their legal team took a look at it and all of a sudden everything went away.",
            "I got busted(a warning) for changing my windshield wiper blades. A few months later the HOA board member is failing at replacing hers so I helped her, probably should have reported her.",
            "Where the hell are you supposed to work on your own car if not in your own driveway??? HOA's are the devils butthole. Glad you got to watch them eat crow.",
            "I lived in this neighborhood once.\n\nThis kid would always be smoking and drinking in an area he and his buddy thought no one knew about. But I walk my dog a ton and I knew the whole area. I never turned him in, every kid needs that kind of place to go to.\n\nAnyhow this kid's dad bought him a project car. This kid and his best friend were working on that thing non-stop.  I was secretly proud of him and watching them make progress.\n\nEnter bitch lady who calls the cops and has any non-running vehicle in the neighborhood, parked on the street, get one of those stickers.  She was clearly trying to get this poor kid's project car towed.  \n\nThey eventually got it into their yard. I wish I had been home when they moved it, I would have gladly helped.  But man fuck that lady.  That kid was keeping out of trouble with that car, which was obviously his dad's goal. And it taught those 2 kids a lifelong skillset that they could make a living using.",
            "*>  Being the obnoxious shitheads that my friend and I were, we had to dothe drawing/photo routine a few more times just to make sure*\n\nNothing obnoxious about that, the HOA member that reported you was the obnoxious one. Confirming they learned their lesson was a charitable use of your time, well done! :)",
            "By their definition, you can change the oil, as that falls under maintenance, not repairs. Replacing a broken mirror, would be a repair.",
            "My HOA also forbids car repairs in the parking area. However, last time I (54f) was checking the fluids in my car, half the old men in my building, including our board reps, were agog that I knew how because they didn’t.",
            "A fine tale indeed.  Where's the pics?",
            "I love it! Honestly, I never understood any good for being in an HOA. If I want to have a nice house the way I want, screw it. It's MY land. But thanks for the great laugh!",
            "Um, who's the creepo with the telephoto lense that's taking pics of teen boys with their shirts off taking photos of one another? Like, how did they manage to come take a picture and escape detection every time? Did they have absolutely no life at all?",
            "I would rebuild a whole freakin car in my driveway. \"It wasn't broken, so it's not a repair.\"",
            "At this point since you and your friends were minors at the time, if I was the mom, I would have insisted on knowing who photographed minors without parental permission and made a big stink out of that. (“Oh, OP’s parents aren’t part of the HOA? I guess the police will need to deal with this - I guess they’ll be notified by his parents.”)",
            "Wtf. Does no one in that neighborhood pop the hood to clean out the leaves underneath?\n\nThe art project angle is awesome.",
            "HOAs are Satan's taint.",
            "Hum.... So some adult of the HOA took pictures of a shirtless minor? 🤔",
            "In all honesty, someone breaking down their car and laying engine parts all over their lawn is an eyesore.\n\nBut that is not what you were doing; even the picture that was sent with the fine showed that’s not what you were doing.\n\nSo you spent weeks not doing it, and took your own photos to prove you were not doing it.\n\nGood for you.\n\nWe don’t have an HOA, but that doesn’t stop neighbors from getting in your business.  One guy in our neighborhood has a “garage” of sorts in a huge, clean, sleek trailer in his front yard.  He can do whatever in there, out of sight of everyone.  I often wonder if that trailer is *his* malicious compliance.  It certainly doesn’t bother anyone, and lots of people have their RV’s parked in their driveway, so there’s no room to complain.\n\nBut no one gets upset if someone checks the oil in their car, even if they proudly do it every day.\n\nThere really is something about that first car.  I still miss my ugly as hell mist green Chevy Nova.",
            "Next move?  \n  \nWork on the car in the streets.",
            "\"Maintaining\" also isn't \"repairing\"\n\nSo change your oil too. Rotate your tires. Etc.\n\nJust make very sure of the wording of the bylaws.",
            "Ok, I gotta ask--who was taking the photos and turning them in to the HOA?  That's whose house needs to get TP'd and the air let out of their tires!",
            "If the HOA regulations do indeed state that you cannot repair a \"car\" in your driveway, I would definitely start doing repairs on motorcycles in the driveway whenever I was home. I would probably repair a tractor or two from my Uncle Bob's farm on occasion as well.",
            "Neighbors have too much time to be stupid",
            "You sure DROVE them crazy! Really TIREd them out. Well done ;)",
            "Any car that can move on its own has a trade in value of at least $500.",
            "Years ago I got written up because a satellite 🛰  dish was visible from the street. This wS 5 days after I bought the house. Sent the hoa a copy of FCC regulations that prevented them from doing anything unless cable TV had been previously installed along with proof of closing date. Never heard another word",
            "Since the rule say that no work on cars is allowed in the driveway, I thought that you were going to say that you pulled it on to the front lawn and tore the car apart and put it back together again.\n\nBut this was beautiful in its own way. :)",
            "As an ignorant non American, what the fuck are the positives of a HOA? All I hear about them is people being fined for doing regular shit",
            "You make my ~~head turn~~ engine crank right round baby",
            "Also, I would point out that checking motor oil levels is not *repair* on an automobile. It is *diagnosis* of an automobile; at most it is *maintenance* on an automobile.\n\nHOAs need to get loin-slapped with an iron gauntlet far, far more often. Good on your mum for standing up for you and your bro's' 'artistic pursuits.'\n\nSo, did those engine drawings become a gateway drug to technical drawing as a career?",
            "HOAs. A tiny more expensive and controlling government for people who like to complain about taxes, freedom, and government.",
            "[deleted]",
            "John Oliver did an episode about HOAs last week.",
            "Checking the oil level is basic automotive maintenance not repairs, typical stuck up HOA board members have no clue and have never done a proper days work in their lives",
            "Should cross post in r/fuckHOA",
            "Me: Reads story about HOA and cars.  Looks at the 8 cars in front of my house.  My car, wife's car, daughter's car\n\nAnd my son's FIVE cars.  \n\nTwo of those are not running - one (soon to be 2) are for sale and his daily driver.  Once he's down to 3 cars we're telling him he needs to fix the other 2 before getting more - or move out somewhere he'll have space for them.  We've become \"that house\" on the street.",
            "\"No repairs in the driveway\" \n\nTime to replace the engine *in the street*. \n\nYou're not a resident.",
            "Please tell me you both had mullets",
            "This was true *Gold* MC!! Every time I read a story about how horrible HOA's are and the people running them, I am always reminded of the bitchy HOA president in the movie \"Over the Hedge\"! She was portrayed perfectly as the Uber-Karen *and* the power-hungry HOA assholes! Always running their HOA kingdoms thinking they are the kings and queens smh.",
            "**FUCK HOAs**",
            "As a member of an HOA board to make sure we focus on shit that actually matters I love this.",
            "HOAs are the devil. Change my mind.",
            "Not sure if someone else has said it and maybe you know by now, but you should check your oil (and most fluids) when the engine is cool to get an accurate reading.",
            "I'm so fucking glad I don't live in an HOA neighborhood. I can get where they can ensure the 'hood looks and stays nice, but 95% of the time, it's just a breeding ground for power-hungry Karens.",
            "John Oliver just did a piece on HOA's. They're scary.",
            "Omg, two hoods up. What if you need to jump the battery? Can't repair it in the driveway... Can you do it in the street?",
            "HOAs are the worst.  Good for you.",
            "I still don't understand how HOA is allowed to exist in America, you know, the land of the free, and home of the brave. Must be some kind of elaborate joke.",
            "John Oliver just did a segment on HOAs, and I've only briefly heard horror stories on Reddit about them.\n\nTruly glad my wife talked me out of any interest in HOA neighborhoods.\n\n  \n\n\nHOAs can go fuck themselves with a 10 foot pole.",
            "Omg HOAs sound freaking awful! \nI refuse to live in a strata complex (in australia they usually consist of blocks of units, apartments, townhouses etc) because they have stupid rules like this. Thankfully mostly estates and housing divisions don’t seem to have anything like HOAs, though they do sometimes have rules around what the front of your property/ house should look like 😒",
            "> by which I mean I found where the dip stick was and how to pull it.\n\n*cue Beavis and Butthead style laughter*",
            "Do a version of the Sistine Chapel, with God (the friend) floating over the engine, reaching down to touch the dipstick with his gracefully extended fingertip.",
            "I rebuilt the diesel engine of my car in my condo parking space.  SOMEHOW nobody said anything even though I think there’s a rule against repairs.\n\nI didn’t care either way, since the maximum fine would have been $200 every seven days for the same ongoing offense.  It would have cost more than that to rent another place to work on it for the few days that it took.  Even more to have a garage do it.",
            "I don’t get this HOA shit. The closest I’ve ever seen across the 12 or so countries and 43 years, I’ve lived in across 4 continents is that Tom Hanks movie where he is the Karen. \n\nWhat the heck? Can’t people just be normal, civilised, anymore?",
            "HOAs are just extrajudicial anti-poor organizations.",
            "I honestly believe that Karens were born from HOAs.",
            "I will never buy a house that has HOA.",
            "I get that ppl want their communities to look nice, but can we all agree that HOA’s are stupid?\n\nIf I wanna repair my car in my driveway, on the property I OWN, I’m going to. Thank god, HOA’s don’t exist around here, that I know of. Nor will I ever live in a place with ridiculous rules.",
            "It strikes me as ridiculous that you aren't supposed to check your oil, tyres, change light bulbs, etc, on your drive. They're compromising basic car safety.",
            "I just watched the John Oliver episode on HOAs. They are truly a work of evil. Well played",
            "Love this you should crosspost to r/fuckhoas",
            "This is excellently done. I love the idea of your friend's sexy engine shots being passed round as evidence.",
            "Fuck HOA!",
            "Anyone else hear Beastie Boys playing in their head as the story progressed?",
            "Mechanic’s Kiss. This is perfection.",
            "Delicious. HOAs getting screwed by their own rules are always wonderful to read.",
            "Hoas need to be banned",
            "reminds me of a case of some guy bonding with a vehicle via the exhaust and with his trousers around his ankles, maybe some artistic bonding photos next ? :)",
            "\"Draw me like one of your sexy French engine blocks\"",
            "Over 4 hours and still no one has referred to [\"Queen - I'm In Love With My Car\"](https://www.youtube.com/watch?v=oaEM4JYFPfw)?",
            "This is the best post I've ever read in this sub! It's a delightful story and you're a fantastic writer. I also like any account of tweaking the effing HOA noses. God, they're always made up of wannabe tyrants.",
            "Fuck HOAs, Karens and NIMBYS.",
            "So you can’t even do your own oil changes in the driveway!?  Mind, I guess that’s *maintenance* not repair, so you should be good to go!",
            ">my friend trying to seduce his engine. \n\n\\**heavy Mechanicus breathing*\\*",
            "Don’t understand HOA at all. It’s your property, do whatever the fuck you want on it",
            "This made my day. And that's saying something since it's 5 minutes before midnight where I live.",
            "Murica \n\n\"Land of the 'free'\"\n\nThat is unless you're in prison, black, poor, or live under a HMO. \n\nNice freedom ya got there.",
            "This should have been capped off with an awesome grade on a school art project reported to the HOA as evidence for pro level.",
            "Art wins!",
            "Crosspost to r/fuckHOA .",
            "/r/fuckHOA",
            "There is no HOA in my neighborhood. We live free on our street.",
            "Seeing HOAs get nuked never gets old........",
            "The problem here is that these busy-body, likely-retirees, do-nothing-all-day degenerates have more time to waste on this nonsense than you do. In most cases you'll crack first.",
            "Glad that it worked, but you have to know that plenty of HOAs would have left the fines in place, because those are the kinds of people that choose to be in a HOA.",
            "I hate HOAs with a passion.",
            "bro this had me cacklin in the office like damn",
            "Hope friend’s car wasn’t named Christine.",
            "Any pictures of your fellow MC seducing his engine still around? Asking for a friend.",
            "So you can't repair your own car on your own driveway? Remind the world again how free America is...",
            "Did you see Last week tonight did a show on HOA? I am thankful that I dont live anywhere near one.",
            "#ROW ROW FIGHT DA POWAH!",
            "What I hate hearing in situations like that is \"We'll dismiss this but don't let it happen again.\"  Don't let non-violation activities happen?  No, I don't agree to those terms.  \n\nI've had this response from  cable providers, cell phone carriers, and others.  The cell phone one was the worst (F you Verizon).  They had erroneously billed me for long distance calling while being on a 3rd party network.  I called them up, confirmed my calling plan allowed for both.  The rep said, \"We'll  adjust this this time, but if you do it again we'll have to charge you.\"   I said I'm already paying for it as part of my plan, if it happens again I'll report you to the Attorney Generals office for attempted fraud.",
            "Who the fuck thinks thats a good rule? \"No you can't repair the things you bought on the place you are paying for using the tools you paid for\". 100% some bad shit hapened beforehand and the blame was car fixing so horrid orphans association decides to straight up make basic diy stuff illegal",
            "What kind of horse shit freedom is this? \n\nAble to carry an AR-15 in your own driveway, but not allowed to change your car's oil?",
            "What fuckers are taking pictures of every car with a hood up. You know damn well it's elderly white woman",
            "Man I hope this is the kind of bs my kid gets up to when he's a teenager.",
            "Amazing MC. HOAs generally suck tbh.",
            "HOA boards = people with more time than brains",
            "The fact that HOAs are even a legal thing is baffling to me. Like, if you aren't violating any laws or causing any trouble, why should some jumped-up NIMBY Karen get to dictate what you do on your property? You own the damn place, do whatever the hell you want.",
            "Imagine not being allowed to work on your own car. \n\nHOA's are a fantasy for the Karens that run them and the cucks that love to live under them",
            "John Oliver did a whole segment on HOAs very recently.  Why do you Americans put up with them??  Land of the free huh?  HOAs staffed by busybody authoritarian assholes who get hard by bossing people around with their limited power.",
            "\"They wisely didn't, and being victorious we soon found other ways to annoy them.\"\n\nDo tell, don't leave us in suspense!",
            "I am glad I have never been under the tyranny of a HOA, they sound to be the scourge of all existance.",
            "Is it wrong that I don't feel a shred of empathy for people who live in HOA neighborhoods? Such \"not in my neighborhood\" energy.",
            "HOAs are a scam.\n\nPay people to follow their rules? Fuck that noise. \n\nAnyone should be allowed to work on their vehicle on their property. That's just an insane rule.",
            "Why not start a scrap yard, at the end of the day dismantling cars isn't repairing them. Quite the opposite in fact, in sure the HOA would be thrilled!",
            "❤️",
            "Love it!\n\nFortunately the HOA in my neighborhood is very minimal already and pretty chill. They just make sure there’s a service to mow the common areas and that people keep their houses in good general repair (they do NOT canvas and only take action if there’s a legitimate complaint that can be verified).\n\nI joined the board so I can make sure the HOA keeps staying out of everyone’s business. I appreciate how low key it already is and want it to stay that way.",
            "Sir/Ma'am, that's not how you turn on an engine... (Or at least the last time I've checked anyway).\n\n\n\n\nThis assumption/rule is almost as absurd as one rule with our neighborhood HOA that got established, a year after the neighborhood started development & we moved in: \"You cannot park your vehicle(a) on the street/curb overnight; you can only park on your own driveway.\"\n\nLike, the driver of that silver Honda Civic is a guest, and he's being courteous to not park behind any of us, in case we have to leave before he does. However, when a different guest parks her silver Honda Accord at that same spot, she's the one that gets the warning (hand written on construction paper) placed on her windshield, after we've been getting several mailed in warnings.\n\n\nWe did ask for a copy of the neighborhood's bylaws in 2013 when this was happening, since they never sent the copy of it the year after we moved in, circa 2004/2005.",
            "[Obligatory](https://i.imgur.com/mH1gIKL.jpg)",
            "Amazing. Also HOAs are the bane of existence. Seriously who do these people think they are to fine someone for something COMPLETELY legal happening on THEIR property? \n\nTruly dont understand how these unhinged associations exist at all.",
            "Please what other ways you found to annoy them? I am keenly interested",
            "Offtopic: Are these HOAs common in the U.S.A? How come? I mean that's a conservative country where a lot of people thinks that liberals are communists, so why do you have these collective HOAs that seems to be able to dictate just about any stupid rules?",
            "[Last Week Tonight](https://youtu.be/qrizmAo17Os) did a jaw-dropping show on HOAs recently. What startled me most is that many HOAs are contracting out management, so essentially privatizing infrastructure like roads. It’s not just older retired people cruising around looking for violations anymore, but people specifically hired to do that.",
            "Is it possible in join/takeover the HOA leadership with others and then disband the HOA completely?",
            "Tell em to piss off and suck ur balls",
            "Some HOA rules are fucking ridiculous.",
            "Respect. Seriously. That’s something I’d have done LOL.",
            "As a British person, HOAs are insane to me. If someone tried to tell me what I can/can't do on my own property (within reason obviously) they'd be immediately told to get to fuck.",
            "My parents got a letter from our hoa one time for me working on my truck in the driveway. The way our driveway was you basically had to walk up our driveway a bit to even see where i usually parked. They agreed it was bs and just told me to try and park more to the side next time.",
            "Even if you had tools out, conducting regular maintenance is not a repair. Technically you can replace your oil and filter and all the fluids in your vehicle whenever you want as that is considered maintenance and maintenance is not the same thing as repair.\n\nMaintenance is keeping something in good condition... Repair is fixing something that's broken. If nothing is broken then you are not conducting repairs. Same thing about upgrading your vehicle parts to better parts. If the part you were placing is still in working order then it is not a repair.\n\nEven jumpstarting your vehicles is a perfectly valid reason to have two cars in your driveway with the hoods up and it would be considered maintenance, not repair. Nothing is wrong with the vehicle, nothing is broken... You're just refilling the energy levels just like you would refill the washer fluid. That's a maintenance item, not repair.\n\nAs a side note me pulling semantics/pedantry like this is what pissed off the admins in high school my senior year. After winter break the entire school had to sign a new student code of conduct that was twice as thick as the old one. I was constantly pouring over the code of conduct before that and following the exact letter of the rules in ways that annoyed and pissed off the staff. They had to legalese the hell out of it and put in tons of definitions specifically defining words being used just like Congress has to do with actual laws. If they used a word that has multiple definitions or vague definitions then it's left entirely up to interpretation and that's the wave that I rode that year.",
            "/r/fuckhoa would like this story",
            "I think you can organize to disband an HOA or remove your property from the HOA. I worth a try if you really like where you live but can't stand the HOA.",
            "Great job ! HOA's are a fuckin plague.",
            "This is how you tell a story. Glorious.",
            "oooh\n\n\"Hot Hatch\" pictures",
            "HOA’s sound terrible , good thing ill never own a home ! Dodged a bullet there",
            "I'm sitting here at work chuckling and trying not to draw attention to myself.  Excellent MC",
            "OP, /r/fuckhoa would love this.",
            "idiots",
            "HOA audits need to be a more of a thing.",
            "They would need to really specify what repairing means. Changing oil. Not repairing. Changing wheels. Not repairing. Cleaning engine. Not repairing. Washing the car. Obviously. Not repairing. Upgrading the car. Not repairing. And on and on.",
            "The boudoir photos had me dying....perfect \"art\" project!",
            "I had a hoa that would send you a fine if your trashcan wasn’t off the curb by 5:30 them mother fuckers hated me with a passion 😎🤣🤣🤣🤣🤣🤣",
            "I don't understand HOA's. Americans are all about \"freedom\" and shit but then sign up in droves to live in tyranny.",
            "engine...seduction? *adeptus mechanics sweating intensifies*",
            "Seen that communities could vote out the HOA. See if you could do that",
            "What no girls in nice Bathing suit's modeling on the car's ?",
            "\\#neverHOA",
            "This was satisfying to read",
            "In these years in Reddit i learned something:\n\nHOA is like the Government, but sometimes you have the actual chance to some satisfying revenge.",
            "American HOA is so fucking weird for us europeans.",
            "The two of you couldve combined the pictures and drawings to create a calendar.  \n\n\"Sexy Engine Calendar: or how to tick off an overzealous HOA\"",
            "why do they care about repairs in the driveway anyway?",
            "I know it is a long shot, but does the drawing of the engine still exist? I wish to peruse the art.",
            "I wish I could upvote this multiple times--well done!",
            "Draw it like one of your Peugeot engines.",
            "One takeaway from this should be that rules (and laws) are based on semantics and logic.  Their lawyer could not argue with you in court, so they were smart enough to drop it.  Be careful, HOA people are unforgiving and have the power to cause serious problems.",
            "[Draw me like one of your French cars](https://iheartjapanesecars.files.wordpress.com/2016/03/1632b-img_0358.jpg)",
            "Have a VW Beetle meet. Leave all hoods open. Dare anyone on the HOA to explain how you were doing repairs.",
            "[deleted]",
            "You should have worked on your car in the street.",
            "This was pure joy to read. Good job, OP.",
            "Nothing on there about DESTTOYING  your car! , waits untill its time to recycle the car... *grabs golf club",
            "Great story!! I refuse to live where there’s an HOA.",
            "10/10 great job",
            "In our strata, we have a rule about working on cars in shared underground parking. It's not intended to prevent people from checking oil, refilling washer fluid, etc. It's intended to stop people from (for example) changing their brakes and banging out the brake dust all over the place. Or changing their oil and just letting it flow on the cement. Both of which they do anyway.\n\nBut I love your story. 😀",
            "Would love to hear the HOA shills try to justify this rule.",
            "I’m NOT in a HOA and if I wanted to move, the first thing I would do would be to find out if the prospective home was subject to HOA and reject it!",
            "Pics or it didn't happen ;)",
            "Might wanna post this is r/fuckhoa",
            "The fact that you wasted *film* on this nonsense is next-level pettiness.  That shit was expensive to process.  Kudos to friend's mom for forking out the dough.",
            "Dam didn’t submit your story in time to maybe be featured in John Oliver’s show. He did a piece on HOAs recently lol",
            "I'm sure there's some idiot lawyers behind it, but I fail to see how an HOA can tell you what you can and can not do ok the property you paid a LOT of money for.",
            "“Fight the power” this sounds like a fairytale written by someone that wished they did something at the time but just really did nothing at all.",
            "This is the most beautiful story I've ever read.  Thank you. You made my life better.",
            "I swear, I think HOA's are actually fucking evil. Lol\n\nI watched [this](https://youtu.be/qrizmAo17Os) episode that John Oliver did on them a few days ago, and holy shit! They're actually even more evil than I imagined.",
            "I m dead. You are so funny 😂",
            "I chuckled at that one, thank you for a Thursday smile. 😁",
            "Your friend’s mom is a true MC hero going along with your shenanigans.",
            "that is beautifully malicious.. .Sounds like me in high school.  I LOVE it.",
            "I’ve been on the board of my HOA, you would’ve just had to call the property manager and explain. We’d probably check if your hood was up, but honestly a looky loo watching you doing a painting of your engine and boudoir photos would’ve seen you’re just trolling and moved on.",
            "Last week tonight just did an HOA show. Some interesting stuff with it. I'd also record going to  https://www.lastsqueaktonight.com/",
            "Love my HOA. Had a neighbor that wanted to dig up his whole front yard and install basically a farm in the front yard. I love living in a neighborhood with rules. If you don’t like rules and you prefer to have your neighbor park a boat in their front yard or chickens or whatever they want…cool! I don’t want to live in that environment and I care about my property value, safety, etc.",
            "...But how do I truly know it was **your** car?",
            "Enjoyed the story but what’s a HOA?",
            "It's hilarious when people who own homes cry about the HOA. THEY are the HOA. It's not called home owners association for  shits and giggles. Also, you are required to be given a copy of all HOA rules before you buy the house so you knew exactly what you were getting into when you bought a house in an HOA.",
            "You wasted all your time doing this? So, the board doesn’t make the rules nor deal with compliance. The property manager does all that, and coordinates the compliance checks. The board was never going to assess a fine as long as you didn’t break the rules.\n\nSpeaking of rules. The rules are set by the homeowners, like, the mom. The community sets the rules. Not the board, and not the property manager.",
            "If you don't want to follow the rules of the HOA, then don't live in a community that has an HOA.",
            "The heck is a HOA?! Why do redditors just assume everyone knows every acronym that at times don't even officialy exist?",
            ">  that there were no repairs going on in any of the pictures since no tools were visibl\n\nYou don't need tools to do repairs. This whole post is dumb.",
            "What a waste of time and energy. Annoying the neighbors just to flaunt the rules is childish.",
            "What sort of dumb ass rule is that? You can't repair your car in your driveway? What are you supposed to do if your car needs repairs while on your driveway, have it towed somewhere else? So pointless.",
            "This MC is a thing of beauty. Well done!",
            "Man, it's wild to me how Americans can be all about freedom and then agree to have rules that say you can't work on your car in your own driveway."
        ]
    },
    {
        "post_id": "7b7tto",
        "author": "suz_gee",
        "title": "This is written from the perspective of a person being screwed over by someone else’s malicious compliance....& I’m loving it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7b7tto/this_is_written_from_the_perspective_of_a_person/",
        "score": 13253,
        "num_comments": 558,
        "created_utc": 1509999486.0,
        "selftext": "I work for a medium-size development company in a mid-size City. The company has about ten employees, and we collectively manage a little under 50 million dollars worth of residential and commercial real estate.  We are definitely understaffed. The person who owns the company has a temper and, as employees, a lot of what we do is to manage what information she knows about the company to keep her temper in check.\n\nOur longest term employee is our amazing head of facilities who has been with the company for about 8 years and he knows/does EVERYTHING and we are always SOL without him, because he is pretty amazing at his job. He can’t even really take a day off without receiving at least a few phone calls from staff, even on his sick days, we just need him that badly. And, being a great human, he is always there for us.\n\nWell, he made a pretty big mistake on Friday, because he is human, and it really isn’t that a huge deal in that it didn’t cost our company any money, we apologized, and everything is basically fine, however, the woman who owns our company accidentally saw an email about it on someone else’s computer and she lost her shit and he received a one-week suspension....as he has around weeks worth of built up PTO, and even the woman who does HR/payroll thinks the suspension is unjust, it will be paid.\n\nAnnnd we are completely falling apart without him. I finally broke down and texted him for help, and he said, “sorry! I’m suspended! Can’t help! Lol” \n\nThe woman who owns our company was even asking where he was earlier when she couldn’t find something. It’s already epic, and we’re only one day in. The employee in me is panicking, and the human in me is rubbing hands together in glee.\n\nTL;DR head of facilities is getting his first real vacation without getting bugged by us in 7 years, but only because he fucked up. We have really only punished ourselves. He’s learning the wrong lesson, and I adore him even more!\n\nEDIT:::: Update - \nSo I caught a cold and I’m pretty sick, but I know y’all are asking for updates... please forgive all cold-related typos...\nHe definitely caved pretty hard, and tried to come back to work, however, caring coworkers wouldn’t let him (the man really needed a vacation). I’m sorry to disappoint you reddit. FWIW, I’m also disappointed in him.\n\nTwo highlights of our struggles though—\nThe weather turned super cold, and our offices got super freezing. Everyone complained a bunch. I was proactive, found the thermostat, realized the AC was still on, and switched it to heat triumphantly. Everyone congratulated me, and then we stayed cold. In fact, we got colder. Next day, I realized I had turned another part of our building to heat, and not our offices. It was 64* in our office. Well, fuck. I figured it out, and our offices got warm...and warmer....and then hot. By Friday morning, it was almost 80*. We just ended up propping the fire escape door open as the heat ran all day Friday, and it was in the 40*s outside.  He really enjoyed that story when I told him about it this morning. We both laughed pretty hard.\n\nThe other thing—we needed a large heavy item removed from a parking garage, and the guy removing it asked if he could do it at 5:30pm on a weekday. I agreed bc why would I care when as long as it’s gone? ....Suspended coworker saw my email about this (on a distribution email list) and immediately texted me about rush hour and traffic patterns... I just didn’t think about how the road that this garage opens up on feeds an entire (primarily residential) neighborhood of our city...annnnd I told him I was going to ignore his same advice to bc he wasn’t supposed to be working annnnd it ended up being a total shitshow, creating massive traffic  backups and couldn’t be completed as scheduled. It was a triumphant failure.",
        "permalink": "/r/MaliciousCompliance/comments/7b7tto/this_is_written_from_the_perspective_of_a_person/",
        "comments": [
            "you definitely need to keep us updated on how this week plays out\n\n",
            "As funny as this situation is, you should treat it as a serious wake-up call. You guys need better documentation, cross-training, or something.  Someday, he may have a medical emergency, or he will choose to move on to another job, and then you will _really_ be screwed.",
            "The dependency on one employee is indicative of lots of other issues - but I️ love his attitude about it.",
            "I'm a little unsure of what suspending an employee after a mistake is supposed to accomplish in the first place. Is that a normal thing?",
            "Sounds like you have a bus count of 1. That's the number of people who can get hit by a buss before your company falls apart. \n",
            "I hope he'll be asking for a raise before coming back.",
            "Not sure what jurisdiction you are in, but in some places, if a salaried employee is required to answer questions on a paid day off (PTO/sick leave) they must be paid for that day. ",
            "This is awesome, we would love to hear all the juicy updates.",
            "You should keep him updated. It is only human to feel upset when you are unreasonably dealt with.\n",
            "One day in? We need updates!\n\nAlso, I agree with the employee in you. If he really is the only one who can do shit, what happens whe he gets sick? Or if he suddenly dies in a car crash? A second (and preferably more) person needs to be trained to do what he does, this is a single point of failure and the point is a fucking human. The company you work for needs to get its shit together.",
            "this reminds me of how when i quit my job overnight, just about everything at my former job turned into chaos. i was heavily relied upon for numerous things at that job, but i was still underpaid. AFAIK, things still haven't improved since i left nearly 9 months ago. ",
            "I really want daily updates on this.",
            "[deleted]",
            "Sounds like this guy needs to negotiate a raise immediately when he gets back.",
            "Wherever you live, you have a weird employment environment (I mean the environment where people can employ/be employed, not your specific job.)\n\nLike how do you work seven years but only accrue around a weeks PTO? I earn a week's PTO every 3 months of full-time work.",
            "> Head of facilities\n\nUsed to manage a warehouse. No one knows how much work, coordination, planning and logistics are involved in making things happen every day. It’s indespensible and invisible work. Hopefully this guy finds himself in a profession that values his contribution. ",
            "OP PLEASE update this post daily of on the happenings of you story, I'm actually excited... ",
            "Please tell me how the owner reacted when she found out that the one employee who she was looking for/knows how to and does do everything is suspended by her order for a week.",
            "[deleted]",
            "Good on him for refusing to help during his suspension. That had to take some willpower.",
            "Holy shit, 7 years without a fucking holiday.",
            "OP, I know how this ends: the head of facilities applies for a better paying job, gets offered the role, hands in their ~~naive~~ *notice* to the manager and ends up renegotiating for a much, much higher salary.\n\nThis mistake will eventually end up costing the manager far more than they realize, far more than even you realize.\n\n^^^edit ^^^for ^^^typo",
            "Except for the boss being a lady, you just described my last job to a T.",
            "Please update us daily on the freakouts, OP.  Also, maybe drop a line to the guy and tell him to save every email and text of people crying to him for help in case he needs it to ask for a raise... or use it in an interview with another company that's willing to pay him his worth and give him the time off  he deserves.  ",
            "If there's one thing I learned in IT it's that your counterpart is just as vital as you and is a perfect excuse to relax when you have Nazi upper management. They are so blinded that they don't see \"so and so's out so we are basically paralyzed.\" Not worrying about the service desk mailbox was one of the best things I ever did. \"There are still unread emails from last Thursday...\" Never fails.",
            "Yesssss. Lean into it employee.",
            "I've been Redditor for 1 year and have never followed a thread.  I am following this thread.....or should I say I will be following this thread once I find out how the hell you do that.\n\n\nSeriously people, how do you follow a thread?",
            "OMG this such a feel good story. I can't wait for the next episode. Idk why I find such Joy when the bad guy screws themselves without really realizing it.  But you know, say nothing, but know how it happened. It's great! ",
            "If it's a 10 person company, and one person's absence is that problematic, then some serious management changes are way overdue.",
            "This is beautiful!",
            "If I were him o would return after my week off and demand a raise and a promotion",
            "You need to look for another job. If something happens to him, if he chooses to leave, you may not have a job to go to.",
            "hopefully he comes back... or maybe hopefully he wakes the fuck up and finds a new job where people respect his personal time",
            "hows it going so far",
            "okay op - I waited a week\n\nhows it been goin since",
            "Update please op ",
            "I love the term \"triumphant failure.\"",
            "This post has been saved.  I expect an update tomorrow/when something big happens.",
            "[deleted]",
            "I really want to know what he did to fck up that in the owners eyes they saw fit to punish with an entire week suspension. That seems a little over the top and back down the other side. ",
            "Find an investor and recreate the business without your psycho boss. Take all the contacts with you and start doing things the right way. ",
            "!Remind Me 3 Days",
            "That put a smile on my face ",
            "I wonder what it will be like when he reaches day 3.",
            "RemindMe! 1 week",
            "I fucking love this.  Pardon the French.",
            "Been a week dude, any update?",
            "I can't wait for updates.",
            "Please keep us all updated :)",
            "Please update us as the week goes on!",
            "This is beyond perfect. OK, as others have requested I too am hoping for daily updates.",
            "Please let me know when there is an update ",
            "remindme! 1 week",
            "!remindme 7 days",
            "Gonna need updates on this",
            "Gonna keep tabs on this one",
            "Remind Me! 7 days",
            "You should encourage him to start his own business doing the same kind of work. It sounds like he has enough experience and would be successful.",
            "!Remindme 1 week\n",
            "Please document this nuclear meltdown. ",
            "Time for a new job.  ",
            "Remind me! 1 week",
            "remindme! 2 days",
            "As someone who likes this sub, this is my favorite post I have ever read here. Good luck, haha.",
            "Aces.",
            ">rubbing hands together in glee\n\n\n[I just couldn't help myself seeing this while reading that last part.](https://roboto13731.files.wordpress.com/2016/10/fly-leg-rubbing.gif?w=474) \n\n\n[Or this.](https://media.giphy.com/media/MO9ARnIhzxnxu/giphy.gif)",
            "Remindme! One week",
            "What a hero. Good work ethic AND maliciously compliant! :D",
            "RemindMe! 2 days \"any updates?\"",
            "RemindMe! 2 days",
            "Puh lease update ",
            "Plz op update! ",
            "RemindMe! 6 days, 5 hours, 4 minutes, three seconds",
            "I wish you can record your office all day and turn it into a real sitcom",
            "!RemindMe 1 week",
            "You guys need to get more independent.  If you're relying on this person that much, you're not doing your job properly.  You need to take risks and learn from mistakes. Unless you've worked there for a couple months or less, it's pretty pathetic. ",
            "This is arguably the best post of all time on this sub. Amazing. Please, please keep us updated.",
            "He wont be coming back easy... and he will never be the same.",
            "Posting to remember this beautiful post, and follow up when reading through my history I'm sure.",
            "I am confused why anybody would be happy about some poor guy not ever being able to take a holiday.",
            "Remind me! One week",
            "Remind me! 1 Day",
            "I would love daily updates on this as well!",
            "Keep us updated OP!",
            "10 people handling 50 million worth of real estate? Is that normal?",
            "RemindMe! 1 week",
            "RemindMe! 4 Days",
            "More updates!"
        ]
    },
    {
        "post_id": "1clfjpr",
        "author": "Defiant-Lion8183",
        "title": "Delete it? You sure? OK!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1clfjpr/delete_it_you_sure_ok/",
        "score": 13237,
        "num_comments": 413,
        "created_utc": 1714990606.0,
        "selftext": "So I am a fiend for excel spreadsheets. Absolutely love them and even bought an extra extra wide monitor for home so I can see them in all their glory. My Boss keeps telling me that she's an \"advanced excel user\", she can run macros, she can do pivot tables, she knows formulas. Not once have I seen her create or manipulate a spreadsheet in the 6 months I've worked for her. \n\nSo I had a Template on our Teams chat that we used every week, it was automated to within an inch of its life to tell us about the companies health. We've been using it for the last 4 months after I was given approval by the boss to make it live, gave her a tutorial and everything. This was for the admins to all see it and I'd only need to update the raw data once a week instead of send it manually to who ever wanted it on a given day (Up to 4 times a day usually). \n\nTook out about 6 hrs work a week having it set up like that. Well the boss told me to take it down because a different department who hadnt seen it, was worried about personal data when one of the admins told them about it. There isnt anything like that in there, and anything that isnt open access is password hidden anyway. Our IT team has to be formally requested to add a new member to our teams chat, the spreadsheet is password protected, the tabs are password protected and the whole company is locked down hard anyway.\n\nSo boss orders me to take it down and delete it \"Run a fresh one for anyone who wants it\".  \nSo I explained there wasn't anything in it that was \"personal or private data\", but got told nope delete it.  \nTried to explain we use it amongst the admins every day and it has all these built in features/tables etc.   \nNope delete it.\n\nSo I did. The fall out? Read on\n\nCue today Boss says to me her big boss meeting is presenting figures to the executives tomorrow. She starts quoting figures that are wildly out from the true numbers, I questioned where they came from and she shows me a Frankenstein report that is saying the exact opposite of what she thought. Run by someone not even in our department... I tell her the accurate grand total and show her how I got there with a simple table and some screenshots I had of the original shared spreadsheet. She asks for access and I tell her its been deleted.\n\nI explained why and even showed the meeting notes where she had approved its use after viewing it.  \nShe denies any knowledge of it, but wants it back. I said It would take me 2-3 days to make it again due to my workload increases. \n\nI saved a copy of the template, but no way am I telling her that. This will give me breathing room to get the backlog out of my queue while she thinks I'm working on it. Let her sweat through that Executive meeting knowing every figure is wrong, no ones saving her ass in this team anymore.",
        "permalink": "/r/MaliciousCompliance/comments/1clfjpr/delete_it_you_sure_ok/",
        "comments": [
            "Was once in a similar position where my boss was telling me to get rid of something I knew we needed for a reason that didn't make sense. After a bit of back and forth I simply said \"No, I will not be the one to get rid of this resource\" and that firm \"no\" from *me*, the dude who normally does whatever he's told to do, made them back up and think for a second about the issue and actually listen to what I was saying",
            "Arrogance and incompetence often travel in the same sinking boat.",
            "Knee-jerk reaction management style, got to love it.",
            "I'm currently a GM in a small non-profit. My director is a former CFO and also claims to be an excel expert.\n\nShe still prints out and checks my spreadsheets with an adding machine. A fucking adding machine.",
            ">the boss told me to take it down because a different department who hadnt seen it, was worried about personal data when one of the admins told them about it. There isnt anything like that in there, and anything that isnt open access is password hidden anyway. \n\nLuckily we have a team in our organisation dedicated to information management - if this happened to me I'd state that I'd get it officially checked to see if it could continue to be used.\n\nSo much easier when you can outsource verification - why do you think consultants play such a big role in providing \"advice\"? ;)",
            "To quote Londo Mollari \"Ah, arrogance and stupidity in the same package, how...... efficient of you\"",
            "                 The Three Maxims of Manglement\n\n* Remember, you are not dealing with the Mensa crowd.\n\nGenerally speaking, they aren’t nearly as smart as they believe themselves to be.\n\n* They run this place using foreskin instead of forethought.\n\nOften, they will make reactionary decisions to problems they knew existed beforehand, but chose to do nothing about until it becomes too big to ignore. aka; shit hit the fan.\n\n* They suffer from sphincter vision.\n\nTheir field of vision is so narrow, they will see either the only thing that is on fire, or the only thing that isn't.",
            "Did you include time to identify, address, test, validate, and certify issues around \"personal or private data?\"\n\nSeems like that might take another week and coordination with an entire suite of \"stakeholders.\"",
            "Good on you. I never deleted my excel sheets",
            "Whenever a boss asks for something to be deleted, or any change that you know is going to cause havoc, get it in writing/email.",
            "As someone who also loves Excel, couldn't understand why there wasn't a backup until I got to the last paragraph.  Had a new manager like that just before I left and it was hard seeing her not understand what the reports I prepared had value.  She was fired shortly after I left due to her \"my way only\" attitude.",
            "Always remember the ever popular phrase; \"Can I get that in writing?\"\n\nTo those in the know, an immediate red flag that something stupid is about to occur...",
            "[deleted]",
            "Exactly the opposite happened where I worked. One of the admins (the “Excel expert”) decided all training had to be scheduled, recorded and certified in an Excel spreadsheet they created. \n\nRather than automate some functions, whenever someone made a change, they were required to save a copy of the spreadsheet under a new name which consisted of date_timestamp_initials.xls. If we did a group training, there would be 22 new copies created that day. \n\nNo one was allowed to delete old copies, so the folder containing the spreadsheet(s) contained hundreds, if not thousands of copies.\n\nWhen a better version was created, which automated everything and added some desperately needed features, it was rejected because the “Excel expert” didn’t trust Excel to properly calculate formulas. They had to verify every calculation with a hand calculator (formulas were already tested and approved).",
            "I will not recreate work. You said delete it, even after I explained it's true value to you and the co. You wanted it gone, it gone for good. I wiped from my memory too.",
            "I would take six months to fix a deleted table that everyone used",
            "Always ask for asinine things in writing.\n\n> Sure, I'll delete it. Sign this document which reads \"I'm demanding that OP delete this document. I'm fully aware of how critical it is to the smooth operation of the team, I am cognizant that it saves tens of hours of busy work per week, and am demanding its removal anyways.\"\n\nThey usually realize their mistake by then. If not, you have a document they signed proving they're fucking stupid.",
            "Take two weeks to come up with a fresh one. It was JUST that important. Really amp up the scale of her incompetence. 🤌🤌🤌",
            "Wow, found myself in a similar position. I too love Excel. Put to together a spreadsheet that I simply added weekly numbers to. It would update the sales on each tab as they were linked. \n\nNew Director was hired. She didn't like it. Told me to delete it. Of course I saved. Said that she would be managing the numbers going forward. Ok then.\n\nShe has a meeting with the SVP and can't explain her numbers on her spreadsheet. Get called into the meeting to explain the numbers on her spreadsheet. I couldn't. SVP asked her what happened to the other spreadsheet. I just turned, looked at her. \n\nShe asked for my spreadsheet. Told her I deleted as she directed. Like you, told her it would take time to recreate the spreadsheet. Said 2 weeks at a minimum. Took me less than an hour to upload the updated numbers. Got so much satisfaction of seeing her sweat. She quit 2 days later!",
            "There's a running joke that Excel consists of nothing but dark magic.  And it's true.  If you know the right formulas, macros, and functions, that spreadsheet could predict 100 years' worth of future.\n\n\nMe, personally, I would have moved the spreadsheet with the raw data to either the internal hard drive (if you had it saved to a cloud or network drive) or to an external, removable hard drive, depending on the size.",
            "Reminds me of this from Star Trek TNG:\n\n> Lt. Commander Geordi La Forge : Look, Mr. Scott, I'd love to explain everything to you, but the Captain wants this spectrographic analysis done by 1300 hours.\n\n>[La Forge goes back to work; Scotty follows slowly] \n\n>Scotty : Do you mind a little advice? Starfleet captains are like children. They want everything right now and they want it their way. But the secret is to give them only what they need, not what they want.\n\n>Lt. Commander Geordi La Forge : Yeah, well, I told the Captain I'd have this analysis done in an hour.\n\n>Scotty : How long will it really take?\n\n\n>Lt. Commander Geordi La Forge : An hour!\n\n>Scotty : Oh, you didn't tell him how long it would *really* take, did ya?\n\n>Lt. Commander Geordi La Forge : Well, of course I did.\n\n>Scotty : Oh, laddie. You've got a lot to learn if you want people to think of you as a miracle worker.",
            "Hate to break it to you u/Defiant-Lion8183 but you can open an excel sheet as a zip file and edit the XML\\*\\* to remove password protections. Anyone that has the password for the file itself can access any data within that file.\n\nRegards,  \nIT",
            "Well done!!",
            "It sounds like she has risen to her level of incompetence",
            ">She asks for access and I tell her its been deleted.\n\n\n\n>I explained why and even showed the meeting notes \n\n\ndafuq? she has forgotten that she made deletr you the file?!",
            "Wanna run with my crew huh?    \nRule cyberspace and crunch numbers like I do?    \nThey call me king of the spreadsheets    \nGot 'em all printed out on my bedsheets.\n\nWeird Al - All About the Pentiums\n\nhttps://youtu.be/qpMvS1Q1sos",
            "When people above don't listen to those who know their stuff..",
            ">I saved a copy of the template, but no way am I telling her that.\n\nLook on, everyone! Wisdom from the Montgomery Scott University of Miracle Workers!",
            "I love Excel, too! Even got a \"Freak in the sheets\" coffee mug!",
            "It's funny, they never seem to be able to remember their mistakes. And the chat logs curiously never ring any bells. Unless it's about good things they did. Funny how that works.",
            "Why is it basically always the boss/manager/person in charge that thinks they know better and feel they're more important and knowledgeable than the workers. When 90% of the time they have little idea what's actually going on or how to do things. It makes you wonder how they got into those positions in the first place.",
            "**Ambassador Londo Mollari:**  \nAh, arrogance and stupidity all in the same package. How efficient of you!",
            ">Let her sweat through that Executive meeting knowing every figure is wrong\n\nNo-one in that meeting will care, least of all her.",
            "There was a study done on intelligence in correlation position in corporations focusing on management.\n\nIDR where I found it. It was quite a few years that I read through it.\n\nOne of the major findings in the study’s results however showed that 8 times out of 10 management was often stupid on average when compared to lower ranking employees they were managing.\n\nEspecially if said workers had specialized skill or job specific to themselves in corporation they worked in.\n\nThese findings also showed that managers who had higher tendencies of micromanagement worsened many aspects of job performance and upward trajectory of the company outlooks all around.",
            "Make sure no one can replicate it easily. \nTake it with you when you quit working there.",
            "Yeah, sharing that “sensitive” document via email is so much securererer",
            "Another example of incompetence crazily rising to the top.\n\nOnce had a COO that came from accounting who didn't know squat about tech *making decisions on what direction our new tech developments should take in the next five years*.  Needless to say, that company went under.",
            "I'm a bit surprised you didn't just keep silent. Letting her quote the completely wrong figures and draw the wrong conclusions would have really bit hard. You must like her in some respects, lol.",
            "You made a mistake with the final times.  You wrote 2-3 days instead of 2-3 weeks. \n\n\n\nNow all eyes are on it they will want this function and that colour etc",
            "Your boss's lack of Excel comprehension and competency has no bearing on her accurate concerns about security.",
            "What?  No, you bill for overtime to redo it all",
            "miscommunication seems to have added unneeded stress. sounds a bit like those old telephone games where the message gets all mixed up by the end. hope everything clears up soon with minimal hassle.",
            "> \"advanced excel user\", she can run macros, she can do pivot tables, she knows formulas.\n\nThis is my level of expertise with excel. I would in no way consider myself an advanced excel user. \n\nAs a side note last  i heard it was pretty easy to break through the password protection on excel sheets.",
            "I've never understood the \"we can't use it right now, so delete it\" mentality.  Like, there are situations where the data contained is so sensitive that it cannot be safely stored long-term.  I get that.  But in almost all cases, you might as well just toss the report or the excel sheet or template or script or whatever into an encrypted \"long-term storage\" archive rather than deleting it.  99 times out of 100 you'll never need it again, but that 1 time, it'll totally be worth spending a few minutes looking through that archival folder to find the thing, versus having to recreate it from scratch (if you even can).  And if you have a decent encryption key, there's essentially no risk of moderately sensitive data getting out even if there's a security breach of some sort.  \n\nStorage is cheap.  Never delete anything*.\n\n*Unless it's required by Data Management policies at your institution.",
            "Oh, yes. I rename everything we no longer use so the file name starts with 'old-' and drag it to Archive. And thank goodness for file restore.\n\nI went to update a report last week and all my references (automatic calcs in cells) were overwritten with numbers (the recipient has since been told to leave those cells alone), and I had to start all over - except that I was able to grab a back-up file.\n\nAnd you can still use macros? In my company, I would have to ask for developer access (and they will say no because I don't work in the IT dept) because macro ability was taken away almost two years ago. I mean, really, how did they think I was so efficient? /rant",
            "I too love spreadsheets and I too love malicious compliance when people question the way my spreadsheet works...",
            "Bro that’s gonna take me an extra 20k/yr. You want it?",
            "Haha. As an excel super user like you, I knew damn well you kept a copy. Of course you did!",
            "Drag this out longer. 3 days isn't enough for her to sweat it. \n\nAlso, why not just let her fail in the meeting? I'm not sure I would have said their numbers are off",
            "Your mistake is thinking it matters. \n\nManagement do not care about accurate figures, in fact they want inaccurate figures, because then each can massage them to mean whatever they want and deflect discrepancies as “different ways of doing things”. Meanwhile they do not want conflict with any other managers who are doing the same. It’s the manager code.",
            "Nice work!",
            "I wanna see that glorious template s2",
            "This is pure gold. Bravo!",
            "I love it!!!!! She fucked herself bc she couldn't really take the time to listen & understand there was no personal data in your excel.",
            "Where do I take your excel class? Have you mastered Power Automate yet? What do you think of CoPilot and Excel?",
            "Wait sorry so the extra time you won over ... Is going back to doing work, just other parts of it? You gotta get a raise or something, this story is still you getting hosed!",
            "Nice one. Where did you learn VBA? Im looking to get started with it",
            "Oh I woulda said it'll take 2-3 *weeks* to rebuild. People don't know what you do, they have no idea how long it takes!",
            "There's this thing called backups...\n\nAlso, get a SQL database built and learn power BI.",
            "mate, i feel ya on the excel obsession - i'm a total spreadsheet fiend myself and have definitely pulled some all-nighters perfecting those bad boys. it's a real bummer your boss isn't giving you credit for all your hard work automating that reporting process, but try not to let it get you down - keep pluggin' away and eventually they'll have to recognize your skills. in the meantime, maybe you can subtly show off what you can do by offering to whip up a quick dashboard for your exec meeting tomorrow - that'll really make your boss look good and they might just come around. chin up, you got this!",
            "I appreciate the malicious compliance but if there is any sensitive data on that Excel, the security concern is not wrong. Unless there has been a change, some Excel protected passwords can be removed by converting the document to a zip and searching through the XML file and then deleting the password through there.",
            "I love when they kick themselves in the ass!!",
            "Took me damn near 3 hours to figure out how to apply the same formula to an entire row, I forgot, and it's gonna take me 2-3 hours to figure it out again🤦",
            "You HAVE to update us when the shit hits the fan.",
            "Updateme!",
            "Tell her to do it herself since she’s such a pro.",
            "Cc her boss when you send her it",
            "make some small tweaks so it doesn't look exactly the same",
            "the peter principle in practice.  people rise to their level of incompetence",
            "Not an expert but I ran a business for 8 years on Google sheets. Mainly just scheduling and P&L.",
            "this sub is my baby",
            "Should have bought yourself at least a week.\n\"That sheet was so complicated bla bla bla\".",
            "when I clicked this story out of my mobile notifications, I half expected it to have been deleted/removed before I could see it- I'm glad that it hasn't been, but that would have been funny",
            "I’m confused.  Boss approves use.  Boss decides it’s no good and orders it deleted.  So far, so good.\n\nBut this: \n\n“She asks for access and I tell her it’s been deleted.\n\nI explained why and even showed the meeting notes where she had approved its use after viewing it.\nShe denies any knowledge of it, but wants it back.”\n\nAre we talking about different bosses here?",
            "If OP really wanna make the boss sweat, should have said 2-3 day if just focusing on the spreadsheet, 4-6 with all other work tasks. Then only deliver the final product 5 min before cob on day 6.",
            "Dunning-Kruger effect meets Karma. 👍",
            "You're a hero my dude!",
            "this brings back so many memories. so glad I'm retired. lol",
            "THAT was delicious. Thank you.",
            "Virtually clapping for you👏",
            "[deleted]",
            "As a privacy professional, one thing I can promise you is how often even capable people underestimate what is personal data and what isn't.\n\nStill should have such eyes on it before deleting. Damage already done if uploaded. More damage done if deleted unnecessarily.",
            "Sad thing is, she’ll blame OP for her incompetence and make their lives hell.",
            "Okay, not to validate the boss here, but if they had even a hint that personal data COULD have been in that, it's literally worth it to lock it down and eat the additional costs.  But the right move would have been to have the spreadsheet vetted by legal/info security and then continue using it.\n\nCan't argue with the boss tho - gotta follow directions!  No complaints.",
            "Updateme!",
            "I need an update. 😂❤",
            "updateme!",
            "There is this magic tool called ERP. ",
            "Yassssssssss",
            "You know teams has a deleted items folder right?",
            "This is mild, truly malicious would have saying it won't be able to do it again hahahahaha",
            "Tbh this doesn't mean anything if you just end up using it again.",
            "Can you please teach me your ways.",
            "Improper use of the peter principle at its finest.",
            "You have just demonstrated the Peter Principle with your boss as the example!",
            "I'm sorry your manager made you do that. Could you give me a tutorial on how I could implement that kind of automation?",
            "Nnn.",
            "Hahaha this is the way.",
            "Updateme",
            "I'm so sick of being told how to do my jov by people who gave no idea how to do my job",
            "Hopefully that mangler learned a lesson. But probably not. Most don’t.",
            "There are better tools for stuff like this. This smells like an accountant.",
            "Your boss is correct.",
            "Do you have to be so white in public?"
        ]
    },
    {
        "post_id": "lf7d7b",
        "author": "GetAgrippaThis",
        "title": "Get me in trouble for being 5 minutes late, but not for showing up? Fine",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lf7d7b/get_me_in_trouble_for_being_5_minutes_late_but/",
        "score": 13226,
        "num_comments": 502,
        "created_utc": 1612772289.0,
        "selftext": "I used to work at a food service place in Canada, think coffee; my location had this rule that you would absolutely get written up if you were late over two minutes, but you would NOT get in any form of trouble if you called out. This is especially important because I lived an hour each way from where I worked, and the roads could be treacherous in the winter. One occasion, it was especially bad, and I was exactly 5 minutes late. I didn’t even get to clock in before I was in the office getting reamed out for my terrible insubordination. I confirmed the policy, and refused to sign the write up.\n\nAbout two months later, the same situation comes back around. I arrive in the parking lot, and I look around to see the absolute demonic blizzard taking place, the clock showed me I had 2 minutes until shift started. Since they wanted to play that game, I called from the parking lot to tell them I wouldn’t be in, the roads were just too bad. I didn’t get in an amoeba of trouble for it. Soon, everyone learned the same thing as I did, and call outs were frequent. Nobody in management has ever figured out why...",
        "permalink": "/r/MaliciousCompliance/comments/lf7d7b/get_me_in_trouble_for_being_5_minutes_late_but/",
        "comments": [
            "It was, I believe, Germany where they changed the rules so that station masters (i.e. the people who run train stations) were rewarded based on average train punctuality. I.e. if most trains leave on time, they get more money.\n\nSo a delayed train will cost them money. But a cancelled train does not count as delayed.\n\nI think you can see where this is going.",
            "[deleted]",
            "My high school had a similar attendance policy. If you were late to class, you’d get detention, but if you skipped it completely, there was no noticeable consequences.",
            "I had a discussion one time with the principal of my kids' jr high school - American, kids around 12 to 14 year olds. He complained that the kids didn't respect what the school could teach them. I pointed out that they had learned THAT from the school itself. He was confused, so I pointed out that the policy at that time was that any student who was late to school, even 1 minute late, received an 8 hour in-school suspension. No classes, no doing homework in suspension, no making up missed work from that day, even tests that counted for a large part of your grade. So the ONLY important thing that mattered to the school was the kids butt cheeks and what time they hit the seat. These are kids who can't drive, rural school with kids who live miles away, and who are still dependent on their parents for transportation. I told him that if I even thought we might run late on any given day I just called them in sick, cause all work could be made up with no penalty and my kids don't have to sit around bored, hurting their grades and realizing that there was NOTHING the school could teach them in 8 hours that mattered more than their butt. School policy changed, the special ed teachers thanked me and gave me a gift at the end if the school year.",
            "In the alternative high school where I worked, students who were late had to go through an immediate guidance intervention, which included signed contracts and conferences with parents.  But if they just skipped school entirely, standard weaker attendance follow-up ensued.  \n\nGuess what happened to our attendance statistics?",
            "When you show up on time in shitty weather, nobody says a thing. \n\nShow up a couple minutes late once a quarter and people act like you pissed in their Cheerios. \n\nStay late and get no recognition. \n\nWant to leave early once a year and it's like you're asking for the moon. \n\nThe same people wonder why their employees don't give a shit by their metric.",
            "I mean, I admire your commitment, but why bother with the drive at all if you weren't going to bother going in?",
            "A similar policy as this was in place at a company I used to work for. When I was made a Supervisor I argued it and nothing was changed. Then about a year I to the position, the Ops Manager had a family issue and took 6 weeks leave, appointing me as the Acting Manager.\n\nMy first play was to institute the following:\n\n1. All attendance will be checked at the end of each payroll period (every 2 weeks) and instances of late over 15 minutes or absences will be checked against \"call out notes\". If notes indicate a call was received at least 10 minutes prior to shift for late or 1 hour prior for call out, any penalty points on performance will be reduced to 1 point for late and waived for call out assuming sick time is available for the employee. \n\n2. Should no call be received in the allotted time then it will be 1 point for late over 15 minutes or 5 points for a \"No Call/No Show\". More than 10 points in a rolling 6 point time frame could be grounds for termination. \n\n3. Should no other violations occur, late points will fall off after 90 days, No Call/No Show remain for 6 months.\n\n  The new policy took affect immediately and our call out rate dropped by nearly half. Within 4 weeks our attendance was the best of the bases in our region. Ops Manager comes back and sees the metrics and KPI's on employee performance and is impressed. I show him the new rules and he argues for a bit to which I reply solely by pointing to the metrics again. He acquiesced and the policy stayed. Of course he also took the credit and pay bonus for it.\n\nDon't miss that job.",
            " \n\nI  used to work in a callcenter where you'd get written up if you're even a  second too late. One day I was cycling there and there was terrible  wind, so I went back home and told them I was sick.\n\nI got fired for being sick three times in a year. One of those times was a certain ailment we are not allowed to talk about on this sub aparently (???)  \nPeople rarely work there longer than a year. Our union is now  investigating the finance sector for these kind of things.",
            "here's a good one - my employer gives me more grief for trying to book a single vacation day 2 weeks in advance to give them notice, etc., but if I just call in sick, they just say \"ok feel better\" and leave it.\n\nguess what I'm not gonna bother doing anymore.",
            "Is \"an amoeba of trouble\" Canadian slang I don't know about?",
            "My brother's employer is on a points system (idiotic, IMO) and they function in a kinda similar way. If you're more than 5 minutes late, you get a half point. But if you miss up to half the shift, you also get a half point. So if it looks like he's going to be even a couple minutes late and may clock in right at 3:05, he just doesn't go in until 7. They hate it when people do that but it's like, you're disciplining him for the equivalent of half a shift's tardiness for only being 5 minutes late, why wouldn't he take the whole time?\n\nIf someone was yelling at me for eating their whole cake but I had only eaten one piece, you bet your ass I'd go back and eat the whole thing.",
            "This is where over micro-management actually costs a company. Instead of getting an employee in trouble, simply keep a “tardy log”. If an employee is habitually late, then maybe deal with them individually with evidence showing late 3 times per week or whatever.",
            "I also used to work for a certain Canadian coffee place. I once watched someone get written up for having the heel of their foot out of their shoe while leaning out the drive thru window. To this day it was the worst job I’ve ever had. Used to get anxiety starting 48 hours before every shift wondering what kinda crazy thing I was gonna get yelled at for that day.",
            "My high school did this in my last year. I remember once walking in and hearing the final bell that meant you were late, so I turned around and left lol.",
            "my high school had a similar \"better never than late\" policy. show up late to class, get detention. but skip the entire class? who cares.\n\n\"why do so many people skip classes?\" they wondered.",
            "Lol I had similar issues, most days I was at my desk 30mins early, every day stayed 40mins late to coincide with transport. Major roadworks on my route for changing infrastructure meant I was occasionally 4 minutes late. It was brought up in my performance review as \"being noticed\" by senior management. I mentioned the above and manager said it didn't matter to the \"higher ups\". I said no problem, from now on id work my contracted hours.cue malicious compliance:\n- From then on I was at my desk but did not turn on my pc until the appointed time, I made sure I was noticed reading the paper with a blank monitor. I logged off bang on time and got different transport home. \n-The sweetest kick was on the first of the month when a daily task the whole team did increased 1000% but still had to processed by the same cut off time. Most of the team would come in half an hour/hour early but I would have actioned 50% of the load. I sauntered in five minutes before my contracted time, team was in a frenzy, even my manager was processing. Got met with \"where were u, we are going to miss cut off\" from my manager. I said \"Im just doing what u told me to, I guess senior management are going to notice the team won't meet the cut off just like they didn't notice I came in an hour early to do it and I was responsible for completing 50% of the work for the whole team\". Jaw dropped. However I'm not an ahole and didn't want the team affected, I logged in, busted a gut and we got it done, this time I only accounted for 33% of the work for the team because everyone else had to pull their fingers out and work 😂.",
            "Yup.  Had a job that implemented that...  If you were more than 15 minutes late, it was treated the same as not showing up for work, period....\n\nSo if the employee didn't need the money, they just didn't show up.\n\nCue Management's Shocked Pikachu.",
            "Better never than late",
            "Similar rule applied to me in high school. It was just better to miss first period completely and come at the beginning of second period than to arrive tardy.",
            "Had something like this in high school. If you were between 1 to 60 minutes late you were \"tardy\" and 3 write-ups got you detention. Once an hour past you \"checked in\" and no write up. So it became so if you were gonna be late just grab some breakfast and chill for a bit and be really late.",
            "I worked in a call center that adopted this policy as a way to cut back on tardiness. It was quickly changed after a few of us started calling in to say we'd be late, the manager would remind us of the policy, then we'd clarify that they still wanted us to come to work but it would still be an absence followed by us saying \"Well, I'm just going to go home, then. See ya tomorrow!\" Haha.",
            "*TIMMAY!*",
            "My job makes you call at least a half-hour before your scheduled start time, or you get written up (and a point). If you are late even by a minute, you get a point. You call in, you get a point. \n\n6 points = you get fired. \n\nI get it, but damn.\n\nEdit: 3 write ups, 1 week suspension - no pay. Write ups fall off every year, you get 4 in one year = fired.",
            "My chemistry teacher did this. Late? You get an 'unsatisfactory' write up. So I stopped going.",
            "I used to work at a cosmetics company (think bath bombs) and they had a similar policy. If you weren't clocked in and on the floor by your shift's start time, you'd get pulled away into a one-on-one with a supervisor to discuss how being late means the rest of your coworkers have to pick up your slack - never mind that the meeting took you away from the floor for longer than you were late in the first place. \n\nOne time I had a supervisor pull me in and ask me why I was late. I told her I'd injured my knee on my way home last night, and hadn't realised how bad it was until I was already on my way to the train station that morning, by which point it was obviously too late for me to leave early to allow extra time for my hobbling. She hemmed and hawed and finally had to admit that it wasn't technically my fault I was late. Didn't actually ask me whether I was okay. \n\nIt got to the point where if I woke up late and realised I wasn't going to be able to get to work on time, I'd just call in sick. Managed to get away with it for several months, too.",
            "Medium double double",
            "At my current job, we work on a tally system, and after three tallies you move to the next stage, you get a tally if you call off (no limit on when to call off, by the way) and you also get one if your late.\n\nI remember that one day, I was spending the night at my mom's, and she said she would wake me up before my shift, and with time to get ready. Sadly she had forgot and I woke up 2 minutes before my shift. Either way I was gonna get a tally, so I just called off",
            "We had a simmilar policy at my old job, but the time clock rounded the time to the nearest 5, so 8:01 was 8:05. Once I got to the clock after waiting in line to punch in and the minute ticked. 8:01, I sighed and left, we drove carts for that job and one of my coworkers gave me a ride when I was most of the way out. (Did I mention it was a 15min walk from the parking lot to our punch in clock? [And we passed like 6 other clocks on our way that we couldent use])",
            "This reminds me of a rule my high school had. If you were more than 10 minutes late for class, you were absent. Okay cool, I'll sleep longer and get there for next period.",
            "We had similar circumstances in high school. You'd get in more trouble for being late to one class than for missing an entire day.\n\nWhenever one of the crew was running late, we would wait in the parking lot until the last minute to see if they were going to be on time. If they were late, we'd just go to Disney World for the day.",
            "My place of employment for a time had a policy of 3 lates=level a warning 3 more B, 3 more C, 1 more termination.  Same for calling in and missing whole day.  \n\nI got to a B in lates.  So if I wasn't going to make it in, I'd pull into a gas station 5 minutes away and call in sick.  Some of the days they were severly short handed.  They'd ask me \"how sick are you\" and I'd say \"I'm sick enough to cause a delay in my mourning routine but I'd likely be 95%  effective at work\"...can you please come in anyway? \"Well I can't make it on time\" ...no prob just come in ASAP.\n\nI later told them they needed to go to points.  1 point for less than 5 minutes late, 2 points for 6 to 30 min. 3 points for 31 min to 2 hours. 4 points total absence.\n\nPunish people at 8, 12, and 16 with 17 being termination",
            "[removed]",
            "Ever wonder why you can spend 30 minutes waiting on the phone for someone from a company to answer, then you call back and they answer right away? It is an unethical practice for some call centres that once a call has passed over their service level threshold (the most famous is 20 seconds but this can vary) that they will let that call sit unanswered so they can improve it by answering other calls within the 20 seconds. Highly unethical and usually a tactic from companies that have oversight of their service levels like utility providers or where managers have their pay structure tied to service levels.",
            "I work at a place using a point system of attendance (yes it's evil,) and being late is 1/2 point, which doesn't go away for a year and a day, but calling out for up to two scheduled days in a row (which can be separated by days off,) is one point, also year and a day.\n\nUnless you're really close to the firing threshold, or you happen to come in an hour late for an early start you didn't notice, the system almost encourages a two day vacation.",
            "Worked at a place that had attendance bonuses. Middle of winter, there was an accident which ended up taking 4 lives. I couldn’t drive by as the highway was closed and no where to turn around. Lost the bonus and was yelled at for being late. Noped tf out and went home",
            "I work at General Motors in michigan and if we call in we have to do it at least 30 minutes before the shift starts or we get written up even if we have call in days available and there are no exceptions to this. So one day my car broke down right outside the plant close enough I could have walked the rest of the way but I called in and got a tow truck and took care of my business. Of course I got written up and I explained that I didnt know 30 min before because my car broke down. My bosses response was maybe I should have called earlier Just in case. I dont think he thought about that before saying it because I called in to work every single day for about a month which was how long it took me to get a job in another area with another boss and there was nothing he could do about it because there is no penalty for calling in and then still showing up to work. Looking back on it I should have actually taken a couple days off during that time just because he wouldnt have known when I was going to be there or not.",
            "When management tries to game the system, the employees will turn the system into a game.",
            "R-r-r-r-oooolllll up in your car just to go home? :D",
            "Am I the only one wondering how in the hell you live 1h away from the closest timmies? There should be one within 2 meters of you at all times?!",
            "where I work is similar. and the same thing happened. there were many people who hadn't worked a full 40hr week in months so they implemented attendance bonuses. first month without missing a day, being late or leaving early you get $50 in cash, gas card or gift card. 2 months $100 or a day of vacation. 3 months you get a King Disc grill. only a handful of people have gotten the grill in the 2 years this policy has been in effect.",
            "At my job it counts the same if you’re 5 minutes late or call out. One of my previous bosses was a real bitch about tracking attendance. Example: I had a flat tire, sent her a pic of it, then paid $20 cab fare to get to work. I was 10 minutes late. She counted it as an attendance event. She would count you late at 1 second over your scheduled time. I ended up getting written up after 5 “occurrences” (one of which was the flat tire day) so... yeah. After that, if I knew I was going to be late & couldn’t avoid it, I just called out. If it’s gonna count the same against me then I might as well take the day off. So incredibly stupid, you know? Those call out days didn’t have to be a disruption of business if not for such a stupid policy.\n\nEdit: autocorrect mistake",
            "My high school had a rule like this. If you were over 15 minutes late you were counted absent for the entire first half of the day. It was meant to encourage people to be on time, but if you're not going to be recognized as there, then why bother?",
            "We had some timeliness policies like this at the last placed that I had worked. Sad part was that they were only being used in certain cases to create a paper trail to fire that particular person. Definitely favoritism being used. Congrats on finding a loophole although I wonder how long that lasted before they caught on and changed it. Were you the only one getting hit with these writeups for being late or was it everyone?",
            "I worked as a shift manager at a local chain pizzaria who had a similar policy 1 minute or 10, late was late call or not, if you called the same day to call off was a write up. The twist was there was no repercussions for no call, because we were expected to call the person 15 minutes into thier missed shift. If someone simply \"forgot thier schedule\" it was a warning whether or not they came in for the rest of the shift..  I quickly realized I'd see employees drive into the lot, notice the time, leave, and wait to be called. I couldn't exactly change company policy, but I let it be known that I wouldn't write up a minute or two here and there, and I wouldn't waste my time calling no shows, I would simply give an automatic NCNS write up after 15 minutes. 3 NCNS and I'd terminate. It didn't take long for the other shift manager and shift lead (third \"manager\" to cover managers days off and missed shifts) to implement my rules and stop the ridiculous abuse of the \"I forgot my schedule\" warning.",
            "Back in my high school years, when Caesar was president and a loaf of bread cost a chicken, my school had a rule that if you were tardy more than 3 times during the whole year, the 4th and beyond would get you Saturday school. However you had 5 excused absences per semester. If you went beyond the 5, absolutely nothing happened until like 15-20 in a semester. Don't know how many times I ended up in the parking lot with less than 5 minutes to get in and seated at my first period class and I knew it would probably take 6 minutes, so decided, nope, going home and not getting Saturday school.",
            "Manglement gonna mangle.\n\nI work in an IT call center. \n\nThe amount of negative feedback is beyond ridiculous. \n\nRather than strive for excellence we all have been \"taught\" to strive for \"cover your ass\" which sometimes translates to \"do as little as possible, since everything you do is criticized to the nth degree.\"",
            "Haha I'd bet my right hand this was Starbucks. Never sign the write ups of a dumb shift, and you're probably in the clear has been my experience. Thank God for shift leads with brains.",
            "I worked in a government office that had flextime (meaning you can come in when ever you want providing you worked the core hours of 9 - 3 with an 8 hour work day.  There was one guy who still came in late until his boss required that he start taking personal leave for it.  Somehow he then managed to come in on time (9 am).",
            "I object to your use of \"amoeba.\"",
            "The last place I worked was somewhat strict on times because we had a meeting right after the shop opened. \n\nIt wasnt as big of a deal if you called and said something due to the weather but you lost sympathy if called saying you were going to be late once you were already late.",
            "I used to work in a job kinda like this. But they had two point systems, one for tardies and one for absents. \n\n8 total for each but if you hit 5 or more in either, you would be reprimanded in some way until you hit number 8 and were fired immediately. \n\nIf you talked about your points at all you would be reprimanded, if you tried to play “the point game” by calling out because your tardy points were getting past 5, and they caught you, you’d be fired.",
            "I briefly worked for a water district with the same policy. You would get in serious trouble for being late so on rare mornings when people were running late they would just call out entirely. Pretty stupid if you ask me",
            "Legend has it that during the years Andy Grove led Intel, employees had to sign in if they showed up after 8am. And management paid attention to who was on those sign in pages. But employees eventually caught on that they stopped signing people in at 9am. Result: if an employee was going to be even a minute late, they’d sit in their car in the parking lot until 9.",
            "You travel an hour each way, in the snow, to work in a coffee shop? I'm not belittling your choice of career but surely there's a coffee shop nearer to your house?",
            "They do this at my husbands work as well. He has so much vacation time that if he knows he may be late just calls out before even trying to go in. It’s dumb. \n\nthey’d be better off giving people a 10 min window of flexibility and shutting the fuck up.",
            "If you had two minutes until your shift started, why call out at all?",
            "Shitty place I was a temp at for a while had a similar rule: more than 5 mins late counted as an absence. So if you were going to be 5 mins late just call out.",
            "My job is the same way, and I am in management. If you are even a minute late, it is an AWOL. Technically we need 2 hours notice if you will not be in, which I find absurd, but I am no where near that high up to change that. \n\nI work in a call center. Attendance is especially important. That is why we need people to call out. I need to do this as well, and in fact, I just logged out early today due to feeling ill. I still need to let my superiors know, and call the Attendance hotline. I can't just logout whenever and not report it.",
            "Amoeba?",
            "Great idea... but why were you driving an hour for a fast food job?",
            "Better never than late.",
            "If this is the coffee place that I think it is, I completely understand your troubles. I worked my ass off for three years and even trained some of their management staff only to be told that I clearly don't care about my job because I was late a few times for a couple minutes.",
            "But why didn’t you just wait at home and call 2 minutes before your shift started instead of wasting gas on an hour drive???",
            "What if you called in to say you would be late? Management has to expect that to happen once in a while, especially with our winter conditions. Sometimes accidents happen. I was a couple minutes late for work one day so the next day I left early and took the previous train which was a roughly 20 minutes prior to the one I normality took and still ended up being almost 10 minutes late due to an accident on the tracks",
            "Well, see, they messed up by not having a cutoff time for calling off, and that’s totally on them. Every place I’ve worked, you have to call off at least two hours in advance to be in compliance, or the night before if you open.",
            "If the company is the same one I worked at when I was a kid.  Does not sound like much has changed.",
            "You drive an hour each way to work at a coffee shop? Bruh, find a new job.",
            "You dont get paid, seems like the company wins",
            "[Amoeba](https://en.wikipedia.org/wiki/Amoeba) of trouble?",
            "So you drove home in the blizzard?",
            "They didn’t even have a policy for when you needed to call out by? HA! That’s freaking awesome. Well done.",
            "Tim Horton's?",
            "😂😂",
            "Timmy HoHo's is not worth an hour trip.",
            "Our work has a similar policy. \n\nCalling in that you might be late is better than being late but only because your write up doesn't come with a lecture. And you get docked, as in you only get paid what you worked, they don't let you use vacation time.\n\nCalling in that you might not make it at all. No write up, they just dock your vacation time if you have any.\n\nShowing up late when \"as luck would have it\" you could make it after all, no write up, only the time you missed is counted on your vacation.\n\nEven better, if you don't get a late write up, or take a sick day (vacation is ok) you get a perfect attendance award of 12 hours of vacation on your annual review. \n\nI've gotten that bonus every year. Also if I'm going to be late, just go ahead and be two hours late. We get 96 hours of vacation normally, my bonus takes care of most days I'm late. The real stupid thing is that we can come in early and leave early. Your not late until you've passed your normal shift start time. Most people do this and if they are 5 minutes late from when they \"want\" to come in it doesn't matter until they \"have\" to come in.",
            "Canadian coffee place... Must be Second Cup.",
            "Same at my work!",
            "Tim Hortons?",
            "Bahaha, they had the exact same system at my HS! If you were late by any margin of time to first period, you'd get written up. But they'd only mark you as absent if you didn't show up for second period.\n\nSo, everytime I woke up a bit late, I just took my time, got to school 50min late and show up right on time for second period. Zero consequences. It was great."
        ]
    },
    {
        "post_id": "gvsgxi",
        "author": "SparkleFritz",
        "title": "\"You can't leave until you shovel ALL of the snow!\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/gvsgxi/you_cant_leave_until_you_shovel_all_of_the_snow/",
        "score": 13213,
        "num_comments": 235,
        "created_utc": 1591184778.0,
        "selftext": "This wasn't me doing the malicious compliance, nor the request, but the middle man who witnessed this gloriousness. I worked for a movie theatre company in a state that snows every winter. We had a contract with a snow shoveling company but my boss refused to use it because the costs of each removal had a possiblity of hurting his yearly bonus by a couple percent points (like $300 max out of $20,000). \"Only if it snows more than six inches\" he would say every time.\n\nUnfortunately this meant that one of the ushers would have to shovel snow on the sidewalk. Since it's a safety hazard to block the emergency exit doors of a theatre it meant you had to shovel a path around the entire building and for each exit door. Ultimately due to the size it's about a quarter mile around the building. No one likes doing it because it's cold and shoveling a simple one shovel-length path can take two hours.\n\nDuring a snowy Christmas week (the busiest week for movie theaters of the year, imagine Black Friday shopping for two weeks straight) it had snowed just under six inches. We were extremely busy and my boss demanded to take one of our much needed ushers to go shovel snow (I was an assistant manager). When we asked if the company could come out instead of us doing it we were told no, to which one of my co-workers (we'll call him Dan) said he would do it. An hour later after he had gone outside one by one my boss pulled each usher in and wrote them up for \"refusing to shovel snow\". When Dan came back in the other ushers complained to him about it. Dan asked our boss why and our boss said that it was because no one wanted to shovel all of the snow, and if Dan didn't shovel all of the snow he would get written up as well. This all happened at the beginning of my shift, around 5pm.\n\nCue the malicious compliance. What my boss didn't realize was that it was the last day of the payroll period. Being Christmas week Dan had already accumulated 40 hours of work earlier in the day. My boss left right after telling Dan to make sure ALL of the snow was removed. We worked the rest of the shift and everyone assumed Dan had finished and left.\n\nIt's 3am now and we go to punch out for the week but can't because there is a shift that hasn't been approved yet. Someone is still working and is at 12 hours of overtime. It's Dan. I go out to investigate since it should only be myself and my manager. As I walk outside I see Dan coming back in, smiling the biggest grin on his face, and the most dry, un-snowed path I've ever seen in my life. It looked like two pictures cut together; there was not a spec or snow on the entire front path of the theatre. Dan spent ten hours outside making. Sure that he removed ALL the snow from the walkway. We had a good laugh, clocked off and left.\n\nWe didn't hear anything until later that week when I was called into the office and had to write out a statement to why I let Dan work twelve hours of overtime. He had this smug look on his face like he had \"beaten\" us. He was not too pleased when he found out that all of our statements included him saying the phrase \"remove all the snow\" and that he refused to call the snow plow company. My boss was transferred to another theatre soon after.",
        "permalink": "/r/MaliciousCompliance/comments/gvsgxi/you_cant_leave_until_you_shovel_all_of_the_snow/",
        "comments": [
            "You can only pinch pennies so hard before you break your finger and have to pay the hospital bill.",
            "Lmfao stupid boss gets owned by an employee. Always satisfying and with a nice fat check to boot",
            "I think I love Dan",
            "This sounds like the manager I had when I worked at a local chain of movie theaters. At the location I worked the platter for screen two did not automatically start to spin like it was designed to. Ushers were required to go in every time a movie needed to start on that screen to give it a spin because once it started it was good to go. An assistant manager told me it was a bad chip that would've cost under $50 to replace but that would have come out of the managers bonus and he didn't want to pay for it.",
            "Reminds me of the time we had a massive blizzard and I was working as a cart pusher/bag boy at a grocery store. The blizzard lasted for 2 of my shifts (started Friday night and ended Sunday afternoon, working Saturday afternoon and Sunday morning). We ended up getting 26\" of snow in total that drifted 8ft deep in some places.\n\nMe and one other guy got tasked with keeping the sidewalks clear on Saturday. The temperature was also dropping quickly at the same time and the walkways were icing over. Management told us to grab a bag of water softener salt and use that. We burned through it in about an hour at the rate it was snowing. Went to grab another one and they stopped us and said no more.\n\nWe did what we could, but everything was coated in a layer of ice under the snow when it was all said and done. Stayed cold for the next couple days so it took over a week before you could actually see the sidewalks again.",
            "Ah, this brings back memories. I was a manager during a similar Christmas season, and we were well-staffed with managers but a bit short on ushers. So, I would volunteer to do the shoveling, because I'm a sick son of a bitch who likes cold weather and working obliques.\n\nThey were paying me more than an usher, but getting each theatre cleaned and ready for the next set while ensuring customer safety was absolutely worth it.",
            "Damn Dan, you’re my new hero",
            "Does this theatre company have a crown logo? Because I too had a boss who wouldn’t pay for maintenance because it came out of his bonus.",
            "I think, the company should have transfered all bonus(es) of manager to Dan. That would be a nice lesson learnt for the manager. As he tried to decrease costs by adding them to a non-bonus related budget.",
            "damn Daniel back at it again with the white snow",
            "There is no better fuel for motivation than pure spite.",
            "Where can I get a job managing a movie theater that pays a $20k bonus?",
            "Play stupid games...",
            "Aah the movie theater stories I have from over the years, there's so many, my favorite is the part time manager who told me not to start one of the projectors because he was going to do it himself so I could start another movie on time (not that I couldn't get both just like every day before and after that) .  He knew nothing about projection other than where the start button is, which might be why he didn't put any film in the projector before starting it.  I found out via a radio call from him saying that the screen was just blank white.",
            "Only very slightly related story:\n\nBought tickets for my daughter and I to go see Star Wars The Force Awakens around Christmas of 2015. I bought the midnight tickets because that's how I saw every single one (except the originals). We also had just moved here from another state and in our old state any time you go see a movie and it's raining or cold, they let you inside to wait so that nobody dies of frostbite, hypothermia, or a bad cold from waiting in the rain. Here though, I wasn't prepared for Star Wars to be released at Christmas time, and it started snowing *hard.* \"No big deal\" I thought, soon we'll be inside. I also (very stupidly) was wearing a thin crochet-type sweater over my shirt and jeans because I'm not usually outside for that long. When we got there, the line was around the building, and *everyone* was waiting in the hard-falling snow! I knew that there would be a ton of people but I couldn't believe that they would make us wait in the damn snow! I went inside and asked the manager why we weren't waiting inside because of the weather (god I must have sounded like a Karen) and he said that he couldn't have all of us inside crowding the people who were there for other movies. Everyone was an hour or so early of course so we all literally stood in line in the pouring snow in 4° weather for at least an hour. I made my daughter go sit in the car to keep warm while I held our place in line. I thought briefly about switching off with her but she was only 14 and I don't trust today's society and her standing alone in line behind a movie theater. I don't even mind the waiting. I minded the fact that very slowly I started to not be able to feel my face, my feet, and my hands. Plus I wasn't exactly wearing good clothes for snow because I thought we would be treated like humans and let inside to wait! There was another movie I had to wait for back home and it was absolutely pouring buckets and they let us all sit in an empty auditorium and sit on the floor of the lobby lining the walls. I seriously don't care about waiting - I care about living. I do remember while waiting in line for Star Wars TFA starting to fall asleep and sway on my feet. At that point I had snow up to the mid-calf of my jeans and I couldn't feel my feet. Somehow I stayed awake and just when I was thinking about my life and how I'd like to keep living and maybe just going home, they started slowly letting us back in. It took another 20 mns just to reach the door. By the time we finally sat down in the auditorium I felt weak and shaky. It took almost half the movie before I could feel my whole body again. It was *the* worst movie experience ever. I still to this day 5 years later cannot believe that they did that, making every human in line wait in a partial snow storm just to avoid crowding. I know there's a people capacity for public places, but people's lives can be at stake. Does anyone else have a bad movie story?",
            "I have a feeling that nowhere in the employee handbook does it say that ushers have to shovel snow. As the story indicates, shoveling snow is a job done by an entirely separate person/company. A job that a separate individual gets paid a separate salary for. Am I wrong to conclude that what was occurring here was WAGE THEFT, for expecting someone to do an entirely different job for no extra pay?",
            "I would have refused to sign the write up for refusing to shovel snow myself. Yeah he'd probably fire me but I refuse to participate in my own abuse.",
            "You were lucky you had a company for the most snowy days. Where I work, we just get handed the shovel and a bucket with salt/sand, and off you go. \nAlso, there is only one jacket and one pair of rainboots, both in male size XL. I almost fell down the stairs a few times, because my feet literally drowned in these. The jacket hanged down to my knees and I could barely move my arms. But that wasn't an excuse. The only fun part is that I looked like a mad lighthouse keeper in those.",
            "The party actually at fault here is whoever instituted the stupid manager bonus structure. The whole point of these bonuses is that it should encourage managers to do certain things, to act in certain ways. They paid this manager more for being cheap when it came to snow clearing. It is entirely their fault that he proceeded to do exactly that.",
            "this is amazing, the manager got screwed by dan doing what he asked him to do. sometimes if you’re patient situations like this just work themselves out.",
            "Man this takes me back to the 5 years working at a movie theater. Luckily our GM wasn't as bad as yours. But you describing that 2 week Christmas rush just brought back terrible memories. It has to be top 3 reasons why I left. For us overtime was not paid at a higher rate so instead of hiring and staffing properly all the staff would end up working crazy hours. As an assistant manager every year I would do at least 6 12 hour shifts for 2 plus weeks. After the 2018 holiday rush I said to myself I will be jobless before I work another Christmas here.",
            "Love it.  Reminds me of every shitty job I’ve ever had.  I worked in leisure centres and realised that I could wander around with impunity as long as I had a couple of bog rolls under my arm",
            "Basic management lesson no business school teaches - if you want to succeed in your career (1) respect your team, (2) take care of your team, and (3) they will take care of your career.",
            "In the boss' defense, if it really impacted his bonus this directly, it kinda makes sense to pinch pennies like him, as it would feel like you're actively paying for a service that only benefits your employer, while you could just assign the existing work force that gets paid by the employer to do it instead. Doesn't make it right, of course, but even in a well paid job it'd feel sketchy to pay for third party services yourself.",
            "After years of working in customer service I would definitely rather shovel snow outside than deal with customers. 2 hour task by myself with no one around to bother me? Yes please. Maybe I can even stretch it to 3 or 4 if the job is treating me poorly. Gotta be thorough ya know?",
            "\"We see that you're incompetent at running a theater, so go run that different theater instead.\"",
            "When i was doing that type of work, it was \"work those 12 hours for free or you're fired\". Law?  Fuck you.  You'll need to get a lawyer that I know you can't afford and if you try you'll never work in this town again.  Remember, anti-violence laws don't matter if the sheriff is the one holding the gun.",
            "It's kind of a terrible corporate structure that incentivises managers to not have the path professionally cleared after it snows.",
            ">My boss was transferred to another theatre soon after.\n\nI found this satisfying, he deserved it for being a cheap prick",
            "I have this odd feeling I worked at this theater.",
            "Is it honestly possible for his bonus to be $20k?",
            "Ok so take the shovel and shove it to your ass",
            "Was this in ND because I wouldnt doubt it",
            "I'm sure I already read this story",
            "I've read this story on here before. Maybe another co worker posted it once?",
            "i feel like ive read this exact post just a few months ago",
            "This was a reup",
            "[removed]",
            "This has been posted here before.",
            "I can attest to black Friday on steroids. The whole theater chain I worked for formally called the week between Xmas and new years \"Hell Week.\" It's not uncommon to make more on a Hell Week Wednesday than you would on a summer Saturday. Plus, (grand)parents dgaf about their kids because they have Xmas money, so they let them run a mock.\n\nAs a manager, 5 mins before the movies would let out, I'd walk the theater like a captain walking the deck of his ship before battle. To anyone in the theater business reading this, good luck this holiday season!",
            "_That's Lieutenant Dan...!_"
        ]
    },
    {
        "post_id": "v5fb16",
        "author": "None",
        "title": "natural occurring colors",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/v5fb16/natural_occurring_colors/",
        "score": 13205,
        "num_comments": 657,
        "created_utc": 1654441763.0,
        "selftext": "In the early 2000s, I worked at a Canadian Casino. The place had so many ridiculous rules, including some very particular rules about makeup. The 'makeup rules' were as follows :\n\n1) no fake eyelashes\n2) no fake fingernails or fingernail extensions\n3) no makeup that is not a 'natural color'\n\nThe natural color one confused me. What is deemed natural? Who decides what is and isn't natural? I asked my manager for clarification but she couldn't give me any. \"just keep it natural. Use natural occurring colors and you'll be fine.\"\n\nThis did not sit well with me. Cue malicious compliance. My aunt has her masters in environmental science. I went to her house one evening and picked her brain about natural occurring colors. She informed me that, scientifically, natural occurring colors are colors that can be found directly in nature. She even showed me a textbook that directly spoke about natural occurring colors. I borrowed the textbook and highlighted the paragraphs that specified this. Keep in mind, this was well before you could just google something. The only way to back up the claim was to carry that 750 page textbook to work with me.\n\nMy next shift, I went all out. Green eyeliner, eggplant colored eye shadow, yellow nail polish on one hand and mango colored on the other hand.\n\nI hit the floor to work and within the first few minutes, I get hauled into my manager's office.\n\n\"OP, what do you think you're doing? You cannot wear those colors. You know our policy states natural occurring colors only when it comes to makeup. Head to the staff bathroom immediately and remove it\"\n\nWordlessly, I headed to the staff bathroom. But instead of taking the makeup off, I went to my locker, grabbed the textbook and marched back to my managers office.\n\n\"excuse me, manager? I am wearing natural occurring colors. Here, look at this textbook that specifically states what natural occurring are, by definition.\"\n\nI watched her face change as she read the book. First she looked pissed, then worried, and then finally resigned herself to what was happening.\"\n\n\"OP, do you really need to be that type of person??\"\n\nMe: \"the type that follows the rules? I thought that's what you wanted me to do?\"\n\nShe asked me to head back to the floor. For the remaining time I was employed there I wore whatever color makeup I wanted and so did almost all of my coworkers. They tried coming out with new rules but could never get the wording right.\n\nF*** stupid rules! Malicious compliance for the win!",
        "permalink": "/r/MaliciousCompliance/comments/v5fb16/natural_occurring_colors/",
        "comments": [
            "When we built our house it was in an HOA. The hoa isn’t bad but some of the people were a real piece of work. Every house in the hoa is some shade of poop brown. We chose gray with red brick. People were in a snit because it was supposed to be an earthy color. Fortunately the builder (who lived in the hoa) agreed with me that gray was indeed an earth tone. We’re still the only gray house surrounded by poop colored houses.",
            "My high school had a rule that you had to wear solid color dress pants and dress shirts with a tie. Shirts had to be at least vertically striped or solid color. \n\nWell our buddy Tony decided to test these rules and wore banana yellow dress pants to school. He was immediately sent down to the office after first period. He was told that he had to go home and change but  he asked where it was in our student handbook that he couldn't wear yellow pants... after all they were a solid color.\n\nThe following year they updated the handbook to say solid color and it could only be black brown blue or gray.",
            "I think the word they were going for is \"neutral\"",
            "My last job at a hospital had the natural hair rule too, but then also like to leave things vague like it was up to \"manager discretion\", a couple of people dyed their hair funky shades and were reprimanded for it so they bleached their hair out and went completely silver which our manager fucking hated.\n\nBut considering we had four nurses over the age of 60 working on that floor that all had silver hair, there was not a fucking thing she could do about it unless you wanted to try and tell the elderly nurses they had to dye their hair.",
            "Been there with those stupid rules! My high school had a rule about natural hair colours only. I made the mistake right before I started and had red highlights (that came out a little too bright), and was told not to attend school unless removed for the first day. \n\nThe best part, the remainder of my years there it was ok for the [principal’s (not exactly her title/job but most clear comparison haha)] daughter and her friends to have hot pink highlights etc :/ \n\n**edit clarity and typos",
            "Ha sounds like me with my fingernails working for Disney. Nail polish colors being banned or unbanned was dependent entirely on manager but mail length wasn’t. I don’t remember the exact measurement anymore but a manager could have held a ruler to my fingernail and confirmed it was under the max length. A coworker in particular hated this so every few weeks in staff daily schedules the maximum nail length was listed to remind this specific person I was fine.",
            "Omg I really needed this today!!!!\n\nLoved the manager:\n\n>\"OP, do you really need to be that type of person??\"\n\nYYYEEEEEESSSSSS \n\nLean and explain what you want. Manager could have explained to you when asked, but decided that is was too much trouble.   \n\nSo everyone can look like a fabulous peacock 🦚 ✨️,  as long as keeping \"natural\"",
            "Man I worked at a restaurant once that had a male host that love to dress up as a woman and wear make up and nail polish and the owners of this place held a meeting and banned us all from wearing anything colorful at all only skin tones for make up nails and hair ties. Clothes weren’t regulated but it really put this guy down and he didn’t stick around much longer which is really sad because he was a huge sweetheart and everyone honestly loved him except the rude and horrible owner.",
            "I have a feeling that trying to define natural colors could get them in trouble with regards to non-white people.\n\nMakeup that looks good on a black person could look really strange on a white person, for example.  So would their guidelines have to start listing acceptable colors for every race?  Seems like a whole shit-storm of legal problems would ensue.\n\nIf they say a certain color is acceptable, then everyone should be able to wear it.  If they start restricting it based on race, isn’t that the very definition of racism?",
            "I did similar years ago when those hair feathers were a thing (10 years ago maybe?). My work has a natural hair color rule, but they allowed these things; even our admin wore one. (If you’re not familiar with them: they get placed on a small group of hairs, after a few weeks the hair grows and it’s removed and/or replaced) So I went ahead with my purple highlights, they only last a few weeks without top shelf upkeep after all. Got called back to talk to the admin (who had feathers in her hair), yadayada not a natural hair color. So I pointed out that it’s not natural for people to grow feathers on their heads either. And her feathers and my purple would both be gone by the end of a couple months max. She just shook her head and told me to not be literal. But, no write up, and recently they removed that rule and similar ones.",
            "Good for you! If they want a specific color palette, they can provide it.",
            "I worked at a waterpark that had very antiquated rules about appearance, including separate ‘acceptable’ hair styles for males and females. I liked having long hair, which was forbidden, but I grew it out anyways. My hair looked nice long, it didn’t interfere with my job in any way, and guests loved it. Of course, managers hated it, and always told me I needed to cut it, but I refused and said it was an antiquated and discriminatory policy that I wouldn’t follow, unless of course they also mandated females also cut their hair short. They would always threaten punishment, but I was such a good worker I’d get positive guest feedback all the time. The kicker was, it was policy to read all positive feedback at meetings to encourage positive interactions. The trouble was that our name tags were so small and the uniforms made most of us look alike, tons of compliments were just ‘a lifeguard was nice’ or ‘the shop worker was helpful.’ Mine? All of them ‘the lifeguard supervisor with the beautiful long blonde hair was so nice and helpful!’ They’d occasionally try to overlook them because they didn’t include my name, but because we had access to the system, I’d go through them at the end of almost every day and see if any sounded like me (or my guards) so that I/we would get credit.\n\nThere was no sweeter Justice than having my managers read out a guest compliment describing my hair in front of 30+ people lol.",
            "Lol they never even thought to put \"neutral makeup only\" these people are stupid and ridiculous. There is nothing inappropriate or unprofessional about brightly colored makeup",
            "I… Googled things all the time in the early 2000s.",
            "When will people learn, that if you want people wearing (or not wearing) certain colors, YOU HAVE TO SPELL THAT OUT. Don't want \"wild\" or \"crazy\" colors? Name the ones you'll accept. Much easier that way.",
            "Maybe it happened the way you said.  In my experience, most managers are going to respond with something like: \"I don't care what your textbook says, this isn't a court of law, the spirit of the rule is clear and I'm the judge what is natural.  Go take that makeup off right now and don't do it again, or you're fired.\"",
            "I mean, I guess. My first question was \"is that really a hill you want to die on?\"",
            "LOL the fact that they couldn’t see this coming is unbelievable. Well done.",
            "\"Do I 'need to be that person'? No, but here we are nevertheless.\"",
            "[deleted]",
            "The word they were looking for was neutral. Naturally occurring? Hey look at this parrot!",
            "Sad thing is, if they weren't so obsessed with control, they could have said nothing and most people would have just worn normal, every day make up.",
            "lol The word they were looking for was neutral...",
            "color palette limited to colors that occur within the spectrum of healthy human complexions, is about as close as I could come up with on short notice, feel free to pick apart, I would like to see if I can revise to a point that can stump the post audience",
            "Language matters, use it against them. I got us an extra, paid holiday because I used their own handbook against them. Never give up, never surrender.",
            "You borrowed a textbook and then used highlighter in it? I sure hope you had permission, because I'd never let you touch one of my books ever again if that were me.",
            "This might not be the best place for this response, but those stipulations sound fairly reasonable. I mean, having understated makeup etc. is a bit more professional than wearing a bunch of loud colors like you did. I mean, I was young and impetuous too and I’m sure I would have acted out like this, but I’m older now and it just sounds juvenile.",
            "That wasn’t a win. That was stupid. It obviously meant natural colors in regards to your complexion. They wanted their employees to have a clean look. How hard is that to comply with? OP sounds like a rebellious 4th grader.",
            "This malicious compliance reminds me of the comedy [Bedazzled](https://www.dailymotion.com/video/x1z7tlh), where this guy (Dudley Moore) is trying to specify to the devil (Peter Cooke) exactly what he's selling his soul for.  But he should be more specific!",
            "Wow, was it really so hard for them to say \"brown, beige, tan, peach, clear\"?",
            "No offense OP but this one is just annoying. You knew what they meant. They weren’t being dicks. You went out of your way to be annoying.",
            "Yeah you’re just annoying, they mean natural skin colours not earth.",
            "Natural is clearly refering to natural skin tones.  Your boss was right to question if you're \"that type of person\".",
            "Is neutral really that hard to come up with? Common management, you can do better.",
            "Was “naturally occurring in humans” too hard for them to elaborate on? I’m assuming that was the intent but who knows. \n\nAnyway, I’d do peacock colored makeup because nature has some pretty palettes",
            "So you are that kind of person.",
            "So dumb, my work would like me to not wear green lipstick. \n\nUhm actually green is a natural colour.... \n\nYou know what they wanted, this isn't malicious compliance, it's just poorly considered rule breaking.",
            "The best rules are good faith rules that ask you to look presentable and give you some trust about what that is, accommodating personal taste while making it clear that you shouldn't take the piss. \n\nLess good rules are overly prescriptive but comprehensive. A better version of the third rule would be \"no makeup colours that are not approved in the appendix\" and then there are RGB values and detailed descriptions of what colours are allowed. \n\nYou can also create rules that assume they have no common sense but don't provide the strict totalitarian rules required to be enforced on the poor schlubs that work for you. \n\nGood companies always go with option one. Horrendous genocidal dictatorships choose option two. Stupid companies choose option three but don't realise that's what they're doing. \n\ntl;dr: Treat adults like adults",
            "Ugh hate managers as a general rule, but this is just the next effing level in dumbassery if they couldn't come up with some remedy to the wording, much less a new rule, for such a simple matter.",
            "I was kind of hoping this would end with you going to work with like woad and ochre. \"What do you mean it's not natural? I dug it up myself!\"",
            "All they had to do is change their manual to say you only could wear beiges or Browns that's what they were looking for obviously but they phrased it in such a stupid way and there was a huge loophole.",
            "Technically many shades of color are present in humans as well. They may represent injuries or disease, such as jaundice, bruises, or extreme nausea. But they certainly are natural!",
            "TBH op seems like the kind of person to annoy you for no reason because you never specified they couldnt and get upset when you tell Them to stop. This is being Petty for no reason other then starting drama, you really couldnt just not try and search the limits?",
            "This is really childish behavior and I really doubt you blew your bosses mind that day... You were just trying to fight and be annoying. A weird thing to do at your job. \n\nAlso, You had to look it up in a textbook? Did you not know that rainbows exist in nature?",
            "And then the whole room clapped",
            "I like it since your manager couldn't define natural colors but have you really never heard that term before? Im a man so never really into makeup but even I know that's generally beiges and subtle pinks.",
            "Wow, OP sounds intolerable.",
            "Handbook: “Don’t look like a hoochie mama.”\n\n\nOP: “And I took that personally.”",
            "That's so weird. It would have just been easier to say no makeup and no nail polish, period.",
            "Sounds rather petty of you.",
            "They meant \"normal\" colors, instead of \"natural colors\". You already knew that.\n\n\"Normal\" in this instance is defined as colors which are something like to what most other people wear. AKA it should not stand out from the crowd og attract attention in itself.",
            "I’m with your manager. You were like that to prove a point. You proved your point, but you did nothing to improve the situation.",
            "[deleted]",
            "A rainbow is natural. “Natural-look” makeup is a thing and you know that it has nothing to do with what colours occur in nature.\n\nThey just wanted staff that knew how to fit in to a professional *public-engaging* environment.\n\nEDIT",
            "And ever since Bozo the clown has copied that look.",
            "[deleted]",
            "Moncton?",
            "Always love the people enacting ridiculous rules that you follow to a T. Then they complain you're being pedantic and it should have been obvious the thing you did was excluded. \n\nNaturally occurring is one of the dumbest words in a rule. Botulinum Toxin can kill a million people with 1 gram, it's a fully natural product. \n\nNature uses colors all the fucking time. Both for giggles (mating) and for warnings to other creatures. So many colors can be natural.",
            "A coworker of mine claims \"Flaming Hot Cheeto Red\" is a natural color.",
            "People really need to stop saying one things when meaning another, huh?",
            "Why do people get pissy at you after you directly ask them for clarification and they refuse? If you wanted me to follow your rules the way you want them followed you should clarify when asked about vague instructions.",
            "I have to agree with the manager.  You were being \"that type of person\".",
            "OP was either very brave or very stupid. Testing the employer soon after hire. It’s a great story and they must have seen something in her that could add to the image of the casino. But. It could have gone so wrong so fast, also.",
            "Is it me or is OP just being unprofessional? They work at a casino which means they should look professional. It’s pretty clear what the makeup rules were, maybe it doesn’t hold up in court but it’s still pretty clear. \n\nThis is just being childish",
            "OP you are a shit head. it's obviously natural skin tone. all you managed to do was piss people off for no reason.",
            "Mimi is pleased",
            "You seem like the kind of person that just has to have a problem with everything. You obviously knew what they mean by natural and just wanted to throw a fit",
            "I don't think colors keep you from doing your job right! 😁",
            "This ain't the flex you think it is, chief.",
            "This makes me very happy.\n\nEdit: Thought I'd specify that OP's actions and the change it created made me happy, not the rules.",
            "Rainbows are naturally occuring",
            "The casino I work at has similar rules. We are apparently not allowed to dye our hair unnatural colors for whatever reason.",
            "They wanted basic white girl natural and couldn't figure out how to say it.",
            "This is so funny to me. I assume the most accurate word they’re looking for is probably “neutral”, and “natural” is just *oh so close*! LOL!",
            "What they clearly wanted was neutral colors which isn’t unheard of in some professions but they are total idiots. These rules are stupid 💯",
            "they mean colors that naturally occur on your face not naturally occur inside of our galaxy",
            "OP is just acting like a child and is an awful employee. Why piss of your employer when he did nothing to you?",
            "Maybe if they had said neutral or brown tones... Hecc yeah naturally occurring colors!!",
            "“Natural occurring Colors” probably mean “on the human body”\n\nNot the Color’s from some jungle frog, desert snake or deep sea fish ~duh",
            "Literally anyone with more than two brain cells knows that “natural colored” makeup most likely means naturally occurring for your skin, I.e. wearing a skin-colored makeup and not looking like a fall harvest. The “ridiculous rules” sound like trying to make you look, oh I don’t know, professional?",
            "Lmao!",
            "Touche\\`, Rainbow Bright!",
            "Why would they even care?\n\nIs there some kind of \"cheat code\" where if you're wearing red nail polish it signals to roulette players to bet red?\n\nHmm......that would be interesting I guess.  If you could develop a nail polish that changed colours depending on what cards you were holding and it signaled to the other players what you had.....?\n\nCome to think of it, you could wear every colour of the rainbow nail polish - you have 10 fingers, right?  Then you could signal to a colleague what s/he should bet........",
            "> I asked my manager for clarification but she couldn't give me any.   \n\"just keep it natural. Use natural occurring colors and you'll be fine.\"\n\nWhen managers don't understand the rules themselves, they just repeat them as if it's supposed to be some kind of common sense.",
            "How is this getting down voted???? Being a makeup lover before 2015 was rough! Bright colors were available but jobs would get mad when you rocked them. You used to have to work at a makeup counter or a goth retailer that I won’t name if you wanted to wear cool makeup. The malicious compliance of people like OP and others as well as myself are the reason why the full rainbow is now acceptable In the workplace. Thank you for doing your part OP💗",
            "You weren’t able to Google in the early 2000s ? Where did you live?\n\nYou also sound extremely annoying. You obviously wanted to pick a fight.\n\nEdit to say that your story is lame but the comments here are gold! \n😍🍷",
            "You know what they meant.",
            "I would have coloured my hair blueberry haha",
            "Thank you. Now I have my backup, as this is EXACTLY what our handbook says.",
            "Well done 😁  I do a lot of natural dyeing and this made my heart happy.",
            "All they had to say is blends in with your tone or give some kind of guidance\n\nBut they were too lazy to do that,so you can get creative!",
            "What if you get the makeup tattooed on yourself.  Some people opt for makeup tattoos rather than reapply it every day.",
            "As a soapmaker, this made me lol. Charcoal, titanium dioxide, rose clay, green clay, blue oxide, red oxide, yellow oxide... That would have been fun😁😁😁",
            "I love this! I think my work has a similar policy for hair. I'll have to look at the exact wording and might be stealing this!",
            "hell yeah!",
            "We had a policy at my old work that only natural hair colors were allowed. I braided red hair into my natural blonde hair and there wasn’t sh!t they could do about it because it was a “natural” shade of red. Nowhere did it say you couldn’t have multiple natural colors at the same time. :)",
            "You highlighted in a book? NooooOoo!🤣 But seriously…what even did they think was naturally occurring? I’d have slapped on thick black eyeliner and mascara, yellow lips and red eye shadow. If confronted, I’d have whipped out a pic of a coral snake. But that’s only because I didn’t have the connections you did! Well done.",
            "I woklf have gone all out with blue, green and orange. Not only are they abundant in nature at large, they naturally occur in humans as well via eyes and hair.",
            "I like how your manager just gave up, sounds like a great manager!"
        ]
    },
    {
        "post_id": "b766r0",
        "author": "GNU_PTerry",
        "title": "Not allowed to change in the locker room anymore? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/b766r0/not_allowed_to_change_in_the_locker_room_anymore/",
        "score": 13190,
        "num_comments": 647,
        "created_utc": 1553913857.0,
        "selftext": "This happened fairly recently. My work is fairly small and situated in a mall, we have a small locker room but it's unisex so no one gets fully dressed there, but many people will change their tops. \n\nMost days I work two shifts, an early morning maintenance shift with a midday lunch shift starting straight after I've finished the maintenance. \n\nMy managers are really stingy with breaks, absolute legal minimum, clocked to the second. They'll also try and schedule you for just under the hour requirement to avoid giving another break. IE, if you're due another break if you work 8 hours they'll schedule you for 7 hours and 45 minutes.\n\nAs a maintenance worker I have a maintenance shirt which I switch to a general uniform top whenever I come off maintenance. Since I'm female presenting I wear a light shirt underneath for decency. \n\nNormally it would only take me a few seconds to switch tops and jump back on floor for my second shift, but a few weeks ago my boss pulled me aside and told me that they didn't want me changing in the locker room anymore for 'hygiene reasons'. Notably they didn't tell any of my male coworkers who had been doing the same thing for years.\n\nNow I have to walk to the nearest bathroom (approx five minutes away) to get changed.\n\nHere's where the compliance comes in. There was an unspoken expectation that I would have to get changed during my break, but given how stringent my managers are, I really didn't want to gouge a large chunk out of my limited free time.\n\nInstead every day I deliberately leave a small amount of maintenance work left undone, maybe ten, fifteen minutes worth before my break so I'd have to keep my maintenance shirt on to complete that work. Once that's done I take a leisurely stroll to the nearest bathroom while on clock to get changed. \n\nThis is generally one of the busiest periods, early lunch rush, so my managers often have to stop sitting and chatting in the office and cover me until I get back.",
        "permalink": "/r/MaliciousCompliance/comments/b766r0/not_allowed_to_change_in_the_locker_room_anymore/",
        "comments": [
            "In Chinese, there is a nice phrase that goes something like, “When the upper level management has a new action, then we lower level people have an appropriate re-action.” \n\nYour solution is a perfect example.",
            "I'm no expert but that sounds a lot like sexual discrimination to me. ",
            "I was kind of hoping you changed on the sales floor in front of customers...",
            "\"Unspoken expectation\" is the greatest phrase in the Malicious Compliance rulebook. Well done.",
            "[deleted]",
            "If someone is too bothered to look away from someone for ten seconds in a locker room (the epitome of mind hour own business territory), that’s on them.\n\nI’m glad you’re making it work for you.",
            "Pretty sure by law, any necessary changing and washing has to be done on the clock.  Though that could be a California thing.",
            "I work in a similar situation and we all change in front of each other all the time. But just like a shirt. If a female is modest she closes the door for a sec. they are totes discriminating you.",
            "I can't be bothered to find the rulings but I'm pretty sure the courts have decided that if you are required to change clothing for different duties at the same job, you get paid for the time. They can't force you to do it on your break time. If course, if you can find a way to manipulate the system without direct confrontation, it is easier for both parties to accept. ",
            "Not sure where you are OP, but in Canada that is discrimination on prohibited grounds and is not allowed. Depending on the province, there are tribunals that can help you",
            "reminds me of this semi Relevant Poem:  \n\nBoss makes a dollar  \nI make a dime  \nThat's why I poop on company time\n",
            ">They'll also try and schedule you for just under the hour requirement to avoid giving another break. IE, if you're due another break if you work 8 hours they'll schedule you for 7 hours and 45 minutes.\n\nWell, that's extremely upsetting.",
            ">Instead every day I deliberately leave a small amount of maintenance work left undone, maybe ten, fifteen minutes worth before my break so I'd have to keep my maintenance shirt on to complete that work. Once that's done I take a leisurely stroll to the nearest bathroom while on clock to get changed. \n\nI feel like an idiot but I don't fully understand what's going on here, can someone explain? ",
            "I hate how common it is for employers to pull that shit with clocking in and out/ avoiding the 8 hour things. My first job did that all the time. 1 minute late was a write up and the shifts were always 7:45 so they wouldn’t have to give you the other break. Anything to abuse the system. The job I have now has no set end times so they still don’t give that other break and they just say “well you could be working for 2 hours today or you could be working until 10 but we don’t know so the other break isn’t included”. I started waiting until 15 minutes after I am back from break to use the washroom for this reason as well. ",
            "Ugh. Keep your eyes peeled for a better job. Everything about that job sounds oppressive, and you sound like a hard working person that would be appreciated somewhere else. ",
            "Yes! My managment does this. Since in my state. You have to have a 30 min break after 6 hrs, the work you for 5.5 hrs and then expect you to stay till the next person comes in. Sometimes not for 15 mins, for those who come in late. Also, even if you work 8 hrs, you only get that one lunch break for 30 mins. No more brraks at all. 12 hrs, you either can have 1 hr for lunch, or a 30 and 2 15 mins whenever you want. I hate It.",
            "I’d talk to an employment lawyer.",
            "i mean this in the nicest way possible, but if i were you i would make sure my resume is up to date. ",
            "Awks moment, but best to educate right?. What does female presenting mean?.  ",
            "It may be illegal in your area to purposely skirt legal requirements for breaks like that. ",
            "What's the meaning of \"female presenting\"?",
            "This is such a peaceful malicious compliance and I love it. Yeah no problem let me leisurely stroll to the bathroom on the clock so I can be in proper uniform. ",
            "Just commenting to let you know I love your username! ",
            "I would drive home, change, come back an hour later and tell work that I had nowhere to change since the one area is not allowed anymore. ",
            "Boss makes a dollar, I make a dime, that's why I poop on company time ",
            "In high school, my wrestling team wasn't allowed to change on the locker room any more because someone pooped in a bag and hid it in the ceiling tiles. So we changed in front of a large window in the wrestling room.",
            "Change in the bathroom and be done with it. I don’t think they can force you to clock out for that. Casually report to HR when you see men changing in the break room as a  hygiene complaint. HR may start asking questions without bringing your name into it. None of this may be acceptable according to corporate policies.",
            "> since I’m female presenting\n\nSorry, what does this mean?",
            "ITT: Rampant Transphobia: Reddit Neckbeard Edition",
            "This is the most ridiculous thread I’ve seen in awhile.",
            "[deleted]",
            "[deleted]",
            "I think this is illegal",
            "I told my doctor that I want to have chest reduction because of back ache. Honestly, shit like this is the real reason. Why on earth would a person’s chest be so inappropriate that they need to cover up or wear two shirts for “decency”? ",
            "Quit",
            "Is \"female/male presenting\" a real thing? I thought it was just something tumblr execs made up when they decided to discriminate against women.\nedit: Well, I stand corrected. I didn't want to offend anyone with my jab at tumblr. I genuinely didn't know it was something people use and hadn't seen OP's comment explaining their use of it.",
            "[removed]",
            "You know, I think companies think the American worker is too dumb to know their rights. We have the internet now. And even if you work in an at will state, you still have rights.",
            "\"Female presenting\"?\n\n",
            "[removed]",
            "This whole situation is fucked up",
            "If I was told I couldn't change in the locker room, I'd change right in front of them.",
            "[removed]",
            "I knew you were LGBT just from the title. People suck. I'm sorry :("
        ]
    }
]