[
    {
        "post_id": "ywttii",
        "author": "nillanute4283",
        "title": "They must be MY leaves on MY curb? As you wish.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ywttii/they_must_be_my_leaves_on_my_curb_as_you_wish/",
        "score": 13193,
        "num_comments": 659,
        "created_utc": 1668606457.0,
        "selftext": "The leaf collection company for my neighborhood has absurdly strict rules about where leaves must be for pickup. I live at the end of a cul-de-sac, so my curb is curved and pretty short (about 30' / 9m) long. My property is wedge-shaped, so my back yard is quite long (200' / 60m) and has 40-50 oak trees. I also have two sugar maples in my front yard. So, leaves. Lots of leaves.\n\nPickup rules state leaves must be within 5' of the curb, but on the road. They must also be at least 15' from a mailbox. Because subscriptions for leaf pickup are by individual homeowner, neighbors are not allowed to combine leaves and cannot buy a group subscription. Subscribers must only put \"their\" leaves from \"the current year\" out for pickup. Pickup trucks use GPS to identify homes who have signed up and ignore leaves in front of homes that did not sign up.\n\nBecause I have so many leaves and so little curb (only 15' of available curb due to the required distance from a mailbox), I called the leaf collection company and asked to put the leaves along a longer curb I share with my neighbor. \"No problem,\" they said. Great.\n\nThe truck came through and picked up a fraction of the pile and left the rest of the pile the driver decided was in front of my neighbor's property. I called the company back and a different person said those are the rules. I'll just have to figure it out.\n\nFine. Now it's on.\n\nI have 15' of width and 5' of depth. There is, however, no limit on height. I moved the remaining leaves to my available curb space. I collected the rest of my leaves and added them to the pile. I spoke with my neighbors and acquired the rights to their leaves by paying them $1 each. Now they are all \"my\" leaves. I shoveled / swept the leaves off the streets. They went on the pile. I collected the purchased leaves from the neighbors. They went on the pile. Leaves continued to fall, so I kept adding them. It was a lot of work, but the pile was over 12' tall. I spent a ton of time using a snow shovel to fling the leaves to the top of the pile that was more than 5' above my head. Neighborhood residents stopped to gape at the epic leaf mound.\n\nI am happy to battle willful ignorance with malicious compliance. I reminded myself of this every time I spent another hour tending to the obscenity on my curb.\n\nThe truck came today. The pile dwarfed the truck. They had to drive away and dump leaves, then come back and reload. Twice.\n\ntl;dr Leaf collection company won't let me put leaves on a longer curb so I collect everyone's leaves and create a 12-foot pile.\n\nEDIT: Not surprisingly, many want to see the pile. Since I did this alone, I didn't have a way to take a picture of myself in front of the pile (attempts failed). I also don't want to show too much house for fear the company could single me out for denial of future services. Apparently, however, my son took a picture when he got off the bus on the first day when the pile was about 10'. He's 6'1\". https://imgur.com/gallery/xOuhbgN\n\nNot really the proof that satisfies, but it's all I have.",
        "permalink": "/r/MaliciousCompliance/comments/ywttii/they_must_be_my_leaves_on_my_curb_as_you_wish/",
        "comments": [
            "The child in me just wanted to jump into your pile of leaves.",
            "Thank you for all your hard work to produce this epic Malicious Compliance story! Extra points for going the legal mile to make the neighbors' leaves your leaves. 5 stars",
            "[deleted]",
            "This is why I just run over everything with the mower. Good mulch, helps the grass stay healthy, no leaves to deal with. Then again, I live in Florida, my \"carpet of leaves\" is probably nowhere near as expansive as yours",
            "Here, leaf collection is a township service, so all curbs are fair game. People on a cul de sac still have that problem though, where there's little curb space between mailboxes and driveways.",
            "WHERE IS THE PHOTO. COME ON MAN!",
            "Leaf subscription?? GPS tracking for picking up leaves from houses?!? What the fuck kind of HOA dystopia do you fuckin live in",
            "my question is why does it have to be so over complicated.. its leaves lmao",
            "Damn I’d love to see a picture of this.",
            "So the pile is made of loose leaves? We have to have ours in paper bags.  Would of loved to see a pile of leaves that big!",
            "Pics or it didn't happen\n/s but I do wanna see",
            "What in the world is leaf pick-up!!? What country is this? I am extremely confused. You need to contact and pay someone to come collect the leaves that have fallen in your neighborhood? What other countries do this?? I am really curious.\n\nI live in East Asia, we have people who walk around pushing a trolley type thing just sweeping leaves and picking up trash. Also those trucks with vacuums.\n\nMy mind is blown.",
            "\"Acquired the rights...\" That line killed me. I spit coffee all over my phone! You, sir have an upvote just for that!",
            "That. Is. Glorious. I love it",
            "TIL there are leaf collection companies.",
            "My great-aunt and grandmother were neighbors. My great-aunt was a firm believer that possession was 9/10 of the law. \n\nMy grandmother had a half acre of land used as a garden that sat between their homes. We would take the leaves from my grandmother's yard, put them on the garden, and till then in.\n\nOne weekend we weren't able to till the soil because it was too wet but we had to get the leaves off the lawn before the snow came. My great-aunt was trying to get the leaves off 9f her lawn for the same reason.\n\nAfter getting most of the leaves onto the garden, it was clear that a storm was coming that would blow a lot of the leaves from my grandmother's garden into her sister-in-law's yard. My dad then asked if I could finish moving leaves if he tried getting them tilled enough that they wouldn't blow away (hoping a quick, shallow tilling with the cover of leaves would keep him from being bogged too much).\n\nI assured him I could, but also pointed out that if the leaves blew over, they would no longer be our problem since his aunt believed possession was 9/10 of the law.\n\nThe whole time we finished working that day, my dad couldn't stop giggling at the thought of using one of his aunt's favorite phrases against her.",
            "It must have cost a fortune to buy them at $1 per leaf. \"I spoke with my neighbors and acquired the rights to their leaves by paying them $1 each.\"",
            "My favourite part of the story is when you purchased the rights to your neighbours' leaves.",
            "this is art",
            "Your oak trees need to reabsorb the nutrients in the leaves that they drop, by removing the leaves you are slowly choking them out. Make sure you fertilize the trees.",
            "Smoothbrain suburbanites paying to have all the compostable nutrients taken away from their yards, and then to remedy the exhausted soil, buying fertilizer.",
            "Man y’all still got leaf collectors? They don’t even do that shit for us anymore and the trash collection company will only take two garbage bags of them. No one around me has only *two* fucking bags of leaves. Minimum ten for everyone, and my house would have 30-40 because of how much land and trees we have.",
            "If you don't have a fascist HOA, you could just [leave your leaves](https://www.usda.gov/media/blog/2022/10/17/fall-leave-leaves) in the yard. They provide habitat for beneficial insects, etc. to overwinter.",
            "Wow that pile is unbeleafable!",
            "I am super confused here. I am Aussie and we don’t have anything like you are saying so I have some genuine questions:\n\nWhy would people come to pick up leaves? Don’t you just mow them?\n\nIf not, why would you remove them? Leaf mulch is exceptional for your soil. If you raked them into circle around the base of your trees and just left it till summer you would have huge soil improvement.\n\nHow come you had to pay your neighbour’s? Couldn’t you just say hey to save you the hassle I am taking them into one hilarious pile? Mate other streets here would be donating lol.\n\nHow does a company exist to even pick leaves up? Like there is that many people they can make a living off this, are these leaves like dangerous?",
            "r/composting is in ruins",
            "Is there no wind where you live? Where I am, an unbagged pile of leaves would last a minute, tops.",
            "Why do leaves need to be collected in the first place? What problem does that solve?",
            "Thank you for the laugh. That was excellent!",
            "As someone also in a cul-de-sac, with 7+ trees in my front yard and 47+ in the back, I love you for this.",
            "Jesus. This makes me insanely thankful that leaf/garbage collection are paid for by the city here (included in our taxes). Because of this, no trash gets missed and no curbs go uncleaned. It doesn’t matters who’s trash or leaves they are, as they’re *all* paid for. Recycling is even included for free as well, you just call the company that does the pick up, tell them where you live, and they drop you off a box free of charge. \n\nApparently, more towns need to adopt this method, because that’s just ridiculous.",
            "Epic!",
            "For purchasing leaves 🍃 from your neighbors,  I give you this duck 🦆, my good man.",
            "My puppy would have lost his mind. He fucking loves leaves… he likes eating them, and chasing them and pouncing on them",
            "I have never wanted to jump into anything so bad in my life.",
            "Yeeesssss thanks for adding a photo! This is amazing! 👍",
            "Thank you! I know this had to be frustrating but I needed a good laugh today!",
            "amazing. and yeah my childhood self also wants to jump in it. sans the dog poo. \n\n&#x200B;\n\nbut this seriously made me snicker. i toast your pettiness.",
            "What if there was a gust of wind?",
            "I sure hope that company has turned over a new leaf!",
            "So weird HOAs or Neighborhood compliance are that different throug region or state , here we just keep all the leaves mulch them over the winter and aug all that into the soil for spring/summer crops.",
            "Leaf fort! Just watch out for the ticks!",
            "It was cool when I was a kid jumping in to leave piles and the smell of burning leaves.",
            "We have to buy paper yard bags and put leaves etc. in them or our recycling won’t pick them up.",
            "This made my day!",
            "I love everything about this story but two bits stand out to me:\n\n1) that you “acquired the rights” to your neighbours’ leaves\n2) the top comment on the imgur link that says “now eat it.” Internet, you’re so Intetnet",
            "You rock. This is deliciously malicious compliance 🙌",
            "I appreciate so much my city’s services. It blows my mind that so many other places have to hire or contract for what seems like a basic service.",
            "We have a leaf drop-off site in our village. I just mow the leaves once on mulch, then go over it with the collection bag on the mower. What used to take five or six large containers a \"mow\" now only takes one. Five or six times in the fall season and it's done, and much less work than blowing or raking. Of course, I only have one huge three and all of the neighbors' surrounding trees, but man...this is so much easier.",
            "\"I also don't want to show too much house for fear the company could single me out for denial of future services.\"\n\nYes. They will have no idea this 12-foot pile is \\*your\\* 12-ft pile..",
            "Priceless! Win for the good guys! F off corporation!",
            "Unbeleafable.",
            "Okay, not gonna lie, I had to giggle a little. You don’t want to show your house for fear the leaf collecting company might be able to identify you based on that. Which leads me to wonder how many other 12’ leaf piles you think that they deal with where the house would be the identifying factor and not, ya know, the 12’ leaf pile in front of it.",
            "Yes, those are leaves.\n\nYes, that is compliance.\n\nYes, that is malicious!",
            "🤣🤣🤣🤣🤣🤣",
            "That's amazing!",
            "Been having a really rough kick me when down week and this absolutely made my day",
            "Ok, do you have a picture of the pile? I think we should all see it :D",
            "just leaf them in the ground, it’s better for your yard and the environment.",
            "That’s very cool but why don’t you compost your leaves and feed them back to your oaks and maples?",
            "That is very impressive. Am I the only one thinking “leaf mulch?”",
            "Thanks for the laughs. Coffee out the nose at $1 purchasing the rights to leaves",
            "how much does that leaf removal service charge you per year?\n\nhaving a huge yard with allot of oak trees i can understand the huge amount of time it took you to rake up all of your leaves.\n\nare you allowed to have a compost pile in your yard?\n\nif so, you could look into something like a Agri-Fab mow-n-vac, it's a mulching trailer that attaches to your riding lawnmower, you mow the lawn, then you dump them in a pile, the pile is usually pretty big in the fall, but by springtime the pile is small, and in a couple years you have allot of great soil/compost to use.",
            "So I worked on one of the leaf trucks in my city as a temp. They don't charge for leaf removal. Just has to be out on the curb. One we accidentally sucked up a cat that was hiding/sleeping in a pile of leaves. Never saw it. Just a loud thud/ meow then silence. Our trucks mulched the leaves as they sucked them up. Felt terrible about it but it was too late, he was kitty compost now.  Lost my shoe to that thing my first day. Once we sucked up a brick. Out of commission for a few days. Another time a kid was hiding in a pile and jumped out as we started sucking them up. I doubt it would suck up a kid, but he did scare the bejeesus out of us. It was an interesting couple months.",
            "Leaves will compost themselves over the winter months and provide protection for all kinds of animals and birds. Why did we decide that pretending dead bare grass is the optimal state?",
            "i like to walk through the leaves and kicked my feet up....wheee",
            "OP, make sure to take a picture next time! I really want to see the leafpile* 😂",
            "I thought you paid $1 per leaf and I was going to say, that is some rich as fuck pettiness. But I get it now.",
            "Wait, the company picks up leaves, not leaf *bags*?",
            "I would love to see a picture of those leaves!",
            "Beautiful oak loves! My Isopods would love the nibble",
            "how did they not blow away constantly?",
            "They also look out for dangerous nailclippers?",
            "I'm actually impressed they did it. So did they learn their lesson?",
            "OP your back must be stronger than Mithril after all that work.",
            "What does \"MY\" stand for?",
            "I love it. All these companies basically force us to get everything in writing",
            "Have you thought about composting them?",
            "I feel your paint.  City picks up our leaves, but the front of my cul-de-sac home is about 10 feet with driveway and mail box taking most of it.  Hence, I don't get leaf pickup.  I can gather them up in the recycle bags for pickup.  Sigh.",
            "We get our leaves picked up weekly, by the municipality. We have a rolling bin that gets filled with compostables, even meat produces and pizza boxes! They compost it, then sell it. It's a win win!\n\nWe only get garbage pick up every second week, so it really pays to compost.",
            "That’s awesome!! Plus you got some great exercise.",
            "I just want you to know that you have made my day! Thank you!🤗🥰",
            "Maybe the pile would look more impressive if we had a banana for scale",
            "> and has 40-50 *feral* oak trees.\n\nFtfy, hope [you've got an AR for them](https://knowyourmeme.com/memes/30-50-feral-hogs) 🤭",
            "Just mulch and compost. I grew up with a similar lot, we never had any problems.",
            "why get rid of all the leaves when you could use it for nutrients to your garden?",
            "I suddenly have the urge to rake leaves after work upon reading your calamity. /s",
            "LOVE the Malicious Compliance!!!!  👌",
            "British person here ... leaf collection .... WTF?????",
            "Brilliant but my first thought is what about wind blowing them away? Guess it was not an issue for you thankfully.",
            "[deleted]",
            "I love every part of that story! Good on you!",
            "I believe a mulching mower will chop up the leaves well enough that you don't have to rake. You have to do it often instead of waiting until they are all down.\n\nI live in row home without a yard, so this isn't first hand knowledge.\n\nGood luck",
            "Oh hell ya, thanks for bringing smile to my face….. rock on.",
            "That's amazing",
            "I don't know why, but in my head I expected them to be in a bag",
            "JESUS CHRIST, THATS ALOT OF LEAVES-",
            "wait. there’s an entire business model on picking up leaves?!",
            "The little kid in me wants to dive into that leaf pile 🤣🤣🤣",
            "Today was a weird day, but this post made my heart smile. Thank you OP.",
            "Let the hate flow through you",
            "The idea of a pile of leaves staying stacked like that for more than 15 minutes without blowing away is foreign to me. I'm in the Canadian prairies",
            "Leafs are excellent mulch & could always just leave them there to provide nutrients to the yard. Must be an amazing pile though!",
            "Perfect Malicious Compliance!",
            "I don't understand this...why not leave them where they fall as is the natural order? Dont you like lightning bugs?",
            "Mulch the leaves, excellent fertiliser and you don't put biodegradable stuff in plastic bags....",
            "I never understand having the leaves hauled off.  Why not get a vacuum shredder and use the shredded leaves for compost.  Or, get one of the DR attachments for your mower to shred everything down and then use it around the base of your trees.  Seems a waste of a freebie...",
            "Don't rake them. They break down and feed your lawn and other plants.",
            "This is the kinda story I like completely unnecessary effort expended to prove a point. Absolutely outstanding and thanks for the laugh on my lunch break",
            "Can I ask a dumb question?  What happens if you don't rake them for a season? Both biologically and legally I guess with an HOA or whatever you have that's discerning how you show off your piece of nature.",
            "Wait what? A Leaf. Collection. Company 🤔 That's a thing? \n\nThis must be an American thing. \n\nWe have a leaf distributor in the UK, it's called Wind.",
            "$1 take it or leaf it. \n\nSorry that was sappy. \n\nJust trying to branch out on jokes here. \n\nCan’t think of new ones so I guess I’ll ax around. \n\nWe’re all stumped. \n\nAlright I’m gonna split.",
            "Leaves are good for the environment.  When you rake them, you're destroying an ecosystem.",
            "Just let the leaves biodegrade.",
            "That's awesome,  but those leaves would do much more good as fertilizer for your yard and they also provide bedding and insulation for small woodland creatures.",
            "9m is pretty short since when?\nNeat story þo",
            "You should take the pic down so that no one at the company can use it against you. In fact, I would be wary of this entire post where you are admitting to intentionally violate the spirit of your agreement.\n\nI mean, its a great story, but I dont think its worth losing a service that you clearly depend on.",
            "[deleted]",
            "Why do you put so much pointless effort and money into getting rid of leaves? Just leave them on the ground, they'll disappear on their own without you having to do anything. And even there's some left over in the spring, that's OK. It doesn't really matter.",
            "Why are people still getting rid of their leaves?",
            " Picture or it ain’t true 😼",
            "Why not mow them I put my mowing on a big opening and go to town. Helps the lawn for next year and you don't pay for pickup and easier then raking its a win win win",
            "Next year, invest in a mulching mower if you don't already have one. Instead of taking them up, go over them with the mower and you have instant fertilizer for your lawn next year. Better looking lawn and no leaf removal service to deal wit",
            "why aren't you mulching these?  This just seems stupid to have a truck haul them away.",
            "weird, my city picks them up for free, I mulch though.",
            "Imagine spending hours of your life and additional money to own a company that you are also already paying a subscription to. \n\nYou really showed them.",
            "All this effort, when you could have just left the leaves on the ground.",
            "A compost pile would fix all these problems, save some time and help fertilize your yard. Don't give away that brown gold.",
            "Just stop killing your lawn, and leave the leaves",
            "You do realise that fallen leaves are natural and help to create an environment that allows insects to thrive, and therefore birds will thrive? When they rot down they give nutrients back into the soil, allowing more plants to grow, which allows more insects and birds.",
            "For having 2 sugar maples, that's a lot of oak leaves.",
            "Got to be honest, it sounds like this was more self-malicious than anything else.\n\nAnd it also doesn't sound like you complied with their rules, either.",
            "Holy fuck just bag your own leaves it takes an hour and you don’t have to pay for a shitty service you complain about on Reddit.",
            "This is malicious but not compliant.",
            "Is that a dollar per leaf or a dollar per neighbor??",
            "You were quite lucky it was not windy and your pile stayed, well, piled up!",
            "The company already knows you're the guy with the giant pile.  They already have your address.  Lol.",
            "When you need cubic yards to measure the volume of leaves",
            "... where the hell do you live that wind doesn't exist?!",
            "[deleted]",
            "I read My son is 10 and 6’1” lol I was like DAMN that’s a tall kid",
            "I would leaf that service, too many rules.",
            "Leaf mountain.",
            "Pretty impressive. Let's leave it at that 😃",
            "I wonder if you have any snow collection stories along these lines also? Thanks OP, very entertaining!",
            "For a second, I thought you meant you payed a dollar per leaf.",
            "Leaf collection subscription? What kind of world is this?",
            "Absolutely brilliant I would of got leaves from all over town and had friends and family add their leaves to the pile at the same time just to be an AH",
            "what if it got windy that might have looked cool",
            "Where are you where they will take away a pile of loose leaves? Where I am leaves must be in trash cans and/or trash bags or they will not get picked up. The only thing that can be loose is branches/stumps and even then the branches have to be cut to a specific size or they won’t take them either",
            "Looks like mostly oak leaves in the photo.",
            "Leaf collection?? What in the America? We just have brown recycling bins and if you still have leafs to deal with then you'll need more brown bins",
            "Hard to imagine how the wind didn't wreak hell on your pile of dry-af leaves.",
            "Oh bravo OP. Magnificent.",
            "Holly Shit, it's massive!",
            "How did it not blow away?",
            "This seems less like r/maliciouscompliance and more like r/prorevenge"
        ]
    },
    {
        "post_id": "rna9nr",
        "author": "dracaenagxx",
        "title": "You want us to work on Christmas eve? Sure we will \"work\".",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rna9nr/you_want_us_to_work_on_christmas_eve_sure_we_will/",
        "score": 13186,
        "num_comments": 384,
        "created_utc": 1640308020.0,
        "selftext": "\n\nDecember 24 and 31 has always been a non-working day in our country but just this year our president announced that it will be a “special working holiday” so it is still up to the company if they will have work on that day or not.\n\n \n\nWhen our company announced that we will have a full day of work on the 24th  the employees weren’t happy. We didn’t have work on that day even before the oldest employee in the company have started working (working for the company for 40+ years already) and most employees already had plans set up for that day.\n\n \n\nAfter back and forth meetings with the union, the company finally gave in and agreed to have only a half day of work on the 24th. Employees are still not happy but we took that as a win.\n\n \n\nNow to the malicious compliance. Each department in our company can choose any day in December to celebrate their Christmas party. The party can last half a work day and the employees will still be compensated as long as the party is held in the office. So today is December 24 and we will all have our Christmas party. As agreed, department Christmas parties are company time so it will still be credited as us going to “work”. Merry Christmas!\n\n\nEdit: someone suggested I add this. Some of you have said that this is still a win for the company. I don't think it is because in the prior years most departments will not use the allowed half day Christmas party and would just do it after work or on weekends because parties here tend to be super loud (karaoke!!) but since we are forced to work this morning we all just decided to have a party now. Someone brought a portable karaoke and it is loud!\n\n\nAnother edit: the president I was talking about in the first paragraph is the president of the country. November 2, December 24 and 31 used to be a \"special non-working holiday\" meaning companies don't have work that day. For those who need to work that day they are entitled to an additional 30% of their basic rate. He suddenly changed it this year to a \"special working holiday\" so it's still a holiday but we need to go to work and we don't get the additional 30% pay just the basic rate. Pretty stupid if you ask me. Meanwhile the president I was talking about in the comments who joined our party is the president of our company, sorry for the confusion.",
        "permalink": "/r/MaliciousCompliance/comments/rna9nr/you_want_us_to_work_on_christmas_eve_sure_we_will/",
        "comments": [
            "This year my boyfriend's company decided to let everyone go home at midday on the 24th. He, like everyone, assumed this would mean just a couple hours work. Nope! He has to start at 6am (usually starts at 9) so they can squeeze every last second of time out of their employees",
            "Did C level management work on the 24th?",
            "[removed]",
            "One year a company I worked at decided the call center would be open on the Friday after Thanksgiving (US holiday on a Thursday) .   This is normally a 4-day holiday weekend.   Fortunately our local management knew what was coming.  2 folks early shift, 4 folks normal day shift, 2 folks closing.  (8am East Coast to 5pm West Coast coverage).   We took a total of 5 calls that day.   Every single one was someone who expected to leave a message or wanted information available in our automated system.   \"For product line X, touch 1....for model xyz, touch 2...recording of one us reading a data sheet\"  (Pre web)  \n\n\nSo what did we do all day long.   We played team FPS (first person shooter) games.   The one manager would keep an eye on the queue, when a call came in he'd call out \"Pause the game!   Call for {name}\"  He made sure if we had taken a call, we didn't have to take the next another.   Why?   Because it was multiplayer and we were shouting at each other for moves, yelling profanity when we got killed, etc.",
            "I'm a contractor, and we don't get invited to my employers Xmas party.\n\nOTOH, I saved up 3 weeks vacation and damn straight im gonna use it now",
            "I worked for a company that asked us to work christmas eve one year. All the machines were shutdown for repair and maintenance, so there wasn't anything much we could do.  \nI got my team to do some cursory final clean ups, then we sat around audibly talking about our christmas plans for a couple hours. Then I sent everyone home and sat at my desk for however many hours waiting for the CEO to leave. Stupid waste of everyone's time. Wouldn't have had to pay everyone if they let everyone take leave as planned.",
            "When I read “special working holiday” I instantly knew you were from the Philippines lol. Making the 24th and 31st special working holidays is still one of the dumbest things our inept excuse of a President has done during this pandemic, and he’s done *a lot* of dumb things.",
            "Sounds like the president actually got what he wanted. He asked for a full work day knowing the union would settle for half (but seriously, how does a union not push back on this to keep the 24th fully off?). Now you have the party on the 24th instead of earlier in the week and everyone works the full days prior to the 24th.",
            "It continues to amaze me the cold blooded way humans are treated at work after the shitshow of life in a pandemic. The management could have actually treated the staff w gratitude. Nope, come in even though you never have before because…..well because we are the very 😈",
            "I’ve only seen the term “special non-working holiday” used here. So, PH?",
            "Wow\n\n..used to work Thanksgiving day and all day Christmas eve until 7pm. Advice? Don't work retail.",
            "This doesn't sound like malicious compliance, but instead exactly the intended outcome. They still get a full extra work day out of you, since instead of taking the half day on another date, it's on Christmas Eve.",
            "Sounds like management needs to be visited by a few spirits...",
            "I'm surprised your company has a union. As we're both from the Philippines, you know that unions here are very much frowned upon. Context for non-Filipinos, unions here are allegedly part of the communist insurgency i.e. government red-tagging legit labor groups.\n\nGood on you for pulling this off. Parang tanga kasing may pasok pa ng 24. Pero holiday pa rin naman last Dec 8? Parang mas tanggap kong Dec 8 na lang sana special working day than 24 pa ginawang ganun.",
            "My father had an office job that was a long commute. He was not into parties but they would make him come in just to have an office party Christmas Eve morning. He would then have the long drive home just annoyed over the whole thing but he wanted to be the loyal employee. When he was 62 they shut down his whole department. He was bitter as he hoped to stay longer. He told me to never be loyal to a company.",
            "I've always looked at Thanksgiving and Christmas like this in the work place: \n\nAre you paying me for a day off? Yes? Cool, I'll come in and work a whole day and get paid double time. \n\nYou're not paying me for either of those days unless I come into work? Sorry mate, I'm sleeping in and laying around.",
            "I've worked in medical office settings and don't understand half days on Christmas Eve.",
            "This is still a win for the company.  By the sounds of it, you were getting the 1/2 day party anyway, and they were going to pay you for it.  They probably think it is better for them you take the party on the holiday or a weekend, and they succeeded.",
            "So, they took away your xmas party and made you all come in on your day off to have it?",
            "I’m not quite understanding the President’s intentions here. \n\nThey’ve designated the day as a “Special Working Holiday”, but you still need to go to work, and don’t get paid extra.\n\n**How is that different to any other working day?**",
            "Duterte would have to be one of the lowest levels of scum shit to walk the face of the earth. \nDon’t follow the politics too closely in your neck of the woods, but this mad man has so much innocent blood on his hands it just boggles my mind.",
            "I'm curious, is your president -30?",
            "In the Air Force the base commander is allowed to give everyone a half day but not a full day off. Every year the final working day is celebrated with each squadron’s (department) Christmas party with a “Champagne Breakfast” then head off at midday",
            "So instead of an office party disrupting half of what would normally be a full day of work, they got you all to move it to what would normally be a day off? Are you sure you're the winners in this situation?",
            "Ive only ever worked in a hospital, so holidays are kind of strange to me.",
            "> non-working day\n\n> “special working holiday”\n\n> karaoke\n\n100% The Philippines. Kamusta ka!",
            "Is the president you mentioned Rodrigo Duterte?",
            "🎵 we're gonna fight, for your right, to paaaaaaaaaaarty 🎵",
            "My work scheduled me to go in at 4:30 AM Christmas Eve. After working until 7PM the night before.\n\nI've had 3 hours of sleep and I'm leaving for work in 30 minutes.\n\nI already told them straight up I'm going to be tired as fuck, there is NO reason to have me there that early, and they are not going to get me at the top of my game. I will be purely in survival mode.",
            "Why is it whenever one of these posts from a different country comes up the OP doesn't just say the name of the freakin country?!? \n\nYou're not going to DOXX India or France guys you don't have to hide a country of millions.",
            "Nice. I knew a restaurant owner that had a union staff. A couple weeks out he told his employees that he would close the restaurant Christmas Eve and they filed a grievance on him. They said if you close the restaurant you still have to pay us for the day. He said if I gotta pay you then you might as well be at work then. Then they were pissed because they were open on Christmas Eve.",
            "r/antiwork",
            "Medyo gago talaga yung 24 and 31 brad. Puta banko pa ako kaya wala talaga, pasok kung pasok",
            "I work for a trucking company, so there is always the people that want things shipped so that they can be moving or delivered right after the holiday.  Same for the 31st.  However, it has been on all the customer service email signatures that last pickups will be scheduled for no later than 1400 those days.\n\nHowever, having worked on the dock in the past, there is always that one customer that strings out the loading, trying to get the last bit of freight out the door.  Does not matter that the freight has to get back to our warehouse, unloaded, sorted, and reloaded.  Their employees get to enjoy Christmas and New Years eve, screw anyone further down the chain.  Has not happened to me, but I have heard stories of freight getting back late enough that the dock staff were still at it when the time came on New Years.  Has obviously gotten better (hence the 1400 cutoff) but I do not doubt it happens elsewhere.",
            "Man... I would be pissed!  If my company pulled that \n\nI had a contractor call me today telling me that he'll be up working at one of my towers tomorrow (24th here in yesterday land).  I'm like nope... Told him he could work if he chooses to but I wouldn't be, and on call wouldn't be happy,  doubtfull on call would support him either for non-emergency. Contract company is new to working with us... It'd be one thing if I was on call chest deep in schitt creek flood with the water rising, and he was the on call for his company... But nope not an emergency, go home enjoy some rest my dude, this can wait till next week.",
            "Wait... your president decides when the people work?",
            "I told my subordinate that he couldn't leave early.  Then told him I was leaving early, and wouldn't be there to rat him out if he left early after me.",
            "Why not mention the name if the country?",
            "Obviously not smart enough to realize how the work ethics, speed and quality just dropped by 30% for the rest of the entire next year and a very year after that until the lesson is learned.  \n\n\nWhen the clients and customers find out how people are treated, they slowly find other suppliers.\n\n\nThe flag has been raised, it's time for every person affected to look for their next employment.\n\n\nAn early Congratulations on your new job!",
            "Our company announced that we would be working Christmas day, and in the same announcement stated that they were a 'family company' so I asked them if they would be there with us on Christmas ... embarrassed silence followed ... we did not work on Christmas.",
            "I love that. The company decided to squeeze an extra day of work out of you, and ended up just having to pay for you guys to party.  \n\nHowever, I'm worried that if your company would suddenly decide to have you guys work on Christmas and New Years eve, what's to stop them from also deciding that next year, company parties must be held outside of office hours.",
            "Why not just go out and say it -Duterte.\n\nhave fun redditors - search and see what other asshat tactics the guy was up to.\n\nFrom threatening to punch/slap volcanos/covid to publicly admitting to fingering his maid (BONUS - streaming a live video WHILE he is a sitting president of trying to reach the crotch areas of his maid during a birthday celebration)\n\n&#x200B;\n\n[https://newsinfo.inquirer.net/1412587/no-malice-duterte-trying-to-touch-housemaid-hes-just-being-playful-palace](https://newsinfo.inquirer.net/1412587/no-malice-duterte-trying-to-touch-housemaid-hes-just-being-playful-palace)\n\n&#x200B;\n\nYou are angry at your company and doing malicious compliance against your company? The company wasnt the one who stole millions in premium pay (for those working on 24/31) from workers all around the country at a time when such would have been needed the most/",
            "JOY to the wortld....!",
            "Merry christmas bud!! You enjoy it!",
            "Are you from the Philippines? Hahaha",
            "Cheers my fellow countryman! Luckily you still got half the day off. I'm still in the office at my job until 530. Still have to pick up food afterwards and traffic is crazy right now.",
            "Only 30% of your normal rate? Here it’s required to be time and a half, or 150% of your base pay.",
            "Last year our company's client decided \"screw you all\" and strictly encouraged us to work during Christmas Eve, with any requests for holiday leave being rejected\n\nFailure to go to work will be considered work avoidance and would lead to harsh penalties not just salary-wise, but also under compliance\n\nI don't wanna whistleblow under the risk of losing my job and being blacklisted from applying to other companies",
            "Im working on xmas eve right now. :(",
            "What’s the point of getting people on for a half day on 24th? Even without the Christmas party, nobody is doing any valuable work on that day.",
            "I think more malicious compliant would multiple Xmas parties of all departments in 1 week but on different days. So in the end a whole week gets lost, because nothing gets done between departments ;)",
            "Just from that first sentence, Imma say you’re Filipino lol",
            "OP are from ph? I’m typing this while finishing my shift lol",
            ">Employees are still not happy but we took that as a win.\n\na bit off topic, but that's how they always do it - overreach on their goals: if they don't face enough backlash, they won entirely. if there is enough, they just give up a bit. overall, you still lost and get used to that status quo. next time they try again and gain more ground.\n\nthat's how unpopular laws and regulations are established: piece by piece.",
            "Funny thing.  Since Christmas Day and New Year’s Day are on Saturdays this year, the official (USA) recognized holiday is the Friday before for each.",
            "ah yes, a fellow citizen from the country with the best president in the solar system.",
            "Hopefully right after the party you decided to kick the existing \"union\" leaders to the curb and vote in better ones that protect your rights.",
            "I was so annoyed when I read the anouncement, and felt bad for the people who don't can't take the day off. Which reminds me, where the fuck is the president today, he'd better be getting shit done for the people who lost everything.",
            "This is the Philippines.",
            "You make it sound like you decided to have he party on the 24th pretty much last minute. When were you going to have the Christmas party lol?",
            "I live in Canada and work in government no less and we're supposed to work Dec 24. Ridiculous.",
            "When exactly is your Christmas holiday, since Christmas is a SATURDAY. Unless this is a department store this is vile",
            "Yeah no, they won you lost. You should just not come in.",
            "What country? \n\nThe United States? If so, I'm pretty sure companies have their work calendars set for any particular 366 dates they choose, regardless of a presidential announcement regarding a Christian holiday that only some celebrate.\n\nIf it's another country, I'd be curious if there is a basically state religion, like Catholicism in Ireland, and if there are other religious holidays that have been generally controlled by the government for work.",
            "What is your country’s policy on holidays that fall on a weekend?  I ask, because this year the 25th falls on a Saturday, so the observed day off in the US is the 24th. \n\nMany places here also give the 24th off, but there is no standard for how it is applied in this case. I’m getting the Monday following  Christmas off, but some people got the 23rd off",
            "PH?",
            "What was the company? Scrooge & Marley Inc.?",
            "It's the 24th today and my partners working 7am to 4pm and has work boxing day.",
            "What field do you work in? And what does your company do?",
            "Where is this?",
            "December 31st always was a \"work day\" officially. And unless there was some kind of mess that needed to be corrected immediately, nobody did any work. It was everyone going to see decorations, exchanging gifts, tasting homemade cookies, drinking gifts and having long holiday lunches at work places. No alcohol policy was ignored on that day. \n\nThis year 31st is an official holiday. I suspect that only means 30th will now be unofficial unwork day. Especially with (forbidden) company party on 29th.",
            "Festivus for the rest of us !!",
            "No bosses at the party right?",
            "Better yet, eat you boss",
            "Philippines!!",
            "Philippines.",
            "👑",
            "Im from the Philippines. It’s the 24th and im here on my bed, on reddit and im ‘working’. I havent even opened my work laptop. Lol we are wfh",
            "I don't get why prrd made it a special working holiday. What is that even?",
            "On Christmas Eve I’m working till 11pm and then I’m right back to work Christmas morning at 7am 💀 i don’t even get adequate time to rest between shifts",
            "Some do some don't. It's always béen that way. Now, which country is it?",
            "If your workplace is unionized, how did this even become a thing if it isn’t in the collective agreement?",
            "Is this the Philippines ? The wording of the holidays and the karaoke bit  gave me hints.",
            "We got an email from our ceo a few years back (young company) that it wasn’t mandatory to give us the 24th and 31st of December off, however, because of our hard work they would give us half day off. All companies I was at before had those days off, and the wording of that email made me really pissed.",
            "But I’m sure the president (of the country) is working too!\n\nAnd not just on tax paid holiday with his family.\n\n(Or maybe he is working, because he hates being with his family during Christmas).",
            "I dont mind, getting paid an additional 8 hours of pay to stay home on my laptop for 4 hours and make sure nothing goes wrong.",
            "Most places I have worked tended to send people home around lunch or then the core work was done on the 24th or 31st but officially you went in for the whole day. If you booked the day off you would need to book a whole day rather than half.",
            "Let me guess, Philippines right? Shit labor laws plus Duterte is a bastard.\n\nThank god our company announced half day for today.",
            "Last year I was working on christmas eve. There was almost no one in the building but I didn't want to take the day off and use a holiday.\n\nAround noon one of the partners came around and told me to go home. Nice.\n\nNext pay I was docked a half day. Apparently having one of the co owners send me home doesn't qualify as a paid half day off. I wasn't to happy and the partner wouldn't back me up. I think he is scared of hr.",
            "Why didn’t you all just not show up on the 24th?",
            "Special working holiday!! So fun!! 😭\n\nLove how you guys handled it though :p",
            "Kid wouldn’t want to drop it.",
            "wait... you can't go home on holidays and still count this as win even when you are in union? ehh dude",
            "I thought Christmas Eve was a double time day everywhere I’ve ever worked but I have been in construction my whole life",
            "It'll be interesting to see if the company 'updates' its policy surrounding these Christmas parties...",
            "Guess I'm glad for what I get. Our 24th (as it falls this year) will be a \"work day\", but not really. We will do a little work, then we will eat good food & shoot the shit for the rest of the day. It will be a variety of brauts & stuff. With a mix of a beer or 2. I guess I'm the lucky one. With Christmas falling on Saturday, we wont get friday \"officially off\", but it will be laid back & grub on food. Guess I'm the lucky one because it will be a paid day. Hey, it could be a lot worse. Not that bad. I'm glad I work at a place where I dont hate my boss. It's alright, I can go to his desk for any big problems. No others \"magically\" got the day off either, they all played a part in the \"Christmas shindig\" too. My manager, just below the \"boss\" (the owner), runs the \"get it together\", and doesn't get enough credit, except from us because we see he is \"the glue\".",
            "A little late but why not. As someone who is right now working on the 24th to do a half day I can confirm with the people wondering. Nothing is getting done. I went as far to prepare a couple things to email over to my boss so it looks like I'm doing something.",
            "This is ph right? I feel like this is ph",
            "Hello kabayan! I was so glad when my boss said we didn't have to work on the 24th and the 31st. New Year's Eve is especially painful since no work on the 30th then back again on the 31st",
            "After rummaging through your complies I confirmed we both live in the same country haha",
            "Is this the Philippines you are talking about? LOL",
            "Call in sick covid",
            "Go Philippines!",
            "Working till noon on those days is normal in Germany. Some companies do a companywide holiday around those days and are closed still. \n\nThe 25., 26. And 1.1. Are nationwide holidays though.",
            "No it’s still a win for the company since you’re still doing work for “half” a day.",
            "\"special \" working  holiday?  WTF?",
            "Tell em about 13th month n watch usa workers loose their minds",
            "Pinoy ka no",
            "You forgot something, they get it!",
            "Is this 🇵🇭?? 😂\n\nSimilar dilemma. In the end, we all filed vacation leaves. No workers = closed office.",
            "Pilipinas yata to",
            "Without reading other comments, I’d guess Philippines based off the comments about parties. Filipinos know how to have a good time!! \n\nOh, and I love this story!",
            "I hope you all photocopy your butts at the Christmas party, for petty revenge material as well",
            "Working holiday without holiday pay? Nice one Mr president",
            "It’s crazy that a President can just make (or remove) a law without it going through voting by a representative group of people.",
            "Prime Luol Deng would be the best Christmas.",
            "Yup. That president can't even go to work on time.",
            "What country?",
            "Is this México? Nov. 2 hints me",
            "As someone who worked for a rental car agency the days before a holiday were always the most miserable days at work of the year. I never had off until i switched jobs.",
            "this seems like it was from The Office.\n\nglad yall got a christmas party out of it,\n\nMeredith got too drunk",
            "I’m in a similar boat. We typically work Christmas Eve if it’s a normal workday. We’ve been working four 10 hour days since Covid (for social distancing purposes we have three rotating schedules) so we are working today. It’s frustrating though because our work has been incredibly low for months now and of course this week it picks back up. We’re all exhausted from this so it would’ve been a (well deserved) treat.",
            "On my lunch break at my job. Have to be back on Sunday. Merry Christmas",
            "[deleted]",
            "So, are you working 2 hours or none? Assuming an 8 hour work day- union got it down to a 1/2 day and Christmas parties are a 1/2 a work day...",
            "Been working for a long time. Never gotten Christmas eve off before. But I never actually work that day. Lmao",
            "taena kasi ni duterte",
            "is that duterts",
            "When a president can just decree stuff like that, they're called dictators.",
            "How'd the PARTY go? 🥳",
            "🇵🇭",
            "ours actually went down on the 24th, instead of shutting down at 7am the 25th...  but new years they have shifted it from down on the first, to start on the first at 7pm...   lots of hung over people coming into work.",
            "Duterte and his crooked rules"
        ]
    },
    {
        "post_id": "xr4vxf",
        "author": "CarltheWellEndowed",
        "title": "No, that is not a company spot, that is my spot…",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/xr4vxf/no_that_is_not_a_company_spot_that_is_my_spot/",
        "score": 13187,
        "num_comments": 371,
        "created_utc": 1664449493.0,
        "selftext": "  When I started at my new company, we had used all assigned parking spots in the adjacent parking garage, and I was given a spot in a building a couple of blocks away. \n\nWhen I got in early one morning and had to be let in by security as the building was not yet unlocked, I talked with the security guard briefly, and this started a bit of a friendship. After a week or so he asked why I always came through the front door, instead of through the parking garage and I explained my situation. \n\nHe ended up giving me one of the extra spots that was assigned to the security staff. I was only allowed to park there Monday-Thursday as they needed the spot for cleaning crews on Friday. This spot is only about 20 feet from the pedestrian bridge to the building, so it is a pretty nice set-up. \n\nWe also have 2 company visitor spots in the same adjacent lot, however they are on the top floor (along with the rest of the spots assigned to our company), exposed to the sun, and require walking down three flights to get to the pedestrian bridge. \n\nWe have had a Senior Engineer visiting from a different office for the last two weeks, parking in the visitor’s spot. \n\nOn Tuesday we went to our cars together, and he saw where I was parked. \n\nWell when I got to work yesterday, he was already in my parking spot. I headed up to one of the visitor spots, and let him know that he needed to move his vehicle out of my spot, or his car might be towed (we are right downtown and have many people who park in this garage without permission). \n\nHe told me that it was fine, don’t worry about it, it was a company parking spot, and that could just stay in the visitor’s spot. \n\nI told him that I really did not think that was a good idea, and tried to explain, but he brushed me off. I followed up with an email letting him know that the spot was not leased by our company, but that I just had permission to park there until a spot opened in the garage.\n\nI parked in my assigned spot in the other parking garage (boss man does not like non-visitors parking in the visitor’s spot so I was not about to stay there) and didn’t worry about it, just like I was told.\n\nWell come lunch time, Senior Engineer comes storming back into the office. Apparently, Security Guard saw that the vehicle parked in my spot was not my shitty Civic, but rather a Tesla, and decided to have the vehicle towed. \n\nNot exactly sure what came of this, and I bet I will find out later today, but I am happy that I sent the CYA email as Senior Engineer outranks me by a considerable margin, and I do not need someone thinking that I left him high and dry out of spite. \n\n&#x200B;\n\nI should note that while we have spots assigned to our company, each vehicle gets assigned its own spot. Occasionally we will have people park in our assigned spots, and Security will call our office to confirm if this is someone we are allowing to park there, or if this is someone parking improperly. So if it had been a company spot, Senior Engineer's assumption would have been correct. \n\nWe got no such call, and Security Guard does not have my personal number.\n\nUPDATE:\n\nNot the satisfying update I was hoping for at all. \n\nApparently Senior Engineer called and complained to building management. He explained the situation, and it turns out that security did not have the authority to allow me to park in this spot. \n\nSounds like Security Guard got chewed out, and I am really hoping this did not impact his job...\n\nI lost my parking in the close garage. Boss man is not upset with me which is the only good thing about this.\n\nSenior Engineer was bitching to anyone who would listen. He is such a victim. \n\nNo idea who had to pay tow fees, but I am prerty confident that Senior Engineer did not.\n\nUPDATE 2:\n\nI was able to speak with Security Guard on my way to lunch today. \n\nApparently his boss did not chew him out, and I guess that was passed onto Senior Douchebag to appease him. \n\nYes Security Guard was told that he could not give out the spot, but that was it. He was quite surprised when I told him what I had heard.",
        "permalink": "/r/MaliciousCompliance/comments/xr4vxf/no_that_is_not_a_company_spot_that_is_my_spot/",
        "comments": [
            "This update is infuriating... This is why we can't have nice things, seriously. One idiot comes in and fucks things up without any sort of repercussion...",
            "I'd suggest buying the sec guard a pie or something to make up for this, it'll help.",
            "[deleted]",
            "Bring that security guard an I'm sorry cake or something similar. They were looking out for you and got burned. Do something nice in return.",
            "Literally a child: \n\n“I want that”\n\n“You can’t have that”\n\nGets angry, breaks thing",
            "I'm sad, sorry for your friend and for you getting repercussions by your boss.",
            "I have one like this. My company that I worked for got bought by a larger company.\n\nIt was just two of us the owner and me as the Linux/network guy. \n\nI get absorbed into the new company as the lead network eng. and he runs his same company but under the umbrella of the new company. Short story no one works for him anymore but he is still his own boss/ceo of that company company and can reach over and grab resources (ie me) from parent company.\n\nI work all night fixing an issue with a huge digiboard setup..yeah a long time back. I pulled an all nighter and never left that night and had parked up front by the door when no one was around. I was literally the only one at work all night into the next morning. In your minds eye see 300+ 56k modems hooked up to 8port digiboards as an incoming ISP setup and you kind of get a taste of what I was dealing with.\n\nAnyway, call goes out over the intercom that whoever is parked up front with the jeep has exactly 2 minutes to move it or the CFO is having it towed. \n\nYep that would be me. These spots are not locked to people, in fact the ones that are for the CEO and owner have their names painted on them. The CFO just parked in this spot every morning because they got their early before everyone else.\n\nI walk down, walk into the CFO office and say it is mine and I have been here all night and have not left. \n\nMove it or it gets towed. She says\n\nTouch my jeep and you will have my resignation letter in your hand before you can hook up to it. Maybe you should have them paint your name on the spot if you think it is yours. I will park in whatever spot is open!\n\nI was tired. I was hungry. I was bent. I did not move my jeep. \n\nShe lost her mind. There were meetings. She wanted my head. My old boss was In these meetings. He said he would take care of it and I would never park in the spot ever again he would make sure of it.\n\nShe had the temerity to come to my office and let me know personally. I was about to get sideways when my old boss walked in after her and said let’s goto lunch and she smiled.\n\nAt lunch he informed me never to park in her spot again. That because he was a tenant and owner of his business at the complex he got two spots and he indeed had one with his name on it. The next morning I had his second with my name on it. Two spaces closer to the door than hers made up ownership spot.\n\nTada! That guy knew how to work it. I learned a lot from him and I indeed never parked in her spot again and she had to walk past my name painted on a primo spot every morning.\n\nThis makes me smile just thinking about it and that was over 20 years ago.",
            "God. People fucking SUCK. You earn something nice by being a nice person, and some selfish fuck has gotta come knocking it down acting like they know everything. Now shits harder for everybody. God, what a worthless fuck.",
            "Wait he saw you parked somewhere and just decided it was his spot the next day? But as you said if it WAS a company spot then that means you would have been assigned to that spot and he just decided fuck you it's his spot now? What the fuck?",
            "What a fucking prick. Well, now you know more about this company's culture, and a lot more about that particular SE's sense of entitlement and disregard for fair play. I'm sorry about your security guard friend. Hope he's not in trouble.",
            "More details! He thinks he is better than other including you. Nice to see him knocked off his pedestal.",
            "In my personal experience with engineers, they tend to fall into two categories really nice people or total AH's. I think we all know which category this one falls into.",
            "You can't park there mate",
            "What a dick.  Doesn't listen and screws over both you and the kind security guy.  Do something nice for the security guy.  \n\nI encourage you to ask for a closer parking spot.",
            "> Not the satisfying update I was hoping for at all.\n\nDon't worry, as long as Senior Engineer keeps his personality unchanged, karma is going to get many more chances to get him.",
            "He may not be mad at you but he definitely got revenge against you. Everyone knows security doesn’t own a building and that the guard was sticking his neck out for you. \n\nOn the bright side, the guard probably doesn’t care about being chewed out. Security guards have the highest turnover of any job.",
            "This sucks, I would make it loudly known that señor engineer has cost you a good spot and thinks he is better than you.",
            "No good deed goes unpunished...\n\nMan, fuck the higher ups.",
            "What a prick, does whatever he feels like, bitches about the ramifications and now it cost you.\n\nNTA",
            "So he ruined the good thing for you, got your friend in trouble and didn’t have to pay. Fuck this guy.",
            "[This comment has been removed]",
            "Wonderful. I need an update on what a fit he threw.",
            "Wanker stole your spot. Got comeuppance. Beautiful.\n\nPlease update.",
            "Senior Engineer is a douche.",
            "Make sure you get something for the security guard as a thank you and apology for getting him in trouble…via your engineer “friend”",
            "I worked for this company for a few weeks as a temp, and the day before my first day I broke two bones in my right foot and ended up in a boot with crutches. \n\nI desperately needed the job so the next morning I arrived bright and early, only to find that employees had to park about 150 feet from the entrance. I had a purse and a notebook in a tote to carry and struggled to get to the door. About halfway there a nice man came out and took my tote and walked back with me to the building. He was the manager of the department I would be working in for the next few weeks. I explained what happened and he was fine, and said they would make accomodations for me. He recommended I get a handicapped placard but until I had the chance he told me to go ahead and park in one of the two handicapped spots right by the front door. \n\nUnfortunately I didn't work directly under him, but under Satan's Mistress. SM thought the department was her own little fiefdom and we her serfs. When the Manager took me in and introduced me to her, her exact words were \"if she can't go get me coffee she's useless to me.\"\n\nSM tried every way in the world to get me to quit that first day, but it was a good paying job that could go perm and I was hoping to stay, so I took it. When my day was over, SM stopped me as I was leaving and made me stand on crutches for another 15 minutes while she explained to me that she didn't give special favors or privileges to anyone. I assured her I was not asking for any when she finally stopped talking, then she decided to walk me out. \n\nAt lunch I had moved my car to one of the handicapped spaces so I only had a short walk there. When she saw where I was going she went on a tirade about me making assumptions and I needed to park in the employee lot like everyone else. \n\nI didn't realize I had walked into an intramural tug of war game that had been going on for months, and they went back and forth all the first week on where I could park. Finally home office said let me park in the handicapped spots until I was back on my feet. I thought that settled it. \n\nThe next Monday morning, I arrive and see that there is already a car in one of the two handicapped spaces. It was displaying the proper placard, as was mine at this point. I didn't think anything of it and went on in. At the end of the day SM asked me to walk out with her, asking me dumb questions as we walked. I wondered what her motive was, and I found out when she got into the other car with a placard. I didn't say anything but she laughed, grabbed the placard and said \"I have a handicapped...I work here. It's good to have friends who are doctors.\" Then she laughed and stuffed it under her seat before driving off. \n\nI decided at that moment I didn't want to work there anymore, went back inside, wrote a letter to the nice manager relating what had just happened, and why I had decided to end the contract, and left it on his desk. \n\nOne of the women I worked with was a friend of a friend, and she reached out to me a couple of days later to tell me SM got fired later that day for using a handicapped placard she didn't need to get a closer parking space she also didn't need.",
            "Definitely get an apology cake for the guard or something. It's not ur fault but it would be nice.",
            "Man what a shit head. He had to ruin a good setup and screw things up for the poor security guard.",
            "That update sucks and I hope you complain to the company too about your parking situation. Because you deserve to have a better spot.",
            "Ah, thats such a bummer. Can't stand entitled pricks not getting what they deserve.",
            "I’d buy security guy lunch as an apology",
            "There are few things, as a Project/Program Manager, that infuriate me more than an engineer, especially a senior engineer, who can't follow basic directions or written instructions.",
            "Now that is a man whose stapler you should lose",
            "Self inflicted idiot.\n\nYa shoot your self in the foot, don't complain about it hurting when you walk.",
            "Buy that guard a 12 pack or something to thank him for treating you like a human being. That engineer has never had too deal with repercussions for his actions ever in his life and will probably never have to until the electrical grid goes down, then you can have your satisfaction.",
            "Peak Tesla driver.",
            "I would hate to work with someone like this. Dude needs to be humbled, ASAP.",
            "Senior Engineer is why we can't have nice things.",
            "May Senior Engineer’s Tesla charge fail repeatedly",
            "I'd escalate the hell out of this internally and ruin the Senior Engineer.  I'm an Exec as a small company, this would put SE on my serious shit list",
            "Senior engineer is an entitled jerk",
            "I hate to say it, but you fucked up here. \n\nYou never should have let on about the handshake agreement but said something like “I was in a rush after running an errand and security said I could park there temporarily yesterday. You might get towed”\n\nYou ruined this for yourself, but now you know for next time.",
            "Give us an update in a few hours please, the fallout should be wonderful.",
            "I really hope you give us an update OP.",
            "Get the guard lunch or dinner.",
            "Sounds like someone thinks they are a hot shot. Fucking scum",
            "Wow he screwed over your friend. What a dick",
            "A higher up learned someone was getting *anything* for free, and that just won't do. I hate how many of us saw the end coming, we've been so conditioned.",
            "RE the update, that outcome sucks, OP.  Sorry it turned out that way.  Sweet deals like this always blow up in my face, too, to the point I just pass on them in favor of the annoying terrible reality of \"following the rules\".  I get a lot of crap over it, but my life is often simpler.  Many of the people who rib me the most get in the most grease.  But then, I'm a simple guy, hahaha.",
            "I don't know why people get so worked up over parking spaces.\n\nI worked at an accounting firm during co-op terms in university, and when my friend who parked in the building lot resigned, I asked if I would be able to park in her spot, as I was next in line in the farther lot to move over (2 years of non-continuous employment totalling 18 months). The office manager advised that since my contracts expire every term, I was technically the newest employee and therefore had no right to even ask for a spot on this side of the building, regardless of tenure or the physical mobility limitations I had at the time. I said \"okay\" and left it at that. \n\nDid it ruin the working relationship? Not entirely, but it definitely made leaving an easier decision knowing where they stood on my value.",
            "Wow, what a piece of work that guy is, I bet he thinks the world is just such a cold hard place instead of the reality that everyone hates him for his totally adjustable personality.  \n\nAnd that, kids, is what karma *really* is!",
            "It's not the OP's fault. But thus far this malicious compliance has not yet had a satisfying end.",
            "> ...but rather a Tesla...\n\nstoppedreadingrightthere.jpg",
            "You should not have said anything or wrote any e-mail.",
            "Aaahahahaha! >:D",
            "Typical senior engineer, who has seniority and money, is a prick. Shocking /s. \n\nPeople show their true character when they have some power, and by how they treat those under them.",
            "Fuck that guy!",
            "And it’s a Tesla too, which means it has eBreaks. Towing a car with eBrakes on usually end up damaged. He will probably have to pay to fix the car on top of the towing fee",
            "Yea that sucks. The guard was doing you a favor, someone else capitalizes on it and he'll not be in trouble.",
            "No good deed goes unpunished.  It’s so true.\n\n(The security guard did the good deed, and probably got in trouble)",
            "As someone who works on the facilities side of a building like yours, your update is the reason I do everything by the book. Trying to go the extra mile for my tenants has only resulted in headaches from our new management. But I do happily let all my tenants know that while I would be happy to assist them with this minor thing they are complaining about the new management does not want us accepting liability by helping so unfortunately I cannot help. Our new management company still hasn't figured out why before covid we went from ~80% occupancy to ~50%. I want to scream because you have hamstrung the people who keep your cash cows happy you stupid fucking morons, but like a professional I just smile and say gee golly wilikers I have no idea bossman",
            "Man, what a bummer! I was really rooting for you.",
            "This is why we can't have nice things.",
            "Poor security guard, they don’t respect his authorita!",
            "How to Lose Friends and Alienate People, by Entitled Senior Engineer.",
            "Enjoyed the story until the update.  Damn it, Janet, this is why we can't have nice things.  Someone always ruins it for everyone else.",
            "Meanwhile my hospital requires all staff to pay for parking just to go and do their jobs. I haven’t paid in months and still no ticket yet, probably because security and I are on friendly terms when we see each other on nightshift. Fuck health authorities and their paid staff parking shenanigans.",
            "This was one the best written, articulate articles I have ever read here.",
            "From what you say, the towing and parking spot aftermath would have happened without you even being there or knowing anything about it, like if you had taken the day off sick.\n\nYou did nothing here to alter the course of events that were already going to happen anyway, certainly not by maliciously following any order or rule.",
            "The update makes me really upset. I hope you at least cleared your name with the guard so he's not upset at you for getting him in trouble. What a jerk.",
            "What part of \"You are not authorized to take my parking spot no matter how senior you are\" is confusing for you bucko?",
            "Argh! Senior Engineer fucked it up for **everyone**",
            "Yanno I think they have those companies that will mail a pipe of dogshit to someone’s house…",
            "Should have just told him you were rolling the dice with being towed and he was taking the risk now. He didn’t need to know you had the hookup",
            "How is this compliance? Kinda sounds like the opposite because op went against the rules. All in all the real victim is the security guard trying to do a nice thing.",
            "ugh this is why we can't have nice things.\n\n&#x200B;\n\nThough, I've gone to work and there were no spots nearby... I park there anyway, behind the cars (relax, we work in a small kitchen and everyone knows where to find me) or I make a spot along the driveway somewhere. Bad enough I'm working in a kitchen with crippling sciatica, if they told me to move my car I'd tell them I'd be moving it to my driveway and to have a nice day. I suspect they know this.",
            "This is some compliance porn to get me started on the day",
            "This is not malicious compliance at all.",
            "We can’t win them all. Best to just try and forget about it and make sure senior engineer doesn’t hold any hard feelings towards you if you like your job.",
            "The dude sucks, but you should have kept your mouth shut and told the security guard it was fine that he was parked there. He was visiting, which means temporary, correct? So he would've been gone soon, and you'd still have your secret deal with security. And you should have assumed your deal was secret; when someone does you a kindness, don't do anything to rock the boat. It's like fight club man. We don't talk about it, we don't acknowledge that it exists and everything just moves along nicely.",
            "It's very unfortunate that you didn't inform the guard and let the senior engineer know you were doing him a favor. You blew it twice. This is facepalm material.",
            "The number of people using this post to whine about teslas is kind of pathetic.",
            "Where's the MC?",
            "The fact he drives a tesla already makes me hate him lmfao but the pathetic tantrum afterwards solidified that.",
            "Sounds like a super dumb parking situation, but are you the only person who has to park far away? Why does one person get special treatment? It seems like you fucked it up by calling attention to it, when you knew you were not supposed to have it.",
            "Whenever someone gets a title like \"Senior engineer\" that doesn't say anything about what they actually do, they turn into primadona",
            "You kinda fucked up. You should have lied and told the Engineer right off that you had been parking in a spot you know you shouldn't be, and you just haven't been caught yet. Next you should have immediately told the security guy that engineering douche parked there, because you had parked there. And that you told engineering douche \"It's not a company spot\", and you just hadn't been caught yet. Then let the engineer get towed, without recourse. Yes, you couldn't park there again without engineering douche raising a fuss, but you need to protect your peeps, and you didn't. Hearing this, I would never do you a solid like that, cause its clear you can't think your way out of a box.",
            "And what is the malicious compliance here?",
            "When your MC turns into TIFU. In the future when someone is visiting very temporarily, don't threaten them and start shit. Especially when they're much higher ranking. You're lucky you still have a job after starting shit with a visiting senior employee.",
            "Throw in a good word to nice guard to your boss, or buy him some chocolates/beets/flowers/whatevers. He's earned it, methinks.",
            "its always the lowest guy on the ladder who gets punished. no doubt from now on the security will do everything by the book, which will cause inconvenience's for you and your colleagues in the future.",
            "feel for you.",
            "Man. I worked for a company with an office in the city for a bit, and I worked third shift. The company provided a parking package, they loaded a debit card with pretty much the amount of a monthly spot in a garage across the street. Except it was out of open spaces when I started. It honestly didn't matter to me being on third shift. Street parking was free after like, 6pm or something, and I almost never had an issue getting a spot. If for some reason I did find myself needing to use a lot or something, I figured out I could use that debit card I had been issued. You could even use it to pay for tickets, I discovered lol. So I'd just use it to pay on the rare occasion I needed to, didn't think anything about it. I'd usually still have money left over, but I had been told it didn't roll over. Apparently that was not true. The cost for the space in the garage was like, idk, say $147, but we were given something like $155 a month, but again, told it didn't roll over. Someone found it it actually did, and after being there for a long time, had built up a bit on that card. They then used it to pay for parking in the city on their personal time. Someone important I guess found out and got all pissed, so from then on the policy was changed to just the company paying that garage directly somehow, no one got cards anymore, and I once ended up calling out because I couldn't find street parking and was not about to pay for my own fucking parking lol.\n\nEdit, for overnight parking in my pretty large city, on a weekend, which was usually the only time I'd have an issue with street parking, the absolute cheapest I could find was a really sketchy place that was NOT close to my office really, and was still like $40. I wasn't doing that lol. Had it been idk, less than $10 or something, I'd have just done it. But nope. All the lots in the city will do \"special event\" parking on weekends if a concert or sporting event was happening, solely so they could charge higher prices. It's a total racket. Everyone hates parking downtown lol. Funny though, we also actually got credits for a ride sharing app as a perk. I didn't use those often and easily could have done so. Could have driven home and then ordered the ride from there, even. That was actually gonna be the plan, I'd just let my boss know I'd be a little late. But once I got home, I was like nah, I'm not getting back out. Fuck it.",
            "No good deed goes unpunished.",
            "No duh security didn’t have the authority to let you park in their spots. Obvious outcome here.",
            "Ugh, what a piece of shit. Even if there were no assigned spots it’s a low key shitty thing to do to snag the spot you know someone else gets. Guy saw you parked in the spot, came in the next day thinking “lemme take the spot he had yesterday” Then to spend the whole day writing them off when they warn about it, only to have it blow up in the face of someone looking out for another. He knows what he’s doing, and that’s why he wrote you off, he figured you were upset over the spot a blowing smoke, because *he knew* what he did was shitty.\n\nThis guy was in for only a few days and managed to fuck over so many people before he was even on the clock. He’s engineering ways to be a shitty person I didn’t even know was possible. got there and before he’s even out of his car already set things in motion just from him being a test. Incredible.",
            "THIS IS WHY WE CAN'T HAVE NICE THINGS!",
            "I hope you're able to put in a good two cents for the security guard. Maybe he wasn't supposed to do it, but he was just being nice. He wasn't selling parking passes. Senior Engineer sounds like a real dick.",
            "Security guard needs a gift.",
            "Car brain people are funny.",
            "Senior Engineer is a self righteous toad!",
            "I worked in a position back in the mid-90's where we had government cars (GSA) assigned. We all had Plymouth Acclaims, and they were left parked in a gravel lot in downtown New Haven, CT. Apparently the cool thing to do at the time, was for kids to steal the cars, and wreck them to make the airbag deploy. My Acclaim had been wrecked 4 times, while the other one had been wrecked 3....I guess Acclaims were easy to hot wire. Anyway, we had been working with GSA to get parking for all of our vehicles, GS and personal, in the gated garage right across the street, and GSA finally approved paid parking, but only for the GS cars. As none of us wanted to leave our personal vehicles in the open lot, we figured out that we could scan our plastic parking pass at the automated gate to exit with our GS car, pull forward under the gate, then quickly back into the garage again, thereby logging our vehicle out of the garage. We then used the same pass to park our personal vehicles in the garage for free. I would imagine 2 decades later, this might not work anymore, but it worked pretty well back then.",
            "As a Security Guard myself, I knew exactly where this story was going when you started talking about ranks. He should’ve known he didn’t have the authority but I’m not surprised that he was thrown under the bus",
            "Sheldon? Is that you?",
            "I was terrified for Security Guard for second, good to hear his position is fine."
        ]
    },
    {
        "post_id": "dc5gn8",
        "author": "aigret",
        "title": "We’re replaceable and you’re happy to help us leave? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dc5gn8/were_replaceable_and_youre_happy_to_help_us_leave/",
        "score": 13183,
        "num_comments": 526,
        "created_utc": 1569991164.0,
        "selftext": "I used to work for a small, fee-for-service non-profit. The average number of clients served was/is around 250. The average caseload is 12 but can range from 10-20 per person (and may exceed 20 depending on circumstance). Non-management staff hover around 18-20 people. New staff aren’t really able to effectively use client authorized hours until several months in, so the org is reliant on senior staff to keep projected income up. This is relevant later. \n\nKeeping it as understandable as possible, one of the “perks” of being a senior staff member was receiving a personalized, facilitated plan for your goals. Once the plans were done individually, everyone who received one from all regions of the org came together as a group to discuss. This was meant to be an opportunity to share, support each other, and figure out next steps. Since our plans were mostly done around our goals at the company, we had an honest conversation about what we need to be successful. It wasn’t inappropriate in any way and many of the needs we brought up were already being met; it was honestly just a facilitated discussion around how to keep focused on advancing our career there. \n\nWell, one person from another region with more “weight” didn’t like how the day went so they complained to their manager (who is also a personal friend). That manager worked herself up about it, created a new story, and went straight to the assistant director. The assistant director is a VERY reactionary person and isn’t very well liked; most just avoid or placate her. \n\nEveryone in my region at the group meeting gets an email from AD saying we need to cancel all appointments and be in her office at a specified time the next day. Remember, we’re senior staff. That means five of us cancelled our client-based appointments to go into this mystery meeting, losing the company money. \n\nMeeting comes. We are sat down in front of all of the managers in our region and the AD. She launches into us with the following highlights: “how dare you use group time to provide feedback about the organization”, she’s so ashamed and doesn’t trust us to represent the company, informs us that we wasted $7,000 of the companies’ money, and that her toddlers behave better than us. She ends this five minute rant by saying that every one of us is replaceable, and they’d be happy if we left. We five sit in stunned silence before the meeting is “concluded” and we all walk out. \n\nTurns out the AD never spoke to the facilitator, didn’t consult any other attendees from other regions, in fact, didn’t bother getting any additional information at all. To add insult to injury, my boss (one of the managers in the room) told me the point of that meeting was to “make us feel shitty” when I asked what follow-up was needed from me. \n\nI found a job within two weeks and left. Two other people in that meeting quit within a month. A fourth is halfway out the door. Others found out about the meeting and so far four additional staff have left. All seven of us who quit (so far) had been there three years or more and our departures were no more than two months apart. Our total caseloads numbered roughly 120 clients, meaning that almost half of the organizations’ clients are without staff to support them and there are now five new hires without mentors. One of the new hires quit because of this, making 8 people gone in two months. This turnover has never happened before. \n\nI left behind three years of stellar client relationships and high performance/outcomes and took with me the knowledge on everything from mandatory trainings to the billing protocol. Yup, that’s right. I developed the billing protocol for the new database and no one had stepped up to learn it prior. Sucks to be you I guess.\n\nMoral of the story: if you tell staff they are replaceable, their answer will be so are you.",
        "permalink": "/r/MaliciousCompliance/comments/dc5gn8/were_replaceable_and_youre_happy_to_help_us_leave/",
        "comments": [
            "I feel this so hard. Our boss told us (13 nightshift nurses) at a meeting we could be replaced within a day, so we better obey her really substandard new plan for how to do our job. It involved less time with patients, less of the patients having a say about their own care, less of everything that actually works. She wouldn't let us even have a discussion or opinion.  So half of us left. \n*spoiler* \nWe could *not* be replaced, not even in months. Oops?",
            "Sure, everyone is replaceable, but the question should always be not \"Can I replace u/aigret?\", but \"Do I want to replace u/aigret?\"\n\nLooks like another classic case of management's \"The beatings will continue until morale improves\".",
            "I joined a 7 person company. On the basis of my work they gained about 150 employees. They thought of themselves as a telemarketing company, and that they made their money on the call center. In truth they had contracts of over 10 million dollars each with Fortune 500 companies, the only deliverable of which was some data, which only I knew how to produce out of the databases generated by the telemarketers. I warned them repeatedly that this made me overly vital to the company and they should let me train someone. They didn't listen. I warned them repeatedly that if I wasn't available to produce the data, they couldn't fulfill their contracts. They didn't listen. The owner hired a new boss who didn't like me because I didn't tap dance and sing \"everything's coming up roses\" quickly enough for her, so she got rid of me. (Literally one morning she came in and I was in the lobby working with the secretary's computer and I said \"good morning\" to her as she entered, and this launched her into a 45 minute screaming fit about how dare I say \"good morning\". No, I still don't understand.) They couldn't produce the data without me, so they couldn't fulfill any  of their contracts, so all their clients stopped paying, and they had to lay off most of the staff. Two months later they consisted only of the owner and one employee, the idiot who fired me. The boss deserved her.",
            "My employer is going through a big learning experience. They've decided to start cutting staffing costs. As minimum wage in my country has begun to increase, their raises have started to decrease with the intent to bring them in line with the new minimum wage in 2021. Whereas they once gave competitive wages in the industry, they've decided to join the race to the bottom, which they cannot win.  \n\nThis would be fine and dandy if we didn't all have different skillsets. Each of the jobs we do takes time to learn, and workloads have steadily increased to the point where those with more developed skillsets cannot train newer employees.\n\nWhen you have concentrated skillsets, long training times, and a staff only mostly fluent in English, it's usually a bad idea to get rid of incentives and competitive wages. With non-competitive wages for the industry, turnover will increase as hard workers find better pay and lazy workers find easier jobs.\n\nThe three most experienced staff on my shift (that includes me) are already going to leave within a year.",
            "This is what happens when management starts believing that they are the company, not the people who actually do the work.\n\nGood story - thanks for the write-up, and best of luck with your new gig.",
            "One of the things I learned early in life was to never issue ultimatums if you're not prepared to accept and deal with the consequences. No matter how angry I am, it's just not worth it. You need little people to do the little jobs; and it's the little bits and pieces that hold the corporate machine together. Management is the bottle of grease. Only a few drops are needed.",
            "They really really want us to be afraid all the time, don't they?",
            "Everyone is replaceable -- the question is how long will it take, and how much will it cost?  (ergo what's the actual viability)\n\nOffering a million a day to a load very experienced/motivated people may get you up and running again in the shortest possible time, but there's still that lead time (no one will be immediately effective) and will probably bankrupt you in the meantime.\n\nPeople make the company, not the other way round..  (and bad managers forget that)",
            "When I was 17 or so I worked at a grocery store. Boss told me to my face, word for word, \"You're dispensable. I can replace you \\*snaps fingers\\* like that.\" The next day I went in for my shift ten minutes early, told him I quit, and started to walk out. He got all flustered and whined about how it was going to be busy and he has to try and get my shift covered blah blah. I smiled and said \"You can replace me \\*snaps fingers\\* like that, you'll be fine.\" I know I was just a cashier and nothing at all special but it was very satisfying.",
            "I used to put in extra late hours at my last job.  Did extra work no one else wanted to do. Came in on holidays even though I was scheduled off and helped cover call outs. Requested a specific day off a month in advance for 4th of July. Was called that morning and told another employee was given it instead because they asked the day before and since my boss approved it before realizing, I just \"have to deal with it\". I went and, clearly not happy, and my boss immediately said, \"if you don't want to be here, I don't need you.\" Tossed that bitch the store keys and walked the fuck out. She had to open that day. And cover my closing shift. And open the next day.\n\nFuck you Linda.",
            "Report the manager to the board. This manager is clearly hurting this organization. If the board is at all competent they can force changes within the agency, including the removal of an incompetent manager (HOW this happen can definitely depend on where you live. I personally live in a Right to Work state that means you can be fired for literally anything. Even if the manager just doesn’t like you. Granted most places wouldn’t do that for fear of wrongful termination suit but still it’s technically legal).",
            "Assuming you're in contact with any of the people who *are* still there, how is the rapid loss going for the company?",
            "They took a giant, steaming shit all over their entire business based on hearsay. I wonder how that worked out in the long run..",
            "I would explicitly say in my exit interview that I'd be willing to be rehired at a modest raise when that person is gone, and leave them a resume with all the things you were the only expert on listed.",
            "Your job sounds very similar to my career as a mental health service coordinator. I recently left a mentor position for nearly the same reasons. Absolutely zero respect or appreciation from management and a “you’re replaceable” attitude. Half my team left within three months, leaving the most senior person on my team with about six months experience. For a field that has been around for a minute, you would think administrators would have realized by now that employees willing to stay in that profession for years AND consistently perform well are the ones you want to keep around.  ¯\\_(ツ)_/¯",
            "Management: you're replaceable  \nStaff: I quit  \nManagement: \\*surprised pikachu face\\*",
            "I can relate to this in a way.\n\nI worked for a large bank in the UK doing work several grades above my own grade responsibilities and the company refused to upgrade me or pay me appropriately, the discussion went on for about a year and a half.  Finally exasperated I said that I would leave if they didn't resolve the issue.\n\nThey said \"Go on then\"\n\nI found another job in two weeks, that paid more and had better benefits.\n\nTwo weeks after handing my notice in they offered me the upgrade (which was still lower paid than my new job)\n\nI walked. My new company agreed to let me hand my notice in the day after I got my yearly bonus too :-)",
            "I was at my previous job for 7 years, doing things no one realized I was doing because the director at the time handed her work off to me but then took all the credit (whatever, that was her department, I didn’t care). Anyhow, 6 years later they made me director because I refused to take the interim position and they didn’t have anyone else, but got pissed off because I demanded the position and long story short it was a year position only and I had to leave at the end of it. It’s been 2 years, they still don’t know what they’re doing and they haven’t been able to fill my position. I still get calls to this day. My former staff still ask me to come back. Unfortunately I have to play nice because they are a huge customer base at my new job, but I do think it’s quite funny that they never  knew what I did and so when I slid into the directors position no one noticed much of a difference because I just kept doing it.",
            "Well done\n\nMy main question is how do you guys leave a toxic work place....and get the references for a next job?",
            "sorry you had to deal with this. sounds about right for a non profit. i've worked for a couple of them, nepotism was rampant and management was completely incompetent. luckily it never affected me directly but i could see the handwriting on the wall in both cases and got out while i could.\n\ni'll never work for a nonprofit org again in my life, too many issues to take them seriously as a potential employer.\n\nalso,\n\n> losing the company money.\n\nwhen is it about making money? the nonprofits i've worked with were funded by grants and/or donations. any fees charged were to break even on the services offered. if it's about making money perhaps they need to lose their 501(c)(3) status.",
            "Worked for the chairman and ceo of a major US public company.  I had had it with the bullying from an SVP who was jealous of my position! Finally was \"poached\" by another company and told my boss I was leaving.  I told him they offered me $25k more than I was making  there which stunned him. He couldn't comprehend what was happening for about half an hour. He then told me to tell said SVP who was head of HR, yup..\nthat I had given my notice and she actually smiled. \nLong story short, I told my boss that a 10k increase would keep me there and he said no. That was 14 years ago... he's still struggling with loco assistants.",
            "So much knowledge lost. For me this has happened twice in 20 years. Valuable knowledge lost forever and now lack of it is acting like a multiplier on losses that take a long time to get rid of in the original host companies because they just didn't understand 1+1+1 at the time and decided to cut corners. I consider this a part of 'creative destruction'. Dumb bosses are an integral part of it.",
            "I had a manager that did this. I implemented the work to rule tactic. Things degraded very quickly leaving the manager to shoulder the blame. Manager deployed a written warning with 90 day countdown timer in front of HR. I formally challenged it and won.",
            "I went for an interview at a company where something similar happened. The hiring manager told me thy had just had a massive turnaround then went on to blame the employees. Lol. I didn’t take that job.",
            "Hell to the yes, good going for you and your colleagues!",
            "The fear monger is motivated by fear himself and, since it's such an effective motivator for him, he believes it to be the most effective tool at his disposal. When a superior tries to instill fear onto his subordinates, know that he is talking from a position of weakness.",
            "My old job laid off several people it felt were under performing, or overpaid, and I was one of the ones let go. In the 7 months since, they have had high turnover with the initial replacements quickly bailing, and they had to end up paying someone $15k a year more than me to do my job, and he is doing far less work. Apparently everyone keeps comparing him to me, saying \"Hellmark always got things done\". This past month, he was supposed to be doing the PCI audit work, and had nothing completed. A friend who still works there had to work all weekend to get things done before the Monday due date, in addition to fixing things the new guy broke.\n\nThey also lost several other people to the on going shit show, including a high profile hire that they did in November.",
            "The best leaders are keenly aware of the importance of smooth succession planning and leadership development. \n\nThe worst leaders demean and threaten. \n\nI've been in two positions where I've been dissatisfied, interviewed at other companies, gotten an offer, and THEN scheduled meetings with my then-current bosses to discuss my future in the current company.\n\nBoth times I heard loud and clear, \"we don't value you,\" so both times I've walked out of those meetings and immediately accepted the new positions.",
            "Managers: We do all the work! You're <i>lucky</i> to have a job here, slime!  \n\n\nEmployees:  \n\n\n<i>employees quit</i>  \n\n\nManagers: \\*Surprised pikachu face\\*\n\n&#x200B;\n\nI was young and dumb, worked at FYE in the height of the recession back in 2007-2009 while in college. The literal company policy was, \"If you ask for a raise, we will fire you, there are hundreds of people who want your job, and are willing to work for minimum wage, and with that so will you.\" I got 1 raise, for 4 cents, when it raised up Florida's minimum wage when federal went to $7.25, then they were shocked that I quit for being a cashier at best buy, instead of taking 3rd key. But 3rd key only came with a $1 raise, P/T (not F/T for me), no benefits, and being cashier was starting at $9.75 an hour.  \n\n\nIf anyone reads this comment, please don't let your job dictate your wage. If you want a reasonable wage increase and the boss says you should be lucky to work here...begin looking for something else. Please.",
            "Every time I’ve gotten the “you’re replaceable” speech I just quit on the spot. Last time it happened was right at the beginning of a shift at a job where I was 1 of 4 on the floor, and it happened right in front of a group of customers. I apologized to the customers for the inconvenience, turned to my manager and said “Good luck finding someone to replace me right now” and walked to the coffee shop next door. Then I texted my friends still working, and within 10 minutes 2 of them joined me. So now there’s only 1 floor employee and the manager. After about a half hour the manager came and asked us all to come back and apologized. To my surprise she seemed truly remorseful, but that still didn’t stop me from calling up the owner and putting in a formal complaint. Less than a week later *I* was the manager.",
            "I wonder how much money the company lost in billable hours holding the meeting about how terrible it was to lose 7k?",
            ">Moral of the story: if you tell staff they are replaceable, their answer will be so are you.\n\nThey hand out paychecks at nearly every business out there, your boss ain't your only option.",
            "> Moral of the story: if you tell staff they are replaceable, their answer will be so are you. \n\nThis right here is a very important thing to remember.",
            "The benefits of working in a job where seniority matters... nobody would say that in my building. \n\nCan you find a body to plunk into my classroom?  Yep. They won’t be adequate at the job for at least a year, 2-3 if they’re new. How bad will that screw up our test scores?",
            "I hope you sent word up, just past her, on the corporate ladder that you quit because of her.",
            "> Moral of the story: if you tell staff they are replaceable, their answer will be so are you.  \n\n'This is happening with you or without you'  \n\nThat was the golden message at the end of a meeting a couple of months ago. Well, four others have quit my company since then, and I should be following shortly.  \n\nThere's a certain type of person that I'm sure uses the 'I'm really important' card to get places in their career, and that's fine, but unless it's moderated with recognising when they come across people that absolutely do not give a monkeys who they think they are, it'll be the downfall of everyone",
            ">Moral of the story: if you tell staff they are replaceable, their answer will be so are you.\n\nIt felt so good to read that. I feel like I just had a massage.",
            "I've had the same job for ten years now. Every so often I clean out my cubical of anything that might need to be packed if I were to leave. It always grabs management's attention. There are two of us who, if we left, would absolutely cripple this entire product. We know it and management knows it. Never be afraid to flex on corporate nor afraid to let them know that you definitely have employment options. This company needs me so much more than I need it. Now fuck you, pay me.",
            "What line of work? Sorry just want to know what the \"cases\" are and what the \"clients\" are to understand the gravity of the walkout.",
            "Perfect response to horrible management.  Bravo.",
            "Hey that’s what we’re doing at my job! New boss told all of us we are replaceable half the staff left. More are halfway out the door. We can’t hire anyone!",
            "Not exactly replaceable, but my last job had layoffs and my number was up since I didn't have a full schedule of client billable work. Layoffs lowered morale, several other people jumped ship, the director was told to hire new people the week after he had to let people go, so he left as well. Now there's not really much in the way of senior staff, and several clients dropped because they liked the people that left.",
            "OP, do you know if there have been any consequences for AD?",
            "I would have upvoted simply for spelling \"losing\" correctly. I'm so sick of people getting that wrong.\n\nGreat story OP.",
            "its the perks I am telling you",
            "I worked for a nonprofit where 15 managers BEFORE ME had been replaced. I was #15 and before I was hired one of the current managers asked me to seriously think about being hired because if he could it again he would t work there- that should have BEEN A HUGE WARNING sign!! But no I needed a job and fast and I took it and lasted almost 2 years before I was told I was losing patients and my patients did not like me which was completely NOT TRUE! They hated the head supervisor of the program and obviously she had no idea how to run the program if there had been such high turnover of managers (15). But hey keep her in place and replace everyone else- makes complete sense. 🤦🏻‍♀️🤷🏻‍♀️",
            "I did a short post-grad business course a while ago, and one of the things we were told was along the lines of staff turnover is the single biggest avoidable cost in business. 99% of the time it's better to keep staff than replace them, and happy staff are nearly twice as productive as unhappy staff too.",
            "I love this so much! I feel sorry for the clients and hope they weren’t from a vulnerable group (though given it’s a NFP I assume they were) I know too many NFP’s that treat their staff who are working well over their allotted hours like totally shit & it’s great watching the government or the clients finally give the funding to a different company!",
            ">if you tell staff they are replaceable, their answer will be so are you.\n\nThis needs to be hanging on a wall somewhere.\n\nUnfortunately, a lot of companies don't know how to treat skilled workers.",
            "Shitty management can really make a difference. In my last job after my team leader changed and the manager (both were shitty) you could really see everything just crumbling down. People were unhappy all the time and one day 7 out of 15 left, including me.",
            "Even if you *can* replace your staff, it's probably not a good idea to try to do it all at once. Nor should you tell them as much.",
            "“You’re easily replaceable” is possibly the worst thing you can say to any of your employees. It just makes their work seem so incredibly worthless that they themselves don’t have a reason to look toward moving up. I’ve never experienced this firsthand, but I’ve had a couple of friends whose boss said this to them and they responded the exact same way: quitting on the spot.",
            "In the midst of a very dysfunctional merger between a Los Angeles and Silicon Valley company, when LA was in a slump and SV was booming, someone asked one of the execs from the LA side of things what they planned on doing about the mass exodus of SV engineers. We'd lost about 10% from layoffs and then an additional 30% over the next few months - recruiters were circling us like sharks.\n\nWe got a very serious look and an \"Only you can protect your job\".\n\nAnother dozen resumes went out that day.",
            "I had a manager at a gas station I worked at that told us we could be replaced when most of us had worked there for 2 or more years and she only got in about 4 months prior. Several people complained to HER boss and she was gone within the week. Don't assume you can insult the people who make the entire business function. It was because of a bunch of petty complaints like people taking sick days, using the bathroom, not starting our shifts 10 min early, actually being out the door when our shifts were done instead of leaving 20 minutes late (roughly how long it would take to finish up what we had to do), taking our ENTIRE breaks/lunch (she expected us to take 10 min on our 15 min breaks and 20 min on our 30 min lunch breaks), etc.",
            "This sounds like the company i used to work. In August at least 15 people left for various reasons. Some of them were the companys best workers, yet the plant manager told them they weren't all that valuable to the company. Thats what happens when the paperpushers are in change. They think the paper says it all.",
            "OP, we need a followup on what happened to this c\\_nt!",
            "\"Am I a McJob?\" -every bad boss",
            "I hope this doesn't get me into trouble.     \nWhy is it that the majority of these stories about really bad bosses refer to the boss as \"her\". I have noticed this on other sites as well (e.g. Not Always Working).",
            "are they hiring?",
            "Seems to me the real LVP was AD.",
            "they’re *NOTHING*!”\n\nSonic: “...ughhhh, meow?”",
            "Yes, staff is replaceable.\nBut so are jobs. :)",
            "Why didn't you go over the AD's head? Write a scathing memo to the board and everyone sign it. Get HER canned.",
            "So, what happened to the AD after a lot of you left?",
            "Good for you. I'd go a step further and tell them straight up that they caused this to happen, but the industry probably is tight so not advisable to burn bridges?",
            "And short term she'll probably get a bonus for all the money she'll be saving the company in salary this quarter.",
            "We got a new manager recently (previous manager is on maternity leave), and this new manager . . . Exemplifies why our organization struggles to hold onto talent.\n\nAnyone with any ambition and skill is neither given the opportunities, nor the official recognition (e.g. promotion) necessary to keep people in place.\n\nSince new manager came on in August, I've been non stop looking for work within our parent corporation.  I'm not the only one looking for work either.  Ah, well. Here's hoping I can move on quickly.",
            "Moral of the story - if you tell someone they’re replaceable, they’ll make sure your statement becomes reality even if that’s not really what you want, lol.",
            "And the sad truth is they replaced you and didn't blink an eye. Moral of the story your replaceable.",
            "My store manager said in a huddle we either had to get on board with the new program the company was pushing and if we didnt like it we should leave. That combined with the fact that this new program was aimed to standardise everything so much that if they fired a whole dept anyone could come in and pick up where we left immediately was enough to make ne start looking for a new job that night.  On top of all that they had the lowest pay for my position of any nearby company"
        ]
    },
    {
        "post_id": "cgrowb",
        "author": "Shadiekins",
        "title": "Customer service dictates that I'm more important than a child or common sense.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cgrowb/customer_service_dictates_that_im_more_important/",
        "score": 13186,
        "num_comments": 312,
        "created_utc": 1563883219.0,
        "selftext": "I work in a grocery store that includes a post office station. It's in the middle of a community and a lot of our customers are regulars. \n\nIt was a day just like any other and I was serving on the store side of things when the last customers in store came up; a woman and her granddaughter. \n\nWe were chatting away, granddaughter was showing me her most recent toy and grandmother was telling me what they were off to do that afternoon. As I was giving the change over a woman stormed past towards post office. Grandmother noticed, at this point, that we had some nice deals on an end facing the tills so she grabbed a pack quickly before they left (bearing in mind that I still hadn't said goodbye yet). \n\nI proceed to scan the item through for her when this other woman at the post office pipes up \"Excuse me!\" She exclaimed in a very rude tone \"I was here before them\". I responded that I'd be with her in a minute and that these customers were here before she came into the store. \n\nI was particularly pissed at the woman's attitude given the fact that she'd behaved in such a way, without real reason, I'm front of a sweet little 2 year old girl who is very impressionable at that age. Anyway, I scanned them through and said my goodbyes, waving and smiling as I always do. \n\nI then made my way to the post office where this woman, with a face like fizz, hit me with the line \"Customer service dictates that you serve me first if I'm here before them\". \n\nI calmly smiled and told her \"customer service also dictates that I can reserve the right to refuse service to anyone\". \n\nHer face dropped, still furious, she asks \"are you refusing to serve me, then?\"\n\nI looked her right in the eyes and said \"certainly seems that way\". \n\nGenuinely one of my favourite interactions with a rude customer to date.",
        "permalink": "/r/MaliciousCompliance/comments/cgrowb/customer_service_dictates_that_im_more_important/",
        "comments": [
            "Utterly delightful. I hope you didn't get in trouble for this.",
            "I hate customers with seemingly no grasp on time or the fact we can see them. I work in a buffet style pizza restaurant and there have been plenty of times where a customer will come up to us saying they've \"been waiting for 10 minutes\", not realising I can see them and I know for a fact they've been there for 30 seconds max.",
            "My son works at a ritzy hair place. The rich come up with $400 hair and pick up $200 in products. They stand there and play with their phones while my son repeatedly asks then to enter pins, sign stuff, tries to make them a next appointment and other questions. He thinks its funny when two show up and one in line comments about the line moving so slow.\n\n&#x200B;\n\nEdit for spelling",
            ">a face like fizz\n\nWut. What does this mean?",
            "You are the cashier I wish I could have been back when I worked in retail.  Mr. Rogers is proud of you!",
            "This seems more appropriate for r/pettyrevenge, not so much malicious compliance.",
            "Hahahahahaha",
            "The full saying is \"the customer is always right ABOUT WHAT THEY WANT\"\n\nYou're a house painter and they want all their rooms neon green with alternating neon pink and orange borders? If they're paying and not asking for anything illegal / wrong / technically unfeasible then they're right, no matter HOW bad you think it looks.\n\nOr you're a bartender and the customer wants pineapple juice, beer and Bailey's mixed together. Again, they've paid, they are certain and it doesn't seem impossible so you'd make it.\n\nBut somewhere along the line they saying got corrupted into \"Give the customer everything because money\"",
            "My kindergarten teacher:  Treat others as you would like to be treated.",
            "You always see those signs that say that peple reserve the right to refuse service, but its nice to see it actually being used in a nice way",
            "\"Law states I can deny service to anyone as long as I'm not discriminating against age, race, sexual orientation, or gender identity. Notice how attitude isn't part of that list?\"\n\nThis is something the floor manager said to a customer when I worked at Best Buy.",
            "Epic! Nice work!",
            "\"A face like fizz.\" Totally stealing that line!",
            "Outstanding. If more shops did that there would be fewer people so quick to be rude.",
            "This lady would have a bad day in my shop. Work at a bookies in the UK. It is first come first serve unless somebody is putting a time sensitive bet on. In that case, we take that slip before anybody waiting for a slow bet or a payout. Have had fun telling the few customers who don't get that exactly why they weren't served first.",
            "I'm imagining that woman with a *shocked Pikachu face*",
            "You didn't *reserve* the right, you *exercised* that right. You keep it in reserve, until it's needed.\n\nI was thinking I'd have responded to her \"Customer service dictates that...\" with \"Yes it does, and since *they were here before you,* I did just that.\" But your response was *so much better.*",
            "People dont seem to realize that they dont get customer service until they are actually  customer.   \n\"The customer is always right\" Yeah right out the door.",
            "1st Paragraph, Last Sentence. I think you meant our instead of out...",
            "Oh Lordy I would have been absolutely beheaded if I reacted to a customer like that at my last job. It’s genuinely left me to the point of antsy to answer the phone at the new place. \nThat manager is amazing, and your response is absolutely satisfying. So curt and to the point! 😌",
            "\"With a face like fizz\"  \n\n\nI love it.",
            "This put a smile on my face on a bad day. Perfect way to deal with an obnoxious person!",
            "This made me feel so good. Congratulations on teaching her a lesson.",
            "Clever and curt",
            "I'd be frustrated as a customer if the cashier spent a long time talking to a customer who was their friend, then the customer went and picked up another item from the store before checking out.\n\nI wouldn't complain, because I think complaining is rude in general, but I see where the frustration comes from.",
            "I'm very surprised she didn't do the classic Karen line of \"I want to speak to your manager/ supervisor.\" Or the \"But I'm pregnant!!!!!!!\"",
            "[deleted]",
            "Not malicious compliance, but I still like it! Maybe give it a post over in r/pettyrevenge",
            "If this was routine, there would be fewer rude customers.  Good for you.",
            "MY Hero!!!",
            "Love this!",
            "We have a pest at our work, came to an agreement with them that one of their parrents need to be in store for us to do any interactions with them.\n\nCame in the other day with out said rule, caused a storm (smacking counter in rage) got escorted away for not following the rules.\n\nROB & Karma do not quote this comment in your you tube story's.",
            "You, my good fellow, deserve the Nobel Prize",
            "How is this malicious compliance?",
            "This sounds like it happened in an episode of the Andy Griffith show, it's delightfully wholesome",
            "The customer is always the customer. That stuck with me.",
            "Glorious",
            "Justice chub",
            "YES!!!! You lived my DREAM!!!!",
            ">certainly seems that way\n\nDevastating. I love this. I love you",
            "That's one of my favourites.",
            "Misinformed that she was actually next in line.",
            "Ice cold!!! I love it !!!!",
            "Great story, can't see the malicious compliance though",
            "This is what gives a non sexual boner. I derived more pleasure from this than my hands could offer. That line \"certainly seems that way.\" God if that line was food, its be housed in a 5star retaurant with how good it was. Thank you for sticking it to her. You are doing good work OP.",
            "Where the hell do you live, that you can talk to a customer like that?\n\nYou pull that shit in the US and your unemployed, sued, or just assaulted/murdered.",
            "You said it was a small community.  Had you dealt with this woman before or after?",
            "The only important part of this story is *was* she actually before them or not. If I came before them I don't care if it's the Pope or a child, why is a child more important than a customer? I hate when people use their children as an excuse to cut in line or waste everyone else's time. I'm not saying this is what happened here, but this story is somehow weird: OP is focusing on how *nice* the child was and that's actually not important and that isn't your job. If I'm *waiting* in a line while you chat with a cute baby I'd be pissed, too. And there's literally nothing rude in saying 'excuse me I was here first' (implying that was the case).\n\nThis story sounds like justification of your own shitty behavior (omg she did it IN FRONT OF A TWO YEAR OLD and did you know they are impressionable at that age??? who gives a shit?). The only thing that matters is who came first and not wo got the baby. What if the woman also had a two year old impressionable baby? Would that matter?",
            "[removed]",
            "Epic",
            "Wouldn't she then say, \"I'll sue you and make sure you never work again!!!!\" Or \"I'm calling the police and telling them you assaulted me!!!!\"",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "wi1xsg",
        "author": "indigowulf",
        "title": "Shut my mouth and get out of your bar? ok!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wi1xsg/shut_my_mouth_and_get_out_of_your_bar_ok/",
        "score": 13183,
        "num_comments": 348,
        "created_utc": 1659830461.0,
        "selftext": "I used to work at a bar, as the only female security (They'd had some very bad things happen when a man followed a woman to the bathroom, so they needed a woman that could keep an eye on what happened in there).\n\nThis bar got in legal trouble all the time. The bathroom thing above, fire marshal closing them on some busy weekend nights for being way over capacity, the liquor board had pulled their license once already for overserving/serving minors with pretty obvious fake IDs. \n\nI was one of the new security hired to help resolve all this. It was so bad, we had to be trained by a government ATF person and get a card to prove we knew how to spot and stop overserves, and spot fake IDs. I think the real reason they hired us, was to have scapegoats on the ready for next time they did this.\n\nSo, I worked there a while, doing my best. The owners wife was the worst. She was always drunk, always had her friends in the bar and bent the rules for them. She thought she was Lady Jesus and we should all be kissing her feet, because she was the owners wife. I mostly stayed out of her way and had no issues, but many coworkers complained about her.\n\nOne night, some dude gets sick on the way to the bathroom, I cut him off, he ends up getting escorted out by his less drunk friends. I notice a man sitting at the bar watching this. He had creased slacks, a jacket indoors on a summer night, and no drink in his hand- at a busy meat-market dance club. I started watching him, and notice the badge under his jacket. Ah-ha! He was here to watch for overserving.\n\nA little later, a woman came to the bathroom, drunk enough to need to hold on the walls for dear life. I cut her off. She screams at me, then goes into the bathroom and tries to wash off the giant black Sharpee X's from the back of both hands. I warn her that she will be kicked out of the club if she continues. She screams again and staggers out of the bathroom.\n\nAbout 5 minutes later, owners wife is in my face, screaming. The woman I had cut off was one of her friends, attending a bachelorette party in the VIP section, and I was supposed to somehow magically know she was VIP. I was also apparently supposed to break the law for her because she was VIP. So, she and I start a screaming match, where I inform her that HER HUSBAND had hired me to make sure the law was followed. I also started to inform her about the police officer at the bar, but she screamed in my face to 'shut your mouth and get out of my bar'. She fired me on the spot. I didn't bother waiting to see if her husband agreed, it was known she wore the pants.\n\nI complied. I shut my mouth and got out of her bar. I walked past the cop, still sitting at the end of the bar near the bathrooms, where the screaming match had taken place. I made eye contact with him, gave a slight nod, to which he responded by looking at the boss's wife, rolling his eyes, and smiling at me as I left.\n\nThey got shut down that night for overserving the bachelorette party. This time, they went out of business because of too many strikes against them.",
        "permalink": "/r/MaliciousCompliance/comments/wi1xsg/shut_my_mouth_and_get_out_of_your_bar_ok/",
        "comments": [
            "Nice! Love the (not so) undercover cop witnessing her bullshit.",
            "My favorite part about this story was the guy sitting at the bar wearing a big foam hat that said \"NOT A COP\" lmao",
            "Sounds like the wife got what she wanted, you left. Then the cop took over.\n\nHopefully they never operated a bar again.",
            "Sounds like the night I saved my store a strike. We had cops hitting all the local places that sold liquor-the liquor store up the street, the asian restaurant next to that, Walmart, 7-11, ect. Our store was the only one that hadn’t been hit. For the first time in my years of working there I got to ID the cop and got the green card saying we’d survived a sting. I was so tired I almost couldn’t stop myself from saying “bro this obviously isn’t an ID”",
            "People finding out after fucking around is still the most delicious dish that you can be served.",
            "Good on you OP. There's a bar near me that only takes 5 minutes to walk to, but 45 minutes to walk home from. The difference is staggering.",
            "I was in the biz for 22 years.  Bartender for 15, and bar manager for 13.  *This story is glorious.*  With one owner, I had to scoop him off the floor and into a cab more times than I care to remember.  “PETER, YOUR NAME IS ON THE FUCKING LIQUOR LICENSE, ITS TIME TO GO.”\n\n Good on you, OP.\n\n\n*EDIT for those who are unfamiliar with the restaurant/bar industry: I was a waiter for seven years.  Then I became a bartender.  Two years into tending bar, I took on the added responsibilities of a bar manager while continuing to tend bar.*",
            "This makes me very happy. I'm glad you got them out of business by trying to do the right thing. I would honestly bet you saved some lives.",
            "man i gotta believe getting a nod as you walked out sealed the deal for the cop.  lady fkn hired someone to keep her business safe, and then fired them when they did.",
            "A good way to not last long as a business owner is ignoring various laws. The reason we have laws on overserving is to try and cut down on drunk drivers. The government can't completely ban all alcohol as we have tried in the past and failed. So we have laws to try and limit drunk drivers as they still cause a massive issue when it comes to late night crashes.",
            "Dky owner spouses think they run shit just because their spouse does, like \"bitch unless you sign my paycheck, you don't tell me to do shit\"",
            "Too late Bar Rescue????",
            "Wait why aren't the bar tenders also trained to know when to cut people off sounds like they expected way to much from bar security",
            "Damn, that was a nearly perfect example of laser-guided karma!",
            "Great job. They deserved it. You didn't.",
            "Great story, and well played.  Maybe I watch too many movies, but it reminds me of Al Pacino and Sean Penn at the end of Carlito’s Way, the part with you walking right by the cop and everything.",
            "Justice was served that night. Good for you!",
            "\"She thought she was Lady Jesus and we should all be kissing her feet, because she was the owners wife...\"\n\nIt's a Country Song...",
            "I hated working in restaurants that serve alcohol. Managers would override the decision to cut someone off because they didn't want to piss the customer off. One time I made the manager put a table under his number because he insisted on overserving. I wasn't going to be responsible for that shit.",
            "Stupid question from a naive 50 year old who always drank at home after finding out the first time I went into a bar that I can get an entire case of good beer for home with a LOT less risk of bad things happening for the same price as a night out.\n\nDo a lot of bar owners own bars SO they can drink and party? Or are most of them business people who don't mix? Or is it a mixed bag?",
            "Too bad. The husband was able to get a thriving bar (hard to get any business off the ground). And the wife ruins it. SMH.",
            "What was your next job? Did you do security somewhere else or get into another line of work?",
            "This was so cool, you are so cool in the mini movie I made in my head 🖤🖤🖤🖤",
            "Ah, love stories from bouncing. I started off in bars as a bouncer before progressing to bartending and what I learned there has paid big over the years. Though now I'm sure the local kids think I'm the fun police since I catch/take any fakes that come through my bar.",
            "Ahh that’s nice when someone’s there to shut it down after the wife screamed at you. I’m satisfied just reading this lol.",
            "At the public toilets in chania Crete, Greece, which are under the road next to the market, I was shocked that there a woman in the men's and a man in the women's toilets.when asked it was to stop the men following the women in there. And the woman in the men's to keep it clean and supply toilet paper.\n\nMen can be such pigs sometimes.",
            "r/prorevenge",
            "Justice boner achieved . LOL",
            "This is quite the deliciously devious beverage!",
            "this is a gold standard MC, bravo!!",
            "You know those \"military\" wifes/husbands that want to be treated like royalty! Im getting the same vibe here, glad you walked out that night",
            "As a former bouncer (and bartender and barback and DJ) at a few clubs, I really connected with your story. Thanks!",
            "This would be a dope post for r/antiwork",
            "Ha!  Serves (pun intended) that stupid haughty bitch right. I’m fairly sure her name is Karen too. Lol. \n\nFunny part is that repeated offenses of over serving and serving to minors can get a liquor license revoked, and from what I’ve heard, the owners name goes in a list when this happens, and it’s almost impossible  to get another one.",
            "This is glorious. I love every single post from this subreddit, it's pure satisfaction. Good job OP!",
            "Well played",
            "Damn. So my question is, did the owner ever call and ask you wtf happened? I mean he had to right??",
            "I guess it’s safe to say, Jon Taffer never got a chance to rescue this bar.",
            "OP, when did this take place and if you feel safe share share, what was the name of this joint..",
            "This belongs on r/convenientcop too!",
            "As a famous American cartoon character says, \"D'OH!\"",
            "Was the ower’s wife even allowed to fire you?",
            "L",
            "what a wierd system",
            "There was also a van in the parking lot with agents it had a sign that said flowers by Irene",
            "Wait, she's the owners wife. Did she even have the authority to fire you on the spot?",
            ">One night, some dude gets sick on the way to the bathroom, I cut him off, he ends up getting escorted out by his less drunk friends.\n\n>A little later, a woman came to the bathroom, drunk enough to need to hold on the walls for dear life. I cut her off. She screams at me, then goes into the bathroom \n\n\nCan you explain to me, why do you stop sick people needing to go to the bathroom? Im not sure I understand the logic...\n\nWhy not just wait for em to exit the bathroom? If I'm about to throw up, I can't imagine much things have a higher urgency then that.\n\n(I don't get drunk so its odd to me)",
            ">A little later, a woman came to the bathroom, drunk enough to need to hold on the walls for dear life. I cut her off. She screams at me, then goes into the bathroom and tries to wash off the giant black Sharpee X's from the back of both hands. I warn her that she will be kicked out of the club if she continues. She screams again and staggers out of the bathroom.\n\nSlightly confused here. Is there a rule about using the bathroom to clean your hands or something? Or are drunk people not allowed to piss or wash their hands? Sorry/thanks.",
            "Serves the drinks lol",
            "[removed]",
            "Did she have some legal standing (i.e. being \"assistant manager\") to make orders, or did you abandon your duty on orders of someone who had no right to order you at all?  \n\nBeing spouse doesn't automatically give her those rights...",
            "Ah, serves them right!",
            "This was great. Lol",
            "Good!  Sounds like they had it coming to them!",
            "Beautiful",
            "Well Done, OP!  \"Serves\" them right.\n\n(Sorry, couldn't help the pun.)",
            "1st time hearing about the over serving rule. It's good to control individuals who can't control themselves."
        ]
    },
    {
        "post_id": "bh5kzi",
        "author": "RareBlazes",
        "title": "Encourage me to make my own decisions? Okay, bye",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bh5kzi/encourage_me_to_make_my_own_decisions_okay_bye/",
        "score": 13177,
        "num_comments": 849,
        "created_utc": 1556175512.0,
        "selftext": "So for a little bit of pre context, I used to go to the Mormon church every Sunday. My mom is super religious, while I am not. This happened a few months ago. For whatever reason, Mormon church makes teenagers attend \"seminary\" and \"young men's\". Seminary is an hour lesson every morning before school (which is stupid) and young men's is an event every Wednesday night (or other day depending on the activity).\n\nBasically, I had to go to most seminary and young men events because of my mom. There's a bunch of things I disagree with what the church does, and I am mentally not in the church anymore. Quick example is that they take 10% of income as \"tithing\" which is, again stupid. Point is they also take up a lot of your free time, demanding you contribute and invading your personal space if you refuse.\n\nI was tasked with a project in seminary and organizing 3 events for young men's. Honestly, I planning a hiking trip and cross country skiing and whatnot. When I got really busy with school, I stopped going to seminary (as I wanted an extra hour of sleep). Guess what? The church pestered me and harassed me for not going to seminary.\n\"Oh it's sooo important!\"\nMy ass it's important.\n\nBlah blah blah, I didn't go to seminary and they continued to harass me. Come time, they start encouraging us to use our \"agency\". They made a whole 3 hour long service talking about Agency, and the importance of it. Agency, to my understanding, is the ability for an individual to make ones own decision to find out the truth. They started saying this as a motivator to be MORE active in church, and find stories that prove the church to be true, but I did the opposite.\n\nCue, malicious compliance.\n\nSo instead of researching about why the church is true, I found out about why it's a whole god damn corporate lie for money (basically). I used my \"agency\" to find the real truth about the church.\n\nFor my seminary project, I made a whole presentation about the negative aspects of the church, and why we need to be more careful with what's happening (r/exmormon I thank you) I talked about Joseph Smith and his 30 something wives (10 of which were underage), the hypocrisy in the church, and the the amount of suicides and whatnot that came of the church.\n\nThen, I left.\n\nThey didn't have anything else planned for Young Men's.\n\nThey invaded my house to try and get me to go back. They gave me calls to bring me back. It was pretty simple what I would say.\n\n\"I'm utilizing my agency. Please respect that.\"\n\nThey didn't have young men's for a month, because I wasn't there to organize anything else. Not only that, my presentation also encouraged other people (some of my acquaintances) to stop going to church too.\n\nIt may not seem like a big deal, but this is a big church and bringing it down as much as I can brings me joy, especially after all the pain it's caused me.\n\nI'm glad to say that I've gotten my hour of sleep back, and now my Sunday is free for watching Endgame.\n\nEd: thank you for the gold and silver!\n\nEd2: For clarification, Joseph Smith did NOT have 30 teenage wives. He only had 10 teenage wives, and a number of other wives, many already married to other men. (Thank you u/ajaxfetish for pointing this out\n\nLink to \"plural marriage\" from the LDS site itself:\n\nhttps://www.lds.org/study/history/topics/joseph-smith-and-plural-marriage?lang=eng\n\nLink to list of Joseph Smith's wives (may not be reliable):\n\nhttps://en.m.wikipedia.org/wiki/List_of_Joseph_Smith%27s_wives",
        "permalink": "/r/MaliciousCompliance/comments/bh5kzi/encourage_me_to_make_my_own_decisions_okay_bye/",
        "comments": [
            "What about your mom, how did she react to you leaving the church?",
            "The only way to get me to church is to pay me.\n\nNo, literally. I'm a freelance musician, and churches enjoy their music. And I enjoy being paid for doing something I enjoy.\n\nI used to be religious, grew up Catholic. Got confirmed and all that jazz. \nSince I left (10 years ago), my mental health has never been better.",
            "Good on you, and happy to hear about that.\n\nNow, you could maliciously comply with their demands to come back, and organise a young men's session dedicated to fact checking the church and getting information on how to identify toxic cult behaviour.\n\nI'm sure they will be thrilled to have you back.\n\nTell them you are actually ready to do such presentation every time they bring you back to the church, that you would be thrilled to comply.",
            "Church: You need to be more motivated.\n\nYou: I'm motivated to leave and so should everyone around me.\n\nChurch:  Surprised_Pikachu.jpg",
            "Happy cake day, and fuck Mormons. They're as bad a Jehovah's Witnesses. I mean, if you're going to run a religious cult, do it properly, like the Amish, or Scientology.",
            "You gave an entire presentation on the horrors of their church and they're still asking you to come back?",
            "I was much in the same boat as OP, born into the church,  but left as soon as I was old enough because I never believed it. In order to truly get them to leave you alone,  you have to legally have yourself removed from church records. \n\nThere is a lawyer in Utah that does this pro bono.\nhttps://quitmormon.com/\nFor anyone who needs it.",
            "Whats shocking to me is that they actually tried to make you come back.  Silly persons.",
            "This has to be the best malicious compliance post I’ve ever read.  Well done.",
            "I found out recently how creepy the Mormon church is when you leave it. A childhood friend of mine stopped going to church when she went off to college in a different city (and had the agency [har] to not have to go anymore), and they sent someone to FIND HER on campus (like, walking to class), and asked her why she had stopped going to church. Multiple times. So goddamned creepy. I was in utter disbelief when she told me the story. I think she eventually had to yell at them to leave her alone.\n\nCongrats on your free time gained, OP.",
            "I remember having to go to young men's or seminary with my family when my dad was out of town. It was like showing up to class in the middle of the year. I had no idea what they were talking about or what page they left on.\n\nWhen we moved they came looking for me at my new house. \n\nP.S. - Im not a big fan of the church and their practices, but please be nice to the missionaries. Leaving your family for a couple years and having no contact with them is rough.\n\nPlus showing them that non/ex Mormon people are still good people sometimes helps them make the decision to leave.",
            "I was raised JW until my middle teens so I can appreciate giving a fucked up church the middle finger.",
            "The church wants 10 percent tithing?\n\nSure. After I pay my bills, mortgage, meet my savings and retirement targets, and have the correct amount of expendable income allocated - to pay for stuff like clothes and lawn fertilizer, they can have 10 percent of whatever is left each month.",
            "My ex husband cheated on me with a Morman. She wouldn't drink coffee or even Pepsi because caffeine was \"against her religion\" but she apparently had no issue cheating on her husband with my husband. Um, ok.",
            "What i find the worst is those boys sent on pilgrimage...\n\nThey ended up alone, trying to talk about their church to people who would change sidewalk by seing them... I ended up having a nice talk about the weather and what not and i swear to god one of them was almost crying, just because finally someone treated him like a human being. I've seen him for weeks at that point, most of the time at my job so i could talk much \\^\\^'\n\nI only wish him the best from now on!",
            "I had quite a few Mormon friends growing up. They went to the morning classes every day and the young adult activities on Wednesdays. While some of them aren't Mormon anymore, most still don't drink cola, which I find kind of funny. Of all the things that you take away from being Mormon is that you won't drink soda.",
            "You’re a fucking hero. I am not a member anymore - but I’m terrified to tell my parents. 😅 I’m pretty sure they’ll disown me.",
            "Wow! I didn’t know how similar to the Jehovah’s Witnesses the Mormons are. One big difference is that they discourage you to do any research about their religion unless it’s using their publications. They say “Make the truth your own” but we know that they believe they’re the only truth. \n\nI’m impressed that you had the courage to confront their bullshit in a rational manner and using facts. How are you today? How is your relationship with your mum?",
            "When I did early morning seminary we watched a church produced video that stated that \"Free agency is not the will to do what you want but the will to do as you ought\"...\n\n\nSo I figured out then it was a con, still took 16 more years to actually leave.",
            "I’m an ex-convert, and I applaud you. Way to go, thank you for spreading truth.",
            "I used to be Mormon too. I left the church cause of the people in my ward. I was super religious up until about the end of my junior year. Then I had enough. I was always the quorum President. But the people in each quorum never wanted to participate in anything. And during young men’s, it was never stuff for merit badges and whatnot. It was always sports and talking about girls. I went to a different high school and so I was different. My whole family was. We weren’t “standard” Mormons. The YM only cared once I stopped going. Too late by then, cause we moved out of the ward and into another wards boundaries. Didn’t go to church. Much happier now.",
            "I also used to be Mormon and I stopped going to church after my mom and I got into an argument and she said she wasn't going to drive me to school anymore. Except she was actually driving me to seminary in the morning, then I walked the rest of the way.\n\nSo I just started riding with a friend and skipping seminary.\n\nShe and I drink booze and coffee together now instead. And she stopped going to that shitty cult. 👌",
            "Funny thing about tithing is it's supposed to be for the LEVITES, WIDOWS, POOR and REFUGEES.",
            "I'm surprised they didn't cut you off mid presentation",
            "I just want to say this, mate. Don't let your experiences with the church ruin your relationship with your mother, that's what happened to me. You'll regret it. If she distances herself, that's her problem, but you'll want to do what you can, within reason, to keep her in your life.",
            "I live in Salt Lake City.\n\nThis is beautiful.",
            "You deserve to watch Endgame after reading this. Congrats!",
            "Good on you. if I ever pulled a stunt like that, I'd be disowned",
            "I'm not religious either. Raised secular Jew. And was made to study and do Bar Mitzvah when I was 12-13. \n\n&#x200B;\n\nFor what it's worth however, every single Mormon I've ever met was the nicest person, EVER. And I know some might say Mormons are nice because they'll inevitably push you to join the church. No Mormon has ever even brought up their faith with me, let alone invite me to try it.",
            "Good on you for showing others what a cult Mormonism is. I'll accept most people to pursue their religious beliefs, after all believing there's a higher power doesn't immediately make you insane or an asshole, but not Mormonism. It is, from head to toe, a corrupt faith. Nearly as bad as Scientology, though I'll bet back in the day it was worse and that it has simply toned down a bit over the years.",
            "For anyone interested, Plamondon Comics has a comic series about Mormonism. It's called G.U.M. (Growing Up Mormon). I've always loved her content, and she's been getting harassed by some Mormons lately, so any support is welcome. You can [find her G.U.M. comics over here!](https://www.webtoons.com/en/challenge/gum/list?title_no=242177)",
            "Ex-Mormon here. I just want to let you know that it takes real courage to leave the church and rebel the way you did. Only other ex-mo's understand the mind control the church has on us and our families. Welcome to the Apostate club! We have coffee and show our porn shoulders.",
            "My wife's uncle met a girl, fell in love, got her pregnant. \n\nThe girlfriend then rejoined the mormon church just before she was about to give birth after taking a hiatus during her teens. I imagine there was some family pressure to get back in. Anyway, the church told my uncle that he had to marry his girlfriend, and join the church himself or they would take the kid and hide it from him/ would use every power they had to keep him from seeing his child.\n\nSo he joined. I've heard a lot of awful things about the church, and it seems an extremely stressful organisation to be around. I don't have any ill will towards other people's beliefs, but that church seems fucking evil and manipulative.\n\nEdit; glad OP has used some critical thinking to look at himself and what he believes.",
            "Damn in my day we called young mens/women, mutual instead.\n\nGood for your for leaving that shit behind. It caused me so many problems.\n\nAlso proud of you for spreading the truth so others can make the decision to leave.",
            "Well done on the MC. That was great!\n\nAny chance you'd be willing to make your seminary project available? I'd love to see it.",
            "Victory.",
            "Yoooo! Fellow exmo! Good for you!",
            "This is the best post that I have read in this sub. Well done and good luck to you mate. Your future just became a whole lot more palatable.",
            "as an exmormon myself, i wish i would’ve had the balls to do this as a teenager. good for you dude that’s fucking inspiring",
            "Not all heroes wear capes.\n\nGood for you!",
            "Awesome, man. My husband and some of my friends also quit the Mormon church. A new friend joined, though. :( At least most of the people are nice to each other, though. \n\nI like doing research papers for fun, and I've done one on Mormonism. Very interesting stuff. How anyone believes in it, is beyond me, though. Even just giving J.Smith a cursory look, it's clear he was  a con-man with disgusting fetishes, and a false sense of grandeur.\n\nGrats on leaving, and keep that Agency.",
            "Your engagement and use of your agency probably gave those who were just going along with it because of their parents the strength to leave as well.  Not everyone has the gall to step up to a powerful organization and even the smallest of rebellion against it can help turn others who have been thinking the same to act.  Great job.",
            "Nicely done. \n\nNote on tithing: \n\ndid you know, over 97% of tithing doesn't actually make it to God?\n\nAlso whenever I think about tithing, I recall an online comic where this guy says, \"I am a messenger from God\"\n\nAnd a group of people reply, \"what's God's message?\"\n\nAnd he says, \"Give God's messenger money.\"",
            "Faith is largely supposed to be a personal journey. The way most organized religion works goes directly against this.",
            "Oh my God this is the greatest thing ever. Kudos dude. The Mormon church is gross and for you to stand up and do a presentation about their corruption is fantastic. Hope you helped a lot of the youth to see what's really going on",
            "Do Mormons still wear magic underwear?",
            "You're a fucking hero for doing that at seminary. I've always been pretty private about leaving the church because I'm so scared of people I know judging me and my mom for raising a kid who left. Mad respect.",
            "The “Church” of Latter Day Saints is a business, not a religion. \n\nSource: am from Utah.",
            "Fellow ex-mo and apostate here! Proud of you!! As soon as you’re 18, use quitmormon.com to be rid of it for good. \n\nI got forced into a lot of stuff but I lived out in a really rural part and it was very hard for them to get me to seminary even if I wanted to (which I absolutely didn’t).",
            "Mormons: where kids are forced to attend years of \"religious\" school and still don't know a damned thing about their own church's theology.",
            "An interesting thing about religous belief is that people are typically evangelised into it or raised up that way; but getting out is a personal journey. You cannot un-evangelise someone out of their religion, it's almost always something that a person does for themselves.",
            "10% tithing isn't exclusively mormon, I think it's pretty standard. Although I still disagree with it.",
            "Congratulations on breaking free from one of the most annoying cults of the modern world. As someone who is currently married to an ex-JW, both of these sects are more dangerous than scientology, because people don't see them as cults. They isolate their members from the world and relatives, keep them dependent by gouging their income and forcing regular meetings to stop independent doubt. It's despicable.",
            "The brainwashing in religion is ludicrous. \n\nPreying on the uneducated should be outlawed.",
            ">god damn corporate lie\n \nThis is a perfect summary of the mormon church. \n \nMy dad's side of the family is oldschool mormon. Original settlers in many towns throughout New Mexico and Arizona. He and his 7 brothers and sisters were all raised to be good temple mormons. \n \nA couple years back my Uncle Mike died from complications to MS. My dad was the youngest and he had to give a speech at the service along with the remaining surviving brothers and sisters. I went because Mike was a genuinely great guy and literally everyone who ever met him loved the shit out of him. No joke there were people there who met him once several years before and came to say goodbye. \n \nMike was a complete G.\n \nAnyhow the service... Was holy shit levels of corporate. I have been to seminars on the importance of proper database schema use that were less impersonal. The pastor came on after every speaker and gave an update to the schedule, which never changed... and he was full on 'bueller.... bueller...' levels of stiff. \n \nMike deserved a better send-off, one with cheerleaders and fireworks and AC/DC turned up to 11.... But mormons gonna mormon.",
            "Here in Utah seminary takes place during the school day. They take a class period away from students and then don’t give them credit unless they complete all 4 years of it.",
            "Just curious, do you think all Christians churches are like that, or just some?",
            "Check out the CES letter, it's a very well researched and damning thesis about the mormon church.\n\nhttps://cesletter.org/",
            "I dislike them for super petty reasons. Years ago my friend lived in a mormon household (I didn't) and we both had a PS2 and would occasionally share games. I bought I forgot which mortal kombat that had just come out then and let him borrow it (he was hiding other things) aaaaand one day his aunt went through his room to \"clean\" and found the game and she got some higher up to come talk to him. Ther gut said he was taking the game to get rid of it and my friend said it was mine and the dude gave my friend 20 bucks and said I shouldn't have it either and that would reimburse me. I was livid.",
            "O\\_O Endgame is out. thanks for the info, I lost track, now i'm going to have to see it tonight.\n\n&#x200B;\n\nalso congrats on getting out.",
            "Tithing? What is this, the Middle Ages? 😂\n\nExcellent MC btw",
            "# NO FUCKING SPOILERS",
            "Congrats!  10% tax on your income, for a CHURCH???  That's not only bull shit, it should be illegal.",
            "You use quitmormon yet?",
            "Yeah, this is pretty much how I ended up researching the Catholic church and getting TFO when I was 16. That resulted in a discussion that ended with my mother screaming up the stairs at me \"u/Jyllidan, you were born a Catholic, you were baptised Catholic, and you'll be a Catholic until the day you *diiiiiiiiiiiiiiiiiiiie*!\"\n\nWhich, no. I'm not Catholic. And I definitely won't be Catholic at any point in the future. Sorry, mum.",
            "Well done for escaping the cult.",
            "Great job. Mormonism is a cult",
            "For true malicious compliance, \"repent\" just to get another audience with church members and lay into them again.\n\nThey're \"telling\" you to re-join, you're only following their wishes",
            "I’m glad you got out before I did. I got coerced into going on a mission which I stopped going to school to go on and I found it hard to pick school back up so I ended up quitting school too.",
            "My aunt and uncle are Mormon, and of their seven kids (see: Mormon), four have left the church.  I'm so proud of them. 8)",
            "Tow Mator kills Lightning McQueen in endgame post-credits\n\nOh no I spoiled the movie",
            "[deleted]",
            "*salutes Rare for his bravery*\n\nIt's always amazing how much religions claim to believe in free will & \"thinking for yourself\"....then get pissed off when you actually use it.",
            "good. do whatever is in your power to screw mormons over. i had a gf who's mom was mormon and I can't tell you how annoying she was, literally one of the worst persons i met in my whole life.",
            "r/stillamormon\nPlease don't hurt me\n/S",
            "Same opinion, except my parents won’t leave and are super religious. I’m stuck.",
            "That's some balls on you dude. I still can't bring myself to counter when my mormon friends and family bring up bullshit, I can only do it with strangers.",
            "Christopher Hitchens. Ur welcome",
            "Was there any truth to 'A Study in Scarlet' where the early Mormon church abducted settler women and murdered families to perpetuate the multiple wives per member requirements? Or was that a pure fabrication?",
            "Is tithing done automatically for members of Mormon churches or something? I understood it to be a voluntary process at least as far as collection proceedings go",
            "My mother told me that for all the time I spend researching anti church stuff I should listen to just as much church things. I'm ready to cut a deal next time any of my family tries to get me to go back.\n\n&#x200B;\n\nI'll Go, but in return, you must listen to me talk about why I don't believe in it anymore for just as long. Every bit of time you force on me, you owe me back.",
            "I'm Moreman. Whenever there's drugs around I say \"More, man!\"",
            "If you really wanna fuck things up for them more, that tithing shit they're doing is basically the Christian version of illegal. Tithing is an Old Testament concept that was rendered invalid with Christ's death on the cross. All the church can do is encourage tithing, they can't enforce it by any religious standards. I used to have a job captioning sermons, I've seen multiple preachers say exactly what I'm telling you.",
            ">For whatever reason, they make you attend this crap\n\nThe reason is they're a cult and it's a mind control technique",
            "Your doing Gods work.",
            "You should organize another young men’s event, and do something like play the South Park episode on Joseph Smith. I bet they would LOVE that agency!!!",
            "Fuck religion. Absolutely vile human creation",
            "You are great. Keep informing people.",
            "r/athiesm would appreciate",
            "Mad, mad props to you for getting yourself out of that crappy religion.",
            "Most churches have tithing but at most it isn't mandatory\n\nBut some churches not just Mormon make it mandatory...if you are a church member you pay",
            "You're amazing!! Loved reading this and good job",
            "Pretty impressive that they were that forgiving after your presentation that they still wanted you back.  Speaks well of their attitude I'd say.",
            "As someone who spent four years being indoctrinated in seminary, I applaud you!",
            "After have lived in SLC as a transplant. I applaud your efforts. The church is very insideous. Glad to have left the politics but miss the countryside there",
            "Just to be clear, the church doesn't _make_ you do anything. Your mom might, but the church doesn't.",
            "Personally, I don’t like the Morman Church either. With that said, please don’t let your bad experience with the Morman Church let you believe all types of churches treat people that way. \n\nI go to a non-denominational church and I really like it. I do tithe, but it’s because I want to, as the church I attend never ask us to. \n\nI think any church that forces you to do certain things in order for approval is probably not something most people want to sign up for. \n\nI guess I’m saying, there are good churches out there, but yes, they might be few and far between.",
            "And in the fall, you have Sundays free for watching football. \n\nAssuming you like that sort of thing.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/atheism] [Challenged a church.](https://www.reddit.com/r/atheism/comments/bh7f5c/challenged_a_church/)\n\n- [/r/exmormon] [Encourage me to make my own decisions? Okay, bye](https://www.reddit.com/r/exmormon/comments/bh888v/encourage_me_to_make_my_own_decisions_okay_bye/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "The cake is no lie. The church is a lie",
            "You did a Thanos to the church",
            "I love that you spoke truth to power, and that you exposed so many others to the truth who were swaddled in lies. You rock.",
            "Reddit loves it some Mormon-hating. Look, I'm not Mormon, never have been, but I grew up around a bunch of them. They're nice people, good morals, etc. You could find worse people to hang around.",
            "I was absolutely in love with a mormon boy all throughout school. Like ready to switch religions in love. Every time i learn more about the religion im a little happier it didnt work out.",
            "Welcome to the exmo club.  :) It's nice to vee away from that guilt and shame generating cult.",
            "This post pleased me greatly",
            "glad to know you were able to lead others out as well. your freedom just got better.",
            "Proud of you as a fellow Utahn.  Fuck the Mormon church, it’s a fucking oppression business in our state that controls everything.",
            "Good for getting out. They shouldn’t have had someone involved who wasn’t called to it. Perfect example. Personally I’ve found Steven Furtick a good talker who motivates me in the right way. Not sure denomination but it’s down to Earth.",
            "Better to succeed or fail by your own decisions than to listen to someone else's advice. You learn by your choices. Nobody knows you better than uuu.",
            "I grew up Mormon. Luckily my dad got too old to try and force the issue of seminary. He wanted more sleep too. Screw that shit.\n\nWhat kills me is that BYU call my dad asking for alumni donations. He did it, but I said he shouldn't. They can use some of the $60 BILLION they've got in the stock market.",
            "Bruh I hope no one spoils your endgame you deserve the full experience my man",
            "\"all organized religion is a scam.\" if you're not tithing, they're not interested.",
            "So proud of you for getting out of the cult!",
            "I somehow ended up on the list for one of the churches in Arlington, and every now and then I'll get texts from other girls who \"saw me on the list and realized \\[they\\] hadn't met \\[me\\] yet.\" They try to get me to go to their meetings or whatever, and I'm just like, \"Please remove me from this list, thanks.\" I don't want to be taught how to be a \"good wife\" to my husband. I do quite well on my own.",
            "BITFDWT fellow apostate. Reach out to any of us on r/exmormon if you need any help.",
            "I always wondered...(and I am seriously asking) do you get a receipt for donations (tithing) so you can claim them when you file for the IRS?",
            "That's awesome. I was never Mormon but I love seeing some of the happy posts from /r/exmormon on my feed",
            "lmao, props for getting out from those abusive and controlling crazies. \nThough I do wonder what they tell their flock about you? Do they just not talking about it.. ?\n\nEitherway, best wishes for the future!",
            "Good job OP. Mormons have long been a cult.",
            "Ferocious clapping",
            "when you say they were invading your house, did you mean they were just walking into your house? can you elaborate on this?",
            "Is it just me, or does this whole thing feel a little one-sided and a bit of cherry-picking?",
            "Ex mormon here. I would absolutely love to see that presentation.",
            "Wanna judge a \"church?\" Look to its source.",
            ">Joseph Smith and his 30 something teenage wives,\n\nA combination of pedophilia and polygamy at its finest",
            " Joseph Smith had a lot of wives, dum-dum-dum-dum-duum.",
            "What was the respone to the pressentation can you go into more detial,"
        ]
    },
    {
        "post_id": "129ruqy",
        "author": "Absurd-n-Nihilistic",
        "title": "Yet another new manager facing the consequences of their actions story.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/129ruqy/yet_another_new_manager_facing_the_consequences/",
        "score": 13166,
        "num_comments": 418,
        "created_utc": 1680456442.0,
        "selftext": "I’ll keep the details as vague as possible because I’m still with this organisation. I work for a government department. We have offices and locations all over the state. I’m based out of a city that’s about a two and a bit hour train ride to our head office. \n\nAt the time I was working in a team that had members working remotely all across the state, looking after policy, process, and quality assurance. Our old manager had gone and gotten himself promoted for being genuinely brilliant at his role. So our new manager, Steve, was hired in from the glorious world of banking, and he was here to whip us “lazy public servants into shape”.\n\nA few days after he began his role, he called us all to a teleconference to inform us he wanted all of us to be at the head office 8am, tomorrow morning for an all day in-person team meeting. He wanted to see us in “meat space”, to “size” us up, understand what we were doing, and see where we “weren’t keeping up with the private sector”. \n\nAs I mentioned, due to the nature of the work we were doing, we were all across the state. So in-person, whole team meetings were rare and if they occurred at all, they were booked weeks in advance. We were all adept at videoconferencing looonnnnngggg before COVID. \n\nSome of us tried to tell our new high-flyer manager that almost none of us were in the same city as him, and to be there on such short notice would mean travel expenses, meal allowances, overtime etc. He didn’t seem to care, and told us in no uncertain terms to “just be at head office tomorrow at 8am” before abruptly hanging up. \n\nNow, I should explain something. I’m one of a handful of union delegates in our department. I know our award back to front, specifically the sections dealing with travel, allowances, and overtime. So I engaged malicious compliance mode, if Steve wanted us there fine, but it’ll cost him.\n\nSo I quickly went about emailing my team what Steve had done by requiring us to be in the Head office at 8am and what to do. \n\nBecause we’d have to travel outside our normal work hours, our work day clock started ticking the moment we left our homes and only stopped once we got home.\n\nSome of our team travelled overnight, they were entitled to overtime to travel, a dinner allowance, and accommodation for the night, and the same returning. As someone travelling in the morning before 7am, I was entitled to a breakfast allowance, lunch allowance, and if I got home after 9pm, a dinner allowance also.  \n\nSo, I left my house at 5am to catch the only train that would get me there in time. The train was running slightly behind, but I made it in time. So my first 3 hours of my work day down and I’d done no work. \n\nAfter a brief period of us introducing ourselves to Steve, he proceeded to spend the next 4 hours telling us about all of the things he did at the bank, how he made so much money for them, where they’d sent him as a holiday bonus, how we’re all stuck in the past in the public service, the work he’d seen wasn’t up-to “private sector standards” etc. He had all the cocksureness of a finance bro who had always failed upwards because others had picked up his slack. \n\nBy 3pm my entire team were into overtime pay territory, and Steve was just warming up with his non-charm offensive. Another 3 hours go by with Steve verbally patting himself on his back, deeply in love hearing his own voice, but all I hear is ‘cha-ching cha-ching’.\n\nSteve decided that 5pm was a good time to finish up. He stopped mid sentence, looked at his watch, and unceremoniously said “that’s all for today. Go home now” and walked out. \n\nAfter I and a few other gave a few awkward shrugs to each other, we all packed up and started to make our seperate ways home after doing no work all day. \n\nI, myself got to the train station pretty quickly, and saw a train was leaving soon that would get me home around 8pm… or I could catch the all stations train and get home closer to 9:30pm. You know what? No matter how fast I could run, I just couldn’t catch that earlier train, damn I’d just have to catch that all stations train and be on the clock for another hour and a half, plus have my dinner paid for. Such rotten luck! ;)\n\nI submitted my claims the next day, 4 and half hours at double rate, my train tickets, my taxi fares to and from the train station, my breakfast, lunch, and dinner allowances. For me alone it was close to a $500 expense claim. The rest of my team followed suit, and ensured they claimed everything too. \n\nSteve tried to fight us on approval for the claims, but quickly learned that unlike in the world of banking, most public servants are union, and we’d raise living hell if he denied our award guaranteed allowances. \n\nHis all day Steve-fest symposium, blew a good $6000 hole in his budget. Needless to say, while Steve was our manager, he never required us to attend an in-person meeting again — videoconferencing was just fine. \n\nHe only lasted 6 months before “leaving for new opportunities”… he just went back to his old job at the bank. Guess he was the one who couldn’t keep up.",
        "permalink": "/r/MaliciousCompliance/comments/129ruqy/yet_another_new_manager_facing_the_consequences/",
        "comments": [
            "Was Steve from out of state by any chance? If he wasn't, that's even worse because he should have known.\n\nI had one of these once, a new manager who I met for the first time during an in-person sexual harassment meeting that was being conducted by HR. When the meeting was over, she was telling everyone to clock out and saying we got paid for an hour and fifteen minutes for that meeting. I said to her, \"I know you're from \\[other state\\] where the labor laws are different, so I just wanted to make sure that you knew. In this state, if someone is scheduled, you have to pay them for a minimum of 2 hours.\" She said, \"Oh, I'm not sure, let me ask.\" Then she called over the HR guy who had been conducting the meeting and told him I had a question. I said, \"no, I don't have a question. I'm not asking you, I'm telling you, this is the law in this state.\" HR guy came over and told her that he didn't know if I was right or not, because he also was from out of state. I told her that she could look it up if she didn't believe me, but please look it up. I was just trying to help her, because we don't need a class action suit from employees who would rightfully be claiming wage theft, all because she wasn't taking time to learn the ropes before she jumped in.",
            "I had a manager once who I didn't like but he did teach me a valuable lesson. If you come into an organization in a leadership role, do nothing but learn for the first 30-45 days.",
            "I hate \"I love me, I'm so successful\" speeches with a passion.",
            "Some banks are useless at saving money.  Back in the 90s, I worked at a subsidiary of a very large US multinational bank.  Between the US office, handling North America and us in the UK, handling everything else, we were losing $2 million a month.  Every second Monday, our VP would fly to NY on Concorde for a meeting and fly back via Concorde on the same day.  Each flight was $4000. The meeting was to explain to the big bank parent why we were losing so much of their money.  I once suggested to VP Finance that the VP could instead use the newly installed videoconferencing suite and he looked at me as if I had shit on his shoes.",
            "What amazes me is that people think government can be profitable. It’s a service. Service costs money.",
            "Did you play buzzword bingo?",
            "Steve's biggest mistake was not understanding the climate of your department, and prejudging everyone as knowing nothing.  Arrogance is the reason some leaders aren't adaptable.  But as long as Steve stays in his lane at the private company that allows him to blame his shortcomings on employees, he'll prosper in ignorance.",
            "Heh, I remember when the company I was working for hired a new project manager and he was given a project they had just landed. He called like 15 people together and explained that in his entire career, he had never over-spent a project budget. He knows that's a common problem here, so he just wants everyone to know they will NOT overrun their budget. The people working on this project are going to show everyone it can be done. \n\nWell, his project happened to be with our most difficult customer.  And to my knowledge they had never made any money with that customer's projects, but they would make it up later on spare parts and extra work so it wasn't a big deal  - but at the project level every one was a loser with that customer. \n\nShort version, 18 months later and the project has spent all the money and still has 3 months to go - the most difficult months because that's when the customer has to install all the equipment. And the customer is all union. And the customer's subcontractors are all union.  And they are extremely talented in making you pay extra for every little glitch. \n\nLet's say one site is to be installed on the weekend. Should take 38 hours - leaving a few hours buffer for any problems because whether you're done or not, you must have all your crap cleaned up and everything running by 5 AM Monday. All three shifts will be fully staffed to grind through the work.  The customer and their contractors work at a snail's pace. So we have to ask them to work overtime and overlap with another shift. Time and a half for overtime and double time if it's on Sunday like it often is. Oh, and they broke a couple of things that we can't replace until next weekend. So everyone has to come back again to finish up. That $75,000 part of the work is now costing $120,000. They have to pay for the $500 in parts they broke, but made another $8,000 in overtime.\n\nSo Mr. Project Manager had to eat crow about never losing money on a project as the customer schooled him big-time.  He was warned but his ego made him double down on his insistence we would not lose money.",
            "All those reimbursements are in the contract because some asshat pulled that bullshit in the past. The union had to fight management to get those work rules Put in place. I am amazed how many managers have never read the legal contract agreement the company/government agency signed.",
            "Private sector should be unionized. Somehow the last few decades of capitalism-based education has taught us that \"unions stifle innovation,\" when the only things that unions stifle are executive pay and corporate profits.",
            "In a retail job I had once, we had a new supervisor. At the time we closed at 11:30 pm, and usually were finished by 12:15 am. Busy area, we generally would start pre-closing at 10 or 10:30 at the latest. New supervisor first day said we were starting things too early, so everything we cleaned and put away he pulled back out so we could continue to use it. We didn't go home that night until 1:30 am. Next day he came in and apologized, told us to close up as we normally did and he'd be quiet and just learn how we did it instead of trying to butt in and tell us what to do. Told me when I asked what happened that he had learned a good lesson. \"I told our store manager I was sorry because I messed up so bad.\" Yep, but good manager, just needed the lesson that all stores are not the same.",
            "I've always had a slightly macabre fascination of bullies getting their comeuppance, having been bullied myself. Seems like the manager tucked his tail between his legs and scurried off pretty quickly.",
            "> I know our award back to front,\n\nStraya?\n\nWhat are award and penalty rates? I left when I was a kid. So I've never orked there. But you never know. I might go back someday.",
            "Beautiful",
            "Aren’t unions the best?",
            "Gotta say, this subreddit has (favorably) altered my perspective on unions.",
            "So from Newcastle or the 'Gong to Sidernee... \n\nGotta love how entrenched the mindset that \"ALL PUBLIC SERVANTS ARE LAZY BLUDGERS!!!!!!\" is in Oz.  I've worked both APS and private enterprise.  Worked just as hard in both.  \n\nThe only real difference is that in private enterprise, rules & laws are more suggestions, and circumventing them is no big deal.  In the Public Service, I think most people would have an issue if they didn't follow the law (despite how when it comes to themselves, everyone wants the law to be broken in their favour...)",
            "I am curious. Why is it called an award? \n\nI always understood it to be called a contract, but thats in the US.\n\nIs it just different terminology? Genuinely curious...",
            "[deleted]",
            "Had this situation with a manager who hired me into (the largest) commercial real estate management firm in the U.S. I was a new mom, and they hired me in salaried. First red flag was when I was negotiating pay, and she said, “we don’t do that here”. I told her she needed to make the effort, and I wasn’t willing to back down my ask. Big surprise, I got an increase in base pay.\nAbout two weeks in, she commented that I was leaving before 5. I said yes, I had to pick up my son from care. She said I hadn’t met my daily minimum hours yet, and I couldn’t leave. I reminded her I was salaried, and her attitude was, “so what?”\nShe had no idea there was a difference between hourly and salaried employees.  Had to go to HR, after which she was an absolute horror.\nI didn’t last long there due to her constant feeble overlord attempts, but I heard they continued to allow her to fail up. 😒",
            "LMBO!\n\nI too work for a State Government Agency. We had a new administer (banking background) tell everyone he didn't care what the law said. We were going to do it HIS WAY. Well, the Legal Department didn't take to that very well. He soon learned that was NOT going to happen! lol",
            ".Slaps Barry)\nYou snap out of it.\nBARRY:\n(Slaps Vanessa)\n :\nPOLLEN JOCK:\n- Sure is.\nBARRY:\nBetween you and me,\nI was dying to get out of that office.\n(Barry recreates the scene near the beginning of the movie where he flies\nthrough the box kite. The movie fades to black and the credits being)\n[--after credits; No scene can be seen but the characters can be heard\ntalking over the credits--]\nYou have got\nto start thinking bee, my friend!\n :\n- Thinking bee!\n- Me?\nBARRY:\n(Talking over singer)\nHold it. Let's just stop\nfor a second. Hold it.\n :\nI'm sorry. I'm sorry, everyone.\nCan we stop here?\nSINGER:\nOh, BarryBARRY:\nI'm not making a major life decision\nduring a production number!\nSINGER:\nAll right. Take ten, everybody.\nWrap it up, guys.\nBARRY:\nI had virtually no rehearsal for that.\n\n_______________________________\n\nAt 1 p.m. on a Friday shortly before Christmas last year, Kent Walker, Google’s top lawyer, summoned four of his employees and ruined their weekend.\n\nThe group worked in SL1001, a bland building with a blue glass facade betraying no sign that dozens of lawyers inside were toiling to protect the interests of one of the world’s most influential companies. For weeks they had been prepping for a meeting of powerful executives to discuss the safety of Google’s products. The deck was done. But that afternoon Mr. Walker told his team the agenda had changed, and they would have to spend the next few days preparing new slides and graphs. At the Googleplex, famed for its free food, massages, fitness classes and laundry services, Mr. Pichai was also playing with ChatGPT. Its wonders did not wow him. Google had been developing its own A.I. technology that did many of the same things. Mr. Pichai was focused on ChatGPT’s flaws — that it got stuff wrong, that sometimes it turned into a biased pig. What amazed him was that OpenAI had gone ahead and released it anyway, and that consumers loved it. If OpenAI could do that, why couldn’t Google?\n\nElon Musk, the billionaire who co-founded OpenAI but had left the lab in a huff, vowed to create his own A.I. company. He called it X.AI and added it to his already full plate. “Speed is even more important than ever,” Sam Schillace, a top executive, wrote Microsoft employees. It would be, he added, an “absolutely fatal error in this moment to worry about things that can be fixed later.” \n\nSeparately, the San Francisco-based company announced plans for its initial public offering Wednesday. In documents filed with the Securities and Exchange Commission, Reddit said it reported net income of $18.5 million — its first profit in two years — in the October-December quarter on revenue of $249.8 million. The company said it aims to list its shares on the New York Stock Exchange under the ticker symbol RDDT. \n\nApparently many shoppers are not happy with their local Safeway, if questions and comments posted Sunday on a Reddit forum are any indication.\n\nThe questions in the AMA (Ask Me Anything) were fielded by self-described mid-level retail manager at one of the supermarket chain's Bay Area stores. The employee only identified himself by his Reddit handle, \"MaliciousHippie\".\n\nThe manager went on to cover a potpourri of topics, ranging from why express lane checkers won't challenge shoppers who exceed item limits to a little-known store policy allowing customers to sample items without buying them.",
            "Idiots rise and fall to the level of their competency/incompetency. I wonder how much crow Steve had to eat to get his old job back; or even if it was his old job. There's a good possibility that he was gently ushered out and had to take a lower position to get back in.",
            "I've seen the reverse.  An ex military guy comes into our oil service company and claim \"his last business was better than ours and he was the greatest leader ever trained at West Point\".  I asked him... \"the army makes money?  drilling oil wells?\".  Never got along.  I asked a friend in the US Army (Lt Col) to check this guys records - turned out he'd been washed out of West Point.  He lasted 6 months.",
            "Did anyone ask Steve if he was so great, why wasn't he still at the bank?",
            "God, I work in tech, we had a new VP of tech come in, decommission our media service and leave. We were still working on replacing it and moving forward with what they set in motion 2 years later. 2 years of paying like 20 developers and moving to a system 2-3x more expensive (from what I heard, was very hush hush). We had 900TB of images/video. Surprisingly (not) most cloud services didn't support that amount of data.",
            "Where i work we call these people a FIGJAM\n\nStands for “fuck I’m great; just ask me”",
            "I think anyone who uses the term \"meat space\" (other than retelling or commenting on this story) should be put on an ice floe and pushed out into the bay.",
            ">No matter how fast I could run, I just couldn’t catch that earlier train\n\nahhhh shucks! Love it!",
            "When a new lion takes over a pride, he kills all the cubs. This way the lionesses go into heat much sooner and all the new cubs are his. \n\nSome new managers - crappy managers - adopt this style. Stop all the “old” ways immediately and institute their own ways…regardless of efficacy or efficiency. \n\nDummies.",
            "This is awesome. As a side note, no wonder we need to bail out Banks. I'm looking forward to technology evolving so we don't have to subsidize their worthless asses.",
            "Reminds me of a firefighter TV show a while back, first episode the main character shows up at I guess the first day on the job for a bunch of new firefighters or somesuch, talks about himself at length and leaves. I never watched a second episode.",
            "Wow, Steve was publically served his ass on a platter...",
            "A brilliant person, a Genius, an expert in the top of their field, doesn’t need to tell anyone those things. Their work would speak for itself…",
            "I absolutely love that you blew a huge hole in his budget and he couldn't do a darn thing about it because it's union rules!",
            "TL;DR: When i and some others started to work in a company our manager called us in the office that was in another city to ask us one question.  \n\n\nOnce i started as a tester in a company and our office was in another city than most of us were living. We recieved some documents about the processes and stuff for our job as we needed to understand what we would test. It was some goverment stuff but it was pretty straigh forward so mostly no problem to understand. We also did all this from our homes and were not forced to go to the office at that time (after that period it was 3 days per work week in office). After first week our manager called us to the office on monday morning from 8:00 (am). So we went as it is not much problem in my country (for me it was around 1 hour via bus) but one colleague is from another country so for him it was more time consuming. We get to the office and the manager commes to the room. Sits down and as us if we understand everything from the documents and if we have some questions. We all understand everything and no one has a question. Then he says ok and that we can continue to learn the processes from the documents (so basically what we did until now from home). That was all what we did at that day and after work we went home.   \n\n\nThe weirdest thing is that then he was the managers for the testing team but we found out he was the manager of the whole project but was fired (for incompetence i guess) and then was hired by a company that worked on that project as partner (or something like that).",
            "Never, ever, make waves in a new job, especially of you have a responsability role.\n\nTake the time to know who's who, who does what and how what is done. From that point forward, if there is a real problem, act on it: cut redundancies, find ways to make work easier and quicker and cut off the bad apples and **listen to the people working with you**.",
            "And now he's one of those guys on Linked In and Twitter blaming unions and lazy workers.",
            "I also work in government and I love it when new managers come in from outside.  One of 2 things happens - either they're brilliant and truly do have new, better ways of doing things, or they're a fucking nightmare like Steve. There is no middle ground.\n\nUnion fist-bump, but I'm also heavily involved with my union & would have done the same.",
            "Very cool. It must be a dream to have a unionized job. Good work!",
            "I laugh about making money in banking. It's pretty hard not to.\n\nIt reminds me of a new potential manager I could've ended up reporting to. He described making mobile slot games as a 'Classic tech start-up success'. It's hard not to make money when you're running one of the oldest forms of money accrual with even less regulation oversight than usually exists.\n\nHe turned out to be a useless goober (unsurprisingly). Glad I didn't transfer.",
            "\"Nobody screws with the union.\"",
            "I particularly love how \"stuck in the past\" he claimed you all were, while refusing to utilize video conferencing. That's some next level lack of self-awareness right there.",
            "It boggles my mind with the amount of times companies bring in people from other types of businesses just for them to fail because it’s not their line of expertise, the amount of store, district, and regional managers I’ve seen in my own place of employment come and go is astounding when they could simply higher from within and have the knowledge and experience of working the job",
            "Fuck Steve.",
            "All these \"I'm the new manager\" stories have the same vibe as the \"I'm a man and don't need to read instructions - *3 hours later new thing is actually broken\"* stories.",
            "> Guess he was the one who couldn’t keep up.\n\nPerfect summation!",
            "1. I love your storytelling.\n2. \"He only lasted 6 months\" — oof, that is *not* a good look on a resume.\n3. \"non-charm offensive\" is gold.",
            "I feel personally attacked. 😉",
            "I'm govt and union... High five!!!",
            "Y'all tried to tell him and he flat-out REFUSED to listen!  He EFFED Around and Found Out THE HARD WAY!  Good Riddance to Bad Rubbish!!!",
            "Had a manager start at my work and he lasted 2 weeks. He came in talking about how he was going to change things up, he knows what he's doing, things are gonna change! Until he realized everything kinda worked the way it was and he knew absolutely nothing. The big boss chewed him out one too many times and he went back to his old job. He seems much happier now. Still no one to cover the vacancy he left.",
            "A good manager turns good information into good decisions. A bad manager starts with a decision and ignores information.",
            "[deleted]",
            "I loved reading that one.",
            "beautiful",
            "Dammit, Steve.",
            "I hope his boss chewed him out for that.",
            "Aaah yes, because banks are highly disruptive businesses with an appetite for risk and innovation….",
            "Not only that, taxes pay for that service. It’s not like a regular customer who may or may not have been here before. I expect service because I’m a tax paying customer. Plus, there are laws relating to the service I’m requesting.",
            "Part of me is really hoping you're in Alaska, Texas, or maybe California, and plane tickets were required for a few people.\n\nAnd $6000 is quite the hole in most state budgets. Bet he didn't leave entirely of his own free will.",
            "I love it.",
            "Australian?",
            "In other words, the people above him said \"Nice work - fresh onto the job and you personally wasted a chunk of your budget. I think I see what we can expect from you from here on out.\" And then ... found reasons not to involve him in things. Might've even gotten a comment that since he hadn't done anything fireable, he was still working, but it might be a good idea to have the resume in perfect order...",
            "I wouldn't call sitting through 7 hours of some dude self-aggrandizing as doing \"no work.\" That sounds like torture.",
            "Solidarity forever for the union makes us strong!",
            "Who has the luxury of being paid to commute. Lucky 🍀 you. I’ve never heard of this in real life only on the internet.",
            "I normally dislike unions, but there are times they are useful and needed.",
            "!updateme",
            "I am a bit confused as to your story. \n\nI love a bit of revenge and absolutely hate when managers try to re-invent the wheel without knowing the inner workings.\n\nYou say that you are entitled to overtime pay for travel to work. If they are happy for you to work from home, that is fine, but that is not your actual place of work. For OT you would only get what you work outside your normal work hours (he wanted you in at 8, you start at 9. That's 1hr OT). The travel to work you can't claim unless it's at a different workplace. \n\nI am assuming this is in Australia.",
            "Unions are horrible.    I wish they wouldn't exist.   Something started by the mob, is never good",
            "Unions are horrible.    I wish they wouldn't exist.   Something started by the mob, is never good",
            "[deleted]",
            "Got to say though, Steve had a point. On being asked to get into the office, you all went into full on union-led passive aggressive obstruction. \n\nDid you call him privately? Send him an email with the likely cost? That would have been the adult thing to do, and frankly, if you were putting the interests of the organisation first, and your obligation to not waste public money to the fore, that's what you'd have done.\n\nSteve may be a bell end, but maybe you need to consider your own priorities?",
            "I don’t see how you can claim per per diem and excessive overtime unless you have a home office and with most unions you should have an office to report to.  I worked in a union before and we reported to an office and we did not get travel time to the office, we got paid when we got to the office.",
            "Tax payers get bent over again.",
            "Government employees are so smug. Grats on your win but you're bragging on wasting tax payers money. Literally why there isn't going to social security and why there isn't Healthcare. I get your struggle and that guy was a dick but you could probably have achieved the same thing by just not showing up. RIP my retirement. You and your team spent all of it trying to show the new guy how union you are, while non-union folks like me are left holding the bag. Good job",
            "[deleted]",
            "Beautiful",
            "The difference between public and private expenses are Wild.   I am in private sector and $500/person for a one day offsite is coming off CHEAP!",
            "Are you in Germany?",
            "Doesn't get juicier. Thanks for this!",
            ">‘cha-ching cha-ching\n\nI started laughing at this point. He deserved to lose every penny, too.",
            "Why is it always a Steve?",
            "What a rookie. Steve isn't cut out for the world of banking in any case at all. He'd do better as a cashier somewhere; that sounds like the closest to \"banking\" some idiot like him should ever be allowed to do."
        ]
    },
    {
        "post_id": "cevv25",
        "author": "MuadLib",
        "title": "The new city ordinance states that all bars must close at 2AM? Will do!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cevv25/the_new_city_ordinance_states_that_all_bars_must/",
        "score": 13168,
        "num_comments": 302,
        "created_utc": 1563472612.0,
        "selftext": "This is from 2011. A bar owner in Brazil, after his city created a new ordinance mandating all bars to close at 2AM, began kicking all the customers out at 1:59 and reopening five minutes later.\n\nWhen the cops arrived, he argued that he obeyed the ordinance by closing at the mandated time, but since the law says nothing about opening hours, from now on he opens at 2:05",
        "permalink": "/r/MaliciousCompliance/comments/cevv25/the_new_city_ordinance_states_that_all_bars_must/",
        "comments": [
            "That is following the law to the letter. Good job.",
            "In the US in a previous century, bars in some cities had to close from something like 1:00 AM to 9:00 AM. No problem; there were \"breakfast clubs\" whose \"membership\" required only a fee of, say, $1.25 at the door. Quite convenient for continuing the buzz into the wee hours...",
            "This reminds me of a time I was at a bar in the autumn at the change from summer time to winter time. Technically, the time goes 01:59:59 to 01:00:00. The bar was supposed close at 2am, but we persuaded them to stay open as it was only 1am, and of course we were excellent customers in return, buying many drinks during that last hour.",
            "My dad told me stories of Chicago which prevented bars from\nRunning 24/7.  So people setup bars on opposite corners and one was open from noon to 2am. The other was open midnight to 2pm.",
            "What time do you feed your Gremlins? 12:05AM?",
            "I heard about a city with a harbour that had created bars on boats. They would sail away 5 minutes before closing time. That was several years ago though so I might remember wrong.",
            "That's just poor policy development. That's a law made by legislators without any analysis or technical expertise. Lawmakers should decide on what they want to accomplish and rely on experts to tell them how they might do so. Good on the bar owner.",
            "I vaguely recall a story about a bar in, I want to say New Orleans, that got around the rule preventing bars from being open 24 hours a day by collecting up everyone's drinks and closing for a minute.",
            "Here in a city in germany, they mandated a one hour break in opening between like 2 and 3, because residents felt the bars and clubs they had moved next to where loud...  \nAs it turns out, couple hundred people taking the party to the street for an hour until it's open again, are FAR louder.",
            "[deleted]",
            "[Welcome to Brazil. Rules? There are no rules](https://jc.ne10.uol.com.br/blogs/oviral/2017/07/28/empresario-abre-o-bar-cinco-minutos-depois-de-fechar-para-burlar-lei/)\n\nAqui é BR porra.",
            "Well done, sir!\n\n&#x200B;\n\n\\*StandingOvation.gif\\*",
            "I live in iceland, and there would be riots here if bara closed that early, most close between 4 and 5 am and theres no time of the day youre not allowed to sell alcohol",
            "Wonder if this could work in r/Seattle",
            "Good MC but that will probably only encourage the city to pass a law stating when bars open",
            "A tasty MC! Ill toast to this!",
            "Genius",
            "[deleted]",
            "Happened in Dallas in the 70s.  A gay bar I know of closed, gave all patrons fudgesicles/popsicles, opened up a few minutes later.  Reputations were made during the interim.",
            "Cant sell liquor between 2 am and 10 am in my city. \n\nGuess what times every liqueur store is open here.",
            "Brilliant!",
            "LEGEND",
            "absolute madlad",
            "amazing",
            "Most likely there is a law mandating opening times.",
            "And...what happened? Did they get shut down? Did they get sued? Cops aren't really intended to make legal judgement calls; unless Brazilian cops just have that much authority. It's otherwise a funny story!",
            "My dad used to go to a bar in Florida that was required to close at 2 and they couldn’t sell any more alcohol. So at 1:50 everyone paid a flat rate, they locked the front door and every drank for free until the bar actually closed",
            "As T.J. Detweiler would say,\n\n\"Teeender.\"\n\nEdit: Thank you for the gold!!",
            "2 is late enough. Go home and get some rest. Be ready for the next day."
        ]
    },
    {
        "post_id": "lljf6v",
        "author": "FormerStuff",
        "title": "Want me to be extra specific on my time spent during the workday? I can do that.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lljf6v/want_me_to_be_extra_specific_on_my_time_spent/",
        "score": 13154,
        "num_comments": 357,
        "created_utc": 1613527371.0,
        "selftext": "TL;DR at the end. I work in sales. I spend time in my actual office and on the road making cold calls. The small company I work for uses a call-logging software that plans my trips to customers. A typical logged call would look like this: Called X customer > time spent in call> call notes. \n\nAbout a year ago the owner of the company asked me to create a customer called “office work” to ping on the software to let him know I was in my office and not out seeing customers. In the call notes I would write a short general description on what I did in my time in office. \n\nA month ago the owner decided his fresh out of college 22 year old son was fit to be the manager of all salespersons. His son has commenced to micromanage my daily call reports to the fullest extent. He has to write a report to his father what each salesperson does every day. I get texts or emails almost daily asking what “exact times” I did what in my office or on the road. This culminated to the owners son demanding I log each individual task such as driving to a customer, working on a spreadsheet, or even warming up my vehicle. \n\nThe example he gave me: 7:30AM-7:49AM checked and responded to email, 7:52AM-8:00AM warmed up truck. Etc. Each entry takes about a minute to create and log. \n\nHe wanted to know what I was doing every minute of the entire workday. \n\nFine. I can play ball. \n\nFor the past week and a half I have been scrutinizing every single second of the day to ludicrous extent. I timed five minutes and counted the number of breaths I took to get an average amount of breathing per minute. About 18 breaths per minute. Better log that. \n\nI began timing my bathroom breaks and logging it. My fastest bladder draining is 48 seconds including washing hands!\n\nI timed how long it took to fill up my water and logged it, 29 seconds from start to back at my desk. \n\nI timed how long to tie my boots and logged that, 4 seconds each boot. \n\nSitting at a stoplight? Logged. \n\nHe now knows I can knock on a customers door 10 times in 3 seconds. \n\nFor about a week I logged everything I did every waking moment of the workday including the bites of my salad for lunch. Hell I even got the other salespersons to join in the malicious compliance. He was inundated in hundreds of reports each day he had to comb through. \n\nToday he sent an email to the sales force that we are no longer required to give specific times for tasks but rather a general description would suffice. Just like it was before he took over. \n\nTL;DR- Bossman’s son micromanaged so I nano-managed to get back to being macro-managed.",
        "permalink": "/r/MaliciousCompliance/comments/lljf6v/want_me_to_be_extra_specific_on_my_time_spent/",
        "comments": [
            "Did you include the time you spent filling out the logs? Seems like he might also want to know about that.",
            "> Bossman’s son micromanaged so I nano-managed to get back to being macro-managed.\n\nHilarious...and effective :)",
            "I had a boss who did this. I included in my log the time spent writing the fucking logs. HIS boss saw that, and magically I no longer had to do the stupid report. This was supposed to be done by my manager, I later found out, and he had forwarded my reports as his own without reading them.",
            "Called customer A to discuss second quarter requirements: 20min 12sec\n\nLogging into reporting software and documenting call to customer A:1 min 10sec\n\nDocumenting my documenting my call to customer A: 28sec\n\nDocumenting my documenting my documenting my call to customer A: 26sec\n\netc.",
            ">Bossman’s son micromanaged so I nano-managed to get back to being macro-managed.\n\nA triumph of a sentence. 11/10",
            "Start adding \"applying for jobs\"",
            "Wait you knocked 10 times in 3 seconds? Lol I’d cuss someone out for this.",
            "Damn near got a spit take out of me when I got to this: \n\n>About 18 breaths per minute. Better log that.",
            "Been there - done this. Worked in HR and manager wanted to figure out what part of our workload was taking up the most part of our job. She got detailed everything for 2 weeks. Loved seeing her response as she went through page after page of my daily work life.",
            "I had a similar issue with a boss.  I was a billable resource at the time and was running at 2x the “fully utilized” metric. We aimed to have 60% billable for each tech. That was considered fully utilized. I was over 120% for six months. That’s because I was the only person on our largest project.  My boss called and wanted me to start logging my non-billable time to a high degree of notation and to come into the office. They would no longer be paying for my home internet. \n\nSo in addition to billing 60 hours a week, he wanted me to drive into the “office” which was one rented office (single desk) shared by four sales people already.\n\nSo I said, “No problem. But I work 8 am to 5 pm. I’ll come into the office, where I will have my work computer setup, log my time. I will then head to the customer site where I will work until 3. Then I will head back to the office where I will log my work and leave at five.”  Doing quick math I would drop from 120% to about 50-60% billable.  He babbled for a few minutes and I simply hung up. \n\nI was pissed. The next closest person on my team was 40% billable and several were sub 20%. I had asked multiple times for some help and not received more than a day or two. So I had given up asking for help and asked to just be left alone. Now that didnt work. I also hate useless and arbitrary rules, and thus would have changed my day to useless and arbitrary that hurt both me and my customer. \n\nSo there I was, steaming about the crappy company I worked for, and my terrible boss and his shortsightedness, when my phone rang. He was calling me back. \n\nI answered the phone, and he started right in. \n\n“Hang on Boss,” I said, “I agreed to everything you asked. However, I’ve had a moment to think about it and I’ve been working massive amounts of overtime, billing three times higher than the next closest person on the team. All you have done is made my job harder and I don’t need this. I quit, effective immediately.”  And I hung up the phone. \n\nI should say, I was on the only vacation I ever took at that company at the time.\n\nI emailed my boss my letter of resignation and cc’d the head of sales. Clicked send and felt a feeling of great relief. My wife freaked out a little, since I was unemployed at that moment. \n\nA few days go by with me ignoring the calls from my former employer.  Finally the customer calls me. \n\n“Hello?”\n\n“Yeah, Nerd, this is [customer contact] I wanted to talk about where we were for Monday.”\n\n“Ummm, didn’t anyone tell you I wasn’t working there any longer?”\n\n“What do you mean?”\n\nSo I told them the story. \n\n“Actually, it’s been interesting here dealing with your leadership.  I’ll let you go. Hey, before I let you go, do you know anyone who would be good for the positions we have open on our site?”\n\n“Umm, I’ll take a look.”\n\nWe disconnected and I went to their website. They had a few positions, one was for the Director of IT. Click apply. Get a call from the COO (one of two contacts I worked with at the company). We negotiated for 30 seconds and I secured a huge raise over my former company. Started Monday.",
            "Drops a log, better log the log dropping. Include length and circumference, and number of wipes please.",
            "This is so weird. I've never worked in sales, let alone managed a sales team, so maybe I'm naïve, but I could have sworn the only important metric for a sales person is \"how much did they sell?\".",
            "Nano-managed. I like that term!",
            "10.25am Farted, lasted about 8-10 seconds, pungent, laughed about 10 minutes at the aroma. \n10.27am Coworker enters questioning the laughing, leaves immediately, continue laughing",
            "Reading this triggered me. I worked for a place that did time sheets like this! The owner had cameras installed to watch every employee at their desks. He would time your bathroom breaks and occasionally turn off the bathroom lights if he thought you were pooping to long. Emails were constantly being sent out from HR warning to limit your time in the bathroom or at other employees desk as you are being watched and will be reprimanded if they consider it excessive. Once the pandemic hit he required all calls be recorded, installed tracking software on the computer to track the key strokes and record the desk top. Also required employees to have a cam on them when they worked from home. He would occasionally listen to the calls live and then contact the employees afterwards to comment on the their call. Word of warning if you see any of these red flags with a future employer, run! Run as fast as you can!",
            "Sounds toxic and annoying - I'm glad you were able to get him to back off.",
            "How did my day go? Well, here are my logs.\n\n&#x200B;\n\n8:00 - 8:15 Taking a dump\n\n8:17 - 8:20 Logging about taking a dump\n\n8:21 - 8:24 Logging about logging about taking a dump\n\n8:25 - 8:28 Logging about logging about logging about taking a dump\n\n8:29 - 8:32 Logging about logging about logging about logging about taking a dump\n\n8:33 - 8:36 Logging about logging about logging about logging about logging about taking a dump\n\n8:37 - 8:40 .........................................",
            "I was expecting to see some comments from someone who had also worked somewhere with billable hours... Oh well. \n\nI used to have to log every 15min increment of the day. There was a metric of chargeable (to the client) work Vs unchargeable work you were supposed to hit (I want to say 80%?). There were admin codes to account for doing your timesheet and reading emails and training and stuff. Mine was always fiction.",
            "My new manager tried to do something similar. He wanted to know what I did after hours. I told him other technicians call me for help and I assist. He wanted details in my time sheet. I went the other route and said if I’m going to be micromanaged or if you don’t trust me to fill out my time sheet then I’ll turn my phone off after 5pm and solve this problem. After a few days of people complaining they couldn’t get help from me he told me to start answering my phone again. I refused as I now found peace and quiet in the evenings. I won’t even answer when he calls. They don’t pay me on call pay so until then I don’t answer my phone.",
            "Good thing that micromanager met you. Who knows, maybe the boss knew you'd torment him.",
            "I also had to do this while operating a forklift, I used to break it down into 5 minute blocks over an 8hr day. When I handed the boss 45 A4 pages for 2 days work the admin girls lost their shit and I was told to break it down into 30min blocks.",
            "I was requested to do this by my manager when I was working 16 hr days and he didn’t think I was doing enough. The last task on my list was “writing a resignation letter” and I attached it as a separate file.",
            "You forgot to log the time you need to write the logs.\n\n- \"Tied my boots, 4s\"\n- \"Logged tying my boots, 2s\"\n- \"Logged logging a previous task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n- \"Logged a previous logging task, 2s\"\n\n...",
            "Ugh I had a boss that insisted on my colleague and I doing this because they thought we weren't working fast or hard enough. Turned out they just had absolutely no idea what our job entailed. That was a super fucking toxic environment to work in. I'm so glad I moved on shortly afterwards.",
            "It's log, it's log, it's big, it's heavy, it's wood.",
            "Micromanaging is lethal to mental health of employees. Fuck managers like that.",
            "48 second to go to the washroom AND wash your hands? That's nasty. No go back and wash your hands properly, were in the middle of a freaking pandemic! Otherwise, good work.",
            "So clever.",
            "Not all heroes wear capes. Bravo!",
            "I hate shit like this as someone who works in sales. My job is to hit revenue targets, nothing else. So, my work day isn't based on how many calls I made, emails sent etc. It's all outcome based - sale or no sale or, maybe, a lead. But sometimes my manager will emailing me saying things like, \"hmmm, doesn't seem like a lot of work has been done today\" when I could have made 60 calls that morning and just been unlucky in reaching people.",
            "I have had similar experiences and I always log time for logging time and make sure it increases over time.  Then I do a chart explaining how my actual productivity has switched to tracking my productivity.",
            "Man, looks like you missed the best opportunity to totally stop working and set every minute to filling out this stupid log.\n\n8:49-8:83 Rebooted computer.  \n8:50-8:51 Created log entry about rebooting computer.  \n8:52-8:53 Created log entry about creating log entry about rebooting computer.  \n8:54:8:55 Created log entry about creating log entry about rebooting computer.  \n8:56-8:57: Created log entry about creating log entry about creating log entry about rebooting computer\n\nEventually the log entry takes more than a minute to type, and then you're set!",
            "I hate nepotism. I get wanting to own a family business but it's a bit much sometimes. I have a friend who's dad owns a very successful logistics company and hired him as a manager when he was 19... the kid (my friend) was a known screw up and they were paying him 90k a year. \nWell of course these guys who have worked their asses off for years trying to get promoted got angry and quit. A lot of people quit... by the time my friends dad realized his son wasn't doing a damn thing and was coming in for 1 or 2 hours a day it was too late. He fired my friend but most of his staff had quit.\nIt's been 10 years and the company has since recovered but still... what a stupid fucking business decision.",
            "I've never heard the term nano-managed before, but I like it.\n\nExcellent MC!",
            "“Stood in pretzel line”",
            "Dictionary definition of malicious compliance. This is awesome",
            ">TL;DR- Bossman’s son micromanaged so I nano-managed to get back to being macro-managed.\n\nyou Nano-Reported.",
            "And at the performance review, the kid will highlight this in the review form:\n\nManaged to efficiently improve sales' teams process by eliminating the need to log everything a team member does and switched to a more streamlined logging process which gave the team more time to do sales-related tasks and improve their performance. \n\nPerfect manager. Deserves 2x raise.",
            "You can tie a boot in 4 seconds? You're a wizard, harry",
            "I did something similar to this once. Boss wanted logs of everything I was working on so I went into hyper detail, going over ever little thing. Pasting large chunks of code into it too as \"supplementary information\" it went a few weeks before I had a meeting with him and his sort of secretary. After the meeting she pulled Mr aside with a truly crazed look in her eyes and said \"Please, make your weekly logs brief.\" Apparently, bossman took one look at them, said nope, and started forwarding them to his secretary to get a synopsis from her. Thankfully they are both picks so I had no worries about collateral damage.",
            "I did a by the minute log for my boss when he questioned what I do all day. Consequence: his billing clerk refused to deal with it and the boss continues to think I don't do anything all day, without noticing the 2 hours I spent training and the 4 hours I spent \"installing software,\" because somehow nobody in the office is capable. (It's a CPA office, how hard is it to install?) And I can't just work on every computer at once, or walk away during installation to do something \"billable,\" bc my coworkers would get frustrated by the wait and just cancel the installation. Of course, it simply wasn't possible for them to just tell me before going on lunch break.\n\nI quit that job and am not helpful in the transition. They don't deserve me.",
            "I would’ve logged the time that I spent logging",
            "\"10:35 AM: Cosby impression.\"",
            "Did you log: spent 30 minutes entering logs\n\nI would have.",
            "Lol wonder what would have happened if you also logged the time it took to do all the logging even before you started nanologging. That alone should have made them realise how dumb the idea was.",
            "Wow the owner really doesnt give a shit about his sales people eh.  RIP that business",
            "Been there - albeit - my boss would either get a mechanically inclined spreadsheet of individual events - including the time it took to log said events AND the time it took to log the LOGGING of said events...\nOr...\nHe would get a novel worth of information, like I was being paid by the syllable. IE “it was cold when I got to the office. I stamped my boots on the snow laden carpet and cursed father winter. From outside the office I could see it on the horizon - it was going to snow. And snow it did...”",
            "Good on ya mate, honestly I have quitted jobs for less than that, but still, owners rubbish on a 10 ppl company. Fuck that. I learned then I was after a 50ppl company, not 200, not 10.",
            "This was the best story to read! Love it!",
            "Your tl;dr is now what I'm calling this strategy. Thanks mate.",
            "I had a manager who asked me to do this for two weeks, so she could see how I spent my day. Unfortunately for her, I had a cold. And yes, I logged every time I had to blow my nose. Weirdly enough, once I turned in my two-week log she never mentioned it again.",
            "These logs seem totally pointless regardless. Wasting time writing that you did your job.   All the boss should care about is end results.",
            "4 seconds per shoe? Nice",
            "FUCKIN CLASSIC!!! PERFECT timing your piss was great!!",
            "How do people put up with jobs like this? I could never. Props",
            "My company wants us doing this since working from home. For the record, these time logs are broken up into 15 minute slots. My boss thinks it’s dumb and has literally told me that if I take a phone call that lasts a minute, I gotta record it in one of the 15 minute slots. If I do 10 emails over the course of an hour, I did emails for an hour then 🤷‍♀️",
            "That’s the beat TL;DR I’ve seen in awhile.",
            "10 knocks in 3 seconds seems excessive",
            "If you are in the UK I am sure your union would be very interested in this behaviour, especially if he isn't doing it to everyone else. Treating one employee differently to other employees is the very definition of bullying",
            "that's truly lovely.  I had a boss who did that to me, but at that point in my life I was young, and cowed by him, and felt trapped so I just sat in misery and did it until I snapped.  (this did not involved harming anyone, but it did get me transferred somewhat quickly.)  \n(I sorta wish I'd had enough fuckitol to put \"12:45-1:30, wondered about the hellscape my life has become since getting this job\" every day.)",
            "It's a log! Log! It's big! It's heavy! It's wood! A log! Log!",
            "Please say your trips to the bathroom included time spent urinating, defecating and wiping.",
            "That MC got fucking logarithmic!",
            "I love this story. \n\nI remember so well filling out time sheets at ad agencies (and yes, they ALL had them) in 15 minute increments. I mean, sometimes we worked so fast and furious to get things done, we didn't have time to write down the tasks and each one had a code and a billing number so we could keep track of profits on jobs. One of the codes (12) was for \"miscellaneous\". I kept filling in blanks in my time sheet with tons of 12s, over and over. But they can't bill for those, so I got in trouble. Fine. From that point on, I would fill in my blanks with 14s (administrative) and in the description area I would write \"Time spent trying to remember what I did and filling out time sheet\". Yeah, I got in trouble for those too.\n\nI really hated time sheets. When I started my own firm, my number one vow was to never have them.",
            "Next: bossman's grandson comes up with plan for pico-managing staff.",
            "You need to wash your hands better after using the bathroom you creature",
            "10 knocks is far too many knocks for one door.",
            "As someone who used to be in the son’s position, I feel for him. He probably pushed for more detail because he was getting the request from his dad. People don’t always see how crazy upper leadership can be because a good manager (or someone who’s trying to be one) will do their best to shield you from those “fun” conversations.",
            "> fastest bladder draining is 48 seconds including washing hands! \n\nUh, proper hand washing takes 40-50 seconds. For the love of God, we’re in a pandemic. Please wash your hands properly",
            "oh, [i did that once](https://www.reddit.com/r/MaliciousCompliance/comments/8snw5r/every_minute_accounted_for/). after my ridiculously detailed, every-30-seconds productivity log was too much for them, and they asked me to generalize more, i just put start and stop times for broader tasks. and if someone interrupted me, and i had to start a new task, they'd overlap. first day i turned in 32 hours of productivity.\n\na bit later on, i got put in charge, and turns out the whole exercise was completely irrelevant, and they manglement just wanted to know total number of \"units\" over work hours.",
            " I am owner of a software integration company in Kiev. But ok bud.  Remember assuming is not knowing. Lmfao 😲",
            "[https://www.reddit.com/r/memes/comments/lluxoy/the\\_scum\\_that\\_i\\_could\\_find\\_initiate\\_order\\_66\\_this/](https://www.reddit.com/r/memes/comments/lluxoy/the_scum_that_i_could_find_initiate_order_66_this/)",
            "I'm going to assume the OP's astrological sign is either Virgo or Sagittarius.",
            "I would actually just fire you. Whether you like it or not, your boss's son is now a part of management. The request made is a nuisance, I agree, but not unreasonable. You are one person in an entire organization. You are easily dispensable and I am sure company can find someone to do an appointed job without being a child about it. (Reminder: you are paid for your services out of company's pocket) They don't need you, you need them.",
            "How did it drain that quickly? I'm just impressed.",
            "Did you log the time required to log time?",
            "Does he know know how many shakes now it takes after you pee?",
            "Please tell me you logged the expect number of logs or squirts you deposited into the toilet.",
            "An easy way to log your day is to use Clockify, highly recommend",
            "10 knocks in 3 seconds is impressive",
            "I absolutely love the wording on your final sentence.",
            "wasn't really sure if I was going to upvote this until I read the TL;DR description. That should be a tee-shirt slogan!!!",
            "Lovely. My inner BOFH congratulates you on a Jobbe Jolly Well Donne!",
            "Sounds like you guys were really at loggerheads over this!",
            "Getting the other salesman onboard with it was an awesome move!!",
            "As a son that is helping his fathers business for the past two months, I’d hire you in a second. I don’t understand why sons that are given an opportunity feel the need to make waves just to prove they belong there. If it’s working, let it fucking work",
            "Bada bappaaa... I’m logging it!\n(McDonald’s commercial)",
            "Nice.  Out-dink the new Dink.  Bury the Dink in minutiae.",
            "Kudos 😂",
            "One day micromanagers will learn that this is the cure that will be dispensed to them.  One day.",
            "This is some serious Jim Halpert stuff. I guess your colleage who went with you would be Pam, who is your Dwight?",
            "Reminds me of this http://www.27bslash6.com/timesheets.html",
            "Nano manage is an awesome expression!",
            "I've had to do something similar when a boss started micromanaging my time.  I don't know what put the bee in her bonnet, but she wanted to know exactly what I did during my time at work each day.  At the time I was the single IT person in a business with 25 internal employees, 15 remote workers, and 350+ contractors in the field.  I did everything from Help Desk to Network Engineering to DevOps to vendor management to budgeting.\n\nI sent her a minute-by-minute report at the end of each day.  Exactly what I did, why I did it, and how long it took.  My shift ended up 2+ full pages, single lined.\n\n* 08:00-08:02: Clocking in, opening email and daily apps\n* 08:02-08:05: Reviewing emails and assessing initial priorities\n* 08:05-08:06: Adding first email to ticket queue, begin task\n* 08:06-08:09: Research first fix, attempt potential repair, success, advise user\n* 08:09-08:10: Adding lines to this list\n\nAfter the second day she asked me to stop.  She never asked again.",
            "You are a 21st century hero",
            "Tell him about clockify 🙄",
            "It's like my Asana nightmares",
            "Brilliant.",
            "...nano-managed - nice!",
            "Good post. Much satisfaction.",
            "I've been a direct hire and contractor many times over the past 32 years.  Frequently my management has decided they need more detail on what I am my teammates are doing, so they've implemented that kind of crazy logging.\n\nIn every case, I later get told \"don't log THAT\", \"you're spending too much time on this log\", \"you don't need to give so much detail\".\n\nAt two different clients, I got six weekend into spending 4+ hours per week on just logging.  They finally told me to cut out most detail.  So back down to 30 minutes.  They still tried to cut that down.  Really...",
            "My office eliminated time sheets lol",
            "Love the TLDR! 🤣🤣🤣",
            "Ah, nepotism. The surest way to reduce productivity, profits, and moral in one fell swoop while simultaneously increasing costs and workloads.",
            "And what's even better is that the actual previous boss made him do it. They probably were getting upset at the lack of info they were getting and wanted more. They also probably wanted an excuse anyways to hire their kid. So boom insert kid as sales manager. Force them to change the process and micromanage. Boss get what he wants for a time to make sure the \"sales guys aren't abusing the lack of oversight\" and then when shit gets ultra ridiculous like you started to make it they can go back to normal and the boss still looks like the good guy cause it was his fresh out of college child that wanted to micromanage his new employees right? RIGHT?",
            "Basically did this a couple years ago when I got a new boss who tried to micromanage. In my experience the cure for micro managing is to simply overwhelm the micromanager with updates (be polite about it). They'll quickly realize they dont need or want that amount of detail or frequency in updates.",
            "Just FYI in legal time record keeping, the time one takes recording the task done IS counted as time spent. Bear that in mind before applying to law school.",
            "Ever since my work has had us working remotely, they are having us all do this and turning it in every day to make sure we aren’t all “slacking off” at home. We’re just admins.",
            "Why in tarnation does every single workplace go through a phase where some new manager comes in and starts changing the workplace expectations for the worse? What was even the thought process like in deciding every employee should document every action they physically perform? \n\nSituations like these are pretty infuriating to work under especially if you don’t have the ability to maliciously comply.",
            "Did you get the memo about the new TPS cover sheets?",
            "the TL;DR is *chef's kiss* splendid",
            "(You're knocking on doors?)\n\nGenius MC work right here.",
            "I'm going through this RIGHT NOW. We have a log for our clients and we write a note of what has been done and there are 4 categories in a dropdown to choose from when you add the info. Well new management has created 30 new categories which aren't loaded into the system so, must be c&p'd for each note and we have to rate the difficulty of our task and tell them how long it takes us. Data is being pulled and they're saying it doesn't add up to a full day's worth of work. Not everything we do is client related and noted in that system. We have plenty of backend admin that we do. So, now we are keeping a list of those items as well. \n\n\nAlso, we are all working from home with kiddos. I know corporate doesn't care about that but, it is a factor in our day.\n\n\nI think we're headed towards layoffs.",
            "This happened when my office went to teleworking in April last year. I think it lasted a few days before they asked for summaries instead of minute-by-minute records. \n\nWhen we started our second round of telework a few months ago, they just asked for a summary of planned projects at the start. Quick learners.",
            "Oh my gosh, how I hated doing those time logs.  Just filling the damn things out took several minutes each day.",
            "Great way to put an end to all that shit. If it were me, I'd gladly be jobless for the next couple of months.",
            "You could always piss him off and include slightly graphic details, like your bathroom activity times. The time it takes to write the stupid call logs, etc. Sadly though daddy would likely side with his kid.",
            "We \"bill\" maintenance hours to different departments. Some dumb HR bullshit. Anyway there's a blank space and some days I write \"playing with phone\" and log a few hours. \n\nI really want to write \"masturbated in the bathroom\" but I don't want to be in trouble.",
            "Hahahaha - when my micro-managing boss asks what I’m doing 5 minutes after he gave me three jobs to do, I say I’m dropping the kids off at the pool - and I chill for 15 minutes",
            "U can tie boot under 4 seconds, what is this sorcery 😳",
            "Well someone’s not washing their hands for 30 seconds."
        ]
    }
]