[
    {
        "post_id": "jz87bw",
        "author": "foobar754",
        "title": "Just change your password and write it down for you? Sure thing.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jz87bw/just_change_your_password_and_write_it_down_for/",
        "score": 13144,
        "num_comments": 380,
        "created_utc": 1606095442.0,
        "selftext": "Back when I was working at a small company, the company didn't really have a ton of support staff so I'd take a break from the various programming tasks I was doing and would help out.\n\nThe \"manager\" of the support team was completely unqualified and basically got the job because he was also the head of sales and it was a customer facing team.\n\nHe was also a lazy luddite who refused to learn how things worked and generally made our lives more difficult.\n\nOne day I was covering on the support desk because they were short staffed and got a call from him that he needed his password changed. I was confused at first and started to walk him through the steps to change it himself. And he shouted angrily, \"No goddammit, just change it, write it down on a Post-It and give it to me.\" And hung up.\n\nSo I sat there for a minute and remembered I don't report to him at all. So I changed his password for him.\n\nI made it 18 characters long and it was a combination of I, l, 1, ! and | .\n\nHe was not happy. Especially after he mistyped enough times to lock his computer and he couldn't log in the rest of day. Because the support guy who had the access to do a hard password reset was out for the day.",
        "permalink": "/r/MaliciousCompliance/comments/jz87bw/just_change_your_password_and_write_it_down_for/",
        "comments": [
            "First rule of business: never piss off your own tech support.",
            "Only 18?\n\nMy boss once got pissy about something and demanded control access to the very sensitive system we had built for the company. We had given him an account which would allow him to see all summaries, but he wanted control of everything, which would allow him to destroy the company in a heartbeat if he did something stupid, and I knew he wasn't technically qualified to do something intelligent. He absolutely demanded it, and I'd be fired if I didn't give him the password for the super user account at once. So I brought him a printout of the user name and password. \n\nThe username was 80 characters of gibberish with the word \"CABBAGES\" in the middle of it. (No particular reason, just to make him wonder why.)\n\nThe password was all I, l, 1,|, 0, and O.\n\n300 characters of it.\n\nI never heard a peep about it again.\n\n(Yeah, that was actually the account I used when I really needed it. No I didn't remember it. I had it stored on a USB stick in my pocket and I'd cut and paste it into the program when I needed it.)",
            "I changed somebody's password to\n\nThelongestpasswordintheworldevernothingelsehasevercomeclose\n\nAlso ticked the box so they couldnt change it for 3 days.....",
            "Go with something along the line of :.::.:..:;:..:;;,,.,;;.,,;;.,::’;;’\";.::;,.;:::,.; next time. Handwritten too",
            "It reminded me of this XKCD, actually \n\nhttps://m.xkcd.com/1105/",
            "If he asks, tell him you use passwords like that all the time for maximum security, and if he wants it more personalized to him, he can always do it personally, with the personal methods you personally gave him, which he then personally refused to learn!",
            "I would have just given him the longest possible  string of random characters.",
            "My boss calls me a Luddite... and made my work password a variation on that word.",
            "I swear programmers are masters in malicious compliance because we will follow instructions to a T then wait and chuckle when it explodes in their face.\n\nie I was working on a big feature with a very tight deadline, it's due tomorrow, and a project manager came over and said to drop everything and fix some other thing that was bugging him by the end of the day. I tried to explain that I couldn't because I was working on the big thing and he said \"I don't want excuses, it's my job to say what to do and yours to do it.\" Ok fine then. I dropped what I was doing and did his thing. End of the day proj manager comes by to see the finished thing, and CEO walks up to ask about the big priority project, I tell him we aren't going to make the deadline, when he asks why, I tell him. The CEO asks if I told the proj manager what I was working on, I did. Proj manager got on a LOT of trouble.\n\nYou'd think next time he'd listen when I tried to tell him something but he didn't learn. We've done this a few times now. I always cover my butt and document when I express a concern and get ignored or shit down and it always bites him in the butt. CEO is a great guy though and very fair.",
            "If he asked to have that one changed to something easier to type in, OwaTanaSiam, would have been a good choice.",
            "r/foundsatan",
            "I knew what this was going to be the moment I clicked the post. I was not disappointed.",
            "One of my law school classmates with a relatively uncommon name was given an email address for law school with multiple “l”, “i”, and “1”s in it. We are still not sure who he pissed off to get this address.\n\nEdit: typo",
            "I used to do freelance web design and companies and people I worked with always forgot their passwords for everything.  My answer was always \"What's your favorite dog?\"  Because 95% of the time that was their password.  If they didn't have a dog it was their favorite child or grandchild.  Never cat.  People don't name their password after cats.",
            "I used to manage local support for some offices at my company, and had one person who was kinda similar, and demanded that I do similar, reset the password, write it down and give it to them.\n\nI tried to explain our newish policies, but they wouldn't let me finish.\n\nSo I write the password down, \"set\" it, scrambled it, locked the account, and notified security of the compromised account since the password was known to someone other than the user, and then gave them the paper with their \"set\" password.  (after I let my security buddy know)\n\nOur management chain was frustratingly happy to go around our own policies to make users happy, but the new security org?  Yeah, not so much.",
            "> a combination of I, l, 1, ! and |\n\nThis is pure genius!",
            "Alright lemme try it-\n\nIlIIllIl||IllI|lI|I|lI|\n\nDamn it is illegible",
            "The people over at /r/TalesFromTechSupport would love this",
            "LOLlol101LO1lo!10L",
            "This post and comments has inspired me to make my passwords in some combination of Korean and Cyrillic, going forward.",
            ">lazy\n\nWell, of course.\n>luddite\n\n*oh no*",
            "What was the exact password?",
            "Enjoy this TIL award for teaching me \"luddite\" 🤓",
            "Il|",
            "You should have made him one easy to remember like \"one2threefour5sixseven8\" and instead of writing it down  just tell him in person",
            "Omg this is a brilliant way to make a password! I love it.",
            "Bravo!!!! Take the upvote!",
            "When I called IT because I didn't change my password in time, the guy asked me to tell him what I wanted my password to be. He could NOT understand why I was uncomfortable with this, in spite of the fact that we were in cubes so at least 20 people in addition to him would have my password. He kept saying, \"but it's not like I'm going to *remember*. I finally told him to make it Password1 and I would change it again when I got into my system.",
            "Even worse would be ‘“”’”””””’’”’”’’’””. Handwritten obviously",
            "IT at my wife’s job changes everyone’s email password for them and then tells them what it is. That’s bad right?",
            "BOFH would be proud",
            "I can’t be the only one who feels like these kinds of posts don’t belong here, right? \n\nLike, he was a jerk and probably deserved it, but there’s a difference between malicious compliance and doing an assigned task in a malicious way. \n\nThis is the IT equivalent of being told to make someone a sandwich, so you shit on some bread and give it to them. Funny and deserved? Maybe. But not malicious compliance.",
            "Ili1ove! thiI1s !",
            "Obligatory [Userfriendly](http://ars.userfriendly.org/cartoons/?id=20121015)",
            "So you’re a fan of Brian Stefan too?",
            "hunter2",
            "Why doesn't he hust change the password by himself?",
            "\\*lol\\* :D",
            "If you only use 5 different characters, the password needs to be \\*much\\* longer to be sufficiently hard to crack! ;-)\n\nMay I suggest adding , . ' \\` ´ \" ² ³ and °?",
            "Hahahahaha",
            "Oh no disappointed no link to four words all uppercase.   Will have to go to you tube myself",
            "In his *I WALKED ON THE MOON*, Brian Regan brings this.\n\nLook into.  Much laffter.",
            "This is some next level evil genius tech support. Bravo.",
            "Lmaoo. I love that password. Good job!",
            "no",
            "Compliance at its highest level.",
            "You can retire now. You've won this subreddit.",
            "hahahahahhahahah",
            "Do you work for a midsize regional paper company in Pennsylvania by chance?",
            "You have a dark side. I like it.",
            "You monster! \n\nYou could have taken it a step further and put in more Unicode characters, like the Turkish letter i  and the Spanish exclamation point \n\nBravo on giving him a lesson in proper passwording",
            "This post speaks to me on a spiritual level.",
            "this reminds me of a very similar post that was on here a while ago",
            "http://bofh.bjash.com/",
            "First and last rule of business: don’t be a dick.",
            "You made me giggle out loud.\nHow did it get resolved?",
            "This is amazing!",
            "You are evil and I love it.",
            ">>> I made it 18 characters long and it was a combination of I, l, 1, ! and | \ni never thought of that... i need my password like that",
            "I never thought of using | as a \"special character\" but yeah, of course it is.",
            "🥳🤩👍",
            "Should have thrown in some Greek alphabet in there for good measure!\n\nI work for a site called Not Always Right and our readers really appreciate stories like these. Would it be okay with you if we shared your story on our site? Please let me know if that's cool?\n\nThanks again for the great story!"
        ]
    },
    {
        "post_id": "nvy5oe",
        "author": "EarthenVessel_82",
        "title": "Don't schedule me for hours you don't want me to take.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nvy5oe/dont_schedule_me_for_hours_you_dont_want_me_to/",
        "score": 13099,
        "num_comments": 404,
        "created_utc": 1623251345.0,
        "selftext": "When I worked for Radio Shack my manager would schedule me for 2 hour lunches but expect me to only take 30 minute lunches and work the other hour and a half.\n\nDoing that helped boost the stores $/hour sales rate, but it meant that I wasn't making the 40hr requirement to be considered full time. \n\nSo I started taking the two hour lunches I was scheduled for, he got mad but there was nothing he could do because he made the schedules. He stopped doing it after a week of arguing with me. He eventually got fired for doing other shady stuff.",
        "permalink": "/r/MaliciousCompliance/comments/nvy5oe/dont_schedule_me_for_hours_you_dont_want_me_to/",
        "comments": [
            "Yeah, that’s illegal.",
            "In retail management you will never find a more wretched hive of scum and villainy.",
            "Kmart tried several times to make me take a working lunch. That meant that I would punch out for lunch and work for free and hope that I could eat between customers. \n\nI informed them that I don’t work for free and I was going to leave the store for lunch. They decided that I could put a sign up that said what time I’d be back at my station.",
            "Radio Shack used to be THE store until the mid-90's. I built a multi-unit CCTV system for my father in law with off the shelf parts and tons of input from the employees. Then they started to focus on cell phones and went from hiring engineering students to hiring idiots. I walked into an RS in 2001 with my company provided phone once to buy some assorted parts. Rather than answer my questions which were mostly about locations of parts, the kid kept harping on how he could save me money on my cell service. I explained to him that it was a company phone with unlimited minutes and cost me nothing. I explained this at least twice. The kid wouldn't let it go. \n\nI waylayed the manager and asked him where the parts I needed were and he asks me about my cell phone plan.\n\nI never went back to another RS.",
            "illegal AF. i had opposite experience with that. boss almost banned employees from coming in store off hrs. you DO NOT work off the clock. he kicked me out once because i tried to finish my stocking off the clock. i was almost done and a bit slow. he kicked me out and finished himself. wasnt mad either. im paid to work x time. Y task isnt finished. so at the end of X time Y task is not my job anymore. great guy.",
            "\"When I worked for Radio Shack\"   That line will soon be extinct..",
            "My boss would report I was off the job doing clerical work or safety training even though I was still working on the job. It was a way to fudge the productivity numbers. He would do this without my consent and I would report the hours correctly in my paperwork. \n\nThen he had the nerve to tell me I was working too slow.",
            "Yep, a screen printer I used to work for did something similar to me. We were given an hour to take lunch, 30 minutes were supposed to be paid. Everyone else left the building for lunch. Since I didn't have a car at the time I just stayed and worked. The owner deducted the 30 minutes daily from my paycheck and I lost my cool. He paid it back, but I wasn't compensated for the extra 30 minutes every one else got. I started just not working for that hour, but that caused problems. I got written up for not answering the phone and they put parental blocks on the computer to keep me from going on any websites. I resorted to using my cell phone and they made THAT against the rules. I finally went to lunch with everyone else just to get out of the office so they couldn't hound me.",
            "Got promoted to a salaried position that ended up being a huge paycut when the average 60 hours per week figured in with the added benefits of way more responsibility. The joys of it being a management role, I’d be getting all sorts of work calls outside of my scheduled 9-5 and having to cover in myself if someone called in (healthcare and leaving gaps in coverage is never good). Got fed up with it and would not enter the building until 9am sharp and would leave promptly at 5pm, M-F. Any calls outside of those hours would be ignored. Took them about a week of this to change my pay from salary back to hourly. Made it about another year after that; some consultants being brought in and trying to implement some process that would have created an even larger work load for me ended up being the last straw",
            "OK, see if you can follow this. I was in the Navy with 3 months to EOS.(12/10/72) I signed up for Project Transition which allowed me to intern at Radio Shack but be paid by the Navy until my actual EOS.  So no commission from RS on my sales.\nFast forward to Feb 1973. Now I am a full time salesman $1.10 an hour plus 15% commission.\nI was surviving but barely. Then the reality set in. After Christmas returns started coming in and the returns were added to my goal despite not having received commission on the original sale..\n\nNot a happy camper but my new manager refused to intercede on my behalf. When my pay check was in the negative , I was out the door. Stupid bastard kept on scheduling me and calling me. Fuck you very much Mr. Barry Schien.",
            "So you were expected to work for an hour and a half for free? F that.",
            "Yeah Radio Shack did all kinds of fucked up bullshit in the end. I was a wage slave there for several years and at one point one of my co-workers bitched that a customer he has been trying to sell a phone to came in on a following day when he wasn't working and I got the sale instead of him.\n\nMy boss said he was going to give the commission to my co-worker since it was 'his sale'. I quickly pointed out that since my name was on the receipt as the person who sold it to the customer, I was responsible for if anything went wrong. Did Boss want me to put other people credentials on sales they did not complete? He said he wanted me to identify when this happened so he could swap the commission to the person who *should* get it. I told him that if I was the one conducting the sale, I should get the commission, plus the customer didn't identify to me that my co-worker had helped him at all, how was I supposed to know?\n\nMy boss still gave the commission to my co-worker and I told my boss straight to his face that he just removed my incentive for selling because now there wasn't even a guarantee I'd get commission on the items I sold. In the future, when customers came in I would ask them if somebody else had already helped them and if so, I would refuse to sell them anything and to come back when the co-worker who helped them was working because otherwise I'd get in trouble for stealing commissions.\n\n'Yup, I too think it's stupid, if you would like to complain, here's our 1-800 number, PLEASE COMPLAIN'\n\nI didn't work there too long after that. Boss stopped giving me hours and since I didn't make commission anymore I stopped trying to sell people stuff and would commonly answer 'I don't know' when asked anything.\n\nFuck Radio Shack... used to be an american icon in the 80's.",
            "[deleted]",
            "Yep. That was radio shack. My ENTIRE STORE walked out, quit, together in protest of their fuckery.",
            "I used to work at BestBuy and they would sometimes pick random times to eat you lunch, some being 15 minutes into your shift when are before you came in.\n\nSo I would be sure to go the busiest area and just sit there on my phone and not help.\n\nIn retrospect I wish I knew more about the rules as they broke them constantly. Off the clock after closing/clean up, but not allowed to leave yet, or having to wait to get frisked by security as if we stole something.",
            "Man, everything I've ever heard about working at Radio Shack is awful.\n\n[Relevant](https://www.sbnation.com/2014/11/26/7281129/radioshack-eulogy-stories)",
            "I refuse to work for free. I come in a half hour early. If a coworker asks for help I say “hold on let me clock in. “ or “ I can’t, I’m not clocked in yet. “ same when leaving, “I can’t, I already clocked out. “  \nIf you get injured or something bad happens you can be sure the company will throw you under the bus and deny accountability by saying it’s not their fault because you were off the clock.",
            "A manager I worked for tried this with me. I asked for it in writing, got requested writing, and took it to the store manager, who was rightfully pissed. Idiot manager was in meetings with the SM and a couple corporate people the next day, and was gone the day after.",
            "Hah a manager at a restaurant I worked at once got pissed because I walked by a ringing phone before my shift had started. He said something snotty and I just stared him down and growled, \"I don't work for free,\" and walked off to eat my lunch.",
            "Shadio Rack",
            "I worked at a factory that had a regular Saturday shift. There were penalty rates for working this shift, from memory it was time and a half for the first six hours and double time after that. The shift could go for up to 10hrs so it was good money and there were no shortage of volunteers. The problem arose when it became obvious that some workers were coming in for the overtime but then taking the Monday off by calling in sick. Managements answer to this was to place notices that anyone that worked Saturday and called in sick Monday would not be paid the penalty rates. This was not just unfair to people who were genuinely ill but was illegal and contravened labour laws.",
            "That is textbook wage theft. Likely stealing from employees.",
            "This is for Rachel, why you put me on the motherfuckin schedule",
            "A new manager I had a Radio Shack fired me for not showing up to an employee meeting at 5:30am on Xmas Eve. He and I didn’t see eye to eye on how to run the store, so he took me “missing” a meeting as an excuse to fire me. I didn’t mind, I had been working there for a long time and was basically making minimum wage.",
            "That my friend is wage theft",
            "the shack was go to place for long time. staff knew about discreet components, circuit boards, parts and what not. since 90 or so, only ex pizza delivery people work there. maybe they got cheap.",
            "Nice, a story that isn't unnecessarily 20 paragraphs long, good work.",
            "Oh. I have so accusation from colleagues that my employer is telling them to be at work early and then do paperwork from home. These are disability support workers. They are some of the lowest paid qualified staff in the community and they are being required to work added 'volunteer hours'",
            "Can confirm, used to work for this shitty company. \n\nRight before I quit they expected us to sell a 99 cent warranty on 5.99 headphones, 9 out of 10 times. \n\nI got the same lecture from my manager every evening when I inevitably didn't hit the 90% RSSP attach rate bullshit.\n\nBut I had this really cool co worker, we would watch the display model TVs when there was no one in the store.\n\nUnfortunately she got promoted to manager and the little power she had corrupted her and she became completely hostile to everyone.\n\nOne time after closing, I was getting ready to leave after finishing up and was on the way out the door when she told me she was almost done too and to wait so we could walk out together.\n\nI thought ok fine, maybe shes gna be cool now. Well a few minutes of standing around and my phone goes off and its my friend. \n\nMy friend was in jail and I was his one call.\n\nShe made me hang up because I was still on the clock, and handed me a random RC car and told me to put it in the back. There was no reason to do this. She threatened to fire me if I left but I was already on the way out the door. \n\nShe ended up not firing me.",
            "I had a job at a nursing home once where we were told to be \"at least\" 15 minutes early to work, to account for report from last shift. I would come in 15 minutes early, clock in, and go get report.\n\nThen I'm told that we're not allowed to clock in more than 5 minutes early. \n\nI start clocking in just in time, making the prior shift late getting off work, getting them 5 minutes OT (25/wk.)\n\nWas told that I need to be here 15 minutes before to get report, because it's not fair to the prior shift to have to wait on me. \n\nI told them I only work when I'm paid, so they stuck me on an Alzheimer's unit *alone*, at the opposite end of the building, so I'd be \"late\" getting to my post if I clocked in just on time or even 5 minutes early. \n\nThe admin nurse decided to literally go down and watch me clock in so she could lecture me about being considerate of others.\n\nFinally, I was late twice in a month, once due to a long train making me two minutes late clocking in and a blown tire making me ~20 minutes late. \n\nWhen they audited my time and saw that the next month, the admin nurse gleefully fired me for being a \"pita\" employee.",
            "I worked at Radio Shack a very long time ago... and that's nothing compared to the shady shit I experienced.  A while after I no longer worked there, an investigator called me because I had apparently cosigned for a car loan for my former Radio Shack manager. Uhhh- no I didn't.  Best I can figure out is that he took the info from my files or job application with my social#, forged my name, bought a car, then disappeared.",
            "RadioShack ex-employee represent! Hahah…. I was top sales for Parts, Batteries and Accessories in the region and in our area, for top sales of warranties and cell phone plans.  That, and the BAMs (?) — the cash incentives for selling certain cell phones and/or plans and warranties.  They were no less than $15-25 each and racked up quickly.\n\nWorst day was coming in to a -$2200 sales total shortly after Christmas because there were a handful of high dollar returns on my day off.  My heart sunk.\n\nBut hell if I didn’t make insane money working at RadioShack!  I was 17 - 18, absolutely killing it in sales and add-ons.  If only I actually spent all that money wisely instead of partying and spending it on computer build and gaming and road trips and all that…. heh.",
            "Yeehaw, wage theft :( Glad he's outta there",
            "Fuck that fucking fuck",
            "Straight up wage theft.",
            "I hear this on a lot of US centred posts. What’s with the coveted full time / 40 hour week? Why’s that so important?",
            "Why would you ever let someone try to tell you to work when you’re off the clock? Only 10 or 15 minute breaks are paid whereas lunch breaks are not so he’s blatantly stealing from you and getting free labor out of it, since the manager is the one who gets bonus pay for $/hour sales rate reaching/passing it’s goal. Never go out of your way to do extra work and let someone else gets to earn extra pay or bonuses.",
            "Kind of curious why you ever agreed to put in an hour and a half of volunteer work each shift at radio shack in the first place",
            "Truly Brainless idiots...unbelievable that these idiots get into such positions.",
            "Wait do you mean he made you clock in early or that he would straight up not pay you for that hour and half?",
            "Anything under a very good salary you work the hours you are paid to work. That’s it",
            "How many of you have ever been in a RadioShack? Lol. I feel like they've been gone for 20 years",
            "Okay then, how about The U.S. practice of holding one's first two paychecks? Sounds innocent enough. It covers your last two weeks should they fire you.  \n\nNow, think about the interest or investment income off that money, from dozens of employees, over a 30 year career. Even when someone quits, their two weeks is replaced by someone else's two weeks. Let's say your average employee makes a thousand dollars a week and you have a dozen to start.  That $24,000, invested modestly (any business that can't out run a mutual fund should be closed), over 30 years, should come to over $190,000. Remember, neither the employer nor the employee pays a dime in taxes until it is paid out. Sorta makes you feel like a sucker doesn't it?",
            "Hah! There must have been a training video about stuff like that. My RadioShack Manager did the same thing. He also liked to schedule a few of us for 8-9pm so he could go home early. So you'd have weird little 1hr slices all over the damn place. For a week, I was scheduled 9am-10am and 8pm-9pm. He was always late to the store, so at 10am like clockwork I was calling the district office to tell them I was closing the store because I was off the clock, but Mgr hadn't shown up for his schedule yet.\n\nOne manager was fired when they caught him with thousands of dollars of stock in the trunk of his car. Another was fired because enough random female shoppers had accused him of hitting on them or offering them discounts if they'd give him a handie in the backroom.\n\nAh, RadioShack, definitely the most unique job I ever had.",
            "Man, where are these companies HR teams?\n\nThere were several years where staff would need me after hours. Just a quick log in to help and log out, maybe twenty minutes a few nights a week. I didn't want to log in to the system, log into the time clock, punch in and help them, log back into the time clock and punch out. It was just more time consuming and annoying to go through all of that.\n\nMannnn I got in trouble when they found out I was working off the clock. No write up but a very stern talking to about how I was required to be paid for any time working, no exceptions whatsoever. Answer a quick phone call? Log time. \n\nEventually I got approved for salary and it's so much nicer not to have to stress about that.\n\nI guess I've been with my employer for long enough now that the idea there is nobody stepping in and saying \"fuck no, you are absolutely NOT going to do any work related activity without being paid\" is just so weird to me.\n\nHow do these companies avoid the legal issues of demanding unpaid work?",
            "I worked for the Shack back in the late 80's. Got some killer skills on how to deal with people from there. \n\nMade lots of money as well.",
            "Much illegal. Very Wage theft",
            "People with unions don’t have this problem.\n\nWaiting for the downvotes from:\n\n1.\tpeople who have never been in a union but “have heard about them”\n2.\tpeople who are jealous of those in unions who get more benefits than they do\n3.\tpeople who like to whine about unions protecting people who don’t do any work but make big money anyway.\n4.\tpeople who want to bust unions because they support big business over workers.\n5.\tbots and trolls that downvote anything pro-union\n6.\tthere is no #6",
            "What was his argument?",
            "He wanted you to work for free? Eugh",
            "I was a manager at a Radio Shack in California and HATED every minute of it.  I had no other options at the time and was thrilled when they fired me so that I could collect unemployment.  They had some great products, but crappy employee relations.",
            "I started a sales manager gig at a large retailer years ago. It was found out the previous GM would park things in front of the sensors counting customers. This would skew a lot of data as total sales / number of invoices can tell what the average spend is. Fast forward and even with knowing all of this our corporate overlords expected is to maintain that average customer spend. The total revenue was not really changing that much year over year but that didn’t matter, some how customers are spending half what they used to. Talking heads",
            "\"At least they used vaseline! :D \"",
            "OK doesn't care. 😐😣😩",
            "Radio Shack still exists? That’s so 90s.  Now I feel old hearing this…",
            "Justice (and there's not enough of that)...he got fired.",
            "So the other hour and a half off the clock?  Or is this just a paper game so that the \"schedule\" shows light hours?",
            "KFC did the same exact thing when I worked there at 16 except I didnt get the lunch breaks anyways",
            "Wouldn’t you be entitled to back pay?",
            "!emojify",
            "No Shaq, Radio.",
            "You lost me at “Radio Shack.” Maybe this (plus Amazon) contributed to their demise.",
            "There’s a reason Radio Shack is gone…….JS",
            "Lmao, Radioshack was such a shit show. \n\nI kinda miss the stores in my area, the managers didn't give a FUCK and we got away with a lot. \n\nSundays in a downtown store I worked at were so dead that a coworker and I brought our laptops in every Sunday to play minecraft and make a video game from scratch (we never finished it, but it was fun)",
            "Another factor they never seem to think about is workers comp insurance. If you are injured on your way to work outside your scheduled work shift you're  supposed to be covered.",
            "Ugh, Radio Shack.. had the misfortune to work there around age 19.",
            "Not really MC"
        ]
    },
    {
        "post_id": "y2albh",
        "author": "punklinux",
        "title": "Oh, you think the trade shows are actually vacations wrought with fraud and you want to impose strict controls over a business you don't understand? Good luck!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/y2albh/oh_you_think_the_trade_shows_are_actually/",
        "score": 13102,
        "num_comments": 513,
        "created_utc": 1665597169.0,
        "selftext": "Many years ago, I worked for a company that hired an incredibly obtuse financial department who took over when they first organized. It used to be a loose collection of managers, but the year after I started, they went for a more organized and separate structure.\n\nTo be fair, this is more about my boss than myself.\n\nWe had a travel team: a group of volunteers from sales and IT who would go, en masse, with equipment and techs to do setups, displays, and network at trade shows. We had a booth, some sales guys would be there, and networking would commence. There was always a set of volunteers from the IT department, because some of the shows would be in big cities, and you'd get to attend vendor events, parties, and hang out with the sales guys who were mostly gay alcoholics for some reason and super-fun. There was a kind of seniority to who got to volunteer, but nobody really complained, and everyone got rotated who got to go.  \"You got to go to DEFCON last year, it's my turn now.\"  \"Okay, fair.\"\n\nThe \"travel team lead\" was also a volunteer position, but commonly someone high up, like a manager. Their job was to orchestrate equipment, rentals, expenses, travel plans, convention center fees, and shipping. They also ended up getting a lot of free stuff, too, from sales and our partners, which they'd pass along to the travel team.\n\nIt was all kind of a \"perk,\" to be fair, for everyone involved.  But when the new Director of Finance started, she put in some new and strict policies. Some of their polices started with:\n\n1. Travel team is not allowed to get reimbursed without explicit approval, and nobody was approved post-event.\n2. Travel team does not get a credit card of their own, or even a company card.\n3. Travel team gets gift cards for a set amount (like $150), which was to be used for all expenses. Sadly, places we needed it for like airlines, rental agencies, hotel rooms, gas pumps, and toll booths do not accept gift cards. Finance denied these were \"gift cards\" and even specifically disallowed people in meetings to refer to them as such (\"pre-approved credit balances\" I think we had to say), but to the rest of the world? They were 100% exactly the same as gift cards with gift card restrictions.\n4. No matter how early you asked for it, often Finance waited until the very, very last minute (and usually after half a dozen reminders) to get anything approved, which incurred a lot of unneccesary costs, like expedited shipping, same-day rental penalties, or inflated air fares.\n5. If they forgot, it was your fault or your manager's fault for not \"reminding them enough.\"  Okay, you reminded them 4 times to buy the team airline tickets and it wasn't done? Should have reminded them 5 times, so, your fault.\n\nThis was ALL in response to the Director of Finance's claim it would \"reduce fraud,\" an issue that, as far as anyone could tell, had never happened. The director had this Dolores Umbridge  approach that somebody, somewhere, \"might get away with something.\" She was a patronizing git with a smug grin and this annoying head waggle when she \"down-splained\" something to you. So we'll call her Dolores.\n\nBefore her, the travel team would just submit receipts and get reimbursed. Dolores put an end to that, specifically saying the the previous lead of the travel team was \"just going to spend all the money on steaks and wine.\" He, understandably, told her to go fuck herself, and quit the company when the dust settled.  In his wake, Dolores used his \"free stuff from vendors\" as a shining example of stolen opulence and schwag hoarding that she put an end to.\n\nOh, behold the mighty on his throne of Airborne Express stress squishies and free Uline catalogs!\n\nThat left my manager to take over his duties, and he'd never done travel team, so he wasn't really sure how it all worked and didn't push back on Dolores at first until he was forced to travel with the team. He was surprised he didn't have an expense account or corporate card, and when he asked for one, he got the gift card. When he tried to use it, it was rejected pretty much everywhere he needed it except various restaurants. He paid for everything else on his personal American Express card, including stuff for the rest of the team, and was rejected for reimbursements because he didn't ask for it beforehand.  He was on the hook for $40k+ in various things from two week-long trips.\n\nOf course, he complained to the top management. Dolores threatened to quit if she wasn't allowed to do her job, and the top managers never had to deal with her before, and were kind of wishy washy about \"being the bad guy here.\" Like, \"well, she says she lets you use gift cards, so...\" and when my manager said they were rejected, Dolores said, \"he's not trying hard enough; he's afraid of confrontation. He needs to be a big boy and fight back.\"  But in the end, the top management reimbursed him under pressure from the legal department.\n\nAfter that happened, Dolores \"settled\" on having certain things \"pre-paid for,\" like hotel, travel, truck rentals, and shipping. But they waited so long to do them, that often they tried to get hotel rooms or truck rental the day of a popular event (sold out), or got the wrong hotel (Washington DC is not the same as Washington State), or waited so long for shipping, it cost $250 to send something overnight that would have cost $40 to send it a few weeks prior. They also didn't understand how much ANYTHING actually cost, and how we saved money by doing things ourselves.  And in some cases, Finance did everything wrong, so the team would arrive at the right hotel, and found out that Finance didn't submit an authorized approval for a card (for, say, incidentals, a requirement for most hotels for trade shows), and nobody could reach them, so again, people got dinged on their personal cards.\n\nAgain, Dolores said, \"they just can't accept what the hotel desk, convention center union, or dumb minimum wage bunny at the toll booth tells them, they have to fight back! We can't spoon feed and coddle these guys because they are too scared of conflict!\"  Ever fight with a Jersey Turnpike toll booth collector?  Yeah, neither had she.\n\nAfter two of these disasters, my manager said, \"Just stop. Stop volunteering for these events. I will not approve time off for it.\" He declined being travel lead for future trips because he just couldn't afford it. This was an unpopular move, at best, but he told us \"just wait. Let her do things her way.\"  He was a master at malicious compliance, and with no resistance, Dolores went into 5th gear with the smug grin, \"Now we're going to act like a REAL company.\"\n\nThat leads to the next issue: some of these travels were in major cities, like Chicago, New York City, Washington DC, etc. Dolores, again, said that people \"were just going to these events to get the company to pay for a drinking vacation.\" Management was like, \"uh, yeah? We wouldn't get volunteers, otherwise.\"  Well, Dolores didn't like THAT idea. So she decided that she would hold a \"staff lottery\" and you could enter your name, and she'd have a drawing on who got to go \"to be fair to everyone.\" This \"fairness\" seems awfully slanted on her own staff, by the way, which we'll get to shortly.\n\nThe point of these trade shows was NOT to take a vacation, something Dolores made absolutely sure to point out, but she didn't grasp the entire reason we went: to increase our business. It had to be IT folk for setup, and sales folk for the schmoozing, but that concept never got past her ears into her cognitive understanding. Well, since those IT and tech folk who already couldn't go didn't want to pay for it, we didn't volunteer. So the travel team ended up being other company staff who had no idea how to work, act, or deal with trade shows which was a horrific expense disaster.\n\nImagine the administrative assistant for Marketing on the 5th floor winning a ticket, only to find out she had to pay for everything. Plus, Dolores ALWAYS sent one of her own to keep \"an eye on everyone\" but none of them knew how trade shows worked, either. They only knew how to kowtow to Dolores and her control issues.\n\n*\"What is a union fee?  What is corkage?  No, we did not approve some union to give us power, you plug your booth stuff into an outlet or something.  They won't let you?  Who is THEY? Well, then stop using TV screens in the booth. You don't need them, we do not sell TVs, anyway.\"*\n\nDid you know that if you have a conflict with a event center union and declined their \"help\" they charge you anyway at max rate?  Yeah, Dolores and her team didn't know that, either. And let me tell you, paying those guys a few thousand bucks ahead of time is a LOT cheaper than just letting them charge you fines afterwards.  Oh, she tried to fight back, because she was \"not afraid of a little conflict,\" but lost heavily.\n\nIronically, despite Dolores stating otherwise, at great length, the non-IT-or-salespeople who went actually thought it WAS company paid vacation-ish, just like Dolores warned about, making it a kind of self-fulfilling prophecy. The fact they had to work was surprising at first. Then after that word got out, NOBODY would enter into the \"lottery,\" so now they had NO volunteers. So Dolores assigned them to interns. INTERNS. I could write and entire novel from that disaster alone. Imagine sending a bunch of college kids to Vegas, telling them they had to pay for things, and putting them in a job conflict situation where they were guaranteed to lose? I am sure many laws were broken.\n\nDolores then had to send along \"chaperones\" to manage it, who were more of her finance department flunkies, and our company ended up with massive fines for various issues, including paying bail for the interns.  Because the interns got into so much trouble, Delores started hiring room monitors for the hotels and fully legal adults had to go to the show, work the entire day at the show on their feet, then check back in to their room. She also put 4-6 people to a room, too. Like they were a high school band or something. She even had breathalyzers bought for it to make sure nobody was drinking. Adults. She treated adults like this.\n\nThis was brought up by the sales teams as a PR nightmare, and my boss said, \"just wait. Okay?  Let her hang herself.\"\n\nThe first year of this, the travel team's expenses increased by over 4000% You heard me, four THOUSAND percent. Trips that used to cost $3600 were now costing $144k or more, often because of late-minute fees and penalties.  The travel team expenses went from $110k annual on average to over 2-point-something million. Because shit was so badly mishandled, we lost a lot of our booths slots and booth renewals, so we lost half our trade shows, and looked like idiots to our clients. But the main reason we went to those trade shows in the FIRST PLACE was for networking, so there was literally no reason to go anymore.  This was pointed out to Dolores multiple times by the sales team, so she doubled down and \"canceled\" the travel team after just one year.\n\nFinally top management got involved, who actually fought with Dolores for a year until she \"retired for personal reasons/to dedicate herself to her family.\"  Then it took nearly two years to rebuild the travel team from scratch. People got corporate cards, travel team lead became an actual job, and when we hired one, she handled all the financial stuff for us, so it was much better, and saved the company a TON of money in her first year.\n\nAnd there was much rejoicing.  \n\n\n\\----  \n EDIT: So, some edits, based on some common questions:\n\nQ: You're really talking about \\[some name\\], aren't you? \n\n&#x200B;\n\nA: There are a lot of \"Dolores Umbridges\" out there, apparently. Only three people, former coworkers, got it right. \n\n&#x200B;\n\nQ: Why was she not fired when the spending went from $110k to $2.1mil? \n\n&#x200B;\n\nA: Several reasons, the biggest being she was Director of Finance. So I am sure when she gave her fiscal report, she downplayed the mistakes. We also had some really good years in the early 2000s, so if we made $2mil in profit the previous year, and $3mil the next, that loss would have gone unnoticed until someone realized we should have made $6mil instead. That's my theory, at any rate, based on the aftermath. Dolores was friends of two of the top managers, and supposedly had a \"come to Jesus\" meeting with them about the state of our company's financial standings, so that's why they hired her in the first place. By the second year, several directors had quit, including friends of top management who took them for drinks later and got the entire scoop. \"Dolores has got to go.\"  The trade show thing was only one of the cases she fucked things up: she also completely hosed one of our major supply chains by low-balling them, and making a few enemies that nearly destroyed the company and gave away some of our more lucrative contracts with vendors to competitors because that broke their anti-competitive clauses.  There were more issues, but that comes closer to identifying some people, which is a huge no-no here. \n\n&#x200B;\n\nQ: What happened to the Christmas party? \n\n&#x200B;\n\nA: The Christmas Party wasn't nearly as interesting: she just didn't have one. This was near the tail end of the whole \"now we're going to run this like a REAL company\" fiasco, but once the budget for events was $2.1mil from $110k, the Christmas party was probably far down her list of worries. I don't even think she knew she was supposed to have one. Some people think she was funneling that money to cover up the massive expense increase for the trade show fiascos, but I can't imagine that those budgets were from the same pool. I think around November, people started asking, \"don't they have a Holiday Party every year?\" but nobody knew who was doing it.  Usually it the three people who were a huge part of it in previous years we no longer with the company (they had quit, mostly because of Dolores). But even they didn't run it, per se, they hired and catered it out at some fancy hotel locally. Our fiscal year was Jan-Dec, so December was huge for tying things up, and this was her first year running \"Fiscal Year End\" stuff (she came on board late in the previous year) and so the Finance would have been normally very occupied, anyway.  \n\n&#x200B;\n\nQ: How was she let go? \n\n&#x200B;\n\nA: She just gained too many enemies in the company. It took a while, but after she had been with us for a year and a half, she accumulated too much negative drag on her inertia to get things done because there started to be a very strong passive resistance. This caused her to spiral out of control, and try to start a coup which gained no traction and singled her out as being mildly unhinged to say the least. By the time her second anniversary came and went, she started taking \"sabbaticals\" until one of them became permanent. Her assistant took over, but then was let go, and they brought in some consultant group who started a new finacial team. They were the ones that suggested someone have the \"table team lead\" as an actual, separate, paid job. The woman who got hired and ran that was AMAZING.  \n\n&#x200B;\n\nQ: Is it true she tried to sell keychains and pens? \n\n&#x200B;\n\nA: No one asked this, but a former coworker reminded me that she was appalled we were just \"giving away\" some of our normal booth freebies like stickers, pens, shirts, and keychain flashlights. She demanded we charge at least a nominal fee for them, but IIRC, nobody followed that mandate. I only personally know she sent out a memo admonishing employees that a lot of the keychains went missing and she was seeing them on people's desks.  \"Those cost the company money,\" and wanted to charge employees $3.00 for them. But apparently she wanted to charge people at the booth as well.",
        "permalink": "/r/MaliciousCompliance/comments/y2albh/oh_you_think_the_trade_shows_are_actually/",
        "comments": [
            "It floors me how in these cases upper management can't see that this person is subtracting value from the company. Did she not have a boss asking her to explain why a $4K expense turned into $144K? Why not? Sometimes people make mistakes or unexpected things happen. But the 2nd time this happened she should have been a thread away from firing. \"We can't afford to pay you because we're paying for all your mistakes.\" The fact she had that much rope to hang herself with is some pretty colossal mismanagement from the executive team.",
            "I was involved in setting up many trade shows, and if finance is fighting you every step of the way, it would be a nightmare. It’s funny how the people who approve the expenses never get to see all the work involved in doing a show.  I think they should have sent Dolores out to supervise those things, but I am happy that she was turfed out in the end.",
            "\"Stop using TV screens in the booth\" fuckin' sent me. The 'event team' in the company I used to be with was a dedicated part of the Marketing department, and for a small show they either denied or forgot to have a screen shipped for the sales DIRECTOR who was representing the company at the show. So homeboy went to the local Best Buy and bought one to use at the booth.  \n\n\n\"We don't sell TVs\", what do they think people use to advertise their products or services on, pamphlets? Last trade event I went to, the keystone booth at the show had multiple massive screens simply suspended above their booth broadcasting their logo. And that was in Chicago so it was all union work for the riggers, gaffers, electricians, gophers, and anyone else who made it happen.",
            "I was offered the opportunity to travel to England for 3 day training from the US. \n\nCool I've been to the UK a number of times, I was a top sales performer and the US office wanted to show me off. \n\nNo problem, four days however is begging for zombie jet lag, I get it bad, I offered to go early and spend the weekend doing tourist stuff on my own money and then attend the training Monday- Thursday. NO! this isn't a vacation. \n\n*Okay I won't attend*.... I'm a senior guy I don't have to kiss anyone's ass. I could have taught the training, These guys in US management were sending me because the European office actually knows my name, they knew I wouldn't be missed by my US customer's and I'm not going to get drunk and dance on the tables.\n\nSo we were the only market (US) who didn't send someone, Although we could have sent a houseplant and no one would have noticed, they sure as hell noticed when no one came to their world-wide training that they spent a fortune on! The home office felt snubbed! \n\nwhen i was asked I told the truth, I get jet lag, and they wouldn't let me come for the weekend to get acclimated, I didn't want to sleep though their training. \n\nSix months after I got a new job the company imploded, fired everyone, forced retirement for the senior guys, sold/given the sales opportunity to a competitor. 17 million a year and 90 employees to 4 employees and (3 million?) in sales.",
            "I did trade shows for a number of years. No where close to that level. Yeah trade show people party hard but that’s because they work their ass off. 14 hour days with 90% of it on your feet, doing something. Setting up, smoozing clients, pitching your product., finding 10 seconds for lunch, and then breaking it back down. Every trade show I have ever worked has always been a blur and fueled with enough caffeine to power a small city.",
            "I went through something similar, although for a non-profit. Most were post-expense, though, like, \"we can't pay for alcoholic drinks!\"  No, you can't get tax write-offs for alcoholic drinks, you can pay for anything you like.  My team would schmooze industry guests, so sometimes you had to do what you had to do. Luckily Japanese voice actors don't ask for hookers, just to go to Hooters, LOL.\n\nI \\*cringed\\* at the convention center unions. When you said NYC, I am betting it was the Javits Center, and their rules are so strict: you can't even bring in your own wheeled carts or anything. They charge you for everything: power, network, space, tablecloths, carpeting, even the chairs at your booth. You can't have anything shipped there, either, without going through their shipping service which is sold per the pallet weight or some such thing, so that shipping one padded envelope costs the same as a stack of 30 window air conditioners.\n\nWe also tried those \"gift cards\" and yeah, nobody would accept them. Our treasury at the time never did travel, either, and so didn't see any of this first hand. They also said, \"it's NOT A GIFT CARD!\" when, okay, maybe not, but they are flagged as such and follow the same rules.  \"Pre-paid card\" or whatever. I bet she was following some marketing this, or there's some legal reason you can't call them gift cards.\n\n>Oh, behold the mighty on his throne of Airborne Express stress squishies and free Uline catalogs!\n\nI LOL'd so hard at that. Holy fuck. She got mad he was hoarding AE squishies? I once had so many Uline catalogs, I used them for kindling.  I haven't worked for that company for years, and I still get them sent to my house.",
            "> If they forgot, it was your fault or your manager's fault for not \"reminding them enough.\" \n\nAs soon as I heard that, any communication with the department would be set to auto-send the request every half hour (for a full 24 hour day), with the pertinent instruction as an additional attachment.",
            "We had a permanent trade show team.  The lead told me he was always on good terms with the union crews and got preferential treatment.  His secret?  Swag.  He always made sure they all got hats and shirts and whatever else we were giving away.",
            "So I worked in the finance dept of a company that did several trade shows a year, sending marketing and sales teams. I cannot imagine thinking the way this woman did. Yes, we had to fight to get receipts and got to see the charges for truly outrageous things sometimes, but we never would have considered the idiotic rules made in this story. Wow.",
            "In all of the godawful places I've worked, I've never seen incompetence that hits this level (close, but not quite).\n\nI salute everyone who had to deal with \"Dolores\".",
            "One thing I was always taught when you first accept a new position. \"Don't change a damn thing, see what people do and ask why they do it.\" Once you know those two things then make adjustments.",
            "I am on a sales team for a company that constantly frequents trade shows. I’ve always loved the corporate guys complaining that the sales team is so spoiled because we get to go drink and party at trade shows. Yes, Bill, I go sweat my ass off setting up a 20’ x 20’ booth from scratch for 6 hours, coordinate everything around securing said booth, and then stand in uncomfortable dress shoes and talk about my job - usually the same repetitive 4 sentences- for 15 hours while an endless line of people come by just truthfully looking for a free pen. I will have 5 $8 hotel Bud Lights at the end of that and I will fucking enjoy them.",
            "This should be a chapter in an MBA textbook to illustrate \"penny wise, pound foolish\".",
            "I don't know what kind of company would be so intimidated by some finance geek that they would just cry and moan at a 20x increase in trade show costs instead of escorting her out the same day those expense reports showed up. Especially considering everyone apparently was already aware of her lunatic behavior.  A friend of a friend counts for something, but there is zero chance the marketing budget wasn't demolished by a $2 million hit that was supposed to be $110K.  And I guess the head of marketing just put up with it? \n\nOur finance head was beloved by the CEO but the one time the finance head changed a policy that ended up costing more money, the CEO had it stopped in two weeks. No VP would let a finance poilcy destroy their budget and just eat it. Just doesn't happen.",
            "Penny wise, pound foolish.",
            "Wow, brings back memories. I was an IT roadie for a computer vendor in the 1980s. My actual job was a pre/post sales analyst. This is a tough position in sales because the sales management never seemed to get the hang of what motivated people in those positions. My first experience was an exhibition that we held in a hotel. Based on what the company saw from that, I had a new unofficial role.\n\nThis was the era of the large tech trade shows like NCC and Comdex. You had to experience Comdex to believe it. The amount of work that goes on before the show opens is staggering\n\nIt is a little hard to wrap my head around why the upper management was so slow to respond to Delores. In my experience, most of them came up through sales. They should have had a clear understanding of why the company was participating and what the goals and expectations were from each trade show. Sometimes it was a show the flag effort. Other times it was to launch product. It was always an opportunity to connect with present and future customers. For us techies, we scoped out the competition.\n\nThe cost of a booth at a major trade show in those days was comparable to what it takes per square foot to build a house. This is for a period of roughly the week that it takes to put it all up and do a 3 or 4 day show.  There are a lot of aspects that run on cash. Cash, not credit card, not invoice and certainly not gift cards. For sales, it was all hands on deck. For techs, our big push was getting everything in the booth up and running. We often had a quarter million (in 1985 dollars) worth of equipment. In some cases, what was in the booth was a one-of-a-kind item borrowed from development. Gift cards? Pffft! Steaks and wine? There were nights when I would have killed for a day old hot dog. \n\nBooth selection for the next show is one of the most important duties for the person responsible. It is literally a corporate asset and screwing it up, even accidentally, would be cause for termination. \n\nThe person responsible for everything trade show was the MarCom Manager. In our case, this was Sue because, that wasn't her name. Nothing happened in the booth unless Sue approved it. We never opened a show at less than 100% functionality.\n\nNeither Sue nor I were a big fan of the shows once they actually opened. It is a different skill set manning a booth than the logistics of getting one out of the trucks and setup or striking it and putting it back to go home. We were never really off duty since things happen and we would have to go back in after dinner to get the booth all spiffed up and fixed for the next day. We did find time to have some fun with some games and challenges. \n\nMany vendors hosted special events. These were generally at the hotels and always involved food. One of the challenges was who could submit the expense report with the smallest entry for food and these events were one of the keys to that. The trick was to wrangle an invite with connections or bluff your way in. That was also part of the fun.\n\nIn Las Vegas we also played \"Spot the Hooker\". There were few rules other than mutual agreement if one of us spotted one. So, Sue I were walking the casino headed to the elevator when she gave me a shot in the ribs followed by a surreptitious, \"there's one!\" Score for Sue; short satin dress, fishnet stockings. We got into the elevator and so do the hooker and her John. The door closes and the John pipes up, \"Hi guys!\" What we have here is one of our VARs who had been invited to show his software in our booth. We politely recognized him and then glued our eyes to the floor indicator. So, the pair got off and he said good night. Sue and I collapsed in laughter as soon as the doors closed. He thought that he pulled it off, but boy did he look rough in the booth the next day.",
            "Million dollar mistake should've ended her right there",
            "This story warms my cold, dead, trade show manager heart. \n\nI did trade show management from the opposite side for years, as in you guys would have been my client and I would have taken care of everything related to the booth. And I would have had a fucking field day with Delores! My whole industry exists because people like her *think* they know better than unions, event center staff, shipping companies, and people like me. And I had plenty of clients over the years, ones with zero experience how shows work, that would always pull *something* (that we inevitably had already advised them against doing) that ended up costing them a large amount of money. Much like not arguing with a Jersey toll operator, one doesn’t fuck with a foreman at the Javitz (NYC conv. center).",
            "Wow. That reminds me of a story my friend told me during e3 dot com boom. It was the opposite. \n\nMoney flowed like wine. People were given $3000 credit to gamble. Dinners with many bottles of $200 wine and Cuban cigars, and coke of course. \n\nAt one dinner my friend was told to pick up the tab. It was over $25k for like 15 people. He did it ( and included a 30% tip) because the boss told him to. They approved all of it. No questions asked.",
            "I gotta say, this was one of the BEST Mc I've read. \"Just wait. Let her hang herself\". I love it!",
            "> The travel team expenses went from $110k annual on average to over 2-point-something million.\n\n> Finally top management got involved, who actually fought with Dolores for a year until she \"retired for personal reasons/to dedicate herself to her family.\"\n\nThere's something about this that either you don't know or you aren't telling us. No way this goes past a single budget review without her being replaced unless she's related to the owner or has blackmail on someone.",
            "I used to coordinate and attend trade shows often, and I’m still shocked that anyone from Finance would have that level of control over trade shows. There’s gotta be a huge disconnect with senior management at that company 🤦‍♂️",
            "Did she \"retire for personal reasons\" or was she hauled off by murderous centaurs. *Please be centaurs. Please be centaurs.*",
            "I’m a single person business and I’ve done trade shows before. That shit is HARD WORK.  I have to bring my best friend, because she’s a helluva salesperson, and I can’t mentally and emotionally cope with speaking to strangers for 8+ hours straight. Shit is intense and exhausting, I can’t imagine how awful it was once Delores started pulling her bullshit.",
            "People who do not have to travel for work should not be involved in setting policy for those of us that do.",
            "Man reading this made me so mad and I wasn't even there!",
            "I used to work for a company and would have to go to trade shows. Those days really sucked. Now I work for a company that attends the same shows as the company I used to work for. Now they are awesome. The last trade show I went to I had someone I am a customer of take me out to a steak dinner. There were 6 of us. The bill was almost $500. I went to a trade show a month or so before that and had someone from the company I used to work for buy all my drinks all weekend when we went to the bars after the show.",
            "Thanks for sharing. Well written and entertaining. This should be a case study at business schools and management training.",
            "This was such a wonderful read. Especially envisioning a squat, fat, woman all decked in pink shrieking at everyone and making up new rules along the way to suit her personal agenda. Absolutely loved all of this.",
            "What a great story. So very enjoyable.",
            "My guy you should also post this in r/nuclearrevenge that thing was soo satisfying to read when the bit where she had to do evrything herself came and it all crashed down. That is both Malicious Compliance and Nuclearrevenge.",
            "I saw that happen in my company. Not to that level, but they decided to “spend less marketing money” due to a business downturn.\n\nI pointed out that when business is bad is exactly when you amp up the sales, especially if your value proposition is saving the customers $$$ (including a guaranteed savings that we pay if they don’t hit the mark).\n\nLost a LOT of business. \n\nTwo years later we tried to go back but lost our premium spot at the big show for our industry. Took over a decade to get it back.",
            "Hmmm, if I'm paying for the travel, lodging, food, etc, it is kinda like a vacation. And I am damn sure not gonna do *any* \"work\" while away if I'm paying for it all... jbfc",
            "Awesome all the way down.\n\n> free Uline catalogs!\n\nLMAO My wife has picked up a few items for us at home from them (they use them at work) and holy shit we will stay warm this winter just burning Uline catalogs for heat.",
            "> including paying bail for the interns\n\n!!! 💀",
            "> No, we did not approve some union to give us power, you plug your booth stuff into an outlet or something. \n\nlmao! Did she think they would let you just drag an extension cord across walkways or something?\n\nDid she even know the layout of the trade show? Had she never been to one, ever?",
            "Husband used to work trade shows, and \"Oh, behold the mighty on his throne of Airborne Express stress squishies and free Uline catalogs!\" Is VERY relatable.",
            "You have a way with words. This was great. As someone who has attended conventions, fought with finance department over reimbursements, forced to share hotel room with coworker on business trip, traveled to places where the locals would only accept cash or *out-of-state* checks which means the company credit card was not accepted, etc, I could relate to some of this.\n\nThe best line was: 4 to 6 people to a room like they were a high school band. *nods head*.  Yeah, I can relate.",
            "I lol'd at squishies and free ULine catalogs!",
            "There is an IMPORTANT lesson here regarding the cost of authoritarianism and obsession over power.\n\nBut damn if I didn't realise it could be 40x more expensive than their alternative...",
            "Dolores means pains in Spanish. I don't know if you picked that name on purpose or it was just coincidence but it's a very fitting name for her.",
            "“Now we’re going to act like a REAL company.”\n\nSpoken by someone who has never worked at a Fortune 100 or 500 company before. I have never, even in the shittiest jobs in my career, worked at a “real” company who had policies like these.",
            "I am in finance and most of this crap is known to me.  This is beyond idiotic and clearly there was an issue with the hiring of Dolores.  Always read the contract and it is in there.  My guess is Dolores did not read contracts.",
            "Not going to lie, rule 5 seems like a good way to get a polite letter sent to the person responsible for it to the effect of \"Dear Boss, please rescind rule 5 so we can actually work without getting \"reminders\" every five minutes, or we will beat you to death with the ledgers and forge a memo doing it. From, the accounting team.\"",
            "It never fucking ceases to amaze me how much a company will let ONE PERSON fuck everything up.",
            "Hi. Finance worker here. I'd like to apologize for the actions of my finance kin. I'm glad to hear things got better for you in the end.",
            "Wow…I’ve heard of bad finance weenies but Dolores sounds like the worst.  And frankly if there’s fraud going on, it would be on Dolores to prove it.  Or to hire forensic accountants…\n\nI worked for a company that hosted customers at The Masters (golf tournament).  The executive assistant who went and was responsible for planning everything and making sure everyone was happy walked to my desk and handed her expense report to me and said “I didn’t drink all of that”.  Her booze purchases made me laugh.  The Korean customers had been there.  There was a rain delay so the Koreans drank.  A LOT.  Her boss signed off on her report, she had the receipts from the liquor store.  Why the hell would anyone assume it’s fraud?",
            "I didn't do trade shows, but I was on a travel crew installing stuff.\n\nWe all had company cards, no one abused them, and I got a lot of hotel points booking 3 rooms a week for about 4 years.\n\nOnly bad part was when Shannon rear-ended our other work truck in the work truck.\n\nAccording to the boss the repairs were almost exactly $500 less than they owed on the truck Shannon was driving.\n\nThe F250 utility bed of ours he hit didn't have a scratch. Or if it did we couldn't tell. Already had lots of scratches. And a dent from where Shannon backed it into a pole. He was just not a good driver.",
            ">Washington DC is not the same as Washington State\n\nThere's a story here. And I want to hear it.",
            "Rule number 1: My personal expenses on any work item cap at $20. Per event. I'll pay an initial parking fee or a tip or grab a drink out of pocket for anything close to $20 per trip or per event but anything beyond that I will stand around twiddling my thumbs for hours until finance department gets their ass in gear and pays for it for me. I will not expense thousands of my own dollars for the company and HOPE I get it paid back to me when I submit an expense report.\n\nCan't be arsed to get the travel plans in place properly before the scheduled trip even though you knew about it 4 months in advance? I will sit here at the airport/train station reading a book until YOU fix it at the company's expense. I will not be paying my own money for a last minute ticket and fight you for 3 months to get reimbursed because you fucked up.\n\nYour lack of proper planning does not constitute an emergency on my part. I am not responsible for making sure this goes smoothly and I arrive on time, you are since you won't let me book my own travel plans. So YOU can get stressed out finding out how to get me there on time.\n\nAlso to the whole thing of them saying that you never reminded them often enough... Fuck that. They get 1 reminder. Either let me handle the planning and set up a few event and trip myself or you handle it as part of your job and responsibilities. I am not your boss nor am I your parent and I'm not going to keep bugging you to do the things that you are responsible for. I have my own things that I'm responsible for and you are not on that list.",
            "Lesson of the story?\n\n\"If it AIN'T BROKE, Dolores, don't. Freakin'. Fix. It.\"",
            "Top management was at fault for not squishing Dolores like a cockroach at the first major downturn.",
            "As soon as I saw the show was DEFCON I buckled up.",
            "I'm sure Delores is now a Mod for a few subreddits",
            "Love this story. But a little disgruntled that it took management a year to kick Dolores out.",
            "Wait “The first year of this”??? What company did you work for? The first maybe second event where expenses multiplied by even 200% should have been a huge red flag. Who on earth would let her continue? Was the whole place a shit show?",
            "In the title, I think the word \"fraud\" tricked you into not saying \"fraught\". \"Fraught with fraud\".",
            "Very unhappy dolores got off scot free. Wish there was more liability and tears",
            "Corporate finance and specifically CFOs are the dregs of the universe.  Stay in your lane, bean counters.",
            "Even government-backed travel get's procurement a card in your name, and per diem for expenses. The federal per diem rate doesn't care if you eat steak or Micky D's.",
            "I worked at a place that went to Vegas twice a year for trade shows.... All employees who smoked were provided with a carton of their brand.... One of the many perks I enjoyed...\n\nAnd my per deim went to the sports books while I ate outside of the hotel.... 😉",
            "My sales guys are spoiled. Us lowly techs get to install the machines & set up the booth. They just show up and schmooze & leave after the show. Then we go back & pack everything up & ship it. In all fairness, I like our sales guys but I doubt they could install a CNC machine yet alone a few.",
            "I used to work in engineering and finance always struggled just with understanding how the contracts worked so this doesn't surprise me at all.",
            "In the dead of winter, they were forced to eat Director Dolores...and there was much rejoicing.",
            "I actually shared this on my computer train with random folks s and we laughed so hard! As people who live in Washington State, yeah, we are the ONLY Washington State and we have many, many cities...the \"other\" is a District! Lol",
            "Your story was great, but it almost hurts seeing her be able to leave \"for her own personal reasons\" instead of being canned and getting a bad reputation.",
            "So Dolores got her way and fucked over the company and then had a nice retirement when it suited her. Where was the down side for Dolores? sounds like even one including her bosses were compliant with her and she suffered zero consequences for it.",
            "Fuck micromanagers !",
            ">Finally top management got involved\n\nHoly fuck FINALLY!! I was reading on the edge of my seat the whole time waiting for the hammer to drop on Delores. But I’m sad it took that long. \n\nFantastic Malicious Compliance! \n\nI have a deep personal disdain for the Deloreses and other staff that bitch and moan about those working the trade shows.",
            "Had a sales job like this for 11 years, left the company for the same reason, never let finance be involved in anything. \n\nFuck Delores.",
            "She knew her time was limited, and was focused on abusing her position for as much personal gain as possible.\n\nChances are the way she fucked the company and people over helped her hit specific targets like \"reduce budget X by Y\". Regardless of if it meant it cost more in the long run.",
            "Funny how someone who chides others for not being confrontational enough, dips out when confronted.",
            "So I dunno if I ever had the pleasure of working for her specifically but I have one instance that sounds an awful lot like this. \n\nI’m on the convention freight side. We have lots of storage but it is finite. We charged ridiculous storage fees to keep people from sending shit too early. \n\nOne woman wanted to ship pallets in early. I assumed a week. Nope, 6 weeks. I notified her of the storage fees. The storage fees alone were tens of thousands of dollars more than her standard fee. She didn’t bat an eye so that threw me. Got all contact information and had her verify via email she understood the charges. Printed that out and pinned it to my board with a note of her arrival date. \n\nShe shows up, acts like she’s ready to pay the fee. The worker gave her the total and she said that can’t possibly be right and can she speak to a manager. I get the call, grab my paper off the board and head up to the business center. Introduce myself (doesn’t remember me), and she goes off on the fees and blah blah blah. I just handed her the email. Watching her just get stuck for a few seconds was so satisfying. \n\nPaid the whole thing on company card. Like. It was pallets of stress squishies and bottles and pens. She paid 40k in storage fees. I couldn’t believe it. Everybody else says “fuck that, send it back or trash it”. Never in my life had I seen somebody pay that much for so little.",
            "Never fight against union. Get out of their way and have beer ready to go when they are done.",
            "If you really want to screw a successful business, put an accountant in charge.",
            "That's absurd haha",
            "for the end of that... there comes a point where you probably could stall a dieing system and prevent more damage, but doing so will never allow things to be fixed.   Sometimes, the best thing to do is send a quitely worded direct e-mail about the issue at a time you know will be ignored, then let the whole system burn itself down.",
            "That's a lot of damage.",
            "This was one of my favorite stories I've read in a while. Thanks OP",
            "Should have asked Dolores to go for a fair herself with a gift card! And upper management didn't realize there was an impact in sales once the lottery began? If so, they bear at least as much fault as Dolores. \nAnd any more details of the aftermath? You left me hanging for more there 😉",
            "I now cannot read this story without picturing Imelda Staunton/Dolores Umbridge in full pink regalia trying to control the whole thing, complete with annoying giggle.",
            "> including paying bail for the interns\n\nWhat?! Please elaborate",
            "Wow they didn't go after her? I guess the moral is you can fuck everyone over and get away basically scott free. Disappointing ending tbh",
            "That Airborne Express reference really dates all of this.",
            "Just mentioning Defcon brings so much context on what you folks are into and what went down. I'm surprised that it took a year for the management to get involved. Based on what you just said, this looks like a major level fuck up.",
            "“Free Uline catalogs” got me…lol sorry I couldn’t help but to start laughing as I look over at my pile..lol I own a t-shirt shop and since I order equipment from Uline OMG the catalogs keep coming…lol",
            "My company does all the stuff for trade shows you would do yourself. Can confirm it's a red tape, union run nightmare in most cities, especially the big ones like NYC, Chicago, Philly, and Vegas.\n\nI'm all for unions but when you show up to a building that is \"union controlled\" and that means you need unskilled electricians (who in most cases are glorified extension cord runners) to set up equipment they have never seen before when you have a team that knows it inside and out, it's a fucking nightmare.",
            "She retired lol you all got punked by this lady",
            "Why the hell didn’t Delores get fired?",
            "You’re company is run by clowns. They let her do it and then didn’t even fire her. \n\nYour company deserves everything that they let happen. Total failures.",
            "Not quite satisfying enough for me. I wanted her to be fired in front of everyone,  have a meltdown and embarrass herself.",
            "Dolores tells people that they can’t just accept what the hotel desk, convention centre union, or toll booth attendant tells them, expects the people to fight until the service providers see things her way? Issuing prepaid cards that many service providers have a policy of not accepting (due to past problems with that method of payment)?\n\nHotel desk (in a city where hotels are sold out due to the convention): We don’t accept that card. You have 5 minutes to provide a means of payment from our approved list of I’m cancelling your reservation and telling a walk-in that they got lucky.\n\nConvention centre union: Union has a contract that certain types of work are “owned” by the union. Plugging in equipment is “owned” by the electrician’s union. You follow Dolores’ orders and plug in your own equipment? Breakers to the outlets in your booth get turned off.\n\nToll booth: Someone refuses to provide a means of payment the toll road accepts? Toll attendant calls the state police to haul the person away.",
            "https://www.youtube.com/watch?v=NmPhaG1ud38",
            "I missed the glory days of IT (or just never worked anywhere without strict beancounters)!",
            "Think what you want, Dolores, but the dollars don't lie...",
            "Sounds like the bosses were stuck in the sunken cost fallacy",
            "These people cause a huge amount of cost and loss of business to a company. Sounds like it took two years just to recover from the damage they created.",
            "This post is pure gold",
            "I am not even halfway through reading this and I fucking hate this 'Delores'. GODDAMN, I hope she got fucking fired for NOT doing her job! Reading on... \n\nOkay, cool. Too bad she got off scot-free though...",
            "How do I get a job doing this?",
            "You have written a movie. Damn good read.",
            "Wow, this was ridiculous and incredible. 4000% increase in cost, and she kept her job?! How ignorant and self-absorbed do you have to be, as a FINANCE manager, to not realize that YOU are the problem?\n\nAs a side note, while I don't have experience with trade shows, I used to do beer events when I worked at a brewery. Expos, festivals, etc. Not really the same thing, but same ball park. It was a no-brainer that things like lodging and food were paid for, with company cards. It was an obvious expense that got chocked up to PR/marketing/networking. Putting all that organization in the hands of someone behind a desk with zero experience with it would've been asinine.",
            "I remember doing a few trade shows for one company I worked for.  A few were in towns and cities, but my favourites were the agricultural field days.\n\nFunniest story I remember was when we showed off our field service capabilities by getting one of the kiddy rides going again by making a part on the spot for them.  That attracted quite a lot of attention to our booth.",
            "I'm 100% certain that woman has 5+ cats, is divorced, and drinks boxed wine.",
            "Re: Gift Cards\n\nFinance will tell you they are not gift cards because you'd be liable for income tax on them.  It's not relevant in this case but it's a common dodge to incent sales staff with these instead of putting money through payroll.  You give out the cards for work expenses (wink wink) to avoid the taxman.\n\nDelores didn't understand the why you do it.  It's completely the wrong use case.\n\nYou set a budget for tradeshows. You trust people.  Your procurement people set travel policy (first class vs business vs. economy, hotel rates, etc ). Then you audit after the fact.  \n\nNobody wants to lose their job because they expensed something stupid.  \n\nIf you're sending staff that don't need a company card, a prepaid CC is fine for incidentals and such only.",
            "One of my company’s expense policy is a tip couldn’t be more than 20% of the bill. \n\nAnything over 20% had to come out of your pocket.  \n\nNow, people had a habit of calculating 20% and rounding up to the next whole dollar, just to make the math easy on the receipt.  \n\nExpense reports got denied until the employee sent reimbursement for the overage.  \n\nSo people were having to write checks for less than $1 and send to the company.  A friend sent in a check for $.04. \n\nIt cost the company more to process these checks vs what the checks were worth.",
            "Great story-telling OP! It's a delicious tale!",
            "I was sent from Europe to Canada with 3 plane changes. The last plane was in Charles De gaule (or whatever is called in Paris). I barely made it to the plane because I had 2 h and there were thousands of passengers boarding different planes at the same time and not enough checkpoints. I was going for a 6 month training with only 20 kg of luggage (January-May). Winter time. I had a backpack with underwear and extra clothes and my laptop on hand. Basically a mule. I had to buy extra thermal clothes there. It was -30 and I had not enough clothes. Had to donate them eventually on my trip back. All this because the guy who bought the ticket saved 50€. On an international flight. It took me 24 h to get there.",
            "I use to coordinate trade shows all the time as part of my job. When I was getting ready to change jobs, the owner of the company hired this woman just because she was a suck up and really beautiful. She didn’t have a clue what she was doing. After I left I heard from friends who were still there how badly she screwed up. A trade show WE WERE SPONSORING… and she booked rooms and hospitality suites at the WRONG HOTEL!  I laughed my ass off. The owner was a jerk, and got what he deserved.",
            "Worked at a place where the new Head of Finance wrote the new travel policy. \nThe man never travelled nor left the office he worked out of.",
            "This is Gold Jerry, Gold!",
            "I live in Chicago and as such, take advantage of the fact that we can go to a lot of these for free as attendees to walk the show, get invited to afterparties, and do some networking. \n\nSomeone once asked “is that a good use of your time?” Suggesting that I should be doing other activities as part of my role (I’m sorta a field director type, I oversee service/sales people as a technical and sales head in one). I can think of no better use of my time than to get invited to an afterparty which is likely to have sales and technical reps at companies who will spill the inside scoop of their companies- contacts, connections, politics, in exchange for hanging out with the friendly happy Bastard that I am.",
            "\" . . . they are too scared of conflict! Except for with me! Why are they only willing to fight tooth and nail with *ME?!?!?*\"",
            "As the travel admin who had 34 sales members in 14 states, 2 countries and averaged at least one trade show a week for years …this frankly gave me anxiety (no shit I stopped about 3/4th down because I was heading towards a panic attack)",
            "As someone who has organised company stands at trade shows, reading this HURT ME. \n\nOh my goodness. I can't. I am completely speechless.",
            "I worked at a major corporation where the new CEO's policies were so draconian that he alienated almost everyone. When it come time for the annual stockholders' meeting, all the demo areas were filled with....vendors.  He apparently was so afraid of what employees might say or do that he didn't want them in front of stockholders.",
            "Is it just me, or every time something like this happens it's always a woman with something to prove? Not willing to listen to anyone who's been there longer, not willing to watch and see how things work and make proposals for improvements. Just wholesale, do it my way!\n\nUnderstand I'm not saying women are incompetent. I've worked a significant amount of time in academia and the corporate world and have had quite a few notable *excellent* female coworkers. But it just seems like whenever a massive fuckup of a story like this happens, you just get the feeling and... yep, it turns out to be a woman with a chip on her shoulder. Very off-putting and sets a detrimental precedent for the many competent women to be able to get an opportunity with someone like Dolores mucking up the works with their narcissistic incompetence.",
            "I've actually been traveling for work a LOT recently. Went from being a normal IT schmuck to traveling a few days every week, but traveling in general is so exhausting. I'm not traveling for tradeshows, instead in traveling to install massive machines all across the country. 1 machine takes roughly 6 hours, and then I have to train people how to use it. Each trip takes at least 2 days and I just had my big break (got to stay home for a whole month!) But now I'm back traveling around and it's just so much.\n\nTL;DR Traveling is not fun and games. It is hard, exhausting work and a good drink after is well deserved.",
            "Wait wait wait, how many of these 'gift cards' did these teams get?  150$, like the example you posted, wouldn't even cover half a day in a decent hotel.  Did everybody who was forced to use their personals get reimbursed eventually?",
            "She wanted to charge for trade show booth swag?!  She should never be in charge of a budget concerning trade shows ever again.  That's almost sacrilegious.",
            "that moment I read the part of her spending time with family and had the mental image of them pulling off a fred and george and running away from the house on brooms",
            "Holly fuckballs what a car wreck",
            "From which hole was she dug out from thinking that the world revolves around her and WILL cater to her whim and whine.",
            "As part of my previous job I attended fabrication related shows (think FabTech, etc) to network and look over the new technology and applications.  I'm not 100% accurate, but I can usually get a good idea of the company culture just by talking to the booth guys for 10 minutes.  I would have loved to react to a guy telling me I had to purchase a pen or hat; or someone who didn't know what they were talking about (that takes less than two minutes)",
            "I wanted to go to a conference once and submitted it to my boss, the head of marketing for sign off so I could send it to the finance team to pay.\n\nHe told me that if I wanted the company to pay he would have to get the CEO to sign off but if I paid for it myself then gave him a expenses reclaim he could sign off up to £5k.\n\nGuess who earned himself a bunch of air miles, credit card points and other perks then was repaid in full.",
            "[....and there was much rejoicing](https://www.youtube.com/watch?v=NmPhaG1ud38)",
            "That doesnt sound like malicious compliance. That just sounds like a company let a mean old lucky fuck it over.",
            "\"sales guys who were mostly gay alcoholics\" what a completely odd statement.",
            "TLDR?",
            "Dolores didn’t really lose",
            "“There was much rejoicing” \n\nAre you a hasher ?",
            "Looking for a TLDR here",
            "tl;dr ?",
            "Man just one bad egg and so many losses? You'd think this wouldn't be allowed to go on for so long, and it wouldn't be if Dolores was a man.",
            "That's the best story I've read all night.",
            "Wait, she didn't get reprimanded or totally get fired?",
            "I'm surprised that Dolores didn't sue for \"sexism\" and reach a multi-million-dollar settlement with the company.",
            "Had similar situation in previous job. Company gave us each a company AMEX to charge expenses to but we had to pay the AMEX bills and then submit those for reimbursements which would always get approved late meaning we were stuck paying late fees and interest. It was insane and accounting was absolutely ruthless about it.",
            "It's so important to not only know your own field but also understand how the field your company is in works.\n\nI work for a NPO church, we have had bosses that simply don't understand that a church is not a business. Not everything will make sense if you believe that it is.",
            "Still a bit bothered that you guys were unpaid volunteers for these work gigs",
            "I worked for a tradeshow company for awhile and have a lot of stories of clients making wildly poor decisions, but wow.\n\nI am still surprised that no bail was paid in Vegas or anywhere else, though.",
            "This is an AMAZING story and, omg, my blood was heating up while reading it to the point of boiling. Dolores. Oh we hate a Dolores.",
            "Just illustrates the point perfectly that most businesses succeed in spite of themselves and not because they are the best, or even good, at what they do compared to everyone else.",
            "was this post just more of the title?"
        ]
    },
    {
        "post_id": "a971js",
        "author": "PhillipeFlop",
        "title": "You want me to work the same hours every week? Sure!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a971js/you_want_me_to_work_the_same_hours_every_week_sure/",
        "score": 13099,
        "num_comments": 239,
        "created_utc": 1545673679.0,
        "selftext": "LTL, FTP, TL;DR at the bottom...\n\nIn my previous job, I reported directly into one of the company “directors” who generally trusted me to get on with the job, and manage myself. This included setting my own work hours, which varied week to week due to company needs, and also my own...\n\nAnyway, I (**Me**) got a new manager (**NM**) that was in between me and the director/now former manager (**FM)** I reported to. They were the sort of person that felt the need to micromanage and be in control of everything, despite having little to no understanding of what I do, and why my hours need to be flexible.\n\nNow, **NM** was purely office based, so setting regular hours that they worked each week was easy. As such they expected the same as me, and know exactly the hours I’d be working each and every day.\n\n>**Me -** \"Okay, seems reasonable, I’ll let you know at the end of each week, what hours I’ll be working the next week...\"  \n>  \n>**NM -** “Not good enough, you should work the same hours each week to make it simpler”.\n\nI voiced my concerns, and that I change my hours based on the needs of the business.\n\n>**NM -** “Well that can be discussed on a case by case basis”. \n\nAlright, we’ll see how that goes...\n\nA few weeks later...\n\n>**Me -** \"**NM**, I will be leaving early next Friday evening, as I’m going to my parents house for the weekend to celebrate my father’s birthday, I’ve already arranged cover and you don’t need to worry about anything\"  \n>  \n>**NM -** “Unacceptable, that’s inside your scheduled work hours”  \n>  \n>**Me -** “That’s unreasonable, it is no inconvenience to you and I’m giving you plenty of notice”  \n>  \n>**NM -** “ If you want to leave early, you’ll have to book the entire day off as holiday”\n\nNow I don’t want to use an entire days holiday when I only need to finish a couple of hours early - and I see the case-by-case basis we talked about was only ever to benefit the company - but I also see the opportunity for some malicious compliance (one of many I had with **NM**)...\n\n>**Me -** “Okay, fair enough, but I think we need a written agreement of these work hours so we have something to reference in situations like this”  \n>  \n>**NM -** “Absolutely, seems like a great idea”\n\nA few weeks later, **NM** emails me...\n\n>**NM -** “Hi **PhillipeFlop,** now I know you don’t work Thursdays, but there is an important meeting I need you attend. You can take this as time in lieu at a later date, just get my approval first”  \n>  \n>**Me -** “Sorry **NM,** no can do. That’s not inside my scheduled work hours we agreed upon. Please see your prior email \\[...\\]”  \n>  \n>**NM -** “This isn’t negotiable, you must attend. If you refuse I will have to inform **FM** that you refuse, and I will have to start disciplinary action.”  \n>  \n>**Me -** “I’m sorry, it’s not within my scheduled hours, and I have plans \\[*I don't\\]*. If you need to inform **FM**, then unfortunately you will have to do so”\n\nAnyway, having worked under **FM** for a couple of years, I know exactly what's going to happen next... **FM** gives me a call, asks why I am refusing. I explain the situation and he says he will talk to **NM**. **FM** obviously gives **NM** a bit of a bollocking and the next day **NM** pulls me to the side and says they're happy to go back to the previous arrangement I had with **FM**, provided I attend the meeting.\n\n>**Me -** “Not a problem, on that note, I’ll be leaving early Friday!”\n\nI walked away, **NM** looked furious, but knew they couldn’t do anything about it! I had nowhere to be, just wanted to make a point!\n\n&#x200B;\n\nTL;DR - get a new manager, new manager demands I set regular working hours, I comply and refuse to attend an important meeting outside those hours. New manager gets frustrated at this and goes to their boss (my former boss). My former boss gives them a bollocking and tells them to go back to the former arrangement.\n\n&#x200B;\n\nEDIT 1 - formatting",
        "permalink": "/r/MaliciousCompliance/comments/a971js/you_want_me_to_work_the_same_hours_every_week_sure/",
        "comments": [
            "> I think we need a written agreement\n\nAny half decent manager should have those megaman style **\"WARNING\"** on their head when they hear this phrase.",
            "Oh boy does this sound familiar.\n\nGot a new boss, new boss never bothered to learn what everyone’s hours were. I get moved to help out in another department, other department asked why I was coming in early and leaving early on Fridays. New boss accuses me of timecard theft. I keep a log of my hours and end up being paid overtime.\n\nIt’s management 101: Ask what the current arrangement is and why before changing it around.",
            "Dont you love it when they want to put something in writing that ultimately screws them over?",
            "[deleted]",
            "Yo get that FM a case of beer or a bottle of wine, they really came in on that assist. ",
            "[deleted]",
            "Gee it's depressing how often these shitty people get put in management positions where they can ruin everything!  Nice work OP.",
            "Ahhh this is so good. I wish I'd have thought of getting it in writing when I worked for a micromanager.",
            "If FM ever leaves and you don’t have FM in the company I’d recommend getting a resume in order......if NM is still there you will be screwed. ",
            "I was hoping it would lead to \"can you stay an hour late?\" followed by \"sure but you'll have to pay me a whole day!\"",
            "Great story, but what i love more is your username--it made me laugh\n\nEdit: Thank you for the silver! ",
            "That was a beautifully executed revenge.  ",
            "Sounds like NM didn't get approval for the change from FM before they did it did it. So how long before NM stop micromanging everybody?",
            "This shit fulfills me on a level that ***surpasses sexually***",
            "As someone who has direct reports, this is exactly what you should have done. Nicely done. \n\nEspecially if you are a salaried employee, or previous expectation was that you could flex your hours. ",
            "Brilliant and perfectly done!",
            "You played it well. I know someone who got a NM and then it blew up and was worse for everyone.",
            "This sounded like NM really just wanted to assert dominance.    \nOr one of those old school assholes that \"not at desk is not working\" regardless of what you actually do.",
            "I manage a team myself and people like NM drive me crazy. \n\nAnd it's even more ridiculous in our company - we have core hours during which everyone need to be present (say, between 10am and 4pm). You then set your working hours (total per day + lunch break) anyway you want around the core hours.\n\nPeople stay late regularly, slaving off, earning their salaries fair and square. During those times, there's no one from management levels above mine to make rounds and tell the team to go home. But if anyone shows up 4 minutes later than what they set I am immediately asked where my team is.\n\nI always protect them but no matter how many times I explain and push back the next time someone  is \"late\" it's the same conversation all over. It pisses me off to no end. I mean, do you really want for people to stick to contract hours? Are you stupid or something? Show some respect and appreciation.\n\nAnd just to clarify, people staying late is not a self- or immediate management problem. Industry we work in is experiencing downturn, people are laid off and everyone is seriously understaffed.",
            "Hahaha owned NM. Wtg on that. ",
            "So satisfying! Well done.",
            "**^(a happy ending)**",
            "Well played!",
            "And THAT, ladies and gentlemen, is how the game is played. ",
            "That felt good to read!... Love it! \n",
            "Flawless victory!",
            ">I had nowhere to be, just wanted to make a point!\n\nhaha best bit.",
            "I want to hug-five you. Like a hug and then a high five, but awkward and jumbled. \n\nJustice served. ",
            "Sounds like this shitty boss will be costing your company some staff",
            "\"bollocking\" is one of the best Brit terms America needs to adopt. Better than \"ass chewing\".",
            "I love this. It helps to have a good work reputation, especially if a supervisor with broad authority appreciates it.",
            "Liked the malicious compliance, but LOVED the formatting of this post. Very nice.",
            "What's LTL and FTP?",
            "Brilliant",
            "This warms my cold, dead heart.",
            "TL;DR at the bottom? My hero!!!!!",
            "You are my hero. Merry Christmas. ",
            "Makes me remember a minor MC of my department. \n\nEveryone in the company used to work 8.5 hours on weekdays and 5 hours on Saturday. But one day the owner realized that he was paying us 40 work hours weekly and we were working only 39.5. Wich was unacceptable. The solution? To work a extra half hour on Saturdays.\n\nWe had 1.5 hours to eat that were way to much time and the only purpose of that were the convenience of the owner. So my manager asked to reduce that to one hour an just like that we now work only 3 hours on Saturday with pretty much the same schedule on weekdays.",
            "Im Glad this worked out so smooth for you and you're back to your regular schedule. ",
            "Gives them a bollocking?  \n\nIsn't bollocks bullshit?",
            "You beautiful bastard you! Bravo",
            " your epic, like your name\n\n_flippy flop_",
            " Dept. Head to Night ops mgr. How dare you give my recovery associate the day off! Ummm that's the store mangers call. Dept. Head who are you going to replace him with. Ummm that's your job, don't you look at your department schedule. Me come back from Va Ca an email from my Asst. Store mgr. to store mgr. he doesn't work at all. I WAS ON VA CA. YOU ***hole. Don't like working for dumb ***t's. Went to night crew.",
            "gruess vom mäsi",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/checkmatemotherfucker] [You want me to work the same hours every week? Sure!](https://www.reddit.com/r/CheckmateMotherfucker/comments/a9cuoa/you_want_me_to_work_the_same_hours_every_week_sure/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "I never know my schedule. Changes on a dime. Had day off. Manager changed schedule. Had to use my leave time to take day off. ",
            "Way to stick it to manglement",
            "[removed]",
            "Bit off topic but what do LTL and FTP mean here? Googling only returns let's talk later and fuck the police/first to post/file transfer protocol.\n\nAlso I feel old now. ",
            "Still exhibiting a degree of insubordinance. If they have an opportunity to replace you they will."
        ]
    },
    {
        "post_id": "povzpr",
        "author": "oconnell6208",
        "title": "Your docking me two and a half hours a week for lunch whether I take it or not?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/povzpr/your_docking_me_two_and_a_half_hours_a_week_for/",
        "score": 13100,
        "num_comments": 1020,
        "created_utc": 1631730672.0,
        "selftext": "I worked for a prestigious Millwork we made cabinets and custom moldings etcetera. Very very high-end working with companies on tight schedules. I was the only truck driver. Company was owned by a husband and wife and the wife did not like me. They had implemented mandatory lunches for everyone in the shop and building etcetera. But due to the uniqueness of my position I usually didn't have to adhere 2 Stupid rules like that. And I knew it was just a way for them to screw the workers because a lot of guys were dedicated and would work through lunch. She finally caught up to me one day and was reviewing my time card and was angry and said I don't care you don't have any excuse you must take a lunch and I argued the point said that some of the materials I was picking up with critical she said I don't care. I think now is when I enter into the malicious part of this. So I would go pick up zebrawood that they needed right away at noon and after the load was loaded I pulled into Burger King and ignored any phone calls that my manager sent and got back to the shop 2 hours later and he was livid because he had three very expensive people standing around waiting for me. Needless to say I never had to take a lunch again",
        "permalink": "/r/MaliciousCompliance/comments/povzpr/your_docking_me_two_and_a_half_hours_a_week_for/",
        "comments": [
            "Never work for free",
            "Not sure the pride people have in not taking lunch breaks.  I could see a truck driver not having a set schedule but taking one between deliveries.  At my place (gov't office) we got an unpaid half hour which could be taken anytime (though usually between 11 - 1PM).  Some people worked through it and didn't claim it on their time card, thinking that they can get out a half hour earlier but they were cautioned about doing so.  Was allowable on rare occasions but not to be routine (we dealt with expiring funds, so getting a contract awarded before the funds expired was an allowable occasion - though a person would probably be working late that day, too).",
            "You should take a lunch regardless.  You have a right to one.",
            "In Florida I require my guys to take a 1/2 hour lunch and 2 15 minute breaks. If they don’t take them the leave an hour early.",
            "So you WANT to work through lunch? Why?  Isnt the time unpaid anyway?",
            "Stop what you’re doing and take your lunch break.  The work can wait.",
            "Why don't you want a lunch break?",
            "Mad how this was written as some kind of gotcha moment.\n\n\"Someone told me I needed to take a break during my work day, pfft I took the piss one time and now I don't have to take them anymore...\" What? Lol",
            "Depending on where you are, there may be a law that says you have to take a lunch break. She may not like you, but she's got to obey the laws.",
            "“Guys were dedicated and would work through lunch”\n\nDedicated and would work through lunch\n\nWork through lunch\n\nStupid and work through lunch",
            "So your malicious compliance resulted in you no longer getting a lunch break?",
            "Wow. I'm not sure how the boss is the bad guy/girl in a story about having to take a break. I do the same with my workers. I didn't care if it is busy, all workers deserve a break in their day. Happy rested workers are more productive. Maybe we delay or take breaks early but they deserve your breaks.",
            "As others have mentioned, they are probably complying with the law. Regardless of that, it’s their business and if they mandate a lunch break, they are within their rights.",
            "It's the law if you work full time.  You may be cool with the owners right now but if you have a falling out in the future you could use that against them.",
            "I would never skip a break or lunch.  Just like I absolutely will not allow vacation days to go unused.",
            "Where I live it's illegal to have your employees not take a lunch if they work a shift longer than 6 hours.  It's a law that prevents employers from denying their employees a lunch break.\n\nYou're posting about your employer making you take a lunch break; what are the laws in your area like?  Because there's no way in hell I'd want to live and work in a place where employers have every right to deny their employees a lunch.  And if one of my employees specifically timed their lunch to harm my company, I'd fire their ass that day.",
            "[removed]",
            "Dang dude, sorry but like everyone else commenting...you're the one screwing yourself over. This isn't malicious compliance against the owner, this is you maliciously throwing away your break time.",
            "The reason why they forced you to take a lunch break wasn't because they were trying to screw you over out of 30 minutes, it's because it's required by law and they can't turn in your timesheet without you clocking out for half an hour without them getting in trouble. So regardless, they have to define those 30 minutes whether you took it or not.\n\nThey're protecting their own ass from getting sued.\n\nYou and the other employees are dumb for not taking your lunch break and working through it, because it's not only your right but a requirement, and you're not getting paid during that time. And it's idiots like you that make other companies think they can force their employees to work during their unpaid lunch break too.",
            "Are you not screwing yourselves because you are working through a break you are not paid for? \n\nUnless you are at work for 40 hours and 2.5 of those are for lunch break? or as you at work for 42.5 hours and 2.5 of those are for lunch?",
            "I worked for a great company that understood I worked thru my lunch everyday. They would clock me out an extra half hr past the time I worked just so they looked like they were in compliance. \n\nGod I miss that place",
            "I can't say I've ever heard someone call lunch a stupid rule. Not only are you screwing your company over because lunches are required by law, not your employer. You probably aren't accomplishing any more with the 30 minutes you could've spent de-stressing from work. \n\nI've had plenty of leads that were so proud of how often they skip their breaks. They were either too strung out to do their jobs effectively or goofing off on company time because they didn't let themselves take a break. Nobodies benefiting from you doing this, take your lunch.",
            "The part missing from the story is that the owner just had to say “I’m not going to have to deal with a lawsuit for someone claiming OT for not getting a lunch break.  Our official stance is you are to take a lunch and I’m sure you’ll figure something out.”  \n\nThat would have been a reasonable way to handle it and also have everyone understand why.  The driver could have at that point probably taken his lunch after a delivery or figured something else out.",
            "You sure showed them by... Umm.. forcing them to let you work through your lunch break..",
            "You work through your lunch without pay? This is the lamest malicious compliance I've ever seen. You really showed them!",
            "In quite a few states this is a labor law issue, not a controlling boss issue. If you are clocked in too many hours in a row without a break, the company can face serious penalties. I would hope a company would explain this vs just telling you to shut up and listen, but it’s a very common thing.",
            "You shouldn't have taken such a long lunch during a single day. If you really want to be malicious though, no, you don't have to answer any calls on your 30 minutes or hour w/e is alotted to you.",
            "If I am not getting paid, I'm not working... I'm eating lunch. I used to go hide in a break room during lunch so people wouldn't find me and ask me to do stuff during my unpaid lunches (almost everyone else in the building was salaried except me and would work during lunch so they could go home earlier)",
            "Errr. I don’t understand. They don’t pay for lunch breaks so you left the workplace and then didn’t answer your employer’s calls for two hours? \nWere they insisting that you take a two hour unpaid lunch? Or did they mandate that you take a half hour unpaid lunch like a million other employers do? Not taking a lunch break, especially when you’re not being paid for it and your employer wants you to take a break, is a stupid flex. \nSpoiler alert: they’re not making you take a lunch anymore because you’ve demonstrated that you’re a childish goof. 🤷🏼‍♀️",
            "Some places will fire you for working through breaks.",
            "When I went salary it stopped mattering & now with fulltime WFH it matters even less, but once upon a time I was hourly.\n\nIn the good old days, we did manual timesheets and got paid 12.5 hours. Almost nobody took an actual lunch and we could leave once shift turnover was done so usually 10 minutes early.\n\nThen the [Bobs](https://maximumvp.com/wp-content/uploads/2017/11/2-bobs-office-space.jpg) came in. Not literally, but figuratively. They installed physical timeclocks (eventually went to web based), switched us to 8.5 hour shifts and mandated unpaid lunches. It went from easy going to clockwatching to avoid a demerit.\n\nI would clock out, set a timer on my phone, put in my earbuds and tape my \"Out to Lunch\" sign to my center monitor and zone out for 29 minutes. My favorite MC type event was when my teammates were already on the phone one of the more useless manglers (lets call him [Lumbergh](https://images2.houstonpress.com/imager/u/original/9727589/office_space.jpeg)) actually snapped his fingers at me and pointed at the ringing phone. \n\nI pulled out an earbud and asked him \"What, are your arms broken?\"\n\nHe snarled at me \"You need to get that!\"\n\nMy reply, \"I know your not asking me to work off the clock in front of all these witnesses...\"",
            "Requiring lunches is usually about respecting labor laws... this isn't really bosses being dicks. They can get into legal trouble if they make you work through mandatory breaks.",
            "Take your fuckin lunch breaks, there's no reward in heaven for people who worked 100 extra unpaid hours per year\n\nEdit: or in hell, normalising bad labour practice makes shit harder for other people too",
            "> a lot of guys were dedicated and would work through lunch.\n\nI get your position as a driver was somewhat unique, but we've gotta stop thinking of this as dedicated or anything to be proud of. Eating is a basic human right, and claiming you should be \"so dedicated\" to a company that you forego this just fucks over people who, ya know, want to eat and have a break - as it the implication is they're not dedicated",
            "There have been lawsuits because of people being forced to work through lunch unpaid. You opened them up to potential legal ramifications if a complaint was lodged. \n\nThis isn’t malicious compliance, it’s someone being a tool.",
            "Do you all not understand how labor laws work? If we don't record you taking your lunch during an 8+ hour shift we can get into real legal trouble. So take a lunch it isn't hard.",
            "[deleted]",
            "The boss makes a dollar, I make a dime, that's why I take long shits on company time.",
            "Take a lunch. Take a break. Labor warriors fought and died so we would have this \"luxury.\" But both employer and employee should communicate about the WHEN of the lunch clearly. In my state employers have to give you 30 minutes for lunch before the start of your 5th hour of work. I mean, you can work through that, but you aren't getting paid. They are bound by the law, so why make a point by working for free? Bizarre.",
            "Take a lunch if they are docking it from your hours. Fuck working through lunch. Im not a charity service for my employers.",
            "A lunch break isn’t to “screw the workers” you utter tool.",
            "I get docked an hour every day, we used to have \"no lunch\" forms that we would fill out when we didn't take lunch, until I started using them. The boss literally threw it back at me and said \"no\" and now we take an hour lunch no matter how busy we are, because, fuck that shit.",
            "You're honestly kind of just screwing yourself over by not taking a lunch break",
            "You would love the UK. Drivers have laws stating driving hours and breaks. They have to use a card that records the speeds, driving hours and break times, if you get caught cheating it's not cheap for the employer or the driver.\n\nI get 30mins for lunch and as its unpaid I never work during that period.",
            "kinda shitty that you're excited to not be able to take a break at work. stop normalizing that shit.",
            "I hate to say it but its a legal requirement for them to give you lunch. They can actually be sued if they dont.",
            "They are legally obliged to give you a lunch break (usually unpaid) and rest periods depending on the length of your shift. I believe this is true in all US states. They can have you sign a waiver and keep it on file, if you want to work through your breaks. But to prove they're not making you work without a break, it's necessary.",
            "I recall that while Texas has no laws forcing an employer to give lunch breaks. However, if they offer lunch breaks to a single employee they have to do it for all employees.\n\nIn california they are very strict about meal periods for non-exempt employees but what also sucks about CA is if you’re a salaried employee as of 2015 the company can force you to use paid time off to supplement if you don’t work a full 8 hour day. My company does this so the only real difference between being hourly and exempt is that hourly can get overtime. But, I digress. \n\nThe company get get in big trouble if employees aren’t noting meal periods on their time cards.",
            "Where I work, lunch is 1 hr and unpaid. so whether or not you take it or work through it doesn’t make a difference in your pay. That being said, there are labour laws employers have to adhere to and if they don’t they could get sued or written up by the labour board. But I guess every country, or state/province is different  🤷🏽‍♀️",
            "I don't understand the not taking breaks.  State law here in CA says you get 2 breaks and a lunch.  If it's busy and they ask us to skip we get paid - 1 hour regular pay plus 30 min of OT and they feed us.  I need the mental health moment - but then I'm doing phone support and not out doing stuff all day.",
            "We used to get paid for 8 straight. Then they started doing a mandatory lunch. Then they suggested that if we didn't want to actually take the lunch we could use the time, while we were clocked out, to drive to the next patients house. Nope! We all started taking the lunch and it ended up costing them money in OT because that half hour lunch would usually mean some of us were in traffic trying to get home to chart and couldn't finish by 5.",
            "I will never understand what is so cool about skipping lunch. I put my lunch on my calendar and unless something critical comes up I don't work through it. The skipping lunch culture can become toxic IMO.",
            "They asked you to take 2 hour lunch breaks? Right",
            "My state requires the employer enforce the lunch break.  There is this weird double talk regarding it though, where they tell you to take it between the 4th and 5th hour, but wink wink, you'd better not. They are legally obligated to clock you out for 30 minutes, so if you don't take your break, you are cheating yourself out of pay. I would often skip both 10 minute breaks, then add them to my lunch for 50 minutes of cell phone games or internet surfing before heading back to the warehouse at the end of my route.",
            "Congratulations on being allowed to work for free I guess? How is this malicious, you're only screwing yourself.",
            "Congratulations, you played yourself",
            "It's so bizare to read this from my point of view. I live in europe, it's flat out a law here, everybody get's 30min mandatory unpaid break when 6 hours of work are met. Employers usually make damn sure you abide by these laws, too. These rules exist to make sure you are able to have a break to support your physical and mental health, so no employer can legally deny that and order you to pull through the whole day. These 30min get deducted automatically by most systems anyways so you don't even have an incentive to skip breaks other than beeing a true workingclass hero /s. But that's just our socialist utopia here i guess?",
            "I don't think I'm from the same place you are; here they legally have to give you a break and there are potential penalties if it's found that you're not taking it. Is it different there?",
            "How has \"I screwed myself out of breaks\" got nearly 9k upvotes?",
            "Yeah! I get to work through lunch.  Fuck those guys!",
            "It feels strange reading this in a country where Lunch breaks are mandatory, to the point of you being written up and possibly terminated if you continue not to take them.",
            "In my work place we get half hour unpaid lunch, so one day I didn't go at my set time as we had a rush job on that needed to be done ASAP.\nI actually got scolded for not going on lunch amd finishing this job.\nSo next day another rush job, 10 minutes before lunch I get allocated this job as I know this job inside job, cue look of absolute horror when I remind them of the day before getting scolded for not going on lunch set time.\n\nReaction was almost as delicious as my lunch.",
            "Ehm, if you work 8 hours you're required to take lunch by law.  If you don't make your employees take lunch and have a record of it, they can sue you big time.\n\nShe was trying to protect her company by making sure all employees followed the law. You have to look at the big picture.",
            "In a lot of states you are required to take a lunch. Your employer has to show on their payroll that you are taking your legally entitled 30 minutes per 6 hours shift or whatever your state laws are.\n\nStop \"working through lunch\".  They don't give a shit about you and they can't legally pay you for that.\n\n> So I would go pick up zebrawood that they needed right away at noon and after the load was loaded I pulled into Burger King and ignored any phone calls that my manager sent and got back to the shop 2 hours later \n\nThis is not malicious compliance, this is stealing money from your employer in the other direction.",
            "Your employer is forcing you to take lunch because it’s the law, lol.  Working through your lunch break doesn’t make you a better employee, it makes you an exploited employee and will get your employer fined.",
            "This is so dumb.",
            "In the US, typically its legally not the employee’s choice to take a lunch or not.\n\nEmployment law dictates that.\n\nAlso, employers calculate financials based on people who are supposed to take lunch, taking lunch. \n\nThen there’s people who think “we’ll I worked through lunch, I get to go oh one early” (or come in late or comp that time). \n\nNo.  No.  \n\nYou doing that screws your coworkers or your employer by making it that they have to cover for you when you bail early. \n\nOr if you abuse overtime bye doing this, you throw off payroll. \n\nWork the freaking agreement you willingly and intentionally agreed to.",
            "> due to the uniqueness of my position I usually didn't have to adhere 2 Stupid rules like that.\n\n...is that written somewhere? I can't imagine there's a document anywhere that says\n\n> If you have the _unique_ position of \"truck driver\", you are allowed 2 skip whatever rules you think are \"stupid\", even if it's against the law\n\nI can't believe there are people who seriously think their employer wants to force _lunch breaks_ on people just to **stick it to them**. That is so absurd.",
            "No MC here, if you'd just taken a regular lunch it would be simple compliance and disappearing for 2 hours isn't compliance at all- just being a lazy jerk.",
            "You are legally required to have a lunch break. Take it.",
            "Huh. Your employer is making you take a break so you get angry and purposely Fuck up their business by taking your break at a poor time on purpose? \n\nWeird.",
            "You really need to take a lunch break every day.\n\nBut, if you are delivering a time sensitive order, contact your office and tell them what you are doing.",
            "I worked at a place that said 'lunch doesn't have to be 30 consecutive minutes' which was legally correct at the time but a real dick move",
            "Atleast they learned. Fellow truck driver here and the 2 weeks after the DOT 30 off after 8 on went out the window were the best 2 weeks of my trucking career.",
            "This is because by law employee needs to take a lunch once they have worked a certain number of hours.",
            "If they don't force you to take your lunch and you're in the U.S.A., they're liable if you claim they never offered you a lunch and can show on the time clock you never had one. Labor laws around this are very strict.",
            "> three very expensive people\n\nLOL, how much do they cost?\n\nI know what you meant, just found a little humor in how you said it. Didn't mean to offend.",
            "I'm maintenance and my company just mandated time windows that I HAVE to take break and lunch. It's annoying because both are much earlier than I prefer to take them but also bad because I could be right in the middle of a super hot machine and I have to stop fixing it and go to break. Then they call my radio asking for updates.",
            "Trash company in the north east got a big lawsuit over taking 30 min lunch out  whether you took it or not.",
            "I work in EMS so my job is a little different where I don't necessarily need an allotted break for lunch. That being said when we clock out there's a button we press that declares that we didn't take our lunch break so we aren't docked it. I also happen to be part of a union so they probably require you take a break due to union regulations.",
            "its also a federal law for work at or over 6 hrs. they have to give it to you or pay heavy fines.",
            "Lucky me, the state exempts my trade from unpaid lunches. (Transportation) I get paid for the time I am there to the time I leave.",
            "You know they might be required to give you a lunch break, right? Like do you understand that it might not just a “stupid rule”, and that they could face hefty fines from the state if they don’t comply? I’m sure they would rather have you work through the day too, if they could.. after all time is money. But regardless of whatever beef you’ve got with the wife, wasting 2 hours of their time is kinda shitty since most states only require a 30 minute break. Like I get it, it sucks… but they probably didn’t make up the rule just to fuck up your day, ok? Sorry OP, but you kinda missed the mark on this one. \n\nEdit: grammar",
            "There's some people where I work who will take their lunch 7:30 hours or even later into their shifts. So they have lunch then basically go home right after. I know there are laws regarding lunch breaks here but that just seems pointless",
            "Depending on your state, lunch breaks may be mandatory by law.\n\nIn California,  a half hour unpaid, and 2 fifteen minute paid breaks.  The employer can get fined if they don't insist.\n\nBut as far as getting mad, I don't know",
            "I used to be terrible about breaks. I was almost..\"proud\" to be worrying through my breaks. \n\n Then... we had a horrible outbreak after Thanksgiving on my unit that if I didn't take those breaks....I would have completely lost it mentally. Every since then,  I take breaks.  I need them,  I work better street them.",
            "In some places it’s illegal to not make people take lunches.",
            "I read somewhere to put lunch on your calendar as busy time. I kept getting meetings scheduled during lunch, so I put it in there. Now I always have an hour for lunch.\n\nIn my case, it's because I'm working remotely work people in lots of different time zones. The scheduler thing suggests meeting times that folks show as \"available\". It's really hard to keep track of who is where, especially now that folks are talking a vacation somewhere away from home for a month and working for a chunk of that. One of my coworkers is currently 5 hours off of their usual time zone.",
            "I’m not sure, “… and I never had to take another break from work again,” is the big win it’s being presented as, here.",
            "I get you want to sound like an MC badass, but I know atleast in the UK it is illegal for drivers to not take breaks, to the point their driving and breaks are recorded.\n\nCompanies can get into allot of trouble for their drivers not taking breaks.",
            "In the USA, it is actually against labor laws for the employer not to give the meal break, and one can actually be fined with the employees habitually do not take their break.  By forcing the break, it keeps everything legal and it is healthier for the employees and work environment.  It's actually the employees that cause the problem.  Working at your desk while eating is illegal too.",
            "Lunch is lunch, unpaid. Unpaid means I'm not working. One place I'd just eat in the car because I didn't want to get hassled for anything lol",
            "I'd say it's probably a legal requirement. They can get into serious trouble for not providing breaks after a certain number of hours work (varies depending on country and state. I think in South Australia where I live, its half hour break for 8 hours work).",
            ">\tetcetera.\n\nWell at least I know why I was reading this narrative in Yul Brynner’s voice.",
            "It's not legal in the US to deny anyone lunch breaks. If you don't get a lunch break and you're Union there's meal penalties which are way more than if they just paid you for the time.\n\n..and if you're not union and you don't get a lunch break, you can report them to the labor board and have them HEAVILY fined.",
            "Your employer is required by federal law to give you a 30 minute meal period (unpaid) and two 15 minute rest periods (paid). Take them. You should be demanding them, in fact.\n\nThis is a constant battle with a few of my employees. I don't get the pride in working yourself to the bone. Take a fucking break. You're going to have that time deducted anyway.\n\nNote: we do it similarly to your employer. Punch in and out for the day only. 30 mins is deducted automatically if an employee clocks over 5 hours.",
            "Had the same thing when I worked as a night manager in a hotel. They used to take an hour off for lunch every \"day\". I finally pointed out that I don't get an hour off as I'm the only one there.\n\nThey argued it was a legal requirement so I said to them ok from now on I will take my hour break but if the phone rings or the door goes or the fire alarm goes off I will just ignore it until my break is finished. Needless to say they very quickly changed their minds and I was paid for my \"lunch break\".",
            "In my state a half hour unpaid rest period (lunch) is required by the department of labor for anyone working over 6 hours. The catch is you can \"waive\" that right by signing a simple affidavit. And and a lot of places require that affidavit so you can \"mind the store\" alone. Not me, I take every break I'm owed.",
            "we get paid lunches at work due to how fluid our schedules are. never know if you will get interrupted while eating or what times you will take a lunch so we just all said fuck it and dont bother trying to find a slot. pay for the whole day.",
            "Had an employer that docked me, even while I was out on the road most of every day.\n\nThey were taking the time, I was going to use it.  I vowed to have a sit down lunch, with real utensils, every day while on my route.  The cell phone was either off or left in the truck.\n\nThey would get pissed when I wasn't answering during that time period, but had no recourse.",
            "Technically, truck drivers are required to take documented breaks per DOT regulations (in the USA). Two 15 minute breaks and one 30 minute per shift.",
            "30 years ago,  in MA I was working on a farm.   I was required to take the lunch. It was law.\n\nI'm not sure this post went the way you wanted.",
            "Maybe I missed this, but why did you arrive 2 hours late after a 30 minute lunch?",
            "You're",
            "Hi business owner here,  I know no one will see this but.... it's against the law to not allow for a lunch break. Every 3 hours you must have 15 minutes break or 6 hours you must have 30 minutes minimum. \n  They aren't trying to screw you out of time worked they're trying not to be in legal trouble incase they get audited or if an employee compkains to your states department of labor. Which is probably what happened. So to circumvent this issue people who actually work through their lunch break and don't mind it typically add 30 minutes to their time at the end of day. At least this is what my guys do and what I did when I (usually gladly) worked through lunch. I prefer not to eat at work cause it makes me tired. \n  She should have told you this and not doc'd your pay but alas we are human and fallible. Especially those of us in positions of \"power\". You should talk to your manager and ask if you can add 30 minutes to your time for the day if you don't take lunch so they can still take the lunch period off as to be compliant with the law. Unless however your adamant that you need a lunch break in which case might I suggest finding a more opportunistic time, because if it were me I would have just fired you and hired someone who wasn't going to play games with my guys and my money.",
            "Some employers are required by law you make you take lunch\nSo you not taking it could get them in trouble. You could turn around and say they didn’t let you",
            "I used to work at a restaurant and I didn't get breaks, we had days where my boss asked me to stay late and basically work a 12 hour shift with no breaks. I refused, of course, but ever since then I've learnt that you need to set boundaries and stick to them in the workplace. No I can't work this Friday. Why? I have prior arrangements. What arrangements? That's personal. Can I skip them? No, I will not be available this Friday. You'll have to find someone else. I have to find someone to take my shift? No I don't, because I'm not able to make it regardless. Either you schedule someone else or work understaffed. Look out for yourself! Your employers (usually) won't.",
            "The mandatory lunch thing, depending on where you live, could be a legal thing. In some places, you have to take an unpaid lunch break every so many hours that your work (where I live, it’s 6 hours). \n\nMalicious Compliance still fits though",
            "Working through lunch is a liability for employers because most states have mandatory break laws. Like in IL, if you're scheduled to work I think more than 5.5 hours, you are entitled to an (unpaid) 30 minute lunch and a paid 15 minute break. \n\nSo if employees are not taking breaks by their own choice, and then later claim that their employer doesn't permit the breaks, and the time cards back up the employee claim, the employer is liable. So often employers will automatically put lunch on timesheets to encourage employees to take the lunch because working off the clock isn't allowed either, or require the employees who work through lunch to book that time to a separate time code, and add an attestation that they did so of their own free will. It's a CYA on the employer's part. \n\nI'm an HR technology consultant who often had to build this functionality into systems.",
            "What state or province you live in? Labour laws in many jurisdictions mandate you take at least a 30 minute uninterrupted break for every 5 hours of work. The employer has no say on the matter. You should've been disciplined for not taking that break TBH.",
            "As a manager, if your subordinates are getting docked for a lunch that they aren't taking because they're working hard, you're suposed to stand up for them \n\nIf youre ok with them getting fucked out of lunch pay, but not when it happens to you, you're literaly garbage.\n\nSeriously, fuck you.",
            "No, take yoir fucking lunch, just be fucking flexible about when it happens. This isnt really a mc its just stupid on both parts.",
            "Bragging that you don't take lunch isn't much of a brag. You should take your lunch and breaks mandated by law.",
            "[deleted]",
            "[deleted]",
            "I’m assuming this is in America and lunches are mandatory and my company is pretty strict about a break after 5 hours, otherwise HR lets you know because they can get in a lot of trouble. Worker’s rights and so forth, which are extremely important. People get tired after working so many hours and it’s a liability. You really should take a lunch for your own sanity and health, but it’s understandable that sometimes you can’t always take one at a set time. Even 30 min lunch that can be flexible for you. I usually take a lunch between 12 to 2, but unfortunately shit happens and I clock out at 4pm to take lunch some times.",
            "They made you because the HAD to, it’s literally the law. \n\nBut hey, screw them for trying to ensure you received your legal rights.",
            "Errr...\n\nSo... assuming you are in the US, those \"mandatory lunches\" are mandated by 21 states. Your workplace was probably pissed off at you because you could be violating the law, and it would be the company that gets the screwed. So, assuming this story is even true: congratulations, you potentially forced your company to violate the law, or lose business.\n\nAlso: Those lunches are often 30 minutes, not 2 hours. I hope you get a write-up and check yourself.",
            "Quite honestly you should have been fired. You do realize that it's a federal requirement that everyone take lunch? It isn't a stupid rule, you're stupid for working through your lunch.",
            "Ehhhh... I used to work in the legal industry. Employers in many states are required to make best efforts to ensure employees are taking lunch breaks. This is in response to wage theft claims made by disgruntled ex-employees. Maybe someone at your company filed a wage theft complaint at the state board and now they are being investigated so need to be on high alert to go by the book. \n\nThe problem here is you took a two hour lunch break when you're being docked 30 minutes a day. I don't see this as malicious compliance, just maliciousness.",
            ">They implemented mandatory lunches for everyone\n\nYou mean followed federal regulations?",
            "This is the shittiest malicious compliance ive ever seen.",
            "Here’s all I need to know:\nYou’re too special to follow rules and you\nblame someone who “doesn’t like you”.",
            "Maybe if I add a little bit to this. So in an 8 hour. We would get a couple breaks of 15 minutes each and half an hour lunch that like I said it was implemented to save money I'm a hundred percent sure. I didn't appreciate I was being forced to take it when it was convenient to them the end of the day skip lunch get this product for me skip a lunch skip a lunch skip lunch. So I would stop with one of my 15 minute break grab a burger and as a truck driver drive to the next stop and be fine looking forward to 2 and 1/2 hours every week of overtime because I didn't get to take my 30 minute lunch and a normal fashion. It may look like I was stealing time but I Justified it as my break time allowance"
        ]
    },
    {
        "post_id": "nzbz07",
        "author": "L0gixiii",
        "title": "\"When I say no salt, I MEAN IT!\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nzbz07/when_i_say_no_salt_i_mean_it/",
        "score": 13096,
        "num_comments": 854,
        "created_utc": 1623636193.0,
        "selftext": "So this was well before Covid, so I might be fuzzy on the details, as this was back when I worked at a burger joint in the middle of a small city. A small one, but it gave me a chuckle, and I was reminded of it after reading an earlier post about someone falsely claiming a salt-free diet for a party.\n\nSome dude walks in, with the *most condescending* look on his face as he looks around our establishment. We advertised as a place which catered to dietary needs, including vegetarian, vegan, organic, and religious diets, and this dude at least doesn't look like the type such a place caters to, but I don't get paid to judge. He orders a typical burger (the joint's default), but with no salt on the patties. Not a problem, people have done this before, we easily prepare an unsalted double patty burger.\n\nThis time, however, when he bites it his face is a look of disgust.\n\nMe: Is something wrong, sir?\n\nCustomer: There's way too much salt on this burger!\n\nMe: That's strange, we didn't put any salt on your burger, as you asked.\n\nCustomer: As if! When I say no salt, I MEAN IT! I am on a no salt diet as per my doctor's orders!\n\nMe: Oh really? Well why didn't you say that to begin with? Let me just make a new burger for you.\n\n&#x200B;\n\nCue MC. Our place had special policies the moment a medical history or specific diet was mentioned.\n\n(4 minutes later, handing him a lettuce wrapped double patty with no pickles or bacon)\n\n&#x200B;\n\nCustomer: The fuck is this shit? This isn't a burger!\n\nMe: Actually sir, it is a *properly* salt-free burger, as you requested.\n\nCustomer: But there's not even a bun!\n\nMe: Our burger buns are made with salt.\n\nCustomer (now studying the burger closely): Where are the toppings I asked for?!\n\nMe: Our bacon and pickles are both heavily salted. Since your salt-free request is a result of a dietary restriction, not just a request, we are obligated to remove any instances of the ingredient in question. Don't worry, we didn't charge you for the bacon.\n\n&#x200B;\n\nThe customer then bit into the burger, stating that it was terrible. Not just that the lettuce wrap was far inferior, but that the meat was tasteless. Well I'm sorry sir, but not only did *you ask* for no salt (hence the tasteless), you triggered our establishment's dietary policy by making your request based on a medical need.\n\nMy manager had to explain to him that if he wanted a new burger, he would have to pay for it.\n\n(Edit: clarifications)\n\nEdit 2: To clarify, yes we took dietary restrictions seriously, it wasn't just some bullshit for marketing. That's why we had to change the order so drastically, otherwise I wouldn't have bothered. Yes we were aware that salt dietary restrictions are very serious for some people, that's why as I stated in a comment when someone did mention it as being a dietary restriction, we typically asked for more details, like if bread was still okay. Some people even switched to vegetarian or vegan burgers. I usually tried to warn them when that happened, because our veggie burgers weren't impossible burgers or anything, they were literal vegetable patties and they weren't that good imo. However, we'd dealt with enough malingerers (people making up diagnoses for attention) that we were pretty sure about this guy.\n\nNo we did not normally treat customers like this, people were generally much nicer than this, and those that weren't were usually easily spotted & caught malingerers. We'd comp'd or remade meals for people plenty of times because we screwed up the dietary needs on their order.\n\nNo I do not think this particular customer really had the restriction because 1. he was surprised to hear that bacon and pickles were super salty, and 2. he got angry with *us* for trying to adhere to his restriction.\n\nIf he really did, I wish him the best in that endeavor, and I hope we didn't turn him away from adhering to the restriction, but don't be a dick to the people trying to help you. This wasn't a malicious confrontation until he started getting angry because of the taste of the first burger.\n\nNo you cannot visit (or boycott) the place now, because both locations in my state already went bankrupt months before the pandemic in the US. Turns out the places had never made a cent in profit in the 6 years they were open, because advertising a $7 burger primarily to people who don't want to eat at other burger places is a *terrible business model*. There's other locations open, but only a couple in California and like a dozen in the Middle East. I can't speak for them.\n\nNo I did not edit and repost someone else's story for Karma, the story that reminded me of this was of someone going to a party at a house and very strictly demanding no salt in any of their food. This was a customer at a restaurant I worked for, not a guest at a dinner party.\n\nEdit 3: Thank you kind strangers for the awards and gold! Never thought this post would be this popular",
        "permalink": "/r/MaliciousCompliance/comments/nzbz07/when_i_say_no_salt_i_mean_it/",
        "comments": [
            "We once had a guy who claimed all kinds of different allergies (three different times in 15 minutes the allergens kept changing) and was enough of a jerk with specific and frankly not possible changes. \n\n&#x200B;\n\nHe eventually changed his tone and \"it wasn't an allergy after all, more of a preference\" once we couldn't, not just wouldn't fulfill his requests. Unfortunately for him, we heard allergy, we couldn't just accommodate and take that risk of triggering his allergies after that. \n\n&#x200B;\n\nMaybe he shouldn't have been such a prick about it.....",
            "I love when people make up a medical condition to get special treatment and it bites them in the ass.\n\nEdit just to be clear: I'm not saying low sodium diet isn't a thing. I know sone people have to watch their salt intake. This guy doesnt, or is incredibly new at it. If your doc has you watch your salt intake, you definitely know bread and bacon contain salt and you wouldn't be surprised by a baconless lettuce wrap burger if you aksed for no salt.",
            "I like trying new cuisines when i can, but it is so damn difficult when you are allergic to nuts & seafood. So here goes, bear with phone format please!\n\nThe amount of beautiful oriental dishes i have practically salivated over the sound of... have fish oil and such in sauces. Always some component so far!\nThen my nut reaction is getting worse... i ordered a chocolate waffle from a dessert place with my GF. And we specifically called the restaurant to confirm no nuts, just chocolate sauce.\n\nI took the smallest bite and my mouth and tongue started to swell quickly and feel hot and weird... turns out it was nutella!! Girlfriend saves my ass basically as im fortunately on a lot of anti allergy crap (long story)..she calls them.. the man on phone never told the chef, the chef swore loudly and stormed off to find the owner, we hear a \"didnt know nutella contained nuts\" in the phone background.\n\nWanted to basically pay us off with money back (only to spend with them..nty). Argument ensued and i told him the safety stuff i could get enforced... \"do it then\" was his reply\n\nSoooo....lol;Called the very well known delivery app, got full refund etc, a full investigation & the company was delisted due to safety reasons for at least 6 months...\n\nTldr: idiots dont know nutella has nuts in it & gives to an allergic person (bite only thankfully). Bad place had no communication or safety, tried to fob us off & got the fullest extent of what we could enforce via the app owners.\n\nNever ever say \"do it then\" to someone youve injured and has just suffered..they will fight back...",
            "I also read the post about the dinner guest who insisted on no salt. \n\nDo people really not understand the purpose of salt!?!Sure, if you add a ton you can taste the salt but in general it's purpose is to enhance the flavor of what you put it on. On top of this, and I'm not an expert, but I know the human body needs salt and will not function without it. Low sodium diets are a thing but no a sodium diet?",
            "I hate it when people come in to my restaurant and claim to be vegan but the can have bacon if it’s on a separate plate. Or people who claim to have Celiac Disease so they can’t have a bun but they can eat breaded chicken tenders. This second example is my mother, lol.",
            "My fav was at one of the places I cooked. Lady claimed a gluten *allergy*. They refused to serve her any beers (none were gluten free), or fries (only 1 set of fryers).",
            "My daughter is allergic to bananas and kiwi. She used to eat them but stopped because they made her feel bad. She thought they tasted like licking a battery, but thought that was normal.",
            "I worked at a restaurant when the whole no gluten fad was going on. Since someone that actually had the allergy could get seriously sick we took it very seriously. \n\nSo any time someone asked for a gluten free something we’d tell them it was no problem but that it would be 45 minutes before they got their food. You see we had so do a deep clean of that item’s prep area to be sure absolutely zero gluten got in whatever they were ordering. \n\nSuddenly a lot of people became a lot more gluten tolerant.",
            "I’m glad this guy got what he deserved, but people like him really ruin that kind of thing for people that really need it. \n\nMy mom has recently developed an onion allergy, so she always asks for no onions. Last time we went out to a restaurant, she asked for no onions, said that she was allergic to onions, and the waitress was like “okay.” Mom gets almost completely through with her food and then notices a big chunk of onion in it. She asks the waitress about it and she says “oh yeah they just cook it with onion in it. 🤷‍♀️” mom says “okay but I’m like allergic.” The waitress actually says “oh” and just walks away, and that was that. Bizarre",
            "Arrr this annoys me.  I’m gluten intolerant, have been for years.  On a trip away I had someone say they were as well.  Thought it was great, until we got to meal times.  It’s funny how quickly their intolerance went away when they saw the meal choices.  They came clean that they were just trying a different diet.",
            "My dad does this. It’s terrible. Some people are massive control freaks and demand the strangest things. “I’ll get a burger with no tomatoes, another burger with those removed tomatoes, I’m not paying for them since they came in the other burger!” Insane.",
            "I once had a customer order fries without salt, but she was one of the crowd that had the idea that if you alter your meal it has to be made fresh.\n\nSo we made a separate batch of salt free fries. She comes back a few minutes later to ask where the packages of salt are... Luckily for me i got to tell her we ran out",
            "I have a dietary restriction - I must have extra bacon on my burger. Doctors orders.",
            "Ooh, another \"no salt\" post. [The last one](https://www.reddit.com/r/MaliciousCompliance/comments/ns50b0/my_meal_must_be_saltfree/?utm_medium=android_app&utm_source=share) was entertaining as well. Thanks for adding this one :)",
            "As someone with an actual salt restricted diet (like every other cardiac patient in the world basically), this was a very satisfying read.  Thank you, malicious complier, may you have a lovely month.\n\n(Btw: vinegar, garlic, roasted garlic, salsa with chipotles or jalapenos, mustards are my preferred low-sodium substitutes)",
            "Doctor: “You’re on a no-salt diet”\n\nPatient: “I should go get fast food burgers”",
            "I said no salt, NO salt on the margarita but it had salt on it",
            "That kind of behaviour always makes me feel bad and awkward about needing to ask about everything that's in a place's food.\n\nTypically I'll pre research a place and have a safe shortlist, but spontaneously going somewhere with friends is a minefield and I feel so terrible that they need to accommodate me.",
            "Doesn't want salt. Complains it doesn't taste of anything. \n\nYes, that's why we use salt...",
            "My favorite thing in the world is seeing entitled costumers get served exactly what they asked for.",
            "“Excuse me? Excuse me, señor? May I speak to you please? I asked for a mai tai, and they brought me a pina colada, and I said no salt, NO salt for the margarita, but it had salt on it, big grains of salt, floating in the glass.”",
            "I was hoping you'd have salt-free buns. Those aren't bland, but actively nasty.",
            "I had to try no salt for a doctor ordered exclusion trial.  I wouldn't have even thought to try fast food, or make somebody else pull that off for me.  Cooked everything myself.  \n\nLuckily it was only a week cuz it was damn hard.",
            "Claiming a medical condition is one of my extra pet peeves as a professional cook. \n\n\nI always take them seriously, because it's not for me to test it and potentially make the customer sick.  For every person with a legitimate condition, there's ten people who want special treatment and to be extra catered to. I def saw this with the whole gluten free craze.  Customers would order thier food gluten free then have three beers with thier meal.",
            "I work in a Chinese takeaway where we serve soups. Lady called in and said she was ALLERGIC to salt. If you know Chinese cooking, you know it has a lot of salt and some msg in it. She ordered a chicken noodle soup but NO SALT. Ended up giving her soup not made from the broth since that has salt in it and with boiled noodles and chicken. After catering to her allergies, she rings back and says everything is delicious but her soup has no taste????? Yeah wonder why, just say you want less salt next time. We knew she would call back so we were mentally prepared to give her another soup if she’d come and pick it up.",
            "I remember that no salt dinner post. Classic.",
            "Once had a patient say she was allergic to the lower dosage of a narcotic, but wasn’t allergic to the higher dosage narcotic 🙄",
            "This is hilarious because my grandpa has a heavily restricted sodium diet for medical reasons. You get what you ask for and no salt things if you're not used to it are bland af.",
            "As someone who works in the food service sector, people claiming medical needs for a dietary restriction and then blatantly asking for the standard fare after their restricted diet food has already been prepared are my pet peeve.",
            "Is he a slug in disguise?",
            "Who the fuck is on a salt-free diet and walks into a burger joint?",
            "hahaha i love it! play crappy games get a crappy burger as a prize!",
            "Manager should have explained to him instead that he was now marked for life in this eatery, and that he'll never ever get anything even slightly salted there.",
            "When I worked in sandwich making hell, people used to get decently offended when I'd ask if their desire for the gluten free sandwich bread was due to preference or allergies. The thing is we have the same situation, if it's for an allergy we had to have one person leave the line, wash hands up to arms thoroughly (doing this was standard but you had to be extra careful), change into fresh gloves, and follow that sandwich from start to finish making sure to touch NOTHING that had even the slightest chance of coming into contact with the regular bread. Can't use the toppings set up on the line, can't use the knife/spatula on the line, bread must be sent through toaster wrapped in tinfoil, all toppings and sauces have to be pulled from the cooler to ensure no contamination, etc.  It throws the whole operation out of whack, especially during a rush, so if you just prefer the gluten free bread and aren't allergic it really helps to know so we don't fall behind and end up with customers screaming at us for being too slow.",
            "That reminds me of my wedding. Friend's wife said for years she had to be gluten-free and, in hindsight, I recall her dodging the question of whether or not she had Celiac's very artfully. So we all thought she did. Even my friend helped her keep the ruse up. \n\nSo my wife and I are preparing our meal choices for our guests and the venue offers a gluten-free option. We mention we're having a guest who needs the gluten-free option as she has Celiac's disease. OK. It'll cost about 75% more than the per-plate cost of the other two options because it's a special request so it won't be cooked in large quantities, whatever. We're taking care of a friend with a medical concern.\n\nWe get their RSVP back and she's selected the chicken. A very not Celiac-friendly chicken. Gluten-free was crossed out because my wife and I pre-filled hers in when we sent it. \n\nWe called her up and asked \"What's going on? I thought you had Celiac's?\"\n\n\"No, I just thought Glutens were bad for you and made you fat.\"\n\nSo we made her take the goddamned Gluten-Free meal. Enjoy your flavorless whateverthefuck while the rest of us are eating well. To this day, I pick on her about it. Not because she fell victim to some misinformation online. Because she had every opportunity for YEARS to say why she was gluten-free and dodged the question because she KNEW it was wrong. And we paid about $260 for her to be there. Nevermind the people that RSVP'd Yes and then no-showed, we lost about $1,500 paying for their meals, but this one irked me the most.",
            "Salt free and asked for bacon. I love it",
            "I dunno why but I really like these \"no salt\" stories.",
            "[deleted]",
            "He wanted a salt free burger but asked for PICKLES. The amount of stupid astounds me.",
            "I am personally on a no salt added diet since I’m born. So the meal you served him sounds legit appealing to me lol \n\nFood without salt for me taste like the real thing, I can notice all the subtle layers of flavours and I enjoy them very much.\n\nI find it weird when people say that \"salt enhance flavour\"...For me salt doesn’t enhance but alter and hide the real essence of food. \n\nI’m on that diet unintentionally though..\n\nMy father has hypertension and my mother always cooked without adding any salt (except in her own plate) since I’m very little, so I just never got used to salty and fatty food and literally get nausea if I eat too much salt/fat. \n\nGood side:  I can’t stand fast food. Which is good for my health. \n\nBad side: There’s only a very limited amount of meal I can enjoy in restaurants. Everything is too damn salty lol. \nEspecially seafood for example, I only get them at home so that way I can \"wash\" the salt of them with water lol",
            "It’s also important to know low salt is a thing (almost everyone that doesn’t consciously avoid salt is likely ingesting too much). A no-salt diet is not a thing. It would be pretty much impossible, and you would die.",
            "I wish more places had common sense. Im allergic to strawberries. I asked for dessert WITHOUT the strawberry garnish. You would have thought I asked the server to cure cancer. Just leave it off (they stick them on as they leave the kitchen. Just dont).  I have also gotten them on items they NEVER should have been on. I got a ceasar salad WITH STRAWBERRIES. WTF? (and ick!)  I have also had some servers \"do a favor\" by adding strawberries I didnt ask for and never would have wanted. No just PLAIN green tea ice cream no strawberry topping. It may well be \"totally awesome\" as the server claimed but not worth dying for.",
            "I had a friend that was Assistant Manager at Burger King.\n\n\"No salt\" was just a way for them to get hot fries and burgers that hadn't been sitting around.\n\nIt literally had  nothing to do with the salt content.\n\nSo, when OP's customer bit into the burger, what he was really saying is that it wasn't hot enough.",
            "'Dont worry we didnt charge you for the bacon' Im wheezing that was beatiful",
            "I once took my staff out to a fancy restaurant for a xmas party. One of my staff had some serious health issues and had quite a few serious food allergies. This restaurant took food allergies seriously and when the chef heard about all her allergies. He came out and asked what she could eat. He used a newly cleaned station and made her rack of lamb. He specially prepared her entire meal so there was no chance of cross contamination.",
            "Lol! I'm so sorry the salty folks reached you too!  Thank you for this story and teaching folks about consequences.\n\n\n\nI added so many people to my blocked list after posting about that dinner party. Between the folks calling me a liar, telling me I was a female dog, and the like it made me realize how the small minority on reddit can really tarnish the experience.",
            "I have celiac which means that literally every place I go contaminated my food and makes me sick. Fuck everybody who does this and makes life hard for waitstaff who try to help people like me just have a normal meal without crippling anxiety.",
            "I am allergic to meat, fish, shellfish, poultry, crustaceans and molluscs. Not anaphylactic but such severe d&v I’ve been admitted to hospital many times. I always thought this was intolerance until the Drs pointed out I was literally bleeding internally it’s so bad. Now I’ve had a few cross contamination disasters which seem to have made my body go haha guess what now you are intolerant to milk, cream and certain but not all types of cheese and fruit too. I literally dread eating out in strange places. Usually vegan is safe but not always and I feel horrible asking staff about cross contamination",
            "Yas! Well done",
            "The only thing I could think of when I think of a diet where you couldn't have salt is a low iodine diet in preparation for a radiated iodine pills people take for thyroid or throat cancer. It really sucks and is only meant to be done for about 10 days before the pill. The guidelines specifically mention to make your own food and avoid anything with salt since practically all salt used commercially is iodized. Either that guy was on that and was a total idiot, or he wasn't counseled at all. Or maybe he needs to avoid salt due to high blood pressure.",
            "a \"no salt what-so-ever-diet\" is probably the dumbest fucking thing i've ever heard lmao.",
            "Bruh id love that burger. Cardiomyopathy is a bitch, I've gotta watch my salt like crazy. I wish places would do that for me.",
            "I bet in most of these “no salt” diets, the doctor probably said low sodium, then had to explain that sodium is salt therefore making it a low salt diet to which their brain heard no salt. Also I bet most of these are older Americans. I’m starting to think that some of our older Americans are loosing IQ points as they age",
            "I wonder when I hear stories like this, is there an actual NO salt diet a doctor whatever will put someone on? Since no sodium in your diet would cause other problems.",
            "I’m allergic to onions and peppers (yes my life sucks) and I can’t tell you how many times I’ve said this while ordering and the person preparing the food will still put onions/peppers in it. It’s frustrating. Must be nice to have an establishment in town that actually doesn’t want to kill you lol.",
            "I’m allergic to shellfish, olives(olive oil) and black pepper. Can you be my server??? Please. I’m tired of dying because people dont believe the last 2. Olive oil in my food causes anaphylaxis for several days plus puking/shitting blood. Black pepper instantly causes hives in my mouth and throat. \n\nPS I call ahead and ask for the simplest items to be altered for my safety. Ive got like 10 places locally I can safely go to. I feel like a Karen with how many places I’ve reported but I dont feel bad",
            "My partner would be over the moon at the ability to get a lettuce wrapped burger to accommodate actual dietary needs! I get so pissed off at people who are just being picky.",
            "I used to work in a little new \"sandwich\" place, opened by two investors, I was the one managing it for them.  \nWe had a Seitan option instead of meat for anyone who wanted a veg option.  \n\n\nSo we have the family of one of the two owners coming in, and the wife hands me a pack of gluten free quesadillas to make her son's sandwich, cause he was gluten intolerant.  \nI was HEAVILY against it, cause it's againts pretty much any safety rule to let customers hand us their own food to serve (at least for what I have in store there's all kind of tracking and so on...).  \n\n\nShe then proceeds to order, and ask for a Seitan sandwich for said son.  \n\n\n  \n\n\n  \nFor anyone unaware, Seitan is called also wheat gluten. It literally is GLUTEN.",
            "Let me guess, Five Guys? Constantly had people cite allergies at the register and then look shocked when I started yelling down the line about an allergy order. Like, if you are gonna lie about shit don’t be surprised when people take that lie and hit the ground running.",
            "And here I am feeling bad that I have to stress \"no mushrooms\" and even send food back because of my allergy. \n\n(Yes, I do tell someone taking my order about my allergy. More often though I will just avoid ordering anything that has mushrooms. Japanese restaurants are especially bad about not listing everything on the menu, and I've had to change dishes because of that. Makes me sad, because I love Japanese cuisine.)",
            "Unfortunately there are a lot of people who don't understand the extent of certain medical diets. I wouldn't be surprised if this guy was told he needed to be on a salt free diet, but had no idea the extent of the restrictions he needed to take. \n\nI recently had to explain to a cousin that a lot of fast food meats contain soy and/or wheat and if his son is allergic to it, he needs to make sure that whatever they order him is free of those allergens. (They couldn't understand why he was suddenly getting sick so often after he started eating \"normal food\" instead of only formula and baby food.) Poor kid has wheat, dairy, and gluten allergies and his parents have no idea the extent of what they actually need to be doing to protect him. They were feeding him chicken nuggets and wondering why he got sick afterwards.",
            "I waited on this girl at my restaurant who wanted to know the exact calories for every meal. Then she ordered like 5 Piña colada’s. Just one of her drinks had as much calories as any meal she could have picked. I will never forget her.",
            "In my experience, if someone can't have something for medical reasons, when they tell you, the always include they can't have it up front due to medical reasons. Dated a woman that had food allergies and her son had severe food allergies.",
            "Snort, this is awesome.",
            ">The customer then bit into the burger, stating that it was terrible. Not just that the lettuce wrap was far inferior, but that the meat was tasteless. Well I'm sorry sir, but not only did you ask for no salt (hence the tasteless),\n\nI get that salt is a flavor enhancer as well as a seasoning that adds it's own taste to the food. But if a burger is practically **tasteless** without the salt then I have to assume that the burger was of a lower quality to start with.",
            "This dialogue sounds like a bad teen- written fan fiction",
            "You mean he ate the burger right in front of you to do a scientific experiment and get your immediate feedback? Wow.",
            "Briefly worked at a Hardee's in my teens.  Woman came in and very loudly went into multiple details about why she couldn't have any salt on her mushroom Swiss burger.\n\nI was on the burger station, another dude was on the fry station.  After she devoured her meal and left he was cackling away and explained he had salted her fries way more than normal. \n\nHow can you be salt free and not recognize all that salt on your fries?"
        ]
    },
    {
        "post_id": "106ygyg",
        "author": "JoephNightwolf",
        "title": "She said \"...contact a lawyer.\" ... ok",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106ygyg/she_said_contact_a_lawyer_ok/",
        "score": 13096,
        "num_comments": 384,
        "created_utc": 1673221877.0,
        "selftext": "Injured at work.  Ambulance, hospital, doctors, in patient therapy, out patient theapy excellent, first class.  Insurance did not cut corners.  During hospitalization some small nerve damaged was found.  I was told it could last for years or fix itself.  Immediate solution; a pill.  Used for the treatment of mild Parkinsons, one a day if needed.  It worked well.  During my eight months of therapy I used about 15 to 20 pills a month.  Physical therapy completed (great therapists) I returned to work.  The pills were prescribed in a frequency greater tnan my use, but the pharmacy would call on schedule to pick up more.  At one point I realized they had not called, so I called.  Prescription expired I was told.  Had plenty of unused pills so not in a rush for more, I contacted the Insurance Company.  Told \"Case Closed\".  I argued that this was part of the original diagnosis and might continue for years.  \"Case Closed\" was the response.  I offered to pay for the pills but needed the script from rhe doctor to get more.  I was told that all I could do was reopen the claim.  \"ok, thank you.  How do I do that?\"  The answer was given.  \"call a lawyer\", she said.  I had been treated very well by the Insurance Company up to this point without litigation, but OK.  $84000 plus their legal fees.  The pills were $0.34 each, $81 dollars a year.  All I wanted were the pills.  NOTE to Underwriting.  Don't be in such a rush to end Workmans' Comp Claims.  I just wanted the pills.",
        "permalink": "/r/MaliciousCompliance/comments/106ygyg/she_said_contact_a_lawyer_ok/",
        "comments": [
            "I had to do the same thing, because according to the Dr hired by my company,  I was healthy enough to return to work.",
            "Good on ya for following through. They're gambling on the other 99 peeps in your sitch giving up.",
            "This is awesome!  I spent 11 years as a work comp admin for a well-known U.S. company and some of the hoops the insurance company & the individual state laws made our injured employees jump thru was mind-boggling.  The insurance company could have easily re-opened your claim & sent you to the doc for one more appointment to get the written prescription, I know that for a fact.  Glad to see you stuck it out & got what you deserved.",
            "Stuff like this pisses me off so much. \n\nI work in worker's comp, and I always do everything I can to try and make sure the injured person gets everything they need for their recovery. If it's not within my purview to approve, then I will talk to someone higher up and plead their case. \n\nOur job is to help a person through a shitty time and help them rehabilitate back to the level of health they had before their injury, or as close to if a full recovery isn't possible. If that means being on medications or having therapy for the rest of their life, then that is what we should be providing. \n\nI hope this has served as a wake up call for the company you have to deal with.",
            "Well done. A note for everyone … in the US, most workman’s comp claims “close” if you have not been seen by the “company doctor” for ONE year.\n\nTHIS WILL FUCK YOU. Know your rights, know the traps. See the doctor every goddamn year like clockwork.\n\nSource: sustained a near fatal brain injury at work, plus a permanent t orthopedic injury. Permanent brain injury fuckery that I’ve learned to live with, fucked up arm will always hurt and is limited.\n\nFast forward 10 years my neurologist wanted to do an MRI study. Workman’s comp said “oh tough shit”.",
            "We're in a similar situation with a fire restoration contractor.  They are almost certainly going to settle because we have them on record breaching contract, lying, and filing false expenses with our insurance company.\n\n\n\nThe biggest sign for me that we are going to win was when we were talking to a lawyer specializing in insurance and we told him our public adjuster didn't to expand his help anymore beyond the 2 things we brought the PA in for.  Lawyer said loooow whistle \" those guys usually hang on to a claim as loong as they can.  He must have known stuff was going aideways.\"",
            "God bless you for taking them on.",
            "Ooh boy! Do I have a story for you! It’s ongoing, so no ending yet.\n\nMy son works at a pharmaceutical dispensary/miscellaneous shop; one in a chain. They were robbed one night when he was closing. Got knifed and the robber nearly cut off one of his fingers. Workman’s Comp sat on their heels for 3 weeks before giving the surgeon the green light to operate. He was out for 3 months. Had issues getting his paychecks, and tried to call the insurance company. No response. Emails. No response. Calls up the chain. No response. He tried calling (3-5 times a day, leaving messages, etc.), emailing, and more. Nothing.\n\nThen he finds out FMLA expired. What??? This is an on-the-job injury! Oh. And his finger? Scar tissue and tendon shrinkage leads to nonfunctional finger. \n\nHe recently had surgery to repair the damage the 3 week wait caused. Surgeon had to open up his palm and wrist, take some from his wrist to repair the tendon in the palm to reconnect the tendon in the finger. He’s now out for at least another month. \n\nAnd insurance company? Nada. Zip. Zilch. Plus, we are thinking they posted it as OFF the job injury, completely bypassing workman’s comp! But since he can’t get ANYTHING from the insurance company, he doesn’t know. Attorneys are researching as I write this.",
            "I wonder if the employee was sick of turning down legitimate claims and genuinely wanted clients to start calling lawyers.  I'd love it if they were also maliciously complying to their boss saying the same thing when they tried to get some options to offer people.",
            "This is common. So many penny smart pound foolish decisions because they only optimize their business in pieces then get sued.",
            "Are you saying you won a judgment against them for $84,000? I didn't quite follow at the end. (Just me, I'm sure.)",
            "If it's the pills i'm thinking of, them cutting you off like that would have been 100x worse and possibly given you more than nerve damage (Tardive Dyskenesia)",
            "Gorgeous! Kudos.\n\nSimilar thing happened when we got rear-ended at a stop light, 100% their fault. Our insurance didn't want to cover it because it was the other driver's fault. Ok, I understand. Their insurance was really reluctant, wanted us to pay for everything and THEN they would reimburse us but only if they deemed it necessary. Nu uh, no dice. We ended up lawering up and got way more than the car fixed, we also got a Dr's visit, therapy, and about 5k leftover cash for each of us. All I wanted was my car fixed but they wanted to play hard ball.",
            "Anyone else think this rep was pulling a Mr. Incredible?\n\n“I wish I could help you, but the case is closed. Call a lawyer. CALL A LAWYER.”",
            "Yeah, house insurance is trying to put a cap on what they pay us for damages, even though the original documents said there was no cap, for some goddamn reason they actually want to try to fight this",
            "This is how the future will look with ALL insurance. \n\nPut up enough delay tactics, make it harder to retain legal services, dont pay out ANYTHING until all the legal crap is over with. \n\nall designed to make the average person give up on fighting a claim and accept whatever the ins co want to pay.\n\nFlorida is currently doing this to property ins. Make it harder to sue, and supposedly insurance rates drop...yea right....",
            "Work at the oil plant some years ago. My colleague had a work related accident and our manager dragged this colleague to another doctor for second opinion. My colleague got few days of sick leave from the first doctor for the mild hit he received in the knee. Boss was sure that the other doctor would give my colleague the green light to work some lighter job at the plant.\nSecond doctor insisted on x-ray and it revealed a small fracture. Doctor gave him six weeks sick leave, paid fully by the company. He could've worked after few days, but received a nice long vacation instead. \nOur manager was not amused at all when I asked where my colleague was and when he's returning to work. I knew already what went down, so I needed to rub it in...",
            "That “contact a lawyer” had some real Bob Parr vibes. \n\nhttps://youtu.be/_R8GtrKtrZ4",
            "I’m not sure what state you are in, but it is possible that the only way the insurance could pay would be for you to get an attorney. If they have a doctor that released you at maximum medical improvement (MMI), then the case was indeed closed from their end. They can’t pay for more treatment once you reached that point. \n\nSome states only cover medical until MMI *unless* the injured worker litigates their claim and comes to a full and final settlement that would include future medical costs.",
            "Can I just point out how beautifully concise this was?\n\n(But yes, easier legibility would've been nice.)",
            "[deleted]",
            "So instead of giving you pills for the rest of your life you get 1000+ years worth of pills in money form. Win!",
            "Always sue for workers comp. The comp pay is a joke and you really cant live off 66% of your paycheck",
            "I somehow feel that the insurance person saw something in the paperwork and cooked up the \"get a lawyer\" answer on smaller pretense to help the person off-the-record. They don't get in trouble but it gives the end-recipient a reason to get a lawyer.",
            "Good for you. I used to do workers comp billing for a surgical group and those insurance companies can be evil.",
            "I dont understand, even if you offered to pay for the pills, you could not get a prescription from the doctor? Why is insurance involved while even getting a prescription for which you offer to pay yourself?",
            "Wait, so you have to go through your insurance provider to access the doctor that will give you the Rx? That is several levels more fucked up than I realized it was.",
            "Thank you for standing up for yourself, and FUCK them for trying to harm you for profit.",
            "Word to the wise. Workmen's comp wants you to 'be better' almost immediately and will hound you CONSTANTLY. \"Are you feeling better?\" Is code for \"we want to stop paying for your care and ongoing treatment as soon as possible cause we really don't care about you, just the money\". DO NOT STOP TREATMENT PER THEIR ADVICE AND COUNSEL, HEED YOUR DOCTOR AND CARE PROVIDER ONLY. Dealt with this with Walmart years ago and they CAN GO FUCK THEMSELVES.",
            "My SO went thru NYS workers comp hell. Back broke in 4 places. Every month they would cut him to half wages, saying he was better. We had a great WC attorney, but it still took years.  One thing we learned, is if you can afford it, get a separate disability policy, don’t trust your companies / states. Edit. Or the SS disability. That can take years to get.\n\nThe leading cause of poverty is a disability.  Most in their 30’s and up, don’t think it’s as important as life insurance, but it’s the difference between living in poverty and not having to stress over bills, and possibly being homeless while trying to heal.  Think of it as poverty insurance.",
            "Currently have my referral and waiting to get in with the orthopedist. Started in my elbow back in May and then went down to the left side of my hand and now it’s from my shoulder to the left side of my hand and I can’t straighten my arm but to like 75%.. they haven’t started paying yet and I got put out of work Dec 15",
            "Hold on a second. Pills meant for parkinson are usually pills that you can't stop immediately.",
            "A lot of people are scared to call a workers comp lawyer and end up just getting fucked over, good on you for doing things the proper way.",
            "Workman's comp is a nightmare. Had a family member fight with their previous employer and more than one doctor. In the end litigation was the only way to get anything accomplished. Ended up settling for the equivalent of about 2 years of wages.\n\nFamily member ended up changing their career over the situation, but used the \"free\" time off to learn a new skill. Ended up better in the end.",
            "Did you know that in some states, a pharmacist cannot tell you the medication is cheaper if you self-pay instead of using insurance?  You must ask.  They cannot volunteer the information.  Texas is one such state.",
            "Underwriter here. For comp even. We don't get a vote on closing claims. Or paying claims. Claims handles all that and we handle the policy itself. \n\nI am sorry that this happened. I see claims on policies reopen often and have to call the Examiner to see what is happening. I seldom recommend an attorney but it seems that it was the right choice on yours.",
            "Show your regular doctor your prescription bottle and say you need a new script because work comp is ending.\n\nInstant new script",
            "I live this story because its to the point and doesn't need extraneous details and back story.",
            "As someone who worked in health insurance at one point, the underwriters do not have the power you think they do. The American healthcare/insurance thing is still a scam and fully of BS, but the underwriters would not be able to write a script or reopen a case that the doctors deemed medically done and closed. The majority of what underwriters do is approve/reject participants on to plains and approve/reject claims based on the participants policy details. They are legally bound to follow the policy of whichever plan you are own and can't stray outside of that.\nBut again, the whole system is still BS.",
            "Always contact a lawyer.  Workers' comp. only exists because the comp bar saves more for employers.",
            "God damn, that's beautiful.",
            "After my wife dealt with Workman's Comp, I can tell you it's usually really shitty. They make it almost impossible to get anything done and the incompetence level is insane. Kudos to you for following through!!",
            "I've known a few people in your situation that were just cut off after getting a dependence and had to go to the street",
            "i read a bunch of responses, but i think \"sell all drugs to whomever wants to buy them\" would alleviate a lot of stresses on all levels of healthcare, and the criminal system.\nAnd i want a pony.",
            "Reopen.  Ok.  And my neck has been hurting too.",
            "Oh well, fk em.",
            "[removed]",
            "Fuck underwriters.",
            "This won't be as funny when you celebrate your 1038 birthday, and they realize they could have saved money..... lol",
            "there are probably enough people who would drop it rather than going through litigation, that denying coverage is still cost effective for them in the long run.",
            "Go to different country and get it",
            "Glad it worked out but definitely contact the WC Bureau in your state.",
            "In 2006 I crushed 3 discs in my lower back into the size of one and dislocated my left hip at work. I’ve had 2 back surgeries and now have 4 pins in my spine holding my spine together.  I’m still waiting for them to fix my hip. Workers Comp sucks.  I got paid by them from 2006-2015 and then made settlement.  Which amounted to a smack to the face.",
            "Ugh I work in pain management and have to deal with WC denying shit ALL the time. Solidarity dude.",
            "Didn’t you post this story here like 6months ago?",
            "This reads like how a salarian speaks in mass effect. I like it.",
            "Odd the claim was closed without evolving you at all, must be some differences with that state/country.\n\nYeah, this is on them for not leaving future medical open. I bet it was the carrier's in-house counsel, they do dumb things like this all the time that comes back to cost them more.",
            "People need to get off their high horse about lawyers. There are more lawyers than ever because insurance companies are up to more shit than ever.",
            "If the doctors determined that you reached maximum medical improvement then there's the problem. It was them and the insurance company was relying on that to make the decision to end everything.",
            "There are ppl out there who will pretend to be difficult and say “have your lawyer do XYZ” … and they’re trying to HELP you bc you’re entitled to a lot more than you’re getting \n\nRead between the lines my dude",
            "Content aside, I love your story-telling so much.\n\nShort, concise, no need for bullshit embelishments, and straight to the point.",
            "What country was this?  That's not how most insurance companies work at all.",
            "Insurance cannot really write a prescription for you, it has to go all the way through the lawyer or something, and then the doctor would follow the court order. Even if they knew what's coming and wanted to save $.",
            "Found out:  Underwriting has nothing to do with Claim Termination.",
            "Not malicious compliance. \n\n>Malicious compliance is the act of intentionally inflicting harm by strictly following orders or rules, knowing that compliance with the orders or rules will not have the intended result.\n\nThis is malicious compliance: \n> \"Fire that cannon!\" \n\n> \"But general, it's pointed at...\" \n\n> \"I ordered you to fire that cannon!\"  \n\n> \"Yes, sir!\"  \n\n> <*general's car blows up*>\n\nThis is not malicious compliance: \n> \"Blow up my car\"\n\n> \"Yes sir.\"\n\n> <*general's car blows up*>\n\n\"We'll leave it to a judge to decide\" just doesn't have any malice to it. Yeah, the result was undesirable, but it was well within the expected range of results.  \n\nFurther, I'm not sure, but I think the fallout may not have been included (Rule 7).  Was the $84,000 some sort of payout or settlement?  Or was that just the cost of treatment so far?",
            "...and you didn't contact your doctor (the one who actually writes the rx) because?",
            "7. Include the fallout.",
            "[deleted]",
            "You might have a drug problem",
            "Good for you! I hope they were self-insured! Smart-ass answer, when you needed help, the lawyer asked in a lawyer “ way”, the results, cost more.",
            "How much were the legal fees? If your settlement allows you to disclose.",
            "You could also just go through your regular insurance.  It kicks in once the workers compensation claim is closed,",
            "I never thought too hard on dying before….",
            "HR really have their heads up their butts",
            "lol",
            "Nice. My insurance denied my physical therapy as \"experimental\" and I had to appeal like three times before I could hire a lawyer"
        ]
    },
    {
        "post_id": "10usu2i",
        "author": "MrWacko",
        "title": "No personal mobile phones at work!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10usu2i/no_personal_mobile_phones_at_work/",
        "score": 13088,
        "num_comments": 452,
        "created_utc": 1675644301.0,
        "selftext": "Long time lurker. Recently managed to inflict my own little bit of malicious compliance. Enjoy!\n\nI (33M) work in IT Cybersecurity, and my work has been on a big multi-factor authentication (the SMS codes from your phone or authenticator apps type thing) push to better secure our systems. As a result, basically every system or software requires a phone to access. Like many other places, my work does not supply phones to its workers unless they are sufficiently far up the leadership chain.\n\nFriday, my boss sends one of those directives that manglement bosses always do, to try and be \"commanding.\" He tells me that personal device use at work is not permitted, and *specifically* cites mobile phones as an example.\n\nCue malicious compliance.\n\nTo comply with the directive, I uninstall all the MFA code applications on my phone that are needed by work, and submit tickets for getting the desktop versions. IT Fulfillment's response? \"Uhhhhh... What desktop version?\" Boss is backpedaling, but it wouldn't matter at this point, as the tokens for the MFA apps are gone.\n\nFor extra irony, Boss rushes approvals for software installs, but gets stuck in the new software approval process he created.\n\nEnd result? I spend Friday browsing the Internet while he runs around rushing software approvals for the MFA desktop apps we need.\n\nTLDR: Boss says not to use personal phones at work. I stop using personal phones at work and can no longer access systems.",
        "permalink": "/r/MaliciousCompliance/comments/10usu2i/no_personal_mobile_phones_at_work/",
        "comments": [
            "Boss should learn to ask informed people before making decisions.  I hope you shared that MC with your team, those tokens aren't free :)",
            "Once we decided on MFA, I put my foot down in demanding hardware tokens for everyone without a work cellphone. \n\nExecs originally wanted to save money and tell people to install it on their personal phones. \n\nUsing their phone is easier, so if people want to use their personal phones, they can as an option.  But they need to be the ones to request it.\n\nSometimes it's nice having mostly union staff so I don't need to deal with execs trying to be cheap or slimy.",
            "Never interrupt  the enemy while they're making a mistake.\n\n\n/edit a word.\nThanks beli",
            "“So boss, when will my company cell phone be issued?”",
            "> For extra irony, Boss rushes approvals for software installs, but gets stuck in the new software approval process he created.\n\nAlways nice to see people who want to act as barriers being screwed by their own barriers.",
            "My husband worked as an electrician for a manufacturing facility. He used his phone all the time in the plant for work. Other people working in the plant complained about the electricians always being on their phones. Management said no more personal cell phones.\n\nMy husband came home and told me that management is full of idiots, but he was leaving his phone at home. I  work from my home, and you can hear the PA system from his plant at our house. Judging from all of the text messages, the phone calls, and the announcements broadcast from their PA system, they really wanted to reach \"ET Bob.\" He couldn't respond; his cellphone was at home, just like they wanted. \n\nBob also couldn't do his job properly, because a lot of what he used his phone for was to take pictures of wires and circuits and boards where he couldn't stick his head. He had rigged some attachments to hold his phone steady to watch what he was doing, but that didn't work with what the plant provided. This meant tearing apart equipment to be able to remove the suspected faulty equipment before being able to even test said equipment. No more troubleshooting, just completely tear equipment apart, replace everything, then reassemble.\n\nIt cost the plant so much money. Down time, overtime, replacing everything instead of rewiring a board, reduced output, delays in maintaining other equipment.... The bosses were not happy. But now my husband was pissed.\n\nIf they wanted the efficiency back, then tell the preening little peacocks they had promoted to management to leave the electrical shop alone. It took two weeks, but then they were asked to PLEASE keep their phones handy.\n\nMy husband passed away unexpectedly in October, and somehow I keep getting emails from his work that they are hiring an electrician, would I like to apply. No you motherfuckers, I would not. This company tried to take back my husband's vacation pay because he didn't return to work on the Monday following his death. They can all rot in hell for all I care now. I don't know how I got added to their email list, but it is like a knife being twisted in my heart every time I hear from them. His coworkers all tell me that the place isn't the same without him. Trust me, guys, I know.",
            "play stupid games as they say",
            "Yep. \n\nRetired IT guy here.\n\nI used to enjoy telling \"*those-who-know-better*^(®)\" to always let me know when they get to that part of their work version of the 'honey-do' list that says \"*Always seek professional advice before doing anything IT related*\" and I'll be there for you.\n\nJust kidding.\n\nYou fucked up, you wear it.",
            "Was it just you or everyone?",
            "I'm not putting work apps on my phone unless they are paying me something for that use anyway.  I get a monthly stipend for mine, because I travel and work remote.  Otherwise their shit would not be on mine.",
            "I had a similar situation where we need to install an app on our personal phone to get calls redirected when nobody was at the office. But the boss didn’t want us to use our personal phones at work either, they even put up signs all over the place. I just uninstall the app and problem solve for me. It took a long time for them to realize I didn’t have the app anymore, but at least I stop having to deal with customers when out of the office",
            "We had that issue at my workplace because my organization has clinics in jails with rules against cell phones.  They purchased the dual authentication keyfobs for the employees.",
            "Good; my personal devices are for my personal use ONLY.",
            "One morning, i come in to work and the early birds are all in a panic. You could cut the stress with a knife, which is unusual for aerospace. (At least in my branch) Turns out our parent company cut off all streaming services overnight so no one had access to things like youtube or streaming stock market data... or live stream to Space Station, which the engineers always had running in case the astronauts needed assistance fixing something. \n\nOops.",
            "I made my work's IT department send the MFA phone call to my desk phone. Hell no was I using my personal phone without reimbursement\n\nThey were like \"but it's more convenient\"\n\nDon't care.",
            "If your personal phone is required for work, then you should be charging your place of work for that. Also you need written confirmation that they will replace your phone should it be damage during work hours.",
            "About 8 years ago I worked as security in a casino. To work security in a casino you need to have specific certificates and need to carry them on you to prove that you have them if an inspector visits. You could either have paper copies or have them on your phone but the regulation was that you needed to have them physically on you at all times when working. Which meant that security was the only people allowed to carry our phones. Another guard got caught using their phone at the security desk before the casino even opened. So like not a big deal. But the GM was in a pissed off mood so he got written up and it came down that we weren’t allowed to have our phones anymore. Ok. We all stopped carrying our phones with us, and someone secretly sent a tip to the licensing board that none of the security guards were current on their certifications. We got a surprise visit a few days later and since none of us had our paperwork on us we all got fined. I don’t remember the exact number but I think it was in excess of $100,000 that the casino had to pay for their stupid random rule change.",
            "We had a similar thing but everyone refused point blank to install anything on our personal phones and demanded work supply a phone.",
            ">I uninstall all the MFA code applications on my phone  \n\nThat's hinting to the first mistake.  \nIn our company every person who needs any kind of 2f access needs a company phone.",
            "The company I work for did a survey. The number one complaint was that communication sucks. So the higher-ups decided to get Beekeeper, which is kind of like Facebook for companies. You can message anyone in the company at any time. Problem is, it's an app for your phone. We are a factory and outside of a few managers, no one else is allowed to have a cell phone on the floor. Suddenly the higher-ups are trying to figure out why no one is using their new app.",
            "I get that uninstalling your authenticator app was an act of malicious compliance, but the solution your helpdesk was looking for is authy. I do cleared work where absolutely no personal devices are allowed in our workspaces but we have computers with an outside internet connection and I’m constantly having to use MFA to sign into different websites. Authy has mobile, desktop and browser versions that sync across all devices. Definitely beats having to run outside the SCIF to get the authorization code for whatever account I’m trying to get into and rushing back in before the code expires.",
            "Couldn't they just change conditional access to allow you through authentication based on location? That's how it works at my job. No MFA prompts in the office only from outside the org.",
            "If that’s the case, now they need to give you a work phone. \n\nNever use your personal phone for anything work related, if you can help it.",
            "I love this MFA stuff.  I have friends with non smart phones ( on purpose, age and other reasons) and it causes so much work to support them",
            "I am waiting for the day I do similar.  I run an offsite team who more or less answers to the client. My personal phone is the link between client and myself and the company/myself. We do have a landline but no voice mail.\n\nOff goes the personal phone and my client & company can call the office to see if I am at my desk or in the field. \n\nEmails are a thing, but would only be during scheduled hrs, while at desk. Good luck",
            "About 2 years ago I notice that they're installing phone lockers by the elevators on our floor. I'm annoyed but I'm not unwilling.\n\nThey don't even make it up. Before installation is completed it comes up that our entire organisation is about to transition to MFA and you guessed it, they are definitely not buying everyone phones.\n\nA couple of jobs before that I had the worst job of my life in a toxic as hell environment. They decide that we need to download an authenticator app for our work. Cool, whatever. Oh but wait. It won't work with any phones that aren't quite new. When this is pointed out to them they tell us that we all need to buy new phones. We obviously refuse. I didn't stick around long enough to find out how this went because they tried to rope me into harassing an ex employee who was in the process of claiming wrongful termination. I walked out on the spot.",
            "Moving MFA to the very system you are trying to protect seems to defeat the purpose too.",
            "When we got duo mobile at work, I refused to put it on my personal device. Just told IT I didn’t have a smart phone. They bought me a device just for duo. It cost over $200.",
            "You never use your private mobile for workrelated things, especially not in cybersecurity. If your work requires you to have a mobilephone then your employer should provide you with a mobilephone and a phoneplan.\n\nOtherwise you're in risk of loosing the control of your private mobile. You wouldn't beleive all the thing they get access to if they should require you to put something like MS Intune on your private mobile.\n\nI mean the remote wipe you open up yourself to by connecting to the company exchange server is bad, but with Intune they can remotely access and control almost everything on your mobile.",
            "> I (33M) work in IT Cybersecurity\n\nI suppose this excuses your personal cell phone number from being employed in your company's issue escalation process and/or emergency after hours on-call process, too?\n\nTakes me back to the days when even my company's HR department only ever knew my Google Voice #, and I carried a physically separate, company-issued Blackberry that sat powered off in a drawer except when I was on-call.",
            "\"my work does not supply phones to its workers unless they are sufficiently far up the leadership chain\"\n\nOne way to cure this attitude is to have your own phone fail during an out of hours call (ideally from someone important). It may mean using some old phone with a tired battery for a few weeks but I have found it is effective in getting the company mobile phone policy changed to \"Senior management and those we rely on for out of hours support\".  A common downside to this approach is that you sometimes get the managers' old phones.",
            "Astonishing this thing that companies dont give phones. \n\nHere in Finland even secretaries have phones from the company not to mention CSO or lower lvl cyber guys. Usual limits is 'buy whatever for max 500eur' or in bigger companies choose from 2 supported androids or 2 apples. And subscription comes along with some medium-level limitless mobile data.",
            "And that is how you manage your manager. Well done.\n👏🏻",
            "“Manglement”. My new word of the day. I’m using this from now on.",
            "SMS is not secure for MFA. Better than nothing but physical tokens or dedicated apps are preferred. My old job didn't allow the app on personal phones. Shit went sideways when I forgot my token one time. Took a week to get my token to work again. What a pain.",
            "I work in IT support. Yubikeys are available for people who do not want to use their personal phones for the purposes of MFA. and this works just fine for tasks I need to do internally. \n\nEnter a client who wants us to have access to their systems so we can troubleshoot for them. They are so secure, no information can leave their servers. and you need MFA to log in. \"well, give us your phone numbers!\" - \"we don't have phones for that!\" - \"there are no other options we can provide!\" - \"that sucks, guess there's no support we can provide to you!\" ... (situation still ongoing, but they'll never get phone numbers from anyone on my team, lol)",
            "I was a supervisor for a 10 person billing department.  I made sure everyone was cross-trained. Except for reviews and a couple other supervisory issues, they knew everything I did and I knew everything they did. I also created a complete manual with every item performed.  Click by click manual. \nMy manager sat with everyone in her department so she knew what her 50 employees did.  She knew at least the basics.  I had emergency surgery and my department ran smoothly while I was out.\nIt's a shame more managers don't take the time to learn what their employees do, at least the basics.",
            "Oh dude the moment I saw IT in the first sentence my head went straight to MFA 😂😂😂\n\nThis is perfect thank you’ \n\nYou should have put posters around the office or in emails with. QR Code that linked to an online form \n“Scan this code to submit IT enquire or support”",
            "Our MFA at work was just backed out because somebody refused to use her own phone.",
            "They really should provide hard tokens if they’re not gonna give you a phone anyways.",
            "Something something petard",
            "Ditto . Deleted many gigs of files , photos and related apps off my phone too . Boss has to now wait until customers bring in parts so he can find out how they look so we can make . Insane waiting times now . To explain better I made a lot of modifications to machines and kept pics and drawings for each mod and for which customer it was for . All now gone . I have been with the company 12 years.  Imagine the chaos .",
            "Should have forced him to get you a work cell.",
            "These fucking idiots. \n\nThe number of businesses for which I've worked recently that require access to a personal mobile for security or comm purposes... is ALL of them. Every one. \n\nAnd I find it revolting that personal property IS needed to make these rich slobs richer. But when **everyone is doing it** it is hard to fight against it. I did bring it up to my boss (he and other managers have a company provided phone) and he mentioned they could use email or internal messaging Spark etc. I told him communication being the most difficult compliance issue, I was not going to discourage it in ANY way or method. \n\nI appreciate him. He listens and fixes inequities where and when he can.",
            "Being a boss is so easy, you just sit back relax and collect your paycheck, you only real job is to delegate tasks to others below you and hold responsibility when stuff goes wrong. Why do so many bosses try and introduce stupid policies like this, if the job is getting done then you don't need to introduce any changes.",
            "Every time I read one of these I appreciate my job a little more. My job went the opposite route. MFA on your personal phone? They start paying the cell phone bill for you.",
            "Cue, or queue if you squint. Queueueueue if you believe in infinite silent letters. Q if you're watching Star Trek.",
            "This scenario is *exactly why* Artificial Intelligence deployed by companies to replace employees is going to be a giant, colossal failure: Managers make short sighted decisons all the time, it is practically their default, and managers require the employee pushback of \"um, that's won't work\" to actually find the appropriate decision for whatever. When the \"employees\" are AI or are managed by AI, that short sighted decision will be accepted and performed without question - exactly what management wants, and exactly what will destroy the company because this will expose management's short sighted poor decisions. As much as the wealth and power class believes they don't need anyone else, they direly need the reality check that is everyone else. Fucking short sighted fools.",
            "> \"Uhhhhh... What desktop version?\"\n\n[WinAuth is pretty good](https://winauth.github.io/winauth/download.html). Hasn't been updated for ages but it works well.",
            "Ha ha ha that's brilliant, nicely done!",
            "Fucking manglement, always twisting things to suit them.",
            "Most Bosses are wise, some are otherwise. Your Boss is the latter",
            "[deleted]",
            "Were they paying you a stipend for your phone, since it wa previously required to do your job?",
            "It hurt itself in its confusion XD",
            "Yubikeys ftw",
            "Boss tripped on his own irony.  And fell flat on his not-so-saving face",
            "So desktop apps were existing. What if there are NO desktop versions?",
            "That's not even malicious compliance, that's just flat out compliance... What did he think was going to happen?!",
            "your boss ain’t the sharpest edge of the server rack..",
            "[deleted]",
            "https://authy.com/",
            "Shit, this has to be the best MC I've ever seen here. Thank you!",
            "So, are they giving you a phone tomorrow or are you going to start getting money each check for your phone bill?",
            "Excellent.  I would have done no less these days.",
            "Directive from m*anglement boss* is sent*.* I always know a good story is about to commence...",
            "Option 1: Unfuck the things you fucked up.\nOption 2: Move heaven and earth in attempt to not accept responsibility or fault.\n\n(Bad) Bosses: 2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2",
            "Was it not considered to issue work phones? If you need a phone based 2FA for work, sounds logical you need a phone for work.",
            "Manglement... brilliant",
            "I don't get it, if they require a phone for work they should probably just give you a phone for work. That's what they do here",
            "oh man, I wish!!! I hate that they make us use our personal phones for company business. I absolutely refuse to link my work email to outlook on my phone. like, no, I will not conduct work outside of working hours unless you are paying me to do so AND providing me with a business only phone. it's bad form to mix the two in general!\n\nthe worst is they refuse to give us access to the wifi at work any longer to \"discourage\" personal use... so I am definitely NOT ever linking my work email to my personal phone. you know how many emails I get a day!? I do not need to be notified in triplicate. (I have access to 2 emails and people already send me shit twice -.-)",
            "This is beautiful",
            "I would never install work software of any kind on my personal device.",
            "Recently our new plant manager approved the use of personal devices. It makes a world of difference being able to listen to music or an audiobook during the shift. It makes working 12 hours not feel so much like a slog.",
            "Everytime a boss tries messing with a company who specializes in technology it never ends well",
            "Boss wants to be petty and stupid? You get petty and smart! Checkmate!",
            "Love this MC. So many companies expect you to use your devices for everything, with no consideration or payment, then tell you then can confiscate your device in the event of some major foul up.",
            "I have always wondered why software devs install work apps on their personal phones",
            "MFA desktop apps!?!?!?\nWhat in the Totally Defeats the Purpose is going on at this company?",
            "Manglement. I need to remember that term.",
            "MFA? \n\nOnly thing that came to mind was Samuel Jackson.",
            "If the boss was at the top of the humble list they would have reversed course once they saw the error of their ways.",
            "SMS is shit. Easy to get control of it",
            "100 Dollar phone, 10 Dollar contract. Wow, that's like 20 minutes of work time equivalent a month... Such a stupid decision",
            "I mean you maybe could have told him the impact of his dumb decision before doing all that …",
            "Classic",
            "Haha “manglement” that’s a good one…",
            "If a company wants me to use my personal phone for work purposes, they are going to have to cover at least a portion of the monthly cost of having the phone. Otherwise, it's a hard no.",
            "This is gold",
            "Suck it up Butter Cup",
            "You used malicious compliance to follow your boss's directive of not using personal phones at work by uninstalling MFA apps from your phone, causing you to be unable to access work systems. Your boss was caught off guard and had to approve software installations, but got stuck in the approval process he created. As a result, you spent Friday browsing the internet while your boss was busy trying to resolve the issue.",
            "So, instead of warning him about the consequences, you make a dick move like that?  I would have put you on a 6 - 12 month performance plan and filed it with HR. \n\nInsubordination will get you terminated and you can be \"managed out\".",
            "I wished I had MFA apps on my computer.",
            "TIL that there are desktop MFA clients lol",
            "I saw this coming the second you said MFA…\n\nVery nicely done.",
            "I wish Microsoft Authenticator had a desktop version",
            "Excellent",
            "My work got me an iPhone 13 purely because they said I shouldn't have to use my personal phone for two point authentication",
            "I'm archiving right now. This ridiculous policy you tell of is like my employer telling me to do my job blindfolded from this day forth!",
            "I have no idea what this about tokens and MFA and all.",
            "At the Peter principle in action",
            "Why wouldn't you ask for a work phone?",
            "That's awesome",
            "Lol, your boss is such a plank.",
            "Any after hours texts I charge 15 min. They haven't asked. If they do...it work.",
            "I work in a school and we have to use our personal mobiles for mfa too, I am waiting with anticipation for a ‘jobs worth’ to mention about using our personal phones.",
            "Have you considered using a cheap voip solution,  like ring central that supports SMS texting?",
            "Your boss is a goober. It's okey, so are mine.",
            "I started a new job recently and I was having trouble getting outlook installed on my phone. Went to my boss and asked him a question about it and he said “Why the *hell* would you want to answer emails at home?”\n\nGreat point."
        ]
    },
    {
        "post_id": "vjmxto",
        "author": "Kyloben4848",
        "title": "Karen wants me to stop wearing school shirt, so I start wearing hoodie with even larger logo.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vjmxto/karen_wants_me_to_stop_wearing_school_shirt_so_i/",
        "score": 13079,
        "num_comments": 561,
        "created_utc": 1656072458.0,
        "selftext": "About a year ago, I was in a high school that was a little exclusive. You had to apply and get accepted, and some people were rejected. The school required uniforms, which were just khakis and a specific kind of shirt. The uniform wasn't that uncomfortable, so most days after school I would just keep wearing the uniform instead of changing into something nicer.\n\nOne day, after school, I was at a store near my house wearing my school uniform, minding my own business when a Karen showed up, yelling at me to stop wearing that shirt since it made her kid embarrassed since he was rejected. After a while of her rant, I just paid for my things and left. I was dismayed to discover that our shopping schedules coincide and she was there the next time that I visited, and said the same thing.\n\nCue the malicious compliance. I went to the school store and ordered the hoodie with the largest school logo out of all of them. So instead of a solid color polo with a small logo, I was wearing a hoodie in school colors with a giant logo. The next time that she asked me to stop wearing “that shirt”, I just told her that I wasn’t wearing that shirt anymore and walked away from her, leaving her still extremely mad. This continued for months until she just stopped going at the same time as me.\n\n&#x200B;\n\nEdit: Everyone is saying that she is clearly the embarrassed one and not her kid. Yes, that's very obvious, please stop just commenting that.\n\nEdit 2: Please stop asking me if I went to [insert school name here]. I probably didn’t and if I did I wouldn’t tell you cuz privacy",
        "permalink": "/r/MaliciousCompliance/comments/vjmxto/karen_wants_me_to_stop_wearing_school_shirt_so_i/",
        "comments": [
            "If she gets that mad over a high school shirt just wait until her kid starts applying for colleges.",
            "So, everyone in the vicinity knows her kid didn't get into that school because she felt the need to verbally abuse you. If she had kept her mouth shut, no one would have been the wiser. That is the definition of a dumb bitch.",
            "Reminds me of a former college roommate who got angry with me for wearing shirts with low collars because my boobs were bigger than hers. 1. None of my shirts were scandalous. 2. She had AA cups and a complex.\n\nAlso got angry with my that I would talk to my boyfriend (now husband) on the phone IN THE DORM HALLWAY so to not disturb her, because it made her feel bad for not having a boyfriend. Gee, I wonder why she didn't have a boyfriend?\n\nDon't let other people's mental issues / insecurities affect you.",
            "[deleted]",
            "sounds like she was the one mad at her kid for not getting into that school. i feel bad for that kid man, cant be easy having a mom like that",
            "Some ppl have mental isseus.",
            "Imagine being the kid of this woman and witnessing her aggressively telling random strangers all the schools you didn't get into jfc.",
            "Good god. The kid wasn't embarrassed about being rejected, he was embarrassed that his MOM had to SCREAM it at people who go to the school. How fucking mortifying.",
            "Plot twist \n\nThe child passed all the requirements for admission. \n\nIt was the mom that the school didn’t want.",
            "I wonder how many participation trophies her kids have",
            "How much do you wanna bet it was HER who wanted him to go. He is probably fine with it.",
            "\"That your kid was too dumb to qualify for my school isn't my problem. \"",
            "I literally can't even imagine talking to a high school kid in public as an adult, let alone berating them for being smarter than my little dummy.",
            ">since it made her kid embarrassed\n\nTake out the word \"kid\" here and we will finally see the truth.",
            "Also this is a great way to teach her son that he is entitled to being controlling over how women dress/achieve in the future. It’s not your fault he’s mediocre..",
            "Lawnmower parents are the worst. Mower down any challenge that might cause their child to grow.",
            "My school revealed our new school shirts (very unusual for our country to have any in the first place)    \nThe sponsorship logo was gargantuan.   \nLike, on the smaller kids, the circle-shaped logo would wrap around to the sides a little.    \nOur director sheepishly admitted that there had been an Mix-Up between diameter and radius in the communication...",
            "I was an educator and vice principal. I was often a part of new family interviews. We needed students and families. At one point we had admins who would ignore the warning signs.\n\nAll you got was a Hoodie? I would have purchased a hoodie, shorts, t-shirts socks, work shoes in school.colors, worn hair accessories in school colors and carried. Matching teddy bear. And done the plaid eyeshadow to match my skirt.\n\nI once had a school.parent ask the principal.in front of me if I was really allowed to wear red at that school? I wore red every day for a week. I still have the red pumps, red cowboy boots, red sneakers and a hideous red plaid shirt I bought to keep the red theme going. I never said a word. I just wore red.\n\nMy boss thought it was hysterical. That parent never.spoke to me again. Thank God!\n\nWhen private schools consider accepting a child, the parents  are considered as well.\n\n If the parents seem to be contentious before a child is even enrolled, hostile towards a particular school, an entire school district, teachers in general, or offer to throw down an entire year's tuition when rhe payments are monthly, sirens go off.\n\nMy personal favorite was any child whose parents wanted to enroll them past February, that jad noticed into the area.\n\nBarring victims of  bullying, or victims of violence, these students can come with serious issues. Often those issues are mom or dad. I feel so sorry for some.of these children. \n\nThat mom could have kept her rejection to herself instead of trying to control",
            "Just apologize.\n\n\"I'm sorry your son has such mediocre genes.\"",
            "Was her kid even along to be embarassed?",
            "This is an adult? Yelling at you? No, No, no, not cool at all, But I LOVE the Passive Aggressive Patty move with the hoodie. . . you have even changed it up, rotated in hats, bags and key chains... lol",
            "\"Miss, your child wasn't rejected. You were.\"",
            "Anyone else suspect the school rejected having to deal with her?",
            "The first time was unhinged...every moment after that was incredibly abusive and targeting a child. I'm confused why your parents were never informed this grown woman was harassing you in public for weeks on end over her own child's failure. Honestly, this should have had charges and escalated, especially if staff saw you get accosted a bunch of times...",
            "\"Sounds like a 'you' problem.\"",
            "Gonna be honest here that is perfect MC. My MC would be that shirt under a shirt I have that's a button up that just says 'go F yourself' in cursive letters over a nice tropical pattern. Sure I wouldnt wear it to school but I'd have it in my backpack for after school. Hell my mom told me people wouldnt like me wearing that shirt. I told her if they dont like it they can read it again",
            "Most of the time exclusive k-12 schools don’t reject the kids, they reject the parents.  Teachers are quick to flag kids during initial interview process w/ parents that show signs of being miserable human beings.   It’s sad for the kids, but its reality.",
            "Should have arranged a field trip",
            "Yeah sure... her son was the one embarrassed.",
            "I don't think the shirt was what embarrassed her kid.",
            "Could have just told her the world needs ditch diggers too, and to stop gatekeeping her love based on achievement.",
            "This is the way.",
            "My child is better than you and deserves to be in that school instead of you.\n\nGood god these people really are something.",
            "Maybe she should teach her child how to handle rejection and grow from that experience instead of taking it out on others... But based on her reaction to a stranger in a school shirt... She probably isn't capable or willing to accept failure either.",
            "It seems she is embarrassed that her son was rejected.",
            "Ah, the good ol' \"I'll fix this embarrassment I've projected onto my kid by causing them an even bigger embarrassment\"",
            "The audacity of someone demanding a random stranger in a public space change clothes to suit their purposes. Unbelievable.",
            "Who wants to bet it wasn’t her schedule before first incident",
            "Who is this Karen. Lots of people talk about her. She must get around a lot. 😎",
            "People have precise shopping schedules?",
            "🤣. Wear with pride and malice. The world needs to get back to rewarding on Merit.",
            "Plot twist: her \"kid\" was 37 and she still wasn't over it.",
            "WTF is wrong with that woman, berating a child because she failed as a parent?\n\n(Her failure as a parent is *not* the fact that her child didn't get in, but the fact that she put so much pressure on her child that they 'get embarrassed' at just seeing the school's logo.)\n\nNext time, just tell her (as politely as you have to to uphold the good image of the school) to fuck right off.   Who the fuck is she to tell you what to wear?",
            "Good story. However not really compliance as you weren't necessarily compelled to do what she said as she had no authority over you. Maybe more of a r/middlefinger.",
            "Parents like her are why kids grow up to be entitled little snowflakes offended by everything and expecting everyone to appease them",
            "Tell Karen to get fucked. But in polite way. If that doesn't work then tell her to get fucked. 😄",
            "What a self-involved bitch.",
            "Just point to your ears and mouth, “I can’t hear you I have on head phones”, even if you don’t and continue doing whatever you are doing or want to do.",
            "You should have started slightly bigger and worked your way up to the hoodie with the extra large logo.",
            "A simple F.U. should suffice.",
            "Never have I ever even considered telling a stranger what they can wear in public, and I also cannot fathom even entertaining the conversation of someone trying to tell me the same. What kind blowing entitlement.",
            "Yeah, I'm thinking the kid isn't the one who's embarrassed...",
            "Or, and bare with me, tell her to shut up and mind her own business.",
            "Literally insane",
            "\"It's not my job to help your kid feel better about himself. It sounds like *you're* the one who's embarrassed that he was rejected.\"\n\nAnd I would figure out when she shops and start shopping then, too.",
            "I wouldn't be surprised if the kid was just half winging studying for the tests because he didn't really care, either the parents forced them to apply or they didn't care about it too much and the mom was just assuming they're embarrassed either for herself in reality or she's disappointed and she got double punched when you showed up with the hoodie everytime.",
            "good for you. you're in the right.",
            "BAD ASS...😑",
            "I would have been too tempted to tell her that if her son is embarrassed that he didn't get into the school maybe she failed as a parent and should be more concerned about her own issues than your shirt.",
            "I would have told management about the ongoing harassment and got her banned from the store all together.",
            "It sounds Karen is the one who is embarrassed.    Her embarrassment is not your problem.",
            "\"I have my uniform shirt on, my school hoodie and my school logo panties as well\"\n\nturn to her kid 'are you really embarrassed you didn't get in, or just embarrassed she is your mother?\"",
            "She is clearly the embarrassed one and not her kid. \n \nI’m am making this second part as to comply with your edit in which you requested we “please stop **just** commenting that”. This portion of my comment complies with your request.",
            "Does anyone believe this one?  \n\nPretty low effort.",
            "How did this crap get an upvote? Cue the limited imagination.",
            "Weird woman",
            "I like it. I really like it.",
            "Jamaica? 🤔",
            "I would mail her promotional postcards with the logo of the school and a pre-printed message that read \"Hi neighbor! Hope you have a great day!\" just to piss her off. But that's just me being petty, passive aggressive, and with lots of time and stamps from when I used to exchanged postcards and shit.",
            "I think she’s the embarrassed one am I right? Btw did you go to Lake Ridge Academy?",
            "\"Well you ol' biggity bitch.  Maybe you should teach your special needs kid how to process his emotions.\"",
            "You should have reported her to the police for continuous harassment, maybe even get a restraining order.",
            "You could complain to the manager that she is repeatedly harassing you and yiu would like her trespassed. Then you wouldn't have to worry about your schedules coinciding.",
            "r/summerreddit",
            "I would've said something like \"You're just mad your son didn't get in because you're trying to live vicariously through him, so you can shut up. I don't have to change clothes after school to go to a store just to make your little hurt feelings feel better, so you can shut up. Go to a fancy school yourself if you're such an egghead. It's just a shirt. Do you lose it over everything like this? Go cry about it.\"",
            "The kind of people who shouldn't be allowed to have kids. Anyone who couldn't pass an adoption screening need to be permanently fixed",
            "I don't know.  I also find people who wear their private school / ivy gear everywhere in public to be pretty obnoxious.",
            "Still waiting for the \"malicious\" part....",
            "\"Your child's inferiority is not my problem...\"",
            "Or... you could've just said *\"I'll wear whatever shirt I like, and you can F yourself, you old Karen hag.\"*",
            "I am not sure if the biggest loser is Karen or her cursed spawn",
            "INFO: were you still wearing the school shirt under the hoodie? If so, not malicious compliance 🤔",
            "What a dumb waste of money, especially for an even dumber Karen and her kid-that-probably-failed-because-of-her-anyway…",
            "Man, I bet she doesn't like abortions because she doesn't want to have one.",
            "Was it Brooklyn tech",
            "> _All I do is flex, I don't need a reason!_\n\n-Drizzee Rascal (OP)",
            "[deleted]",
            "Just be careful with logos if you are actually affiliated with the institution in question. Not as bad with schools but wearing a work uniform can and has been construed as representing the company, and we all know they tend to side with the irrational lying complainer over the employee.",
            "\"Karen\" is a sexist term and it's time to let it die out.",
            "You should post this in r/Imapieceofshit, too.",
            "Plot twist, there was no son!",
            "Do self favor do not react to Karen.",
            "Harassment??",
            "It's not your fault her kid is genetically inferior, king.",
            "She sounds like fun.",
            "I would have told the store manager that this lady keeps harassing me.",
            "She might appreciate some bumper stickers",
            "It’s not compliance, you have no need to comply with that awful sounding bitch.",
            "Tell her to mind her business. Don’t even entertain people like that.",
            "A grown woman harassed a child for months over a shirt? Did anyone ever try to say anything to her?",
            "Do people really have a \"schedule\" for shopping?",
            "[removed]",
            "I'm just saying that she is clearly the embarrassed one and not her Kid. Yes,  that's very obvious.",
            "Bro you Jimmy Hopkins? Cuz this whole setting sounds like you enrolled at Bullworth, lol.\n\nExcept it includes Karen.",
            "Just give her kid the shirt. Tell everyone they're on the rowing team.",
            "Oh hey, you went to [insert school name here] as well? OMG... what a coincidence! So you remember [insert teachers name here] they were so cool especially when they [insert cool thing here], I did think they were going to get fired for that but nope come start of school year [insert year here] they walked into class like nothing had happened! Ha ha ha!\n\n\nGood times indeed",
            "You should have told her, \"He didn't get in? They must have found out that he's a jerk like his mom.\"",
            "Oh look! Here's one!!",
            "This would great on r/entitledparents too!",
            "Man that woman is crazy,  like literally, she is trying to change reality or force other people to change because she through her son got rejected.... Man people are so entitled these days.  Although it would seem that she is exactly the reason her son didn't get in,  sounds like she thought her hair cut would just whisk her son into the gracious arms of the school."
        ]
    },
    {
        "post_id": "jvqyis",
        "author": "technos",
        "title": "Okay, that'll be four weeks.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jvqyis/okay_thatll_be_four_weeks/",
        "score": 13071,
        "num_comments": 287,
        "created_utc": 1605609931.0,
        "selftext": "A million years ago I worked for a leasing company. We leased anything from manufacturing equipment to jets, but our bread and butter was computers.\n\nOne fine day a customer calls in to find their salesman is on vacation. They don't like that, not one bit, and after being told that no, they will not be getting the number to his hotel in Aruba, they're passed on to Tommy. \n\nTommy was the fucking new guy, but in a good way. A customer would ask for something and he'd spend two days reading white papers, benchmarks, and calling vendors to find the answer himself when there was a guy fully conversant in that technology two cubes away. \n\nAnyway, the customer wants sixteen workstations in a hurry. SGI Octane, dual-processor, with 128MB video cards, 4GB of memory, and monitors.\n\nThey don't care how much it costs, but they need them as soon as possible. \n\nTommy tells them he'll call back in a hour, he needs to speak to the vendors. \n\n<Vendor1> will take three weeks at least, they're out of stock.\n<Vendor2> will take two weeks, and cost 20% more since they'll have to upgrade existing systems.\nSGI themselves quote three weeks. \n\nTommy, for the first time in his life, remembers we had a former executive from SGI on staff, and calls him, begging for a contact that might make it faster.\n\n>Exec: How about today? We have 20 of them in the warehouse. Sure, they're supposed to go to <customer>, but that won't be for another two months. We can play some games with serial numbers on the lease after the replacements come in.\n\nTommy thanked him and called the customer back.\n\n>Customer: It's been almost two hours. Next time don't promise a deadline you can't meet. \n\n>Tommy: Yeah, I know, and I'm sorry. I had to work pretty hard to track down what you need, and well, I've got some good news and some bad news. \n\n>Customer: You called <Vendor1>? \n\n>Tommy: Yep, they can't have 'em to you for three weeks.\n\n>Customer: You call any other vendors? \n\n>Tommy: <Vendor2>, they want a markup but can have it in two weeks. I also spoke with.. \n\n>Customer: What about the manufacturer? \n\n>Tommy: I called them too, they also want three weeks. But we have.. \n\n>Customer: How much of a markup does <Vendor2> want? \n\n>Tommy: 20%, but that doesn't matter because.. \n\n>Customer: Go ahead and order them. \n\n>Tommy: You haven't even heard the.. \n\n>Customer: If I never hear another fucking word out of your mouth it will be too soon. Just get it ordered, and I expect paperwork by 8am tomorrow. \n\nThe customer paid an extra quarter million dollars, plus interest and fees, and the guys in Services got an extra two months to play Doom.\n\nWith the reship delays on the order, they didn't get their machines for four weeks.",
        "permalink": "/r/MaliciousCompliance/comments/jvqyis/okay_thatll_be_four_weeks/",
        "comments": [
            "That’s great! Fuck em!",
            "Awesome story. Sadly for me,  I remember that roaring era 'a million years ago' when big money was thrown around with abandon for technology...",
            "Doom? 128mb video? 4G of ram? Way to make me feel old, guy.",
            "Speaking as a former salesman, fuck these kinds of customers. I had a dude call me and order specific part quantities, not a system, and when I told him that based on what he was building he was ordering the wrong parts, he told me that he knew what he was doing. I told him “well, if you need to swap these out for the right parts later on, I’m happy to do that for you.” He ended up calling back and tried to blame me for the mistake. Thankfully we recorded every call and kept it for a month.",
            "\"pride comes before a fall\" as the saying goes",
            "I'd have called him immediately after the order was finalized to tell him that if he'd given Tommy the chance to get a word in edgewise, he have had his computers the day he asked for them and could have saved a quarter million bucks.",
            "I hope Tommy learned his lesson... \n\nUgh, some people you are just glad when they won't let you help them. Others, you bend over backwards, break a few vertebrae, and their appreciation makes it all worth it somehow. Remember people, be the kind of person other people love to help.",
            "What the heck would they need that many computers so urgently for?",
            "Exec: How about today? We have 20 of them in the warehouse. Sure, they're supposed to go to <customer>, but that won't be for another....\n\nHow very Ferengi! Almost these exact words were the start of a multi-party series of swaps so that Deep Space 9 could get some unavailable parts in two days.",
            "Good. That is what he gets for talking over the salesman.",
            "I call bullshit on this - I was there a million years ago and we didn't have computers - we had rocks. And the dinosaurs kept stepping on them. That's how floating point numbers came about, by the way.",
            "The moral of the story: let people finish their sentences.",
            "He got what he wanted.  I guess that's all that matters, but it would have been fun to tell him some time later what he could have had if he had no been so rude and pushy.",
            "Lmao, imagine being rude to the guy who's trying to save you a quarter of a million monies",
            "You get more flies with honey and all of that.",
            "Ah yes the r/idiottax",
            "Doing the math, if 20% markup makes up $250k on 16 computers then each computer would have been about $78,000 per computer (~~base price~~ without the 20% markup).\n\nIs that really what something like that would've gone for and people actually bought them?",
            "/shakes head",
            "Sounds like Tommy was at least trying to do a good job with this. Lol",
            "SGI? Now there's a name I haven't heard in a long time.\n\nA long time.",
            "Isn't that what they refer to as the ID10T Tax?",
            "Doom was a great game.",
            "Nothing pisses me off more than getting cut off while trying to say something\n\nWish I had Tommy's patience 🤣",
            "too bad the guy never knew his quarter million fuckup.",
            "Should have gotten the one’s from sgi and pocketed the 20 percent to the company.",
            "NEVER help an abusive customer. Let them fail all on their own.",
            "\"Ok tough guy.\" I bet Customer had an AMEX Black card and was a douche to his girlfriend and swore every month when he wrote out his alimony and child support checks to his Ex-Wife.",
            "If that person's boss reads this - they will have gotten exactly what they deserve.",
            ">We can play some games with serial numbers on the lease after the replacements come in.\n\nCould you elaborate. I'm still a little confused about what he's saying here",
            "This is great.  If you haven't you should post it in r/stupidtax as well.  They will love it.",
            "So for the ignorant, what is SGI? The brand name of the computer, the manufacturer?",
            "I love people like that. Forever ago when I ran a computer shop, if somebody was rude, their deadline was pushed back and I upped the price of everything before printing their quote.",
            "> If I never hear another fucking word out of your mouth it will be too soon.\n\nTo be honest I've said something like this but also I knew I'd pay for it on the back end and knew I'd deserve it.",
            "What the hell",
            "Upvote for language and grammar.",
            "Idiot tax strikes again!",
            "[deleted]",
            "The real shame is that that guy's boss probably never knew what happened",
            "I hope they see this",
            "I now understand why this is called r/MaliciousCompliance",
            "This story made me so happy.",
            "This is not true, leasing companies were invented in 1932. You sir are a liar.",
            "I've never heard of a $78,000 workstation.  If 20% markup adds $250,000 to an order, you're saying that 16 workstations cost $1.25m.  I call bullshit.  Looking up SGI Octanes, they cost $20k on the high end.  \n\n\nI also doubt that the vendor was playing Doom on these, as they were linux based.  And I dont think there was a port available for Linux in the 90's.  \n\n\nIts a nice story and all.  But it feels a bit embellished.",
            "I hope Tommy told this guys boss what happened later.",
            "R/idiottax would like that.",
            "Haha",
            "Damn what kind of things did dinosaurs lease back then",
            "Fuck those clowns",
            "that guy is so dump like he dont ewen wanna listen to the last thing IMAO.",
            "This sounds like a really interesting line of work. It would be cool to be tracking down one thing one day and a completely different thing the next. Could keep things interesting.",
            "Awesome. Too good.",
            "[removed]",
            "All good dead’s go ...........",
            "Funny to think that my smartphone has more processing power now.",
            "Too bad you couldn't give them your stock at the super inflated rate... Coulda had one hell of a lunch party 😂",
            "I don't know what you said OP, aside from an AH losing hundreds of thousands of dollars, so fuck yeah!",
            "Bend over backwards and the customer is a total turd and screws himself.   Happened too many times to count in my career and from then on we would then make it look like we are really saving their butt but instead just giving them standard lead times.  Funny how being a jerk does not pay."
        ]
    }
]