[
    {
        "post_id": "org1l2",
        "author": "PanthermalUnderwear",
        "title": "Minimum wage is discretionary",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/org1l2/minimum_wage_is_discretionary/",
        "score": 13077,
        "num_comments": 568,
        "created_utc": 1627234732.0,
        "selftext": "Disclaimer: This story may qualify as Pro Revenge but I feel my hand in it was MC.\n\nMy first part-time job was in a cafe, starting when I was 16. As jobs go, it was pretty good. It was minimum wage of course but the owner was flexible with schedules, we got discounted food and my coworkers were generally lovely people. \n\nThe only issue I had occurred when I turned 18. In  my country (UK), minimum wage is set at one level for 16-17 years but then rises by around 30% for 18+. \n\nWe'd always been paid cash in hand weekly so I knew things were not exactly koshier but when my first pay envelope after my 18th birthday came, I was still surprised not to see my pay bump. \n\nThinking it was just an oversight, I informed the owner that I hadn't received my pay increase but they waved their hand and said \"Oh no, minimum wage is discretionary\" in a matter of fact way. I laughed at this and they acted like I was naive and said \"Trust me, it is. I can't pay you any more but you're free to try your luck elsewhere\". So that's exactly what I did. My colleague who had also just turned 18 and I had both found a new place paying more than double our current wage within a few weeks.\n\nThe only issue was that I was asked to start with only  a few days notice, on a weekend I was scheduled to work. I called the owner to let them know I had found a new role and could work my other shifts but not at the weekend and they told me my notice period was two weeks, to which I responded, \"Oh no, my notice period is discretionary.\" They didn't like that and told me not to bother coming back. \n\nThat was the last I had heard of them until a few months later when I received a letter informing me the government was investigating them on my behalf for unpaid wages. It turns out a colleague I had enlightened about minimum wage of course not being discretionary had also left and contacted HMRC. \n\nA couple of weeks after, I received my cheque from the owner in the post and I found out that within a few months the cafe had to close and let their staff go because of unpaid taxes. \n\nAll because they didn't want to pay us £4 83 per hour. (Edit: I had said £5.80, looked at the wrong figure).",
        "permalink": "/r/MaliciousCompliance/comments/org1l2/minimum_wage_is_discretionary/",
        "comments": [
            "Obviously, minimum wage is a hard rule. I mean, it's in the name.\n\nBut, at least iin Canada, the two weeks notice **is** discretionary. It is a good will gesture but can absolutely not be enforced by an employer.\n\nGiving plenty notice is a great way to leave on good terms (it's generally a good idea not to burn bridges) but, by law, you can quit and leave at any moment.",
            "Paying in cash was a huge red flag so I wasn't surprised where it went. I'm just surprised they weren't reported before then.",
            "When I was 16 and working at a Togo's, my paycheck was short as I wasn't paid for my recent overtime. When I asked the owner about it, she explained that over time was either over 8 hours a day or over 40 hours a week. And she, as owner, got to pick which one. I gave her a very confused look, so she proceeded to explain that 30 years ago she worked at a job where they worked three shifts of 10 hours and didn't get paid for overtime, as the owner had chosen 40 hours a week. (She neglected to mention the job required them to sign a paper allowing the business to pay them as such.) She went on for a good five minutes, all of pure nonsense. Seeing I was still confused she asked condescendingly, \"how can you possibly still be confused?' I started to reply with \"because, according to California state law..\" when she cut me off with \"OH we're going by the law now are we?!?!\" I replied \"aren't we?!\" She rolled her eyes and said she would ask her lawyer.\nA few days later I asked what he had said, and she begrudgingly admitted I was right. \n\nI expected to see the money on my next check, but of course it wasn't there. As I wasn't yet as confident as I am now, it took me a few weeks to muster up enough courage to demand that overtime money. But before I could, she died. So I decided to just drop the subject, it was only like $12 anyway. \n\nThis is the same lady that told me workers comp didn't exist and was a myth, so I better not go to the ER when I sliced my hand open and blood was running down my arm.\nI told her I broke my nose at my last job, and, wouldn't ya know it, everything was paid for because, gasp, workers comp does exist! She said it was different.\n\nI really did hate her.",
            "If your business model relies on exploiting your employees to make a profit, that business shouldn't be in business.",
            "If there's one thing HMRC don't fuck about with it's minimum wage enforcement. It's often linked to cash in hand businesses (of the illegal sort, rather than the ones who are legit but just use cash as a payment method), who more often than not are money laundering (or just straight up evading tax) and usually drugs and/or trafficking",
            "Don't break the law while breaking the law. There's a reason why this saying is a thing.",
            "Minimum wage is discretionary - you can always pay more.",
            "This happened to me once, but I didn't know I was being underpaid.\n\nI had a really good position. I payed like $10/hour, but I also regularly made tips averaging $100 a day. I always had cash, so I just let my checks get deposited and never thought much of it.\n\nTurns out my boss was supposed to be paying us overtime, which we got alot of. I ended up with a $1500 check a few months after the season ended.",
            "Did a \"trial shift\" at a place years back offering £5 an hour. I pointed out I was 21 and entitled to more. Manager said, \"it's untaxed so it's OK\". \n\nNewsflash, it wasn't OK. I walked out and looked elsewhere. \n\nMy dad became a manager at the same place some time later and proudly told me they paid the proper minimum wage now. He wasn't thrilled when I pointed out that is *literally* the bare minimum!",
            "Lol the government is all too happy to let you know that taxes are most definitely NOT discretionary",
            "I worked a waitressing job in highschool/some college weekends in my hometown. I only ever was paid in cash, and it was always $5 an hour (last I worked was probably 2013). They were only open sundays for church lunch crowd, so it was always about 4 hours of work/$20. We got to keep our tips though, and they only accepted cash or check. Pretty bizarre thinking about how they’ve never got caught for this now lol.",
            "I think it isn't clear to some people here that being paid in cash (with a wage slip) is relatively normal, but 'cash in hand' mean under the counter. The employer saves on book keeping, also their share of National Insurance and possibly other things.",
            "Getting paid in cash is a massive red flag. Very rarely is it kosher and especially without pay stubs. NEVER take this kind of arrangement for your primary employment. \n\nFor secondary employment or ad-hoc things then it's this kind of arrangement that is beneficial for you.",
            "Haha nice story. Love when businesses get facked that way for exploiting people",
            "> They didn't like that and told me not to bother coming back.\n\n\"Yes, that was the plan the whole time, thanks for confirming that you understood what you are being told.\"",
            "Getting paid under the table is always sweet. But eventually you gotta start paying the extortion.",
            "If a business donot want to pay employee minimum rate , pretty sure the business is shady and not supposed to be around",
            "Notice is discretionary!  I love it! Best clap back ever!",
            "Pro revenge would be a very calculated and subtle way of getting them to make a paper trail, to somehow get them to admit in writing or email what exactly you were paid, and then go to whatever the UK business practice authority is to get them shut down and probably get a big settlement",
            "Greed is many a person's undoing.",
            "Christ, minimum wage was 4.20/h when I turned 18",
            "I worked in a family owned furniture for several years and we were always given checks with all the correct things deducted then we would sign the checks and the boss gave us cash. Good way to go if you are a small operation.",
            "I don't know about before 18 but it's not just minimum wage they were dodging they were also dodging national insurance (it would create a gap in the number of years you have contributed) , reporting your taxes (you were likely under the minimum but hmrc loves to know) , employer pension contributions. At a guess they were also likely dodging employee liability insurance which is a big no with big fines.",
            "Usual story, if you are being screwed on the wages, you had better beleive there are shady business practices going on elsewhere, and it's better to nope on out of there to a place that's being run in an honest and competent manner.",
            ">\"Oh no, my notice period is discretionary.\" \n\nthis made me snicker like Mutley :)",
            "I know a burger joint here that pays all its workers by cash, but they pay well above minimum wage.\n\nSeems like if you’re gonna skirt around taxes in that way, you should probably take care of those unwillingly complicit in it.",
            "> Edit: I had said £5.80, looked at the wrong figure\n\nNot your main point, but I'm delighted to see that the perfect tense survives in England. It has completely vanished here in the US.",
            "The minimum wage is law in the UK and is rigourously enforced. Anyone describing it as \"discretionary\" is in big legal trouble as this story demonstrates. Personally I don't think the penalties are stiff enough.",
            "Oh no…not because they didn’t want to pay £4.83 per hour but because they had no integrity. They would have been discovered eventually…this was just the catalyst that moved it along. Well done, you!",
            "Jeez, is that how low it is? When I was on that band of wages, it was £5.15 (2014). I thought it would be at least £6 by now",
            "I have never, *ever*, understood why ANY person, anywhere in the world, in any country, would ever be better off by giving notice.\n\nIt is to the [edit: net] detriment of the employee, every, single, time, with no exceptions of any kind, ever.\n\nEdit: *ever*.",
            "You should and should've reported them to official bodies as that's illegal and they should be investigated. Cash makes it hard for them to be caught but if the body has a tip then it's on them to investigate or catch them.",
            "L",
            "Yeah. Unless I'm getting severance or notice for my dismissal you ain't getting it from me",
            "Notice period is discretionary from the employees side. It's not enforceable. The only potential enforcement is if you signed an employment contract and they wish to get a solicitor involved and pursue for loss of revenues. I expect a judge would throw it out as a vexatious action but that's armchair lawyer theory.\n\nOn the employer side notice is not discretionary unless you are on a zero hour contract. Notice period is based on years employed. If you were on a zero hours contract then the employers zero notice is also the employees. \n\nI educated myself quite a bit about employee rights in the UK last year during a dispute with my employer. They paid me off in December.",
            "I mean, it's called MINIMUM WAGE for a reason: it's the _minimum_ amount an employer can legally pay you.  As in, the employer doesn't get to choose.",
            "This would be appreciated in r/TalesFromYourServer/",
            "In America no one would investigate it. \nWe live in a corporatist fascist hell hole here...",
            "Minimum wage is supposed to be for highschoolers not your life long job",
            "Seems like everyone involved acted pretty reasonably, tbh. They wouldn't pay you what you asked so you found employment elsewhere.",
            "[deleted]",
            "If you have a job that only requires basic brain activity don't expect to get paid more than $10 in an hour. Get a better job",
            "I love everything about this",
            "Nice!!!",
            "From other posts here, at least the owner didn't fire you on your 18th birthday.",
            "I know this is old, but I wanted to comment as I see a lot of posts stating a requirement for 2 weeks, months, etc. Notice when leaving a job for a new one. \nI am confused as to what you think will happen if you don't. I've worked many different jobs (here in the US) and I've literally walked off the job for a couple. I've also been let go with no warning as well (as each state has their own laws regarding firing and layoffs) ... I even quit a job just as the boss was asking me to \"step into his office\", coincidentally that resulted in him asking why I was quitting and me proceeding to rip him a new one as I pointed out how terribly he treated me and my friends (whom he'd already laid off in the previous month) and me submitting a formal resignation to HR which slotted me for rehire. Albeit, I had no desire and the company is actually now closed.    So to my point; if you're treated poorly, Fuxk'em and leave. What can they do? Take away your birthday?!?",
            "Hope they didn't keep your last pay for not giving notice. Wouldn't put it past them!"
        ]
    },
    {
        "post_id": "lg54u5",
        "author": "QueenSupreme21",
        "title": "Dad tired of answering questions declares next answer will be a NO",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lg54u5/dad_tired_of_answering_questions_declares_next/",
        "score": 13060,
        "num_comments": 136,
        "created_utc": 1612882935.0,
        "selftext": "So this happened at least 30 years ago.... so the wording isn't exact.  Cast is Dad - my Dad, Sister - my older by 3 years sister and myself.  I would guess I was about 12 or 13....so my sister was about 15 or 16.  Names have been changed because honestly I don't remember all the names.\n\nMy friends and I were trying to plan a day/night out.  We were going to go to a movie and as this was before cell phones and 3 way calling it involved a lot of phone calls between a group of preteens.... and a lot of changing circumstances.  \n\nI went to the living room where my Dad was sitting reading a book....\n\nMe : Dad, Katie, Becky & I want to go see Random Movie Title tonight.  Is that ok?\n\nDad : Yes. (goes back to reading his book) I go call a friend and tell them.  About 10 minutes later....\n\nMe : Katie's Mom can take us, can you pick us up?\n\nDad : Yes. (goes back to reading his book) I go call a friend and tell them.  About 10 minutes later....\n\nMe : Becky's mom said she can pick us up, if you or mom can take us since Katie's mom need to take Katie's sister to her friend's house now. Is that ok?\n\nDad : Yes. (goes back to reading his book) I go call a friend and tell them.  About 10 minutes later....\n\nMe : Ok, so now Jill wants to go to.  Can we pick her up too?  (My sister walks up to ask about going out with her friends)\n\nDad : (in a slightly frustrated but still teasing tone) Yes, but the next question someone asks me the answer is No.  I am tired of saying Yes.  \n\nSister - (thinks for a minute) Dad, would you mind if I go over to Susie's house? (big grin)\n\nDad : (starts laughing) No.\n\n&#x200B;\n\nDad says the next answer is no.... Sister words her question so that the no is a yes.  ;)",
        "permalink": "/r/MaliciousCompliance/comments/lg54u5/dad_tired_of_answering_questions_declares_next/",
        "comments": [
            "And now I know my sister's Reddit! 😉😆",
            "This reminds me of a time a not-so-good friend called to talk to me. My dad told me if he can't see me he can't hand me the phone. I ran and hid in his closet as he answered the phone, knew where I was, walked passed me as he told the person he didn't see me and didn't know when I would show back up. I was about 8 at the time, and still makes me laugh.",
            "Awesome story, but not really malicious. Maybe r/wholesomecompliance would be a better fit",
            "Reminds me of a skit on some Nickelodeon show (You Can’t Do That on Television maybe?) where there was a store where you could buy parents and someone was returning theirs because they always said no. I thought that would be perfect. \n\n“Mom, do I have to go to school today?”   \n“No”   \n“Have I eaten too much candy today?”   \n“No”",
            ">Cast is Dad, sister ... names have been changed because I don’t remember all the names\n\nAt first reading I thought you forgot your dad and sister’s name. 30 years is a while ago, but not that long, hahah",
            "A good dosage of wholesomeness right here.",
            "Awww. That's very sweet.\n\nAnd I've got to say I'm glad some people went to see Random Movie Title. Hardly anyone's heard of it, but it's a true underrated classic.",
            "Very wholesome story, I like it.",
            "I’m reminded of my (then) 4 year old refusing to eat vegetables:\n\n“If you don’t eat any vegetables then you won’t get dessert.”\n\n“OK, no dessert for me.”",
            "Your Dad sounds awesome and you sound like\nSweet kids",
            "Read this wondering how he could forget his immediate family’s names.....",
            "I love this. Gave me just the kind of smile I need right now.",
            "I would have asked, \"Do I have a curfew?\"",
            "\"Dad, would you object to giving me $500?\"",
            "I used to do with with students when I worked at a boarding school.  \"I don't care what you want, the answer is 'no'\"  They would stop and think it out to make 'no' the answer they wanted.  \n\n&#x200B;\n\nI think I was training lawyers.",
            "My dad can talk in his sleep so we always figured out that if we asked him if we could go to our friend's house while he was napping he would always say yes. Meanwhile my mom would come home freaking out about where we were, but we had a legitimate yes.",
            "Prior to reddit, dads used to read books.",
            "The days before cell phones when organizing a day with friends had to be done two days before and took an entire evening to plan.",
            "He knew what he was doing, with no kids in the house there would be no more distractions and he can read in peace",
            "Oh man. I rememeber the days of 6 phone calls to make plans.",
            "I am so excited for when I can be the dad in this story lol am I weird?\n\n(Not specifically this story in this exact order but it would be the most amazing thing ever if this just happened lol)\n\nOk, maybe I am weird.",
            "Your dad was a cool dad!!!!    Your sister was very cool too!",
            "I expected this much. Why? [This cartoon](https://i.imgur.com/Q9WLWlw.jpg) I did about 2 years ago.",
            "That’s a good dad right there",
            "That's the plot of the English folk song \"Oh no, John!\".\n\n[lyrics](http://www.traditionalmusic.co.uk/political-songs/oh-no-john.htm)",
            "I forget the context, but at one point both my sister and i were asking him about something and the answer to her was always yes, the answer to me was always no. I pointed it out and my sister started asking nonsensical questions and receiving a yes for each one. Then i asked \"are you going to say no to this question?\" And all he had to say was a resounding \"DAMMIT\"",
            "Wholesome family. My parents would've been pissed by the second question.",
            "You forgot the names of your father and sister?",
            "Alright, alright, alright... As a little sociopathic child, I was 100% fine with my shady behavior!",
            "Not very relevant but as an ESL speaker the \"do you mind if..?\" thing absolutely fried my brain while learning English.\n\n\"Do you mind if I borrow a pencil?\"\n\n\"Yup go ahead\"\n\n\"Oh so yOu dO miNd??\"\n\n\nDo you want the fucking pencil or not",
            "My next question would have been:  \"Dad, am I your biological son?\"",
            "It’s malicious compliance because, “Dads are subtle and quick to anger!”",
            "How the fuck did this asinine post get 7000 upvotes?  Fuck you all.",
            ">Cast is Dad - my Dad, Sister - my older by 3 years sister\n\nSo glad you clarified this shit, OP. Would have been lost thinking \"dad\" was your mom and \"sister was grandma or something",
            "I'm sure this could have been explained the same with a tenth of the words",
            "\"Dad, would you mind if I rode my boyfriend?\"\n\nI'm glad she didn't go that route. I have a dirty mind.",
            "[deleted]",
            "ocyx6xgxxxyxyxxgtt",
            "I like your dad.",
            "This is cute!!",
            "That's adorable!!!",
            "Should have asked the dad if he loved the older sister more.....",
            "Lol.",
            "Wholesome content. Love it 😂",
            "Clever. I was expecting a double negative. Smart cookie ;)",
            "That's from an old joke.  Only it was a  woman telling her date that her parents told her to say no to any request he made.  So of course, \"Do you mind if we go to a motel?\"",
            "This was great",
            "I remember that FoxTrot comic",
            "If this happened to me today I would say 'So you don't buying me this thing online, right?' (the thing being a cheap, but fun thing)"
        ]
    },
    {
        "post_id": "16jtxe3",
        "author": "Sufficient-Forever11",
        "title": "Give me a parking ticket for a spot I paid for, I dare you",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/16jtxe3/give_me_a_parking_ticket_for_a_spot_i_paid_for_i/",
        "score": 13055,
        "num_comments": 281,
        "created_utc": 1694825043.0,
        "selftext": "About 10 or so years ago, I went to a concert an hour away from me in Indianapolis. Decided to make a day of it going to several museums and spots around the city. Each time paying for parking in a garage for 2 or so hours then going to meander around the area. Finally, I go park close to the venue and paid for parking until the time it was free. Total I probably paid $40-50 for parking throughout the day. Enjoyed the concert, but come back to a parking ticket on my car. \n\nI think, \"this is odd,\" but I am tired and chalk it up to a mistake. But I decide to take photos of my parking spot (both spots on either side were taken) and all the signage and head home for the evening, figuring I would sort it in the morning. \n\nThe next morning, I review the ticket, the photo of my spot and my parking receipt. The ticket did not line up to the spot my car was located in and my receipt shows that I had valid parking at the time of the ticket. So I submit an appeal thinking this will be easy, its obvious that a mistake was made. \n\nThe appeal was denied. The ticket was for the spot that was not paid for, ergo it stood. I called the office, and the lady said they did not make a mistake as my receipt showed that I paid for spot X-1 and the ticket was for spot X. I ask about the photo proof that my car was in spot X-1. She said, \"well you could have moved the car\". Note that the parking receipt included my license plate number and everything (think park mobile like system). I noted that there were cars in spots on either side of me and that the entire street was full because of the concert. And honestly, I don't think they bothered to look at the photo. Even had that not been the case, I had proof that that license plate had a paid parking spot. No matter what, no dice. \n\nI am feeling petty over this $25 parking ticket at this point. So, I called Visa and asked if I could retract the amount I paid for the time that I had parked since it didn't count. I submitted all the evidence and documentation to Visa. Visa, in what was the greatest thing Visa has ever done IMO, they agreed that if my parking receipt and transaction number wasn't proof I had paid for parking, then clearly I had paid for a service I did not receive. And they extended my initial request of cancelling the one transaction to include all the parking spots I had paid for through the system that day, valued at more than the parking ticket. Then they filed a formal complaint on my behalf with a letter explaining why they were refunding me. \n\nI would not have been nearly as satisfying if I had not spent the entire day playing tourist in the city and wracking up a large parking bill all with the same vender.",
        "permalink": "/r/MaliciousCompliance/comments/16jtxe3/give_me_a_parking_ticket_for_a_spot_i_paid_for_i/",
        "comments": [
            "Ha, nicely played and well done Visa! :)\n\nIt's not often that a credit card company gets congratulated for over and above service!\n\nAlso, a $25 parking ticket? Wow, that's so cheap compared to the last one I got!",
            "Fun fact: If VISA has to do a chargeback, they will tack on a $40 fee on top of the refund. So not only did they lose $50 for the parking, they may have also lost 40 x [number of payments].",
            "Good on you! A lesson for us all, put it on the card.\n\nHow cool is having the credit card company help you in a dispute?",
            "Happened to me in Atlanta multiple times, over a <$5 street parking charge. I submitted all evidence with copies of the receipt and parking ticket, clearly showing the times. No luck, denied on appeal. I just don’t park on the street anymore, but this is genius. Thanks!",
            "This is great, I was in an almost similar situation couple of weeks ago. Paid for parking in a city lot at the beach. Crowded day, long line at the pay station. Made the payment about 12:48 pm and found that I had received a parking ticket at 12:45 pm i.e. while I was still waiting in line to pay. \n\nI have filed an appeal with that city, but not sure what the outcome is. If it doesn’t go my way, I have saved your post and will sure give Visa a call.",
            "That's awesome! I have told companies that I am happy to call the credit card company to dispute the charges, and arrived at reasonable outcomes - but this is way more satisfying.\n\nGood job!",
            "This is Not a malicious story, but a story about parking tickets are a load of crap\n\nRight near my wife's work are bustops which is normally no parking, but the bus stop signs have been covered up for the last 6 months or so.\n\nShe and her colleagues have parked there for several months without issue and then a few weeks ago she and her colleagues got a ticket for $140 as. She then noticed that the signs were uncovered\n\nShe was going to pay it but I told her to just wait a bit and see if we can dispute it. Her boss overhead them talking about it and told them not to pay it\n\nHe works for the local council and had it in writing that the bus stops weren't active until the end of this month. They all disputed it and got it cancelled (and the signs are covered up again)",
            "I got a parking ticket in Nevada because I backed into the parking spot so no one could easily get into my trunk. They claimed I had removed my front plate to avoid their ticketing process. The problem is that I'm from Arizona and we don't have front plates. They left the plate part blank so I just ignored it. I never heard from anyone from the MGM.",
            "Nice.",
            "Wait, was it a private vendor that gave you a ticket, or was it a municipality? Because if it's a private vendor, they have no actual ability to enforce their \"penalty.\" They certainly can't add points to your license.\n\nCan't go after you through collections either, since they'd have to get your information through DMV, which the DMV won't do. And most definitely without a contract between you and the parking people, they can't threaten your credit.\n\nThis has happened to me before and I've told the parking people to go pound sand, since I knew I was in the right. Never heard from them again.",
            "Someone at Visa woke up and chose violence. Beautiful.",
            "Dude, that was glorious!!!!",
            "This story tends to piss people off but it is relevant.\n\nIn a down town area where I grew up there was a small concert venue about 1.5 blocks from my dads office. I got tickets for the venue. To save on parking I went to park in my dads reserved space. As soon as I got out of the car a guy runs up and says parking is 5 bucks.\nI tell him no parking is free for me, I rent that space he argued back and forth that he is going to tow my car as soon as the police approve it.\n\nPolice show up, get pissy with me about not paying. He says “stop acting like your name is on the spot”. I ask him to follow me to the front of the spot and low and behold my name is on the spot.\n\n\nI laugh my ass off as the cop tells him “apparently this is his spot”",
            "Any time I can set a credit card company on a business, I know they have my back. They have all the leverage, as in, oh do you want your company to still accept our card?\n\nI once bought a dining room table and a bed from a fly-by-night mall furniture store. The chairs were all broken and the bed was a completely different one. They kept dragging out the excuses until I called VISA. Thank goodness I paid with a credit card!",
            "Thats crazy they have such strict parking since that entire city is just parking lot after parking lot",
            "Visa Visa Visa - they'd be so pleased if media pick up on this - the sort of publicity that money can't buy. Unless of course...",
            "Absolutely fantastic! I hate brainless bureaucracy that can’t and won’t admit a mistake. The “ maybe you moved you car@ defense made no sense.. why would you pay for a spot .. time starting before the ticket .. only to park somewhere else. But you came out ahead !!! My hero",
            "Downtown parking in Indy has been notoriously scammy. A few years ago an attendant was parking cars in a lot for a concert. In the middle of the concert, someone erected \"No Parking\" signs on the lot and towed the entire lot. I had recently snowed and you could see metal shavings from where they had drilled to attach the signs. I think the tow company got many similar complaints and was banned from doing business downtown.",
            "I got a $30 parking ticket this past week after I paid the $1.75 for parking from 7:30am to 12:30pm. Ticket was given to me at 10:30am. Filed an appeal and hope that it goes through and is approved because I have no intentions on paying $30 when I paid for my parking",
            "> Visa, in what was the greatest thing Visa has ever done IMO\n\nI would not be surprised if the agent who helped you remembers it as the greatest day they've ever had working at Visa.\n\nI really hope so, they definitely earned it.",
            "Even before our street parking turned 100% digital, I would take a couple photos of my parked car as proof of when and where. And then also when I am walking back up to it.",
            "Awesome!",
            "A $25 parking ticket? Even for ten years ago that’s incredibly low.",
            "If you paid to park and could prove it, why would they think you would move your car to a different spot? What purpose would that serve?",
            "I bet that person working for Visa hates the Parking Authority too.",
            "Damn. Whoever you got at visa needed a damn raise after that shit. That's so funny!",
            "Cool. Wicked customer service By Visa",
            "I have seen people sell a parking lot they didnt have the right's to and all the cars were towed away during the show.",
            "And Visa probably also charged them at least a $25 fee to investigate, lol",
            "This is the best MC I've ever read.",
            "So you don’t contest the ticket with the ParkMobile people. You do it [through the city.](https://www.indy.gov/workflow/contest-a-parking-citation)\n\nThe city doesn’t care. They don’t make or lose money regardless, so you should always go this route. Parkmobile does care which is why they said no.",
            "hilarious",
            "On top of everything, it’s frickin’ Indiana… part of the reason!",
            "This is content we come here for. Especially since Visa were in on it. Excellent.",
            "This is glorious.",
            "I guess it was your luck to be paying for parking using your credit card. Where I live, that would be extraordinarily exceptional, culturally-like.\n\nTBH, I didn't know a credit card company even had the ability to reverse a transaction at a consumer's substantiated request. I always held the belief that credit card refunds came out of the credit card insurance policy.\n\nWhatever the case, kudos to Visa, and hats off to you for your perseverance. A traffic fine of any kind, can be difficult to fight, and moreso frustrating when you're innocent.",
            "You should have paid the ticket with your Visa too.",
            "The officers that were on the job doesn't understand that you were visiting and they decided to let the others off the hook without it. So clearly someone didn't do their jobs correctly and this is the results that they get.",
            "My dad taught me, long ago, to not drop money in on street meters. His philosophy being that the amount of money he had saved over the years by not paying to park would offset any potential tickets in the future.",
            "Be careful. There could be some embedded terms you accept by using their parking system/spots that an \"unused\" spot is just abandoned fees. \n\nUltimately it sounds like you made no mistake but they believe their original judgement no matter what.",
            "So I don't think there is anything malicious about this. If they cannot ensure their product is correct and provide you a proper reciept they shouldn't be selling it. It doesn't matter if its their fault or the #ssholes at parking enforcement. Its not yiur problem. You paid them for a parking spot and they failed to properly ensure that service was correct.",
            "I don't understand this part, \"And they extended my initial request of cancelling the one transaction to include all the parking spots I had paid for through the system that day.\"\n\nWhy did they decide you hadn't received parking for the whole day based on to receiving parking for one spot?",
            "I had someone put their parking ticket on my car hoping I would pay it without reading it.",
            "I would die on that $25 hill. I'm just saying When I was ticketed while on jury duty I had to call soooo many people. The courts issued a valid parking tag allong with the jury summons with no tape. I left my window cracked in the middle of summer and of course the wind blew it down off my dash to my passenger seat. I had pictures and everything they just expected me to pay the fee. Not today, Satan.   I finally went back to the court house and showed them the photo of the pass on passenger seat, basically if the meter reader looked for a Jury duty pass they would have seen it, I asked the courts to pay it. She picked up the phone and called city hall and got it worked out.",
            "I did the same thing with some travel insurance right before Covid hit. Fuck those fucking guys",
            "> I called the office, and the lady said they did not make a mistake as my receipt showed that I paid for spot X-1 and the ticket was for spot X.\n\nThis makes no sense whatsoever.",
            "Mike Pence is gonna be so mad about this, he’s gonna start making all the tornadoes gay again",
            "Ask for evidence that you were parked in spot X. Pretty sure they take pics.",
            "Is it me or is this entire post bots advertising for visa?",
            "This story could definitely be a Patrick and Man Ray meme.",
            "I'm not sure I understand what part of this story is compliance. I'm also not sure I see what was malicious.",
            "How did you rack up that much in parking in Indianapolis? Street parking is $1.75 per hour, there are lots that are all day for $10, and the only places you would have to pay for parking are the zoo, directly downtown, or Mass Ave. I can't think of a itinerary that would rack up that much unless it was on like a Colts game day and you chose the most expensive places to park.",
            "Just don’t pay it",
            "Beautiful",
            "Someone is going to dragged in on the carpet in the morning.",
            "EXCELLENT.  You are the hero(ine) we all need! Huzzah!",
            "Most issuing banks have a minimum they'll pursue.  In many cases if you have a $25 dispute, they'll write it off so the employees can pursue the big claims.  Unless there's a pattern of abuse by the merchant or the cardholder",
            "Parking in Indy is always a pain. Well done",
            "This is equal parts emotionally and morally satisfying",
            "I work for a company that handles parking for a Local Council in the UK.\n\nIf we tried to pull some shit like this, the adjudicators would crucify us for it. It's shady as hell."
        ]
    },
    {
        "post_id": "94ph3t",
        "author": "littlesnuglet",
        "title": "\"I graduated from Le Cordon Bleu, I don’t need your help.\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/94ph3t/i_graduated_from_le_cordon_bleu_i_dont_need_your/",
        "score": 13041,
        "num_comments": 811,
        "created_utc": 1533444954.0,
        "selftext": "Months ago, I was in charge of overseeing a transfer of ownership for a bakery.  My primary duties were teaching the new staff how to use the equipment.  Reason being is because the equipment used analog dials and old school switches.  Everything goes well for the most part, the new owners were all receptive and willing to learn.   Then one day during the two week training session the newly hired pastry chef comes in and I was asked to train him.  This is where the fun begins.\n\r\nMe: So let me show you how to use the oven, it is imported and can be temperamental.\n\r\nPastry Chef: I graduated from Le Cordon Bleu, I don’t need your help.  Have you had formal training in baking?\n\r\nM: No, I have not and I have no doubt you're capable.  However the oven can be temperamental.  I’m just here to give you tips. \n\r\nPC: I don't need your help, I've been trained to bake on many types of ovens.  This is no different, I'll be fine.\n\r\nM: Ok, I understand.  However the owners have asked for a demonstration.  They would like to see a batch of cookies and croissants.  The ingredients are over there.\n\r\nNew Owner: have you taught the new guy how to use the oven?\n\r\nM: I tried to, he said he’s fine and doesn't need my help.\n\r\nNO: Ok, lets see how he does.\n\n\r\nA few hours go by and we come back to two batches of charcoal.\n\r\nNO: what happened to the croissants and cookies?\n\r\nPC: I don’t know, I followed my recipe exactly.  It must be the oven.\n\r\nNO: I don’t think so, the oven has been repaired and maintained.  There nothing wrong with it.  Did you follow the pointers that he gave you?\n\r\nPC: of course I did.\n\r\nM: No, you didn't.  If you hadn't brushed me off so quickly I would have told you that the oven is imported and uses Celsius not Fahrenheit.  Also, the bottom burner runs a few degrees hotter than the top so you need to either use a baking sheet or double pan the pastries to avoid this (pointing to the pieces of charcoal).\r\n\r\nI swear… the absolute arrogance…\r\n\n\nEdit: Initials",
        "permalink": "/r/MaliciousCompliance/comments/94ph3t/i_graduated_from_le_cordon_bleu_i_dont_need_your/",
        "comments": [
            "Regardless of education or lack of im not sure i would trust a baker whos first question isnt \"anything i need to know about the oven?\" \n\nEvery oven has its quirks. ",
            "[removed]",
            "[deleted]",
            "Sounds like the pastry chef Le Cordon Blew it.",
            "One thing I’ve learned from restaurants is that culinary grads have their heads shoved miles up their own asses.",
            "lol he seriously tried to act like he didn't blow you off after?",
            "Everything I learned in culinary school, I later found out I could have just learned by watching all of Alton Brown's shows.\n\n Also, you get the arrogance knocked out of you pretty fast when you see the underpaid, overworked Mexicans doing the same thing as you, but ten times faster.",
            "What happened after?",
            "There is no arrogance like \"I am done learning.\"",
            "\"I paid 100,000$+ to be an arrogant piece of shit with no talent.\" Have lived with many chefs, including Pittsburg CB graduates. Only one's I disliked came from CIA and CB. ",
            "[deleted]",
            "I'll take a guy who's busted his ass working his way up from the dish pit over a culinary school grad any day of the week. One is gonna be humble, hard-working, and eager to learn. The other has an expensive piece of paper that says he knows how to cook in a controlled environment.\n\n&nbsp;\n\nThe absolute worst boss I ever had during my time in the industry was a Cordon Bleu grad. He had pretty decent business sense, but absolutely no idea how to really run a working kitchen and adamantly refused to take pointers from the guys in the BoH who had years or decades of serious high-volume experience. I don't know what he's doing these days, but I do know the fancy restaurant he financed several million to remodel is now a furniture showroom.",
            "Isn't Cordon Bleu like the DeVry of culinary anyway?",
            "[deleted]",
            "I spent years in restaurants and one common thing among everyone is that nobody gave a shit if you went to culinary school. If anything it was seen as a detriment because of arrogant fucks like this. A cook whose sum total experience is a year in casual dining like Chili's and Olive Garden can be a godsend. Those people usually know how to work a line, do it quickly, and follow instructions. New culinary school graduates? HA! Arrogant douchebags sadly outweigh the capable.\n\nAnd the most arrogant ones are almost always the bakers. I have no clue why the hell that is, but anyone that bakes and goes to culinary school goes in a twat and comes out a bigger twat. I'm sure there's a strained simile in there somewhere.\n\nAnyway... some advice for restaurant owners that aren't going to read this... if you ever find someone whose resume includes both high-volume casual dining AND culinary school FUCKING SNAP THEM UP AND DO NOT LET GO. They were likely working their way through said school in an actual kitchen. They'll have the work ethic AND the knowledge AND the experience to not be a liability. This is the fucking trifecta. They are gold. Pay them well. ",
            "\"ok, let's see how he does.\" Haha",
            "Le cordon bleu tho",
            "As a former chef, I am convinced that culinary school is a waste of time.  There is nothing in cooking that can't be learned without mentorship and practice.  The chef who taught me went to Cordon Bleu, but he said it didn't set him ahead of his peers at all.  His specialty was French cuisine, guess what he ended up specializing?  Persian and Levantine cuisine.\n\nMost of the culinary school graduates I worked with were complete knobs more concerned with presentation than taste",
            "I work in a restaurant that actively recruits cooking school grads.  It's sad in a very unfunny way how many of them accept life as a cook making $12/hr....or maybe they deserve it after reading this story. ",
            "As an IT person, I consider a router to be a router and a switch to be a switch. I know that I can pick up pretty much any Firewall and figure out how to use it.  \n\nBut... if I get to a new company and see some brand I've never worked with and the IT guy there says \"hey, this firewall is a little weird...\" I *hear him out*! He's probably just going to tell me something that is actually just it having an extra feature that he doesn't understand, but there's a chance that things are really oddly labeled and could mess me up.  \n\nI've only once or twice pulled a \"I know more than you\" on someone, and it is only when a level 1 phone support person refuses to pass me off to a technician of some sort. Then I politely explain, \"I'm a senior network engineer and I appreciate you trying to fix this, but I really believe that this issue is over your head and you need to escalate this ticket.\"  \n\nI don't understand people who feel the need to lord their entire resume over others. ",
            "Baking is science... He didn't check his units.",
            "The burn he got must be hotter than the burn by the bread.",
            "I once bs my way into an ex chef job at a small coffee shop bakery doing light breakfast and lunches. I had a staff of me myself and I. The owners had a friend helping out who had trained at cordon bleu in France. More like a housewife hobby situation than a journeyman type of situation. She was very pleasant and knowledgeable. She had worked in the industry briefly prior to being a country club type housewife. My experience was much more fast paced trench culinary with convicts and gangsters. I did do some time in high school Vocational culinary arts. \n\nAnyway she was great. Helped me out a ton. We spent a lot of time developing menus and plans and really brought a struggling cafe above board. Every interaction we always bounced ideals off each other and made logical decisions. It was my name on it and I had final say and she respected my knowledge and experience as much as I did hers.\n\nOne lesson she taught me was that Mise en plas is much more than just laying out your ingredients. It’s knowing your staff, knowing your budget, knowing your client/guest, KNOWING YOUR EQUIPMENT. Having a plan, working your plan. Having an overall awareness of your surroundings. These values I use everyday on the floor.\n\nI currently work for a large commercial catering company. Worldwide. Sometimes I do fill in work on my off time in different kitchens. It takes several meals and days to “dial in” my equipment. An old crusty chef told me long ago and over the years heard similar things from others that “ your menu is determined by the capability of your equipment.”\n\nFormally trained and arrogance is a recipe for failure.\nBakers are alway just a little bit weird. ",
            "removed wtf ",
            "I guess he Bleu it",
            "I own a catering company. I've gotten to the point that I won't hire college educated chefs. They ask for too much money, criticize everything, won't wash or clean, are every temperamental, egomaniacal and always quit without notice.\n\nI'll take a humble soldier over one any day.",
            "I take it PF stands for Pastry Fuckhead?",
            "Celsius not Fahrenheit\n\nSurely he should've realised that the numbers didn't look familiar? Doesn't Fahrenheit go a lot larger than celsius",
            "I haven't been taught at le cordon bleu, but I have lived in about 30 different apartments and I know-- every oven has a personality. ",
            "Reminds me of a story in my high school. Students were invited to help prepare the lunch if they felt inclined to do so. Same for tending the coffee shop in the morning. Great experience and learning responsibilities, and other students were more interested in eating food if made by their peers.\n\nWe had two ovens. One was working really well, all our reciped were made for it. People sometimes burnt things in it but we all adapted. The other was mostly a backup. Nothing worked in it, molasses slow, great for slow cooking and salamander effect.\n\nAn ex student came in, small appliances repairman, asked to repair the slow oven. Turns out that one was perfect, but our « good » oven was cooking more than 50F over advertised temperature.",
            "Did you have frozen pastries and cookies that you were just warming up? ",
            "I guess in this case humble pie is served burnt. ",
            "Shove him in the oven. He’s fired ಠ_ಠ",
            "\"I will have you know I'm a graduate of Amys Baking Company/ money laundering enterprise.\"",
            "I spit in your general direction.",
            "He must have been the worst chef ever.  \n\nhow on earth would he not recognize the fact that the oven is THAT much hotter?  \nAnd what kind of oven even does go to 400+°C ?  \n\nWas it a furnace?",
            "I was a line cook when I was a sprout and remember a codon blue \"Chef\" giving me that line when we were training him on breakfast. \n  Thing is, I am kind of a masochist and having been doing this work for a couple years, had built up pretty dense kitchen hands.  \n\n  I pulled some veggies out of the steamer.  The pan being pretty hot when it comes out, I can still hold it with my bare hands.  So as I'm passing this guy, I go to hand him the pan and ask him to take it over to the sink.\n\n  As soon as \"Le Cordon Blue\" touched it, he shrieked and dropped about 20 lbs of hot veggies on the floor.  My boss thought it was hilarious and it did actually humble the Cordon Blue guy.",
            "Le Cordon Bleu, that sounds pretty prestigious. I myself graduated from Pico de gallo. ",
            ">  imported and uses Celsius not Fahrenheit\n\nHow high did he set it? Regular ovens I know go up to about 280° C. If he assumed it was an oven with Fahrenheit, that would be a very low temperature to bake (equals to about 140° C), usually it's around 160 - 200°, depending on the oven and what you are baking.",
            "I grew up working in Napa and working in fine dining, and I have worked with many amazing and also not so amazing chefs and cooks along the way. \n\nFunny enough; I've worked alongside many CIA graduates and interns that never went out of their way to tell someone where they were trained, but I've heard many Le Cordon Bleu graduates provide unsolicited statements about their training there. ",
            "Y’all the number of purely incompetent LCB grads I know is not funny any more. Out of the ten or so I’ve personally worked with only two were actually able to function, and one of those is my fiancée. \n\nOne of the disaster children didn’t even know what shears were. Claimed he was joking later... naaah. ",
            "REMOVED?!",
            "Went to LCB. We need all the help we can get. ",
            "You should have asked him “Did you tell the oven that you have graduated from Le Cordon Bleu?”",
            "Fuck I hate chefs. \n\n\n\n\n",
            "It takes like three days to properly make a croissant, so that’s an unreasonable request. Fucking up cookies though? That is some dumb shit.",
            "I wonder how many posts on this sub are made up of people just posting that post-aggravation conversation you have with yourself after someone who pisses you off leaves ",
            "Who's PF?",
            "I used to run corporate kitchens for several big restaurant chains and almost every new store opening there was a \"i am in or graduated culinary school so I'm amazing\" cook. They where always the first to crash and burn during busy service and run off crying. ",
            "Wait, what? Le Cordon Bleu is in France. They use Celsius there. He should have instantly recognised a 'C oven dial. Unless there's multiple Cordon Bleus around now?",
            "I've met exactly 2 pastry chefs in my life and both were smug, narcissistic and had the personality of sandpaper.",
            "This seems to be a common attitude from asshat \"chefs\" fresh out of school.",
            "Been there, but bartending. New hire \"I'm here to help you\" \"I don't need any help\" \"Ok.\" Watch her struggle the entire shift, learning the recipes and the way the bar is set up. Offer to help her multiple times \"No, I get it!\" I watch her fail, and I let her.\n\nEnd of her shift and I come to her \"Ok, today was rough, but tomorrow come back and we'll work together and make sure you know how everything is.\" She quit. Couldn't even be bothered to call me directly, she called another bartender. She quit because I was \"creepy\" and \"scared her\" even though I stood at the other end of the bar. \n\nI'll agree I'm 6'3\" and overweight, but I make sure to hold myself in the highest standards, because I am petrified of saying something stupid and getting sued. 12 years and no complaints (other than hers), baby.",
            "I think this is a lie . As a trained chef( not baker , I am the Exec Chef, who oversees bakers and pastry chef. )\nI would never rely solely on time when baking, sight and rotation are really important! \nIt’s pretty hard to charcoal anything unless you really go waaay too long . I mean over cooked and deep hard crusty brown I believe .... but charcoal? Come on .\nAlso 350 c? That would be a kiln or a freaking forge ! I’m callin bullshit .",
            "you made the initials for Pastry Chef PF. no biggie, it just threw me off for a second haha",
            "I hope NO was chill about what happened.",
            "hahah",
            "charcoal = flavor crystals you uncultured swine",
            "I work in the food industry, i fucking hate that shit. “Mmmm, naw I’m good, I’ve done this millions of time.” ",
            "Edit initials: PF = pastry fuckhead?",
            "You'd think that any good Chef would be able to tell the difference between 350F and 350C just by opening the oven door... ",
            "And then blatantly lying about listening to you while you were standing right there. You should have asked them in front of the owner “And what were the pointers I gave you about the oven again?”",
            "Isn't Le Cordon Bleu based in France, and they use Celcius over there? \n\nThe pâtissier should have known better by just looking at the brand of the oven to figure out if it's imported or not.\n  \n ",
            "Imported from the exotic and faraway land of canada",
            "It seems like every person I’ve met that has gone to school there has a stuck up, holy-er than thou attitude 🙄🤦🏻‍♀️ Maybe I’ve just met the wrong people but I swear. You try to give them one teeny tiny little tip and they act like you insulted their grandmother. ",
            "Seriously, the attitude of culinary school grads against kitchen staff that has learned on the job is fucking ridiculous.  I'm honestly surprised there aren't more physical altercations in professional kitchens.",
            "I LOVE stories of \"educated\" arrogant chefs. Had to work with a lady like that, but instead she graduated from the Art Institute and worked at Panera 🙄",
            "To be honest, I’m more worried about a professional baker who can’t tell if an oven is the wrong temperature.   The difference between 375C and 375F is *huge* - as in, one is the very top end of the temp capabilities of most ovens, and the other is the middling temperature you bake cookies at.   It should have been obvious to him that something was not right the moment he turned the dial to set the temperature, let alone opened the preheated oven.\n\nThen not realising about double-panning the pastries is a second major rookie error.   You *watch* delicate stuff in a new oven for exactly that reason.   Sure the first batch might not have been perfect, but any baker who knows their stuff should have been able to work out that the pastry was being burnt from the bottom - and to buffer it with an empty tray.   It’s basic oven-baking problem solving.   ",
            "The bakery where I worked had  new owners and a wonky rotary oven. A great big chain, similar to a chainsaw or bicycle chain ran a loop over a sprocket, with trays hanging off that would swivel about during the bake. The chain had to be hot greased every day or the trays would fall off as the chain shuddered over the old ,worn sprockets. Some trays that had fallen could not simply be hung again because they had become damaged in the fall. You also had to balance the trays or the whole works could jam, one tray would fall off and knock your whole nights work onto the bottom of the oven. Clean off five gallons of semi burnt muffin batter once and you will be sure to avoid doing it again.\n\nThe new owners were touring the bakery. On the floor in front of the oven were the swivel trays that were waiting for a trip to the repair shop, a trip they made regularly. I told the owner the what, the why and the how of all things oven and trays related. I reiterated the need for balanced load and undamaged trays. By this time over half of the trays were out of service, which slowed the bake a lot. I requested that they, as the new owners, get them repaired immediately for reasons. That was the night of my \"Friday\". I returned two nights later to find that the pile of twisted swivel trays was gone, and the oven now held the full complement. I thought that this was pretty fast service, and got on with the night. Half way through the night I start the bake. Every muffin tray was full and loaded. Then I heard a bang, followed by a series of bangs and thumps. The whole load just dumped! The new owners had ignored everything that I had told them, and simply loaded all the broken and twisted swivel trays.  Because a low caste baker must clearly be a moron and therefore is not worth paying attention to.\n\nThat morning as i left for good I explained again exactly why their mistakes left them with nothing to sell that day and why I refused to work for such idiots. They tried to make a lame threat about if someone called for a reference for me and I laughed in their face, knowing they would be unemployed before I was.",
            "Culinary school graduates aren't chefs. They're barely ready to be cooks, yet the arrogance as if they just passed the MCE is already there. It's like getting your associates degree in finance and thinking you're ready to get hired as a VP of marketing. \n\nNew culinary school grads need at least 3-4 months of having bad habits trained put of them, and by that time they've usually quit the business or have sought out the easiest low-standard kitchen they can find. Eataly, PF Changs, and your local cupcake shop owned by a trophy wife is where you'll find most of them a year after graduation. The smart ones become bartenders and servers. \n\nIt takes two years and around $50K to get there. For comparison, I pay my dishwasher $15 an hour for 44 hours a week and he was twice the cook that the average culinary school grad is after just a year of work. \n\nCulinary school is a scam. ",
            "It mixed up Celsius and Fahrenheit? Oh god, that's like double the temperature.",
            "Oh my lord.  Pardon the being late to the party, my my girlfriend is a graduate of LCB.  She will be the first to tell you a degree from LCB doesn't mean JACK SHIT.  And the fact that they're bragging about it??  Flying croissants on a popsicle stick.",
            "Considering that you need to pre-heat the oven when baking, I imagine somehow not noticing the wholly excessive heat when opening the door was the real test ",
            "You should buy the next oven labeled in Kelvin. "
        ]
    },
    {
        "post_id": "vtikrr",
        "author": "SubjectAd",
        "title": "Complying with a resignation request",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vtikrr/complying_with_a_resignation_request/",
        "score": 13043,
        "num_comments": 410,
        "created_utc": 1657200027.0,
        "selftext": "Recently our OG manager who was fantastic just left. One of the biggest things he did for our team was to keep the higher-ups from meddling in our day-to-day lives. As long as we hit our targets we could pretty much do as we please.\n\nWant to work from home 4 days a week, no stress. Want to go out on the road and meet clients face to face instead of meeting over zoom/phone, be his guest. Feel like closing all your deals at 2am every night and not logging on until 3pom the next day, why not? Basically, do whatever, let him know, and hit the targets, it was all cool by him. You get the drift. \n\nBecause of this, our team works our asses off and constantly hit targets. With myself and a few others doing so well we recently got promoted (personally I got the 2IC job to work with new manager, show him the ropes, train the new staff etc). \n\nHowever, OG manager leaves as he can't take the stress from the higher-ups breathing down his neck about his management style. Even though we constantly make/exceed targets, they are unhappy as he is not doing it through their formula. \n\nAbout a week or so after OG manager leaves, the new manager and pretty much another sales team are hired. New manager is essentially just a yes man for the higher-ups. Our super awesome work space goes downhill, we are required to be in the office 5 days a week 9-5, given a set seating plan, and spend our time cold calling, not relationship building. \n\nWe do this for a few weeks, the older reps who worked for OG manager aren't having the best time. As not only are we now dealing with this shocking environment. Plus we have to train new staff (and the new manager) on the systems, the product, meaning we really have no time to sell.\n\nThen we have a meeting. \n\nNew manager starts going on about the importance of the new system. as it will increase sales, which in turn will increase our commission. \n\nNow we get to the good part. \n\nThe head office lady came down for this meeting (she doesn't have much day-to-day in the sales stuff).\n\nShe is quiet until the end when she pipes up. Saying how this company has room for growth, is willing to promote internally, uses me, and points out me and some of the older sales reps as examples. She then goes on to ask for the resignation of anyone who doesn't believe her way will work by 5pm the next day. \n\nMe and the other sales reps who were there with OG manager simply comply with her request and hand our notice periods in at the end of the next day. \n\nLeaving the company with a sales team that consists of a manager that doesn't know anything about the product or role, and a totally fresh team of newbie starters who have no idea what they are doing who will not get anywhere near the target for a looooooong time.\n\nEdit:\n\nSo, I didn’t expect this to get any traction I very rarely post on reddit. I was just posting to get it off my chest one last time so I wouldn’t bother family/friends with all this nonsense. So there’s stuff I should’ve added. \n\n\n1. \n\nAfter I put in my notice, new manager called me and asked why I was leaving & that he was disappointed as he wanted to learn about the ins and outs of selling the product from me. \n\nMy response was along the lines of “as was clearly stated in the meeting, I do not believe in this structure so as per your request I handed in my resignation”. That felt really good. \n\nHe then asked me to reconsider & offered to allow me to have privileges like WFH, flexible hours, road trips, another pay rise. I think they realised how much of a clusterfuck it was going to be when no one knows what they’re doing. \n\nI declined this offer as I don’t wanna work in a place like this. \n\nI again said no, as I don’t wanna be above anyone else in the team, working in teams with preferential treatment never does well. \n\n2. \n\nYes I know that this was most likely a plan by management to get some old staff to leave. But I’m in my mid 20s, no dependents and had another job lined up. \n\nThis isn’t a position I have to be in, it was one I was in because I enjoyed my team and the environment I was in. It’s not a situation where I simply must be there. \n\nSo no point staying somewhere shit for the sake of it, plus the look on their faces was classic. \n\nAnd being able to answer the question of why I resigned with “as per your request” was awesome. \n\n3. \n\nDuring my notice period, new manager and head office lady were obviously very pissed. They asked me to transfer my leads (which I did), but didn’t ask another thing or say anything to me for the reminder of my time. \n\nThis job is also salary + commission, so I very happily sat in the corner took my last few weeks of salary and watched video essays and did life admin for the entire time I was required to be there. \n\nOn my last day, no one said a single thing to me. So I handed my equipment to HR & just dipped on out without so much as a goodbye from either of them.",
        "permalink": "/r/MaliciousCompliance/comments/vtikrr/complying_with_a_resignation_request/",
        "comments": [
            "“You’re all hitting your numbers?”\\\n“Yes”\\\n“Ok, let’s change everything!”\n\nIdiots.",
            "\\>She then goes on to ask for the resignation of anyone who doesn't believe her way will work by 5pm the next day.\n\nWhen you hear something like this it's because they've decided that their existing team are acceptable casualties in the campaign to enforce the new system.  She got what she wanted.  They'll accept lower productivity due to inexperience because the new people won't be able to stand up for themselves.  It's all about preserving the hierarchy.",
            "When I was in high school I worked for a fast food chain. My English grade was dropping so I told the manager I needed to be off work by 8pm for two weeks so I could catch up and work on a research paper that was going to be 20% of my grade. Manager said no problem. \n\nMind you, this was in a shopping mall and it was Christmas season, so we were busy all the time, but my manager understood school came first\n\nBut then the owner found out and cornered me one night, yelling at me for leaving when they were busy. Told me if this place and my paycheck weren't my number one priority, I might as well just leave and not come back\n\n... Okay.  Bye!\n\nI was 17 and working for gas and makeup money. No, my paycheck was not my number one priority.\n\nThe owner's shocked Pikachu face as I handed her my apron and walked out will forever live in my happy memory bank.",
            "Sounds like what my office is going through - we've been hemorrhaging experienced staff left and right, went through the roughest spring commission season (boat repair) I've seen in the 15 years I've been there, and the new higher up keeps repeating that we are all replaceable. \n\nJust going to sit over here and keep spamming out applications....",
            "I do love these mass resignation stories.",
            "Shocked Pikachu Face is always fun.\n\nDid that at a bar almost 3 decades ago.  I drove down two hours to work on weekends so I'd have a job when I got back there next semester of school.  Owner gave me major crap for something minor.  Like I had zero orders to cook, everything was clean, everything filled, there was nothing for me to do.  Figured i drove two hours down for this?  At end of shift, I clocked out, bummed some paper, wrote out my immediate resignation and handed it to the manager on duty.  Shocked Pikachu Face as he asked who was going to open early for the booked event in the morning.  \"Not my problem anymore.\". Went to my friend's place to crash.  Enjoyed my weekends off the rest of the semester.",
            "Corporate office will explain this away as a win for their leadership style. They will have shit results and leave for a better paying Corporate job in 2 years. Their replacements will do the same.\nCorporate life is a toilet (and yes I work for one).",
            "> Recently our OG manager who was fantastic just left. One of the biggest things he did for our team was to keep the higher-ups from meddling in our day-to-day lives.\n\nWhen I worked for a small IT team at a rather large university I had a manager that had a similar attitude. He would say that all the university politics stopped at him so that we could do our jobs.\n\nEventually we got a new VP with a massive ego/power trip. Within six months there was a big reorganization with \"layoffs\" as well. It wasn't a huge surprise that the only layoffs were our manager and another similar manager that wouldn't bow to the new VP demands.\n\nThe VP's micromanaging was so bad that I think that all 8 or so on my team left within the next year.",
            "\"Do we have to wait until tomorrow?\"",
            "Not sure where you are based out of, but it sounds like head office girl just got away with not having to pay a single one of you severance.",
            "Sounds like you played into their hands, you all resigned without them having to fire you. They get a team of new people that will do what they say and not push back. This was the outcome they wanted am afraid.",
            "Why do companies do this shit? It's 2022. A majority of people actually work *better* from home and/or when it's on their own schedule. I just don't get why they had to fix something that wasn't broken.",
            "What happened? This needs a follow up.",
            "I've been in a similar situation. Management was making life difficult (scheduling clients last minute with no time to prepare, scheduling them outside of working hours, not being there to handle essential admin duties when clients arrived, not handling complaints, etc) and had a meeting about how our numbers were falling, and saying they would normally fire everyone for that, so if we were unhappy to put in our two notice by the end of the week. They were super surprised when I did, during my last two weeks they tried offering me more money and other roles to stay. I was so happy when it was over.",
            "In the end it’s all about controlling employees. Management will burn down their own building to get it.",
            "Shoulda done it right in the meeting",
            "How can they take credit for your hard work if they don't make any changes?",
            "“we’re doing everything you want us to right?”\n\n“yup”\n\n“and we’re hitting all our targets right?”\n\n“yup”\n\n“and we’re all happy in doing our jobs this way, win win situation”\n\n“sounds right to me”\n\n“so then shut up”\n\n“no, you’re doing it wrong, do it our way or resign”",
            "Boooooo. Luckily my organization has given my department free rein because my managers are a lot like your OG. I'd run in a second if they insisted on changing that.",
            "\"Look how successful that group is. Imagine how much better they would be if they were forced to follow all the rules\"",
            "Pretty much same thing happened to me.  The company decided to go with \"fresh blood\" i.e. I was making too much money.  My position was consolidated with another manager's job.  The other manager who got my responsibilities added to hers, said fuck this, and she transferred to a new location into a different role.  \n\nThey brought in a new kid to do this new position, who had been with the company all of three years and was making 50% less than I was.  He lasted 2 months before he quit.  The next one lasted six weeks.  They went through four managers in a year.   \n\nMy entire sales and marketing team either quit, retired, or left for other positions within two months of my leaving.  They lost several decades worth of irreplaceable experience.  People with proven track records, that had well established personal relationships with hundreds of customers.  \n\nIn three months, a department  which used to be in top 10% in several metrics and top 10 in the company in some critical ones, shot down to bottom 20%,  It was a shit show.         \n\nI had been with the company over 22 years, and was maxed out at my pay rate.  I was always rated as exceptional or outstanding on all my evaluations in several positions for over two decades.  All of the sudden I got a \"meets standards.\"  \n\nI was technically given the opportunity to apply for other positions, but was denied every single one.  I was told I was unqualified not only to do jobs I had performed before, but had won multiple national awards doing.  One position close to me was filled by a new hire with zero experience in the field.    \n\nI spoke with a former boss and mentor at another location.  He confided in me that they were basically told not to hire any of us who lost our old positions, even if we were highly qualified.  He had 11 management positions he couldn't fill in his market, and I was well qualified and experienced to do 8 of them, and he couldn't touch me.  He said fuck it, and ended up retiring soon after.  He told me it was due to that and several other bullshit reorgs and changes the company made.  \n\nWithin six months, Three other highly experienced managers at my old location walked out, two with no notice.  Over 75% of the hourly supervisors, and experienced hourly associates with over five years experience, all quit or transferred within a year.",
            "Typical office work in a big multinational",
            "Corporate types can never leave well enough alone and always seem to get in the way. They hire people to do the jobs but then don’t let them do it. I worked for my old company for 20 years and left for a much less aggravating environment. As long as my work gets done and the customers don’t complain, I never hear from them. I’ve never even met my direct manager, just a weekly conference call",
            ">New manager starts going on about the importance of the new system. as it will increase sales, which in turn will increase our commission.  \n\n\nI remember when Ryan Howard was rolling out Dunder Mifflin Infinity. He said this same thing.",
            "\"A set seating plan\" I clocked out right there cause ain't no fucking way",
            "I really don't get these people... Why would you mess with a team that is actually giving you results? Who cares how they do it?\n\nGood on you for not settling for a mediocre environment.  Hopefully you'll find a better company to work for.",
            "Once I learned that manager should be supporting staff, not other way around, it made me a much better manager.",
            "Every corporate sales person I have known has at least five of these kinda stories. Sales team is awesome and is killing it by actually you know, selling their product. Corporate HATES how they are doing things, and probably hates that the sales staff is taking home bank because of commissions. \n\nCorporate decides to change things up because sales should be done the way they want. Mass resignations happen. New management thinks that they will capture all the good customers and profits for themselves.  The result is that new sales team gets cleared out because the new folks SUCK. \n\nNew sales management is hired and they bring in people who can sell. Of course it’s not done the way that corporate wants so we are back to repeating the cycle.",
            "That's the kind of business owner I want to be - your OG manager, that is. \n\nI'm a lawyer and my own little firm is just myself and my clerk (for now, but looking to expand). I don't give a shit when or where she works, as long as boxes are checked and deals close. She can get high and day-drink on a Tuesday if she wants, as long as our collective shit is handled. \n\nI'll never understand why people care so much about the \"control\" aspect of running a business. If you have people you trust, and do a good job, who gives a shit? As long as things get done and things are looking up for everyone - that's all that matters!",
            "This might get long. And the statute of limitations is long past and I live on another  continent.\n\nI worked for a company that basically invented selling car insurance via telephone. We were also the first to sell insurance over the internet. We were an agressive beast of a company. \n\nFrom day 1, the guy who set the company up trusted technology, trusted his staff. Promoted from within wherever possible. Paid over the going rate. He was a great boss. And the managers he employed had the same frame of mind.\n\nMine, Keith, didn't have a clue about IT. But he ran the IT department. His job was to clear the decks from interference so we could do our jobs. He really only had one rule. 3 strikes and you're out. You could fuck up massively twice and he'd always go to bat for you, third time you were fired. We didn't have to wear ties or shirts. Business casual unless customer facing.  You were responsible for your own hours. 37.5 a week. But as long as your work gets done and you're not holding anyone else up, choose your own hours. WFH wasn't a thing yet.\n\nIf you had an idea you could take it to Keith. If he liked it and it was under 30k he'd authorise it himself. Over 30k wed go see IT director. He'd authorise up to 100k without asking the board. Very occasionally did they knock it back and ask for a formal business case \n\nFriday afternoon was POETS day. At lunchtime almost the entire company (except call centre staff) retired to the local pub for drinks. Some serious work was done in those drinking sessions. I was talking to one of the bosses and he said something quite profound.\n\n\"The reason we're so successful is that we're not an insurance company. Were an iT company that just happens to sell insurance\"\n\nAnd we were successful. Number 1 insurance company in the UK. Then we went around buying up other insurance companies.\n\nThen we got too big for our boots and the overall owners noticed us. We were the most profitable business they owned by far.  Do they bought out the guy who started the business. He trousered a serious amount of money. Many millions.\n\nThen they moved in the bankers. Shirts and ties became the order if the day. 6 to 4 or 9 to 5 was the normal working week. POETS day was abolished. Everything was written down, processes invented, middle management bred like lice.\n\nI left but kept in touch. Over the next 6 months almost everyone who made that company great left. All the genius eccentrics - gone.\n\nProfits plummeted but bonuses for the bankers went up!\n\nNow this giant of a company is a boring mid-level insurance company. But it used to be such a magical place. I'll never see it's like again...",
            "And anyone who isn't willing to drop down on your knees and kiss my ass can resign.",
            "I hope someone said, as they were handing in their resignation:  \"Be careful what you wish for.  You just might get it!\"",
            "Had the son of the owner tell me one day \"Your know how we do things around here enofile, if it isn't broken, break it\".",
            "Hubris.   \n\nYa gotta love watching someone taking themselves down with their own hubris.",
            "I see a lot of red flags in this story based on the experience of friends in marketing and turnover. The company is probably losing money and it’s freaking out the CEO and higher ups so they are coming down hard on you because they’re incompetent.",
            "Worked for a place that did that.  Bought a custom trade show publisher who was making good money, hired people to get rid of the higher paid employees and told the customers they could choose a turn-key solution a b or c, no more of this custom  stuff. \n\nFlew it straight into the ground nose first.",
            ">After I put in my notice, new manager called me and asked why I was leaving & that he was disappointed as he wanted to learn about the ins and outs of selling the product from me.\n\nLol get fucked",
            "I'm about to walk out of my job for similar reasons. I got a job 30 minutes east of me that pays 8 dollars more per hour\n\nSame bullshit, except I walked into the situation thinking I could fix it. I could not and now they have 2 brand new rookies, an incompetent Manager and a supervisor who will have to do everything by himself",
            "....you gave them exactly what they wanted. they likely wanted to fire all of you but didn't want to pay the unemployment. You might be malicious, but that manager is going to get a bonus for this.",
            "Going to require updates",
            "It’s not about sales it’s about control in an environment these higher up sociopaths understand and the fact they get off on seeing people miserable and how that misery is entirely in their control.",
            "My boss is exactly like your OG manager, doesn’t give a fuck on what you do as long as you get everything done before you punch out, and lets the managers handle things as they see fit. \n\nIt’s exactly why I’ve been there for nearly 7 years compared to a year/year and a half at other companies because you were just another number and were easily replaced. My philosophy has always been yes you can replace me, but not my knowledge or experience that I have amassed over the years, so good luck on that.",
            "Me pulling out big chief tablet and yellow crayon from my backpack....  OK, you got it.\n\neye kwit.",
            "I would have rode that horse till it died. Your way got you promoted—when you can’t sell shit for 30 days selling their way, you’d probably get the noobs to quit too!",
            "I have a sales job and work for an over bearing boss who demands results.  However he does not care how you hit them.  \"I pay you to get results. Do it however you like...\"\n\nWe are all pretty ok with that and he doesn't meddle in the day to day stuff.",
            "The fact they didn’t say anything on your last day….good for you for being so brave and authentic. They don’t deserve your energy.",
            "You should have made them lay you off so they have to give you severance.\n\nJust keep working from home or doing exactly what you had been doing before and leave it to them to terminate you.\n\nIf their reason for termination amounts to “We drastically changed everything about the job and you didn’t accept the changes” then that’s constructive dismissal and they’d owe you severance.\n\nOh well, too late.",
            "Nicely done, my fine friend. Nicely done.",
            "any fallout?",
            "So many companies ready to shoot themselves in the foot. Glad to see you walked from there as the crash begins...",
            "Would this count as constructive dismissal, and give you the possibility of a legal challenge? (Local laws etc, depending).",
            "r/antiwork\nr/workreform",
            "Don't fix it if it's not broken.  When will they learn?",
            ">She then goes on to ask for the resignation of anyone who doesn't believe her way will work by 5pm the next day.\n\nI've been noticing this happening a lot (or at least a lot more) lately. Is this the new go-to method of reducing costs?",
            "answering why you resigned with \"per your request\" is EPIC.  Worth doing for this reason alone.",
            "Whatever happened to, \"If it ain't broke . .  .\"?",
            "Nice job OP \n\nYour next task is to stay in touch with a couple key people still employed and report back as to what a shit show it was after you left. \n\nLooking forward to the updates! \n\n(*that’s a whole hearted demand, not a request…please!)",
            "Kudos on being able to afford to quit on the spot for your moral high ground.",
            "I’d love to know what happens to the company.",
            "I hope you remembered to mention your rate of pay at some point before you walked out lol",
            "I've been in sales for a long time. This is classic",
            "This sounds like an OM from a company I previously worked for. I was out on disability at the time due to issues largely stemming from my own boss, but the project brought in this new OM who was the one brought in to fix struggling projects. Uh huh. My fiancé was a TM at the time and she was on him about any and everything she could, so he stepped back down from being an awesome TM that most of the ATM’s went to and a dedicated group of agents. By this point I no longer worked for them and just watched from the sidelines as our site’s top project bombed out because of the way this woman wanted things run. Only a few months into being an agent, my fiancé put in his resignation and when she asked he told her straight up it was because he felt like she was just looking for a way to get him fired. \n\nThen not even like 2 months after he quit, the BPO loses the project completely and everyone is shuffled over to another project. Of course with the same OM to make sure standards are met. Keep in mind this is like the 2nd or 3rd biggest client we had before the one everyone previously worked for got moved. Lots of unhappy people. And quality got tightened up on them to the point they had to keep their cameras on and couldn’t be at the desk for lunch or breaks (this is wfh), if someone else was seen on screed like a child or someone walking across a room you failed that call. You also failed if anything could be heard from a bird screeching, a child crying or talking, anyone watching tv or talking in the background, and heaven forbid UPS knocks on your door! Latest word is that project is failing fast. Isn’t she just a great OM “project fixer?” \n\nOh and best part!! The project I worked on before moving to quality, and that my fiancé worked on… this project and a couple related to it were also at other locations or work from home. We put such a bad taste in this HUGE company’s mouth they opened up a few more corporate call centers around the country to not have to rely on BPO’s anymore. So sad because for quite a while we were their top site, even beating out corporate sites.",
            "I‘m exactly like your favorite manager, should I get an MBA 😂\nBut seriously, maybe you should go get one",
            "Management may have been wanting to lay off the older more expensive staff. Now you’ve just all quit and they don’t have to deal with severance.",
            "Heres my experience with corporate:\n\nIf it helps make them look good they are all for it. If its neutral they have to add their little, typically annoying and useless, change to make it “theirs.”\n\nIve literally seen entire companies start to fail because corporate gets involved. It blows my fucking mind because people with business degrees are supposed to understand economics. And one thing economics is clear on is that you want eyes on the ground who actually understand.\n\nNo amount of corporate planning beats genuine input and insight from a local who knows what they are talking about and what others like then want. LITERALLY FUCKING NOTHING BEATS THAT. I KNOW WHAT I WANT CORPORATIONS DONT.\n\nIll give an example with the ultra “anti woke” crowed. They want a company that doesn’t make any political statements. They are a group that will pull their money. They will find alternatives. And they do this in all directions. There are companies that sell to this crowed and they get absolutely steam rolled when they make political statements. \n\nWhy do companies that have a large base in these people then make political statements and do things that throughly piss off this base of people? (There are a few industry’s in particular that took like 15-40% hits over this in a month and never recovered)\n\nIts because people in corporate and in my experience advertising convince them that if they suddenly make their product “for everyone” more people will use it.\n\nIt wont.\n\nThats just one example. But its always like that. Bank of America is named that way to get “patriot’s” Imagine them comming out and saying “fuck America we are for the world.”\n\nThats what your corporate just did to its clients.",
            "I personally hate stories where the denouement is the protaganist(s) resigning. First, it's seldom as malicious as it feels to the people quitting, and second, we no longer have a witness to the fallout, which is often the interesting part.\n\nMaybe we could get a `rage quit` tag for these.",
            "Congratulations, you outplayed yourself. By quitting instead of being fired after you trained your replacements, as was their intention, you saved them a ton of money in unemployment payments. Well done. Pretty common with people that think they are smarter than they actually are,",
            "How many clients will this lose them?",
            "did she say anything when the full experienced team quit?",
            "I want to know how this all works out for the company..........",
            "The phrase “life admin” makes so much more sense than “i dunno, me stuff”, which is what I have been saying up until right now. Thank you.",
            "They’ll be alright",
            "'Life admin' - That's what I call it too!",
            "Fuck yeah ! Great job",
            "Lol",
            "Fallout, please?",
            "I have some new managers like this. More interested in making themselves look good.",
            "Got to love good old management logic.\nIf it works change it,if it doesn't work find someone to blame but keep it.",
            "This sounds like the Peter principle.\nhttps://en.wikipedia.org/wiki/Peter_principle?wprov=sfla1.",
            "If you have any updates about the nonsense that ensues, please tell us. Lol",
            "\"Do you want to get a union?! Because this is how you get unions!\" - said in the voice of Bob from Bob's Burgers"
        ]
    },
    {
        "post_id": "vptobn",
        "author": "Nastacha",
        "title": "New supervisor asked me for doctor's note",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vptobn/new_supervisor_asked_me_for_doctors_note/",
        "score": 13030,
        "num_comments": 398,
        "created_utc": 1656774134.0,
        "selftext": "This happened last week I thought it belongs on this sub.\n\nMy company is very busy and very short of staff and is asking everyone for overtime and imploring to come and work on their days off.\n\nI got sick last week was feeling very poorly and took a Covid test and it was positive, this was on my day off,called work said I'm positive for Covid and won't go to work on the next couple of days, they said ok no problem. \n\nTwo days  later on Monday  I'm feeling worst and called again and asked for my supervisor he wasn't there and I talked with the new assistant that started 2 weeks ago and tell him I'm taking another couple of days since I'm feeling very bad with coughing and muscle pain and he tells No,I have to come to work sick or get a doctors note(it's very hard to see a doctor where I live if you have Covid) where I am the government asks employers not to ask for doctor's note for Covid since all doctors are busy and overworked. \n\n\nI asked him are you sure you want me to get a doctors note for Covid and since when do we need a note,he keeps affirm I need one,I said sure I will call my doctor. \n\nCalled my doctors office and asked for appointment with doctor reason I have Covid and I need a note,Secretary tells doctor will call me in a couple of hours\n(I was very lucky ).When I talked with the doctor he tells me sure no problem I'm putting you off sick for 10 days,I emailed the note to my supervisor and Human resources saying instead of the 2 extras days that I asked to be off work,my doctor decided that I needed more time off so I will be back only next week,here is the note,haven't heard a peep from them.",
        "permalink": "/r/MaliciousCompliance/comments/vptobn/new_supervisor_asked_me_for_doctors_note/",
        "comments": [
            "I've seen this scenario a couple of times.  Boss / HR demand doctor's note.  Doctor pissed that they have to provide note.  Give person extra time off.  \n\nThat's the drawback from remote working.  Even if a little sick you can still work.",
            "Awesome. Feel better!",
            "I pulled a fast one on HR one time. I had a chipped jaw bone some years back and needed oral surgery to have the problem taken care of. What's worse than a tooth ache? a tooth ache where there is no longer a tooth. from the onset to being released, I was off work for about a month. Doc suggested to remove a few other teeth while he was at it. Okay. I show up for the scheduled surgery. Painless oral surgeon. Either that, or the pain from that bone chip was so excruciating that anything was a relief after that.  \nReturn for work, and called into the HR office. HR guy thought he'd be a smart ass and ask to see the teeth as proof. I laid out 3 1/2 teeth on his desk. (One was broken long prior to the surgery. He was surprised as hell. Doc was surprised when I asked to keep them, but I had a feeling I'd need them.",
            "I tested positive for Covid and was only entitled to 5 days unless I get a doctors note. I put in a full day on the 6th day (still positive btw) and wasn’t feeling great on the 7th. They wouldn’t let me take off unless I had a doctors note, and wouldn’t pay me for the work I put in on the 6th day until I produced a note.\n\nSince that was the case I told my manager if I wasn’t going to get paid anyway I’m taking the day off to get a doctors note. He changed his tune real quick and told me to wait… I got the doctors note…",
            "Probably for the best. If you go right back to work when you feel better, it will put you back to bed for 2-3 more days. I found that out the hard way.",
            "I work in a doctors office. I’m a huge proponent of people healing before going back to work. When I write a letter, I always allow extra days, IF desired. \n\nA typical not would be:\n\nDear reader,\n\nX patient has been diagnosed with covid-19. X can return work per CDC guidelines on such and such day, IF they have met criteria for recovery. If X is still unwell, please accept this letter as an excused absence until [whatever date}. (Typically 10 days from diagnosis)\n\nIf required, this office is happy to reassess this situation at the first given return date. \n\nPlease contact us  if you have additional questions or concerns. An extension letter can be provided if required. \n\nWarm regards,\n\nDr. Fuck you shitty employer \n\nAnd if an employer asks for extension, I have a form letter I fill in dates for. Fuck all that. Don’t make people work while they’re sick. Period. \n\nOur office is short staffed too. But we definitely don’t ask people to come to work if they’re sick.\n\nEdit: a typo",
            "The Last time I was told that I needed a doctors note, I drove to work to clock in.  When asked why I told him that I’m heading to a work required meeting with my doctor and I asked them for the companies billing information for the doctor to bill them.  he looked at me like I was nuts, so I explained that the law requires the company to pay me for company mandated work obligations and if I have to pay for the doctor out of pocket it will reduce me to less than minimum wage so unless they wanted to pay that fine as well, then it’s best to just bill it to the company instead.  The manager stared at me a few second and told me to just go home, now fortunately I am friends with that manager so it worked out but it’s absolutely a hill that I’m willing to die on.",
            "This happened to my dad like 20 years ago. He was a bus driver and someone assaulted him with a bag of change (the guy was trying to avoid paying the fare). This was a Thursday afternoon. After dealing with the incident with the paramedics and the police he was ready to go home, and he asked the transit inspector for the Friday off.\n\nInspector said no, you have to come to work tomorrow. My dad thought a single day off and then a weekend to recover was probably adequate, but pain in the ass guy wanted him in the next day. \n\nHe shows up at the garage the next day and the union rep was like \"wait, you haven't been evaluated by the psychologist\" (standard procedure for any incidents that major). He goes to see the psychologist first thing that day and she says he should have a week off and a second evaluation, and he'll probably be cleared once her report comes through.\n\nThen she went on vacation. For two months. Her report sat in limbo the whole time. My dad got a two month vacation too 🤣",
            "My work was forcing me into working 12 hour shifts once when I was recovering from an illness, & and told me I needed a Dr's note to get out of the OT. My Dr was looking out for me & gave me a note saying I could only work FOUR hours a day - I ride that note for awhile!",
            "I work in an urgent care that a lot of PMDs send their patients to for COVID symptoms and testing.\n\nI typically will ask “this is what CDC requires.. but how much time off do you want?” I do this for a lot of cases—even non-COVID ones 😂",
            "Wait, what? If you get tested positive you don’t need to stay at home for at least 10 days? What about being infectious? How does that not risk everyone else’s health?\n\n(Probably not the place for this discussion, but so far I thought the US government was reasonably intelligent about its policy, and it was just the Karens complaining…)",
            "I've always done this.  Doctors don't give AF.  They refer me to the receptionist to get the note, and they always ask how many days I need. \n\nI usually go with a week or two. \n\nThat's what happens if you treat people like children.",
            "I think doctors are getting really really fed up with the needless bullshit from employers and companies. If you are sick, the last place you should be going is a doctors office where there are other people that can also get sick. Unless someone is literally dying, keep communicable disease away from other people. That includes every other thing and not just covid.",
            "Haha this is brilliant",
            "Happened with a friend. She asked for a a special mouse and keyboard for carpal tunnel and her boss asked for a script, the doctor wrote that she should be put on temporary disability while receiving treatment. She got 6 months disability pay and the mouse and keyboard.",
            "[deleted]",
            "I have been recommending to my staff to get notes from their doctors and email them to HR. The people I report to are constantly going on about productivity and absenteeism. This way, the employee can get some time off and rest without being bothered with \"why aren't you at work today?\" or coming in to a BS write up for being absent for so long. It has saved the staff so many headaches.",
            "So many doctors are so sick of this shit from crap employers they'll issue you a letter for pretty much as long as you like if you just ask.",
            "Jesus, it was bad enough when it was the normal flu but demanding you come to work when positive for *covid* unless you have a note is outrageous",
            "Hope you feel better!\n\nAs behind as they are with work, if they can't afford to have you off, how behind are they going to get if you come in as ordered and get more people sick?  Stupid stupid stupid.",
            "Laying here with Covid myself Day 4 reading this , my dispatcher does a Covid test on me says it’s positive. Get sent home with pay no one  else in my family has gotten so far.  My boss calls to see how I am , if I need any food delivered etc. One of the best bosses I ever had.",
            "I have a similar experience. I get gout and told my boss I needed to leave early. He said ok and to just bring a doctors note. When I went to the DR's office, he asked if I get sick pay and I said yes. He wrote the note for the week off. I needed one day to let the meds do the work and got the whole week off.",
            "Similar vein: my work occasionally requires I lift heavy things. I lifted a heavy thing (130.5lbs) and dropped it on my foot. I was trying to get it to a sidewalk three feet away before I used the dolly to get it the remaining 15 feet. \nMy feet were already screwed (pun intended) because I already had three foot surgeries with 10 pins in both feet. I dropped the heavy thing on my foot on top of two screws. I did the usual WC thing and was put on light duty (which I’m not good at) and then we ultimately decided the screws that were already in my foot needed come out so we had that scheduled. I was walking around in a cast to prevent extra nerve damage (the screws tore the nerves constantly if my toes flexed) and my COO had stopped me one day and asked if I wasn’t “milking the boot” because I had been wearing it for two months at the time. \n“No im actually getting corrective surgery in three weeks, thank you for your concern” and then I told my boss about it and she told HR about it. He didn’t get in trouble but he did behave more respectfully about my situation.",
            "Went on vacation recently (12 tour) overseas.  One woman felt ill and went to the pharmacy for a Covid test and was positive.  She was stuck in the hotel under quarantine.  Another woman said her throat was a bit scratchy and tested positive.  She was quarantined.  Two others stayed behind and the next day were positive (meanwhile the rest of the tour headed for the next and final destination).  One guy on Friday decided to test himself and was negative.  Saturday we were suppose to all get tested in order to fly back to the US but Biden cancelled the requirement as of Sunday, so we never got tested.  When I got home I tested myself and was negative (also retested a few days later with the same result).  Basically the four were stuck in the hotel (they were in the system as being positive so couldn't fly back until they were negative).  But they had trip insurance so, hopefully, once they send in their receipts for the extra hotel days and meals they'll get refunded.  They were not happy (at least those 3 who weren't required to get tested).",
            "Relax and enjoy your time off.",
            "Maybe I have been lucky all these years, but I think having to bring in a doctor's note to your employer is insulting and demeaning.  I've never seen it or had to do it.",
            "I'm guessing you are in Canada? Maybe QC? Just because we had the same thing....hard to get an apt and government asking employers to not ask for a noté. Take the full 10 days to recover. Rest and feel better. Be extra petty and after you come back, be like....just wanted to thank you for pushing me to see my doctor.... 10 days off was much better than the few I had in mind. All thanks to you..... 😜",
            "Haha great. Have a relaxing break - once you’re over the rona",
            "You should have delivered the note in person and given him a big hug for his concern.",
            "If you had to pay for the note, don't forget to constantly go after your work until they reimburse you for the cost to get the note that they wanted",
            "I'm a doctor. When I get patients like this I just give them 2 weeks off to stick a middle finger up at their a**hole employers",
            "It’s the same here.  We can’t go to the Dr with Covid symptoms but they do offer Telehealth appointments now.  So ridiculous that employers make it so difficult.  If they want a Doctors note then they should have to pay the Doctor!  I hope you feel better soon.",
            "I don't have paid sick leave.  10 days off would ruin me.",
            "Doctors HATE being asked for notes for COVID so will give the employees asking for them extra time off just to screw with the stupid employer.",
            "So... They want workers who have COVID to come into work instead of taking time off to recover... So they can have lots more workers who need to take time off to recover from COVID?",
            "That's... exactly how it should work. Hope you feel better soon.",
            "I work in a clinic and a patient called in asking for us to order them a rapid Covid test because their HR insisted they need a negative to return to work. I told them they can test positive for weeks after and their HR is clearly not up to date on things",
            "Serves the stupid fuckers right.  Don't come into an office with Covid, FFS.  Let's not spread it around, right?",
            "This sort of happened to my wife. She was working for an Israeli bank in the US, and very pregnant (2 weeks or so from being due.) She asked her boss to stop having her work late because she was just so tired at the time. Boss said get a doctors note, doctor’s note says she needs to be off completely until after the baby comes.\n\nAfter that my wife never went back.",
            "Why would you only take 2 days for Covid in the first place? Don’t you have to at least isolate for 7 days. You’d still be contagious after 2 days.",
            "I think it is important to note that the government offers tax credits and rebates for companies that can prove losses due to workers out with Covid.  It would educated of most to stop thinking its just a control mechanism.",
            "Y’all need to start dropping names dude. I would love to explain to this ignorant pleb that Covid doesn’t clear up in a couple of days wtf",
            "Enjoy your 10 days, OP! Hah!",
            "Geezus, you need to not be around people for 5-7 days. Are your people mad?",
            "This is what I don't get.  I'm being asked for med certs for every absent day of my staff too.  It's bullshit, they could work from home, but the Dr gives them multiple days off, when they and I both know, they'd be at work if not for the stupid rule.",
            "Oooh I love this story. I hope those are paid days off",
            "Get well soon. Be careful with your food & environment, my system got weak from covid & I got an infection keeping me out of commission for almost a month now.",
            "Rest up op",
            "I feel like I’m missing something… are you not using PTO? If you are…. How is this cool?",
            "Kinda sucks to have to burn through that much PTO though just sitting around being sick.",
            "I can’t imagine a job actually  asking for a doctors note and expecting me to keep a straight face",
            "Serves the company right. It’s so foreign to me that you can even work with Covid. Where I live a positive Covid test is 7 days isolating at home with very few exceptions (e.g. going to hospital for treatment etc).\nI hope you rest up and feel better soon",
            "I worked around this nonsense before since doctors visits aren't necessary every time I scanned a doctor's note from my PCP and just edited the date and reason for each situation and no I never did this to play hooky I want to work if able.",
            "I have experienced this too. Not Covid, but I felt pretty weak but was no longer vomiting, thought I’d better return to work. I needed doctor’s note, boss was breathing down my neck to return to work, doctor said I needed three more days off to fully recuperate. It was glorious.",
            "Company demanded a doctors note for what would have been a two hour appointment. Doctor wrote me off the whole day",
            "tl;dr; Supervisor wisely decides to check with a doctor to ensure that a sick employee doesn't infect the rest of the staff by returning to work too early.",
            "This is not quite legal, but keep that doctor's note. Next time they tell you you need a doctor's note, just change the time and date, reason and how many days you think you need, the submit it. As long as you use the same font ad letter head, they're not going to know you altered the note.",
            "You really should have been home the whole time anyway, to keep from infecting the rest of your coworkers.",
            "This sounds like a great r/MaliciousCompliance story as well.",
            "What on Earth makes you think covid disappears in two days? Not even four.",
            "There are lots of businesses that require a Dr's note if you are going to be off more than 3 days. I work retail my husband does a govIT job. Both of us have to do that. Otherwise you'd have employees that just want a vacation and call in and say they are sick.",
            "Bro, you can't be around people only a few days into COVID. You'd infect people...",
            "I mean, you should need a doctor's note. Not for work but for you, if you're sick covid or not it's better to consult so you can ask questions or whatnot and take prescriptions. Online meetings are the way to go.",
            "10 days off, that's 2 weeks (10 business days)",
            "Most companies have it written into their policies that if you have been off for about a week, they will need to see a sick note if you need further time off. It is just a general part of their policy and is to do with insurance / sick pay regulations etc.\n\nDon't worry about it - it is perfectly normal for a company to require this.",
            "I feel I’ve heard this story a few times already. Guess ya karma farmers gotta farm…",
            "What are you mad about?\n\nYou work is short staffed and you wanted extended sick time off, what is wrong with them asking for a note?",
            "Believe it or not requiring the doctors note is often as much for you as for the company. They want you to get the care you need and the note guarantees it happened. This protects the rest of their staff as well.",
            "Well played!",
            "Heard this one before.",
            "My PCP even ask me last time when I wanted a note how many days do I want to rest to be better. I kinda stared at him and didn't know how to respond.",
            "Similar thing happened to me when I hurt my back at work. Doctor gave me a lot more time off than I thought I needed.",
            "I love when this happens.",
            "Where I am, it’s mandatory 5 days off if you test positive, they just ask for a pic of the Covid test results (either home test or lab) Then you test again and if negative you can show up the next day. If you’re still positive, it’s another 5 days off",
            "You were only going to take 2 days off and fine to work COVID positive?",
            "Ha that doctor was making a statement there. Awesome.",
            "The 10 days is probably just precaution, not because you \"need\" it",
            "Good. you really need more days anyway. Love your doctor.",
            "Get well soon.\n\nLong covid symptoms suck.",
            "Good for you for staying the course. If there’s one group of people every company is terrified to argue with, it’s doctors. And I’m not even one of those “believe every doctor” types. They are educated, trained, and board certified in areas of the physical and mental function of the human body.\n\nThe bosses and their little sycophants, especially, are just begging for a lawsuit and I wish more of them get their weasel asses dragged into court.",
            "Feel better!",
            "Check to see if you're eligible for sick pay as well.",
            "This made me very happy. Thank you!",
            "There's another way of looking at this. The last thing that anyone wants is for someone with COVID to be too zealous about missing as little work as possible, and coming back while they're still contagious. Best way to deal with that is have a doctor tell you how much time to take off work. \n\nOf course, I would present that as if you have COVID, you can't come back to work until you're cleared by a doctor.",
            "This is happening all over the world, a time for mass MC.",
            "I had the opposite happen to me. I had a bad allergy cold and called out and hr told me I had to go get tested which at the beginning of the pandemic took like three days. I felt better by the time I got results but when every time I tried to go back in and was still sneezing (because allergies) they kept sending me home telling me I had to be symptom free for several days. \n\nThey finally caved and let me return after 3 weeks of this nonsense."
        ]
    },
    {
        "post_id": "8vr7wq",
        "author": "JJnnYY",
        "title": "\"I dont care about the costs. Just get it done\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8vr7wq/i_dont_care_about_the_costs_just_get_it_done/",
        "score": 13024,
        "num_comments": 524,
        "created_utc": 1530614754.0,
        "selftext": "So I work for a maintenance and renovation company in Finland. My work consist mainly of customer service, answering the phone and talking to customers in person in the rare case that they show up to our office. Maybe 70&#37; of all the calls we get come from the same few people, who are impossible to please and usually very rude.\n\nThe woman in this story was one of the worst people I have ever had the pleasure to deal with, she wasn't reasonable in any way whatsoever and usually just resorted to shouting at me or my coworkers. What made the matter worse is that she was the chairman of the board of her condominium, which is in no way impressive, since usually no one wants to do the job (it doesn't pay anything and the board consists just of the more active residents). For some unknown reason it still boosts the ego of some people so much that they think everyone is beneath them :D (go figure).\n\nThis brings us to the MC itself. The apartment building she lives in has a big garage, and it says in our contract that we must wash it once every year (its a big job that lasts for about 10 hours if 2 people are on it), still our company has washed it twice every year because the garages near this one need to be washed twice a year, and no one ever remembers that this garage is only once a year. About a month had passed since the last wash and then this phone call happened:\n\n>**Me**: Hey \\*company\\* customer service, this is u/JJnnYY how may I help?  \n>  \n>**Colossal Bitch**: What the HELL is going on here??!?!  \n>  \n>**Me**: Im not exactly sure what you are talking about m'am?  \n>  \n>**CB**: THE FUCKING GARAGE YOU IDIOT, ITS DIRTY AND MAKING MY CAR DIRTY  \n>  \n>**ME:** The contract says that we need to wash the garage once a year and...  \n>  \n>**CB:** I DON'T FUCKING CARE ABOUT YOUR BULLSHIT EXCUSES IT NEEDS TO BE WASHED TWICE A MONTH IF YOU IDIOTS CAN MANAGE IT (*this is absolutely Idiotic*)  \n>  \n>**Me**: But m'am its gonna cost a...  \n>  \n>**CB:** I dont fucking care JUST GET IT DONE \\*hangs up\\*\n\nSince she had the authority to make this kind of call I decided to take her request seriously. I know that it was absolutely ridiculous and would 100&#37; bite her in the ass at some point. I talked to my boss and he gave me the green light, I confirmed her request via email, because I wanted to cover my ass and have the order in writing. Now, washing a garage this size costs usually about a 1000-1500€ when embedded in to a bigger contract. But since this was extra work it cost a lot more. So every month we billed them for about 5000€ more than usual.\n\nI still don't know how, but it took them 3 months to notice that their costs had dramatically increased. Obviously many of the other residents of the building had asked us why are we washing the garage twice a month now (its a big inconvenience, since they need to move their cars). We just answered that it's a new policy of the chairman of the board.  When the board finally noticed, they contacted our CEO and me. We explained the situation and. CB tried to cause a big fuss calling us liars and such. I wish I could've seen her face when I sent her and the whole board a copy of the email in which she had with quite *colorful* wording demanded us to wash the garage twice a month writing: *\"I don't care about the costs try to fucking understand\".*\n\nShe was replaced in the board and no longer has any say about the buildings affairs. Most of the other people in the apartment building know she's a colossal cunt. Me and my coworkers absolutely love it :D we have a statement ready for every time she calls about something other than her own apartment:\n\n>*Sorry m'am we have been informed that you no longer have any say in regarding the business of the apartment building, if however you have a problem regarding your own apartment feel free to contact us again!*\n\nThis drives her absolutely insane. I'm pretty sure she's gonna murder one of us :D *But its so worth it.*\n\nTL;DR  Lady wanted me to have a big ass garage washed twice every month. I did as she wanted even though i knew it                         was idiotic and expensive. She got sacked because of it and we got our oh-so-sweet revenge.\n\nEDIT:\n\nI might have used a wrong word for the garage. Not sure what the correct word would be in this case but its basically a big parking garage with over 150 parking spots in it.\n\nAlso, during a year big garages like this one tend to collect a lot of road dust and gravel. This dust then rises in the air when cars drive around the garage, getting the other cars dirty and causing problems with the ventilation systems. Thats why they need to be washed at least once a year.\n\nAlso wanted to clear something up about the condominium stuff. ~~No, its not like a HOA from what I've read.~~ Basically in Finland every one of these big apartment complexes is their own \"company\" called \"asunto-osake yhtiö\". The companies shareholders are the people who own aparments in the complex. They pay a certain fee, a \"maintenance charge\". Which is used by the board for renevations and maintenace. The laws around these \"companies\" are a lot looser,  and their goal is not to profit, but better the quality of the complex and the aparments in it. The board in these \"companies\" doesnt work normally :D\n\nEdit 2: Grammar\n\nEdit 3: Okay so apparently the HOA in the states is a broader term, and exactly the same thing as the Finnish As Oy (Asunto-osake yhtiö). TIL :D. Also unfortunately the woman in this story did not have to pay for the extra costs. Its a really big apartment complex, so the extra amount wasn't that big of a deal and they didn't have the energy to start fighting with her, so they took the high road and just fired her from the position.",
        "permalink": "/r/MaliciousCompliance/comments/8vr7wq/i_dont_care_about_the_costs_just_get_it_done/",
        "comments": [
            "[deleted]",
            "Wonderful. Makes me want to read what she said in Finnish - I know Finns can swear!",
            "You should add a line about how 'any requests for general building maintenance issues should be directed to the condominium board or CEO'. Just to twist the knife. ",
            "Master touch sending her own email to the board. Love it. ",
            "One of my brothers old bosses pulled the same thing. \n\nHe missed an entire afternoon of landscaping work thanks to one of his employees driving a trailer over his foot, and by the time he was out of emergency he had something like 20 pages waiting for him.\n\nAll of them from just one asshole, president of a dinky little HOA. \n\nWhen he got back to the office his answering machine was much the same. Dozens of messages from the HOA president, culminating in a angry one full of name-calling and demands. Mr. HOA wanted the next appointment free, he didn't like how long the grass was even when it had been cut, the hedges were getting shaggy, etc. \n\nAnd then the kicker.. \"I expect you out here first thing in the morning to get everything back up to spec and I don't care if you have to have people every day of the week to keep it exactly that way.\"\n\nWhat'd he do? He popped the answering machine tape in a drawer and scheduled a crew to mow and trim every day. \n\nAt the end of the month the bill he sent ($1700 instead of $250) made the HOA treasurer flip out so hard she actually showed up at his office. \n\nSo he played her the tape. ",
            "I hate saying it, but I felt better reading your story. LOL I can't believe she wore the confirmation though. LOL",
            "Malicious? Check.\n\nCompliance? Check.\n\nSatisfying? Check.",
            "And that's why you always CYA with written/emailed authorization.",
            "I can't help but feel sorry for all the residents who probably elected her as chairman knowing how terrible she was but didn't want to do it themselves, so they just hoped something like that wouldn't happen :/",
            "Oh how sweet that must have been to comply with her emails (proof). Can't imagine paying ~6k a month to clean the garage a few times a month. ",
            "Torille perkele! Mä tuon bisset.",
            "At least now you can wash your hands clean of that bitch.",
            "Goddamn, condominium boards are the worst.",
            "Ihan vitun oikein!",
            "You should cross-post this to r/fuckhoa. Fits perfectly.",
            "With asshole customers like that, who needs to drum up extra business, amirite?\n",
            "Well, I believe this makes you my personal hero of the day.",
            "Please tell me her name was Trudy Beekman. -Archer",
            "This is fucking /r/ProRevenge ",
            "She both called you and sent you an email?",
            "> I confirmed her request via email\n\nI see you've been here before",
            "I hope the residents sued her for every penny of extra cleaning. Board members have a fiduciary duty to look out for the interests of the whole organization.",
            "I live in the States and this made me feel so happy - I cannot convey the warm feeling this gave me. I have had to deal with her american cousin. We now have this posted in the office as \"Take a lesson here\". You are our hero.",
            "/r/ProRevenge ",
            "Everybody seems to relate this person to the a chairman of the board of a HOA. I am not completely sure whether the chairman of the board of a HOA is the same as a chairman of the board of a Finnish housing cooperative (asunto-osakeyhtiö), or the Swedish counterpart (bostadsrättsförening), which are quite similar. In the Finnish case, the board actually is responsible for the decisions they've made acting as board members. I mean, it is compeletely reasonable (and they'd probably win) for the other members of the housing cooperative to sue this insane person (possibly the whole board) for the financial damage this person caused. If it's the same for a HOA, let me know! I am strangely interested in these kinds of things.",
            "If I'm reading right, you charged €6000 a month for cleaning, but it took them 3 months to notice the cost?\n\nHoly shit, that's like $7000, almost exactly.",
            "Nice. *Nods",
            ">its a big job that lasts for about 10 hours if 2 people are on it\n\n>every month we billed them for about 5000€ more than usual\n\nSo €250 per hour per worker? That's one expensive cleaning service.",
            ">\"She was the chairman of the board, which isn't impressive, since usually no one wants to do the job (it doesn't pay anything and the board consists of more active residents). For some unknown reason it still boosts the ego of some people so much that they think everyone is beneath them.\"\n\nReminds me of mods in some subs",
            "\"what did is cost?\"  \n\n\n\"...~~Everything~~, another 5000€ per month\"",
            "I thought everyone in Finland was relaxed and easy-going. My eyes are now open to the truth.",
            "Truly heartwarming",
            "How some people can be such assholes? It just blows my mind. Good to see she got screwed by her own asshole-ery!",
            "How do these garages get so dirty?",
            "As a man who was president of my HOA for 5 years, glad to see her caught in her own stupid.  People seem to think being HOA President is something “big” or “prestigious”.  LOL, it’s a cauldron of petty bitching and oversized egos.\n\nI ran into no end of idiots like the bitch you describe.  But I had to deal with them out of self defense.  Glad this one got tossed.",
            "Totally worth it. If its you, and not a coworker, I want to attend your funeral. Habe your mother write me a pm.",
            "I came\n\nI literally came\n\n/r/FuckHOA \"Best of 2018 Award Nominee\"",
            "I thought people in Finland were all polite",
            "Give some people the smallest degree of power and they will turn into a tyrant. Amazing how she had no consideration of the other residents she was supposed to be looking out for, glad it bit her in the ass. ",
            "Dumb people and HOA boards... there actually is no more iconic duo ",
            "I would have loved to see the OP's face when he showed the board the email. That smile must have been classic. :p",
            "This story is gold, specially with the aftermath, this story is why I read this sub.",
            "Mmm, [ass garage](https://www.xkcd.com/37/)",
            "Give some people a little power and they go nuts.",
            "Hot air like this is the wind in my sails, nice job OP",
            "This is the best thing I have read since subscribing to this sub. I just feel like something is right in the universe after reading this. \n\n*sigh*\n\nFeels good. ",
            "Ahhh OP this was orgasmic to read. ",
            "How do you say \"fuck\", \"fucking\" in Finnish? Plznthx",
            "This is delicious. ",
            "This is poetic and yet majestic",
            "Clean a garage? Care to explain?",
            "Oh God that felt good. Makes me smile a mile wide.",
            "Hyvä Suomi! ",
            "I had a cleaning job for a time.\n\nOne place wanted their car park cleaned *weekly*.\n\nI swear that job made me more misanthropic than I already was.",
            "Generally condo boards, HOAs, etc - the sort of person who is likely to revel in being part of or head of an organization like that is the worst sort of person to actually be in that position.",
            "Yummy. ",
            "Obligatory suomi perkele, torille?",
            "COLOSSAL BITCH ",
            "Zip her up in a bodybag she is flame broiled by Karma!",
            "Oh my god, I got such a massive justice boner reading this",
            ">lso wanted to clear something up about the condominium stuff. No, its not like a HOA from what I've read. Basically in Finland every one of these big apartment complexes is their own \"company\" called \"asunto-osake yhtiö\". The companies shareholders are the people who own aparments in the complex. They pay a certain fee, a \"maintenance charge\". Which is used by the board for renevations and maintenace. The laws around these \"companies\" are a lot looser, and their goal is not to profit, but better the quality of the complex and the aparments in it. The board in these \"companies\" doesnt work normally\n\nThis is pretty much the definition of a Home Owners' Association (HOA).",
            "MMmm... Malicious compliance at its best.",
            "Hahahahaha amazing. She totally deserves to hear that statement over and over ",
            "My favorite Finnish phrase is vitun huora. I feel like this woman was a vitun huora.",
            "Read your edit. The condo owner and board model is the same here in the states and is sometimes referred to as an HOA even though it’s apartment ownership and not homes in a planned community.  Source: live in condos, have been on boards and worked with management companies.  It’s all pretty much the same, at least in my part of the states.",
            "Can I ask, did she reply to the email as well... I pretty sure your post says it but can someone or OP confirm",
            "Dude, you are fucking amazing.",
            "did she pay for the extra costs?\n\nshe should pay for the costs",
            "Anyone who requests a service and writes ‘I don’t care about the costs’ is asking for trouble. ",
            "Sounds exactly like an HOA actually. They collect dues and operate as an independent company with a board and members and contractural agreements with the owners of individual properties. ",
            "That was absolutely beautiful. She got exactly what she deserves. This is what I live to see on this sub.",
            "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r8vr7wq?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[Saara Aalto - Monsters - Finland - National Final Performance - Eurovision 2018](http://www.youtube.com/watch?v=eEeIeQ-j2zk)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/8vr7wq/_/e1qedf2?context=10#e1qedf2) - Oh, say, while sharpening a knife and smiling? The song might be like, um... the 30 second mark of    No big, it's not like Finland has any swears but perkele. Yep. Just perkele, that's it.\n[The History of the \"F\" Word](http://www.youtube.com/watch?v=mfTKWwxuF1g)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/8vr7wq/_/e1q798z?context=10#e1q798z) - One of the most versitile words in the English language\n[BOONDOCK SAINT - Fuck*ng fu*k:)](http://www.youtube.com/watch?v=pDWzGm1W0WY)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/8vr7wq/_/e1rmj0z?context=10#e1rmj0z) - Certainly demonstrated here\n[Parking Lot Pressure Washing](http://www.youtube.com/watch?v=_6aixvWsIHg)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/8vr7wq/_/e1qj124?context=10#e1qj124) - I'm trying to wrap my head around how it's getting her car dirty too. I assume the \"garage\" is probably a parking structure of some sort...OP probably does something like this?\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_r8vr7wq?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
            "Vittu mikä tolikka\n\nShe got exactly what she deserved",
            "a massive justice boner",
            "Getting that email confirmation for later use must’ve been so SO satisfying ",
            "Finnish Her!",
            "...ugh, fucking tyrants.",
            "Mä sanoisin että se ei oo tasan niinku HOA koska se pätee vaa kerrostaloihin ja sillee, jos asuu omakotitalossa voi kai pitää ihan mitä vaa haluaa pihallaan ilman et joku tulee ragee toisin ku jossai kerrostaloissa.",
            "The association type you are thinking of would be a condo corporation in NA. If you can only rent and one org owns it it's an apartment building. If you can buy the unit its almost always a condo or Co-op.",
            ">\tI might have used a wrong word for the garage. Not sure what the correct word would be in this case but its basically a big parking garage with over 150 parking spots in it.\n\nI don’t know how international a term this is - even my phone dictionary doesn’t acknowledge it - but where I live (Canada) we call this a “parkade”.",
            "I would use car park or parking lot, garage is mainly for domestic use eg one or two cars. ",
            "I get it, I really do, but you did kind of make it so a bunch of people lost 1500 EUR, most of which is not hers..",
            "\"Go figure\"\n\nthat\n\nshe's a \n\ncunt.",
            "Finland, what is that???",
            "All the secret Finlanders commenting on this thread... don’t you know there’s no such thing as Finland? It’s a hoax!",
            "There's no way this story is real. It occurs in Finland. Finland does not exist.\n\nSee r/FinlandConspiracy",
            "Every :D makes me think of the Benis :D",
            "Yay! You got a script!  We loved getting scripts in our call center.  Sometimes, when the computer system went down, I would get so practiced at the script that people would ask if I was a human.",
            "The English or at least American term your looking for for the building is Co-Op - this is where the apartments are owned as shares of the building / company",
            "She needs a property management company, not a contractor",
            "I think that when you said this, you brilliantly illustrated the average mindset of the modern American millennial posting memes making fun of the Drumpf admin lol.\n>I'm pretty sure she's gonna murder one of us :D *But it's so worth it.*\n",
            "How in the hell does it take 10 hours for 2 people to clean a garage, and cost 5000 to boot... man that must be one HELL of a cleaning job.",
            "\"Finland\"... Don't you mean Eastern Sweden?",
            "r/pettyrevenge",
            "5000e is a lot. Who paid for it again? I'm quite certain that it wasn't the woman alone, but the people living in that building. So, the fact that your company didn't take the initiative and contact the residents of the building with an informativw leaflet, but decided to act on a single person's brash remark and colourful language instead, is a huge breach of trust and ethics. I just find it disturbing that such thing didn't cross your mind.",
            "Is this condominium located next to a coal mine or something? How does it get so dirty? \n\nAlso, if the cars are parked inside with the door closed, I don't see how the inside of it gets dirty to where her car would get dirty too. Unless you used the wrong word and actually meant to say carport?\n\nThis is a [garage](https://coachhousegarages.com/wp-content/uploads/2016/11/MTV_Garage_N0302-1a.jpg) and this is a [carport](http://www.alloybuildings.com/yahoo_site_admin/assets/images/5.113125239_std.JPG)"
        ]
    },
    {
        "post_id": "9a0zva",
        "author": "RedditBlueit",
        "title": "Here, have some candy.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9a0zva/here_have_some_candy/",
        "score": 13021,
        "num_comments": 198,
        "created_utc": 1535143309.0,
        "selftext": "tl;dr - Admin says I have to refill her candy jar.  I did, and the office looked like they'd been eating popsicles.\n\nI worked in a low key office with a great set of coworkers.  The managers were a mixed lot but had a great admin who was the heart of the place.  She was very outgoing and liked to joke with us.\n\nShe kept a glass jar of candy on her desk, and we helped ourselves as we chatted with her.  One day, I walked up and took the last piece of candy.  \"Hey\", she said in mock anger, \"What are you doing, taking all my candy!  You'd better be planning on replacing it!\"  I laughed. \"Sure will.  But we warned you if you kept food at your desk, it would attract pests!\"\n\nThat night, I had an errand and saw a candy store.  I went in, looking for something unusual.  I found it - some obscure gumballs for kids.  The gum was designed to *dye your mouth* as you chewed it!  There were warnings on the bag, but not on the individual pieces.  I bought enough to fill the jar.\n\nAfter the next few weeks, it was common to go into a meeting and see a normally staid engineer with a purple tongue or a green smile.  No one seems to have made the connection with the candy jar - or if they did, they didn't want to be the one who spoiled the joke.",
        "permalink": "/r/MaliciousCompliance/comments/9a0zva/here_have_some_candy/",
        "comments": [
            "That is artistic, benign, and memorable. \n\nA lovely trifecta — nice!",
            "Sounds more like /r/deliciouscompliance",
            "I'm sure she has noticed. She probably finds it delightful.",
            "Do you remember the name of the gum? My husband keeps candy at his desk too.",
            "Technically correct. The best kind of correct.",
            "Okay Jim, tell Pam hi for all of us.",
            "Hee hee",
            "Next time: sugar free gummy bears.",
            "If she normally keeps gum in there it can be fun to toss together a mix of \"regular\" gum like trident and juicy fruit and whatever, and then get some soap gum. Got that as a gag type gift and the stuff actually tastes like what soap smells like.",
            "Wow! This is not your typical malicious compliance. All of the characters involved were nice! :) good change of pace ",
            "My mom did the same thing with jelly beans. She would mix watermelon and jalapeno jelly beans together, since they are practically identical. She did it a few time at the office she worked at and a few times at home. As a kid, it was a dirty trick. As an adult, it's freaking genius.",
            "I did something similar with cinnamon flavored candy corn.  I can't find it anymore, sadly, but it was the best unintentional office prank I ever pulled.",
            "That’s actually pretty adorable, well played",
            "Good story! It's better if you have the tl;dr at the end of the story, though, so you don't spoil those who are interested in reading your fun anecdote.",
            "Man, you missed your opportunity. Do you really want malicious compliance? You should've purchased a five pound bag of sugar free gummi bears from Amazon. There's always next time, I suppose. ",
            "I love this MC so much. It’s benign and petty and just downright confusing and funny/cute. This is what practical jokes between friends and coworkers should be\n\nDon’t get me wrong, some of my favorite MC posts are **really** annoying if not straight up *nasty*. But that’s only if they’re being actually nasty/malicious to you first.\n\nThis is the ever rare friendly prank MC and OP you did this *perfectly*. I remember reading once in a meme about pranks: “confuse don’t abuse.” And this is one of the most confusing, innocent little pranks I’ve heard in a while\n  \nIt sounds like you guys have a really relaxed atmosphere. That makes me happy to know ☺️",
            "This feels like the first season of a show that needs a second season right meow. The end just feels like a cliff hanger.",
            "The TL;DR goes at the bottom. I've read the TL;DR so now I don't need to read the story.",
            "I was one of those who kept candy in a dish on my desk.  At the time I was the \"Technical Coordinator\" for the Tech Support group.  Not really an admin as I did lots of stuff like billing for non-warranty repairs/replacements, loaner units, tracking RMAs, setting up and processing satisfaction surveys, calligraphy for the certificates for the training dept, playing with databases, etc.  Some of the TSEs were like big children/piggies when it came to food.  For example, during one of the Girl Scout cookie gluts, one of the guys hoarded stacks of various cookies at his desk, so the crew that worked til 6pm took a bite out of each cookie and left the rest at his desk.\n\nAnyhoo, providing candy in the dish gets tiring after a while, especially when one is the least paid in the group.  Also, whoever was emptying  the dish would do so when I wasn't at my desk so I couldn't tag them to refill the dish.  One day, I spotted some of those joke items, such as the \"disappearing ink\" etc. and there was some joke chocolates that looked very realistic but was made of rubber.  I bought them and placed them in the dish.  A few days later, I found one that looked like someone tried to bite it.  It took a few months before someone admitted they were the culprit.",
            "Tldr goes at the bottom. You're essentially saying, \"don't read this story, I just spoiled it for you\"",
            "I would have used the Amazon gummy bears if she was mean. https://www.amazon.com/gp/aw/d/B00DE4GWWY/ref=cm_cr_arp_mb_bdcrb_top?ie=UTF8",
            "Splashers gum!",
            "Tongue Splashers were amazing! ",
            "Back in the 1960's, there were things an Army brat overheard...\n\nA drop-dead gorgeous secretary who worked at an Army Helicopter School grew tired of the cowboy pilots hitting on her. So on the advice of one pilot's wife, she baked a cake and half the cake's icing had been spiked with Chocolate Exlax.\n\nWhen flying had been completed for the day, she served cake, made sure the right guys got the message: Keep your damn hands to yourself.\n\nUnfortunately, sometime targeting  goes wrong and there's collateral damage. The wife who had given her the idea... Her husband spent the evening on the commode and the night on the couch.",
            "I bet the admin absolutely loves it.",
            "I used to have a bowl of peanut M&M’s on my desk which was emptied by many people.  I mixed in some wasabi peanuts once - that seemed to slow down the disappearing M&M’s quite a lot.  ",
            "I'm stealing this and doing it at work.",
            "Oh man I've been keeping a bag of candy at my desk and offering a piece to basically calm people down when I'm helping them and to help calm me down after I'm done.  This sounds perfect... just leave a bunch in the kitchen and wait for a bunch of models to start walking around with blue mouths.",
            "LOVE it! It follows the Ultimate Rule for friendly pranks, \"Confuse Don't Abuse.\" ",
            "This is a great story, but I don't know if it's malicious compromise. ",
            "Maybe it just tastes so good they don't care what color their tongue is!",
            "Should have gone with the BeanBoozled Jelly Beans.",
            "This is pretty malicious... in a delightfully playful way :D",
            "Neat story, and I learned the word staid! ",
            "LMFAO",
            "I not only keep candy at my desk, I keep good shit and take requests.  People can go in my office whether I am there or not.\n\nI don't understand bitching about it.  Hell, I don't really eat candy and still do it.",
            "Aww <3 thats so cute!",
            "Well done.\n\nYou know when we were kids and would hear stories from our adult relatives and parents about clever shit they did before we were around? You just got yourself a story you are going to retell plenty of times.\n\nDoing this life thing right.",
            "What's the name of said candy",
            "...did the dye wash out at all?",
            "I used to love that gum, it was called Mouthwash",
            "having the tl;dr at the top is one of my pet peeves. it takes so much effort not to spoil the story by looking at the first sentence",
            "Ugh tldr at the top?? Why. Do you read the last chapter of a book first. Stop putting spoilers in BEFORE the fucking story!",
            "I would have gone the sugar free gummy bear route and act like I'm eating handfuls of them when in reality I'm eating handfuls of my delicious normal Haribo's that are stashed in my desk",
            "Next time try using sugar free haribo gold bears.\n\n\nIts *slightly* less innocent.",
            "this is so wholesome it made me really happy thank you!",
            "This was actually pretty funny",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/ctoccmhnapihghats] [Here, have some candy.](https://www.reddit.com/r/CtOCCMhnaPIHGHAtS/comments/9a893l/here_have_some_candy/)\n\n- [/r/deliciouscompliance] [Here, have some candy.](https://www.reddit.com/r/deliciouscompliance/comments/9a421j/here_have_some_candy/)\n\n- [/r/deliciouscompliance] [Madlad](https://www.reddit.com/r/deliciouscompliance/comments/9a8ly2/madlad/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Quality ",
            "r/madlads",
            "Scum like you represent the most debased, insufferable sort of evil that exists: mild inconvenience in the guise of harmful prankery, attempting to downplay the utter sickness of what you've done.",
            "Best Malicious Compliance Story.   Ever.   "
        ]
    },
    {
        "post_id": "t5se28",
        "author": "pallidbat",
        "title": "Why of course you can speak to a man....",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/t5se28/why_of_course_you_can_speak_to_a_man/",
        "score": 13028,
        "num_comments": 634,
        "created_utc": 1646316560.0,
        "selftext": "This happened about 15 years ago or so. I was a team lead (this will be important later) at an IT help desk for a company that provided outsourced support to companies in a specific profession. Said profession is known for having employees that are very demanding and need everything Right Now.\n\nOne of the people I supervised was…. let’s say challenging. We’ll call him George (See:  [https://www.chroniclesofgeorge.com/](https://www.chroniclesofgeorge.com/) for the joke). George was late 15 or so days a month, spoke in a mostly incomprehensible mumble, and had been caught by callers multiple times falling asleep and snoring while on a phone call. He’s also not so great at troubleshooting, and worse at documenting his troubleshooting steps. At this point, I’d been on a months long crusade to have him fired, because he was dragging down the team and giving me a constant headache because I had to follow up with his disgruntled users.\n\nOne morning, I got a phone call from a newer user, who was extremely agitated and already angry about his computer issues. I barely got off my standard greeting when this happened. “Look, I’m sure you’re really good at whatever it is you do here, but can I talk to one of the men? I need this done right now.” I’m never exactly sure why people think my lady parts make me incompetent with a computer, but hey, he did ask for a man, so I’m happy to oblige.\n\nI check around the room, and it’s early so no one else is on a call. Gee, who on earth should I send this ray of sunshine too? Obviously, I inform George that my caller wants a man, and is insisting, so I’m transferring the call to him. George spends a good 30 minutes on this call, I hear him start snoring at some point, and he’s getting nowhere with the issue. The guy he’s working with is getting angrily loud enough that I can hear him over George’s headset. Finally, the user demands to speak to George’s manager.\n\nSo, George transfers him back to me, and I sweetly apologize for the delay in resolving his issue, and say I’d be happy to help him with his problem, if he’s okay with me working on it. For some mysterious reason, now he’s fine with that. I know the exact fix because I helped the in-house IT people test it out. I have him fixed in two minutes flat. I have never heard such a meek thank you. Dude ended up asking for me a lot of the time after that, which, thanks, I guess? At least he was always polite to me.\n\nEDIT:  Since people are asking, George did FINALLY get fired a few months later, long after I'd ever given up hope.  ",
        "permalink": "/r/MaliciousCompliance/comments/t5se28/why_of_course_you_can_speak_to_a_man/",
        "comments": [
            "I also worked in IT for a while, and honestly it was never an issue (I got lucky, but we were servicing internal stores). When I managed a comic book shop, however, oh my word. Guy refused my Dungeons and Dragon's assistance because he wanted to \"speak to a dude\" since I was \"only there to boost sales\".\n\nI point out my underling on staff. He walks the store and my employee let him know he's never played D&D in his life, while his manager played every other weekend so he'd get more help from me. The guy left. Never came back. Tatafuckhead!",
            "It's hard for women to work in IT, because they have to skip over the step where you plug your penis into the computer",
            "Fellow female in tech here. The amount of times I've got \"can I speak to a tech\"... The worst thing is how the tone changes when I go \"yeah, speaking\". Don't bark at whoever answers the phone, even if it's a receptionist/secretary. It's rude. And you don't know who you're speaking to (clearly!).",
            "Lol, I work in a pharmacy and worked really hard to understand most problems. There's a few things I don't remember sometimes because we just don't do it often, but most of the time I'm most experienced with solving any given problem. \n\nI was once helping a man and trying to explain to him that his insurance doesn't cover the $15 extension charge (that he agreed to) because it was a fee for being late on refilling his medication and was designed to compensate us/our company for the extra paperwork we had to do in order to finish his meds asap, it had nothing to do with the cost of medication and wouldn't be covered no matter what. \n\nHe cut me off while I was apologizing for the misunderstanding and said \"I dont want to speak to you, I want to speak to HIM.\" And pointed at my male colleague. He just goes up and doesn't even repeat what I said, he just says \"she's correct. Yes, she told you. She also pointed out the sign when telling you the price.\" It was pretty great. \n\nEventually he storms out and his partner has to come in and meekly request his medication since the guy realized he couldn't go without it and would have to pay the $15 but didn't feel like having to look us in the eye when he confessed his mistake.\n\nI especially like when customers ask for my less experienced male coworker to help them instead of me, and since he doesn't know how to do certain things he ends up asking me and I end up having to walk him through it right in front of the customer just so the customer can have a MAN \"help\" them, which of course takes much longer than just letting me do it.",
            "When I worked retail a customer asked to talk to my manager since he didn't want me around because I'm a gay man. So I got her to come talk to him and he said \"I can't find a man working in the store and I want a man\", and then she just calls another department in front of the customer and goes \"I need a man, the customer likes men and he's looking for a man because he really wants to have a man here, can you please send a good man for him, he really needs a man.\" The customer got maaaad, it was great. Then she gave me a break so I would not have to be around that customer and she apologized to me for the situation, she was nice.",
            "I had a similar situation where I was working in software support and had gone to lunch when a gentleman called. It was a situation only I knew how to support, and the guys I worked with (only female in the department) told him they'd have me call him back when I returned. Well, I have one of those nicknames that could be male, could be female, but is more commonly male. I got back, got the message and returned the call. He was furious and yelled \"NO! I need archieuthiswfng in COMPUTERS!!\" I said, \"This IS architeuthiswfng in computers.\" He said \"But you're a ...\", I said \"Woman. Yep. How can I help you?\"  \n\n\nThis was in the early 90s. good times.",
            "Had that happen to me.  I'm a female butcher, some people have a difficult time accepting that fact.\n\nI had just gotten a brand new, don't know anything person to train.  No problem. \n\n*He* was straightening the meat case and a customer asked him a question.  He explains he's in training and comes and gets me.  \n\nI go out and answer the question.  *As I'm standing right there*, the customer asks the new guy another question.  Again he explains he's new and in training and doesn't know.  \n\nOk, because I don't have a penis, I'm not knowledgeable...",
            "I'm a woman and work in an office supply store. This happened a while ago:\n\nold guy: where are your SIM cards?\n\nMe: I'm sorry, we don't carry SIM cards. Your best bet is to contact your cellular provider or go to the local store for your cell provider.\n\nOG, getting aggravated: The phone store sent me to you!\n\nMe, confused: I'm not sure why they would. We don't carry SIM cards.\n\nOG, sneering: You don't know what a SIM card is, do you!\n\nMe: It's an identifying chip card that goes in your phone and provides the information key necessary to connect to your provider's wireless network.\n\nOG stares at me, confused. It dawns on me...\n\nMe: Did you mean SD card?\n\nOG: Yes! That's it!\n\n*Facepalm*\n\nAlso had one guy straight up come in and say \"I need a computer so I need to talk to a guy.\"",
            "I am always more confident in women working in a \"male dominant\" industry/job because I know that women have to work harder, and prove more that they are capable of that certain job. Men have a certain privilege where they may lack something but they still get accepted because \"they seem like a great guy, fit into the work culture well, etc.\" When women gets interviewed for male dominant positions, there are always a lot of skepticism of their knowledge and skills and so they get drilled, and  interviewers have higher expectations of them, requiring women to \"score\" higher.\n\nSource: worked in IT before with a lot of \"bro\" mentalities. Have a female friend who's a doctor that faced a lot of gender prejudice related hurdles to achieve what she has, be where she is.",
            "I had the same thing happen to me, many times, at a dealer Radio Shack in the late 80's/early90's. \n\nFirst time I remember it happening, a guy walks in and before I can greet him, he tells me he needs to speak with a man about his problem. Now, I knew the store inside and out as did the owner. There was a repairman in the back and he is who I got for the man as owner wasn't in. Repairman knows repairs but not all of the store. I knew what was coming and I couldn't wait for it! \n\nRepairman comes in and asks what the problem is.  Man spends five minutes in a run-on sentence of his problem while I stood at register, pretending to be ignoring but hearing it all. Repairman looks at me and tells man, \"I have no idea what you are looking for at all. You will have to ask her (me).\" \n\nMan walks over and starts his spiel again.  About 30 seconds in, I tell him \"I bet I know what the problem is and what you need.\" Went to the wall, grabbed what he needed and had him out the door in three minutes. He didn't make eye contact the entire time, lol. But what he did do was keep coming back, each time waiting for me to be free to help him. I guess I was the right \"man\" for the job from then on...\n\n(Sadly, men weren't the only ones that assumed from time to time that a male was required, women did it too, and I'd set them straight, as well)",
            "Sadly this is so relatable, love the way it was handled. I'm the CTO at a small homebuilder & I also happen to be a woman.  I rarely run into this type of thing anymore, but a couple of years ago I was interviewing MSPs to handle some cloud stuff for us.  One company sent their highest 2 people to speak to me about it, both of them men.  During our talk they said that they would love to speak to the decision maker once we were done.  I made it clear that I am the decision maker & they are speaking to the right person.  Yet moving forward they kept implying throughout that they would like to speak to the owner, who happens to be a man.  Well our conference room is glass-walled & right by the front door, so they saw when the owner walked in & popped his head in to say hi.  I introduced the owner to them & gave him a 10-second rundown of why they were here.  They fell all over themselves trying to get him to join us.  He could easily read the situation & just said \"makeupdumbass is in charge of the tech stuff\" and took his leave.  They resumed discussing the situation with me, looking quite dejected after that, and after a few minutes I cut the meeting short & thanked them for coming in.  Obviously I did not grant them the contract.  If they can't show me basic respect during an initial meeting I can't imagine how they would handle my concerns down the road.",
            "10 years or so ago, I got to help pull this in reverse.  One of my co-workers was an immigrant from India, and she was by far the expert on the floor for a particular area of the product.\n\nWe'd get calls a couple times a month where someone wouldn't want to talk to a woman with a bit of an accent and they'd call in to get the case moved to someone else.  We'd always arrange to have those cases moved to one of us that sat right next to her, and after getting started and getting the customer on the phone, we'd explain that we didn't know that area very well, so we'd have to get some assistance, then she'd come over to our desk, we'd turn on speaker-phone so she could get their problem fixed.\n\nYou could just hear the dismay from the other end of the line, it was glorious.",
            "I saw this type of foolishness in action from the other point of view years ago.\n\nI was a middle-aged man, changing careers, getting an additional professional certificate. I needed to do an internship for academic credit. A non-profit hired me for a clerical position with the agreement that I'd have plenty of opportunities to also do professional activities, under supervision, for my internship (and with the assumption that I'd move on after the internship).\n\nI was the only male working at that particular location.\n\nEven though I was just an intern, many many people coming into our office just assumed that I was in charge and would try to bypass my experienced female co-workers to speak to the brand new male intern.\n\nI made a point of gently redirecting and/or correcting the misunderstandings, especially because I didn't want my female supervisors to think I supported that nonsense.",
            "We all want to know - what happened to George??!",
            "Maybe if you promise to wear an apron and take the call in the kitchen he might believe that your fluffy lady brain would be capable of helping him. I've worked with far more men than women, but only some of the men were incompetent. Both IT and electronics techs.",
            "Come join us at r/talesfromtechsupport we love stories of users unable to comprehend that women work in IT.\n\nFixed it",
            "Men can accept that a woman is competent, but often only with proof. Men just get the benefit of the doubt. Thankfully, this is on the way out, right? I mean, it’s been on the way out for my entire life… but it will happen eventually, right?",
            "When I worked a call center back in the day where field techs called in for assistance, I quickly learned there was a significant statistical difference between male and female field techs:\n\n    Men were often grumpy, curt, self superior, and resistant to being asked to do anything.  \n    \n    Women were typically prompt, informative, listened, were ready to do the job that needed doing, and often expressed gratitude.\n\nI literally got to the point when my phone rang I specifically hoped it was going to be a woman on the other end because I knew then it'd be an easy call.",
            "I got kind of lost in the Chronicles of George and almost didn't read the post. I don't care who is helping me with my IT issue... but it does help if I can at least understand them. One time I got a person with an incredibly thick accent, but I really enjoyed the call because I could still understand everything he said perfectly. I think what helped was that he took the time to clearly enunciate his words (but without speaking slowly). \n\nI live in occasional dread of getting that French phone support guy that Jen from the IT Crowd was talking to. He seemed nice enough, but I wouldn't have been able to understand him either. (Poor Jen.)",
            "One time I was tasked with fixing our emergency notification computer. The only way it would stay on is if it was tilted. The issue had been going on 5 years and lots of parts were replaced. So when I showed up (a. the new girl and b. a girl period) the old telco guy was like, \"Okay fine you can try.\" I looked at it and replicated the problem and said, \"Oh one of the motherboard standoffs is in a wrong place and shorting the board out.\" Took it apart, fixed it, and it worked fine.\n\nOld telco guys response, \"You're pretty smart for a girl.\"\n\nWe became really good friends after that because he respected me and my knowledge. I now do his job since he's retired.",
            ">’m never exactly sure why people think my lady parts make me incompetent with a computer,\n\nBecause it's true.  I'm a trans woman, and I used to be a cyber security expert, and in fact, was well respected and well paid within my field. But as I have gone through transition, I apparently have lost most of my skills and knowledge. I'm going to lose the rest of my knowledge this summer when I get my final surgery.\n\n/s if it wasn't clear.\n\nAnd to be really clear, I am, in fact, a trans woman, mostly passing at this point, and I have definitely noticed how people now trust my judgement less in my field of cyber security.  It's pretty sad, honestly.",
            "As the only female tech in my office I feel this story in my bones. I get mistaken for an answering service, an office manager or a secretary about once a month, and typically there’s some surprise and a little embarrassment in the persons voice which barely makes up for it, but once or twice I’ve gotten either complete disbelief, or someone going “well I think I’d like to speak to someone with more experience please, this is an urgent issue (I have 3 years of experience and am sort of my bosses go to for high quality work). And of course there’s the one CEO who occasionally calls me “sweetie” but we don’t talk about him.",
            "I used to work for a cell phone kiosk that was managed by a woman. So many times, old dudes (always old dudes) would tell her they would rather deal with a man, so she would call me over to deal with them. Any time they asked me a complicated question (even I knew the answer) I would say \"that's a great question, let me grab my manager to help out\" and bring her back over. They would always get really meek and quiet when they realized she was in charge and knew way more about the business than the men who worked for her.",
            "So what the hell happened to George? Don’t leave us hanging.",
            "haha I worked phone tech support as well, and I also do not have a penis and some people thinks that makes me unqualified. I was not in a management role (turned it down because the pay raise was like 30 cents/hour for almost double the work load). I did have that one female supervisor that sort of hated men.\n\nCompany policy states we can ONLY transfer to someone higher up the food chain, not parallel. It was also well known in our center that any man who wanted someone else simply because we were lacking a wiggly appendage would be transferred directly to manhater. She loved those call, they made her day.",
            "Was he fired over his refusal to give up his red stapler?",
            ">I’m never exactly sure why people think my lady parts make me incompetent with a computer\n\nI feel this so hard.  I've been in tech service practically since the damned things were invented and can't count the number of people who *just aren't sure* I'm qualified.  Sheesh.",
            "When I worked in hosting support we had a team of 8-10 with one female on the team, who happened to be the CSS because she was the least technical (at the time). It was her job to answer most of the phone calls and either provide status updates or transfer the call to whoever was working the ticket. Some of our customers from the Middle East and India would refuse to speak to a woman on the phone; if she answered they would hang up immediately and call back 30 seconds later. If we were all busy with other issue then this could go on for 5, 10, 15 minutes before someone else would have a chance to answer. Of course this is costing them a pretty penny for *international* calling. Some people are just ridiculous.\n\nWe also had one customer whose wife was the technical brain of the business but he wouldn't let her speak on the phone, so he would call in and relay everything between his wife and the tech on the phone.",
            "We used to get a lot of issues coded PEBCAK. \n\nProblem Exists Between Chair And Keyboard.",
            "You have the CLOP.  A serious condition that leads to the appearance that you are forever incapable of  performing \"the manly things\", like knowing your way around a computer, the ability to program, troubleshoot, work in the trades.  The long form is \"critical lack of penis\".\n\nThough, as someone with the CLOP myself, I'd be impressed if I saw a penis making the wiring connections on anything electrical.",
            "I am havening much laughening as I read The Chronicles. Thanks for sharing!",
            "We had a George...  in the Navy... they were still trying to get rid of him after 3 years at our command when I bailed out...",
            "As a woman I've had to deal with these kinds of people so many times ugh. It's so frustrating",
            "***\"sir, I AM a man and I don't appreciate you making fun of my health condition! I have a penis. It is huge and it is mighty!\"***\n-------",
            "[deleted]",
            ">Dude ended up asking for me a lot of the time after that, which, thanks, I guess? At least he was always polite to me.\n\nHah. Seems like he also learned his lesson.",
            "I love moments like this. As a bloke, it upsets me when people think that someone can’t do their job. \n\nFirst hand, I’ve embarrassed one rude guy and yelled down a complete misogynist. \n\n1) Working in a bike shop - guy comes in to get an inner tube changed. I put his bike in the stand, pop the wheel out and am tapped on the shoulder by my female colleague letting me know she was here to take over and I could go on lunch. I hand the wheel and tools over and the customer says “If she’s going to do it, I’ll do it myself!” I explained to the customer that my colleague was actually a fully qualified motor mechanic who was more than capable of changing an inner tube! She was far more highly qualified than I was at that job! \n\n2) Working hospitality - Guy comes over, ignores the two ladies standing next to me (all three of us in the same uniform) and asks me if he can do something to the layout of the venue (can’t remember exactly what it was). I say I’m not sure and that I’ll ask my Manager, turning to the lady stood directly next to me. She cottons on to my joke and repeats exactly what I said and turns to her manager (third in line), who simply says “Yep, we can do that!” And promptly dispatches me as lowest on the Totem pole to go do my Grunt work!",
            "Hell yeah OP!!! I'm constantly amazed at all of the things my lady parts supposedly keep me from being able to do, and all of the knowledge that my feeble lady brain just can't seem to grasp. Lol",
            "I did retail security for about 20 years. Lots of female managers and the area I worked out of had a large Somali community so anytime one of them was told no by a woman? they wanted to hear it from a man. So I get a call in the security office  I'd march down my big happy bald tattooed ass down to the service desk:\nMe: \"What's the problem?\"\nCustomer: \"I want to return this Item I bought 6 months ago but have no receipt or box for\"\nMe: \"Let me ask the manager\" \n*turn to female manager in full view of customer*\n\"Can he?\"\nFm: \"No\"\nMe: \"She says no. Any other questions?\"\n*customer sulks away mumbling*",
            "I good friend of mine used to work in a store that specialized in camping, hiking, hunting etc.  She would tell me stories about guys coming in looking for a bow or advice on ammunition or whatever else.  Now this friend of mine is a straight up expert when it comes to archery and shooting.  A lot of these guys would look right past her and ask to speak with a man.  The dudes she worked with would invariably point the customers right back to her as the most knowledgeable in the shop.  Funny how having lady bits somehow negates experience...",
            "Even the most useless people might come in handy, once in a blue moon.",
            "[deleted]",
            "You just weren’t havening it!",
            "I work in IT as well, and I have definitely encountered some misogyny. However I work in enterprise support so people are far too professional to be misogynist. They would be crucified if they dared to say anything like that to me or my female colleagues.",
            "I am a man who prefers having a woman from tech support assist.  Women seem to me to be more efficient and thorough in this arena. I realize a better return on my time spent with any given issue.",
            ">George was late 15 or so days a month, spoke in a mostly incomprehensible mumble, and had been caught by callers multiple times falling asleep and snoring while on a phone call.\n\nThis guy is not doing okay. Obviously it sucks to have to work with someone like this and they're not entitled to keep a job while exhibiting poor performance, but it sounds like this guy was barely getting any sleep. I hope he's doing better, since something wrong in his life was affecting those around him.",
            "\"...'her hole area' cannot send external emails.\"..   is it meant to be able to..?   🤔",
            "Was George narcoleptic? Vitamin D deficient? I need ANSWERS lol",
            "I am sure you were havening a great time when that was transferred back to you.",
            "Reminds me of one of the best days at my old job.  \n\nI answered a call with my name and asked what help was needed.  Note: I am Hispanic and speak English better than Spanish at this point having spent decades only speaking Spanish occasionally.  This is relevant.\n\n\"You don't sound like a (my name here).\"\n\nThat is strange, because that's my name and I sound like myself.  What can I help you with?\n\n\"Don't be a smart ass, you know what I meant.\"  \n\n\nThe rest of that story only got worse and it involved the entire IT team shuffling this jerk around for over an hour before we found out what he needed.",
            "Maybe the universe was looking out for you by making hard for George to get fired, so that he would be there for you in this moment when you needed him most.",
            "I woulda kept Georgey to funnel the shitty clients to.",
            "r/SexistRevenge",
            "Why did you fire George? He proved he was useful for *something*.",
            "> her hole area\n\n  \n\n\nThis does not mean what you think it means...",
            "I was a male supervisor in a call center when a gentlemen comes on my line and starts out with, \"I want the smartest white man in the room\". I reply \"certainly\" and immediately transfered him to a Georgian (think from Georgia, former USSR) with an accent to match. I mean, her spoke 5 languages and had 3 master's degrees, smartest man in my eyes!",
            "Here’s one where the employee made the dumba** assumption. I (32F at the time) am the woodworker in our family. Needed some lumber to finish a project I really needed to wrap up before my baby was born. So off we toddle to the lumberyard. Hubs kindly drops me at the store door while he parks so I don’t have to schlep my 8-month pregnant self across the parking lot. I enter the store and wait patiently in line to place my order. As the person in front of me leaves, I step up to the counter and the white haired, Buddha-bellied relic behind the counter looks right past me and says to the guy behind me “I can take you if you’re ready, Bill.”\n\nCue me, absolutely seething. I am not normally confrontational or vocal in situations like that. BUT I was 8 months pregnant, hormonal as all hell, and had just lost my father not two weeks earlier. So before Bill could get a word out I spotted my hubs walking up to me and said quite loudly “Apparently you need to handle this since I left my testicles in my other pants.” Turned and walked out, sat on a garden swing outside until hubs came out with the lumber. \n\nTurns out I was wrong about the testicles though, since my son was born the following month. 😂😂",
            "I mean, I get why you want George fired, but it might be worth it to keep him around for scenarios like this.",
            "Had a employee I was managing always falling asleep and going into lala land as well.  Turned out he stayed up really late most nights gaming.  We put him on plan and finally fired him because he just was too hooked on the gaming. \n\nTurns out he was still living with his mom.....at age 40.",
            "I have missed the chronicals of George!  Thank you for reminding me!",
            "Dont fire George... Keep him as a call sink",
            "I have a chuckle when people assume a person can't do a job because the assumed lack of penis, I just imagine that they believe the only way to fix their problems is with a penis and for some reason their own penis is inadequate.",
            "Sounds familiar. Worked IT help desk for a giant global company with 30,000 users. I'm not sure how having a penis would help me answer questions better, but I had zero Fs to give and would transfer these idiots immediately to my supervisor.",
            "This is so frustrating for me, not because I've ever had to deal with it, but because most of my adult life has been spent working for women as my managers and I have never once thought they were lacking in any way, shape, or form. In fact, the few times I've had men as managers, they are lacking in empathy and an ability, or lack of desire, to see from others perspectives.",
            "Sounds like George had narcolepsy.",
            "Sounds like George has some medical/personal issues he needed assistance with.",
            "I hate that an outage is not an outage until more customers call in...",
            "That ticket in the photo is pure pain. It just hurts to look at.",
            "Ah, Chronicles of George, true vintage early 2000s Internet.\n\nThe guy who made the site wrote an article about it on Ars Technica [ten years ago](https://arstechnica.com/features/2012/10/what-the-chronicles-of-george-can-teach-us-about-technical-support/).",
            "I don't know if anyone else linked it, but your story reminds me of another from a woman in tech, partly because of getting him to accept you as being competent:\n\nhttps://www.reddit.com/r/talesfromtechsupport/comments/54u55e/vladimir_vladimir_vladimir",
            "I don't get this at all. I'm 50(ish), I have a tertiary engineering related degree, ongoing professional development, I've been an operator, team lead, tech, supervisor, asst manager, blah, blah, blah. I'm trying to say I've been around,  done many things, and have a high level of expertise in my field. \n\nBUT if I need an expert in another field, why should I factor in your gender/gender id/sexuality/DNA heritage/accent/what have you. If YOU'RE an expert in your field then you know better than I do. It might be a translation issue of the concepts in my head to the concepts in yours, but you didn't do the hard yards for me to say 'you don't know about your own field because of what's in your pants'\n\nYou don't tell me how to operate a 600t horizontal press, I don't tell you how to hit line return UNLESS you ask since the keyboards aren't clear on some of those machines.",
            "What finally convinced them to fire George?",
            "Reminded me of a very similar issue I was involved with. \n\nI worked with Dan (his real name) around 15 years ago. Dan was ex-military and had a very high opinion of himself and his skills. From the perspective of someone who had actual skills, I was surprised he could tie his shoelaces but I digress. \n\nLong story short, while on a customer site, troubleshooting an issue and speaking to the customer contact he is said to have asked if he could speak to a man instead. Not sure how he thought that might work for him but the reaction was exactly what you might think it was.  \n\nI was the followup tech sent to site to fix the problem AND the relationship so my knowledge is quite reliable.",
            "Finally! A proper malicious compliance post! 👏👏",
            "Sweeeet.",
            "This story is delicious.",
            "I think that I may need a steady stream of George stories from you now, unless the only good one is him getting fired",
            "In my personal experience bigotry is a matter of prejudice exacerbated by confirmation bias. The great thing about confirmation bias is that one can also learn from mistakes by incorporating new data.",
            "i'm glad it ended nicely with the caller.",
            "yes! you want to be a d when you call, I'll be a d with you.",
            "Might be nice to keep George around so you can transfer all the difficult people to him…",
            "I love a happy ending.",
            "Sound like you were working with George costanza",
            "OMG I haven't thought about George in a while and all the \"havenings\" he had. At least he was consistent.",
            "Good on the caller for learning from his mistake.",
            "I LOVE CoG!",
            "Did they try forcing an unexpected reboot?",
            "Whenever I talk to IT I end up having to say something along the lines of \"assume I know what I'm doing and you don't need to over-explain everything. I don't have the same privileges you do so I can't do it myself.\"",
            "> https://www.chroniclesofgeorge.com/ \n\nI am havening a flashback!  Thanks for the bast from the past.",
            "This is George's special gift to the world, he will be 'that guy' wherever he goes...",
            "At least he got nicer and knows who the professional is.",
            ">Dude ended up asking for me a lot of the time after that\n\nLearning is fun. 🤣",
            "/r/sexistrevenge",
            "Sounds like George has narcolepsy",
            "I bet you were havening a great party on that day",
            "I find it incredibly annoying that even though I’m the most senior tech on the team, the administration bs always seems to fall to me.  Hey, you want to pay me $100k to clean up user accounts and create documentation, sure, but then I won’t have time to work on the enterprise-wide initiatives which require my expertise.",
            "Upvote for the Chronicles link.  I use \"havening a problem\" all the time and nobody gets the joke.  I saw those the first time in the late 90's.\n\nI was introduced to them by my favorite and most competent IT person.  A wonderful lady with a wickedly sarcastic and funny sense of humor.",
            "Haha. This is hilarious.",
            "Jfc. \n\nWhen I worked for a company that sells a very specific product that is used exclusively by contractors, I ran the tech support department. The amount t of times this exact thing happened to me (and.got.called sweetie) is ridiculous. \n\nGlad you got your laugh!",
            "you literally may have flipped an old man's worldview, don't underestimate the effect this kind of thing can have on a person haha, i'm just imagining his brain shattering and then he's your biggest fan",
            "I had this happen as well in an IT job. Employees always took the desks in the back trying to avoid customers that might walk in. One day, I happened to come in and all the back desks were full so I had to sit up front. A customer came in and when I offered to help him  he said he’d rather work with one of the guys that knew what they were doing and walked passed me to the back. Not only were my coworkers annoyed that they had to do their actual job, the joke was on the customer as well because I was the shift supervisor. I was the senior one in the office.",
            "I used to work tech support for a software company. The number of times a customer would demand to speak to my manager because they didn’t like/believe my answer was ridiculous. The best was if my manager had heard what I said and repeated it word for word to the customer. I asked him why they accepted it when he said it and he said it was because I was a young sounding woman in a tech role. If a person was being particularly rude, he would call them out for not believing me. This was in the early 00s. \n\nHe knew I was a good and knowledgeable worker and he would tell customers that all the time. The struggle is real.",
            "As a partner to a boyfriend with really bad dyslexia I recognise a lot of the spelling in the Chronicles of George. My partner tries really hard but some times you get stuff like \"havening\" and \"nocked off\" etc.",
            "I want to work where you work.",
            "Should have told him, \"I'm sorry, without a penis, I don't feel competent helping you and there are no other penises available. Please call back in a few hours. Click.\" \n\nAre you in the states? Can't believe people still act like that!",
            "I’m wondering if George has sleep apnea.",
            "So, just as an outsider looking in, what's the difference between \"Priority\" and \"Urgency\"?",
            "The wheels of justice grind slowly but powerfully fine. One hopes!",
            "I used to work with a guy who when some customer service female was not going to give him his desired results and he knew she was not would say, \" Hon , is there a MAN there that I can speak to?\"  The woman on the line would be pissed I'm sure but if he wasn't going to get what he wanted he didn't care.",
            "Multiple victories. You slapped the sexism right out of that customer AND got rid of the team's dead weight (well okay, you didn't say you were the one who did it, but since you were the one holding up all the bullsh*t he kept leaving behind you still deserve that credit anyway). This is why they make people like you leaders.",
            "Haha \"her hole area..\" 🤣",
            "As much as I love these stories I really hope this issue dies with the boomers.",
            "Sounds like George might suffer from a sleeping disorder.",
            "You were the only woman on your hole team?",
            "What made him think you were a woman?",
            "Is there a women in IT forum?  If not, why not?",
            "I find it so weird that it's 2022 and these sort of things still happen everywhere.",
            "I had a guy lose every boots device except one when he refused to listen to me for a simple job.  I was a woman and didn’t know anything about computers.  (I have a degree in Computer Engineering and several certificates in Networking and Other competencies, but I digress.). He called because he got an error message about NT.  (He left a disk in the drive.). I couldn’t get him escalated because the supervisors were all being petty, and taking bets on what would happen when he ran out of boot devices.  The guy refused to listen, refused to stop trying to do it himself.  At least the fart wasn’t cussing me out.",
            "I swear, people who write stories on Reddit are the only ones who say \"this will be important later\" more than leftist Youtubers..."
        ]
    },
    {
        "post_id": "wl71qs",
        "author": "Available-Capital476",
        "title": "If That's What You Really Want, Karen",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wl71qs/if_thats_what_you_really_want_karen/",
        "score": 13011,
        "num_comments": 328,
        "created_utc": 1660161299.0,
        "selftext": "Once upon a time I was working a seasonal retail job at a craft store chain. It is important to note that for the purposes of their sales, Lighted Tree Toppers, Lighted Decorations, String Lights, etc., were all separate categories.\n\nOn this fateful day, Lighted Tree Toppers were on sale for 30% off. The rest of the lighted decor on that aisle was not. The sales were VERY clearly marked and the sections designated clearly as well as the category printed on the package itself. It is even listed in the email that Karen was using to present her coupon.\n\nKaren approaches my register with her tree topper. The register recognizes the discounts and applies them automatically in most instances, this being no exception. The 30% applies itself.\n\n\"Your total will be $18.90\"\n\n Karen then presents her 20% off coupon. \n\n\"I'm sorry ma'am. This coupon is not applicable to sale items.\"\n\n\"Those aren't on sale. The lights aren't on sale this week.\"\n\nI show the copy of our sale bulletin on my counter. \"I apologize for the confusion ma'am. This actually falls under the tree topper category. You'll see here it's 30% off. I won't be able to apply the coupon, but you will be getting the already discounted sale price.\"\n\n\"I am telling you I don't want any sale! You are going to take my coupon!\"\n\nI should probably mention she was in at least once weekly, yelled about sales and coupons every single time, and then declared she was never coming back. Only to be back the following week to do the same.\n\n\"Ma'am. I would have to manually override the sale price and apply the coupon manually as well.\"\n\n\"Then do it! I'm telling you it is not on sale and I am using my coupon or I am reporting you!\"\n\n\"Yes ma'am. If you insist.\"\n\nI got visual confirmation from my supervisor in the way of a hand signal we used to mean, \"Go ahead.\" She was not too happy when I did exactly as she demanded... and her total came to $21.60\n\n\"You're stealing from me! I demand to speak to a manager! I'm never coming back here again\"\n\nMy shift supervisor had been on the next register over the whole time to combat the afternoon rush. That's how she managed to give the visual approval in the moment. She took great joy herself in telling Karen, \"You have the exact discounted price you demanded. You can pay it or leave. Oh you're never coming back? Do you promise?\" \n\nKaren paid her $21.60 with her head hung.\n\nShe was back next week.",
        "permalink": "/r/MaliciousCompliance/comments/wl71qs/if_thats_what_you_really_want_karen/",
        "comments": [
            "I had a similar job when I was 18. I had someone try to use a 30% off coupon on something that was already 70% off.",
            "> She was back next week.\n\nDid she bitch about something again?  Or had she learned her lesson?",
            "i hope you greeted her with \"Oh im sorry maam, when you said you were never coming back, was that a lie?\"",
            "I had a friend, my manager actually, who called our a customer like that. Christmas Eve, around 4pm & we’re trying to close so we can have an hour to tidy up & start preparing the sale for after Boxing Day. Guy starts yelling at her that he “just needs a card for his wife”\n\n“We’re closed”\n\n“No you’re not, there are still people in there!”\n\n“Nobody else in at this point, I’m sorry”\n\n“How dare you! My wife will be upset! I’m never coming here again”\n\n“It’s 4pm on Christmas Eve. The cards have been out for 2 months. And as for never coming back? I’ll see you again at 4pm on Valentine’s Day”\n\n\n🤣🤣 that’s the gist anyway, it was a long time ago now, not sure if exact wording!",
            "Is there a \"friendly\" retail way to call her out on always coming Back? If she's a regular, I would be petty enough to remember her name and always loudly announce how surprised I am to see her \"after last week\" while maintaining prolonged eye contact",
            "Had someone say \"I'm never coming back.\"  \n\n\n\"Thank you, it will make my last week here nice and quiet.\"  \n\n\nShe had no idea how to respond, so she just left.",
            "I worked in retail a few years and it always seems like the people who threaten to never come back are exactly the people you never, ever want to see again.",
            "Do you work at Michaels?",
            "They get the coupon. They save the coupon. They bring the coupon. They present the coupon. They will USE the coupon. Math doesn't matter.",
            "Math is hard.",
            "Her brain \"man she NEVER uses me!\" 😆",
            "Every single time I heard “I’m never coming back” I would always think “see you in two week”",
            "Math makes her head hurt!",
            "Unfortunately her type never learn, but I'm glad she paid for it this time. Good job OP",
            "I knew exactly where the story was going.\n\nI recently had a customer find a jacket on a very steeply discounted rack. It was very clear that it didn’t go there and that another customer likely just abandoned it there. When I explained it was on sale but not $4(!) they got b*tchy and told me that I should change the sale sign because it’s confusing. I reiterated “no, these items that go here are $4 so they sign is right, but THIS item doesn’t go here—it goes HERE,” and showed them the next rack over. They continued to belabor it and I eventually said “sorry for the confusion” and walked away. Eyes rolled so hard it caused an avalanche. Some people will try anything to swindle retail people.",
            "I have a customer like this too. Always bitches and wants the lowest price possible (heavy duty parts sales, asking for discounts is normal). I used to genuinely do my best to give him the lowest price I could give without taking heat for it. Until he stopped accepting that I couldn't go any lower, and said he'd never be back. Only to be back within a few days, doing the same song and dance.\n\nSo now I give him list price, and knock about 20% off (if you don't know, list price is usually about double the actual price). He still bitches and says he'll never be back, but at least my sales numbers look great.",
            "Former Hobby Lobby employee here....the holidays brought out the meanest and most entitled people, I swear. Ironic, since it's supposed to be a time of thankfulness and joy. I'm really glad your supervisor had your back. We had a CSM that simply didn't tolerate bad apple customers, and her support really kept us cashiers sane.",
            "\"only to be back the following week\"\n\nSame dude, same. Like, please Karen, please please please don't come back.",
            ">\"...I'm never coming back here again\"\n\nperhaps it's time for a 'ban'? she keeps breaking her word ;) - but worse, seems to be a repeat offender in the \"how much can I abuse the staff\" department too.",
            "remember when the 1/3 pounder didn't work because people thought it was smaller than a 1/4 pounder?",
            "Slight constructive criticism here: “I apologise for **your** confusion, ma’am”.\n\nBut it won’t help she’s nuts, nicely played op.",
            "This made me so happy. ☺️",
            "Was a manager at Joanns. I loved those moments. They fed my burnt-out soul.",
            "Sounds like Michaels.  Worked there for years as a manager and the stupidity of the public is real. Had this happen many times",
            "Karen: \"I'm never coming back here again\"\n\nEmployee:  \"So I guess that means we'll see you sometime next week, then?\"",
            "I worked at kids' clothing store through college, and I can't tell you how many times people INSISTED on paying more than the sale price because they had a coupon. I gave up ever trying to explain after this one woman who I tried to tell that using her coupon was a worse deal, and she just kept yelling at me. Finally, I said, \"Ok, do you want to pay $16 or do you want to pay $21?\" and she screamed in my face \"I WANT TO PAY $21!\" Sure, why not. \n\nShe did in fact pay $21.",
            "I can tell this is a Michael’s. I go there to restock on my embroidery floss and I always profusely apologize to the cashier because I feel so bad she has to ring up a big pile of each individual floss (But that 20% makes a big difference). I even try to go during times when it’s not busy so I don’t make a big line. I couldn’t imagine being so cruel to a cashier. The level of entitlement from some people is insane. And 9 times out of 10 it’s someone middle aged or old.",
            ">Oh you're never coming back? Do you promise?\n\nIt's a shame you can't enforce that somehow. Like the MC some time ago with a guy who complained to his bank that his excess interest charges on his credit card were not valid, and when they were shown to be valid, he said to remove them, or to close all of his accounts at the bank. The got him to repeat that very clearly on the recorded line; and since he had pulled this stunt half a dozen times already that year, they put him on hold and closed them all, and sent him a certified check for his $20,000 CD - minus 10% early withdrawal, the balance on his credit card account, and the excess interest charge, which amounted to about $30.",
            "Please tell me she really did say \"do you promise\" to the Karen!",
            "Priceless",
            ">She was back next week.\n\nThis would be funny, except for the fact that *SHE* was back the next week...",
            "Hobby Lobby?",
            "With such a big spender, it’s a wonder your manager never asked corporate for the okay to have her banned from the store.",
            "I bet that Karen has kids who hate her.",
            "In her head she hoped she's get the 20 percent off of the sale price.  Instead you took 30 percent coupon off and a plied a lower one.",
            ">she was back next week\n\n\"Welcome back! I'm glad to see your previous experience didn't detract from your opinion of our overall capabilities and that you decided not to 'never visit again'\"",
            "I really wish that customers who declare they are “never coming back” would keep their promise. They never do.",
            "Should have greeted her with a giant smile and and a loud “Welcome Back!!”",
            "Where do you work that someome would ned to utilize your store every week. The only place I can think of is a grocery store or gas station...........",
            "I wish more stores would trespass nuisance people like this.",
            "Math is hard for people. Don't play math games if you don't get it yourself.",
            "Why do people think that the lowly paid shift workers care if you come back?\n\nI mean, if you paid me my wage, I don't care if its a blockbuster with 1 customer a year.",
            "Oh this has to be HobLob. That store brings out the worst in some people.",
            "They always come back.",
            "Easier all around just to ban her from the store for being a nuisance to the workers.",
            "Was hoping to get 20% off of the already reduced price 😂 would have resulted in her getting a 44% discount if she had gotten you to fall for the trick she wanted to pull",
            "Ahh that type, my favourite way to deal with that is as long as it's under cost to give in and then ban them from the store for ever more. It's not something I've done often but some people are so toxic and cause my staff so many constant headaches that it's worth it. It only works with the absolute worst though as all the staff are unfortunately unable to forgot them. These are people I would recognize now 10 years later due to nightmares. \n\nDamn you Rigel and your quest to annoy 10,000 people to death talking about  random shit.",
            "I WANT 10% LESS DISCOUNT NOOOOOOOWWWWWWWUHHHHHH",
            "You know she doesn’t let anyone else help decorate the tree",
            "30% off is cheaper than 20% off? \n\nSay what?",
            "Wonder what would have happened at my wifes work. They resently got new 30% off stickers for meat, but there is no button on register yet for it so the cashiers are still using 50% button.",
            "So not so great at math huh..,",
            "\"Do you promise?\"\n\nLieing here quietly dieing of laughter",
            "A jabostick full of contraception and blowfish toxin please...",
            "Average Micheals employee",
            "Aq",
            "Kick dat bitch in da hoo haw",
            "False story, karma farming account",
            "Obviously this in the USA, you idiots tolerate this sort of shit so you deserve it every time it happens.",
            "[deleted]",
            "I wonder what goes on in the had of someone like this.",
            "Two dollars seventy feels like a petty amount to get strung out by",
            "Dude I’ve worked everywhere and the meanest customers I’ve ever had were at Michael’s lol",
            "My cheap, cheap heart hurts with this one lol",
            "I love a good story with \"on this fateful day.\"",
            "Oh, to have the free time and money to be a Karen. Spoiled brats the lot of them.",
            "She’s a crafty woman",
            "did she not learn arithmetic in primary school? /s",
            "That's a customer what needs the ban hammer",
            "Hahahaha, I needed a good laugh",
            "What Karen if she was smart what she should have done was to keep silent and leave the coupon in her purse then she would gotten the better deal but karens are not smart so she didn't get the best deal",
            "Yeah there's something wrong with her. Even if she couldn't do math, I would still say never mind and ask you to ring it up again under the sale price.",
            "I really dislike the craft shop coupon/sale stuff. There's one chain I just won't go to because of the massive checkout delays the coupon/sales and returns take. Seems like many others won't go there either, as they closed their nearest location. C'est la vie.",
            "The Karen got justice, justice that was served cold.",
            "That’s what these asshat Karens do. They throw a temper tantrum to get what they want, because they know most places will give in & give them whatever they want, to avoid a scene. \n\nAt least this time the manager was fully aware of what Karen was going, and that it would result in her paying more. It was nice they threw it in her face about not coming back.",
            "What. An. Idiot.\n\nHonestly, how do people that stupid even get out of bed in the morning? Does this woman *drive* to the store? By herself? Without killing anyone???",
            "This is why you should pay attention in algebra.",
            "oh, the absolute hell of dealing with Craft Ladies at Michaels. I still have nightmares about working there - no exaggeration. I will forever hate glitter, burlap, and chalkboard paint.",
            "Math illiteracy at its finest",
            "I had a guy demand I price match the cost of grapes. We were selling them for $1.79 the other store was selling them for $1.89. Yes sir, whatever you want. (Cost him more to price match than we were selling them for.)",
            "I had one lady (before Karen's were known as Karen's) demand I print her a duplicate receipt . Our system did not allow this, I was their trainer. I knew the system and was a supervisor. She needed a receipt for a mail in coupon reimbursement (didn't want to use the original? Probably to return it and still get the reimbursement$$)  (hated those deals, but we weren't responsible for them). I told her I could and did, make her a photocopy. She kept screaming at me and my poor register clerk that it's our fault and I'm lying etc etc. She kept saying she would never return..They always do. Oh she also said I would personally owe her the $$ if she didn't get it and I would be fired.",
            "I love how people like this always say “I’m never coming back” as if we’re gonna be like “omg I’m so sorry your business is way to valuable to us please come back!”"
        ]
    }
]