[
    {
        "post_id": "vi58i3",
        "author": "ultrasuperman1001",
        "title": "Stop resetting my password!!!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vi58i3/stop_resetting_my_password/",
        "score": 13007,
        "num_comments": 684,
        "created_utc": 1655904342.0,
        "selftext": "I'm in a senior roll at a service desk and like everywhere else if we see a ticket come in that has already been done or is a duplicate request we just cancel the tickets and move on with our day.\n\nWell we have this one user who is a vice president and they are the type of person who thinks the world revolves around them, so they would be the person to send in a ticket, then 5 minutes later send another ticket, and so on and so on until there is like a dozen tickets in the system.\n\nWell a few weeks ago we introduced a new password policy (18 characters, etc) with an additional policy that makes you change your password after a reset and you can't use a password you used before, and this was a big change considering our previous policy was no requirements. Most users figured it out pretty good and even the VP. Now this is where the Malicious Compliance comes in, with that new password policy it was also introduced that ALL tickets must be actioned before resolving them and you can guess who brought this change in...\n\nSo the VP went on vacation for a bit then came back and forgot their password and like normal they would send in a dozen or more tickets. Now in the 5 minutes or so between their tickets we would get 1-5 other tickets come in and it takes about 10 minutes to go through those. So my team and I went through every ticket like we are told to do and we were counting the number of times we reset the VP password because we knew this was going to come back on us.\n\nSo low and behold in the span of about an hour we reset their password 11 times. This is when our manager comes in and says \"I just got an email from the VP and they say you keep resetting their password\". My manager is a good guy and I remind him of the new ticket policy. He chuckles and heads back to his office and he forwards us an email with the subject \"STOP RESETTING MY PASSWORD!!!\"\n\nIn the email it says they had to change their password 12 times and they are running out of passwords they can think of and to stop resetting their password. I reply all to the email and say \"due to a new policy of tickets where we have to action each one before resolving it, we had to reset your password a number of times\".\n\nNo less than an hour later our department gets an email from the president that says \"we have reviewed one of your new ticket policies and believe this to not be the best use of your time so we are going to ask you recant this policy\". Needless to say we stopped the policy because it was dumb from the start and surprisingly the VP actually started sending fewer and fewer tickets.",
        "permalink": "/r/MaliciousCompliance/comments/vi58i3/stop_resetting_my_password/",
        "comments": [
            "A job well done. \n\nPeople who think the world revolves about them should go find a job replacing broken light bulbs. Just hold them above your head and the rest will go automatically.",
            "18 characters is insane… most users have trouble with 12. I can only imagine how many users write their passwords down on sticky notes with 18.",
            "Your VP actually sends tickets at all? wow",
            "I work in IT and oh my good fucking god do people not get that we don’t just sit on our asses doing nothing. \n\nAnd no Karen, you can wait for your 10 new hire accounts to be created because we clearly say 5-10 business days based on how many approvals they need, so you can’t have them the day you submitted the tickets even though they started yesterday. Fucking plan better and listen to our instructions we tell you every month on this.",
            "How did the VP not realize they could use the same exact password and just add a number to the end of it. With every reset they just increase the number by 1. I had a job that required us to reset our passwords every few weeks. This was my way to comply and remember the new password.",
            "Your password policy is stupid. Forcing frequent change with idiotic character requirements is less secure than not having those requirements.",
            ">Well a few weeks ago we introduced a new password policy (18 characters, etc) with an additional policy that makes you change your password after a reset and you can't use a password you used before\n\nI hate you with the fury of ten thousand suns...",
            "Eighteen characters is a damn stupid policy and will reduce overall security.",
            "The policy you were told to recant due to being a poor usage of time was the draconian password policy, right? Right? <padmememe.jpg>",
            "I really hope the password policy is 8 characters not 18 because that is cruel and unusual punishment",
            "Sounds like an overreaction to a horrible new policy. \n18 chars? \nConstant changing?\n\nThat's how you end up with extremely insecure passwords like 'passsssssssssw0rd!'",
            "I get the policy was dumb but I think it’s funny he changed the policy to say that was wrong because of course it wasn’t him being wrong for submitting so many tickets.",
            "[deleted]",
            "When my company went to super-long passwords with no other requirements my first new password was fuckthisstupidshit",
            "So the VP got the president to recant the policy because of them? Sounds like the world does revolve around the VP. We had so many black and white policies that people just ignored with the backing of our president too. Good thing we spent 5 weeks hashing out the policy so we could throw it away in 48 hours. I love helping people but I HATE IT work. I’ll never go back",
            "That is an absurd password policy, I'd have to write my password down on a post it note to remember that shit",
            "IT troubleshooting was easily the job I got frustrated in the most. People give you no information and expect a quick fix! Or straight up lie to you saying they tried xyz when we can clearly see that they did not!",
            "You are right, the password policy is inane. It goes against NIST guidelines.",
            "> Well a few weeks ago we introduced a new password policy (18 characters, etc) with an additional policy that makes you change your password after a reset and you can't use a password you used before, and this was a big change \n\nThis is the safest way for you to get people to write down their passwords on a piece of paper and stick it under their keyboards. Whatever idiot came up with this idea, clearly had no clue about the effects of password policies like this.",
            "When I first started my current job (IT Infrastructure), there was no expectations set for how long it would take the Help Desk to respond, so people would email the Help Desk with their problem and if they didn't get a call back in like 30 seconds they'd escalate it to their manager (or their manager's manager, or the next level, etc.) claiming that the Help Desk wasn't being responsive.  Eventually someone in IT management screwed up the courage to tell the rest of the organization to calm the F down and give the Help Desk a chance to respond before claiming that the sky was falling, and some reasonable expectations were set, but it made me very happy I no longer was on Help Desk duty by the time I started that job.\n\nOf course, I still had to deal with the fact that there was no downtime allowed on production servers (again, no expectations set) until eventually a server that we'd been asking to do maintenance on blew up and we could prove it was because we hadn't been able to do maintenance on it...",
            "Forced password expiration actually makes for weakened security and TMK it has been proven. Users just go with `password2` then 3, etc.",
            "This is prime material for /r/TalesFromTechSupport as well. You should repost ti there too",
            "18 characters? \n\nThis is a terrible fucking policy and whoever instituted it should be fired.",
            "This is the most insecure password policy ever. Do you like postits on monitors with passwords? This is how you get postits on monitors with passwords.",
            "18 characters?! Fuck me that’s too much man",
            "Please everyone just start using a password manager. EVERY one of my passwords meets the standards for complexity you can imagine. Example \"@okv$cSWe7wE7NI#q3Xvaa8l8n\" is one of my passwords I just changed (former password). I only need to remember my master password-manager password and it follows the XKCD rules mostly. Actually, it's 4 words which are all slightly misspelled. Resetting a password is easy, just request a new secure password from the manager and it get stored securely.\nI never have to remember more than one password again even though they get rotated frequently. It has completely removed \"password anxiety\" from my life forever.",
            "I like how the VP had two options:\n\n1. Stop spamming IT with tickets every 5 minutes\n2. Change a corporate policy\n\nAnd he chose option 2.",
            ">I'm in a senior roll\n\nI hope you're able to breathe in there! I've never had aged bread but maybe you could eat your way out",
            "18 characters?! Do you expect people to write them down, or do you expect them to use passwords like “correct horse battery staple” [which is insecure](https://www.schneier.com/blog/archives/2014/03/choosing_secure_1.html)?",
            "Ugh. I hate the whole every three days you have to think up new password with caps and lowercase and symbols and your left leg, and you can never reuse the same password BS.\n\nDo people actually think that increases security? How secure is it when 50% of people just have pa$$Word1 pa$$Word2 pa$$word3 pa$$word4 or 123June, 123March, 123April, or just write it on a sticky note because they have no fucking clue what password they're on anymore. \"Oh, gee, I can't break into Dave's computer anymore because of this new passw… wait, no, here is a book of passwords a hidden so stealthily in his desk drawer and labeled PASSWORD BOOK\"\n\nIt's a dumb policy.",
            "Sometimes training users can be painful, but no pain, no gain.",
            "PurplePeopleEater1!\n\n  \n\n\nPurplePeopleEater2!\n\n  \n\n\nPurplePeopleEater3!\n\n  \n\n\nPurplePeopleEater4!\n\n  \n\n\nHow hard is that?",
            "> surprisingly the VP actually started sending fewer and fewer tickets.  \n  \nSometimes a person needs a swift kick in the ass to realize they're being silly",
            "Had similar experiences at a IT Support Center for a F500 company I worked at for 10 (retired mgr now) .  Since VP's, etc; live in a world of spreadsheets, money, costs of doing business, profit, etc; it doesn't hurt for you to know the loaded cost of your tickets (Incidents, Tickets, Problems, etc.) at each level (for help desk, for next level, next level from there, etc ) and share that at judicious moments.  Sooo, 11 tickets x $150 a pop - is an expensive way to notify the help desk he needs a password reset, or the printer isn't printing, or whatever... One contact is usually enough, and the self-service portal (off you have one - if not, why not?!?!) is usually cheapest!",
            "Have to ask, what sort of roll?  Is it a kaiser roll, since that seems like it would be a senior type one.",
            "We had a lady who wanted us to come up and cable manger her cables, she thought they were messy (power and network that's all). Manager said we don't do that, I told here we don't provide that service that she could do it, it's not hard. She said \"I wear a dress or skirt\" with some indignance. I said \"On Friday we dress casual, you could wear jeans\".   \nShe went of like an atom bomb. Whole world revolved around her, but we did not cable manage her cables.",
            "18 characters!  I'd have to quit my job if I had to think of unique, 18 character passwords.",
            "So instead of telling the VP to stop spamming, they reverted the policy change? Wow...\n\nand when we got multiple times the same type of tickets (not even necessarily duplicates) from the same person we just wait for a certain amount of time so we can do multiple at once and don't have to keep switching... we also tell them to make one ticket a week or something like that...",
            "Good.\n\nNext step is to make sure your ticket system sends e-mails to the person making the ticket. An e-mail when it has been created. An e-mail when it has been resolved. Maybe another e-mail for every major change made to the ticket. May convince the VP not to spam their own inbox. :)",
            "Can someone explain why there are auch stringent password rules? I thought it had been proven that having overly strict password rules only makes them easier to guess. I’m sure there’s a good reason, but holy fuck it’s such a wind up when my passwords *and signatures* for all my work software needs to be reset each month, all with different requirements, and all having to be so different from the last 12 passwords that they can’t have more than 2 letters repeated in the same place.",
            "This is fantastic.\n\nI’ve before actually contacted the C level boss of a VP before and told them, if your employee keeps abusing my help I’m going to ban them from helpdesk support. Then they can contact you and you can put in tickets for them. \n\nFixed the shit real fast. VP didn’t make it much longer.\n\nObviously you have to have more juice than the VP to  pull it off. \n\nBut oh so satisfying.\n\nIn my Org the Tech exec (me) has more juice than anyone except the board. And at times the CEO or COO \n\nEveryone else though, watch out. I’ll create a new security protocol just to be petty, guess who gets logged out every 30 minutes and has to 2FA back in. \n\nYou fucko \n\nGuess who’s getting a computer update that forces reboot.\n\nYou fucko\n\nAnd guess who’s going to delete your ass from the system when you get canned.\n\nMe Fucko \n\nCause I’m petty. And spent to much time getting shit on , on my way up.",
            "Place where I worked installed biometric fingerprint scanners for log in on arrival at work.\n\nMy MC was to figure out how to change the display language to Russian. I also told others.\n\nBefore long every log in device was showing Cyrillic characters on screen. No one wanted to use the fingerprint log on because \"the Russkies had their prints!\"\n\nSystem repurposed to use a touchcard login. Fingerprints disabled.",
            "People who think having to change a password x-number of days, or that you can't use the previous 20 passwords think is secure, is not. And it is not longer the policy of Microsoft (this took a long time, and was like pulling teeth for cyber folks. \n\nAll it does is make people use worse passwords, and they're more likely to right them down.\n\n18 Characters is also kind of absurd. A 10 character minimum and 2FA is fine.\nEven defense networks like TS networks don't require that long of a password.",
            "You have just reduced the quality of your security posture. Mandatory password rotation encourages bad passwords.\nEven the guy who originally called for password rotation has issued a recall of that policy.",
            ">a few weeks ago we introduced a new password policy (18 characters, etc) with an additional policy that makes you change your password after a reset and you can't use a password you used before\n\nSo you basically introduced a policy that will ensure pretty much <b>everyone</b> will have to write their password on a post-it note and stick it to their monitor",
            "You still lose because you kept the asinine 18-character password.\n\nThat's an unnecessary amount of characters.\n\nYou need to educate whoever set that policy. 8 characters with mix-case, numbers, and specials is plenty.\n\nEdit: I work in IT too, and I think vacations need to be recanted from people. I swear every one forgets their password after taking vacations. How do these people remember to shut their ovens off?",
            "*role unless you are a bread product served as an accompaniment to a meal, then I'll see myself out.",
            "> senior roll\n\nRoll=tumble or turn over, etc., or as noted below, a bread product.\n\nRole=part or activity.\n\n> low and behold\n\n\"Low\" is less high.\n\n\"Lo\" is used to draw attention to an interesting or amazing event.",
            "What alternate dimension do you live in that a C-level actually bothered with putting a ticket in.",
            "umm did you wait for the VP to change their  password before you did the next reset?\n\nbecause if you just reset 11 times in a row....the VP just needs to reset his PW once. he never exhausted a pw.\n\nhighly suspecting this post",
            "But don’t you know who I am??!!",
            "So real quick, who can remember an 18 character password. Do you use a phrase instead and why? Unless i had random generated code on a device I used each time I would hate this.",
            "OP... you left me hanging... did you actually MC the \"stop resetting my password\"... like forever????",
            "18 characters? That's insane...",
            "Hilarious 😂 😆🤣 I needed a good laugh today. Thank you so much!",
            "You should get to physically flex in front of the whole office when you burn someone this good",
            "18 characters?",
            "Why would anyone send several tickets within minutes? It is counter productive. \n\nI could understand several posts asking for updates on the same ticket — although several posts within a span of minutes would be stupid — people do need some time to read, act upon and respond to the ticket. But multiple tickets do nothing for force unnecessary context switch.",
            "someone in a senior role who doesn't even know the word \"role\"?\n\njesus fuckin christ.",
            "> Well a few weeks ago we introduced a new password policy (18 characters\n\nInsane. This is terrible operational security. Users will just write passwords on post-its and stick them on their wall/desk.",
            "I used to be an admin and strong password policy enforcement was the bane of my existence. And it makes a lot of passwords invalid or superfluous.\n\nAfter implementing strong passwords, and seeing our tickets go through the roof (even with self-service password resets) I did a walk round audit of the trading floor. The place where billions of dollars are routinely flung about.\n\nI wasn't even trying. I wasn't searching but a walk around garnered me 32 passwords. Most were written on a postit note and stuck to a keyboard or monitor.\n\nNow *of course* you need a robust password system. But enforcing  strong passwords to the extent that users can't remember them is counterproductive.\n\nUse tokens. Or two-factor. Or any of the common authenticators. Or biometrics.\n\nJust don't implement strong passwords by itself or you're just opening your systems up for simple attacks\n\n\nCurrent admins? If you have strong passwords implemented have a walk around your userbase. Check postit notes. You're going to be horrified",
            "[Dilbert password policy](https://i.imgur.com/z8TzmJ6.gif)",
            "Would be more impressed by a person in a senior bun, but okay whatever.",
            "No requirement to 18 chars??? I call bs.",
            "I am sorry but that password policy is obnoxious, people are just going to be writing it down on posit notes which negates the whole point, hell even 8 character ones I gave to people that were keyboard mash ones people were doing it.   \n\n\nIf you need to up security that much get some form of MFA or get a proper Security Audit done and some better solution.",
            "\"senior **role**\"",
            "Making employees reset their password all the time is proven to be bad for security, it's more likely they'll write down their password of the week on a post it note because it's too hard to remember.",
            "If this kinda rule came to use in any service I have an account in, I would quit it immediately. I mean, one has the ”can’t use previous password”, and I can never remember what the password there was (my PC/phone can, haha!), but I hate it…",
            "A stupid ticket policy is exceeded by the stupidity of the VP",
            "[deleted]",
            "Nothing wrong with the policy, just the VP\n\n&#x200B;\n\nAnd 18 characters is not hard:  ElephantWalrusPenguin satisfies the requirement and is not hard to remember.",
            "Not going to read all the comments. r/talesfromtechsupport",
            "Seems that the policy change had the desired effect.",
            "I work at an IT desk and I can tell you that people like that go straight down the bottom of the priority list. Our CIO hates people like that too and supports our policy.",
            "Do you have SLAs? Like for a Prio 1 Ticket 1 Hour? i would resolve it than after 59 minutes before it escalates.",
            "When tickets are your metric and one guy submits enough work for the rest of the week...",
            "It's not surprising at all that she started sending fewer.\n\nShe got the new policy put in based on a non-issue that's entirely on her. She made the entire problem that her suggested policy was meant to solve, even though the solution was ignoring the duplicate issue tickets. Since her solution to her problem was causing her a separate problem, she learned. It's the classic workplace adage:\n\nIt's not going to be fixed unless you make it their problem.",
            "That is hilarious",
            "surprising they admitted it and didn't can your butt.",
            "A classic case of fixing the customer, then fixing the problem.",
            "I remember my helpdesk days.   \nWe had a user who had a fowl mouth, it was never directed at anyone (unless the mainframe is someone).   \nI told everyone to send the tickets to me and the lady and I had a great time chatting using the fnhimer. She sent an email to my manager saying \"That F\\*&\\^ng Guy is great\". We laughed at that for weeks. I was \"the F\\*&\\^ng guy\".",
            "i love you so much",
            "\"Huurrrr durrr I'm the vp, putting out yet ANOTHER great idea that will be soon shot down because I'm stupid\"\n\nLike really, all ideas should go through some sort of IT manager/head when these hairball ideas come through, and how it would not only affect the customer but the higher ups who would also apply to the new rules. I'm sure some of them are but then others are just *thrown out there* and IT is notified way too late of the new rule.",
            "This is the way.",
            "Management in HQ brought in this STUPID policy. We must ask for ID (Govt issued or building pass with photo ID on it) before resetting a password.\n\nNot a bad policy except WE HAD TO for everyone. Well, this policy make sense at HQ where you have 5000 people and 10 techs but all us techs in the satellite offices kicked up a big stink about it. Not sure about you, but my office with 200 employees, I know everyone on a first name basis and all the other techs were the same, we only had offices with 100-200 people and we knew them all.\n\nSo the manager of all the satellite offices pushed back on the policy a d they changed it to \"if your don't know them, ask for ID\"\n\nWe have a password reset portal now. But HQ has a habit of making national policies forgetting the other states exists."
        ]
    },
    {
        "post_id": "8g8a3t",
        "author": "tylersburden",
        "title": "\"Don't talk about anything non-related to work\" - Ok.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8g8a3t/dont_talk_about_anything_nonrelated_to_work_ok/",
        "score": 13004,
        "num_comments": 270,
        "created_utc": 1525179778.0,
        "selftext": "This happened a few years ago. I was the junior person in an office of mainly people older than me. As such, I was the geeky type person and the go-to guy for people to get advice on technical stuff. One day I found a great deal on laptops in Costco. They were selling some really nice Sony Vaios for a really cheap price. I bought one and would have bought more to sell on but I didn’t really have the cash. My irksome team leader overheard me telling this at lunchtime in the office and then immediately went to Costco and bought about 5 laptops and immediately put them up for sale on places like craigslist, Ebay and gumtree (a UK second hand selling site), all the while crowing that today’s youth liked to waste their money whilst the canny older generations saved their money for lucrative investments. \n\n\nHe sold one immediately for almost double the price he paid in Costco. This emboldened him to put the rest at 2.5 times the price he paid for in Costco. For about a week there was no update and then one day there was a cornucopia of excitement from where he sat. He had arranged to sell them all to someone in Amsterdam for the inflated asking price. He talked about what an absolute wheeler dealer he was and kept on telling people what profit he was making and what he was going to do with it.\n\n\nI told him that it was quite sketchy to ship goods privately abroad and it would be difficult to get any recourse if things went south even if it went to places in Western Europe. Of course, this was me “being jealous” of such a big shot and that I knew nothing and I should keep my mouth shut as I had no idea what I was talking about. I tried to warn him again but then I was called into the Assclown manager’s office about “prying” into other people’s financial affairs and that I was not to talk about anything that wasn’t work related with this guy, as he had obviously complained about me. I received a verbal warning and warned that if I did it again then I would receive a written warning despite my protestations that I was merely reacting to what this guy was saying and I was trying to help him.\n\n\nOf course the buyer at the last minute changed the shipping details to Lagos, Nigeria and the irksome team leader started to show everyone the paypal email confirmation that he had received of the money. I should have told him to log into paypal to check that the money had arrived and it wasn’t just a fake email. But I would have received a written warning. So I didn’t. He packs up the laptops and sends them airfreight to Lagos. \n\n\nNext day the teamleader wasn’t quite so full of bombast as he had been previously. It took a few other people to pry the story about how he had been completely ripped off and had received nothing via paypal. I was exerting a herculean effort to keep the tiniest of smirks from appearing on my face but my efforts were in vain. “YOU FUCKING KNEW WHY DIDN’T YOU TELL ME!” he screamed into my face. \n\n\nBut I carried on with my work and didn’t say a word. \n\n\n\nEdit: Quite a few questions in the comments so let me clear up a few. \n\n* Yes, it was a very toxic machismo workplace with lots of shouting around sales guys trying to outdo each other. \n* Assclown manager and Irksome Teamleader were very good personal friends. \n* Assclown manager was the local HR in effect. Everything had to go by him and the physical HR department was a tiny place very far away with only a few staff. \n* I had already made up my mind to leave well before this and was looking for new jobs. I didn't want to get fired even for spurious reasons without another job. \n* I didn't retort to Irksome at the end as no matter what I would have said he would have gotten Assclown to write me up. It was a small office and no one would have stood up for me as a witness as Irksome was the alpha male and most senior in the open plan area. \n* No, this isn't bullshit.  \n",
        "permalink": "/r/MaliciousCompliance/comments/8g8a3t/dont_talk_about_anything_nonrelated_to_work_ok/",
        "comments": [
            "Please tell me you just got your Nigerian friend to order them and then send them back to you ",
            "This story is amazing. It’s funny though how you get written up for giving him advice, but of course he can scream at you and somehow that’s okay. You should request that he not speak to you about anything not work related and crosspost this to r/pettyrevenge",
            "Now take the belligerence of a co-worker swearing in your face to Mr Asshat and demand a verbal warning for his creating an unprofessional atmosphere.  ",
            "\"Due to a complaint, I'm only allowed to speak with you about matters pertaining to this office.\"",
            "[deleted]",
            "I would have complained to the manager that this guy screamed in your face unprovoked, about something not work related, regarding personal financial affairs. See how that cherry on top tastes.",
            "\"I did, but you knew better... so go fuck yourself.\"",
            "You did tell him though...\n\nbeautiful story.",
            "\"Assclown manager told me not to.\"",
            "Good lord this is /r/JusticePorn material. Not only did that unprofessional shit head get his just deserts for scalping off those computers but he ALSO got scammed out of his money! Absolutely satisfying.",
            "You should have filed a complaint about that guy yelling at you over something not work related. ",
            "Please tell me you went to manager's office to complain that he swore at you because you would not engage with him on matters outside work.",
            "This is perfect",
            "This job sounds incredibly unprofessional. If anyone at my job talked like this I wouldn't be there much longer. One of the few benefits of working in cubeland is our culture is very polite and friendly. The rare weird bragging/complaining/rude dork usually doesn't stick around too long because he keeps getting passive aggressived out by us.",
            "The reason he knows you knew is because you did tell him! What a fucking ass hat. ",
            "Your co-worker sounds like a huge douche.  Who tells on a co-worker for giving advice or for talking to each other??  Who does that!?!?!?  Guy deserves all the bs coming his way it sounds like. ",
            "You should file a complaint against the guy. He’s discussing non-work matters and creating a hostile work environment.",
            "Shouldn't have said anything, just sent him a request from \"Amsterdam\" for more laptops at 3 times the price!",
            "He screamed in your face? Report him for assault.",
            "\"Sony Vaio\"\n\nHuh?\n\n\"A few years ago\"\n\nOh right.",
            "Fucking boomers complaining about millenials are the worst. Actually, older millenials pretending not to be a millenial, talking shit about millenials are worse. ",
            "Labtrops",
            "Should have complained about him trying to drag you in to his personal affairs.",
            ">“YOU FUCKING KNEW WHY DIDN’T YOU TELL ME!” he screamed into my face. \n\nSorry, I was informed by *BOSS* that I am not to talk with you about anything not work related- at your request.",
            "First, if you're at all in doubt about the story, go lurk in r/flipping and see the attempted scams that happen frequently.\n\nSecond, please lay off the assclown family. ",
            "Someone tried to pull this exact scheme on me, when I was selling a netbook on Craigslist. Out of state response, offered to pay full price plus shipping. Then suddenly had a business trip to Nigeria so send it there, here's the email saying you're getting paid. Spoofed email, but it looked very convincing if I hadn't already been suspicious.",
            "I would have laughed out loud in his face, then headed off to HR to make a complaint about him yelling at me, particularly if there were witnesses around that could back me up.  I'd have made it clear that, as my supervisor, I was concerned about repercussions due to the animosity he evidently felt towards me.  That way, any of the little things he did out of petty revenge, like giving you all the shit jobs, cutting your hours (if he's in charge of schedules), etc, could be used to further fuck him over.\n\nI have *zero* patience with people who reject my help, particularly to the point of yelling at me for offering it, or trying to get me in shit for doing so, and then giving me shit for not helping them when they fuck it up on their own.",
            "Suppose you can't just cancel the shipping before it's delivered. That'd be too easy ",
            "Machismo.  Mm hmm.",
            "> I didn't want to get fired even for spurious reasons without another job    \n   \nsmart play. \n    \ngood story",
            "Was it a Nigerian Prince that inherited millions of dollars?",
            "Wow, some dude got into your face and yelled at you after you tried to warn him and all you did was sit there and work? All after getting you reamed out because you were trying to fucking help?   \n  \nYou are a much stronger person than I. I would've knocked that fucker out without hesitation.",
            "Sounds like an unreleased episode of The Office...",
            "My girlfriend's old boss fell for a similar scam. He was buying a 2016 model car with like 2k miles on it from Craigslist for $5k. The car would be shipped to him from Alabama for free. That immediately threw up red flags, but what sealed the deal is that the seller wanted him to buy prepaid Visa cards and email them the numbers. \n\nShe told him, \"I'm not sure that is the best idea,\" but I told her to tell him it was a straight up scam, and to request another payment method that could be disputed. Of course, she had no idea what she was talking about, and it was a legit deal.\n\n2 weeks later she asks how the new car was, and guess who didn't want to talk about it?",
            "He gets an offer from Nigeria and is too stupid to check it out. That's some weaponized-grade dumb right there. ",
            "If he did scream that I’d march my happy ass to HR or whoever warned you and make a complaint about his no work-related and unprofessional outburst ",
            "[removed]",
            "Never answer the statement OP. Neverm",
            "fuck giving advice.",
            "But the real question is...is the Vaio actually a decent laptop? Because they look clean. ",
            "That’s fantastic ",
            "I don't understand why anyone's even allowed to ship things privately to Nigeria.",
            "Oh, fuck that guy. No matter what you did, you were going to be in trouble.",
            "Why do you get ratted on for the small shit and this guy can curse in your face? Is the workplace just full of spineless cowards mixed with idiots who always get their way?",
            "Always cute how Reddit thinks reporting things to HR makes them act on some universal law. \n\nHR is there to protect themselves. Everyone else is cannon fodder. ",
            "But that cunt was talking about shit not related to work you could have complained about him man lol.",
            "This isn't malicious compliance. You warned a guy, got reprimanded, and the guy went ahead and did it despite your warning.\n\nThis belongs on r/justiceporn not here.",
            "Did you out in a complaint?",
            "If it seems too good to be true...",
            "If this isn't 100% fake, which I assume it is, the coworker could have had that shipment rerouted back to him before it ever reached it's destination.\n\nHe would have been out a couple hundred bucks, but he'd still have his shit.",
            "What a twat. Hope the dude dies of ass cancer.",
            "Fuck him, that’s hysterical hahahahahahahaha!!",
            "[deleted]",
            "This absolutely, $100% definitely happened. Did people clap?",
            "\\* all the while crowing that today’s youth liked to waste their money whilst the canny older generations saved their money for lucrative investments. \\*\n\nProbably the same type of person that spends thousands of dollars at stuff like classic car auctions or spends thousands on mementos of youth \\- it's all a matter of perspective.",
            "“Toxic machismo” yeah man.... nothing about that story says or even hints at a machismo or a tough environment "
        ]
    },
    {
        "post_id": "itpt1a",
        "author": "Kookabanus",
        "title": "I used to work here, now solve your own problems.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/itpt1a/i_used_to_work_here_now_solve_your_own_problems/",
        "score": 13000,
        "num_comments": 263,
        "created_utc": 1600235122.0,
        "selftext": "&#x200B;\n\nA  little over a decade ago I worked for the local hardware outfit as the  storeman/stores manager. I took the job because it was local, paid ok  and was supposed to be relatively stress free.\n\nUnfortunately  the reality of it was that the assistant manager, Collin, was a  dickhead with an inferiority complex who had it in for me because I was  more qualified than he was (although I had absolutely no interest in  climbing the corporate ladder or taking his job), the job itself was  over tasked and understaffed and things were only getting busier as  there was a building boom happening in the area at the time.\n\nAs  a result I quickly ended up being run off my feet every day trying to  keep up with the constant influx of goods and outgoing orders. To make  matters worse the overall manager, John, decided to reassign my two  offsiders as delivery staff leaving me on my own. When I protested I was  told to \"solve my own problems\".\n\nI  somehow kept up with the workload, just, but knowing this was not going  to work in the long run I continued in my attempts to get more staff in  my area. Even just one offsider would have made a huge difference. I  tried reasoning with John saying \"what if I get sick or injured, How  will you get the orders done then?\" His solution was that he would have  some of the casual staff from the front retail area fill in if that  happened. I laughed in his face and suggested that they could not find  their own arses using both hands. Probably not the best way to handle  things. Once again I was told to \"solve my own problems\".\n\nOk  then, fine I will do just that. The situation continued becoming more  difficult each week. The incoming goods were increasing in volume to  keep up with demand (think two semi trailers per day) and as outgoing  orders were to take priority the incoming goods began piling up. Collin  decided to rear his ugly head and make a fuss about stock not being  checked in and stored on time and in one of our more robust discussions I  seriously considered rearranging his face and told him so. He decided  to go on an early lunch (run away) and hid from me in his office for the  rest of the week. That was the day I realized I need to get out of this  place.\n\nAs for solving my  problems, well obviously I was looking for a new job. I answered an Ad  for Correctional officers and attended a meeting for applicants, then  sat the psych tests, interviews and was finally accepted for the  training to begin in one month. Perfect timing.\n\nThe  next Monday I walked into Johns office and gave two weeks notice. John  was absolutely appalled that I would consider leaving such a \"good job\".  He tried offering me a raise of $1000 per year, I laughed and said my  starting pay was already $15000 more than I was getting here and walked  out.\n\nNow you would think a smart  manager would immediately take steps to cover my position and begin  training a replacement. Nope. Nothing happened for the next week and a  half until on my last Thursday John finally showed up with a  replacement, some entirely forgettable teenager who plainly had no  chance of keeping up. I trained him as best I could and the next day  said my goodbyes.\n\nTwo months later  I walked in as a customer, flush with my new job money. The place was  an utter mess! There was shit everywhere, unprocessed goods still in  sealed boxes, pallets of sheeting just dumped in the truck yard and no  one could find anything. The original guy I trained was no where to be  seen and four new young guys with haunted looking faces were madly  scrambling about trying to sort their shit out. No one knew where  anything was, where anything goes or even how to do a basic invoice  check. Total disaster which brought a warm glow to my evil black \"told  you so\" heart.\n\nUpon seeing me John  quickly pulled me aside and asked if I can help out and show the new  guys what to do. I took great pleasure in reminding him that I had  repeatedly warned him this could happen and than not only did I no  longer work here but that he will have to, and I quote, \"solve your own  problems\".",
        "permalink": "/r/MaliciousCompliance/comments/itpt1a/i_used_to_work_here_now_solve_your_own_problems/",
        "comments": [
            "That wound will never fully heal. He will carry it the rest of his life.",
            "Mmmm the last line got me",
            "This story reminds me when I quit as an IT and helpdesk manager for a large company with 450 computers and 22 agencies. All because of the shitty boss I had,  that shouted everybody no matter how hard and good we worked.    Then two months later I came across to one manager who told me everybody misses me badly, the guy who replaced me was an absolute jerk, incompetent , solved nothing and hides in his office.  Soon later my outsourcing company lost this large account, because nobody could fit my position after I left.  This made me smile wide.",
            "I mean if he wants to hire you on as a private contractor at 20 times your original rate...",
            "This was like my last IT job, which was actually my first IT job. I'll hand it to the guy, he took a risk on me and then... let me train myself. Ok, that's fine. Whatever. I googled my way to being a halfway competent tech. But he'd keep me in the office answering calls and would need me to dictate whether he thought I'd be able to handle it or not, which of course almost all the time was \"No, you're years away from that.\" So worked piled up on the two field techs we had. Oh, yeah, this company was 5 people. That's it. Our entire company could take a trip together in a mildly large SUV.\n\nI got tired of answering calls, having to check in with him on whether or not I could do the call, and having him pile it on the techs who hate me now for \"not doing anything\". One of the techs was the owner's kid, too. Smart guy, he bailed on the company for greener pastures. Now we're down to 4 people. I started looking around elsewhere and found my current job, so I applied thinking there'd be no way they'll take me. They took me, immediately. I put in my notice with Grumpy Gus and he lost it. Was devastated because he thought the other field tech and I would \"take over the company\" when he retired in \"a few short years\". Problem was, the company was bleeding out money, losing clients to more modern MSP's (like my current company) and the business was *tanking*. He wanted to retire and have it employee-owned, meaning we'd pay him for the business when he retired through profits of the business, meaning there is ZERO chance we'd see a profit on it for years.\n\nSo he started sending me out on field calls in my last two weeks. \"Finally,\" I thought. But yeah, there were some times I got stuck on an issue and I had to call the other field tech for help. I was new, after all, and hadn't received any actual training despite almost a year of being told I would. Boss calls me and asks why I'm calling the other tech while he's busy, and to just ask Boss for help. I do, and he gives me incredibly vague, intentionally bad information. \"What is the computer plugged into?\" \"Cat5e plugged into a Cat5e wall port.\" \"THERE IS NO WAY YOU CAN KNOW THAT, YOU'RE TOO NEW.\" \"Uh, the cable says Cat5e, the wall port says Cat5e.\" \"But what is the computer *plugged in to?*\" \"What do you mean?\" \"Oh, you'd better not be this stupid for your new job. They'll fire you in a minute.\"\n\nSo I walked out right then and there. I was very respectful to the clients and advised them that they will need to call the office and a new tech will be able to come out and fix the issue. Obviously I was not going to get support on any calls I went on and he'd send me on calls he knew were over my head. So I wasn't having any of it. I called my new place, told them what was happening and asked if I could start the next day. They happily agreed and almost a year later, I've never been happier at a job. Ever. My previous place? It's now closed permanently. He cut his losses after I quit and the office manager quit (she emailed me and told me he threw the nastiest temper tantrum when I left and destroyed about $3,000 worth of computers he was trying to sell.)\n\nNow I have plenty of support on every ticket, I work from home every day, we use more modern methods to manage networks and systems, and they're paying for a boatload of certs for me without any contract dictating a length of employment required afterward. I actually have health insurance now, I'm getting paid far more than I was before, and life is pretty good inside this home. Outside is still a dumpster fire but inside is good.",
            "\"Solve your own problems\" indeed. I love it. \n\nIn Afrikaans we have a saying \"Wie nie wil hoor nie, moet maar voel\" - he/she who does not want to listen, will get what he/she deserve.",
            "Aha. I, too, worked for one of those. His go-to line was \"do your deal\". He told me to do my deal for almost a decade, while I juggled an impossible workload, and managed varying degrees of burnout, all the while earning him fat bonuses because my department ran so lean (I believe he got himself a new Harley with the last one). He also sobbed like a little girl when I gave notice, and asked \"aren't we friends\".\n\n That's how you treat your friends? Holy shit...",
            "A job as a correctional officer isn't something that sounds very low-stress to me. That tells me your job in the hardware store must have been absolute hell.",
            "That's when you explain that your consultant rates are much higher than  your pay was.",
            "I was working as a hotel night auditor when I got pregnant with my oldest. I’d been having complications for awhile and my doctor told me if my blood pressure was t down at my next appointment in two weeks I was being out in long term sick leave. On my way home, I stopped in at work to tell my boss exactly that. Fortunately, I took the day shift desk clerk (also a friend of mine) with me as a witness to this meeting, because two weeks later, when I went in to give the boss my documentation, she said “why didn’t you tell me earlier? We need you to train your replacement!” She shut up when I asked her if she’d like me to go get my friend who would verify that I did, indeed, tell her two weeks earlier that I’d likely be written off. \n\nI miss that job (this was over 16 years ago now, as said baby is now 16) but I most certainly do not miss that particular boss.",
            "I saw that end coming, and it warmed my heart when it did!",
            "I love this. I’ve been in this situation in multiple jobs. The best one was when I was the event manager/sales manager/social media manager/floor manager for a restaurant and my boss would constantly go above my head to say I was lazy because he could never see me doing anything or I was on social media (aka my job). The higher ups could never understand because from their end I was doing what was expected of me. It wasn’t until I left and came back for dinner a month or so later that I finally got a “thank you” and people who said how much they missed me and had no idea how much I had been doing while I was there. The place is closed now.",
            "And John, like every other manager, did not learn a single lesson",
            "[deleted]",
            "Love a good “told you so” story. Why are people just too stubborn to listen? I’m also very surprised that most managers don’t know ANYTHING about what their team is doing. I understand that you’re hiring the right people for the job but shouldn’t you know at least a little about how the day to day works?",
            ">my  starting pay was already $15000 more \n\ntypo, or true? :)",
            "[deleted]",
            "i'm a big fan of the \"solve your problems... but don't use staff, time, resources, money, or management authority to do it, because you can't have those.\"\n\nhad a job that did that to me once. put me in a de-facto management position \"temporarily\" until a new store manager could be found, but wouldn't give me any of the authority necessary to actually run the store, neglected to find a manager for months, and then blamed me when things went to shit.\n\neveryone who worked in the store quit on the same phone call. i think i began it with, \"well, it's your problem now, and you have two weeks to solve it, because i quit.\"",
            "I don't understand people who refuse to help their employees who RUN THE BUSINESS.\n\nGenerally, if I LIKE the job, I might get sick for 2-3 days, and maybe that might make a smart person learn.\n\nWhat **I** learned was that I don't quit jobs, I quit managers.  A shitty manager will make a fantastic job stink and not worth fighting for.",
            "This reminds me of when I handed my 2 week notice in for Best Buy. My manager looked shocked .... like who would ever want to leave this $7.52 an hour job ?!",
            "He made mistakes so that the only outcome would be failure. \n\nGlad you could use his own words against him.",
            "I want to see the John goddamn face when you told him",
            "No respect until after you leave.",
            "I suppose you could offer to come in on Saturday and run training at $75/hr 8 hour minimum check at the door when you arrive and \nDo the seminar monthly",
            "Awesome post. Nice work. \n\nI spent my youth in a hardware store and lumber yard. \n\nWhat is an offsider?",
            "Ah. It's always nice to read stories with this \"I was the only competent one and the place feel apart after I left\" theme. Reminds me that there's some justice in the world.",
            "John sounds like the type who doesn't do anything but thinks he's the most important guy in the organization. \n\nGood managers realize the people doing the work are the important ones and that they're facilitators.",
            "A blue hardware store in a Mountain suburb. I also used to work there....",
            "I saw the last line of this post coming a mile away, and I was giddy with excitement just waiting for it",
            "That ending \\*chef's kissy face\\* Being able to pull something off like that has to be in the top 10 things of anybody's life...",
            "What a wonderful morning MC! It's amazing that so many companies, big & small,  don't realize how important a few working individuals are. They make the mistake of thinking that only mangers with offices are the only valuable staff & everyone else is easily replaceable.",
            "r/badbosses",
            "I love a story that comes full circle.",
            "This was gold. I'd have loved to have seen the look on his face when you used his line on him 🤣🤣🤣",
            " The response should turn into \"You need help with a password reset? I can absolutely help you get in touch with corporate help desk to get that taken care of. Hold on one minute while I transfer you.\"",
            "Nothing like i told you so in his face like that, I would continue by ordering the most bizarre and occult thing in the store to buy it....wait 15 mins till they couldn't find it and carry on asking for such occult things for one hour or so, then walk away with nothing shaking my head",
            "Oh, this is a good one! Love it. Petty Level 10/10",
            "I loved this",
            "I mean it's nice payback, but wouldn't you be worried about getting attacked as a correctional officer?",
            "Truly a tale of middle management when the manager has sweet fuck all idea of how operations that they're in charge of function.",
            "Definitely worth it for the compliance.\n\nShould have added insult to injury and offered to be hired on as a part time consultant contractor to train his people.\n\nAt the reasonable wage of $150/hour.",
            "when you said there was shit everywhere for a second i thought you meant it literally. that would have been a funnier mess to walk into",
            "You were probably getting paid shit or this was a long ass time ago because COs don't make much money.",
            "Omg the fact that you got the perfect \"fuck you\" in the end. This pleases me so much lol.",
            "Best anecdote I've read in here. Brilliant patter. Haunted looking teenagers...😁. Superb....",
            "I bet he thinks about your last words to him to this day 😂",
            "Did your penchant for considering \"rearranging his face\" over a work disagreement help you with your application as a correctional officer?\n\nNot a good look.",
            "\"I seriously considered rearranging his face\"\n\n\"I applied to be a correctional officer\"\n\nYup this very mentally stable guys seems an ideal candidate for correctional work",
            "Got so mad you threatened to punch your boss in the face.  And are now a correctional officer..... Seems on brand.",
            "Corrections? Dude, you traded one hell hole fore another.",
            "Can I get in a time machine so I can watch that happen?",
            "Ahhh sweet justice.",
            "Stay humble in your victory! Congrats on the new job!",
            "\"You want me to solve my own problems?   I have a solution.   The solution is I need help.\"  \n\nThose guys were asshats.",
            "John or Collin?",
            "This was extremely satisfying to read.",
            "“Shit bro your back is pretty tight, hold on I got you”",
            "Mate the fact that your repeated go-to thought was a desire to physically fight your boss because you couldn’t solve things with words make me SUPER CONCERNED you’re now going to be a corrections officer. It sounds like you’re a violent person with no business having that kind of power over people.",
            "Sure. 100$ / hour",
            "If you can't get all the work they give you done in the time they're paying you to do it, that sounds like *their* problem.",
            "1) Terrible at their job,\n2) smartest guy in the room\n3) threatens co worker with violence\n4) becomes correctional officer \n\n^wonderful",
            "[deleted]",
            "> Makes physical threats against boss\n\n> Applies to be a corrections officer\n\n> Passes\n\nSounds about right.",
            "I dunno, you sound like a bit of a jerk. I'd never threaten to \"rearrange someone's face\" no matter how they behave at work. But it's nice that OP has this little fantasy where they won.",
            "I might have offered to help out as a contractor for 3 times your current salary, the one that was 15000 more at the entry level.",
            "You should cross post this to r/idontworkhere\n\nI'm very glad you stuck to your guns, managers like that are worth their weight in air.",
            "Great story, well written.",
            "Man I love reading shit like this, this is the good stuff.",
            "[deleted]",
            "Bruh, you are not part of corporate if you work in the store lmao",
            "Haha this was brilliant",
            "Poetic ending ♥️",
            "I gotta say, “seriously considered rearranging his face” had me cackling. :D\n\nGreat story!",
            "Love it. life comes a full circle",
            "Ngl, I found myself touching myself at the second to last paragraph.",
            "I'm sorry for the new guys :D",
            "Very well written, a very satisfying story to read!",
            "BooooYa 👏👏👏👏👏👏👏👏",
            "\\*slow clap\\*",
            "Nice",
            "That warmed the cold hearth within my heart. Well played indeed."
        ]
    },
    {
        "post_id": "1601h6e",
        "author": "ActualMis",
        "title": "Same punishment for being 5 minutes late as being 3 hours late? Sure, no problem!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1601h6e/same_punishment_for_being_5_minutes_late_as_being/",
        "score": 12986,
        "num_comments": 484,
        "created_utc": 1692882430.0,
        "selftext": "So I'm working for a low-level corporation, about 450 employees. I've been there for 5 years and have risen to the top of my department's productivity levels. I mention this as it does pertain to the story. Management had a policy that latecomers would be penalized, but that lateness could be excused under some circumstances.\n\nI was good at my job, and I actually loved doing it, so I was more or less a dream employee. I always showed up to work 20-30 minutes early because I liked to sit in the lunchroom and prepare for my day. Management knew I was almost always early, so if I was late from time to time (and such instances were rare) they'd let it slide, as there was always a valid reason.\n\nNow for some other employees this latitude wasn't applied. Chronically late employees would get written up and not have their constant lateness excused. They'd complain, of course, but management was firm. They ran an actual meritocracy, where more-productive employees would experience preferential treatment.\n\nThen the business gets sold and we get new management. An international corp only interested in buying us up, stripping us down and selling off the company. Of course, they denied this constantly, but the fact that over the next 2 years they stripped us down and sold off the company proved they were lying.\n\nNew management comes in and has to make a bunch of idiotic changes. One of those changes is that no reasons for being late are accepted, regardless of validity. Anyone 5+ minutes late for work would be written up. So at the team meeting where this is explained, I asked, \"So if someone is 5 minutes late, and someone else is 3 hours late, the punishment is the same?\" And they said yes.\n\nFrom that day on, I stopped coming in early. I'd still head to work at my usual time, but I sat in a local coffee shop instead of my work's lunchroom. This meant that my work missed out because in the past I would often help out by answering questions, even start work early if needed. Because I loved my job, and the old management were wonderful bosses.\n\nNo more of that under new management. In fact, if something happened (like unexpectedly bad traffic) and I was going to end up being a few minutes late, I'd just say \"fuck it\". If being 3 hours late is the same punishment as 5 minutes late, I'd just decide to come in later. I'd call work to tell them I was delayed, then go out and have a leisurely meal in a restaurant, or run some personal errands, go shopping, even see a movie, etc.\n\nDepending on my mood, and how shitty the new management had been lately, what would have been, say, a 7-minute lateness on my part would end up seeing me roll in 3 hours late. Sure, it cost me a few bucks, but I made almost as much in bonuses than I did in hourly salary, so missing out on a few hours here and there didn't bother me too much.\n\nI'd come in 3 or 4 hours late and my new bosses would be fuming. Nothing they could do though but write me up for the basic tardy, same as they would have if I was 5 minutes late.",
        "permalink": "/r/MaliciousCompliance/comments/1601h6e/same_punishment_for_being_5_minutes_late_as_being/",
        "comments": [
            "I always love hearing about management that's not familiar with the classics.\n\n\"What's the punishment for arriving late?\"\n\"Death\"\n\"What's the punishment for rebellion?\"\n\"Death\"\n\"Gentlemen, we are LATE.\"\nAnd that's how the rebellion started.",
            "I had a job if you were 5 mins late or 59 mins late it was the same thing. Anytime I knew I would go over I would take my time and go somewhere. Come in at 59 mins late. But being so late they would have to shift and make arrangements to cover my job it could not go unattended for so long.  The supervisor asked why I was so late. Told them traffic. They were like for 1 hour? Nope I could have been here 50 mins ago but it's the same as 59 mins and there is this one store I always wanted to check out so I stopped by there first. Boy they were not happy but couldn't do anything about it.",
            "My buddy worked for customer service at a big ISP by us. If you were late, you would get written up, too many in a time frame would be penalties, less days, fired, etc. However, for reasons unknown, NO penalty if you call out same day. \n\nSo we would randomly get a call from him to hang out because if he got stuck in any traffic and risked being a minute late, he would call out and hang out. \n1 less person all day vs a few minutes... The joys of manglement.",
            "I had a job where you could get 12 points in a years time before you got fired.   Calling off without 24 hours notice was 1 point. Family emergency? Thats 1 point. No call no show was 1 point.  So rather than a quick heads up that you won't be in the night before people just didn't show up, because whats the point of calling off?",
            "Yeah, a similar rule was implemented in my school, it did not matter if you were 5 minutes late or 2 hours, you still got a hour detention.\n\nSo it got to the point where if I see I will be 2 minutes late, I slow down, go drink a coffee, go to the park and then come in 1-2 hours late.",
            "The first time I was working in an office I was on salary. My boss said that she didn't care when I showed up but I should try to be there at least by 10:30 in case I need to talk to other people.\n\nSince then I have not tolerated any jobs that demand a specific start time and yet still expect me to accept the salary. If I'm working for a wages, then sure I'll clock in exactly at 9:00 a.m. or whatever you want. But if I'm expected to work overtime with no additional pay, then I expect to show up late with no loss of pay either.",
            "Yup, worked in a factory for awhile. Being late was the same as not being there that day. (1 point, I forget how many you could get before a official write up). One time was was literally going to be a minute late. (Was in the parking lot and everything). Just turned around and went home, as did anyone else who could afford to.",
            "I am so goddamn happy that in my current job i don't have fixed hours. No more having to call in for 3 minutes late because traffic gonna traffic.",
            "I had a job like that at a call center if you were more than 3 minutes late it was considered missing work and they would mark you as a no show. So guess who would never show when I was more than three minutes late. Sometimes I would be late cause parking was full and had to park further away walk in to clock in, notice I was more than three minutes and walk out and not come back. Boss would be so mad seeing me but hey your gonna mark me as a no call no show anyways",
            "I love the idea of a leisurely pace for a 7 minute delay!\n \n I worked at a place where it was better to take the day off instead of being tardy.\n\n Never understood why because it put the company in a bad position trying to find my replacement for the day rather that wait for me to come in 10 minutes later.",
            "My workplace has a \"points\" policy for attendance. 1 point per 4 hours. Every shift is 8 hours so missing an entire day is 2 points. 1 minute is the same as 4 hours.\n\nThere have been many times I've heard of coworkers pulling into the parking lot, knowing they can't walk into the building and punch in on time and instead just go back home for 3.5 hours. \n\nAs a third shifter, when people would over sleep they knew they would get the point so might as well get another 3 hours of sleep. Stupid system to have no leeway.",
            "> write me up for the basic tardy\n\nIt's amazing how many Redditors' jobs sound so similar to high school.",
            "Did similar myself. Got caught by a train, arrived <10 min late, tried to get it excused before punching in. They were stickers for the 5 min rule, but I was a solid employee who had minimal absences and almost no lates for years. They wouldn’t give me the ok, so I turned around and went home. Came back, punched in 2 min under the half way point of my shift where the penalty would have gone up after, but at that point was the same as my 10 min. So I lost a little pay, they lost 3.5 hours of staffing, oops.",
            "Similar thing happened to me working at a call center, what schedule you got was partially based on attendance. Being late and absent were equally waited against your score. Similarly I was always there 10 to 15 minutes early, the late policy was 15 minutes and under were at manager's discretion. Showed up 5 minutes late one day manager said he was going to write me up, I explained how I am always early but he wouldn't budge. Told him just write me up for the full day and walked I went home.",
            "I used to stay back for 20 minutes at my retail job (as a stupid naive teenager who idiotically thought that hard work would be rewarded) to make sure my department was perfectly tidy as well as helping finish work other staff didn't get done, and then one day I was docked 15 minutes pay for being 2 minutes late because of a crash on the freeway and then again about 3 months later for being 3 minutes late because my first train was cancelled (as I was coming straight from uni that day). When I questioned it the store manager insisted that pay was done in 15 minute increments so there was \"nothing he could do\".\n\nFrom then on if I got to work and saw that the sign-on machine said it was 2 minutes past my start time, I'd sit on the bench out the back and play on my Nintendo DS til quarter past. Manager saw me once and threw a tantrum demanding I get out onto the sales floor and start working and I just said that since I wasn't going to get paid until 5.15, I wasn't going start working til 5.15. He threatened to write me up about it and I was like \"Yes, I'm sure the union will love it when I tell them about you writing me up for not working for free.\"\n\nThat shut him up. Not only that, but I also made sure that I left right on the dot when my shift finished. My department manager noticed that some areas of my department weren't being recovered as thoroughly as they used to and that there were a lot of returns from other areas being left in the fitting rooms (when previously I would have done them before I went home) and asked why I \"wasn't going above and beyond anymore\" so I just asked \"Why would I keep putting in more effort? Not only did I never get any recognition or reward for it, I was getting penalised for things that weren't even my fault. I'll do what I get paid to do from now on but that's it.\" She wasn't happy but there wasn't anything she could do about it (and sadly even me doing my bare minimum was still more than most of the other staff in that department did).",
            "This was me in highschool. Late to first period? In-school suspension. Arrive on time for second period? Nothing.",
            "I headed into work an hour early once. As it happened I was on the highway and a 4’ L beam that was in the highway was hit by a semi just to my left, and came right for me. I maneuvered away & it clipped my back tire and rim. If I’d been a second faster with my reflexes would have missed it completely. Instant flat. Call work let them know I’m delayed. I get in 10-15 minutes late. I’m told I can take a comp day & go home or get a tardy. (I also was someone who was always early, 20 minimum ) This taught me a valuable lesson about going in early, had I not on this day that L beam would not have crossed my path. That manager wound up being one of my worst, just petty.",
            "I get the same punishment for the following reasons:\n\n- being late past 10 mins\n\n- leaving early (even if covering shift, or puking)(5 mins or 5 hrs, the same)\n\n- being absent with or without a doctor's note or hospital note (ER)\n\n- being absent even when pto covers it (and we are forced to use accumulated pto for the absence, it still is a mark)\n\n- no call, no-shows\n\n\nThey're all documented/treated the same and used against us towards termination/written warnings. Personally I don't know what an \"excused absense\" even is anymore.",
            "I worked at a place that decided to try to combat chronic tardiness by saying if you're late, it counts as an unscheduled out for the entire day...... you can imagine how that went....",
            "I love how this story is just repeated _daily_ in a different scenario (school vs. work). (No offense to OP, that wasn't sarcasm!) This is the problem with zero tolerance / one-size-fits-none approaches to punishment. \n\nAt least in this case, manglement had two brain cells to rub together _before_ the buy-out.\n\nAnd yeah, I've been bought out a few times and they _always_ claim it won't change. They always lie.",
            "My brother worked for a union.   At exactly 7am, they locked the shop doors.  To get into the building they had to unlock the door and let you in.  Then the shop steward would write you up.  I asked what happened if you were written up?  The answer:  After being written up three time you were sent home for three days WITH PAY!!!    I just looked at him and shook my head.",
            "I don't know how your brain let you do this, but I'm glad it did. Lol, I would have felt guilty the entire time, which sucks.",
            "We were salaried exempt, but still had to track time so it could be billed to projects.  They started pushing us to attend meetings for all our projects “to stay in the loop”.  We figured out that if we dialed into a status mtg for project \nA and worked on project B, it was a compliance issue if we **didn’t** log time against both.   Suddenly our time cards showed 50-65 hour weeks.  No paid overtime but managers became very generous with informal comp time. \n\nAnother benefit of being a so-called knowledge worker:  if I dial in to a meeting while grocery shopping, it’s work.",
            "HR people reading this thread: never make a rule that discourages people trying to do the right thing.",
            "Every job I’ve ever had has the same policy. Anything from 1 minute to 4 hours is the same. Younger guys would notice this and say “so if it’s the same, why not skip half the day?”. My response is always that the punishment is the same, but the paycheck is where you’re really hit.",
            "All these years and no manager has ever decided to just have the employee make up the time after hours. Come in at 9:05; work until 5:05. Create a 2hr time limit for that and be done. Any longer than that, take PTO time. It's simple. You just need the 8 hours.",
            "The hospital my wife works at got bought and they combined sick days+PTO into 1 pool, and call-outs were by “occurrence.” 5 or more in a rolling year was a write-up. Sick 5 days: 1 occurrence. Sick on Monday, go to work Tuesday, call out Wednesday: 2 occurrence. They also stopped letting you sell unused PTO and capped it at 30 days. With all the COVID OT, she had like 60 days saved up, so when the fiscal was almost up, she’d just call out for a week. Other people would just call out the same days their scheduled PTO was denied. The hospital was bound by HIPPA, so you just said “I’m calling out” and they can’t even ask why.",
            "I lmao'd internally when i read they were fuming . Great mc",
            "I had a coworker decide to come in late and work a partial shift just to be a company man. He got a write-up for being late and one for leaving early. He could have just gotten one had he not shown up at all. Friend tried to convince the managers why that was a bad idea, they didn't get it. Most companies also don't double ding you.\n\nEdit: You got a full write-up if you were 1 second late. We would all be standing around waiting for 8am. If you heard the door after that, that person would be taken into the office immediately. I always called out if I were going to 1 second late.",
            "That's not just a footgun on management's part, but a foot FULL AUTOMATIC gun with an infinite belt.",
            "Everybody should work on building up FU money if possible; company gets sold, excellent former manager moves on and new manager is a sadist, etcetera.",
            "I worked in a place similar. They had a strict 3 strikes (late occurrences) and you’re fired. Not three in a year but 3 total. Late meant if you showed up and punched in 10 seconds after your supposed start time you were late. Anytime someone came in 2-3 hours late for a shift, you knew they were there to literally grab whatever was in their locker and leave because it was their third strike.",
            "Reminds me of Walmart's old policy. 1 point if you called in sick, but if you called in up to 3 days in a row, you still only got one point. 7 points total got you fired. Anytime anyone called in, they'd take 3 straight days off.",
            "Reminds me of a sick day policy from my job.  \n\nBack when I started, we would get a point for every unexcused absence.  The points dropped off after six months, but it you got six points in six months, you were put on final notice.  Doctor's notes would prevent you from getting points for an unexcused absence, however.  \n\nThen, a couple of years in (pre-covid), they decided it would be a genius idea to revamp the system.  Same basic premise as above, except for one (admittedly big) change - Doctor's notes no longer prevented you from getting points, they just reduced the number of points you would get.  If you missed work without scheduling a day off, you were going to get at least one point, but if you had a doctor's note, it covered you for three days' worth of absences.  Basically, if you had to call out for three days in a row, without a doctor's note, that was three points, but with a doctor's note, it was only one point.  \n\nSince the consequence of calling off for one day was the same as the consequence for calling off three days, you can imagine what happened.",
            "why are you angry boss? i am only doing **exactly what you taught me**\n\nno leeway, no excuses, no extra, \n\ngot it.",
            "I worked for a company that is unsurprisingly no longer in business. \n\nBoss hovered over my every arrival and departure from the office. It made no sense because one, I was on contract and two my job duties had nothing to do with being in an office. \n\nI decided that job was not a good match and moved on.",
            "I had the same scenario..Didn't matter 5 mins or 5 hrs. I worked for an overnight delivery co. Minutes mattered. I did it occasionally, If I was late I was VERY late, got to where the supervisors would punch me in if I told them I would be 5 mins. late. Wasn't worth the hassle for them.  I retired from the job. Made 30 yrs!!",
            "Lol TSA has/had a similar policy. Lateness counted against you the same as a call out so many people would just call out and take the day. Was the dumbest policy I've ran into thus far second only to their bidding for shifts every 6mo and time off every year. Yes, you heard me right, you had to bid on weeks for leave if you wanted anything. So if you knew a year in advance that your sister was getting married in May you'd better hope you have high enough seniority to get a decent pick or hope people hate that week enough to not bid on it and if it was full you're SOL. Bidding for shifts where your location, shift time and RDO are up to change ever 6mo was already crazy but bidding for leave via seniority is asinine.",
            "Absolutely.  Loved your take.\n\nI had the same experience.  I was one of those employees with perfect attendance year after year, and the owners appreciated everyone who had perfect attendance, so we all received $100 at the end of the year - not life changing money, but made us happy to be recognized.  Then new owners came in, and the new president of the company put an end to these kinds of recognition, saying that if people are going to have perfect attendance, they will have it whether they are rewarded or not.  From that point on, I made it a point to call in three or four times every year just on principle.",
            "I worked at a job like this. It was a good job, but you would get “occurrences” for being late. Whether you were 5 minutes or an hour late. My boss would tell me that if I was running late, might as well stop and grab breakfast on the way in because late was late either way. I miss him. Lol",
            "If you really want to mess with the boss, organize everyone to be an hour late. Meet for breakfast. Discuss business, it's not really personal time.",
            "I wonder if bosses or CEOs or anyone in management ever reads these and cringes at how most management on this planet is truly pathetic",
            "Where i work does this. Any tardiness at all up to half your scheduled shift is all 1/2 an attendance point. 5 seconds late at clock in? Half a point. 3 hours 55 minutes? Half a point. \n\nSo many people do what you do its silly.",
            "This used to happen at my union job 20+ years ago. \n\n1 minute late= 1/2 point. \n2 hours late= 1/2 point. \nMiss over 2 hours up to three entire days = 1 point!\n\nSo anytime I was one minute late, I'd tell manager to log me in or I'd tell them to F-off, then walk out and go take a 3 day vacation.  I worked \"4 tens\" so it was pretty nice break actually.",
            "> They ran an actual meritocracy, where more-productive employees would experience preferential treatment.\n\nSo if I arrived perpetually late, but outputted as much or more as somebody who arrived 30-60 minutes early every day - I'd get equal (or better) treatment?\n\nPunctuality ≠ productivity.",
            "I have pondered this for a while. \n\nSo, you're telling me that if I'm 5 minutes late it is better for me to call in sick FMLA so you have to wait 2-3 hours to find a replacement for me than to just show up and hurry out to work?",
            "At caterpillar it's 1 point if you miss a day and 1 point if you are late. So if I'm late I don't go in",
            "My co-worker would call, tell me her password and ask me to go to her desk, log her on, turn on her desk lamp, spread some papers around and turn her chair so it would look like she had just gotten up to go somewhere. Then she'd ask me for directions to get to some shopping center (pre-GPS days).",
            "At my old job it was being late is the same as missing a day. I told my boss if i pull in to the parking lot 1 min late im going home for the day. So he wouldnt ever see me late again. lol",
            "If you're running late, fuck it. Blue Beetle is in theaters right now. You're already getting the point, might as well make it worth the ass ache",
            "I worked somewhere that considered 7:01am late. 7:00:59am wasn't late. But 7:01 means you've let your team down and production isn't actually happening on schedule and you needed to be written up 3 months later when someone decided to glance over the sign in times.\n\nFuck that place what a joke of a way to treat grown ass adults.",
            "This kinda reminds me of my strategy in high school. We were allowed 6 absences and a tardy was 1/3 absence. 18 tardy a semester and 18 weeks in a semester. Tardy was the same 1 minute late or 44 minutes late. So every Friday I would watch sports center eat some cereal and roll in 44 minutes late.",
            "Former bosses: 7 minutes late is an unexcused absence. 3 unexcused absences is a write up.\n\nGoing to be 15 minutes late? Looks like a sick day.",
            "In high school we’d get detention for showing up late to school, but if you just simply didn’t show up nothing happened.  Missed a lot of days my senior year",
            "Lol. I had a job like this. One day out of the blue, they decided that they needed to change the attendance policy because they didn't think it was having the desired effect (whatever that means)...\n\nBasically they told us that if we were over half an hour late, then we would get the same amount of points as we would if we'd simply called in. There were no exceptions to this rule.\n\nThey said it was it wasn't 'about the points', it was about proving whether or not you actually wanted to be working there.\n\nI, personally, *really* didn't want to be there. Telemarketing is the worst, especially when I see no reason to try to sell people things they didn't need and couldn't afford. I *did* do my best if the person was interested and I made some sales, but I'm not gonna try to convince you that you \"need\" something if you don't want it...\n\nI only took that job because of the decent pay and the fact that I didn't have a car at that time, so I had to find something close to my apartment. I was, like, 19 at the time, so I didn't have as many options...\n\nObviously it had the opposite effect and staffing levels plummeted. Why bother showing up late for a job if your record will show that you missed the entire day whether or not you actually worked it? The only people that still showed up were the ones who literally couldn't afford to miss an entire day. I doubt anyone showed up out of 'loyalty to the company' or any other such BS.\n\nI eventually got fired when I was unable to come to work for an entire week after I ended up injured on the last day of a 3-day vacation I'd taken. They were completely inflexible and refused to budge whether or not I had a doctor's note.\n\nFor some unknown reason, my mental health got so much better after leaving that job, lol... Even if my next job was a slight pay-cut.",
            "I worked at a place that said if you were going a minute or more late, you needed to call ahead to advise you would be late. But you had to call two people, in case one of them was going to be unexpectedly out for the day.\n\nI commuted with my husband, dropping him off downtown on the way to my work on the far side of the city. So traffic being what it was, most days I couldn't predict if I was going to be my usual 10-minutes early to the office.\n\nOf course I couldn't dial and drive, so I'd have to make the call when my husband was still driving his leg of the commute. Almost every day, about 35 minutes before I was due to arrive, I'd make those calls and say that traffic was questionable and I might be late. \n\nI think over the course of 6 months, I was actually late two or three times.",
            "Same shit with my current job if I need to leave 5 minutes early I might as well leave at 2am either way I'm getting the same punishment",
            "Classic private equity tactic. They're hollowing out the assets and throwing all the debt on the company and will leave the company fundamentally crippled. You might as well milk it while you can too, because that's the end game for your management as well.",
            "Walmart used to have a policy of a 5 point system. 1 point, no punishment. 2 points verbal warning. 3 points written warning. 4 points suspension. 5 points termination. If you called in sick, you get 1 point. If you called in sick 3 days in a row, it only counted as 1 point. Nobody ever called out sick for just 1 day.",
            "As somebody who was once fired for being a minute late, right on",
            "I absolutely would have came in 5 minutes before it was time to go home one day.\n\nOh, sorry I’m late.",
            "I used to do the same thing. People pick the weirdest hills to die on. Like aight then consider all the extra shit I do null",
            "Ok I am a working professional now but in university I worked at a convenience store in a shady part of my old city. I learned more about people there than I did in school I swear to god.\n\n&#x200B;\n\nAnyway I had this cranky old coworker who thought she was the Assistant Manager. I was always taught to come 10 mins early. I would change my clothes and stash my stuff then offer to do a task or two to get my colleagues out on time. I'd run the garbage out, dump the mop. Whatever. Fuck sometimes I'd just chit chat while we swapped over so I would get to know my coworkers.\n\n  \nCranky old bag Michelle took offence to this RIGHT away. \"I do NOT need YOU coming in here and doing MY work because I am the ONLY one who does EVERYTHING I am SUPPOSED to.\" She is a \"if you got time to lean you got time to clean\" lady. \n\n&#x200B;\n\nOK GREAT! Then I'd sit in my car listening to tunes until 3pm on the dot. Then she'd take 10 mins of her own time finishing tasks. Whatever Michelle this is how you like it eh?",
            "I worked for several large engineering companies in the DoD Field. One of these companies flagged me and wrote me up for clocking out 2 min early. I had to sit and listen to my department head explain how every minute is recorded and charged through the government. This is why there are digital military clocks through out the building, they are there for us to be mindful of our work time down to every second .",
            "Oh I love this shit. My job has one of those automated \"point\" (no fault) system. They claim they can't erase or change any of the records. A point is a point whether you overslept or were in the ER. They say, \"Oh think of it like a metric rather than discipline\". Yet I know for a fact they've told employees that the \"system\" automatically terminates an employee when they accumulate 10 points. They can override it, but a meeting has to take place and they won't reverse unless there is good reason. Well that is a boldfaced lie. I checked and I have 37 points. A month ago I had my evaluation, and points were not even mentioned. In fact, I was told I had one of the best evaluations in the company and got a raise. So it was all fine and dandy when I'm being a good little worker bee, but when I refuse mandatory overtime that gets scheduled on the spot because I have family visiting from out of state its a different story. \"Your point based attendence record has been raising some eyebrows. Are you sure you cant stay and help us out? I'd hate to see anything happen to you, we love having you.\"\n\nWell I had been waiting for something like this. I carry a list of occurrences and dates of my points. I showed him right there how I received points on days when the company dismissed us early. On days that we werent scheduled at all. Days I had to punch in using an alternative method because the main clock was down. Several days where I left for an appointment that was close by, so I chose to come back to work after. Well, on those days the system issued me 1 point for clocking out early even though it was approved, and 2 points for clocking in \"5 hours late\" when I came back 🤣. So id have been better off just going home. I gave him my adjusted points that only accounted for true infractions, which brought down the total to 3. I then told him its a bullshit metric used as leverage to intimidate when they see fit. I will not be staying for overtime because right under your point policy outline in the handbook it says all schedule changes on the company's part must occur no less than 48 hours in advance or it is not mandatory. I was told about the overtime 30 mins before I was about to clock out. Even so, the penalty for clocking out early would bring my point count to 4. I'll take the risk. My uncle is here from Montana, Ive only seen him twice my entire life the last being when I was 16. Im going home.",
            "The hours at my first real job were flexible since everyone was salaried. People were expected to show up from 7am-9am and work their 8 hours.  But I had a woman working for me who would show up at 10am - 1pm.  Yes, 1pm.  It drove me bonkers sometimes.  Fortunately she was a good worker who would do the jobs the others wouldn't and often she was late because she was baking cookies.  I have ***never eve***r tasted cookies as good as she made. She used special flour (don't ask me what kind).  So I put up with and she often worked more than her 8 hours, so all was good. It was comforting because she would be there when I worked late (all the time).",
            "For my job, 2hrs late is the same as no call no show.  So if something happens that will make me very late (overslept, car not working and i need to wait for mechanic to open, whatever) i just call the boss and say i can't make it in today.  They still pay me via my personal time and i get a day off.\n\nCan't do this very often (tardies and call outs are on a 12month rolling basis, so after a year they fall off), but i am rarely not at work on time, so it doesn't really matter.",
            "Love it !  I did same sort of thing, if I was running late due to traffic or something @  gonna get dinged for it anyway = time to stop for some breakfast & coffee.  Why not ?",
            "I'm surprised you didn't the 7.95 hours late just for the \"fun\" of it once in a while period that would really rub the noses of manglement the wrong way",
            "I was 3 seconds late to a meeting because I couldn’t run (the guy who ran made it) due to an on-job injury\n\nOk so I’m counted absent? I took a nap in my truck until we opened",
            "At my work late is late, so if I’m going to be late I make myself some breakfast and enjoy my coffee.",
            "At my job the consequences of being late are the same from 1 second to 2 hours, after that it counts as an absence even if you can work the rest of your shift, so next time there is a car accident partially blocking the exit ramp causing me to be 5min late im going to breakfast",
            "This is why I love Reddit. Came for the MC, stayed for the Chinese history.",
            "I love you realizing your going to be 5 minutes and deciding to just take the morning off😎🤣",
            "My job started telling us that we need to show up 5 minutes before our scheduled start time for a meeting. We are allowed to clock in for this. \n\nNot showing up for the meeting means getting written up. You will literally be written up for showing up on time.",
            "I love people that use managements asinine rules against them.",
            "My supervisor told me a while ago, ‘If you’re going to be late at all, be 15 minutes late’. Same penalty being a couple minutes late as 15 minutes, so no point in rushing.",
            "‘see a movie’ lol",
            "Find a new job",
            "I did this ten years ago with Walmart! Since it didn't really matter if you were five minutes late or missed your whole shift due to weather, now and then I'd be like \"there was a flood in the holler and the township won't be able to clear it for a week\" and just let them burn.\n\nHigh school was alright.\n\nEdit: ingeborg hated me and never lived in a holler before or after coming from Germany but it took a call from my dad telling her he'd come give her a bit of reason if she was gonna fire me from refusing the drive out of the holler in a blizzard where we couldn't drive out of our own driveways and DOT would be another three days and we had the backup generators going.  She had no concept in her mind that the landscape could literally kill us, she wanted us to come even if our car was buried under five feet, and the road, and DOT/township wouldn't plow for three days plus.if we went off road the only person who would find us would be \"the old man of the holler\" and he didn't even have a car we all just did him favors. If not him then Monty the tinfoil turtle man. Monty didn't drive in winter.\n\nFuck you inge I loved a lot of things about you but middle finger up to the ignorance. Otherwise she was...no bullshit and I liked her. This one thing tho.\n\nEdit: for those wondering I did go in that day, but visibility was six inches in front of the bumper, I was driving an olds Cutlass ciera 91 so it could hang, but there were so many dead mans curves I was driving 15mph through the mountains with 6'' in front of my headlights. Took me almost 4 hours, got there at the end of my shift despite preparing for blizzard conditions in the hills, and when I got there fucking inge sent me home after I tried to call in.. another 3 hours home in the dark with a blown tire from ice building on the slopes. You bet your ass I rode those rims like a sick boardslide and I'm convinced the only reason I made it without sliding off and dying is because I knew every twist and turn by heart\n\nI'm surprised my dad didn't shoot her in the face because that's kind of his...thing\n\nAnd ironically for my dad's past it was really just a lot of cussing back and forth til he made it clear he could do the same to her and be back out of prison in 5 years and do it again if he was still pissed. Because he'd done it before at least twice. Maimed a sheriff's son for acting like he could get away with being a power hungry do whatever he wants prick while the \"indians\" starved. Legal sawed off straight to the face, ambushed him at a party with the other mixed natives. Had enough of his shit.\n\nwe shoved grass up generals asses in the Dakota wars for denying rations but go off ig\n\nWe are also a relic of the late wild west so that kind of feeds into it just know I'm not the same I prefer to talk first. Ironically so did my ancestors and then the grass incident but...such is life hey I tried.",
            "This is the Way!!",
            "We have a point system at work where 2 hours is the same as skipping the entire day.\n\nBut a few minutes is 1/8th as bad as 2 hours. \n\nIt ain't perfect, but it isn't horrible.",
            "Sounds like you need to start coming in 5 min before shift ends. Just running a little late!!!",
            "I'm surprised you didn't do a couple of  7.95 hours late just for the \"fun\" of it once in a while. ....Gee boss, traffic was real bad. Sorry, I 'm late. Whoops, time to home after a long days work, see you tomorrow. \n\n That would really rub the noses of manglement the wrong way.",
            "Sounds like my company's policy. Any sort of lateness results in a write up. It's the same write up as not showing up that day. So, what's the point in going in if it's the same punishment?",
            "The manglement for that company...",
            "If they were taking $ of you for being  5 min late then that's wage theft as I'm pretty sure you get paid by the hour so if they took a full hour away that would be a serious crime in most countries I'm assuming op is in the USA because this would never go in Europe",
            "Sounds like they trying to cut staff without severance",
            "Mis 95% of work. Show up just long enough to get chewed out and leave",
            "My last workplace had something similar.  If you were late any amount of time from 5 minutes to 2 hours, you got one attendance point.  So some people, upon realizing they were late, would just take that 2 hours.\n\nThe problem is, we were hourly.  Being only 5 minutes late may mean the same attendance point, but it also meant getting paid for an hour and 55 minutes of time that you wouldn't get if you took 2 hours to come in.  I'd rather work and get paid, thank you.",
            "Being 5 minutes or 3 hours late for a flight has the same punishment",
            "Hahahaha. Fuck it. Stick to your guns 😆👍👏",
            "but... if they're stripping down the company (which i assume involves downsizing employees) wouldn't they get rid of the workers that are constantly 3 hours late for work and have a ton of writeups?",
            "Working for auto parts manufacturers for the big auto industries for off an on for 15 years it’s the same. When I worked for a Mercedes supplier 1 minute late was half a point we only got 5 points that was termination. They would also be doing road construction for the interstate right by the Mercedes plant and all the suppliers. Supervisors could pick and choose who they gave points to for attendance. Hell i was suspended for 3 days for having 3 points but I didn’t get suspended till like over 3 months after I got my 3 point and that point rolled off before I got suspended. People are dicks.",
            "I once worked at a call center where being 1 minute late was the same as missing the entire day, so if I was gonna be late that turned into a free day off for me",
            "This is legendary.  We can all learn from this.",
            "I would get nervous that the write ups could mean termination.  But if you plan on moving on then I guess it doesn't matter.",
            ">Then the business gets sold and we get new management. An international corp only interested in buying us up, stripping us down and selling off the company. Of course, they denied this constantly, but the fact that over the next 2 years they stripped us down and sold off the company proved they were lying.\n\nThe way you wrote that was hilarious. Great job.",
            "Out of curiosity what should the policy be then?",
            "We had a policy like that in my high school. You were tardy if you showed up after the 7:35AM bell rung, but as long as you came in before 10:30, you were still tardy. So, on a few occasions I was running through the parking lot trying to make the bell, but I heard the bell before I entered the building, and I would turn around and nap in my car until 10:15!",
            "No offense but this seems to accomplish almost nothing. What are you getting out of this?",
            "Something doesn't add up here\n\nAre you hourly or are you salaried? \n\nAlso surely if you got written up too many today Youlgreave I ƙ",
            "Don’t be late, plan ahead and get there early enough to ride smoothly into the day",
            "thats a consequence of HR and unfortunately, the law. you can blame all the lazy worthless fucks that have garbage attendance for that. the law says policy must be applied consistently. personally, i'd say the solution is private  blanket party for the guy that ruins it all, but.....i've been in that very situation and you just gotta deal with it or move on. i'd normally piss all over management and owners, but in this, they're just not wrong. \n\ni'd also say that a good HR has numerous ways to weasily and easily get rid of anyone they want. there's no reason they couldn't have done that to problem guy.",
            "Matter of principle even if new management is crap. I would never be deliberately late.",
            "Deliberate use of the term meritocracy, smh",
            "Why do these stories always make it to the front page? I swear, multiple times a month we get this e act same story, different hours and different penalty time, but the plot is the exact",
            "Why don't you just get a new job if you don't like working there anymore",
            "They could also just fire you",
            "Lol no",
            "Vince Lombardi Rule: show up 15 minutes early or you’re considered late.  If you’re early, you’re on time; if you’re on time, you’re late, if you’re late, you’re fired.",
            "Those new MBAs from the Business School think they are so SMORT!",
            "Wow....you sure showed them!!!",
            "What was the punishment for being late? Like you get a certain number of write ups (lates) and then you get fired?",
            "Dom said it best\n\n“It doesn't matter whether you win by an inch or a mile, winning is winning\"\n\nNow replace the jist of it with the word late.",
            "But no \"3 strikes\" rule or anything? Just be late as much as you want? Just keep getting written up with no other consequence? This is extremely odd. And not well thought out on corporate's level. But fortunate for the underlings!",
            "Rather than be grumpy about it, is try to keep doing the thing I love. If I'm late now and then and they penalize me... well that's their narrative. If they want to fire me for It, their loss. Key point is: you were doing something you loved and you stopped not because you didn't love it anymore nor because someone said no.",
            "if youre gonna be late for work, show up with donuts and coffee. nobody will care that youre late"
        ]
    },
    {
        "post_id": "kaalvz",
        "author": "thearticulategrunt",
        "title": "What was that room number again sir?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/kaalvz/what_was_that_room_number_again_sir/",
        "score": 12979,
        "num_comments": 349,
        "created_utc": 1607583307.0,
        "selftext": "Not sure what my wife was reading but it reminded her of an incident that she told me to share.\n\nI was a Captain at the time and had been assigned as chief of security for an Army hospital. So, as the lingo goes when the calls came down I was Dr. Strong. I was in my office though when a LTC/Lieutenant Colonel came in.\n\n\"Hey there Captain, need you to take care of an issue for me.\"\n\n\"Oh course sir. If it is within my area and power I'll see what I can do.\"\n\n\"Well the general's driver's wife is in the maternity ward having just had her baby and she has a problematic room mate. Always closing the curtain and blocking her line of sight to the window. Also messing with the tv. I need this woman moved to another room.\"\n\n\"Uummm, that's definitely outside my area of control sir. I don't oversee or control anything with patients unless it is an issue of security, safety or\"\n\n\"Yes yes I know but you know everyone and the doctors and nurses will listen to you more than me. You are one of them now and they rely on you.\"\n\n\"Sir really\"\n\n\"I know I know no promises. This would really make the general happy though. His driver is like a second son to him so I would really owe you. It's room number XYA. Just give it your best for a fellow Infantryman okay?\"\n\n(breath deep, wait a minute) \"What room number again sir?\" He smiled.\n\n\"XYA.\"\n\n\"Roger sir. I'll look into it and do my best. I've got a couple favors I might be able to use.\"\n\n\"OUTSTANDING! Thanks.\" and he left.\n\nSo on up I went to maternity to find the head nurse. She was not pleased as apparently the LTC had been up there earlier trying to sling his weight around and came to find me when it had no effect. I pointed out the room though and she smiled. We both chuckled a little bit and I asked \"So, can you help me out with making this all be good? Please.\"\n\nGiving me a big friendly smile \"Well, the corner room is open. We could move the bothersome lady in there though she will likely have a new room mate later today. Then again once the bed is clean and reset we will likely be putting another lady in with the driver's wife too. Matter of fact\" she paused looking over files. \"It will probably be Mrs. Hispanic lady having her fourth kid. She was likely to be going in the corner room but with the move, she would have to go in with the driver's wife.\"\n\nMe- \"Well if that's how it has to be. As long as we can accommodate the LTC's request.\"\n\nHead nurse \"Okay but you are helping move the lady out of the room.\"\n\nMe- \"Yes ma'am, of course.\"\n\nThe lady who had been causing SUCH disturbances for the driver's wife was quite calm and gave no issues with the move nor even asked any questions. I called the LTC once it was done and made sure to tell him I had no concrete knowledge if or when a new room mate might be moved into the room but that the staff was really not happy with the move and extra work. He thanked me and I never heard anything of it again.\n\nThe entertaining part of the whole thing? The bothersome lady who got the room with the better view, the woman who had kept closing the curtain for some privacy and turning down the loud crap the driver's wife kept putting on the tv, was my wife who had just had our first kid.\n\n&#x200B;\n\nedit: Okay wow.  I did not expect this to blow up like this.  Work nights and went to bed only to return and find it had exploded.  Thank you all so much.  I'm glad so many of you enjoyed and I will try to respond as much as I can but there are over 200 comments so if I miss yours I'm sorry.\n\n&#x200B;\n\n2nd edit, from my wife:  I have been instructed to stop trying to apologize and explain things to the folks calling out the term \"Hispanic\" as racist.  My wife is from \"Little Havana\" in Florida.  She said \"If the \\*deleted\\* think it is racist then they probably have some bigoted and racist issues of their own to deal with and need to go to confession and deal with their shit.\"  So, from now on all such posts will receive a \"go see edit 2\" response if I run across them.  I might also let you know this is here just to give you the additional information if you don't fit the afore mentioned category.   \n Anyone else is also free to give such posts the same response/reply.  That being said, and this may get me in trouble, what was meant was that she had a large and supportive family who were all present and would bring hell down on little miss princess especially with all the bored kids running around.",
        "permalink": "/r/MaliciousCompliance/comments/kaalvz/what_was_that_room_number_again_sir/",
        "comments": [
            "loved the last sentence! that made the story extra sweet :)",
            "Congratulations dad!",
            "Kind of beside the point of the story but it annoys me so much that maternity wards make women share rooms. There is no time in your life when you need privacy more IMO. Having to share a room with a complete stranger and their noisy baby while you’re trying to get to know your own noisy baby is a unique form of torture and should be outlawed.",
            "Having had some troublesome hospital roommates, I can understand how one would prefer to have more congenial ones. I never asked for anyone to be moved, nor did I complain if they were too loud (even if it was the middle of the night and they woke me up with their loudness). I guess I figured none of us actually *want* to be here, so let's all just work on getting *out* of here. \n\nOnce there was a small family visiting one of my roommates, he was the husband's uncle or something. Anyway, they were standing at the foot of my bed while they waited for the nurse to get the uncle ready for visitors (he had some mental problems). It was after my first brain surgery, and it was obvious that I had just had my head worked on (all bandaged up). \n\nThe wife looked over and asked who my neurosurgeon was (correctly guessing that I had to have one). I told her, and her reply was, \"Isn't he great? He did my back for me!\" (Yes, neurosurgeons often do back surgeries, in fact, if you're getting your back worked on, better have someone do it who knows what all the nerves do.)\n\nThe point is this: she treated me like a person, not a brain damaged victim, and even found something we had in common, which happened to be a brain surgeon. I'll never forget that little act of kindness, after all, she could have said nothing. \n\nI hope you and your family are doing well and that she enjoyed that corner room (for however briefly she had to stay there).",
            "I feel like Mrs Hispanic Lady really got the short end of this encounter",
            "r/MilitaryStories would probably appreciate this one, if you've not already posted it there!",
            "That’s awesome 😎",
            "I used to work in community mental health as a tech. Our principal psychiatrist made me an honorary doctor when i left. I have a badge that says \"Dr Strong MD, director of patient management\" lol",
            "I suspected as much when OP asked again about the room number. Love the ending.",
            "Stationed at Ft Sam Houston when first kiddo was born. She has multiple birth defects, which we knew about, and needed to be delivered by C-section which turned ugly with more than one incision in the uterus.\nKid went to NICU, mom went to large ward.\n\nLots of moms with perfect little babies. My wife was crying and very upset, as she could not even SEE our baby yet. She wanted out, but could not leave due to extra incision. I (CW2) went to her doctor, COL Really Cool, and explained the situation. My wife got moved to a private room within about 20 minutes.\n\nCOL Really Cool apologized to her within an hour, how he should have seen that coming and taking all of the blame. I’ll always remember that man’s kindness and leadership. (Taking the blame for his team.)\n\nEdit: I just read this to my wife and she reminded me that it wasn’t the moms with perfect little babies that bothered her. It was the moms COMPLAINING about their perfect little babies that bothered her.",
            "Hispanic means from a Spanish-speaking origin. Am Hispanic (not Latino). How the fuck is that racist?",
            "Well written - didn’t even see it coming",
            "You're wife had just given birth and you were on duty?",
            "I remember our first kid...  My wife was in a semi private room after, but they didn't have any other patients so it was close enough to private.\n\nSince it's your wife, that explains the \"You are helping move...\" from the Head Nurse. :)",
            "OHHHHHHHHHHHHHHH SNAP!!!\n\nI did NOT see that ending coming!!! SO GOOD!!!",
            "I'm not even sure it's that malicious, considering everyone wins.",
            "It's a small world, innit?",
            "Why in the world were you not on leave if your wife just had your kid?   \n\n\nFirst thing i did the moment my wife went into labor with our first was hustle my papers up the chain so i could start my leave once the doc said they had no choice to deliver early.  \n\n\nI was just a lowly E-4,  you were an officer. WTF?",
            "What's the significance of \"the hispanic lady with her fourth kid\"? I re-read it but don't get it.",
            "As soon as OP asked him to repeat the room number I had a feeling it was OPs wife. Lol",
            "Not gonna lie, I didn't expect the last part...",
            "This is a great story",
            "Congratulations! The ending really was the cherry on top.",
            "HAHAHAHAH I like this story",
            "11/10 that was such a great twist at the end :)",
            "Damn what a twist! Loved the story",
            "oh, that's hilarious.\n\ndoesn't get much better does it!",
            "Should have mentioned to the LTC that your wife had been moved instead of saying the bothersome wife. Then offered him a cigar since it was your first. Let him know exactly what he was asking.",
            "This story is priceless! Love how they never revealed the troublesome lady was the author’s wife! Serves the guy right for putting him on the spot! Hope the new roommate was not disturbed by the cranky, pushy, overreaching Dad of their new baby! Congrats to all the new parents out there!",
            "You might also share this with r/MilitaryStories. I think it fits. Great read!",
            "I didn't see that ending coming, outstanding sir !",
            "Is there a reverse \"Whomp whomp?\"",
            "This is fantastic!!!!!",
            "I wish I had gold now",
            "I cant imagine sharing a room after having just given birth  i guess army hospitals are different.  Great story!",
            "So I couldn't find anyone asking what I think is a great follow up question: did your LTC and/or the Driver find out the other woman they had removed from the room was your wife!?",
            "At any point in this story did the patients simply try communicating with each other, either directly or via a staff intermediary, or was the passive-aggressive approach and kowtowing to inappropriate personal demands the only attempted solution?",
            "Brilliant twist to the story!",
            "I can only give you a hug award, but that was an awesome story",
            "👏👏👏👏",
            "That final sentence... wow. PERFECT!\n\nI work for a site called Not Always Right ([www.notalwaysright.com](https://www.notalwaysright.com/)) and I know our readers love to read stories just like this. Would we be able to share your story on the site? Let me know if that's okay with you?\n\nThanks again for the great story!",
            "It's always so weird when stories choose to identify people only by their race. Did we have the driver's white wife? The bothersome white lady? Nope, but you know that *Hispanic* lady has *four* children. \n\nSo \"descriptive\"."
        ]
    },
    {
        "post_id": "8pjw19",
        "author": "I_know_cheese",
        "title": "Drink some water, you're drunk. OK pal.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8pjw19/drink_some_water_youre_drunk_ok_pal/",
        "score": 12975,
        "num_comments": 223,
        "created_utc": 1528464683.0,
        "selftext": "I was working security inside a club last night and I see a guy stumbling around. I go up to him and tell him I want to see him drink some water before I see him drinking any more alcohol.\n\nAbout 5 mins later he walks up to me and shows me a glass of water, takes one sip, puts the glass down and proceeds to start drinking a pint he must have bought when he went to the bar to get the water.\n\nI couldn't help but chuckle.",
        "permalink": "/r/MaliciousCompliance/comments/8pjw19/drink_some_water_youre_drunk_ok_pal/",
        "comments": [
            "I once got so drunk the door guy wouldn’t let me back in and brought me a bottle of water when I said “it’s okay I wouldn’t let me back in either”",
            "I'm glad you *Kept your sense of humor about it...  I'm sure in your line of work you're tested constantly by drunk people\n\nEdit: let -> kept",
            "Nice to see a story from the other side of the compliance!\n\nBut well played by the drunk guy. Hope his hangover wasn't too bad after all ;)",
            "The best kind of correct.",
            "I feel like if you're clever enough to pull that off then you can't be completely incapacitated ",
            "double compliance plot twist : \"ok buddy, im sure youll feel great in the morning\"",
            "Protip: dont do this. If barstaff tells someone to slow down and drink a water, even if you cant see them they are watching you, and if you dont act like a good boy /girl and drink your water calmly and reasonably slowly bwfore you drink more, you will be getting tossed out. I dont care if you dont think you are too drunk, its not your opinion on it that matters, and arguing wont change anyones mind.",
            "Lol it's fun to see an MC like this from the other perspective. Glad you weren't a dick about it!",
            "I was underage drinking at a BYOB strip club once, some friends were of age and I was able to scam some drinks. Someone got light of the situation later on and as I was drinking just a water at the time a bouncer came up to call me out. I told him to taste the water as it was just water. He did. Then looked surprised. Yup, just water. I said now go get me another one, I'm not drinking that after you touched it.\n\nI was booted a few minutes later though as others were already hip to my scheme.",
            "When I was 18, from the UK, I had been drinking but the bouncer wouldn't let me back in unless I went to McDonalds and bought food. I have never ordered anything from McDonalds in my life! So I went in, grabbed a reciept and an empty cup of drink from a finished table walked back slower. Put the drink in the bin and handed him the reciept and walked in. He never checked the time on the thing.",
            "I am legit wondering if this is about my SO. \n\nHe called me in a disgusting drunken state last night at around 11pm and mumbled something about security then proceeded to drunk mumble some more.\n\nIf it indeed was him then he has a stinking hangover today so haha to him for having zero self control.",
            "That guy regrets not having that water today.  \n\n",
            "While I applaud your efforts in looking out for that guy, just so you know... drinking water will not make him any less drunk, it would only abate some of the next-morning dehydration symptoms that comes as a result of drinking too much. The best (only) way to lessen the effects of alcohol is to not drink any more alcohol and to give the alcohol in your system time to be metabolized.",
            "Well he’s going to be the one wishing he drank more water tomorrow morning",
            "Hahaha. I just had my first chuckle of the day. Thanks mate. ",
            "That glass of water was probably a glass of vodka ",
            "\"This beer is 90% water, offisher!\"",
            "I, too, work security. I'm curious why you didn't cut him off, as is typically protocol. At least if you want to keep your liquor license. \n\nWhat kind of venue do you work?\n\nI had a show last night that we already knew we'd be dealing with underage drinking and over intox situations all night. We dont typically give 2nd chances. I cut someone off last night but let him stay (took his wristband and marked him so bar staff would know not to serve him). Within 2 minutes of me letting him back in, he goes strait to a restricted area upstairs and starts dropping things from the mezzanine. Went up and ejected him from the property. Which is a good example of why we dont typically give 2nd chances.\n\nTelling a drunk to drink water isn't going to sober them up. It dilutes what's in their system and prolongs the intoxication. Why would you let him keep drinking alcohol if he drank water for you?\n\nDo you not have to be trained in alcohol law enforcement compliance, or at the very least, be TIPS trained/certified?",
            "Drinkers know sarcasm. ",
            "Just curious why you didn’t cut him off entirely?",
            "Shut up! Dint tell me whatd to do!!",
            "He can't have been that drunk if he could figure out the loophole.",
            "I mean... ok... sure... :/ dud must really hate his liver.",
            "You lost that one buddy. ",
            "What bar/general area and time? Because I did exactly this to a bouncer just a couple nights ago. ",
            "Well to be fair, beer is over 90% water (source: homebrewer for 15 years at least.)\n\n",
            "Well to be fair, beer is over 90% water (source: homebrewer for 15 years at least.)",
            "Cool story, but maybe you should just provide security and let the patron make his own decisions concerning hydration. "
        ]
    },
    {
        "post_id": "fsr8fp",
        "author": "MattyJRobs",
        "title": "He’s on vacation.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/fsr8fp/hes_on_vacation/",
        "score": 12973,
        "num_comments": 557,
        "created_utc": 1585709692.0,
        "selftext": "My buddy from work got laid off for three weeks yesterday. He tried to tell HR and leadership it was a really bad idea because he was also in charge of a high-volume 3PL (third-party logistics) facility. Well, they did it anyway and gave him the choice of filing for unemployment or using vacation time. He decided to use vacation time.\n\nFast forward to today. Customer Service calls our offices saying that nothing is shipping from the aforementioned 3PL and it’s going to shut down at least 8 different customers. My boss informs them that the person handling the 3PL is laid off, and, sorry we don’t have access to that facility in our ERP to help them (for checks and balances reasons). Vice Prez hears about it. Then my boss’s boss. Then HR.\n\nMy boss’s boss comes in my office today to ask me to take over the 3PL for a few weeks, and I lay out why I can’t realistically do it on top of my normal job. I ask him why we can’t just bring back the guy who did it in the first place, because this sounded really important.\n\nHis shoulders slump, and with a dead-pan expression he tells me...\n\nHe won’t do it. He’s on vacation.\n\nTL;DR Don’t lay off critical employees just to save labor.\n\nEdit: Removed some specifics.",
        "permalink": "/r/MaliciousCompliance/comments/fsr8fp/hes_on_vacation/",
        "comments": [
            "My company laid off over 50 people, myself included. They got rid of some of the smartest/most important people (in my opinion) and then asked the team still there to 1) work 7 days a week and 2) cut their salaries by 30% during this. I’m predicting they shut down before all of this is over, I’m glad I don’t work there anymore\n\nEdit: Non essential WFH company. Also to add, one of my former coworkers recently quit, citing the newest cultural problems/workload. I think it’s crazy that he quit during the recession, but it shows how bad things were getting there.",
            "Plus given that he used 3 weeks of vacation time at a time he didn’t want to and there’s no where to go, I wouldn’t be surprised if he were to be looking to move on when this shit blows over.",
            "Good, I think many of the companies laying people off are going to be SoL when the market picks back up and all the good people they got rid of have already been snatched up elsewhere. They could learn a lesson in patience and riding out the storm.\n\nEdit: missed a word",
            "They played themselves",
            "Sounds like their effort to save on money/labor is gonna end up costing them more than it saves. Bravo.",
            "I'd tell your buddy to ask for back pay from the day he was laid off and he'll come in immediately.  Otherwise they can kick rocks.",
            "Same, currently sitting at home on about 60% of my normal wage (no OT, no shift allowance and base wage reduced to 80%). Then to rub salt into the wound we have been told we are not allowed to work part time for any other companies, even though it looks like i'm going to be sitting at home for the next 3-5 weeks.\n\nThere is multiple critical job tasks at work right now, just sitting waiting to be completed, that don't require interacting with other customers or employee's, which I could be just hammering away at.\n\nBut no I'm at home, broke and I know when I go back to work everyone will be rushing around like crazy to catch up and not lose productivity....They are saving about a grand to keep me home...but the catch up OT with the crew and the inevitable fuck-ups that occur when the guys are running around will cost 20x that....",
            "You have an important job and no back up for the person who does it? That person never took vacation before?",
            "A cousin of mine was laid off on a Friday from Wang computers, years ago.   They called her on Monday and said they'd made a mistake laying her off. She said, \"you're right\" and hung up.",
            "I got laid off last May. The new CFO wanted to bring in his “old team” from his previous company to take my “we no longer need a member in this role” role.\n\nThe CFO and his team were fired last month for “creative accounting.”\n\nThe following Monday I got a call from the CEO asking me to come back at 150% my old salary. I countered with 200%, they said no. I said no worries and stuck with my current team.",
            "The one time i feel indispensable as fuck in my work place. Im the only instore worker left. One left just before quarantine and the other 2 self isolated. Normally 4 instore workers are needed through the week, now its just me. They changed my days a bit to include a day i absolutely cannot work (i do online classes that day) and i told them i cant do it. \n\nThey tried to tell me i have to and dont really have a choice. I just said 'well ill self isolate then, theres my choice and youll have no workers for 2 weeks that arent management. You are running low on workers as it is. Do you want to lose the only one whos willing to work 6 days until we get more workers?' Suddenly they can cover mondays.",
            "This reminds me of a programming aphorism: premature optimization is the root of all evil (embodied in the motto: 1) make it, 2) make it work, 3) make it work fast). \n\nIt appears that some managers need to learn to avoid premature optimization.",
            "To paraphrase Shakespreare \"hoist by their own petard!\"",
            "This happens EVERY recession/economic downturn/cycle; \n\nStep 1 : corporation fires a substantial # of employees\n\nStep 2 : threaten those still w/ a job that if they don't pick up the slack, they'll be fired too\n\nStep 3 : when the economy returns to normal, don't rehire laid off staff bc hey all these ants are now used to doing double the work for the same pay! Without complain! Woooo capitalism/stepping on the working class' neck!\n\nStep 4 : money in yo pocket, in yo pocket, a little for shareholders and bonuses...",
            "There's probably another reason he took vacation. With unemployment, you can be recalled back to work. And with some unemployment, you have to be actively seeking work (exceptions to every rule, of coarse). And some require that if you are recalled, or offered employment, and you decline, then you can automatically lose your employment.",
            "I would have stated to HR: If you want to call me in my vacation i get an instant payraise.",
            "Work in a finance advice company, busier than ever as everyone needs advice and help (and have already paid for it). We're cutting our hours by a fifth as management sees \"hard times ahead\", but not yet though.\n\nOh and we're expected to work through the day we're unpaid. It's sketchy as all hell as we've had a contract variation to reduce hours, unsigned and no end date.\n\nSomeone is going to challenge it with a lawyer soon and it's going to get messy...",
            "**OUT-FUCKING-STANDING!**",
            "[deleted]",
            "Wait what I'm trying to understand is if they were laying him off... Why did they give an option to use annual leave? Aren't lay offs generally to cut cost for the company?",
            "I too work at a 3PL, and instead of layoffs they've been pressuring some folks to quit. Some are allowed to work from home, but for some reason it's mainly ones with no families or need for childcare. I'm childfree and normally dislike seeing those with kids get special treatment because they chose to have kids, but this is a special case. A lot of the folks leaving are ones with kids who no longer have a daycare to send them to or babysitters. Idk why it's so hard to let us all work from home. We don't have customers coming in and out if the building, it's pretty much all phone and computer work.",
            "I've always thought the expression \"nobody's irreplaceable\" was a an expression only people who haven't had much experience believe in. \n\nNobody in their right mind believes that there's no cost to firing someone.",
            ">gave him the choice of filing for unemployment or using vacation time.\n\nAm not familiar with the system, but doesn't he get both?",
            "So they tried to get you to do it, will they keep trying? What are they planning to do?\n\nI hate the \"get someone else to do it\" attitude. And it'd hard to escape. It's a nice manager who didn't make the decision that approaches you and kindly asks if you can start doing xyz from now on. It's such a horrible thing.",
            "Karma! Good job on telling them you can't do it. A certain company I worked for would just plop the person's work on another's desk.",
            "I lost confidence in my company when they laid off some bright, hard workers just to meet a CEO imposed mandate.",
            "They should lay off the managers and executives and let the real workers do their work.",
            "The environment is so bad at my company right now that one of our most valued team members just gave notice, during a pandemic and massive unemployment.  Geesh.",
            "I worked for a company who made all their money by doing customer satisfaction phone calls for various companies. The one and only deliverable for this was processed data about what the calls showed. They had to provide this processed data to all their clients monthly. \n\nThey had a guy whose full time job was to process the raw data into the processed results in a form the clients could read, but he didn't actually know how to do it. So I had to do it for him every month. I asked him to let me teach him how to do it, but he refused, and said that if he knew how to do it he'd have to do it, and if he didn't know how to do it the boss would make me do it. The one time I tried to say \"I'm not doing your job for you\" he proved himself right by getting the boss to make me do it. (I was the first person the company ever hired for reasons other than that I had slept with the boss. He wasn't.) Now, we're talking 6-8 hours of work once a month, but he couldn't be bothered to put in one day of work a month, he wanted to sit there and do whatever he wanted in his office for 8 hours a day and get a paycheck for it, make the most overworked guy in the company do his job for him, and refuse to even learn how it's done.\n\nAt one point I got a new boss. My new boss was a bitch. Her first action on the job was to fire my assistant. She had never actually met either of us and didn't know anything about what our workload was, but she fired my assistant unseen, and her official reason for this was \"you don't have enough work to justify an assistant.\" (I worked 16 hour days and 6-7 day weeks *with* an assistant.) After a month or so it became clear that she was trying to get rid of me. After a few months she hired somebody else (he was incompetent but willing to kiss her ass about everything) and started pushing all my duties onto him and ordered me not to do anything. I told her that it would be a bad idea to have me not do the data processing because it was 100% of the company's output and I was the only person who knew how to do it, but this merely pushed her into an angry screaming fit about how dare I tell her what to do and didn't I know my place blah blah blah... then 2 days later she fired me, so I shut up and left.\n\nWhen I was hired I was employee #7. Within 6 months the company had 150 employees. 3 months after I left, they had 2.",
            "People with a lot of authority and little to no understanding of the who and how of how the actual work gets done have ruined more businesses than any other reason.",
            "Big oof on their part",
            "Simple. Straightforward. Brutal!",
            "[removed]",
            "Should fire the boss who let him go.",
            "LMAO!",
            "It's rare you hear about a layoff that fits the classic definition of temporary.",
            "i love this but im honestly worried. in your country can they not out of sheer pettiness fire him when he comes back because of this?",
            "please tell him He's a madman!\n\nHe is now my idol, someone i aspire to be",
            "No offense, but how is this malicious compliance? I don’t understand.",
            "Is he really on vacation? I mean, he's probably at home chilling just using vacation time. \n\nMost of us these days can't go to a restaurant, much less on an actual vacation. Also, money talks...just have to pay the guy extra to come back, but it's better than losing business.",
            "OK, there are a lot of comments that seem to not understand the current situation.\n\nYou can hate on these companies all you want, but the reality is that a lot of companies' revenue has been slashed so hard that they are about to go out of business. Like, in a couple of weeks. \n\nNormally furloughs and layoffs are just cost cutting measures for the sake of increasing stock values - at least when shitty companies do them - but right now they are a necessity because there is no alternative. The alternative is that you cant afford to operate and go out of business. \n\nSlashing salaries and asking for more hours? Yeah, it's dick, but recognize that the only other alternative is that the company goes under and no one has a job.\n\nWill these people be able to get another job when this blows over? Maybe... The job market is probably going to be brutal for at least a couple of months after things go back to normal - and that could be a while from now.\n\nI do think the first thing these companies should be doing is slashing officer and executive leadership salaries, and by a higher %than whatever they're cutting from the rank and file employees. But at some point its going to come down to just cutting expenses to stay alive.",
            "Maybe he was saying /s sarcastically",
            "I love this so much!",
            "Lmao!! Stupid asses.",
            "Haha fuck yeah!"
        ]
    },
    {
        "post_id": "c67bn4",
        "author": "fatefulparadox",
        "title": "You want me to stay in the back room even though it's almost 100ºf? Okay!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c67bn4/you_want_me_to_stay_in_the_back_room_even_though/",
        "score": 12970,
        "num_comments": 705,
        "created_utc": 1561651422.0,
        "selftext": "This just happened today. A little back story, I work at a... Ahem, particularly _green_ craft and fabric store. Every Thursday, we receive a truck. Truck day consists of unloading and organizing everything on the truck by hand, pushed down to us on a large roller ramp. The team I work with is wonderful, but the head manager of the store I’m at is a piece of work. During truck days she tends to just stand there and watch us all unload while yelling about how we’re doing it all wrong (we are in fact following all the company procedures, so... Not wrong.)\n\nAnother thing to note is that corporate controls our air conditioning. I live in Maine, so it's always between 70-100% humidity all the time which makes it feel a lot worse than it is. Corporate still hasn't kicked on our air yet, despite it almost July.\n\n Our back room was almost 100ºf (~97º but the thermometer is a bit hard to read), 100% humidity. I was unloading the truck with three other people, and my boss was standing there yelling as usual. I started to feel symptoms of heat exhaustion and asked my boss if I could quickly get a drink of water. She told me I couldn't until the truck was completely unloaded, which was another half hour or so. She said something to me thirty seconds later, and I perfectly-timed projectile vomited all over her. She started yelling at me and the rest of the team because we weren't helping her get cleaned up, to which they all responded along the lines of \"well, you told her she couldn't go!\"\n\nYou won't let me go get water even though I'm having heat exhaustion?  That's cool, I'll just puke on you, instead! (:\n\n\nEdit: Since everyone keeps commenting on how I should report her in one way or another, I'm already on it!\n\n\nEdit 2: I’m tryin to keep up with replies and questions, but if I miss your comment, terribly sorry!!",
        "permalink": "/r/MaliciousCompliance/comments/c67bn4/you_want_me_to_stay_in_the_back_room_even_though/",
        "comments": [
            "Heat exhaustion is no fucking joke.  She's lucky that all she got was puked on.",
            "You should definitely get checked out and make sure you’re not dehydrated. Also have a doctor write a note or something too that humans in general need water to survive.",
            "as someone who has worked a corporate retail job in Florida, i understand your pain completely. only for some reason since the main HQ is way up in the northwest they just do not understand the concept of \"it's hot as balls all year round\". little things, like how the heater would be turned on because it's November, BUT IT'S STILL 84 DEGREES OUTSIDE. situation got better when they eventually let the GM have override privileges.",
            "[deleted]",
            "You should definitely check with your local hardware store. Guillotines aren’t hard at all to build and really help in situations like these.",
            "follow that up with a swift jog over to HR to report her for endangering you/ your health by not allowing water breaks.",
            "Am I the only one who read “green” as marijuana and wondered what types of crafts can be made from pot?",
            "That's not OK at all. Opens the company up to a lawsuit, if you want, very easily with proof.\n\nI work in the prison system. Inmate says he's hot, we have to let them cooldown whether we think he's full of it or not just for the fact that heat exhaustion can VERY quickly lead to a heat stroke if measures aren't taken.\n\nYou're being treated worse than a prisoner and putting your life at risk. Definitely say something.",
            "[deleted]",
            "I smell a lawsuit that could also get that manager fired.",
            "Call OSHA on them.  I’m in Texas and we do not mess around with heat exhaustion.",
            "As someone super sensitive to the heat, all I can say is Bravo! Thank you for proving it's no joke.  I have thrown up for days after serious heat exhaustion, even when I was a kid. Doesn't help that I am as fair complected as they come not that it can't happen to anyone.",
            "My job is like this. Sick with a doctor’s note? Doesn’t matter, if you don’t qualify for short term unemployment then you can get fired if you don’t have the protected paid time off.",
            "What a bitch! Heat exhaustion and overheating is no laughing matter, in 2003 almost 35,000 people died as a direct result of the heatwave throughout Europe, with 14,082 of them in France alone. Because of this, heat-related emergency procedures have been put in place with 4 levels of intensity. This summer in France, they had to implement a Level 3 heat emergency which involves installing temporary fountains throughout large cities (mainly Paris) and keeping parks open later than usual so that people can cool off.\n\nSource: [New Scientist](https://www.newscientist.com/article/dn4259-european-heatwave-caused-35000-deaths/)",
            "Sounds like a call to a lawyer, not allowing you to get water is a big no.no",
            "Regardless of country and laws, refusing someone water is a human rights issue, fyi.",
            "OP, make sure you’re extra careful about heatstroke now. Every time you get it, you become *more* susceptible",
            "Jesus. I live in AZ and stopping for water is a damn LAW out here. ESPECIALLY in summer and there are specific classes I had to take on preventing heat exhaustion as part of my training.\n\nI hope she gets busted. Bigtime.",
            "OSHA would be really interested in this situation.",
            "call corporate and tell them what she is doing.",
            "Thats just a bad employer. I used to work in a plant in Ga with no a/c that was known to be a harsh employer but even they :\n- had “summer hours” vs “winter hours” so we started at 4.30 but were done by 2 in summer\n- lots of fans\n- barrels of gatorade\n- a walkin cooler with chairs",
            "If you had time to ask you had time to grab a drink of water. Next time forego the permission and just grab a drink! I'd like to see the paperwork punishing someone for that.",
            "Always remember your job will be in the paper before your obituary, companies don't give a shit about employees",
            "[deleted]",
            "Yes, hello, OSHA, this post right here",
            "People need to understand that an employer can't stop you from your basic human needs. \n\n\nNeed some water? Go get some water. Need to use the restroom, go use the restroom. You aren't 1st graders; so don't act like it.",
            "fuck yo boss",
            "My girl friend works for a massive Potato Chip company in the warehouse.   No AC, Metal building.  For the last 4-5 years (she has lived with me) she keeps me updated on how many people leave in ambulances due to heat exhaustion.  Considering they have a over a hundred workers in that building the average is 6 per summer.  Some times more, others less depending how the heat and humidity was that year.\n\n&#x200B;\n\nLower then I would expect. I know how hot it is in there as they provide tours.  I've worked the office life for the last twenty years, I couldn't last twenty minutes in that environment.  During breaks they hose each other down outside.  Some Supervisors are cool and let them go outside briefly to dump a bucket of water on their head and head right back in. \n\n&#x200B;\n\nAnyway, after a week or two the employee returns, passes out again, rinse and repeat.  The employee is given the choice, continue working in that building or quit.   Easy choice at that point, plus because this is america you know they some how had to pay for the medical attention, even in this situation, there will be some sort of fine print some where. That's what its all about.",
            "Don't \"ask\" for permission to go get water.... You're an adult, you can decide for yourself if it's necessary in the moment or if you can continue working at the moment and wait for a more opportune time... I've found that when you give somebody the opportunity to say \"no,\" they often will. Try: \"I'll be right back, I need to get a quick drink of water\" rather than saying \"may I please go get some water\".",
            "YES. Everytime a boss has given me a hard time about caling out sick I have wanted to pule on them. This story gives me that satisfaction. \nBy the way there's definitely a big problem with employee conditions in your store. Im sure OSHA would love to observe.",
            "I feel your pain /u/fatefulparadox, I work outside most days *on turf* ***in TEXAS***. Give her hell for the both of us",
            "You should also talk to HR about unsafe working conditions. That’s unacceptable and puts you, and the other employees, in harms way.",
            "I also work for a craft store that is associated with green. If you ever feel the need to move to Denver, we'd love to have you! Our store's management team is awesome and we're always shorthanded thanks to the nature of retail. Nice aim, BTW!",
            "Heat exhaustion is crazy. Ended up getting it today and almost passed out, and puked about five times. It’s worse when you’re working. I’d say them getting puked on is well deserved.",
            "Legit question- for this specific type of store, are their different rankings for the departments? Are the fabric people above all others? Whenever I go into one of the two by me, the fabric women are the absolute worst!  I was originally thinking it was because I’m not a high enough level crafter (only a level 4) so I’m drawing aggro from them. My wife just said it’s because they’re Karen’s who have to Karenate all the time.",
            "Joann’s?",
            "I live in far far south side Texas so it’s realllyyyyy fucking hot all the time and I remember in PE it took 2 kids to throw up from heat exhaustion to realize they need bring all the kids inside",
            "OP, I’m so sorry this happened to you!! I live in Maine too, I’ll be thinking of you tomorrow it’s supposed to be real hot :( that’s absolutely ridiculous that they haven’t turned on the AC yet. I’d take a dry heat 15 degrees hotter than a humid heat any day",
            "What in the actual fuck is up with corporately controlled AC & heat?  I mean in theory, maybe, but do they not have a little alarm on a screen somewhere that says \"The store there in Maine is open and the back room is over 90ºF right now\"  ??",
            "That right there... Is Maine justice!",
            "Fuck that. Don't ever let someone tell you you can't stop to drink some water. Productivity doesn't mean anything if people are getting sick from exhaustion.",
            "Why even ask permission? You're an adult, go get some fucking water.",
            "When I was at Parris Island for Boot camp for the marines back in 95, we had condition flags.  If the black flag flew, you were not exercising that day, period.  Black flag is 90F and up.\n\nYou were working in conditions that the marines won't even train their recruits in.\n\nhttps://www.ready.marines.mil/Stay-Informed/Natural-Hazards/Extreme-Heat/Flag-Conditions/",
            "IANAL but I think access to water is required of all work places. Again I don’t know for sure but it might be worth checking into. If she denied something labor laws require you to have you might be able to report her to employment board.",
            "Oh man I worked for the same store and started thinking we worked for the same evil manager except nope! Different sides of the country! I hope you don’t ever have to experience that again OP!",
            "I'm from Maine as well. My kid's cousin on his father's side had a bad case of heat exhaustion. He is one of 2 or 3 people ever to have survived having both kidney and liver failure at the same time in the town's hospital. He ended up getting a $260,000ish settlement. They weren't properly trained with how to deal with the heat and I believe that they were supposed to be providing water but weren't. They were out in 85° heat burning blueberry fields. It may be worth going to the hospital next time and getting everything documented, like whether or not water was available. Who knows, maybe you can get a good settlement too.",
            "There is something especially sociopathic about people who deny water and bathroom to others.",
            "Please post a follow up when hopefully, the shit hits the fan for the manager.",
            "Advice for heat exhaustion, the best way to combat it is hydrating properly, 4L a day is what you should be drinking and it takes 24 hours for your body to hydrate after drinking water so everyday you drink water you are actually hydrating for the following day.",
            "You literally work in a sweat shop. Ya'll should unionize. Not just about the money, but for better and safer working conditions.",
            "I had the opposite experience in every way. I hadn't slept at all the night prior and, on top of that, my medication makes me very tired whenever I'm missing a pill (One of them counteracts the tiredness side-effect) and I just so happened to be missing that pill. My GM noticed that I was dozing off in Drive-Thru so he had me go into the freezer and count the buns. No context or reason given just, \"Quintin. I need you to go into the freezer and count the buns\" I did, even pulled out the calculator on my phone to count by tray of buns rather than individual buns. He came in about...five, six? minutes later and sent me back to Drive-Thru. Worked like a charm and woke me right up.",
            "I read the 100°F as 'Oof' - works out. :/",
            "Your manager may have broken labor laws by denying you access to water. Consult a lawyer. There could be a payout here.\n\n> Drinking Water, Restroom Use, Sanitation\n\n> Are employers required to provide drinking water?\n\n> OSHA Standards require an employer to provide potable water in the workplace and permit employees to drink it. Potable water includes tap water that is safe for drinking. Employers cannot require employees to pay for water that is provided. An employer does not have to provide bottled water if potable water is available. See OSHA's sanitation standard for more information.\n\nhttps://www.osha.gov/faq",
            "You could have fainted while carrying some heavy box, your boss is a menace",
            "Seriously heat exhaustion is no joke. My wife keeps getting it at her workplace and her managers just push her harder instead.",
            "What an incredibly stupid boss.",
            "Were you sweating?",
            "Heat exhaustion is very dangerous!",
            "Everyone ever trained in first-aid should know the signs of heat illness, heat exhaustion, and heat stroke. And even then, any manager worth their weight in salt should know better than to deny someone WATER in a hot, stuffy environment where they’re physically exerting themselves.\n\nHeat exhaustion and heat stroke are medical emergencies. Fuck your manager and make sure you drag them through the mud.",
            "I never liked renys,",
            "Ots already way too late if you are feeling light headed bro. Look after yourself, get a water bottle at least. I've seen some bad shit happen to people with heat stroke, it isnt pretty.",
            "This is beyond my comprehension.  Your employment laws and employee rights are just fucked.  \n\nJust in case it's not clear, I don't live or work in the US.",
            "It's against the law for anyone to deny you water.",
            "Wait, Maine has a bunch of humidity?! I'm on the west coast, this is news to me. I thought it was more temperate way in the northeast!",
            "I hope you update us after your talk with the district manager! And I hope corporate freaking turns on the AC! I mean, if they’re fine with lawsuits, that’s on them. ;)",
            "Dude, it was stinking HUMID today, and I'm on the coast. Working like that would have sucked. Glad that you're feeling better!",
            "Holy OSHA recordable, Batman!",
            "Should talk to your state's labor board about it...",
            "I have had something similar happen to me. \n\nI used to work at a family owned restaurant. I got hired as a dishwasher there. Mind you, the kitchen gets very hot. I live in PA and this was in June. Also, their AC in the kitchen was not working at the time. The first two hours of my first shift on my first day went normal. Then, I started to feel dizzy and without knowing what was wrong, went to the bathroom to get the chance to sit down for a few. I didn’t even make it to the bathroom because I passed out and hit my head off the wall right outside the bathroom. They called an ambulance and everything. This was mostly my fault though because my coworkers were telling me to drink water and I kept politely declining .. probably should have listened lol",
            "Friend of mine worked at the big Orange DIY store in Duluth, MN.  Corporate in Atlanta controlled A/C.  Mid-summer, they wouldn’t turn on the A/C because “It’s cold in Minnesota.”  \n\nThey didn’t understand that although our winter temps got colder than Moscow, our summer temps got hotter than Cairo,  plus humidity.",
            "That's hilarious, but why ask to get water? Tell your boss you're getting a drink and will be right back, you're not in elementary school anymore.",
            "I was being punished in bootcamp and I was having to do 8 count body builders. I was super sick and told my petty officer that I was going to throw up. She just counted louder and faster. I told her one more time and she just kept counting. Same as you I projectile vomited all over her through my fingers. Very gross yet satisfying.",
            "Employers are not allowed to withhold hydration. Never ask permission to hydrate. Your health and safety should always be your and your employer’s primary concern. Work comes second.",
            "They water the horses, don't they?",
            "Yeah literally FUCK THAT BITCH... I just had a very bad day with my boss, but this made me feel a lot better! Hope you’re doing ok now!",
            "it's a fine balance between dehydration and hyponatremia, I take salt pills to help with that",
            "I suspect that the ratio of vomiting to projectile vomiting on reddit is the direct inverse to real life.",
            "“I work at a... Ahem, particularly green craft and fabric store.”\n\n🎶*Green is not a creative colour*🎶",
            "In the future don't do this, meaning, care for your own safety no matter what your boss says. Your health is nothing to risk, even for a job.",
            "US Dept of Labor\nOSHA Technical Manual Section III: Chapter 4\n\nHeat Stress\n\nhttps://www.osha.gov/dts/osta/otm/otm_iii/otm_iii_4.html",
            "Could you imagine if you had passed out due to heat exhaustion",
            "So many violations here, start taking pics and document. You have rights.",
            "Heat exhaustion sucks but as a fellow northern New Englander I’m going to call bullshit on it being 70-100% humidity during the summers. I live here too and I’m from Georgia where it is actually 90-100% humidity for the majority of May-September, there’s a big difference.",
            "A nice email to your HR will fix that shit quick.",
            "I'm not aware of any laws regarding what is considered a safe workplace, but I have had to work in temperatures as high as 120°F above 80% himidity; but a good boss makes it clear that you need to stay hydrated and take breaks when you need to.",
            "TIL Maine is humid all the time.",
            "I ALSO WORK THERE AND THEY WONT TURN ON OUR FUCKING AIR EITHER. I closed tonight and it was 78 when I was locking the doors. Corporate keeps canceling our work orders saying they've sent someone out already that has supposedly fixed them. No one has ever come out. Customers are leaving full carts saying its too hot to shop. I've had asthma attacks from how humid it's getting in the store. Absolute bullshit. \n\nAlso sorry to hear that your drivers don't unload the truck for you. We have rollers that attach to the truck and the driver just rolls the totes/ boxes down and we organize from there. Hang in there!!!! Hopefully your guys inventory is done and you just have to hold out until black Friday lol",
            "During summer the bake room that the bakers use at work gets upward of 120-130 °f ... they still work in there and are expected to keep pace with what the production line makes",
            "100ºf is litterally the average temperature in my country lol.",
            "Well obviously the humidity wasn't 100% because that would mean the heat index is well over 135°, but I get your point.  I've been building bridges for about 7 years now and the one think you don't fuck around with is heat sicknesses.  Especially if you are in direct sun, you will need water every 30 minutes or you have a good chance of getting sick.\n\nIf you start to feel too hot or you stop sweating, you need to break and cool down.  Put some cold water or ice pack on your wrists, it will help cool your blood.  Never dump cold water on the back of your neck, cool water is okay just not cold cold.  \n\nAnd look out for your coworkers.  Judgement and smart decisions go out the window when a person is overheated.  Once you've had a sun stroke or heat stroke, you'll never be able to take the heat like you used to.",
            "Please translate for non Americans",
            "Any boss that says you can’t get water should be drowned",
            "Puking on things that displease is always the correct answer.",
            "*How to deal with dumb managers during summer 101*",
            "Denying someone a water break is pretty illegal most places. Like negligence level",
            "ITT employers torturing the workers with excessive heat and cold in ways that don't even save money.",
            "Heat stroke can kill you, that bitch is in huge trouble",
            "100 farenheit is about 37.5 degrees celsius",
            "Dude, seriously, bring this up to corporate. Ignoring the signs and complaints regarding heat exhaustion and heat strokes is an OSHA (Occupational Safety and Health Administration) violation, an outright crime against workplace conditions. Such a complaint will light a fire under Corporate's ass real quick.",
            "Well done op. You’ve fixed it for everybody.  From now on ‘Excuse me boss, i’m feeling hot, I need a drink, I think I’m going to throw up’ will not be denied. Especially if you cup your hand over your mouth as you approach her.",
            "Because of humidity real feel is like 40°c",
            "I don’t think 100% humidity is a thing, is it?",
            "She’s luckily all you did was puke",
            "100% humidity? Wouldn't it be raining in the back room at that point?",
            "I see stuff like this on here all the time, and I'm starting to wonder.\n\nWhat the hell is it with people not using their executive function?  Is it age?  It seems like it's mostly younger people.\n\nIf it is 100% humidity and 100 degrees, I go get a drink.  You're not a prisoner, go get a drink.  Hell, if it'a 65 and 40% humidity I'll get a drink if I want a drink.\n\nSo many of these little malicious compliance things start with somebody asking to go to the bathroom or asking to leave to take care of women's hygiene, or just asking for basic human things in general.\n\nI don't understand how people don't feel like they are in control of themselves and are able to decide what is best.",
            "I wish you success on reporting this incident! Hopefully it gets looked into and justice is properly served. Do tell us what happens!",
            "Due to rules of this sub, Im just going speculate that this is Jo-Ann Fabrics. Its just a hunch but wow thats awful that this is what you go through at work.",
            "I swear to the sweet baby jesus when I retire and open up a store/restaurant I'm going to treat my workers like living human beings. I worked in retail for ten years all the way up to higher level management. Never once in my time there did I treat anyone with discourteousness and even backed them up when they were chewed out by customers. I don't understand why acting like this is so pervasive in retail.",
            "The backrooms",
            "Yeah. I believe a call to OSHA would do you a load of good. Working conditions of this nature are prohibited.",
            "Man that is fucked up.  I used to work in a lighting rental warehouse so on top of 100F+ regularly I was around 1000w+ lights all day.  The boss in my department would regularly make us break for water so we didn't get heat stroke being in there.",
            "These people will be the very first against the wall when the pitchforks come out",
            "This needs to be your go-to move.\n\nCan I leave early to catch a movie?  no.....PUUUKE!\n\nI want to take my lunch 10mins late so I can chat with my.......nope....BLURP!!",
            "Given that it's only going to get worse, please keep us updated with what happens with that horrible boss, and if anyone else gets sick before they do something like turn on the AC....",
            "Ok so legit i work at a well big frachise of fast food and i was on grill. No ac really to speak of so it is like 100 back there no matter what. I puked today. Heat exaustion is not fun. A lot of the time i go and stand in the frezer witch is like 10 to negitive 10 degrees f. I need a new job.",
            "Dont stay there. Ive gone full jarhead water scene on my guys when its a hot day and we're unloading a truck. Get a manager who cares for you",
            "Sounds like you need to talk to corporate too. They should turn the air on at the manager or district managers discretion.",
            "Pleaasssseeeee report her ass to whatever ministry of labour that you have. Fuck managers like that, she could have seriously injured you.",
            "Sounds like Michaels. I did that exact job for like a year but with less shitty managers",
            "She cant tell you that you cant get water.",
            "I feel you. I unload those type if trucks at a large orange store. Same problem with the heat. Luckily my boss generally avoids the back like the plague while we're doing it, just complains later on about how we don't do anything right. And I make sure we have a case of water bottles back there at all times.",
            "Is it the Bangor one? I’ll stop going there if it is.",
            "Where in maine .",
            "I bet the puke was warm on her and made her feel  hot",
            "That second sentence gave me awful flashbacks of cutting fabric on black Friday one year.",
            "It's the Christmas tree shop. \"green\" ya right",
            "Call the ethics hotline, if you have one.",
            "Why doesn’t anyone say the store names",
            "So how'd she reacts the rest of the day?",
            "Osha would love to have a chat with you.",
            "He needs to be educated about heat syncope. Doesn't he know it's hazardous?",
            "I know I'm late but chug like a whole bottle of pedialite.",
            "Luckily the worst ive gotten of heat exhaustion is the lack of sweat and dizziness/lightheadedness. Shit sucks ass to have and frankly id sue the bitch for putting me through that",
            "At my husband’s work, if it gets over 90F or below 30F, the guys on the dock are allowed to go home, with pay because the company feels it’s too dangerous to work in those conditions. They also get free ice cream in the summer and free coffee/tea/hot chocolate in the winter.",
            "Mate, 100°F is 37°C , 97°C is almost the temperature of boiling water",
            "Didn't know there are jobs in The Backrooms",
            "37 in Celsius. That's simply inhumane - i'm dying in 33 when I do nothing but lie in shade and above 28 is too hot in general. But to actually do manual labor in that heat? That's a health hazard.",
            "Damn this is some fucked up shit. I live in NH and yesterday was soooo hot, maine is only about 20 mins so i imagine the temp was around the same.",
            "Good lord, I work for that spark-ified big box store (for two of their facilities on different sides of the country) that has an evil reputation and they let us have bottled water on the floor, in the back unloading trucks and at the registers. In fact, they give us the bottled water in coolers full of ice from the store brand packages that were busted open off the truck. If my employer with its less than stellar reputation is lenient on the water issue, there is no reason why your employer can also be unless your management are just dicks.",
            "of course she won’t let you leave.. nobody can leave the backrooms",
            "Why would corporate control ac wtf?",
            "Might as well have no HVAC at all. Report that too.",
            "That sounds a lot like what I had to deal with working at Michaels. Offloading the truck in (Canada, so nearly 40 degrees with humidity) weather. I'm a little chubby so that shit hits me double hard. I'm working hard, i'm still pretty athletic for my size, soccer 2x a week and indoor hockey on weekends, but I was genuinely seconds away from passing out. Luckily our manager isn't an asshat, but our director is. Manager let me get water multiple times because like, fuck, I was dying lmao. Because of us all getting water so often our truck was delayed and the director gave us shit for 15minutes about it in her office. Which had 3 fans in it, because she sat in there all day.",
            "holy shit. in tx at least they take heat related threats very seriously and encourage frequent breaks and hydration in conditions like that. with humidity that high that must have been absolutely miserable. denying a break/water to someone in those conditions is a huge fucking deal.",
            "If a company is so deficit that A/C \"costs too much\"......then that company has already sunk well below the Fail Line, to me.",
            "When it comes to your health and well-being, don't ask, tell. They cannot force you to do anything that could potentially be life threatening. Next time, just inform them what's going on, and do what you need to do to keep from getting sick, injured, etc. Any manager worth a damn will be well aware of how expensive and time consuming a workers compensation claim is for a company on top of the loss of a worker and what needs to be done to mitigate the labor shortage that goes along with it.\n\nAs for the current situation. I would formally report the manager to HR. If there is no HR rep or department, immediate supervisor will do. Though you can go over them as well if needed, it's more of a courtesy to talk to the immediate supervisor first, but I don't know the office culture where you work.\n\nIf reporting the unsafe working conditions or reporting on the bad manager gets you no traction, you can go up the chain farther, or threaten to report the company to the labor board for unsafe working conditions. This is also a sound tactic for any repercussions that may be coming your way for the vomiting incident or if your manager tried to punish you for just informing them you're feeling the telltale signs of heat exhaustion and went to get the drink your body needs. \n\nLabor laws are pretty clear on this, but I would recommend you also read them, as well as any labor laws or regulations in your state. Also, if you need to make the labor board threat, that tends to make an HR reps anus pucker up, as the labor board will be quite heavy handed with their judgements on a situation. However, any company/manager/HR rep worth a damn will never need to have this threat made. Lastly, this threat can also tend to be a nuclear option, as a shitty managers/etc will look for other reasons to let you go that are unrelated to the specific situation the threat was made for. \n\nSorry for the Tolstoy. Hope you're feeling better and good luck!\n\ntldr; Report the shitty manager to the appropriate authority in your company, and also report the incident that put your health/life at risk. Use reporting to the labor board as incentive to get the issue resolved if you get resistance and prepare for possible other repercussions as a result.",
            "on a semi-unrelated note, why does heat exhaustion cause you to vomit?",
            "Call OSHA, like right now.  You can do it anonymously and they take that shit seriously—the heat kills people every year.",
            "Omygosh! Im in NH and before hearing the boss get fired part and some of the other details, I though this was my boss (i work at the same green craftstore and some of my coworkers are from ME too)\n\nEdit: isnt it the most stupid thing that corporate controls the thermostat?"
        ]
    },
    {
        "post_id": "ylke3z",
        "author": "oyeee8825",
        "title": "Husband complies with wife’s demand",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ylke3z/husband_complies_with_wifes_demand/",
        "score": 12952,
        "num_comments": 286,
        "created_utc": 1667523319.0,
        "selftext": "My favorite example of malicious compliance happened about 10 years ago. I’m a dentist and one Saturday morning I got a call on my cell from a older patient of mine (we are closed on the weekends). \n\n“Doc, I’ve got a tooth that’s just killing me” he said. I told him I lived just 10 minutes down the road so why doesn’t he come on in and I’d see if I could get him out of pain at least. “Naw doc”, he replied, “I’ve got some Jack Daniels here and I’m doing just fine. My wife told me I had to call you so I did.  I’ll call your office Monday morning and see you then.”  Then he hung up. \n\nStill one of my favorite patients and favorite story to tell.",
        "permalink": "/r/MaliciousCompliance/comments/ylke3z/husband_complies_with_wifes_demand/",
        "comments": [
            "How do you apply the Jack Daniels? With a cotton swab? Or orally? What dose?",
            "I liked it. I picture him about 62, tall, half bald, and wanting his tooth fixed to he can go fishing!!\n\nSeems like a gentleman to me!",
            "[deleted]",
            "Reminds me of how I medicated prior to undergoing my first (and so far only) root canal.  I just drank a lot of bourbon to deaden the pain/my brain until I had the opportunity to visit a dentist.\n\nAnd for the record, thanks to modern anesthetics a root canal is far less horrible than most people make it out to be.",
            "That old man knows how to husband.",
            "I just imagine the wife fed up having to listen to him complain about the pain telling him to just call the damn dentist but him not wanting to because he couldnt miss what was on TV or didnt want to pay the after hours fee (if thats a thing)",
            "\"You treat an outside wound with rubbing alcohol, you treat an inside wound with drinking alcohol.\"",
            "You should post this in wholesome compliance too.",
            "How incredibly awesome to be reachable by your patients in case of weekend emergency! I’ve been living in agony for over a year with all my molars and some other teeth broken and crumbling due to a medication, and can’t find a dentist that will take my state insurance for extractions and also take cash for sedation as I know they all need to come out and have a severe phobia that prevents it being done while awake, and having dealt now with some of the most rude and dismissive dental practitioners in the Midwest in the course of hunting for final relief, it restores my faith and renews my hope that the unicorn of a dentist that cares exists. You, sir or madam, are awesome. Thank you for being how you are.",
            "I took over a work section from someone who was a notorious micro-manager. If someone called in sick, he'd grill them endlessly about why, what their symptoms were, what they were doing about it, etc.\n\nMy first meeting with the team I made clear I would no longer do that because their illnesses and their sick leave belonged to them. I reminded them of policy that said if they were going to be out sick for more than 3 days that I \\*MIGHT\\* ask for documentation, but we'd play it by ear.\n\nA few weeks later the section lead called me at like 6am and before I could catch the call it went to voicemail. The voicemail had the callers voice saying bluntly \"I'm sick,\" followed by the loud flushing of a toilet. That was it and it still makes me laugh.",
            "Another dentist here. With me Usually it’s the wife calling and you can hear the husband in the background yelling to hang up.",
            "Dental nurse here. Some patients are just golden like this one. If only all of them were so chill :D",
            "I like to imagine that she told him if you're going to complain about it you need to call the dentist and so he called you just so that he could continue to complain about it.",
            "Very cool, respectful all around.",
            "I’m seeing some posts about whether this is malicious compliance or not so just wanted to post my reasoning in a top-level comment. I’ve always used malicious compliance to mean following the letter of the law but not the spirit - sometimes it can have actual malice involved and sometimes not. Kind of like how people thought niggardly had something to do with African-Americans (not perfect analogy but best I can think of right now). So in my story:\n\nWife MEANS: get your tooth checked\n\nWife SAYS: call the dentist\n\nHusband doesn’t want to bother me and/or miss his football games so he does what she said but keeps doing what he wants. \n\nHope that clarifies things.",
            "Lol. I am a massage therapist and sometimes I have to ask new male clients, \"what did your wife want you to come here for?\"",
            "I had to go 3 days with a toothache in the worst pain of my life. It was a 10, childbirth was a 5. All they could tell me for pain was alternate Tylenol and ibuprofen. It was so bad I had to drink whiskey to make it through until the extraction. Wouldn’t prescribe anything for the pain. 3 shots didn’t take away the pain but at least made me fall asleep. After the extraction the pain was gone immediately, and that’s when they gave me Vicodin 🙄",
            "I tried JD a cpl times for tooth pain, didn’t work.\n I tried a edible for tooth pain it worked.",
            "I'm not sure this is malicious, but still a fun story.",
            "I had a dentist in FL  who had a dentist chair in his kitchen! I was pregnant & had braces He did adjustments for me there, I just googled him and found his obituary , now I'm sad, he was such a good man",
            "PSA: when you got the man-flu really bad, a bottle of booze is the best thing that doesn't help :)",
            "Men🙄",
            "[deleted]",
            "Hah,",
            "Can someone explain like I'm 5?",
            "He later died of sepsis when the infection spread uncontrolled",
            "I don't think that's as cute of a story as you seem to think it is",
            "Cute story but it doesn’t fit here as there is no malice.",
            "Made it through a weekend swigging whiskey to numb the tooth. Got in Monday morning. Didn’t want to miss the weekend activities.",
            "Compliance, but decidedly not malicious.",
            "Did that once. Pulled out my own tooth after a few sips. Not recommend, but works in a pinch.",
            "Oil of cloves and a drop of brandy. Only cognoscenti will get the reference.",
            "LOL!\n\nMy husband and I have the same PCP. He used to smoke. He vapes now. Anyway, when I'd go see our doctor at the end of the visit she'd tell me, \"Okay, now tell (husband) that he needs to quit smoking.\" Me, \"Ok.\"\n\nAs I walk out to my car after the visit I call my husband and say, \"Okay, Dr. PCP told me to tell you to quit smoking so I'm telling you to quit smoking.\" He'd just respond with, \"Ok.\" LOL!",
            "[deleted]"
        ]
    },
    {
        "post_id": "lp1v4s",
        "author": "None",
        "title": "Make my friend cry and then lie about what I said in an official document? Okay, I’ll play your games.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lp1v4s/make_my_friend_cry_and_then_lie_about_what_i_said/",
        "score": 12951,
        "num_comments": 298,
        "created_utc": 1613928322.0,
        "selftext": "TL/DR at the bottom.\n\nOnce upon a time, there was an evil witch...\n\nThis all happened my senior year of college, spanning about 6 months.\n\nI lived in a duplex where the main floor and second floor were occupied by myself and friends. Often times, we’d throw parties in our incredibly large attic. One of these times, we got a noise complaint. Everyone was very respectful when the cop asked us to shut things down, and left no problem. All residents were 21/22, and we were the only ones asked to ID ourselves. Had a fine conversation with the officer, and he went on his way. Probably one of the easier incidents in a college town.\n\nWhile we lived off campus, any incident like this does get reported to the school. All 6 of us received a letter stating we had to go to a class about drugs and alcohol because we “threw a party where drugs and alcohol were supplied to minors”. We could of course appeal this, and we did. The school only needs 51% certainty that the event occurred how they thought it did. Seeing as everyone ID’d was 21 and there had been no drugs, we thought we had a strong case.\n\nThis meant all 6 of us had to meet with the ass. Dean individually to go through the events of the evening so she could ascertain what really happened. First 4 went fine, my female roommate was 5th, and I went last. \n\nShe came home in tears. The ass. Dean apparently tried to rip her to pieces, said she had awful friends, why not just admit we had drugs and given alcohol to minors. \nShe stuck to her guns but it sounded awful.\n\nI can handle that stuff, but I HATE seeing people I care about go through situations like that. I went in prepared to my meeting, already hating this woman. I even had my phone recording the conversation in my shirt pocket. (Single party consent state in terms of audio recording) the conversation ended with her saying “why can’t you just follow the rules and act like a grown up”.\n\nA few weeks later, we all received another letter. They had dropped the drugs alcohol bit due to lack of evidence, but had decided we had “created an unsafe environment with only one exit”. There were a few lines in the letter where “student X said in the event of a fire, guests would’ve been asked to jump out of the rear window” and other completely fabricated statements. Sure, there was only one flight of stairs up to the attic. But unbeknownst to the assistant dean, we had one of those fire escape ladder window things. \n\nWe appealed yet again. But the second time around, you meet with a board of peers (teachers, students, assistant dean, and the police officer that had responded to the complaint) \n\nBeing a law nerd, I volunteered to go on behalf of my friends. That being said, we were allowed one person as council that couldn’t say anything to the board, but could write things down to pass on to me.\n\nCue MC and “following the rules” just like the ass. Dean had asked.  \n\nI showed up early, as did the officer. He was totally chill, and was getting paid OT to show up to a meeting to do nothing instead of the usual route.\n\nEveryone shows up, and the ass. Dean immediately questions why I have someone with me. “Well per school code 14 subsection B etc. I am allowed to. This is my friend X, who has a law degree. Just following the rules.” We get into semantics and how dangerous our party could’ve been blah blah. I get to speak last, without any interruptions, until I yield. \n\nTime to drop bombs.\n\nI pull out printed sheets for everyone in the room of my Amazon account showing I had purchased the fire escape ladder thing months before the party had happened, proving we had indeed had multiple exits. \n\nI then passed out copies of the letter we had received written by the ass. Dean, and had highlighted all of the fabrications and lies about the previous conversation I’d had with her. \n\n“I recorded our entire meeting. I’d like to take time for you all to hear that.”\n\nAt this point she’s FUMING and blurts out that what I did is illegal. The cop butts in and just gives that a big ol’ NOPE. Single party consent for audio recording.\n\nWe all listen to the full 15-20 minutes. \n\n“So as you can see, all rules were followed by myself and my peers, and nothing unlawful happened. Not one of the highlighted sections was actually said. The only thing that worries me is how the ass. Dean openly lied as well as brought my roommate to tears. I’d ask that all charges be dropped at this time against us” \n\nShe then tried to backtrack saying she had made “grammatical errors in the letter”, but everyone was smart enough to see the difference between the wrong form of Your and telling people to jump out of a window. \n\nA few weeks later we all received another letter stating that we were good, and no further action would be taken. \n\nI then went out of my way almost daily to walk through the admin offices where the ass. Dean’s office was to give her a wave and a smile. \n\nTL/DR: Threw a party, got in trouble. Appealed the ruling, ass. Dean made my friend cry and I took it personally. Followed all rules and made her look like an absolute fool during the hearing.",
        "permalink": "/r/MaliciousCompliance/comments/lp1v4s/make_my_friend_cry_and_then_lie_about_what_i_said/",
        "comments": [
            "Wow, the process they put you through was harassment in itself.  Talk about guilty until proven innocent. \n\nThe ass dean clearly hated her job and the people she was there to serve, the students.",
            "Normal people will make occasional errors by misunderstanding, misinterpreting, remembering incorrectly, whatever and it isn’t a problem to quickly correct the error(s) and move on. (Of course excessive but innocent needs attention but that’s still a different story.)\n\nThis doesn’t sound like an innocent well-meaning oopsie. What if OP had not made the recording? What if they had been unable to show that the Dean appeared to be intentionally and maliciously lying? How many innocent people have suffered because of this person? How many more will he falsely accuse? At what point should he be removed from being able to damage other lives?",
            "The ASS Dean",
            "Best thing is, you've made a case against all prior and future incidents the dean is involved in. If ass lied once, specifically to cause trouble for students, then noone will trust them again.  I hope you can report them to the board of learning/teachers for an ethics violation.",
            "Wait a second. The post secondary school gets involved if adults throw a party? America is weird.",
            "Now this is epic, Hats off for making my afternoon start with a smile!",
            "Report this to the school board with a full transcript.",
            "Wait, you live off-campus but the University can just go all up your private business like that? What kind of dystopian country do you live in?\n\nThat shit would totally not fly here, even if you really would have a drug party, and not just a regular straight edge party like you had. You totally could have a party off-campus and do a mountain of blow, if the cops are on your case for that, that's that. Unless you do go to jail for it, the university would have nothing on you.",
            "I forgot all about this until this moment but thirty years ago I lived in a dorm and got a knock on the door from the RA because of noise.   We had arranged the furniture so opening the door wouldn't give a view into the room, so they couldn't see anything but wrote us up for noise and because he \"smelled alcohol\".\n\nWe appealed and argued that the noise was during reasonable hours and because we were playing Pictionary.   We got into a very pedantic discussion over the percentage of rounds that were \"all-play\" rounds where people would be yelling and trying to get the first right answer, I don't remember the math but we were right and they were wrong.  \n\nThe more serious charge was alcohol (we were underage).   We were allowed to question our accuser, and as a science major and a bartender, I just asked him \"You said you smelled 'alcohol', right\"?   \n\n'yes', he answered.\n\n\"Was it beer?\"\n\n'alcohol.  I know what alcohol smells like'\n\n\"Not whiskey, or beer, or wine?\"\n\n'alcohol'.\n\n\"So you're saying that alcohol has a distinctive odor that you recognize\"?\n\n'yes'.\n\nWe introduced the dictionary definition of ethanol as an 'odorless' (among other things) liquid, and literature from my state-sanctioned alcohol safety and awareness course that said the same thing.\n\nWe won.  I felt like Paul Newman in \"The Verdict\".",
            "She willfully fabricated lies to try and get you and your friends in trouble.. Why the fuck would this horrid bitch do something like that? What grudge did she have against you? You broke absolutely no laws so why does she feel the need to make shit up? The bitch shouldn't have that job, if you ask me.",
            "[deleted]",
            "\"The ass. Dean\"\n\nI see what you did there. 🤣",
            "This had me grinning in my seat reading it",
            "I know you meant asst. dean. But I chose to read it as\n“Ass dean” the entire time.",
            "This was is precisely why we must constantly challenge authority.",
            "why does the school care about what people do onntheir own time?",
            "I got a happy high just reading this. Love it, would absolutely also plot vengeance against anyone who made my friends cry.",
            "> ass. Dean \n\nNice",
            "The “ass. Dean” is so accurate",
            "I pray that every Karen type of person gets a massive dose of karma that smacks them in the face.",
            "love the daily waves.",
            "How was she not fired for lying like that? I mean if I was a chairperson or whoever is responsible for selecting staff my first thought would have been if she is lying about something this small what if she does this shit in bigger stuff like grade dispute, sexual assault claims, and how much liability the university might be in if it turned out she lied in a report about sexual assaults or rapes either giving a pass to a rapist or framing people for shit they didn't do. I would review every expulsion she has ever made.\n\nEdit: I know that a lot of schools have internally reviewed sexual assault response (that usually involves campus police and the Dean) before going to the police or even in lieu of going to the police because they try to avoid public embarrassment. This is the only reason I bring it up.",
            "Administrative bullies in high school often get away with it because they're picking on kids.\n\nAdministrative bullies in college always seem to get bagged eventually by someone who's tired of them.\n\nGood on you.",
            "This reminds me of something. Not from my college days, but later in life. It was my birthday, not really important. But it was a Saturday night and me and a few friends have a fire behind their apartment complex. There are about 5 buildings around us and we are not in any way blocking the alley way. Turns out there were 5-6 other apartments that saw us and came to join. It gets to be around 10 and some guy starts yelling out of his window at how loud we are. We ignore him, not my fault you can’t sleep. We aren’t being loud, just talking, not even playing music. About 20 minutes later the fire department shows up. They say we aren’t doing anything illegal, but it’s now 10:30 and we have to ask you to put the fire out. We comply and thank them for being so nice, but we sit there talking anyway. No fire, just people drinking beer and smoking cigarettes behind their apartment. Another half hour goes by and a cop car shows up. He’s gets out of the car pissed off. All he said was that he couldn’t even find us. He was more pissed he was called than than what we were doing. Then we went inside and turned music on for the next few hours. Could’ve just let us be, but now we are inside and listening to music at a reasonable volume with open windows.",
            "This is my favourite subreddit & this is one of the best stories on here. Really enjoyed that.",
            "Isn’t this the plot to Animal House?",
            "I love the little wave and friendly smile in the admin office. I do this, it really gets me through the day. In my case it is to an HR person who lied. If I am ever down then a short visit to HR and a passing wave cheers me up.",
            "Love the attention to detail and care you took to type \"ass.Dean\" each and every time in your story. Brilliant.",
            "> I then went out of my way almost daily to walk through the admin offices where the ass. Dean’s office was to give her a wave and a smile. \n\nI love you.",
            "I thought you were saying ass Dean (which seems fitting) but then half way through I was like hmm that's weird why is there a period here.... OOOOHHHHHH",
            "Congrats on sticking to such a slimy person, and I'm glad the officer was helpful! I wish there was a storybook ending where the Dean got demoted or had to make a public apology and give you and your suitemates some prestigious award for Honor and Service or something.",
            "Just curious, why would a Dean of a Uni even care about students partying? As an English person this is baffling. I thought you guys were 'in the land of the free'?  \n\n\nAt our Uni, there were parties pretty much every single night in most of the dorms.",
            "at the end you should have asked her....\n\n “why can’t you just follow the rules and act like a grown up”.",
            "This was a fucking awesome read, thanks for that.",
            "Not following the punctuation well. Is “the ass” and “the dean” the same person, or two different people? Otherwise, way to beat them at their stupid games!",
            "I hope you are in law school!",
            "What kind of totalitarian dictatorship is this taking place in?\n\nWeird mock trials on a school about adults doing obvoisuly legal stuff on their own property on their own time?\n\nSounds like North Korea.",
            "The \"ass. dean\" reminds me of an almost malicious compliance story myself.  I once had to mail a special tax form to my county board of assessment appeals.  To fit it on the envelope, I mailed it to MY COUNTY BOARD OF ASS. APPEAL",
            "Good job. \n\nReading this I realize people like this Dean become politicians and decide how our life is run.",
            "I love you for this!  I was bullied as a kid so this kind of well-handled situation is golden in my mind.",
            "Should've sued for defamation. Solid case before it even began.",
            "Am I missing something? You lived off campus? How is anything that happens off campus any of their business? (Except criminal charges that could impact the school.)",
            "Why the fuck would a noise complaint during a party where everyone is 21 years old or more be reported to the school? Why and how could the school force you to take classes on drugs and such!?",
            "College disciplinary systems are FUCKED. The absolute worst things in the world. The only rules are what the ass deans and their ilk make up. People get unjustly accused, and real offenders get off scott free. That’s what happens when educators try to play law enforcement.\n\nUniversities should have a system for academic integrity violations, but turn all suspected criminal offenses over to the cops and courts. Have real investigators. Have real trials. Have students deal with real-life consequences for their real-life crimes.",
            "Why would you have to provide proof of a secondary exit for your private residence? If there is a city ordinance that would require an attic to have an exit, it would not be enforceable by the university.\n\nI'm glad you won your case. Shit like this is absolutely bonkers!",
            "oOH ASSISTANT DEAN NOT ASS IM SO SLOW",
            "I really wish you had just written out assistant dean. FFS for the longest time I thought it was just the ass. I mean COME ON, a capital D right after?? SO MUCH CONFUSION till I figured out what the hell was happening. lmao",
            "You were “student X” in the letter? Maybe change it to “Student Gldn_cocktails” - I wasn’t sure how your recording was going to help until I read it over again.",
            "Well done!",
            "Ass dean. Sounds right.",
            "Ass.",
            "The wave and the smile is my fave bit.",
            "My college fraternity got kicked off of campus for similar events",
            "was there any other repercussions to the assistant dean? because if she lied once about that imagine how many times she did it priory and got away with it",
            "Ass. Dean was probably the one that never got invited to parties when she was in college.\n\nWith such a nice personality you can just wonder why.  \nThis was her attempt at revenge.",
            "Ass. dean needs to be gone.  Could you have pushed for that somehow?",
            "*chef’s kiss* Bravo! This made me so happy.",
            "I kept reading ass. As arse and not assistant",
            "So, how many of the people who didn't show ID actually underaged? :)",
            "Great job, OP. A timeless tale to tell for decades! We have so few opportunities to shine like this when we are in 'subordinate' roles.  I'm glad this experience worked out for you so well.  I'm hoping referring to her as the 'ass. Dean' was purposeful. (winky-smiley face)",
            "Your friend is lucky to have you as a friend! That is awesome vengeance.",
            "Ass Dean?  Sweet job",
            "Sounds like she’s been pulling this kind of shit for a long time.",
            "I love this SO much. As someone who went to a tiny university and dealt with SO MUCH administrative bullshit and bullying, this makes me incredibly happy. Our ass deans must have been related.",
            "Ah sweet justice! Please tell me you went on to become a lawyer!",
            "\"ass. Dean.\" looks like their job matches them",
            "Unfortunately academia is FULL of petty human beings who haven’t advanced beyond high school socially. Good for you for calling her out publicly and having the data to back it up.",
            "At first I found \"ass. Dean\" weird but then I realized you'd done that on purpose. GG.",
            "for the whole recount i thought ass. Dean was calling the dean and ass but it actually meant assistant dean. talk about not getting the context",
            "This needs to a movie or short video cause that was amazing",
            "Would have really liked for her to get fired. I hate people like her.",
            "Sounds like the abbreviation of ass. Dean is accurate.\n\nSeriously I'm glad you came out okay. That situation sucks. It never hurts to cover your butt and stand up for yourself.",
            "Good on you for standing up for yourself! I think it's very comical how university disciplinary committees will go through so much trouble trying to nail you to the wall for minor noise complaints, but will do the exact opposite for predators on campus.",
            "AND I TOOK THAT PERSONALLY!!!",
            "Good story.  NOT malicious compliance!",
            "No panty raid? Fucking kids today.",
            "Ass is usually short for associate or associated, asst is short for assistant. Would be better to use assoc for associated though, regardless.",
            "Your Dean sounds like a Karen...",
            "I love it! Lol",
            "I'd enjoy this if this was a movie. Reminds me of \"Ferris Bullet's Day Off\" for some reason",
            "Even though you followed due procedure and proved the ass. Dean wrong (kudos for that btw) sounds like you're in for a backlash. These people are petty and high on authority, making a fool out of her will make her miserable but she will also constantly look out for a way to make your life difficult.",
            "This is a good one :)"
        ]
    }
]