[
    {
        "post_id": "15bpr38",
        "author": "mechpaul",
        "title": "You want to have girls over all the time? Ok. Have it your way.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/15bpr38/you_want_to_have_girls_over_all_the_time_ok_have/",
        "score": 12945,
        "num_comments": 1903,
        "created_utc": 1690526879.0,
        "selftext": "**THE SETUP:**\n\nI have a 2 bedroom house. I decided that I wanted to rent out the other bedroom in the house to make some money on space I wasn't really using after COVID. So I fixed up the place really nice:\n\nThe tenant gets:\n\n- Private, semi-attached bathroom (bathroom is actually outside the bedroom, but I put up drapes between the bedroom and bathroom so tenant can walk between without me seeing)\n\n- Common consumables! (I pay for toilet paper, paper towels, laundry supplies, kitchen supplies, etc.)\n\nI create the lease. The lease is very barebones. It just says \"you get a room at this property. You pay this much per month. Landlord covers all utilities. Your lease is X months long.\"\n\nI created the ad. In the ad I mentioned how \"it's ok to have guests over, but keep it to no more than twice per month\". I did not put this into the lease agreement. You can see where this is going. \n\nI do a showing for a prospect, T. I tell him the guest policy and he seems just fine with it. I do the rest of the showing and all seems grand. He signs the lease agreement and moves in.\n\n**THE PROBLEM:**\n\nThe first month is grand. Anyone can fool someone for a month. But eventually you return to bad habits. His bad habit was women. He would have women over 4-5 nights per week. I did not appreciate this.\n\nI pulled him aside to tell him \"Hey, you're having a lot of girls over. You need to reduce how many girls over or, if you're willing to pay a bit extra for having all these girls over, I won't say a thing.\" He initially agrees with it.\n\nThe next day, he calls me down and asks to speak with me at the dining room table. It's T and his girl du jour, G. T begins arguing, \"How can you ask for more money when that's not in the lease agreement? You can't ask for that.\" I told him the guest policy was in the ad and that we spoke about it when he came here. He said, \"Yeah, but you can't ask for that. If it's not in the lease agreement you can't do that. The guest policy isn't in the lease agreement either, so I pay rent. I can have over whoever whenever I want.\"\n\nG piped in, \"You just need to take the L on this one and write better lease agreements.\"\n\nI replied to G, \"You're not on the lease agreement, so I don't give a shit what you think about it.\" I turned to T, \"It was in the ad. We also talked about it when you came here. You knew about this.\"\n\nT replied, \"Woahhh man calm down. It's just six months man. That's my lease term. I'll be out of your hair in six months.\"\n\nI replied, \"Why can't you stay at her place?\"\n\nG said, \"That's none of your business.\"\n\n\"Shut up, G. I don't care what you think. You want a problem, T? You got one. This is not cool and you know it.  Why does she have to be here 5 nights a week? She practically lives here. I signed a lease with you, T, not with her. Why is she here?\"\n\nHe shrugged, \"Can't help it. Not in the lease agreement man. That's what lease agreements are for.\"\n\nI was infuriated. We talked about this. He's choosing to follow the lease agreement. Okay... fine... what's a guy to do? I want him gone. I don't want T & G teaming up against me in my own house!!\n\nThey walked upstairs and turned on the loud music in their room.\n\nLater in the evening, G was downstairs cooking something on the stove by herself using my pots and pans. She's cooking for herself in my house! She's not even a tenant but she sure is acting like one.\n\nG tried striking up a friendly conversation with me, but I just gave her absolute silence for 10 minutes while I cooked. I took my food upstairs.\n\nThis is war. I'm going to follow the lease agreement TO THE LETTER. If I advertised a feature in the ad but it wasn't in the lease agreement, that thing is GONE.\n\n**THE COMPLIANCE**\n\nEvery day I took something away.\n\nI first started by removing all the common consumables from the house. He texted me later, \"Man, you removed all the consumables? You need to come down on the rent.\" I replied, \"Not in the lease agreement.\" He said, \"It don't got to be like this.\"\n\nI removed the drapes between his room and the private bathroom.\n\nI took away the chairs for the dining room table.\n\nI then shut off the clothes washer and dryer (circuit breakers were in my room) and left taped up the location of a local laundromat.\n\nI also became an absolutely filthy roommate. I didn't clean anything. I left bags of garbage wherever I felt like. I never cleaned the kitchen and left the sink full of dishes. \"Please man can you clean up\" \"No.\"\n\nI had maid service. Cancelled that. I informed him of the change. \"Can you come down on the rent, man?\" \"Not in the lease agreement. You agreed to a rental price.\" \"C'monnnnnn\"\n\nI turned off the breaker to the stove and left out a wall outlet single pot electric plate for him to use.\n\nI turned off the microwave. Not in the lease agreement either.\n\nI actually started feeling bad for him. G started coming around less and less as I made the living situation worse and worse.\n\nFinally, he texted me, \"Do you want me to move out?\"\n\nI replied, \"Yes, when are you leaving my house?\"\n\nHe said, \"End of the month. You'll let me break the lease?\"\n\nI replied, \"Of course.\"\n\nHe left at the end of the month. I had my house back. I made for sure to make my next lease agreement way more specific about EVERYTHING.",
        "permalink": "/r/MaliciousCompliance/comments/15bpr38/you_want_to_have_girls_over_all_the_time_ok_have/",
        "comments": [
            "It was MC on both sides.  This is why contracts spell everything out.  If not then this is the result. Totally worth a consult with a lawyer (specializing in landlord-tenant law) anyway, you don't want to inadvertently run afoul of landlord-tenant laws for your city/state.",
            "The reason standard form leases exist",
            "When you think being a landlord means you just get extra cash without legal protections for your tenants. Clown shit",
            "This definitely fits but OP is a colossal idiot for manually creating a lease agreement. Legal-reviewed ones for any jurisdiction are available online often for free.",
            "\"Guests no more than twice a month\", I'm amazed anyone was interested in living with you TBH.",
            "This is malicious compliance regardless of whether other redditors agree with you doing it. It belongs here.",
            "Sorry but as soon as a post includes a movie-script/beginner-fiction style conversation my BS radar goes off lmao.",
            "What kind of stupid rule is guests only 2x a month? Are you a landlord or a parent?",
            "Guests only twice a month? That's a load of horseshit.",
            "It wasn’t on the lease. He pays rent and can have guests over. It’s pretty simple. Definitely malicious compliance however.. just a series of dick moves really.",
            "Alternate title: “TIL why standard lease agreements are so long.”",
            "Not gonna lie, you sound unhinged.",
            "The influx of home owners renting rooms in their houses but not actually wanting a roommate is on the rise. \n\nI’m seeing these stories quite frequently nowadays and they all start to follow the same script. \n\nThey want the extra cash to be able to fully afford the house but are not actually willing to share the space. \n\nThe insane and unreasonable requests almost always start once the tenants begins to become comfortable in the space they pay for.",
            "This isn’t really MC. The tenant is right, you can’t enforce rules that aren’t in the lease. You essentially broke a bunch of laws in response. If your tenant was more savvy this could’ve ended really poorly for you.",
            "Yes, it's MC. Yes, you got extremely lucky. If your tenant was more belligerent or litigious this would have been an extended shit-show. You essentially decided to live like shit because you were too lazy to write a proper lease, you wanted to re-invent the wheel as a square when there are plenty of excellent circular wheels already out there.",
            "Sharing your home with a renter is never worth the rent.",
            "Lmao it’ll be a cold day in hell when I side with a land lord. What was the problem with him having a girl over in the first place? Seems like he was just jealous",
            "I can already tell some people may not like this OP lol but it is what it is, I think this fits here. Well played",
            "You got lucky. Quite a few ppl would ruin a landlord's life for starting a pettiness contest like that",
            ">no more than twice per month\n\nThat's rough as fuck, dictator spec stuff. You seem a lot more petty than malicous",
            "That was a really shitty thing to do, OP. Shitty and illegal.",
            "Parol Evidence Rule.  \n\nContemporaneous written or spoken agreements that are not reflected in the contract are not enforceable.\n\nIf it ain’t in the contract then it doesn’t matter what was “agreed” to.",
            "When r/maliciouscompliance is actually r/opisapettylittleprick.  Yeah it fits here because it's MC, and no this isn't r/aita but OP is TA and then some.",
            "I get that the tenant was a dick, but you are lucky they didn't sue once you decided to turn off appliances.",
            "Good lesson learned and also highly illegal. \n\nTurning off appliances, while not in the lease is a violation of tenant rights. For example, leases don't have air conditioning in the lease, however if you turn off or fail to repair the air conditioning in the middle of a Phoenix summer, you are not providing the tenant with a safe living environment. Any appliances existing while the tenant was shown the place showed be working unless the lease states otherwise. I am no lawyer and state laws vary, but I am guessing this is almost the case. \n\nAnyway, it worked....",
            ">\"it's ok to have guests over, but keep it to no more than twice per month\"\n\nI'm going to be honest with you: this is an unreasonable request for a tenant. You were begging for trouble with this and you got exactly what was coming. You're extremely lucky that your shitty lease was shitty in ways that benefited you.\n\nBe a better, more prepared landlord or don't rent out the room.",
            "The second you turned off a utility, you broke a law.  Tenant should have reported you. I’m also willing to bet you didn’t file the proper paperwork to rent out a room. \n\nAlso, you’re a liar. \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/wjqwwb/aita_for_enforcing_a_guest_policy_thats_not_in/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1",
            "You sound like someone who shouldn’t lease out to people if you complain about every little thing.",
            "Twice a month?? Damn.. why are there even landlords like this. If you are that worried about a few extra showers a week why don’t you put the water bill on the tenant? So restrictive for no reason",
            "This is ridicioulus.OP was being a hug dick.",
            "Once again a landlord proving they're nothing more than a parasite, and acting like they're chosen by God. I'm glad that tenant was getting laid daily and making your life miserable, you sound like a piece of shit.",
            "I mean, you were planning on being a good landlord and all, but that guy just had to be like that, what can you do?",
            "Tenant was obviously a jerk, but usually the landlord is required to keep everything as it was at the beginning of the lease. You can't just say no more oven, curtains, laundry, etc if that was part of the property at signing, unless the lease explicitly says those things won't be covered if they fail. In this case, they didn't even fail. The landlord just said, \"you lose cooking and laundry privileges,\" which is probably not okay legally speaking.",
            "Taking the time to write an agreement that fails to document the intended agreement is a true self-own.",
            "It really depends on your state. In WI there are very specific things that are laid out. Also, your own area probably has numerous ordinances that you were probably violating (at least with regards to turning off stoves and such). Self-help evictions are absolutely illegal and you’re lucky this guy didn’t lawyer up. https://datcp.wi.gov/Documents/LT-LandlordTenantGuide497.pdf",
            "If you expect specific behaviors from tenants in your home, you must include them in the lease agreement. You didn't & your tenant lived his life as normal. But you took things too far, especially cutting off his access to basic necessities like kitchen appliances.",
            "This is definitely malicious compliance, but goddamn OP sounds insufferable",
            "It’s not your business what your roommate does with other people. You’re an adult.",
            "I used to manage lease agreements for work. They were pages and pages and pages of the most mundane, teeny weeny stupid ass details BUT there is a reason for that. Over the years there’s been a huge increase in people renting out rooms and my friends and family will come to me for advice (my advice is don’t do it) and still move forward and lose so much money, time and peace. It’s not worth it, it’s never worth it and I’m amazed people still do it. If you insist on doing it, at least hire a professional to do your paperwork.",
            "guy posts in LateStageCapitalism, and is a land lord, so im guessing he's not so bright",
            "I'm sorry bud, I'm sure one day you'll have a girl over too 😭",
            "Yeah what you did was probably illegal not MC, as a landlord you have a responsibility to maintain livable conditions which it seems you didn’t",
            "IDK man sounds like the tenant was reasonable and you were just a dick. Don't rent to others again, you can't handle living with people.",
            "I just don't know how you stood to live in the house while it was like that. Was your very next call to the maid service for a deep cleaning?",
            "I don’t get why people are getting upset over the post. This is the sub for malicious compliance, not AITA.",
            "... I can't be the only one who feels like landlords do not get to dictate how often/how many guests someone brings in to the space they pay for.",
            "Kind of a ridiculous ask in the first place of only two visits per month. Are you leasing a room or a prison?",
            "Heavy on the malicious anyways.",
            "This was the evolution of contracts in a single story \n\nStarts off low key proud about not having to make a complicated contract\n\nEnds proud of a long complicated contract\n\n\nIt's like warning labels, every warning usually had a hard lesson",
            "Sounds like you didn't want a roommate or a tenant but just their money.",
            "Op should not have roommates",
            "wow this is why i fucking hate landlords",
            "Man just for financial reason, I understand where OP was coming from. In this economy, having to pay more for another random person who presumably doesn’t contribute much, let alone the inconvenience with an extra person around shared living space, just sucks so bad, especially the initial goal is to make some extra money.",
            "Was hoping this was AITA\n\nBecause well...",
            "This makes you look bad, you know that right?",
            "Lmao you’re a real a-hole but this certainly fits the sub. You could not pay me to admit that I behaved this childishly.",
            "Op is just a shitty parasite landlord",
            "You should know that if you're in just about any US jurisdiction you have no legal right to prevent guests of a contracted lessee from staying for any duration shorter than three consecutive nights, and that is non-negotiable, period.    \n\nWhat that means is that legally, in the same week, the girlfriend can stay the night on Monday, Tuesday, Thursday, Friday, and Sunday. And then the next week she can come back and stay Monday, Wednesday, Thursday, Saturday, and Sunday. Legally. And you have zero recourse. There is nothing you can do.  \n\nThat's one of those things about being a landlord that most amateurs seem to forget - you don't just get to decide you're gonna provide arguably the most critical service of all (housing) and not check up on any laws and expect to not pay the consequences *forever*. Eventually, you're gonna run into that mother fucker like me who knows his rights. And just so you know, I have been sued by four former landlords and I have won every single lawsuit without a lawyer. If there's two things I know, it's rental law and bird law.",
            "I’m not usually on the landlord’s side, but I’m with you OP. This woman lived there 5 nights out of 7, and you’re expected to pay her utilities as well? It was an extra tenant the guy snuck in, expecting her to be able to get away with living in your home rent free.\n\nThe audacity of her using your kitchen like she was a paying tenant was ridiculous. She was acting like she lived there, because she did.\n\nI like how they were all smug after your discussion (which the supposedly non tenant bizarrely inserted herself in when it was none of her business), then they go upstairs and play loud music like they’ve won. \n\nWhile I wouldn’t have done everything you did, overall you were absolutely in the right.",
            "It sounds like your roommate was getting laid a lot and you were being petty and jealous. Tinder is free my friend",
            "All 3 are petty AH's in their own way but it does take fire to fight fire.",
            "I'm not sure you're in the USA, but if so what you did was still illegal, and you're lucky the tenant didn't take it further.\n\n1) even if you put in the number of nights a week he could have guests, it's probably not enforceable.  He's renting a space, and he gets what's known as \"quiet enjoyment\" out of it, and the quiet part pertains to you leaving him alone.\n\n2) The lease may not specifically say that things were to be provided, but by making them clear when the lease was signed you would be on the hook.  Probably not consumables, but chairs and furniture. And def the stove and microwave. What you did is called \"constructive eviction\" and it's an actual misdemeanor, not just a civil issue.b along with being filthy. (you are the landlord, you implicitly agreed to provide a clean, livable space).\n\nIn is entirely possible that in the right place and right judge, you would owe this dude *a lot of money* and possibly have opened yourself up to criminal charges.\n\nTo other renters: know your rights. Don't allow landlords to pull this shit (honestly, don't move in with a landlord, really. But if you do, know your renter's protections)",
            "Hmm my takeaway from this is Fuck Landlords and Fuck the OP specifically.",
            "Wow, what an amazing problem that you created for yourself.",
            "No one else is going to tell you this, but you don’t want to be a landlord and you sure as shit don’t want a tenant.\n\nYou just want money.\n\nHuman beings have social lives. Human beings have sexualities. They socialize and fuck where they live, and if you don’t like that, then cohabiting with a tenant isn’t for you.\n\nYou couldn’t even be bothered to find a form lease to copy. You just suck at this, and your tenants girl was right: take the L. You suck.",
            "I didn't realize this sub supported illegal actions as MC........",
            "This is fucking hilarious, but you should definitely write a more stringent lease agreement",
            "Isn’t there a a big difference between renting a spare room in your house and renting an adu or separate unit in an owner occupied multi pled? \n\nI’ve rented spare rooms right after college, and I always assumed that my staying there was more at the discretion of the owner.",
            "time to buy more blackrock stock",
            "Lol damn! I feel like I just watched a short film from reading this 😂",
            "This is why leases are five pages long 8 point font single spaced",
            "You both sound like awful people. You should have kept rooming together to prevent others from having to deal with either of you.",
            "Good malicious compliance I guess but you’re both idiots. Quit trying to DIY your lease and then act like you’re the victim of it all. You’re roommate has no respect either. Just idiots playing idiot games",
            "Yeah this is why I will never rent out a room in a house I own.",
            "Remember that show “Worst Roommate Ever” on Netflix? OP got lucky imo.",
            "I -guess- you can call that malicious compliance since there is no thread for \"idiotanddick\".",
            "People are really beating you up on this, but not everyone has people over even twice a month. And if you're just renting out a room, the less random people coming and going, the better. This is a live and learn situation for everyone. And now you know what to have in a lease. Read other's leases and make it precise. Think of what can go wrong and protect the two of you. Utility usage, so that you don't get a $500+ bill if they crank up the heat or AC. Show tenant how to shut off water from overflowing toilet, where the fire extinguisher is and not to throw water on an open flame near oils. If something can go wrong, it's only a matter of time with each tenant.",
            "This may be of interest. Not legal advice. Just what I have noticed on tv. Recently watching episodes of Judge Judy for the first time. Lots of situations about leases & Tenant & landlord situations. The Judge often says something like, As that lease is a written contract. So only what ever is stated in the four corners of that document is the contract between the parties. But the judge also says something like, contracts can also be a verbal agreement between parties. If I have understood Judge Judy correctly. Says a verbal contract can not over ride or supersede a written contract. Written contract is the primary thing. If I have understood correctly (no guarantees, lol). Your tenant was right. They only had to obey the written contract. Anything stated on the written contract, any facility or entitlement removed by the landlord breaches that contract. Some landlords who have done this on the show have to pay compensation to the tenant as it  a civil law court. Personally in your situation I would have felt exactly like you. But not sure I would have been as clever as you at resolving it so quickly. Lol. Think you are a genius.",
            "This was your fault, but nice MC",
            "Love it!",
            "That is nice malicious compliance. Depending on the state you live in (assuming you live in the  USA), having someone over five nights a week would be grounds for lease breaking even if it was not in the lease. It would be considered co-habitating and that person would need to be on the lease.",
            "You know the laws are different when you share a space with the tenant right? Anyway you were lucky because you tried to resolve this in a roundabout way. He could have sued you. Next time draw a better lease agreement and get yourself informed about the law",
            "This doesn't sound real. Turning off or removing things from an apartment the tenant rents is not legal where I am from. If the washer or dryer stop working you have to pay them compensation till it is repaired unless they caused it, but good luck proving that. Same goes with oven or microwave and any furniture provided in common areas.\n\nHere you could be facing fines and up to 12 months of rent owed to tenant as it could be easily proven to be malicious in an attempt to make him move out early. But I have no idea what country you live in.",
            "ITT: Landlord mandates that tenant is only allowed to get laid twice a month.",
            "Yeah but why? So there's a girl there every night. Are the two loud? Causing you distress? Interfering with your ADL? Just let a dude get sex without being an uptight prick about it. What does it matter to you? If you're losing money, then maybe I get it, but you didn't put it in the lease agreement.",
            "So... everybody sucks here.",
            "U should live alone",
            "Tbh you were totally wrong here.  It's a funny story but depending on where you live you were arguably breaking the law.  Get a lawyer to write your lease next time",
            "It this normal? If you rent an apartment the landlord cannot say how many you can invite. Even when it's in the agreement... At least in my country.",
            "I'm not saying it *wasn't* malicious compliance, but you made the lease far too vague, and you forgot that verbal contracts are not necessarily valid. I don't think t should've had g essentially living with him without amending the lease, but they might have been willing to do that if you didn't come at it from such an aggressive standpoint. Being that aggressive isn't going to get you far even if you're 100% right in the situation (not saying that you're right here though).",
            "Weird to want to control what someone else does with the space you make them pay for and who they have there. Maybe don’t be a landlord and try to profit off a basic necessity. Especially if you don’t actually want to live with someone and deal with everything that comes with that.",
            "You are so lucky.  He could have easily taken you to court and sued and won (or stayed and forced you to make lots of changes and pay him for the stuff you removed).  You broke a lot of landlord tenant laws here.  lol    \n\n\nYou think just because I didn't have it in the lease I can just remove.  Nah, that is not how the law works.  There is implied habitation rights under the law.  Next time, get an attorney to draft a lease for you.",
            "You should take the lease agreement and shove it up your ass. \n\nThis is not MC, it’s harassment, and depending where you live your actions were probably illegal.\n\nA tenant is a person with a life, likely paying a huge portion of their salary to you, in exchange for living in a home they have zero equity in. Rents often exceed mortgage payments. For you to dictate that he put his social life on hold is COMPLETELY wrong and reprehensible. \n\nYou sound like a jealous little incel. Bet you don’t have a single friend who would agree to live with you and pay rent.\n\nReflect on your shitty behavior and seek help if necessary.",
            "Wow, you're a complete piece of shit.",
            "You sound cringe",
            "OP seems to be the ahole in this case.",
            "This was just a great read starting my day lol. You sure know the art of war.",
            "Glad to see that you learned from this experience. Always put it in the leasing agreement, and have it looked over by a lawyer. They exist to prevent this kind of shit from happening.",
            "Well this was malicious alright lol",
            "Amusing, but I have a question.  Is it legal to restrict the number or frequency of visitors in a lease agreement?",
            "god. it's not the same thing but i had written up a contract agreement between my sibling and i at one point because he was too lazy to get his own playstation 4 and even when i set up a guest account with family access to psn he still wanted to use MY account, i told him in the agreement that he was to set up his own acocunts and what not that i'd do the same on the ps4 itself, he was to text me when he started playing and that he'd have no more than an hour  to play, and i can kick him off when i want to play because it's my ps4. dude signed the agreement but then immediately broke it a day later because he didn't wanna bother and said \"oh it wasn't in the agreement you WOULDNT set it all up for me.\" and i'm like \"dude that's not how it works, you agreed to my requests, and you agreed that if you broke this agreement, you'd be permanently banned from playing on MY PLAYSTATION.\" he got so salty but there was nothing else mom could do since she'd asked me to give him a chance. i did, she asked for another, i said no, he agreed to the contract.",
            "If you really wanted to be spiteful just *misplace* a few valueables and call the cops.  Idk, things just seemed to go missing when my tennant began bringing multiple people over.",
            "This is why I never rent to people anymore. It’s always some bullshit.",
            "A perfect example of why well written leases are so important. A lot of jurisdictions also have pre-written leases you can easily look up and download. Review your lease before signing anything and if it ever seems incomplete suggest the landlord use the standard lease for your jurisdiction. If they don’t wanna use a proper lease then that’s not a landlord worth your time and money.",
            " If this is UK and you’re a live in landlord, you didn’t have to give home any notice to tell him to move out.\n\nA week would have been deemed reasonable given the circumstances.",
            "Haha i'm lafing trying not to awake others at home. Great MC OP, I can't believe how some people feel entitled to everything.",
            "Tbf the guests only twice a month policy is kinda ass, but every other condition or compromise offered was pretty generous.",
            "OP you fak up by allowing overnight guests. Next ad and lease create a “no overnight guests allowed” and “no visitors” within the apartment. Specially write this is in the rental lease to avoid this nightmare of a scenario.",
            "Yeah man all of you sound like the worst",
            "Man I love this sub",
            "an ad is not a contract is all i can say. you say yourself the contract was bare bones, if things change they change and you are out of luck",
            "Love this. A good lesson for the OP on being specific on contracts and an even better one for the tenant and G on not being a-holes.",
            "Maybe this FAAFO",
            "My daughter rented a room in someone’s apartment with the okay to have guests but not overnight guests. Once she moved in the landlady changed her mind and said no guests at all, whatsoever. My daughter moved out after two months. She eventually got her own apartment (with a yard) for less that the rent of the sofabed at that lady’s apartment.",
            "everybody eventually learns the hard way that you can't trust people to be decent people",
            "This is why I lived alone for many years.",
            "Yeah I mean there is Malicious compliance but also u never just rent out a room and expect no visitors.  Sounds like he has a girlfriend that comes over a lot.  No mention of noise or disrespect just angry the fact that she is there.  Now I could say hey maybe throw in for some toilet paper or something but I think they are better off not renting things out",
            "Your clause attempting to limit the frequency that your tenant can entertain visitors is likely in violation of Washington state's covenant of quiet enjoyment of rented property that you implicitly agreed to when you agreed to rent your property in the state of Washington. The harassment that you put your tenant through as retaliation for his perceived violation of your illegal rental clause was unquestionably a violation of said covenant. There's no \"compliance\" here on OPs end.",
            "Oxygen, not in the lease agreement bud….",
            "You are a  king among trashy landlords my friend.",
            "A lease agreement is an important document. It’s well worth the hour or two of a property lawyer to draw up an agreement to suits your situation. One must consider that the value of one’s property is at risk. Renting a room in a house seems like a minor thing until it’s not.",
            "Tbf your lease you made probably wouldn't have held up in court and you could've just have him notice to get out.",
            "Guests only twice a month? Tf? Like I get it if the guy was effectively trying to move his gf into the space when you agreed on a single tenant, but visitation rights twice a month feels like jail 🤣🤣",
            "OP writing original lease- \"wow idk why everyone has these big complicated arrangements that they make everyone agree on...this is simple and other people are wonderful, empathetic beings\"\n\nFew months later- \"ohhh.....oh, no\"",
            "Wow. Glad I don’t rent a room in that house! A long time ago when I rented a room in a house in my early twenties I had a a girl over to stay the night with me every weekend and I made breakfast for us and my landlord was totally fine with it. Never said a word.",
            "This is why you need to put stuff into the agreement. I’m not sure where you are from, but in my country you would not be allowed to do allt he things as the owner as you did. The tenant can do them, but you would be in violation of the law. Because tennanta are rptected by the law much more that owners.",
            "the art of leveraging in a nutshell",
            "the idgaf wars",
            "Sounds like you need a transient boarder clause.",
            "Petty and you won’t back down? 10/10 my dude/tte",
            "If you’re a landlord on malicious compliance, You’re probably a bad landlord. Using backhanded ways at getting revenge on your tenants because YOU effed up and didn’t create a realistic/accurate lease agreement should land you in court and you absolutely should lose your ass. Create a good lease agreement, abide by it. Miss something important in the lease? Well then you have learned something important for your NEXT lease. If you’re too stupid and malicious to do that then have a proper attorney create your leases. \n\nSource: been a landlord for high occupancy-low income housing, rented out my rooms to others, rented rooms from others all without issues.",
            "Fighting malicious compliance with malicious compliance.\n\nWith that said, this is why my leases are detailed af. People always try and take advantage.",
            "This does seem to fit Malicious and Compliance.  Good match for the sub.",
            "hate everything about this...  renting a place to someone expecting them to have guest twice a month is just rubbish. \n\n\"you can live here but you cant have a life\"\n\nsure it was agreed on and it makes the story a little funny, but to me this rule is just complelty insane.",
            "You don’t think you could have gotten the same result by just mentioning all the benefits he was getting that were not in the lease agreement? The lease agreement doesn’t even allow him access to the kitchen or the bathroom.",
            "Renting out a room in your house is far too close for comfort. A violation of personal space. The biggest problem is the visitors, you rent to a young lady and then all sorts of guys from criminals to passive aggressive nerds start coming through and then if you rent to a guy all sorts of girls start coming.",
            "After all that. You want another stranger in YOUR house.",
            "When you sell a house you can’t take things that are attached unless it’s in the agreement. I would guess that’s the same when you rent out.",
            "He had another person lIrving with him, you could’ve just mentioned that and increased his rent as he was the only one on the lease but congrats on getting ur space back",
            "Why would you put a rule on the ad but not the lease agreement?",
            "Your roommate can only have someone over twice a month????? Do you only see your friends twice a month? Do you have any?\n4-5 times a week does seem excessive but come on.",
            "If the guest policy wasn’t in the lease then all guests could have been disallowed…",
            "I live in Ontario and I'm so happy we have strong tenant rights cuz fuck this OP lol \n\nThis is the textbook example of why landlords have to be kept in check.  What a ridiculous thing to say only 2x a month you can have guests over hahah",
            "TLDR; landlord thinks they’re running a halfway house, not subletting a room, and thinks they can dictate a tenant’s social life. And landlords wonder why the world hates them.",
            "Is your name Milton Bradley because you can play some games.",
            "Guests only twice a month?  What, jealous?",
            "OP must get no bitches",
            "Good on the MC but you were definitely kind of a dick. Normal lease agreements do have in them rules for visitors and length of stay before they need to be added to the lease, so it’s kind of your fault for leaving it out.",
            "If only folks would read this as if you were an actual landlord of like an apartment complex and you pulled this shit. You wrote a bad lease, got called on it, and retaliated like a child.",
            "Guests twice a month? You sound like a dick.",
            "Detail everything and put in a clause that says each of you will agree to terminate the lease giving a certain amount of notice.  Say two weeks.  So if you don't like them you tell them they have to get out in two weeks.  Of course this can go the other way where they tell you they are leaving in two weeks.  But you don't seem to need the rent money so this might be okay.",
            "I like the revenge but next time type out everything on the lease… if u think there will be a problem.. add it to the lease.",
            "Not only do you sound like a huge AH, I’m pretty sure most of that is illegal.",
            "All I know is that if I ever have to rent out a room in my space I am going to have Sheldon Cooper prep my lease…",
            "Shutting off washer and dryer when you agreed in the lease that the owner pays all utilities is straight up illegal. You sound like a horrible landlord.",
            "Next tenant, charge a fee for every time a guest is there overnight.",
            "This happened to me. The only thing I didn't want was an extra \"ghost roommate\", AKA your boyfriend. After the first time, I specified- NO ONE more than once a week overnight, 2 weeks if they're visiting from out of town. Girl was new to the city \"didn't know anyone\". Cue her ex bf flying in from NY and then... never leaving. They literally tried to pretend he wasn't there after the second week, which is insane. I kicked her out. Did not give her deposit back so I had a cushion to find someone else. People are a-holes. Edit to clarify - the first time was a totally different roommate in a different building. I moved out bc of the situation.",
            "i dont buy it. pictures or it's just a story.",
            "In my state the landlord can raise the rent as long as you give a 30 day notice that you’re doing so",
            "landlord angy! hmph!",
            "Landlords are the absolute lowest of the low. What a shitty person.",
            "You acted like a child who threw a tantrum when something didn't go your way. I'm embarrassed for you.",
            "You’re just a piece of shit lmfao redditors will literally upvote an abusive landlord",
            "Tenants are not your children. If you feel entitled to a say in their personal life, you shouldn't have a tenant.",
            "“It wasn’t in the lease agreement” makes so many people turn in their graves, from back when a look in the eye and a shaking of hands was enough to cover all the unspoken details between two people of upstanding character. When he uttered those words, he didn’t even realize that he implied that his word means nothing.",
            "Wow, you're bragging about an illegal self-help eviction.\n\nHe should have sued you.",
            "I mean, at least where I live, you can just evict him if you share a house. People renting rooms in a house you love in have a lot less protections than people actually renting an apartment",
            "Had you never had a roommate before?",
            "So for future reference in the lease if you specify that they have access to common area’s (and if you don’t specify they don’t they do) you can’t legally turn off the stove.",
            "Be glad this didn't end up going to court. You would have been in a lot of trouble.",
            "You really have no business being a landlord if we’re being honest. When you rent a space you are allowed to have who and what you want in that space (obviously pending it being legal activities). I think you are in the wrong here and are also a terrible landlord. Either get a room mate that’s a friend or live alone. Honestly, you probably should live alone, you sound awful and miserable.",
            "This kind of reminds me of when I was at university, and had a boyfriend who rented nearby. We spent a lot of time together, but didn't do sleeping over. I think that every time his landlord visited I was there, so he started assuming that I'd moved in without it being discussed with him.\n\nHis solution? Introduce a rule that no menstruating women were allowed in the house!",
            "Wont belong before we see you in front of a tenants tribunal.",
            "I get that your tenant was a knob, verbal agreements are still agreements. However I'm fairly certain you broke some laws there. I don't think you're legally allowed to turn gas and stuff off for your tenant, the property has to be a livable situation and turning stuff like that off makes it not livable. Which seems to have been your end goal, so I guess congratulations?",
            "I appreciate your level of MC.\n\nThis tenant tried to live by the sword and we all know how that ends",
            "Not sure why you did this.\n\n\"She's not on the lease, if she appears here again, she's trespassing and I will call the police.\" then do it.",
            "What happned to basic decency, op and tenamt had a verbal agrrement on guests, im in this type of agreement, 44(m), i got divorced a year ago, im a truck driver, only in town on weekends, i found a room in a retired ladys house, i pay 100$ a week, i dont take people to her house, if i want to hook up, or date someone, i go to their house or i get a hotel room, no written lease, she helped me out when needed it, i guess i just have different values from an old school time, if you tell someone something, you keep your word",
            "Annnd this is why my extra bedroom stays as a guest room",
            "Twice per month to have someone over?! I would have thought twice per week is reasonable…",
            "If the lease did not mention anything about guests, then the default is no guests. IANAL",
            "he should have sued you",
            "Pretty sure this sort of action is illegal",
            "ALAC (all landlords are cockroaches)",
            "Oh man this isn’t why people fucking hate landlords is it? Lmao pay your own mortgage",
            "Play stupid games, win stupid prizes. Why have a barebones lease when there are free templates online? Or you can simply get inspired by others you have signed as a tenant?",
            "You screwed up. This was entirely your fault for not thinking through the lease agreement that YOU wrote.\nAnd because of your mistake you decided to act like a child and take away what you already had agreed to in the  lease that YOU wrote.\nI feel sorry for your next tenant when he/she does something that you don’t like or agree with. I’m betting that you will go right back to the petty person that you proved to be previously.",
            "You kinda sound like a dick tbh",
            "It's typical how people think they can walk all over the nice guy, without realising he doesn't have to be nice. Being nice and considerate was not in the lease.",
            "Wow, you are a jerk. Sorry your roommate had a life that involved other people.",
            "I’m sorry but you are a horrible person. You lease out a room in your house for the extra money but then tell people they can’t have their significant other in their home that they pay for. And then create unloveable conditions to push them out. What person in their right mind expects a single person to only bring home a date twice a month? You didn’t put it in the lease because you know it’s ridiculous and unlivable and then retaliate to get your way. I pity anyone that gets lulled into your slumlord trap."
        ]
    },
    {
        "post_id": "104h4ji",
        "author": "PaludisVulpes",
        "title": "Downstairs neighbor demands we ‘walk normal’. So we do. And she HATES it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104h4ji/downstairs_neighbor_demands_we_walk_normal_so_we/",
        "score": 12948,
        "num_comments": 890,
        "created_utc": 1672969481.0,
        "selftext": "We’ve been living in this apartment for three years. It’s old. It’s cozy. The building is ~20 years old and though the appliances and wall paint and carpets have been replaced… the floor has not. It’s painfully thin. Every step we take creaks and groans and it’s ANNOYING. Living on the 3rd floor, we know it’s gotta be even more so for whoever lives below us. So, we’ve done our best to be mindful of their comfort, and try not to make too much noise.\n\nWe had a new downstairs neighbor move in a couple months ago. And she is NOT convinced that we are literally tip-toeing around our apartment. Every time I get home and close my door? She’s banging on my floor with a broom or something. Every time I cross the living room? Banging. Every time I vacuum? Banging. Every time my dog chews on a bone? She bangs on the dang floor and it scares my poor dog. We’ve been living on eggshells trying to be courteous, but she’s driving us mad with her insistent BANGING every time we take a step.\n\nI guess she had finally ‘had enough’ because she came upstairs to yell at us the other day. “You are too loud! You need to be courteous and walk normal! You have neighbors!”, she yells. She almost looked like she was going to cry. It was disturbing. We felt bad. My husband tried to explain that, ma’am, we do our best to be quiet, but these floors are really old and they creak. We’re not stomping or jumping or running. We’re living - but we’ll continue to be considerate.\n\nShe was NOT impressed with his answer, and continued to argue. “Well, I lived on a first floor before and my other neighbors weren’t loud like you.” “It’s so loud and my job is so stressful so I want you to stop stomping.” “I don’t want to be a mean person but I really think you’re too loud.” \n\nSo you know what we agreed to? To walk like normal people. “Okay, okay, we’ll walk normally.” We said. This is exactly what we had been doing. Nothing different. So she still bangs on the floor and gives us nasty looks. But we are being normal people who walk normal and don’t stomp around! Our dog is a normal dog who chews on bones and walks from his bed to his food bowl, and gets excited when it’s time for walkies! We are so normal!\n\nWe’ll be moving in the next month so it’s no skin off my back. Hope the next tenant doesn’t have kids… or maybe I do. And then she’ll finally understand that we are normal people who walk normal. Maybe she’ll miss us.\n\nEdit:: So I’ve noticed a LOT of y’all upset over me calling a 20something year old building ‘old’… \nSorry. I should’ve called it ‘dated’. I’m in a big city where most apartment buildings around here are pretty new, and have maybe only been around a decade or so. So this one is ‘old’ to me. Not new.\n\nAlso. Thank y’all for the stories, input, and advice on how to be better neighbors. Some are pretty insightful! However, considering she banged on the floor again today while I was running the bath, I’m not too concerned with wearing slippers all day around the house, or padding the carpeted floors with noise-canceling material. Angry people like being angry. I’m excited for the move-out day, when people will be constantly walking around and moving heavy furniture. (:",
        "permalink": "/r/MaliciousCompliance/comments/104h4ji/downstairs_neighbor_demands_we_walk_normal_so_we/",
        "comments": [
            "My last apartment was like this and I was on the first floor.  I finally realized it was the floors because I heard her cat jump down from somewhere and I swear to god I could hear the cat walking across the floor.",
            "I was able to hear my downstairs neighbours talk late at night when most people were trying to sleep and got them to stop when i started talking back to them while lying in my bed, it was hilarious cause i could hear the pause and listened if that was really happening like they said something and i would go \"haha no way dude no way thats crazy\"",
            "... is a 20 years old building really considered old?",
            "You don’t have old floors; you have cheaply constructed floors. The company who built the building is to blame.",
            "Sorry, you have an old building which is 20 years old??? That's.... Not that old.",
            "We had a problem like this with my mom's apartment. The new downstairs neighbors were complaining about the noise. Since they seemed pretty nice I went down to their apartment to listen as people walked around upstairs.\n\nI had first listened to mom walking normally when I was next to her, I could barely hear it.\n\nWhen she walked that way again and I listened from below it was louder. The floor/ceiling chamber was like a drum. I put down some cheap carpet on the tile floor to mitigate it to some extent. The real answer will be to fill the cavity with some acoustic treatment.\n\nI suggest you go downstairs and listen and if there are 2 of them, have one come up to your place and walk softly while the other listens.\n\nBoth side need to have the other person's experience. Then you might be able to work towards a solution.",
            "I live in a 100-year-old apartment building with paper-thin walls and ceilings. The upstairs apartment has thankfully been vacant for nearly 2 years, but when I have had upstairs neighbors over the decade I’ve been here, I’ve heard *ev-er-y-thinggg*.\n\nNormal-volume conversations—totally audible, to the point that I could even make out what they were saying some of the time. I could also (of course) hear sex, so clearly, in fact, that I was aware that one of my neighbors several years back had a special penchant for spanking. At night, after city noises ebbed, I could even hear the sound of neighbors peeing in the toilet from time to time. So you can imagine what a joy it was when the tweakers moved in...awake at all hours walking around in high heels and inexplicably rearranging the furniture on a near nightly basis. Luckily eviction was rather swift in that case for other, rather predictable, reasons. \n\nBut yeah, once I realized what I was hearing was normal life and just a thin barrier I accepted it. Well, apart from the 3AM meth-induced racket, that was bullshit. \n\nAhhh city living.",
            "For anyone curious, **Impact Insulation Class (IIC)** is the \"rating for the ability of a floor-ceiling assembly to block impact/structure-borne noise from transmitting to the space below.\"\n\n>The Uniform Building Code (UBC) and the State of California set minimum standards of 50 IIC (laboratory) and 45 FIIC (field) ratings in multifamily dwellings. At this rating footfall noise from a person walking on a floor above is clearly audible, and it is possible to follow the progress of the walker around the room. Thus these building code standards do not represent good building practice. Rather they represent minimums below which it is illegal to build. It is only when the IIC ratings are above 65 that heel clicks begin to become inaudible (Kopec, 1990).\n\nhttps://www.sciencedirect.com/topics/engineering/impact-insulation-class\n\nSo OP could potentially do a test to see if this building is in violation of the building code. But I would like to see these standards get increased significantly, because this is one of the largest reasons why people don't like living in multifamily buildings.\n\nSide note, there's also Sound Transmission Class (STC) which is a similar rating for sound going through walls.",
            "I hope the new neighbors are members of an Irish Dance troupe and they host the practices.",
            "We lived on the second floor of an older three-story apartment and right away it sounded like there was a bowling alley up there. The neighbor came down to welcome us and apologized for the noise - they were also tip-toeing but the floors/ceiling was awful and they were trying their best to keep as quiet as possible. We loved them! We also did the same for the neighbors below us. The guy played the cello and it was nice to hear him in-between strikes 😉 😂",
            "If I ever decide to buy a multi-family I'm putting money into soundproofing. I'm in a duplex and every time the neighbor slams her door or moves chair it sounds like it's coming from my unit. Doesn't bother me any about the noise but it scares the shit out of me when it's just me home.",
            "I used to live in an apartment that was just a two-floor building.  It was in a tiny town, way out away from any major roads, so I thought it would be nice and quiet since there weren't that many people in the building.  Both of the apartments on either side of me were empty, and I was on the second floor, but the floors were nice and thick, so I didn't think I'd ever have any issues with people complaining about me making noise, since I was living alone at the time, and I'm typically a quiet person anyway.  \n\n\nThe first night I moved in and get my bed set up and a few boxes unpacked.  I get ready for bed kind of early because I was tired from the move, and crawl under the sheets.  I'm almost asleep and the I suddenly hear someone screaming like they're being murdered.  The floor was thick enough that I couldn't make out any distinct words, but since I was just out of college and it was my first apartment, I kind of freaked out, but I didn't want to panic, so I called my dad and asked him what I should do?  Should I call the cops?  The live in building manager?  My dad asked if the screaming was still continuing, and I said yes, so he said to try the building manager first, and if I couldn't get hold of him, then call the cops.  \n\n\nLuckily, I did get hold of the manager, and he apologized and said he should have warned me, but the lady who lived below me was in her 60's or 70's (I forget which), and was about 90% deaf. She was screaming at the Jeopardy and Wheel of Fortune reruns and did it every night.  Everyone else was used to it, so he forgot to mention it to me.  She only did it at night and only for about two hours.  There was some legal reason why they couldn't ask her to move out, if I remember, so I just had to deal with it.  Believe me, I got a good pair of headphones and started making sure to wear them when I got home to drown her out.  \n\n\nIt was thin walls in that place that really ended up bothering me.  Even though the apartments on either side of me were empty - being renovated - the one two down from me on the left was occupied by a family.  And they were as obnoxious as all get out.  Blasting rap from their speakers at full volume every day, but especially on the weekends, when they would also keep the apartment door open when the weather was nice.  They would also scream at each other - it was a constant tirade of \"F\" this and \"F\" that, and \"F you\".  They were loud enough that my headphones couldn't even block them out.  More than once I went down and asked them to keep it down because I needed to sleep.  That usually shut them up for a day or two, but then they'd be back at it.  \n\n\nFortunately, I didn't end up living there long - about nine months, if I remember before the job I moved there for fell through and I moved back to the same town my parents live in.",
            "Thought the last place I lived had thin floors. We could hear the upstairs neighbours walking around, playing with the dog (by tapping repeatedly on the floor at 2 AM) vacuuming daily, arguing, etc. So when I met the downstairs neighbour I apologized for the noise from us even though we tried to be quiet. She said that she never hears us. I assumed she was just being polite. Well after about 18 months our upstairs neighbours moved out and a new family moved in. I’m not sure what the original couple were doing, but the new family was quieter on the day they moved in than the other couple on any given day. Barely heard anything from them, just enough to know they were there.",
            "[deleted]",
            "Our upstairs is like this.  We hear them walk, hear their dogs play, hear their Xbox, and he owns a drum set.  Except for the drums, it's just apartment life.  At my old apartment, my heavy upstairs neighbor got a WiiFit.  That was hell.",
            "[deleted]",
            "I feel bad for my downstairs neighbor. One of my cats really throws his weight around when he’s not getting the attention he wants. Seriously at 4am he’ll throw himself off my bed as hard as possible and then jump back up to try and get me to play with him. \n\nI of course have to concede and make him stop so he doesn’t wake them or my other cat.",
            "I don't know... now that they've heard you \"being normal,\" it might be time for another chat with them.  I hate walking on eggshells too, but at least the neighbor would have an understanding of what you were doing prior to your first conversation.",
            "We live in a reasonably nice place. It’s almost sound proofed except the floor still carries vibrations (we lived in a middle floor so we feel vibrations from upstairs once in a while but not enough to be bothered about). And we had this cranky old dude who kept coming up to complain about how loud we were. We were so new to the country back then and we were worried and went out of the way to be quiet and kept apologising. We basically tiptoed in our own apartment. We even got these shock absorbing pads to put under our appliances.\n\nAnd one day he was ruder than usual and almost got into a verbal altercation with my partner and we had to push him out of the apartment and close the door behind him (we were stupid and allowed him to step inside to talk). We called building security because we were very worried and asked if we did anything wrong. And the security guy assured us he will come up immediately. Then he apologised and explained how he’s sorry we were that worried because apparently that old man was bothering every one. And rather than us doing anything wrong he told to call him immediately if he ever bothers us again and he will handle it right away.\n\nI think the talk went well because we never got another visit and we stopped all the tiptoeing and live peacefully. The cantankerous old dude moved out soon after.",
            "Kids with pogo-sticks - and recorders, that need to be played.",
            "My wife and I had this literal same experience a year ago when we first moved in. The tenant below us complained to the property manager saying we must have been dropping bookcases and they thought there was a domestic violence issue. We asked about when these things were happening. It was always when we weren't even home. One of those times we were told the noises were from 9am to 10pm. The lady finally knocked on our door, and told us that our two dogs (~50lbs each) needed to walk quieter. We brought it up to the property manager and never got a comaint again for the remaining 9 months we were there. Funny enough, the meetings we had with our property manager about this sparked a conversation that led to her being our realtor for our current home.",
            "Maybe you should stomp and jump around so she knows what normal walking sounds like. Also, carpets help (for future since you’re moving)",
            "I've always felt that if you are going to be upset about the noise above you in an apartment, you have absolutely no business renting anything other than top floor.",
            "I am on ground floor , 70’s apartment - and have upstairs neighbours - Also i have carpet in my place as moved in 6 years ago before all the renovictions happened in my city - so they have hardwood panel floors.\n\nUpstairs people have no idea how loud walking can be - I swear they have two kids that can’t be more than 70lbs when wet weighed together - it’s like two elephants !! IDk care though - But it is loud !!",
            "Perhaps she'd be happier if a [couple of artists](https://youtu.be/4IRB0sxw-YU) moved in.",
            "I don't miss apartments.  I'll stay in a detached home as long as I can manage it.\n\nAnd not for the crazy downstairs neighbors - I can move quietly enough - it's all the other noise you hear.  People in the hallway.  Noise through the walls.  Difficult to regulate heaters.  Neighbor screaming up and down the hall to call 911 because their kid is having a seizure and they don't have a phone (kid was fine by the time I handed him off).",
            "There are solutions for people that really don't like noise from above or adjacent apartments.\n\n* Don't live in an apartment.\n* Live on the top floor of any apartment building.\n\nYou wouldn't think that the latter makes a differences, but it totally does.",
            "Every time she banged on her ceiling I would get a broom handle and bang on the floor.",
            "Man, I'm fully aware what a huge annoyance children are. My old upstairs neighbor stomped around like some elephant at around 8 pm but other than that, nothing. I now live on the second floor and am fully aware how loud these floors can be. My child falls, jumps, does children things but I always tell him to be mindful of the people below us. My ceiling shakes along with my floors because the upstairs neighbors kids run, jump, and all sorts of stuff. Other than school breaks I rarely hear them.",
            "When I was still living with my parents we were on the 2nd floor, the lady on the first floor was literally cursing us each time we walked, or moving any furniture (aka chairs which we carefully got of the ground to move it)\n\nWe moved out two years ago, now the occupant of our appartment  are a single mother with 2 kids and she has been crying for them to stop moving, had the cops involved several times and is going to move out soon (I still have some friends there)",
            ">  The building is ~20 years old and though the appliances and wall paint and carpets have been replaced… the floor has not.\n\nBruh....you don't replace floors in 20 year old buildings....you don't replace floors in 40 year old buildings....heck you don't usually replace floors in 50 year old buildings...\n\n20 year old home would be considered \"new\" construction for most people.  That's a building that was built in the 21st century even...",
            "I'm not sure where the compliance is? Malicious or otherwise? You kept doing what you were doing??",
            "20 years isn’t old, your building was just built like garbage. I lived in one that was around 40 years old and only heard my upstairs neighbors when they were dancing.",
            "My ex neighbour was EXACTLY the same. I’m told the neighbour who replaced me is a young man who likes to party. I hope he has a mighty fine subwoofer on his stereo and likes to crank it up. 🙂",
            "We had a family that lived above us once that we swear had a bowling set in their kitchen. We never confirmed, but it sounded exactly like that. Rumble rumble rumble craaash roll roll roll.",
            "To be fair , the dog chewing a bone part was the worst one for me from my upstairs neighbors. It resonates loudly and goes on. Sorry for your floors",
            "Tell the landlord and report her for harassment every time she bangs. She needs to leave you alone.",
            "She's clearly suffering (I'm not being sarcastic). Stress, mental illness, something. I feel bad for her. And its unfortunate that you two are on the losing end of it.\n\nI'm glad you tried to be considerate. Sometime there's no winning, but we don't need to make life worse with maliciousness or pettiness in these situations.",
            "We had downstairs neighbors like that! Our floors aren’t even that thin. It was fine when we lived there for 5 years until they moved in. They complained about us opening and closing drawers, walking across the room, dog chewing on a toy… they also banged on our floor and left notes.They also got management involved. But our place was mostly rugged so we just needed to add one runner which honestly didn’t do anything. They also tried to go to the HOA and mandate carpets for all units. They were renters! Just move if u can’t deal with living in a condo building!",
            "I had a neighbour like this when i was a kid. Our downstairs neighbour was a nasty fucking piece of work and wouldn't hesitate to cuss me out in front of my parents when we walked past them in the hallways.\n\nMy parents are relatively shy people so they tried to explain to her that therss nothing more we can do than what we already do to keep the noise down.\n\nOne day I was running around a nearby park on my own (i was around 4 or 5, this was the 90s, it was still safe) and she approached me and gave me a lecture about how I was an inconsiderate and disrespectful little boy. I was quite the sensitive kid and not really understanding how just existing was an issue, this brought me to tears.\n\nI came home crying and explained to my mom what had happened. Later that evening my dad very calmly went downstairs to speak with the neighbour. There was no major argument (would have heard it if there was).\n\nHe came back home an hour later and simply said \"from now on, we will walk, talk, jump, cry, laugh, watch TV however we feel comfortable\". I have no idea what my dad said to them to this day. He's not an aggressive man by any means, nor is he physically intimidating. Only ever seen him raise his voice maybe a dozen times in my whole life.\n\nAnyway. I found 5 bucks earlier today. Thanks for reading",
            "This is what people associate with apartment living. The building was built as cheaply as possible, so the older it gets the more awful the sound becomes.\n\nNew buildings need to be completely soundproof/built properly.",
            "Some people are just super sensitive to sound and my advice to those people is DONT LOVE UNDER PEOPLE. PEOPLE WALK AROUND WE LITERALLY HAVE TO WALK AROUND ITS NOT MY FAULT WALKING MAKES NOISE.",
            "As someone who is the downstairs neighbor: can you move in above me? You sound like you actually care, and that makes you my friend. \n\nMy old upstairs neighbor walked around like she was Cotton Hill.",
            "if someone interrupts me when i explain i will call the landlords to explain the situation before i invite 10 friends to a zumba party",
            "We had an upstairs neighbor with an adorable toddler. He loved pushing chairs across the tile floor. When he wasn’t doing that he was throwing toys off the balcony and calling my name until I threw them back up to him.",
            "Invest in some indoor Dutch clogs for the last weeks.",
            "We were in the ground floor of an apartment for about 5 years. Went through a few neighbors in the unit above ours.\n\nOne of those neighbors had a child of about 5-7. We called him Stompy.\n\nStompy was unfamiliar with \"quiet\". Stompy knew how to stomp.\n\nAnd occasionally Stompy would break out the basketball.",
            "Walk without rhythm and you won’t attract the ~~worm~~ downstairs Karen.",
            "Sounds like its time to get some heavy subwoofers and a Iron Maiden CD.\n\nLet the neighbor see what a bad neighbor is actually like, so they'll appreciate the efforts you went through before they decided to be a dick.",
            "Time to start working out with a medicine ball at 6 AM until you move",
            "Holy crap do I relate. My building was built in 1937. Similar to you, everything has been updated but the floors. And it's a gorgeous building but our neighbor made it hell for a few months.\n\n\nOn week 2, she sent us a note basically saying \"hi my name is x and I live below you. I'm a masters student who had a bug infestation last year, please pity me because I sleep until 930 am so I need you to be quiet until then. Please stop stomping around, please walk quietly.\" I was shocked someone had the audacity to tell me to stay quiet. We are morning people, very quiet and we don't even have parties. We sent her back a note saying yes we know what it's like to be finishing school, it's tough but this our home too. We will be very mindful, please understand we are doing our best. This was not enough. She never responded or tried to contact us, we went to knock on her door twice and she never answered. \n\nInstead, she decided to annoy everyone else. Everytime we did anything even remotely loud, she would text our landlord who would text us a generic \"be mindful of noise\". Dishwasher running? Text. Vaccuming ? Text. Putting on shoes to go shopping at 3pm on a Saturday? Banged on the ceiling. We live on a wall adjacent to the landlord. One day I got fed up and went to talk to him and said \"If we were really hellspans don't you think you'd hear us?\" He just let out a long sigh and told me \"I don't even text you half of what she says. I am so over this and miserable, she won't leave me alone.\" \n\nLuckily she moved when she finished school. The landlord let me know the other day the new tenants haven't said a peep about us. (I don't consent for this to be posted anywhere else)",
            "During quarantine my kiddo was in virtual school. It had a gym class. We live on the second floor. So I bought some gymnastics mats for indoors. And sometimes we did the class together in the breezeway. \n\nNo drama.",
            "How is 20 years considered old for a building?",
            "I’m not saying you did anything wrong but how is 20 old for a BUILDING.\n\nIt’s barely even old for a car.",
            "> these floors are really old\n\n\"built in 2000\"\n\n\"really old\"\n\nugh, disposable buildings...",
            "I got super lucky at my old place, the floors and walls were so thin you could hear *everything*. My cats liked to run as fast as they could up and down our hallway and if you know cats, you know its just *thump thump thump* in quick succession.\n\nOur downstairs neighbours told us that the cats make their day/night and they always listen for them playing and laugh their asses off in bed because they’re so silly. The people who owned the building sucked, but man do I miss some of my neighbours sometimes",
            "My ex husband and I were military and lived in a second floor apartment in a military town. It was in the south so the stairs to our apartment were all cement but with nothing underneath and they ran along the side of the apartments. Nothing super abnormal about it. \n\nNow since we were military we got up early and wore boots. Our downstairs neighbors were an elderly couple. They HATED the sound of us leaving our apartment in the morning. They complained constantly about us making noise. The complex manager would leave us notes about noise often. We finally realized it was our boots. It was the only time they complained. In the morning while getting ready and hustling around the kitchen right before we walked out (kitchen was right next to the front door) and when we went up and down the stairs in them. We tried to go down the stairs quietly but they were cement and the hallway the stairs were in echoed soo much it was impossible to be quiet.\n\nThey actually tried to get the management to ban us from wearing our boots inside (even though we only wore them inside in the kitchen and not on the carpet for sanitary reasons) and to leave them at the bottom of the stairs outside and put them on then when we left. Like wut?! First off I’m not walking downstairs in my socks and putting boots on while sitting on cement…especially since I was pregnant at the time. Second, it’s the south. Boots outside were basically a vacancy sign for spiders, snakes and who knows what other crawly thing that wanted to kill you lol and third it was a complex (and not in the best area as we were broke airmen) not like a duplex so we weren’t leaving our $100+ boots outside for anyone to take. They were NOT happy with our reasons and even when management told them they couldn’t make us do any of the things they wanted they still huffed and puffed at us when they saw us. \n\nLuckily it only went on for about 5 months. We moved to a better place with less stairs as I got further into my pregnancy and we both ranked up so we earned a bit more money and could afford the better place. \n\nBut man those old people were crazy. How you gonna rent a place less than a quarter of a mile from the main gate of a military base and then get mad they wear boots?!",
            "In our final apartment living situation, we had an upstairs neighbor who would call the cops when we had three or four people over chatting at 9 PM on a Saturday evening.\n\nThen, her boyfriend moved in, followed by a lot of rowdy sex for about a year, with a pause, then a new baby. No problem. At about 18 months old they put Frankenstein boots on the baby and they taught him how to shove furniture all around the apartment upstairs for 10 hours a day. No carpeting I guess.\n\nFinally they moved out and were replaced with a really nice woman who was half deaf and wasn’t afraid of parties.",
            "A building 20 years old is “so old”? That means it was built in 2002/2003! Based on the story I figured it was 100 years old and built in the early 1900s 😂",
            "living under loud people fucking suck and it can very stressful to have so much sudden noise. It's also a work from home thing so in the mornings it feels extra loud while later in the rest of the day it doesn't feel as loud.\n\nI bet it actually does feel super loud and stressful for the person below you regardless.",
            "My old apartment had paper thin walls and you could hear the neighbors talking to watching tv everything in between",
            "The people in the upstairs apt where I used to live must have been dutch, because it sounded like they were all wearing wooden shoes. Did I mention that they must have had 25 kids?  Either that or they ran a Cub Scout den. I never once beat on the roof (although I thought more than once that the ceiling was coming down) or complained to anyone. I was almost glad when the big 2021 Tennessee tornado hit my building and I had to move.",
            "(Ahem) Might I suggest [**this**](https://media.tenor.com/PeeIUEXM1UYAAAAC/bumble-ball.gif) as a moving away present. Sorta like a mint on a pillow kinda thing.",
            "Yes I'm in an upper flat and my neighbour moans like mad. She even took us to mediation, and then was annoyed when \"made it sound like it's her fault\". \n\nAt the end of the day, our downstairs neighbours knew there was an apartment above. They knew people would live there. They knew people would move around. So it's her problem. \n\nWe have been here 16 years so our neighbors have had to put up with it.",
            "My gf lived in an apartment where the water pipes in the walls were somehow transmitting noise incredibly well. If someone flushed their toilet everyone heard on the floor. When taking a shower or opening a faucet, upstairs, downstairs and sideways neighbours all heard the pipes rattling. Also front doors closing echoed through the hallway, so everyone on the floor heard if someone was closing their door too.\n\nThis was unfortunate as we both lived an 'evening shift lifestyle'. She arrived home at 10-11pm and took a bath right away to minimise the annoyance of the neighbours, meanwhile if I stayed over, I usually arrived around 1-2 am, smelling like a gorilla that fell into oil barrel, so I went for a quick shower before settling beside her for the night. One of the neighbours would bang on her wall like a madman every time, passive aggressive notes were placed in the stairway, and we invited in our reply note everyone who wanted to discuss the issue, and pointed out that we understand that we annoy a lot of people, but our lifestyle is just different, and that we are woken up several time every day from our rest as well as everyone else is starting their day around 6-9am for their doors closing.\n\nAlas noone came to discuss, doors were still being closed loudly like a 100 time every morning, so we kept on having our showers that ended with the neighbour banging on the wall. After a while however i got so annoyed that she would bang but never come and ask what gives, so when she banged, I kept on showering even if I was already finished, so she doesn't think I stop just because she is banging. In the end we moved away 2 months later for non related reasons and in the wnew place neighbours can't hear us, however they mentioned for how long our lights are on after midnight as our windows face each other.",
            "When my spouse and I first got married, we lived in an apartment with thin floors. Our downstairs neighbor was a nightmare. Walking across our apartment would set her off like yours did. We were newlyweds and she'd complain she could hear stuff too. Complained to the apartment management company too. She was so bad they waived fees and helped us move to another apartment across town they also managed. It was significantly closer to work for my spouse and was a much better place for us.",
            "If I was you I'd just go back to walking normally and doing my other normal activities because there's really nothing you can do the floors are thin clearly. I live in a module home park and the the houses are pretty close and I can hear my neighbors walking some times they're not doing anything crazy just doing normal day to day activities.",
            "You just reminded me how lucky I am to live in the 8th top floor of a large apartment building.\n\nThe thought of living on the first floor and having all the families with kids above me, yeah no thanks.",
            "We moved into a 4th floor penthouse style apartment with our 2 german shepherds back in 2020. The downstairs neighbors on the third floor had a newborn who would wake up to the slightest hint of noise. The kept calling management to report us and we felt like we were on eggshells all the time. We decided to break our lease because that didn’t satisfy them and we didn’t want to be evicted (the neighbors threatened to get police and animal control involved involved if we couldn’t control our dogs to prevent them from playing). Our next place was less luxurious but also a little cheaper which allowed us to eventually buy a house this year with a backyard for the dogs to play in",
            "This neighbour from hell reminds me of that AITA post where the above neighbour got so bothered by the downstairs neighbour just existing in her own flat 😂",
            "As someone who lives on the second floor of a three decker it sucks. We had a family of four above us and it actually was fine until they moved out and this woman and her 12 year old daughter moved in. It’s absolutely ridiculous how loud they are. The girl stomps around SO loudly and so does the mother. The family of four you could hear walking but it was dull compared to this. It drives us insane.",
            "Your noise is accidental and unovoidable. They're hitting their ceiling. I would stomp the shit out of my floor if I heard them hitting their roof lord knows",
            "Guy below me actually admitted to making recordings whenever I wasn't perfectly silent. You know, for evidence or something. And I grew up walking on eggshells so I'm no Mr. Heavyfoot. Glad to be in an apartment with normal folks below me.",
            "My upstairs neighbors have a teenager who plays the French horn in band… badly.  I’ve never thought to complain though.  I’m just grateful to live on the first floor so there’s nothing below us but the laundry room.",
            "My husband and I worked overnights for the longest time. We got top floor apartments for that reason.",
            "next time have a friend of hers ( or whoever is complaining ) watch you walk while she hears it downstairs.  she will bang the ceiling and the friend can hear that as well.",
            "My first apartment neighbors were like this. Always banging around with a broom down there, then they started calling the cops. Eventually the management company made them move to an available upstairs unit.",
            "For a short time Andrew Garfield was my upstairs neighbor. Never heard him move.. like ever. It always made me laugh thinking of him as actually being Spiderman and that was why he could walk so softly. \n\nAlso, nice building and thick floors but... whatever.",
            "If you have a large dog, it's probably a big part of the noise. You can tiptoe as much as you want, but dogs are just loud animals in everything they do. Sucks that the floors are so thin there.",
            "There were a couple years living in college dorms where I was genuinely concerned for the foot health of the person living above me. There's no way their feet could sustain the amount of stomping I heard. And the floors weren't super thin or anything. I lived on upper floors in the same buildings and could walk without making a sound. Those neighbors must have been actually stomping to make so much noise.",
            "I'd start wearing heels around the house just for her",
            "My mom always commented “walk like ballerinas!” When we were young. Our house was 100+ years old. My parents still live there and they still comment to “walk like ballerinas”",
            "The reason we stay with our slightly overpriced complex is we complained ONE TIME that our ceiling/upstairs neighbors floors were too creaky (I even told the office, listen it’s just one lady up there she’s very quiet but I’m going insane) and they said “ok. Move everything out of your bedroom, give us two days and we’ll fix it. Reader, they did. They replaced our whole damn ceiling. It’s so much quieter. More complexes should do this and take care of their units. It should be the minimum not an exception",
            "Her miserable behavior is going to backfire on her eventually as continuously banging on her ceiling with a broomstick is going to result in damage to the ceiling which will not be considered “normal wear & tear” by the landlord. As you’re moving soon, her behavior should be reported to landlord so he can: 1) be made aware she is harassing you for no fault of your own, 2) he can inspect her unit ceilings before damage becomes extensive, 3) if he’s currently unaware of creaking flooring he can perhaps consider consulting a contractor about fixing it while your unit is empty.",
            "She's angry at the wrong person. This is your slumlord's fault for renting out a deprecated building without isolation.",
            "Surprisingly wholesome\n\nSub pattern had me thinking you were gonna start walking around without being careful. Good on you for having love in your heart and feeling her pain and still doing your best",
            "We were pretty happy to move into a house after being in apartments where you never know how the neighbors will react to simply walking in your own place. But we moved into a house with a flat roof and our new neighbors are squirrels who run across the roof and it’s like we have upstairs neighbors again.",
            "I had to double take at 20 years old being considered old. But honestly from the perspective of someone living in a fast growing US city, 20 years is ancient if you live in one of those wood framed mid rise apartments. Newer ones have raised the standards considerably, but early on they were practically a house of cards. My brother lives in a 10 year old wood framed mid rise. I live in a 20 year old steel and concrete high rise. We both live the same distance from a major sports stadium, and I live *closer* than him to a railroad track. What’s more, I live on a middle floor, and he lives on top. Despite all of this, you can barely hear outside noise in my place, and most interior noise comes from the hall. His place, even the slightest disturbance inside or our can be heard.",
            "Neighbors down the street lived on the second story of a duplex. New neighbor moved in below them and started complaining about them stomping around- which they weren’t…just and old creaky house issue.\n\nAnyway, downstairs neighbor moves out, but before she leaves she turns the gas stove on with the pilot light off, hoping it’ll make the house explode and kill the upstairs neighbors.",
            "i think you need to start being insanely loud for like a week straight, stomp everywhere, play loud music, loud rain/nature noises. when you go back to normal she’ll realize she was being stupid and hopefully apologize",
            "Man, I wish I had the energy and free time to be angry and yell at people for walking.",
            "I hope the next tenant is an old-timey pirate with a peg-leg and loud parrot.",
            "Some floors can be ridiculously good at transmitting noise. Part of my house is single story with a flat roof. I woke up one night when I first moved in to hear a ridiculously loud banging on top of my roof. I went outside, thinking it was a burglar, and...\n\nIt was a pigeon. A single pigeon was making all that noise. Just hoping around on the roof.",
            "I turned down an upstairs apartment because I saw a problem like this coming in advance. The open apartment was the upper story of a converted two-story house, and the woman who lived downstairs had made a point of being there to meet anyone touring the upstairs apartment. She wanted me to know that if I moved in, she really, really needed me to be quiet if I ever came home late because her last neighbor was so noisy. I sympathized, but tbh looking at the layout, I strongly suspected it was a case of poor soundproofing. The stairs to the upstairs apartment ran behind her living room and you could tell they'd just slapped up a wall to partition the back door off to become a private entrance for the upstairs unit, with god knows how little sound insulation. And then the overall quality of the house was...dubious...due to its obvious need for renovations, so I'd be awful surprised if any effort had been made to soundproof the floor/ceiling between the units. \n\nThat wasn't the only reason I turned it down, but I suspect that out of all the issues I found with the place, having to literally tiptoe around my neighbor probably would have been the one that stressed me out the most.",
            "LOL. An \"old\" apartment, but it was built in the early 2000s",
            ">It’s old. It’s cozy. The building is \\~20 years old \n\nI think we have a different definition of what an old building is. If it was built anywhere after the Second World War then I'd consider it to be new.\n\nIf it is 20 years old and the floor is creaking it is not because it is \"old\" it is because it was built cheaply.",
            "Can you tell your manager she keeps doing this? Good thing you’ll be moving in in a month. Likely, she will do this to whoever moves in next, and they might be louder than you 😅",
            "I lived upstairs of a noise sensitive family for four years. Endured constant complaints of noise. Regular walking. Watching tv. Taking showers. Etc. \nEven though we haven’t lived there for nearly 2 years, I still find myself trying to walk quietly.",
            "I live upstairs and my downstairs tenants have only every commented on my walking around once - when I went away for 2 weeks and my cousin came to house sit!  They came up after I got home & said they never really appreciated how quiet I was before my cousin came because she \"walks like an elephant\", LOL.  I laughed about it with cousin & we had our moms  watch us walk to see what the difference might be - she lands on her heels first, then rolls her foot forward, I land on the balls of my feet then lower the rest down.  That's it.  Apparently the heel walk is loud tho.",
            "I don’t know why people think when living in a multistory apartment that you’re going to hear people walking from above you. Some places are worse than others. But, that’s just going to be a issue that can’t be fixed by the tenant. The only way is by replacing the flooring with something more stable and likely adding some sound insulation or something in between the joists.",
            "When I got my old apartment I took the basement apartment (it was also fully renovated, larger and cheaper than the uppers) mainly because I had a young son and I didn’t want to have to worry about him running around. I’m convinced the person above me rearranged their apartment every night at 3am though 🤣",
            "The thing that amazes me the most is how anti-social your neighbor is to not consider introducing herself and bringing up the concern before escalating to hitting her ceiling with a broom.",
            "Jfc 🤦‍♀️ I complain to my partner on occasion about our upstairs neighbor but it was bc I was getting over a bad cold and at like, 3am there was just constant **stomping** from upstairs(I still dk wtf they were doing). I hear them walk but I mostly just tune it out. It's impossible to be 100% silent in a shared building. Just how it is.",
            "Not saying this applies to you, but sometimes people are just loud even when they try not to be.  I rented an apartment directly after a friend moved.  She showed me the place and warned me the lady below complained left and right about noise.  If their toddler dropped a sippy cup? She would bang on her ceiling/ our floor.  Toddler crawling?  She’d complain. Etc….  For the entire year I lived there, she only did that once to me, when I was hammering a bookshelf together.  Turns out their young toddler was just loud af with out them ever realizing it.",
            " how to stop wooden floors from squeaking  \nSprinkle baby powder, baking soda or powdered graphite over the squeaky floorboard and work it into the seams. This will lubricate the wood and should keep the floorboards from rubbing together and squeaking",
            "I'LL HAVE YOU KNOW I GRADUATED FROM THE MINISTRY OF SILLY WALKS!!!!",
            "I have found that most people thump when they walk. Since no one in my family does, I thought thumping was unusual, but we're definitely outnumbered by the thumpers.",
            "I don’t get your neighbor’s attitude. I live in a 100 year old building on the first floor. I can hear my upstairs neighbor walking. It’s just the floorboards creaking, why get upset about it? The only time I’ve said anything is when she started doing jumping workouts during the pandemic lockdown and I could see the ceiling bowing which scared me - and was a legitimate concern. People in buildings are going to hear other people. It’s just the nature of it and to be expected.",
            ">or maybe I do.\n\nI think maybe I do, too.",
            "I had the same issue, but in my own home \nMy wife could hear me walking upstairs whenever I got up for work (I work nights and woke up by 5pm to get ready so she was downstairs cooking)\n\nIt was not my fault the floors were shitty, as is not your fault that the place you lived in had shitty floors",
            "I’m a top floor flat owner so I’m always conscious of my movements. We carpeted both bedrooms but the rest is laminate. It works both ways, I can hear downstairs slamming doors and cupboards at all hours (presumably due to the proximity to the ceiling) luckily it’s a relatively new build and the sound proofing is good. So it isn’t noise as such, just bass-y thuds. There will always be noise with communal living, I think some people have unrealistic expectations (me included when I was new to flat life)",
            "I lived in a similar situation about 7 years ago. The building was actually quite new and we were not told of any issues while renting it. From the forst day we moved in we met our downstairs neighbor who was an old lady who has \"lived in flats all her life\" and was complaining about our walking. Sometimes apparently we were so loud that her lamp was moving. Once the complaints to us (and the landlord) started, the landlord called us and told us that she was a bitch from before. She would come to complain about noises even if we watched tv in the living room or smthn. You didnt have to walk much for her to come to complain. I think we gave up trying to appease her within 2 months.",
            "I hope the next tenant practices musical instruments at home. Plural.",
            "I had this almost same thing happen to me. Except I started walking harder sometimes",
            "She should move upstairs!!!!",
            "Age needs to invest in a white noise maker!",
            "When we moved in to a renovated bottom-floor under the land lady, I asked what noise was like and she said minimal.  It was not minimal.  But, we weee young and poor and used to living under people so it didn’t bother us (except when her son would play first person shooters with the sound system on, the constant background base rumble was a bit too much).\n\nWe were there for several years and through the birth of our first born.  After about 3 years she happened to be downstairs one day when someone was walking around upstairs and was *aghast* at how loud it was, assumed they were stomping and was even more aghast when we explained that was just normal and we’d been listening to her clearly walking around for years - could even tell when she was going to bed based on the pattern of tv off, windows closed etc.\n\nUnless you’re under it, it can be totally bewildering to learn just how much noise travels through.",
            "I have the same issue but with the people below me somehow, so where before I would try and not be too heavy footed when walking around now I don't care because they manage to make so much noise that it travels through their ceiling.  Feel sorry for whoever is below them though.",
            "Time for you to take up [performance art](https://youtu.be/4IRB0sxw-YU).",
            "20 years old is...not old. That's just cheap construction. Which also tracks.",
            "I had the same issue with sound in my previous apartment. I was a bit *too* considerate, which the neighbours below loved because they'd only had noisy ones above. Even then, when I was selling, they ***bought it from me*** at the set listing price. These were semi-detached houses with two floors, in an HOA where they'd now go from 450$ \"rent\" a month to 700$, so they got both floors to themselves. They were going to use it for when the kids visited (and enjoy the lack of sound in-between), but they could've bought a whole house for what these two apartments were worth, *without* the 700$ HOA costs. Weirdness.",
            "This is why my current rental is actually fairly nice. The sound proofing on the main floors is generous and I've never heard my neighbors...\n\nExcept in the basement.. Where there appears to be zero sound proofing because you can hear muffled conversation if talking at a normal level.\n\nThey also redid all the floors before we moved in. It's cheap flooring, and the tiling job they did is the worst I've ever seen (the tiles are not level, and so bad it's hard to sweep. They either had no damn clue how to tile, or thought this was a design choice, it's hard to tell) but at least they don't creek terribly!",
            "I had a downstairs neighbor like this. I sure as shit didn't make noise, but according to him I was jumping up and down on the floor. All the noise came from another neighbor on my floor.\n\nAnyways, one day my gf and I were lying in bed post coitus and the noise starts again. I tell my gf, that in about 30 seconds the dude downstairs is going to ring the doorbell. Lo and behold I was right.\n\nI run out to the hallway in my birth suit and tell the guy never to come to my door again. From here on, we would only discuss through the police. \n\nHe never talked to me again.",
            "Oh man she'd hate it where I live. I live in a similar building, there is zero noise insulation. It was jarring at first. My upstairs neighbors are a family with 2 teenage boys. One apparently does not walk, he runs. I can trace his running from the front door all the way to his room. To the kitchen. To the bathroom. Running everywhere. The other son is not a runner, but often has friends over who move furniture around, play indoor soccer, watch loud TV and wrestle. Mom has turned the dining room into a fitness studio and every morning while I sit at my table I can hear her directly above my head blasting her workout music while skipping rope, doing jumping jacks, and dropping her weights on the floor. There's also a dog that click-clicks his little nails all over the place. \n\nIt annoyed me for the first few months, then I got used to it. It became like white noise. \n\nIt's all part of communal living. You can't expect to live in a bubble of isolation all the time. \n\nPeople need to chill.",
            "Last day before you move, have very intimate and loud intercourse on the floor where the most creaking is produced. If you see her on moving day, say nothing and make full eye contact.",
            "Moving in a month? Remove anything breakable from your living room and throw a ball around for your dog.",
            "We moved a lot growing up and lived in a lot of apartments. My mom would get overly upset at the sounds neighbors made and stomp and complain. It was worse because she worked third shift—so she’d be trying to sleep during the day while the neighbors are being human/existing—particularly ones with small children.\n\nMeanwhile, she is very very overweight (300-400lbs) and does not step lightly and leaves the tv on loud enough for people to hear in the next building over. 🙄\n\nI understand that stuff can get annoying, but that’s apartment life. You gotta have a decent cushion of compassion and understanding around your neighbors. For contrast, my husband and I just moved out of an apartment where our downstairs neighbors were constantly screaming and yelling and fighting. A 3-4 year old that was always banging on the doors and jumping around and would still be awake at 1 am. And the parents would literally smoke so much weed that their smoke detectors went off all the time. One night it was 1am and they kept setting it over immediately after they turned the alarm off for a half hour. Which was happening while my daughter (2) was sick and they woke her up. That was the last straw for me and it took 9 months to get there before we complained. We honestly felt bad for the kids more so than for ourselves. It sounded like an awful home environment. \n\nWe just moved into a new apartment and idk what my downstairs neighbor schedule is—but sometimes I wake up to hear one of them turning on (what I think is) workout music past midnight. It doesn’t upset me—I’m not hearing profanity that my daughter is getting exposed to, there’s no fighting, and it makes me want to do better at working out lol",
            "She can cry all she wants. Since she refused to listen to the facts, I have zero sympathy for her.\n\nI would LOVE if she gets a noise complaint for banging her broom so much. If it were me, I'd respond to every bang with a deliberate stomp.\n\nWhen I lived in a different apartment a few years back, this one time I went into my bathroom to investigate a freaking noise. Turns out it was coming from the ceiling, from above me. I realized what it was in two seconds...yeah. It was THAT kind of creaking.\n\nTHAT'S when you get to respond by banging. So I did. I didn't have a broom, but I had a roll of toilet paper I hadn't used yet. So I threw it at the ceiling again and again. After several throws, the noise paused. Then continued. Throw. Noise paused. Continued. Throw throw throw.\n\nAfter about three minutes, they understood. I'm not trying to say you can't have a good time, but don't do it where other people can fucking hear you through their own ceiling.",
            "What about when upstairs neighbour gets into a health kick and starts running on a treadmill or skipping rope right above you? That is LOUD!! \n\nThe noise is always upstairs to downstairs. I’ve lived first floor and top floor and could never hear anything from underneath",
            "I lived on the second floor of a two story building with thin floors that also had an alleyway that magnified any sound that came out of the apartments",
            "I’d start a tap-dancing club.",
            "Make sure the movers make as much noise as is possible.",
            "I would have no problem going downstairs and pounding on her door every time she banged on my floor. She opens the door, continue banging on the wall.",
            "I had a downstairs neighbor call the literal police on me for my son (age 3) running down the hallway.  I had to explain to an office I try to get my son not to run everywhere but he’s a toddler.  The downstairs neighbor kept that shit up until they ultimately got evicted.",
            "She should try living with a Hoopoe nest on her roof. My old place was free standing it had a tin roof. Damn Hoopoes decided to make a nest. They’re like woodpeckers. Scared me shitless especially at night if they were disturbed. They were so loud once my landlord called our security company because he thought someone was walking on our roof. And he’s bedroom is far from my flatlet",
            "She sounds actually stressed out over this, like someone with sensory sensitivities. Maybe she really needs earplugs or some sound dampening foam everywhere.",
            "My old apartment was weird.  Anything not directly touching the floor got muffled pretty heavily, like I could hear their TV when I was out in the parking lot but not sitting directly below it.  Anything that did directly touch the floor got amplified like a drum.  It was always a trip going from outside to inside (or inside to out) as the sounds from above completely changed.  When they vacuumed on the weekends you could step outside and hear the whine of the vacuum motor, then step back in and hear what sounded like a bowling ball rolling around on the floor.",
            "Kids would be the coup de grace, my partner and I live in an apartment with normal floors and a kid above us. We can't hear anything from upstairs, except when the kid is around. I swear that kid stomps so hard and loud she's going to come through the floor one day.",
            "I would have stopped trying to be quiet",
            "Hoo boy. \n\nHaving lived in a downstairs apartment for seven years, I can relate to * your * experiences.\n\nWhy ? I'm not a karen, I'm a realist.\n\nPeople make noise in the process of normal living and upstairs neighbors vary. Some are relatively mellow, some aren't.\n\nThe most inconsiderate ones would get reported if one-to-one convos didn't work.. Usually, they had other issues that would cause them to get evicted sooner or later.\n\nBanging on the ceiling with a broomhandle ? Childish. She sounds like the apartment lifestyle isn't for her.\n\nWe all got to figure out how to live together.",
            "I think for the final few weeks you need to have some revenge and have loud sex on the floor daily. Show her what you being inconsiderate really works out to be, might save the next tennant some conflict. \n\nMy now wife when we first started dating had a 1 bedroom unit directly above another. The place was a real old shitty building and fucking terrifying in an earthquake (we were getting hundreds of quakes at the time). The rooms all matched identically so the bedrooms were above/below each other. We could hear everything he did like turning on tv, making dinner etc and vice versa. Poor guy below us eventually banged on the roof of his bedroom with something when we started getting busy again. Instant boner killer lol.",
            "I lived in an old building(greater than 100 years lol) that was a house carved up into 6 apartments. We were on the second floor. The couple upstairs had two huskies. We assumed their favorite game was let's throw the dogs at each other because nothing else could explain the concussive noises we heard on the regular.\n\nNever once complained. Only bothered with heat the one year because it all escaped through our 12' ceilings and heated their floor. The first floor tenant was just as generous with providing us with heated flooring in the winter every year after that first one. Their gas bills had to be astronomical. It was an old house.",
            "This is a choice you make when you move in.  Not once, upon moving into an apartment complex, have they not had open apartments available on the top and lower floors with same/extremely similar floor plans/space/cost.  If you don't want to hear neighbor walking noise, choose the top floor apartment.  That's all there is to it.",
            "I had neighbors once who called the police because my friend had heavy footsteps. Eventually this escalated to the apartments making *them* move to a different apartment because they were being ridiculous. The first time they called the cops on the next upstairs neighbor I saw him high diving the police after they showed up. \n\nNeedless to say they weren't in a better situation.\n\nEdit: I wanted to add the kind old lady who lived there before then didn't mind me playing my drum set within reasonable hours. Also I saw the old guys apartment once, it was absolutely full of cases of beer and my mom was pretty sure they were always mad because they were constantly hung over.",
            "Do more jumping jacks and pick up drumming as a hobby",
            "Lmao I lived in an old apartment and I had to put up with the woman in the bedroom above me literally JUMPING around her room at 7 am, shaking my walls and ceiling fan. Idk if she was a ballet dancer or something but she was literally *leaping* around erratically. Landlord tried to talk to her about it but it didn't stop. It fucking sucked but I guess that's what you sign up for when you live in an old apartment with shitty floors. :/ I would have LOVED to have neighbors that just walked around. She needs to invest in some high quality noise canceling headphones like I did. It's literally the only thing you can do, since most landlords won't fix things that aren't literally caving in (and even then it's a gamble).",
            "Buy a 50 pound bag of rice. Lift it to one height every time you take a step and slam it down. \"oh you don't like noise? Well I don't either, enjoy the sounds of petty bitch\" \n\nThese derisively people never stop. They just built the next person into never walking. You have to break Karen's like this.",
            "On your last day, jump around and bang on the floors a lot.",
            "Walk normal then, wear shoes, heel toe steps, and full forced footsteps.\n\nI live in a very similar situation. I am constantly tip toeing, shuffling and sneaking. Thankfully my downstairs neighbor has never complained.\n\nThe guy who used to live upstairs complained about me talking at 11 a.m.\n\nHe said he was a dog walker and he could barely concentrate with me talking at 11 a.m.",
            "We built our house with giant, thick layers of engineered wood, foam insulation, padding, and a good sized space between floors. The kids' rooms and playroom are upstairs with ours down. We didn't want the loud noise.\n\nMy older two and I grew up in old (like 100yo renovated) pier-and-beam houses, and my husband and bonus son always had concrete foundation with overlays. Those P&B are LOUD and the house shakes if you don't walk softly.\n\nThe older two walk relatively quietly from years of being told to, although one of them does sometimes stomp. I could sneak up on a ninja. Husband and bonus son... Not so much lol. Kiddo is still growing into his feet I guess, and it sounds like a penguin with extra large flippers on mated with an elephant and went on a stampede every time he comes down the stairs or moves quickly across the floor. (Love the stomper, not the stomping so much lol)",
            "This has nothing to do with the fairly new building. It's all about but shitty cheap construction. I hope your new place is wonderful.",
            "…20 years is considered really old??",
            "It’s ridiculous that anyone would consider a building to be old after 20 years.  Of course the floor has not been replaced.",
            "I've just learned something. This whole time you're all talking about 1st floor and I didnt get why that mattered but I've just realised you count your floors differently.\n\nIt's Ground, 1st, 2nd, 3rd etc here.\n\nBut it must be 1st, 2nd, 3rd, 4th (no \"Ground\").\n\nSo all this time, people have been saying 1st floor and I was like \"why does it matter that they're 1 floor up from ground\" when the whole time you meant the ground level floor.\n\nI love our differences, especially when I understand them.",
            "Since when is a 20 year old building \"really old\"?! It was made in the 2000s!! My house is 70 years old, and I know people who live in houses a hundred years old!",
            "20 years old and creaking and groaning is really cheap construction, with no insulation...  I've lived in places much older than that, with a lead-foot husband, where it didn't make that much noise!  Sounds like a horrendous building job.",
            "I am a downstairs neighbor solely for the fact the noise doesn't bother me..but I'd be so *stressed * being the one upstairs tip toeing around. \nMy 2nd floor neighbor has a dog that gets the zoomies that must include furniture diving 😂 and I think it is adorable.",
            "FYI - 20 year old house is not considered old.",
            "20 years old is not _old_.\n\nIf you’ve communicated with her and told her that you’re not being stumpy on purpose, you’ve said your piece. Every time she banged on the ceiling, I’d stomp around for the next minute.",
            "Ugh had a neighbor like that. Called the landlord to sit and listen, and he said all he heard were people walking to their bathroom. But landlord covered all the beautiful hardwood with carpet, and she still bitched.",
            "That is just something that comes with living in a multi-family building.  We own the first two floors of our condo and have one upstairs neighbor.  She asked if we could hear her walking around and I responded that we knew where she was in her place at all times.  But we also told her that it is just something you deal with when living close to others and not to change how she acts just because we can hear her.  Your neighbor sounds like they need to rent a house instead.",
            "When I lived on the second floor of a three-story apartment building I became acutely aware of just how loud normal walking sounds to the people below you because of having an upstairs neighbor. I began tiptoeing constantly to be courteous of the people below me. It was annoying, and eventually ingrained itself in my mind to where I did it without even realizing it. \nWhen I moved to a first floor apartment it took me about 6 months to unlearn walking on tiptoes in my own place",
            "I had a downstairs neighbor that called security on so many times they ended up getting a warning to get kicked out if they kept it up. \n\nThe final straw was that security walked into our appt and all the lights were off except reading lights because we were all studying. She called because we walked across the room. \n\nThen a week later she had a party and they were throwing bottles out the window. She stayed but one of her roommates were removed.",
            "I don't get how a 20 year old building can be this loud",
            "I live in the first floor apartment in an old house. I never heard my first neighbor, or my current neighbors upstairs… Before that one of the middle was quite the challenge. It wasn’t her walking, though… It was the drunken fights with her boyfriend, or they would slam stuff around. That was like a weekly thing. But even her I never heard walking.",
            "How's 20 years an old house?",
            "As I get older I’ve realised I basically have a super power in the form of never being irritated by noise.\n\nI’ve always liked to sleep with background noise like a film or traffic, but I basically never relate to anyone irritated by noise of others.\n\nNeighbours playing music? Dog barking? Fireworks? Loud exhaust? I honestly just plain don’t care. \n\nThe only exception I can think of is when someone is chatting though a movie at the cinema and it ruins the immersive experience and reminds me that I’m not actually in Pandora or wherever.",
            ">Maybe she’ll miss us.\n\nThis could well be quite true.\n\nWhen we first moved into our apartment, there was an old Greek guy two floors below us. He was with a younger Filipino woman who had some children from a previous relationship. Every day—every single day—this ugly son of a bitch would yell. He'd yell at the kids, at his partner, he'd yell about everything. Nothing would make him happy. I longed for the day this miserable fucker moved out.\n\nAnd one day it happened. They were leaving.\n\nBut was it better? No. New people moved in one floor below us (above Greek man's old apartment) and they were even worse. Fighting every day. Fighting so much that we wondered why these two people would ever be in a relationship with each other. They had parties until 3am, fine, whatever, people need to have fun. I don't know how they made the sliding door sound so loud but it was the most aggressive door opening and slamming I've heard. The guy smoked and it drifted into our apartment.\n\nThe funny part? After months and months of their intrusive noisemaking, she wrote us a letter and left it at our door. Asking us to be quieter. I told her the truth, that it was actually the children beneath her apartment running on their hardwood floors. I knew this because we were on the top floor and somehow it also sounded like people running above us. I guess the walls channeled the sound upwards.\n\nLiving in old apartments is just a noisy business.",
            "I've only ever lived in an apartment type (very loose description) building for a year.  It was **built.**  I could jump up and down on the floor and those living below wouldn't have known.  Bang on the wall as loud as I liked -- couldn't hear it.\n\nProbably wise, seeing as it was student accommodation.",
            "https://www.reddit.com/r/TikTokCringe/comments/1051ket/daily_life_of_an_upstairs_neighbor/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button",
            "Happened to us when we lived on 3rd floor. 2nd floor below us keep hitting with broom every night and keep complaining that we noisy and keep dropping pens even though we now. The lady's car keep partially block my garage but I never care but one day we kinda fed up with down stair neighbor and I called Ticket enforcer because she partially blocked my garage. Since then they never complain but still partially block my garage.",
            "This is why I don't miss apartment living. I had a neighbor in my last apartment who liked to engage in \"vigorous aerobics\" at 2am, and her bedroom was directly above mine. I heard EVERYTHING. 😖",
            "This floor’s for regular walkin’. Not fancy walkin’.",
            "Where is the malicious compliance????",
            "There's literally nothing malicious about this story... How is this sitting on 12k upvotes?",
            "Is it too late for a new hobby ?  Clogg dancing !",
            "Lolololol so malicious lololololol"
        ]
    },
    {
        "post_id": "k9y6w0",
        "author": "None",
        "title": "Need me to clean your oven? no problem.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k9y6w0/need_me_to_clean_your_oven_no_problem/",
        "score": 12937,
        "num_comments": 279,
        "created_utc": 1607540639.0,
        "selftext": "This happened to me when I was a field tech for a commercial restaurant repair company.  The company charged $110 hr. port to port. meaning from the time I left the shop till I returned. Being from the Southwest I resemble much of the BOH staff and working on ovens, I was usually dirty as well. On this particular day, the Chef had called in a service call for a convection oven that wasn't working and I had just finished ordering the parts when some top brass from the front office came in the kitchen to harass the BOH staff I suppose. One dude in a pair of khakis and a button-up asked me why the ovens were as dirty as they were, and I said, got no idea.\" Well, you need to get them cleaned up!\" Now usually I would have told him to kiss my ass and walk out but this particular day I decided to help him out, so I stayed a couple of hours and cleaned up his oven... At $110 dollars an hour. Of course, he disputed the invoice and threatened not to pay, but I had parts on order for another piece of equipment and if you don't pay, I don't come back and put your shit back together, so yeah, he paid.",
        "permalink": "/r/MaliciousCompliance/comments/k9y6w0/need_me_to_clean_your_oven_no_problem/",
        "comments": [
            "Absolutely pro level malicious compliance.",
            "The fact that he came in in khakis and started speaking like the ruler if the world makes me so much more glad you got him back.",
            "what is BOH?",
            "I had a ship’s captain insisting that I had to do all the prep work and replacing ceiling tiles, despite my job being to remove and replace the old radar with a sniny new model. I reckon him being charged technician rates to pull down and replace a boatload of ceiling tiles when any one of the crew could have done it for a fraction of the cost of little old technician me.\nMy boss asked me why I hadn’t refused to do any manual work and my reply was to look at the ticket because he spent a lot of money having a $120ph radar technician doing the work when he could have got one of his crew to do the work for a mere $6.75 per hour",
            "The Chef was probably thrilled someone was actually cleaning the kitchen, so even though they probably knew what was up, they likely just turned the other cheek. Love it!",
            "As soon as I read \"khakis\" I knew he did not work in BOH because anyone that works in food service knows good and well not to wear khakis because they will look dirty after a shift. Black slacks all day.",
            "I work in tech support fielding calls from Restaurant Equipment service technicians on a daily basis. We always request the end-user call us first to prevent unnecessary charges. From time to time we get a blow hard corporate or distributor saying \"Just get service out there ASAP\". We give them standard disclaimer, it's not a problem but just know that if it is not a warranty issue we are not paying for anything. They scream and exclaim, \"Just do it!\". So we do. At $150+ an HR. \n\nThe tech arrives on site. Calls us and says, \"It was unplugged\" or \"They didn't know how to turn it on\". All which could have been handled over the phone. \"Thanks for calling us tech dude/dudette. Please invoice the customer for all your time and travel. We are closing this case on our side!\" \n\nIt's so satisfying.",
            "Something similar this week. I had a new roof put on, so I get up at 6 to meet the workers and it's cold so I put on my insulated overalls and my old hoodie with a face gator. \n\nI need to ask him what section of the roof they're going to start at because I have an antenna up there that needs to be pointed correctly so I needed them to know that I'm the one moving it. \n\nI stood there for about ten minutes before he asked me \"what do you need buddy?\" and as soon as he realized I'm the homeowner his attitude changed to much more conciliatory. \n\nI don't fade him though, I did look like one of his roofers.",
            "Nice. This is perfect for this sub.",
            "Slams the door shut* this bitch goin on 450!",
            "I am a field tech in the exact same business and I enjoy your brand of malicious compliance. My favorite phrase is “where there’s a will, there’s a bill.” I think I made it up but I could be full of shit.",
            "Having worked BOH, your job really interests me.",
            "LOL\n\nDid the BOH staff realize what was going on and what it was going to cost the brass?  I imagine they would find that ironic and hilarious.",
            "When I was a kid, I had a friend whose dad was a plumber and came home a bit late one night. He had to wash a full sink of dishes before he could attempt a sink/plumbing repair. When his son teased him for 'spending him time washing dishes for other people' he didn't even get embarrassed. He just asked his son if he'd be willing to wash dishes for $50 per hour. Yeah, no argument.",
            "As a former restaurant manager I want to know how the FUCK you don't know your own damn cooks. That's shameful.\n\nJesus christ even as a director for multiple restaurants I knew every single cook at every single place... \n\nFuck this actually makes me so mad the more I think about it.",
            "How fucked does a business have to be for a boss to  not recognize an employee and think nothing of it",
            "/r/IDontWorkHereLady",
            "When I was an IT consultant I would occasionally be asked to help with tasks when I was onsite at a client.  Once I was asked if could cover the phones during lunch hour as they were short staffed. I always said yes, but reminded them how much they were paying me per hour.",
            "Lemme tell you tho, I never had a beef with any BOH folx at all. They always always were cool with us and we did what we could for them. Mutual respect goes a long way. Fuck button ups.",
            "Absolutely brilliant. Peak malicious compliance.",
            "BOH= Back Of House, the people who work in the kitchen and scullery.",
            "Good fuck that guy, you can’t/shouldn’t talk down to someone just because of how they look.",
            "You should cross post on r/kitchenconfidential We also hate FOH brass who come into our kitchens dick swinging and boss people around.",
            "Years ago I read a story about a plumber who showed up to a job and found the sink full of dirty dishes, even though he'd asked the homeowner to clear out the sink when the appointment was made.  As his apprentice watched, he put down his tool box, picked up a dish rag, and started washing dishes.  When the apprentice asked him about it, he said \"If she wants to pay me plumber's wages to wash her dishes, I'll wash her dishes.\"",
            "This. This is pro revenge!",
            "I assume you would be wearing a shirt with some sort of repair company logo? Meh on him!",
            "I really like this one. I know the type of khaki asshat. Comes in and starts ordering people around as if they don't know their own job! Okay boss, I'll clean your oven for $220. \n\nMaybe he'll think next time.",
            "$110 an hour is some high grade expert oven cleaning! Nice!",
            "Whoa. Nicely done. Threw the \"I don't need you; you need me!\"",
            "So he thought you are one of the BOH staff and ordered you around? Sounds like a r/IDontWorkHereLady type of story too!",
            "As a guy who occasionally managed service crew - I would be overjoyed at that utilization.",
            "As someone who can’t breathe when any type of oven cleaner is used, I approve this. And let’s be honest, if I could afford to pay that much an hour for you to come do my oven, I would..",
            "Reminds me of when I'm at my lawyers, and my wife starts to chit-chat. \"Sweety-Pie,\" I say in my most passive-aggressive voice. \"Focus. We're paying Mr. Ash a hundred dollars an hour to listen to us.\" In her defense, Mr. Ash is a super-nice and friendly guy.\n\nClarification: I'm reminded of this story because paying a pro hundreds of bucks for a menial chore ouch.",
            "I would've charged him a lot more than that for cleaning something that wasn't my responsiblity",
            "Ahole tax.",
            "First you cleaned his ovens then you cleaned his wallet as well. Top job! :D",
            "Missed a fine opportunity to also prep food, clean up the line, and do inventory check of the fridge. Well done, well done.",
            "Should have caught him with a \"bat wing\". Far too much of Waiting is completely accurate.",
            "OMG lol",
            "What is BOH?",
            "Very well done.  What's not to like?  The jerk got clean ovens and a lesson in assumptions.",
            "That's the spirit Tiger!",
            "God i work BOH and I wish I could do this at least once it sounds so nice and malicious at the same time its beautiful",
            "excellent >:)",
            "What does BOH mean?",
            "Oh my word!...even Monty burns would blush at this",
            "r/benevolentdefiance for taking care of your friend.",
            "I guess the phrase \"I don't work here\" never occurred to OP.",
            "Said the plumber to the housewife",
            "Not all heroes wear capes!",
            "You're the guy that fixes the Cleaveland Steamers?",
            "> Being from the Southwest I resemble much of the BOH staff\n\nWhat do you mean by this? Is this about skin color? Is it common in the american south west?"
        ]
    },
    {
        "post_id": "iurfdv",
        "author": "PilotLights",
        "title": "Force me to take a useless sports physical? I'll make sure I fail it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/iurfdv/force_me_to_take_a_useless_sports_physical_ill/",
        "score": 12937,
        "num_comments": 524,
        "created_utc": 1600373669.0,
        "selftext": "Some background: \nIn high school, I went to an academic magnet school. Essentially it was a public school ran like a private school. You had to have certain test scores to get, no bus transportation (since it was for the whole county), way stricter dress code than all the other schools on the district, and they were able to have a ton of extra rules because it was a \"choice school.\"\n\nNow I was the first graduating class; I was there the first year it opened. At that time it was 5th-9th grade, and I startoed as a freshman. The second year they had completed the elementary wing, and so it was K-10. They added grades until my senior year when it was finally K-12.\n\nAs the school grew, it continued to add more policies. My sophomore year (the school's second year of being open), they began a new policy where ALL students 7th grade and above had to be on a sports team everywhere.\n\nI thought this was really, really stupid. I hated it. I'm not an athlete; I was in other clubs, and I was getting increasingly involved with my church. Being the mature 16 year old I was, my initial plan was to join a team and have a bad attitude. Like an awful, evangelistically bad attitude so that no one would have any fun, and this would prove to the school how awful this rule was.\n\nInstead, for all the lazy kids like me, they started a school walking team. It wasn't power walking - just regular walking. We just had to walk around the neighborhood for about 45 minutes 3x a week after school.\n\nI was fine with this; I didn't mind walking around. Of course there was an adult 'coach', but since the whole thing was ridiculous anyways, my friend and I declared ourselves co-captains. This mostly consisted in telling the middle schoolers to walk faster. No one else considered us co-captains, but we did, and that's all that mattered to us since it was all a joke anyways.\n\nI did that my sophomore and junior years, but fast forward to my senior year. I was 18, working part time about 15-20 hours a week, I was super involved in my church, and my family was a chaotic mess of dysfunction that traumatized me in numerous ways. \n\nThey finally enforced the state law that everyone on a sports team has to have an annual physical on file. I didn't really bother with this since it wasn't a real sport anyways. Eventually, they came to me and said that it was so late in the season that even if I got a physical, I would need to pick a different sport in the winter or spring (walking team was a fall sport). \n\nI was essentially just \"screw this\"; I had enough other things in my life to deal with, and I didn't want to put up with this crap anymore. I decided to do exactly what they say and get the physical; i also decided I would do my best to fail it.\n\nSo eventually I went and saw a doctor. It's important to note that I didn't have a primary care doctor at the time; that's why I didn't get a physical before then. So I just went to some little walk-in clinic, and I tell them I need a sports physical. I didn't tell them what the sport was.\n\nNow as I was filling out the patient history form, I answered truthfully; I did not lie, but I didn't provide any context. So I checked yes to a history of asthma (mostly from when I was a kid), severe seasonal allergies, AND a history of seizures.\n\nSee when I was 13 I had a couple dozen seizures in a day or two; no one knew what was going on, and eventually I was diagnosed with epilepsy specifically having 'absence seizures.' Since then, I \nhad been taking anti-convulsants every day. As far as I am aware - even 20 years after that initial episode, I'm not sure I've had a full blown seizure since then. It's literally the mildest case of epilepsy I've ever heard of.\n\nThe doctor does a quick physical exam - mostly vitals and similar things. As she looks at my patient history form, she asks about the seizures, I explain that I was diagnosed with epilepsy, I take anti-convulsants, and I have a neurologist I see about once or twice a year. She says \"well i can't pass you until I hear from your neurologist.\" \n\nI basically hopped out of the chair, happily said \"thank you\" and walked out. I never did contact the neurologist; instead, i just gave the paperwork to the school.\n\nAnd that's how I (a relatively healthy 18 year old) got medically disqualified from the school walking team.\n\n[Edit: Fixed some typos]",
        "permalink": "/r/MaliciousCompliance/comments/iurfdv/force_me_to_take_a_useless_sports_physical_ill/",
        "comments": [
            "I just want to comment that I apparently have the mildest form of epilepsy ever: I never had seizures, take an anti-seizure medication, and was only diagnosed because of some random EEGs done.",
            "Best PE credit (college) I took was backpacking and Hiking. Class met 3 times.\n\n1st was meet professor, syllabus, and basic what you need.\n\n2nd was day hike in a state park. 15 mile I think (was 30ish years ago)\n\n3rd was 2 days, 35 miles. Another state park, stayed at parks campground. I was the only one (out of 17 or so) who brought coffee. Easiest A ever.",
            "One of my boys went to a magnet school. They tried to make him do PE. He has horrid exercise induced asthma, but they wouldn’t excuse him for that. I got him excused based on the fact that he was too small to fit the required uniform. He was still a size 4-5 the smallest uniform was a size 7-8. I could have altered it (I’m pretty good with a sewing machine) but they didn’t ask. Boohoo no PE.",
            "My son is allergic to being hot.  His whole body turns to hives.  The school argues with me about every 4 months asking for a new letter from the peds office.  I now just have a stack of photo copied letters to turn into the school.",
            "How is walking a fall sport specifically? Wouldn’t you walk in summer, spring and winter?",
            "Hah, love it. I went to a school like this and thought I was hard-core because I'd break the strict dress codes with too many jelly bracelets, flamboyant socks and an untucked shirt. We were supposed to get expelled if we got a certain amount of infractions after our \"infraction cards\" were filled up, but id rack up multiple pages of extra infraction card pages with petty uniform infractions. \n\nI got decent test scores and did well in the specialty programs so they never actually expelled me, but I managed to be the least favorite student of all of the lqme teachers and the favorite student of all of the cool or cool teachers, the two not being mutually exclusive, lol. Fuck the man, man, and fuck that dumb school. \n\nI will say... to the dumb schools credit, I realized in public high school that it was probably a good thing I thought I was the baddest bitch on the block doing trivial things that weren't actually getting into real trouble. But also got addicted to being a low key rebel.",
            "See here in the Washington DC we have academic magnet schools that dont even HAVE sports - no teams, no PE. (Of course many don't have the extra bullshit of drivers ed, home ec, art, band, etc either JUST ACADEMICS focused on science, languages, etc).  So yeah. Im not getting the whole sports push either.",
            "This is the most high school thing I've read in a long time.",
            "Other than not contacting your neurologist you did everything correct. You do need to answer the questions exactly how you did.",
            "\"I was co-captain of my high school walking team\" is the best not brag/brag I've ever heard.",
            "This isn't exactly the same, but my middle school had a policy that 7th and 8th graders had to take a PE class, a computer class, and an elective. Somebody figured out that if you took an extra non-computer elective in 7th grade, then the school would let you drop PE in 8th grade to take a computer class. I don't know why we were given the leniency to pull such a scheme, but I (the least rebellious middle schooler ever) managed to get away with it. Literally all it would have taken is for any adult to tell me I couldn't do that, and I wouldn't have. I've always found that amusing.",
            "Is there a watch-paint-dry-anything goes-martial-arts-sports-team?",
            ">walking team was a fall sport\n\nDepends on your balance and agility.",
            "Although that rule is stupid as fuck, I respect the school for trying to keep their children somewhat fit and out of trouble during after school hours.",
            "Lmao this reminds me of the magnet school I went to. I was there the first year it opened also, but ours was only 8th and 9th grades the first year, and continued to be now a 5th-12th grade school.\n\nWe originally had a PE teacher when the school opened, but his **house burnt down** and he missed a bunch of days so the school *fired him*\n\nThey continued PE for the rest of the semester, but then they replaced it with a 2 hour class. \nWe ended up only getting a half credit for that class and you needed a full credit to graduate.",
            "It was sounding familiar and then I immediately recognized our school when you got to the walking team. Hello fellow Hawk! Also a member of the inaugural graduating class. My username will probably be much more recognizable than yours.",
            "You’ll regret this when you’re 35 and hate how unfit you are. Source: I’m that 35 year old.",
            "I once got out of **multiple weeks** of gym class after a tonsillectomy, even though my doctor only said to rest for a week and a half and that I should be okay to do mild exercises afterwards, but to careful ramping up slowly until seven weeks after my surgery.\n\nI told my gym teacher that I couldn’t do gym for seven weeks, and because my surgery papers had been filed with people who probably didn’t look into the specifics of my recovery time they backed up that assertion.",
            "PE was compulsory in my school until 16. I hated it, I'm not competitive, I'm not good at sports, I LOATHED the aggro I'd get from the sporty kids when I tried, so instead of trying to play well, I actively tried to play badly.\n\nMy friend and I came up with a game of \"who can touch the ball the least times in a game\" which involved us leaping out of the way of the ball, whenever it was kicked/thrown near us. \n\nIt infuriated the sporty kids and the teacher, but there was nothing they could do - they could force us to play, but they couldn't force us to play well.",
            "Being involved in religion and not having a primary care doctor are the kind of red flags that keep me far away from some people, tbh.",
            "Haha that’s hilarious 😂 \n\nI wish I had the option of a walking team in high school. We had all the ball sports to choose from (I can’t hit, catch, throw or kick a ball) and a few others like rowing, boxing, fishing etc. I struggled to find the least strenuous activity. I would have loved to have just been able to walk around. What a bludge lol.",
            "Reading these comments makes me so grateful for the public school my kids are in.",
            "So I was all set to be pissed about you fighting the sports physical because this is exactly my job. My first job out of undergrad was a 6-12 magnet school working with the athletes. And then I got to the part like two sentences into the actual story where they *required* you to play sports and I was like “Nope! That’s crap! Whatever you do is justified!!” Good on you for finding your loophole.",
            "I went to a Vocational school. They required us to have Gym the first year. We complied and played frisbee, pass and hackie sac.  Last two senior years there was no gym :)",
            "Was this an Idea Academy, those things are popping up everywhere down here in south Texas. They're awful.",
            "Did you grow up to be Jeff Winger?",
            "*sigh* “Time to break a leg”",
            "Your teachers should be ashamed of themselves.",
            "I may run XC, but I can't help but applaud for your thinking. that state law seems dumb",
            "Mild club foot, jogging is a bastard on my ankles. Tried my best, but i destoryed shoes and hurt my feet.  Never could convince them.",
            "i remember when i was younger, i was on the football team (soccer). But due to my birth month of december, and being held back from starting school so i was older, i was put on a team with the boys a class higher than me.  \nSo i got teased a lot and constantly benched by the coach. So i lost my enjoyment of football.  \n\n\nSo when the school started doing football during classes, i instead became a very direct football player, meaning i went directly after the person with the ball, and hard hitting the ball while they were hitting it too... not doing dirty things, just being very direct and head on.  \nSo the other class mates, refused to play football with me, so we got to play more dodgeball and other fun games.",
            "This story kind of makes me sad. The OP may ha e been busy, but an upbringing that instills a background in physical fitness is an incredible gift to the person who receives it. Without your health your quality of life collapses, and your performance both body AND mind deteriorates. \n\nSports are also valuable character building experiences - overcoming adversity, working as a team, leadership skills, etc. Athletics aren’t required to be a happy and functional human being, but they’re a tailwind for sure. \n\nMaybe the school didn’t go about it perfectly, and maybe the OP was busy doing his work and religious stuff, but ultimately he missed out on something that could have been a growth experience.",
            "I’m glad you got around the rules. However, physical activity is good for EVERYONE! Even people with seizures or asthma etc. I know it sucks when other people make you do it, but the point of that is because most people won’t do it on their own. Move as much as your body allows!",
            "You this pretentious in real life? Jesus fuck.",
            "My sport in high school was marching band...",
            "We had it at my school too - Leisure Walking. Until people decided it wasn’t sporty enough and changed it to “Walking with Energy and Life”",
            "You sound insufferable but I guess that's teenagers for you",
            "Lol this is how you get depressed adults who don't know how to take care of their bodies because they think they're too smart to do any physical activity which is also a major part of taking care of your mental health. Good luck on your extra meds to take care of your mental health, buddy!",
            "Ah yes, a fellow epileptic who has seizures 100% under control but will use the diagnosis for malicious compliance.\n\n\nI used mine years ago to get a PE class with my friends so if I had a seizure there were students available to help me.",
            "Hahaha! Nice conclusion.",
            "I never understood magnet schools. A lottery to enroll back in your own school? Messed up",
            "I used to be in the military. Every year we’d have a fitness test. I was always fit enough to pass. Those who failed had to go do remedial fitness sessions twice a week instead of working, so what was the incentive to pass? What i’d do is sprint as fast as I can and get to the finish line and stop, sometimes sit down and then cross the line at the very last second.",
            "My high school gym was a joke. Basically, in nice weather we walked around the track. In bad weather we walked around the basketball court. I was an athlete and hurt my shoulder freshman year. Obviously nothing that would keep me from walking in circles, but i still made sure to get that doctor's excuse to get out of gym and get an extra study.",
            "Reminds me of this one work assignment I had.\n\nI was subcontracting to a group to support some equipment from our company to interface with their equipment. Their equipment was being developed, built, and delivered by some other site. Their internal contention came down to \"you're late in delivery, don't ship it until you test it and we want it now\".\n\nSo their equipment got tested, shipped, and delivered. It was subsequently plugged in, turned on, and found to be an utter failure that needed to be completely redesigned and rebuilt onsite.\n\n\"Why the fuck did you ship us this shit? You said you tested this!\"\n\n\"Sure we tested it. It failed miserably, but we tested it.\"\n\nBeing a lowly subcontractor, the best I could do was sit back and press a button on command between popcorn.",
            "Whoa! 95% we went to the same school. MH?",
            "I have absence seizures. They're increasingly more infuriating, because I tend to go \"absent\" more often and for longer periods of time as I get older. But although I was diagnosed with the absence seizures when I was 10-11 (I'll be 38 end of the year) they refuse to diagnose epilepsy or give me meds because I don't have the convulsions, just the absence.\n\nIt's hard as hell explaining to a new doctor (much less a lay person) that I have a seizure disorder  but I'm not epileptic and never been on meds. I get looked at like I have no idea what I'm talking about.",
            "I skipped P.E. (one of the most useless subjects when not taught well) during HS.  My high school had obligatory P.E. classes during 1st and 2nd semester, but we were forced to carry stay after normal school hours for about one and a half hours. It was absolutely boring and I was already taking volleyball and karate. The first semester was an absolute mess because they thought it would be a great idea to have 400+ students take P.E a the same time. My friends and I just went around and walked around the school or hid in the library. We just came back when the teacher took attendance. The next semester they organized themselves better, and this was no longer possible.  So, I decided to involve myself with other school activities, and got a teacher to sign for me and a few other classmates so that we could be excused from P.E. It was a win-win situation, I got to stay in-doors with the A.C. , I was able to participate in contests and got an easy A in P.E. I must have gone less than 10 times in the whole year. Seriously though, why bother forcing teenagers to get into a team sport?",
            "That was genius! If my school had a rule that everyone had to be on a sports team, I would have destroyed the school. I hate most sports, especially ones that have you chasing a spherical object. If I could have been on the rodeo team, that would have worked, But I didn't have room for FFA (Future Farmers of America) in my schedule and you had to be in FFA to be on the rodeo team. Also my parents wouldn't buy a horse for me, which is the only thing I asked for from ages 7 to 16.",
            "Wow you sure showed them.  Clearly you're proud of yourself for doing exactly as anyone should and tell their doctor their medical history.  Sick burn bro",
            "I have been operated from hernia at the age of 2 months,allowing me to skip school.gym classes due to it even though I am fully tecovered and healthy",
            "The co-captain bit lmfao I wanna be your friend",
            "This is fucking genius",
            "Fuck sake dude, just take the physical and do a sport. I hate your attitude so much.",
            "Wow. Impressive amount of effort to avoid walking around and not participate in things you might not thoroughly enjoy. \n\nWe’ll see how that works out for you when you grow up. 👍. Lol.",
            "That fancy school doesn't seem to have done your proofreading skills any favors",
            "Well done!  I used to sign my mothers name on notes excusing me from PE.",
            "I have a similar story, except mine's more of a petty revenge story. So, when I was in 8th grade I pulled a prank that caused my finals scores to become null and void (I blew an air horn in the middle of the math final and was hilarious), placing me in average classes like Algebra 1 and Intro to Biology the next year. They even put me in the basic P.E. class. After about a month of repeating basic bs I learned the previous year, I requested to be transferred into higher difficulty classes, like Biology 2 and Algebra 2. I even went and got signatures from my teachers as proof that they believed I should move forward in my classes. They quickly shot down my request, stating that they were unable to transfer me into higher classes because of my finals scores from the previous year, and because of the prank I pulled during the final, I wasn't allowed to retake the test. So I did the only thing that I could think of: I refused to do any schoolwork, except for test and other large projects. I wouldn't do a single worksheet they gave me, but when they handed me a test, I would pass it with flying colors. I also slept through most of the classes. Even in P.E., I would only do the test they gave us, didn't do warm ups or any of the other curriculum. And I did this until the end of my sophomore year of highschool, when I decided I was gaining nothing from the curriculum. So I walked into the office, politely requested the paperwork for the G.E.D. test, took the test without studying, and brought the scores to the district office, showing them that I was indeed capable of higher curiculum classes, and promptly unenrolled myself from the school. Not as interesting as your story, but I understand the \"I'm purposely going to fail\" attitude. \n\nTldr; I pulled a prank, wasn't allowed to go to classes I qualified for, so I didn't do any work, except for test.",
            "Man you sound like such a delight /s",
            "that was beautifully written, and the ending one-liner literally made me laugh out loud. most people have no idea how to conclude a story, but that zinger was fucking amazing. well done man and congrats on the malicious compliance.",
            "During a obesity and mental health crisis telling kids they have to do a bit of physical exercise is possibly one of the best decisions a school could do to tackle the problem.\n\nI mean it’s not like you had to do anything hard or difficult, you were on a walking team off all things lol\n\nYou thought you were better than that because of your other activities but I bet across the board this was a very good idea, all schools should make children take part in physical health activities, for their own sake and for tax paying countries where health care is subsidised.\n\nLess malicious compliance more just smart ass like kid behaviour thinking he knows better and making his own life harder for the sake of it tbh. But least you don’t need to walk anymore.\n\n*Slow clap*",
            "Lol",
            "[deleted]",
            "Wait. You were taking anticonvulsants regularly but didn’t have a pcp? Where were you getting your meds from?",
            "I am in awe over your dedication to failing *walking* of all things. That's just 'chef's kiss' magnificent",
            "Hahaha great job!!",
            "This is just a great example of malicious compliance! Cheers!",
            "Ll",
            "This is the first time I've cringed at one of these.",
            "My cat had worse epilepsy than you. \n\nMiss you Shadow.",
            "Good story.  But, fwiw, the school didn't care-- they were just following bureaucratic hoops set by government.  \n\nThey probably, for marketing reasons, just want to be able to say in their literature \"all students required to participate on a sports team\".  Going for the whole 'we produce well-rounded young adults' vibe.\n\nThat you got a medical waiver is no skin off their back.  It was nothing personal in the first place.",
            "I got diagnosed with fibromyalgia and my doctor told me, no high impact sports. With i had that in high school.",
            "Is this what Jesus would do?",
            "You seem like a whiner, faulting the school for wanting to kept its students physically healthy. Lying on your medical form to get what you want is pretty sad too. At least you admit you’re lazy.",
            "This is so unhealthy and generally entitled.",
            "You *absolute* **UNIT**!!! ***NICE JOB!***",
            "Actually NONE of those things are covered in most European schools eith. HOWEVER the state also provides sports and arts after school which is only half day. Most countries you cant drive til 21 but there is great public transport so no drivers ed. Home economics is a family issue not the schools."
        ]
    }
]