[
    {
        "post_id": "o4c6y1",
        "author": "Unique-Emergency3407",
        "title": "Update to Nightmare Situation: Me(35F) with Partner(40M), my son and his nephew (15Ms)",
        "url": "https://www.reddit.com/r/relationships/comments/o4c6y1/update_to_nightmare_situation_me35f_with/",
        "score": 6377,
        "num_comments": 177,
        "created_utc": 1624214830.0,
        "selftext": "Original post: [https://www.reddit.com/r/relationships/comments/nb1jcp/nightmare\\_situation\\_me35f\\_with\\_partner40m\\_my\\_son/](https://www.reddit.com/r/relationships/comments/nb1jcp/nightmare_situation_me35f_with_partner40m_my_son/)\n\nHi again everyone. I posted about my family problem about a month ago and was bowled over by the amount of kind and extremely helpful comments I got. Someone requested an update, so I'm posting now to tell you what's happened since. To be honest it's also to unburden myself, the boys are really sweet but I obviously can't talk to them about these things and there aren't a lot of people in my life I feel comfortable sharing all the details with. I suppose I'm embarrassed.\n\nThe week after my original post, I met with a family lawyer I know to go over options. I actually wrote down the legal suggestions posted here to discuss with her, but unfortunately, after going over each and several others in detail, we had to conclude that for each one, while it might technically be feasible, it would either take too long to be practical, or require things from Bob or from Ben which for various reasons were not ideal. Following the meeting, I was mulling things over and decided to take a long hard look at our finances to see what might be affordable as a compromise, such as perhaps sending Ben to a GOOD boarding school and pay tuition up front, so that if I then left Bob it would be easier and cheaper for him to leave Ben there rather than move him to a different school.\n\nAnyway, I went over our financial records with a fine-toothed comb, and that's when I discovered Bob was cheating on me, and had been for the entirety of our relationship. It turns out that, prior to Ben's parents' death, Bob had been about to move in with another woman. This woman didn't want kids, so when Bob was suddenly faced with taking custody of Ben or seeing him placed in foster care, she made it clear she would not be involved (for the record I can't say I blame her - I love my boys with all my heart, but asking someone who never wanted kids to parent a bereaved 11 year old she has never met is not in anyone's best interests in my opinion). When I confronted him about the affair, he didn't even attempt to deny it. He seemed ashamed (good!!) and just asked what happened next, so I told him that next he was going to get his stuff and get out of my house, but first ask Ben if he wants to go or stay, because it wouldn't be fair to disrupt the poor kid's life any further. Ben quickly said he preferred to stay, and Bob seemed frankly relieved. He moved out that weekend and I haven't seen him since. We've been in touch by text to discuss financial arrangements, though, and last week he sent me money to cover Ben's basic expenses (nothing like as much as child support, but under the circumstances I'll take it and be glad). From his attitude I take it that he's seeing this as a longterm thing, but even he doesn't, according to the family lawyer, his leaving Ben with me even for a while, along with Ben's age and the fact that Bob is his guardian rather than his father, would make it easier to build a case for Ben to stay even if Bob does try to fight it. The lawyer is confident that such a battle could be won, or at least dragged out till Ben is 18 and it doesn't matter anymore. So that, as you can imagine, has been an enormous relief.\n\nThat makes it that much harder to admit that finding out about Bob has still hit me hard. The fact is that, even though I was absolutely done with him and wanted him out, there was a time I truly believed he wanted to be with me and that we could build a life together. I knew our relationship wasn't a romance for the ages or anything like that, but it was by far the best I'd had since before my son was born and I really thought we cared for and valued one another. Now I realise that all he ever wanted from me was a mother for Ben. He as good as admitted it, and in retrospect it makes complete sense. That's why he never wanted to get married or buy into my house even though I offered (though now of course I am grateful!), because he wanted to make it as easy as possible to split from me once Ben was old enough to no longer require my services. I think it might even explain why he was so hard on Ben and grasping at straws for a reason to send him away. I never expected it of him based on what else I knew or I never would have been with him, but if he was blaming Ben for getting in the way of his life and simultaneously feeling guilty for, that could turn a mild-mannered person mean I think. Maybe he even thought if Ben was away most of the time the other woman would be willing to compromise for a few years? I don't know. I've even been wondering whether he decided to pursue me before we'd even met (the boys met first through an extracurricular where they became friends. It's possible that Jason mentioned my being single in passing, allowing Bob to identify me as potentially 'suitable' before we ever met).\n\nI'm sorry this is such a mopey post, I truly am grateful for the way things worked out, I think it's the best possible solution for everyone under the circumstances, and not one I could have achieved without Bob's 'help'. And the boys have been wonderful, they didn't know I was trying to get Bob out anyway so they've been treating me very gently (or as gently as you can expect teenage boys to be, anyway) and trying to pretend they aren't thrilled Bob is gone when I'm in the room. I'm glad of that, to be honest. I AM so grateful he's gone and Ben is still safe here with us, I just need a bit of time to really remember it, I think.\n\nTL;DR: It turns out Bob has been cheating on me most likely for the entire duration of our relationship. He's moved out and left Ben with me.",
        "permalink": "/r/relationships/comments/o4c6y1/update_to_nightmare_situation_me35f_with/",
        "comments": [
            "You are one heck of a mum and an even better person. Ben and Jason are lucky to have you 👏",
            "Bob may not have chosen you to be his partner, but Ben chose you to be his mom. That’s a testament not only to what a shitty human your ex is, but what a wonderful person you must be for that child who has lost everyone to have chosen you. I hope things get better soon for you and your boys",
            "This is not a mopey post, this is a beautiful post. You are an amazing woman and those boys are lucky to have you and so will your true love when you meet him.",
            "Well, as it turns out, all of you can do better than Bob the shitbird.\n\nBe thankful you will not be tied to him, because really, he’s going to drop the responsibility of Ben in your lap and fuck right off. Your attorney is going to fight for you, your kids, and Ben. And that’s all that matters. Bob is a giant nothingburger. Treat him as such.",
            "I’m so sorry for the mess of feelings you must be experiencing right now.   The hurt of being betrayed, the confusion of how Bob used and manipulated you when you believed you finally found a great man after so long, yet the love and relief you have for Ben being safe.\n\nI imagine the hardest part right now is the fear of your own judgement and trust in your thoughts and feelings since Bob was such a liar.  You raised Jason to be a fantastic son, brother, and human being — evidenced by his strength, empathy, and compassion to you, Ben, and your family unit.\n\nYou didn’t make a mistake.  Not a single one.  You are an incredible, smart, successful person.  I know that and you should know that because of how this has turned out.  Because of how Jason turned out.  Because of how Ben is able to and wants to stay with you.   Because the three of you are fine and you are able to take care of two teenage boys and get proper legal advice.  You achieved all of that while most people would not be able to.\n\nBob is a loser.  He’s a user and a liar.  He took advantage of your kindness and heart and he’s scum you were smart enough to reject before you even found out about the cheating and his ulterior motives!   Please focus on this!  You rejected him!!  \n\nYes, he made you believe lies. But your strengths and qualities let you discover them and make the right choices before you even knew the full extent.  Your awesomeness is also letting you recover and move on with two good young men who love and care about you.\n\nI hope you don’t give up on finding romantic love for yourself with a wonderful man because I’m sure he’s out there just wishing to have someone like you for his family.  Don’t let Bob have that influence or impact on you.  You are incredible and Bob was nothing more than an instrument to find Ben the adopted family he deserves.  \n\nWho knows, Ben might be the reason you find real love with a really good man! The way Jason accidentally led to Ben being in your life, we never know.   Just keep being you and being a wonderful mom and person.  Stay strong and be proud of yourself!",
            "It might be good for Ben to see a therapist if he isn't already. He's had a lot happen in the last 4 years. It doesn't hurt to have somewhere he can safely talk to someone who is an objective advocate.",
            "So glad that Ben gets to stay with you! You are amazing for being in his life and dedicating yourself to being there for him; for being someone who actually cares for him as his own person (not just as an extension of themselves, like Bob did).\n\nYou are so strong, and I know that it hurts now but time and self care will help. Just know that even though your emotions may feel confusing right now, it's okay to know that you wanted the relationship to end but still grieve it at the same time. You're grieving the loss of love that you had for him before, and that's okay even if the love wasn't there at the end. \n\nAccept your feelings as they are, don't judge yourself for any of it because you're not at fault for any of this and you're doing the best you can, and let yourself grieve and heal and move on in your own way, with your sons by your side. 💓",
            "I am not pleased with Bob but I am glad Ben is safe and that the boys are happy!\n\nYou heal, being lied to hurts, it doesn't matter if you were through with Bob or not, it hurts and there's nothing to be ashamed about.\n\nYou are bound for someone wonderful and I know the kids will be absolutely thrilled for you!!",
            "I’m really grateful that Ben and Jason have a great mom like you. Thanks for being a good person.",
            "Wow, I'm so sorry that guy sucked so fucking much. I just wanted to say that you sound like an amazing mother and you should be proud of yourself. You're absolutely doing the right thing.",
            "Holy Hera what a twist. I'm so glad Ben is able to stay with you and you can give him a safe and loving home. I'm sorry Bob turned out to be such a terrible person, though <3",
            "Screw Bob.... the only good thing he ever did was situationally bring you a great kid to have around. Ben sounds like a keeper.",
            "I'm sorry for the pain you're going through at the moment, and I'm sure it's only a small comfort, but you're really quite an awesome damn person. \n\nAll the best for the future.",
            "I'm so happy for you and I'm sorry for your loss. Just because it turned out great doesn't mean you can't grieve the ideal relationship or good times with Bob. I'm glad that you got the best outcome for you and the boys though.\n\nHave you been able to seek counselling? You would benefit from having even a short term outlet.",
            "You are an amazing woman - someone both boys will be better men for having had you to look up to. \n\nWishing you and the boys all the best, I'm sorry for the pain your facing, but glad things worked out for you and the boys as cleanly as possible.",
            "That’s just the trash taking itself out. Congratulations",
            "Remember the original so glad to hear the relatively positive update.  Good luck.",
            "You and your son are very good people, I’m sure Ben is grateful you entered his life when you did and Bob can get bent for everything he has done.",
            "I’m glad this has had a happy ending of sorts for you and the boys. You all have dodged several large bullets!\n\nI also completely understand the confusion and pain you feel for having been lied to and taken advantage of. I think you’ll probably carry those scars for a while and it might help to talk to someone if you can afford it. \n\nI’d also encourage you not to beat yourself up too hard. I think your analysis of his behavior is probably pretty accurate. But it’s also important to realize that anyone that would treat a child and relative the way he did would not care about treating anyone else badly either. He’s just a bad person that was able to hide it until he couldn’t hide the mask any more. \n\nI hope you can take solace in that it sounds like you’ve raised two amazing boys who are going to be such better men than this one. \n\nTake care and all the best. 💙",
            "Listen - I’m over the moon for you. I know you’re hurting, & it’s understandable. You still had what you believed at one point to be a loving relationship ripped away from you, & that comes with broken trust & betrayal. \n\nBut as I see it - not only did you cut loose a giant dead weight, a useless piece of scum, a poor excuse for a parent, & a potentially abusive partner - you gained a son. And I cannot think of a better outcome. What an absolute blessing, & you’re an incredible person & mother.  Congratulations 🍾",
            "I am glad for Ben and Jason that they have you in their lives. You are strong, caring, and fabulous.",
            "You are amazing and I’m so proud of you for doing what was right.",
            "I’m so happy Ben has you, the good thing that came out of all of this is that Ben has a loving person watching out for him. You seem like an amazing person. I’m sorry this hurts right now. You deserve to treat yourself a little bit!",
            "I’m so glad things worked out great regarding the situation with Ben. And I’m so incredibly sorry for how you’re feeling, betrayed is never easy. Finding out someone was cheating on you is never easy. I don’t really have much to say, but you are an amazing human being! The boys are truly lucky to have you.",
            "You sound like a total badass, and Ben and Jason are so blessed to have someone like you in their corner",
            "You are a beatiful person.\n\nThose kids are insanely lucky to have you",
            "I’m sorry that Bob treated you so poorly but you are a wonderful person. I wish my stepmom had wanted me as much as you want Ben.",
            "OP if you feel moved to adopt this child that you love and feel is family please try to make it happen. Yes he can make decisions at 18, but knowing someone wants you enough to make that happen will mean everything to him.",
            "Bob sucks tons of animal dong. I can see how he felt like he had to take in his nephew, but foster care and guardianship can be done just like you are doing now.  Foster care system can suck, but traumatizing your nephew by taking them in out of guilt then being steadily more verbally, emotionally, and mentally abusive because of your choice is significantly worse.\n\n\nGetting into another relationship under false pretenses solely to avoid being a parent to the child he voluntarily took custody because his GF is childfree is vile particularly since he planned to do it for several more years. He took advantage of your heart, kindness, generosity, love, home, and money. He was lying to you from the beginning and it's not your fault OP. It was an insane scheme for Bob to do  and he managed to get away with it for too long because you, OP, care about Ben. \n\n\nIf you didn't want Ben to be hurt further by Bob you had to stay with him despite how miserable it made you. Bob came out with the usual reasons why parents abandon kids and can avoid being fully shunned (though they should be): being LGBTQIA+, not disciplined enough, and not masculine enough. You rightly didn't see why you should abandon Ben or get rid of him even if those were true. \n\n\nBob made this mess because he could only do things like a coward. He couldn't handle telling people that he wasn't capable of being a father when his brother died. Instead he adopted his nephew and looked for a woman to be the parent he was a coward to raise. Same as he did with his GF kept seeing her and being with you. He showed his cowardice running away as soon as you confronted him about his affair.\n\n\nYou didn't make a mistake by opening your heart and believing that you are worth loving particularly as a single parent.",
            "You are as excellent a human being as Bob is a dreadful one. I wish all the best for you, for Jason, and for Ben.",
            "Bittersweet update. I'm really happy you got Ben but sorry for the cheating. Well your future certainly seems brighter and your problems pretty much solved themselves. All the best to you in the upcoming times.",
            "Good lordy, you're amazing! Jason and Ben are two very lucky boys.",
            "Thanks Mom, ur the freaking best.",
            "You got Ben in your lives. It was worth it.",
            "Your story is amazing and really well written.  I don’t normally read posts this long but yeah the prose kept me locked In.  \n\nThat dude totally had a plan.  He must have watched a movie or it was some idea he heard from someone. At least he respected you enough not to scam you……I guess.  The mental fuck is probably the worst. So sorry. But happy you get to make a difference in someone’s life.",
            "You're everything I hope humanity can be ❤️\n\nHang in there, we're all rooting for you.",
            "Wow just wow. You are an AMAZING human being and someone will be very lucky to be with you in the future. All the best.",
            "NOT mopey. You are entitled to yer feelz, U-E 3407! You are a great mom, and will be a better one in the future. I cannot think of anyone more qualified to shepherd these 2 boys (who are super lucky to have you, btw!) into manhood.\n\n&#x200B;\n\nGood luck!",
            "FTW! I wish I had more than upvotes to share with you! I read the original back when you posted... I'm glad it worked itself out. Break ups are hard, even when you see them coming, and they're for the best. You totally got this though. Everything well settle, there'll be a new normal routine. I'm so happy for you.\n\nOh, as a child of a single mom myself, happy father's day.",
            "Well now you learned that a good person who is homophobic, and abusive is never a good person.  He can't just be an asshole in this one part of his life but a great person otherwise.  He was just hiding it from you.  A good partner would be reasonable and not have any areas of their life where they are mean/abusive/hateful.",
            "You are such a lovely person.",
            "You are a good human.",
            "Holy shit. You must be the most reasonable, mature, understanding person I’ve ever come across on this site. You’re gonna do just fine.",
            "I'm really glad that this worked out for you and Ben! \n\nI totally understand your feeling about your husband--and it doesn't mean you aren't over him. He still betrayed you, and it's okay to process all of that. \n\nYou seem like a really great person.",
            "You’re an amazing person! Wish there were more people like you in the world! Hats off and much respect from a random internet stranger. Best of luck to you and yours!",
            "You are a certified badass. I wish nothing but the best for you and the boys - you deserve it!!",
            "Frick you rock. Amazing :) keep being you forever.\n\nSounds like the boys love you very much. You raised a good kid in Jason. Best of luck in finding better boyfriends. You totally got this.",
            "WOW. You're a rockstar. You are such a kind and wonderful soul. I'm sorry you're hurting, mixed relief and sadness are odd emotions, but having the boys stand together is so nice. I would offer only you still go ahead and adopt Ben, should he agree. I think it could be a nice way to formalize your family. Also, is there something Bob didn't like to do like bowling or miniputt you guys could turn into a fun family tradition? Either way: you should be proud of yourself and Jason, you're truly gems. This kid is lucky to have a mama bear like you. Good luck.",
            "You and Jason saved Ben's life. He may have committed suicide by now without the feeling of family and belonging that you two provided. \nI'm sorry for your struggles but you got a bonus son and Jason got a brother out of it so I'm happy for you all. You're a wonderful, good hearted person and so are your boys.",
            "This is an emotional - but wonderful - update. Just the little tidbit about the boys being mindful of your feelings after kicking Bob out... just warms my heart so much. What sweet boys <3  And clearly, you are a wonderful mother and I wish you the very best.\n\nIf I may, I'd highly suggest a bit of family counseling for the three of you as you move forward. For Ben especially, who has been through so much in the past four years, having healthy guidance would be beneficial. Good luck :)",
            ">That makes it that much harder to admit that finding out about Bob has still hit me hard.\n\nNo, no, no sweetie. Don't you feel badly about that. No one in there right mind would expect you to not be hurt and crushed by all of this. It doesn't mean you aren't strong as hell, it just means you have normal human feelings.",
            "This isn’t a mopey post. U are an awesome human being and amazing mother. I wish the best for you, but u already have two amazing kids that will forever be there for you.",
            "Shitty situation for you I know. But you’re amazing and thanks you from a stranger for taking care like a mama bear of both kiddos and putting their needs first.",
            "Wow, that’s quite the update. So sorry for the tumult of the past month. It sounds like you all are on a better path! I hope Bob gets a splinter under his nail.",
            "Not mopey, telling, truthful and inspiring sure, but not mopey. I feel like Ben has won some good karma in a past life because honestly the chances of someone doing what you did. It sound's like they have/are brothers now, at least given that you not only care as much as if they truly were,  but you truly show you do. I applaud and commend your handling of the situation, I wish you the utmost best from here on out. Life's a book, Bill, Beeb, Boob, BoBo, whatever his name was, it's just a chapter in that book. You're at the end of the chapter and have written a beautiful ending...but that's just to the chapter, now please, go make and ever better next chapter and that you finish with what you truly believe is the perfect ending to that book we call life :)\n\nP.S.\n\nYou say you're grateful for the way things worked out, I'm grateful people like you still exist and I hope your boys are not only grateful themselves, but truly know how lucky they are that in this mad mad world somebody cares so deeply and so much. Be safe and take care, keep being awesome!",
            "Wow, that was a surprising update. I’m glad things worked out for you and the boys but I want to give you a virtual hug given what happened with Bob. You are an amazing mom and both boys are lucky to have you in their lives. You’ve got this, don’t look back and go kick some butt!",
            "Fuck that guy. That is all.",
            "Takes a very good soul to take in someone else’s child, Ben and Jason as lucky to have you, and I hope you find good blessings in the future and always",
            "Bob is an idiot, and you are a kind, beautiful person. You are still way young and will find someone a million times better than Bob. Just give it time. Best wishes to you and your boys. I think you should tell them what you had planned. I bet they'll think you're a badass. Because you are!",
            "Well, Bob is an absolute garbage fire of a person. What an absolutely repugnant scumbag. You and the boys are much, MUCH better off with him out of your lives.\n\nThankyou for being such a fantastic mother, even to a kid who has no blood relationship with you. He's very lucky to have to you.\n\nBest of luck to the three of you.",
            "You seem like the kind of person who wouldn't think this, but you are awesome.  You need to understand just how awesome.  Hopefully Ben will, some day, be able to appreciate it too... but if he doesn't come to that realization any time soon, you realllly need to hear just what an amazing person you really are.\n\nThat kid was about to fall into a black hole and you just scooped him out because it was the right thing to do.",
            "You are an amazing woman. I’m so sorry you got in the path of a sociopath, it’s not your fault.",
            "I'm glad things worked out for Ben to stay with you. For you, please get tested if this man as been unfaithful the entirety of your relationship. That's for you as well as the boys.",
            "This is incredible. \n\nThe original post as well as this update, most intriguing and heartwarming thing I may have ever seen on Reddit! This is not at all a \"mopey\" post; this honestly might be the most ideal outcome one could hope for given the difficult situation. \n\nWishing you all the best!",
            "Man, you are a good person. Fuck bob.",
            "I guess some angels do live among us",
            "This is so amazing, bless your heart, you are such an amazing person.",
            "You don’t sound mopey, you sound very sensible and aware of both yourself and others around you. You tackled the problem practically and thoroughly, and had a great outcome.",
            "I'm a bit late to the party but wanted to join in the chorus of people letting you know how incredible you are, as a person and a mom.",
            "Omg that is incredible!!!! It's OK to grieve and feel betrayed and quite frankly insulted by how he used u but u got a wonderful son out of it and I hope u all feel better now and Ben can stay permanently! 🙏☺️💕💐 Ur a wonderful family now.",
            "So.... Win. Win.... Win?    \n\nHave I got that right?",
            "Wow this is an amazing update \n\nI’m so happy for you and your family",
            "I'm so happy everything ended well",
            "You sound awesome to me OP, and I'm glad Ben is still with you 🥰",
            "I’m so proud of you. It’s ok to cry and be sad about losing your ex. I can’t relate to everything in your post, but I do relate to the pain of realizing you weren’t valued like you thought you were. But you are so valuable. Everything you’re doing for these kids - it’s beautiful. Make sure to do for you, too. You deserve some treats and kindness.",
            "You have nothing to be embarassed about! You are doing a fantastic job advocating for your boys and they will remember that. Best of luck",
            "This turned out beautifully as far as I can see. Ben is so lucky to find someone like you in his life. Please, just know you are a wonderful person and I wish there were more people in the world like you",
            "congratulations on being so strong. you have been through a lot, and could not possibly have handled it any better.\n\nrespect.",
            "You’re an angel! Karma will do it’s thing and everyone will get what they gave.",
            "You are amazing and I’m so glad you are able and willing to keep Ben safe...not all family is blood, some is found",
            "This sounds ideal for everyone. Good luck to you guys.",
            "You are a good person.",
            "Man. You are a real live hero. Poor Ben for losing his parents and being stuck with someone who didn’t want him. I’m so happy he has found two people who live him.",
            "Kudos to you on being such an amazing mom because not only did Jason turn out to be such a great kid who would stick up for someone he felt was being treated wrongly, even if it meant he wouldnt get to enjoy the things he wanted anymore, Ben felt so incredibly welcomed and loved by you that he chose to stay with you. The amount of love you showed those boys, and taught to Jason, its a wonderful thing. I hope he doesnt come crawling back for Ben if his relationship doesnt work out",
            "\"I love my boyS with all my heart\"\n\nI love that you wrote this. To me, this sentence summarizes the type of human being you are. A kind, loving, generous, giving soul, an amazing mother and an extraordinary human being. \n\nBen and Jason are lucky to have you. You're molding not just two boys into men but two whole future families and you're doing a great job. I'm pretty sure their future partners and kids will forever be grateful to you. \n\nI hope and pray everything continues to resolve as smooth as right now cause even if your pride and ego are a little bit bruised cause of Bob's cheating, in the long run I think it worked for the best because guilt is a powerful thing that can work in your favor regarding keeping Ben. Overall I think: Good riddance! You and your boyS are going to be much better without him. Let karma take care. In the end, he gave you a beautiful son because that child might not have been born from you but he is yours. \n\nI don't know if it matters to you but this internet stranger is proud of you and your beautiful heart. \n\nSending the three of you best wishes, positive vibes, blessings, prayers and huge virtual hugs.",
            "You are a good person and a wonderful parent. I'm sorry that Bob has hurt you, but I hope you know you've been so strong and kind hearted through everything life has thrown your way. I really wish only the best for you and your family. Thank you for taking care of your boys.",
            "You are a really good person and I hope you know it!",
            "Sorry to hear that OP and for that pain.  But Amazing how thru such a devastating blow you are more concerned with Ben's well-being and not your own.  You are an amazing mother.",
            "OP, I'm really impressed by your strength.",
            "I was biting my nails reading your post worrying that Ben would have to leave with Bob,  thank God he's with you. It sounds like Bob will be good with the arrangement and maybe now with just you taking care of him Ben can be happy and not be made to feel less than.",
            "Wow, excuse my language, but what an absolute piece of shit that man is!! I'm so glad he's out of your life and Ben's, hopefully for good.\n\nYou also sound like an incredible mom. Of course it's going to be hard to accept that someone treated you so badly, but that's not your fault. You're going to be OK.",
            "This update made my day, no, my week! You are an amazing human being and your kids are so lucky to have you. This is what model parenting looks like ❤️❤️",
            "You are a strong wonderful person, mother, and role model for those boys. Well done for handling everything with a level head and total grace.",
            "Ben's parents would be bursting with pride and happiness that he found you.\n\nYou're an absolute angel in disguise.",
            "OP sounds like a good hearted person and great mum glad things turned out good for her",
            "You are an intelligent and decent person - thank you and best of luck with everything",
            "Fuck a duck! Bob is a giant C word. \n\nI'm so sorry that you're struggling with the dawning realisation of just how bad a person Bob is, but at the same time I'm so happy that you've all but legally adopted Ben ❤️ he is lucky to have someone who cares about him so much in his corner.",
            "Im proud of you. Im sorry you were deceived.  Those boys youre raising will know to do better.",
            "You are such a kind, loving and generous person. You deserve so much better than Bob. You didn't have to take custody of Ben but you did because you clearly care about him. I'm sure Ben is grateful to you for protecting him and loving him in a way that Bob refused to do. Kids like him need someone they can turn to, and it's great that he has you. He and Jason are lucky. I'm sorry that Bob treated you like that. He's an asshole.",
            "I wish you and Ben and Jason all the very best. You are good person and you deserve good things. You and those boys are going to be alright.",
            "You are one heck of a mom and an amazing human being! You deserve all the happiness and I’m sure it’s already headed your way!",
            "What an emotional rollercoaster! Sorry you guys had to go through that, but it seems like it's slowly working out for the best. The only good thing you got from Bob was Ben. I know it's not ideal to take on/raise someone else's kid, but it seems you're making a positive impact on his life. I'm sure his parents would have appreciated that. You're such an amazing person and mom!",
            "I am just now reading the original post and the update and while I know that finding out your SO cheating on you can feel like a kick to the stomach, even if you were thinking about ending things, I am so glad to hear that things turned out alright in the end. \n\nI can tell the love you have for both of your boys through your posts is strong  and I am so thankful Ben has someone like you in his life. It has to be so difficult losing your parents at a young age and to have your guardian then be openly hostile towards you must be awful. Thank you for sticking up for him and doing what you could to not only make sure you and your son were happy but Ben as well. I wish nothing but the best for you and your family ❤",
            "Wow. I remember reading your first post and thinking there was no way this would work out in your favor but so, so, wishing it would. I am so happy for you and your boys! You got the best case scenario, a quick clean break with everything everyone wanted. This just made my day :)",
            "I was a Ben. Kind of. Abusive home, I left in my early teens and struggled. There were people in my life who did the kind of things that you are doing for Ben and today I am upper middle class with a great career and a wonderful family. I owe it all to these people. One was a girlfriend the others were a couple who basically unofficially fostered me because they wanted to and because they believed in me.\n\nI not a religious man but I do believe in angels and I believe that you, just like the people who helped me out of goodness are among them.",
            "Like I sont get why people cant just learn that you can disagree with somebodies life style, but still respect them as a person and love them anyways.",
            "This is a complete win for Bob. Very smart play on his part.",
            "I'm so happy to read that this is what Bob wanted all along. From your last post I was afraid Bob was about to get screwed and get his nephew stolen out from under him. But instead it seems like everyone gets a happy ending.",
            "What an amazing update,  thank you.",
            "You are doing great and I have the highest respect for you",
            "You are a very awesome woman!",
            "Well done on being a wonderful human being!!",
            "These boys are lucky to have you in their lives! \nOh and F you, Bob.",
            "You deserve better because you are an amazing person! I can see my comment is a drop in the bucket but you earned every one of them. I wish you and the boys find the other family member you all deserve.",
            "You are a 10/10 mother to what seems like two great boys. Definitely seems like they won the lottery with you as a mom and you lucked out getting Ben over Bob, and the proof is that Ben actively CHOSE you as his mom. Seems like you raised Jason right too and I'm sure these boys appreciate you so, so much.",
            "This warms my heart so much. I had a verbally and mentally abusive stepparent, and my mother wouldn’t even leave him for her own biological children. The fact that you are able to stand up for this boy and care for him when he isn’t even biologically yours makes my heart just melt, because it’s always good to have a reminder that there are good women out there who will do anything for their kids.",
            "Very happy for you! All the best for your family! :))",
            "Bob is a spectacular PoS. You, however, are a solid gold lady.\n\nI wish you nothing but happiness and joy in your new life with both your wonderful sons.\n\nBob can go blow a cactus.",
            "I'm sorry you had to be slighted by Bob for this to happen. I'm so impressed by Jason's reaction to being favoured and it's so nice to hear two kids liking each other despite different personalities, and especially while an adult is being so petty. I can't imagine a better mum for Ben. I hope love comes your way again too and I'm sure it will hearing what sort of person you are. Good luck with it all",
            "Oh my God. I know you're over Bob, but it's still heart-hurty to be cheated on, that i know for a fact. I can't imagine, for the duration of your relationship. What a dickhole. I hope he always feels like he needs to poop, but never can. I hope he always sits in wet spots in chairs, and his pants never dry. I hope he gets holes in his socks and stinky wet gunk gets in his shoes. I hope nothing good happens. \n\nAside from that, you are a genuinely wonderful person & I wish you all of the absolute best in raising your two sons. You're doing fantastically. You've raised the one you gave birth to in a loving, moral, sane way, and you've given your bonus son a safe-haven to express himself, feel free, and be loved. I wish more people were like you. I wish I were more like you. Gosh, you're great.",
            "I know it hurts now, but exactly what needed to happen, happened, and you didn't have to pay a cent in legal costs or even argue about it.  The boys are almost grown up, you can start getting out and meeting new people now.  You don't need to waste your time being with anyone who doesn't respect and appreciate you.",
            "This is one helluva rollercoaster that you've been on, but I tip my hat to you for how you've handled this.\nYou've shown you're one amazing parent and human being.\n\nAlthough it has been tough, it seems the best outcome has been reached. You now have 2 boys who love you and are in you care. Your ex is gone. And now you guys all have a shot at a real future.\n\nWish you all the best in the future. We could use a few more people like you in this world.",
            "Your kids a lucky to have such a thoughtful mom.  Good luck to you and your boys.",
            "Youre an amazing mother! Ben and jason are lucky to have you.",
            "Sometimes things seem to happen for a reason, even the really shitty things. \n\nSeems like fate handed you a new son. But maybe this isn't about you at all... maybe this is fate looking out for Ben, and gave a young boy that had just lost both parents a really good, loving mother, a new brother and a stable home. \n\nMaybe you had to make a sacrifice and feel some hurt for that to work out exactly the way it did. \n\nIt does sometimes feel like certain moments of our lives are scripted, and unfortunately there's usually an antagonist in every good story ;)",
            "I’m so happy things worked out they way they did, I’m sure with time you’ll forget all about that whack ass bob guy",
            "I’m sorry. I’m happy for you, Ben and Kevin, but I get that it hurts. Don’t grieve over that sad excuse for long, you have two amazing boys that need your love and attention and want to give you their love and attention in return. I wish you and your family all the best!",
            "You are a fucking all star. Absolute legend. Ben and Jason will grow up telling people about how lucky they were to have you.",
            "I’m going to say something odd…you are an incredibly great writer and both of these posts were awesome to read - completely gripping and sucked me right in. I am so sad for your situation but honestly, you are the best thing that could have happened to Ben and my mom always says ‘everything happens for a reason’ and I think that’s bs but in this case? You saved that boy’s life. Hugs to you.",
            "You realized he was a disgusting, horrible man because of how he was treating Ben, an innocent child in his care. You know his treatment of Ben says nothing about Ben, it's entirely Bob's problem. \n\nIt's the same with you. How Bob treated you says nothing about you. He's a sack of shit who has no regard for the people in his life. He just does what he wants to get what he wants. \n\nI hope all three of you guys can get some good therapy.",
            "You are incredibly brave. Unfortunately the world has its users and he was one. You can still grieve as you had a life and invisaged a future together. I am glad the house is yours as this is a big issue in many cases with the women coming off worse. You are providing the much needed stability of care for both boys and love. You are still young and have much of your life ahead it is going to be better without this jerk.",
            "Great to read this happy ending",
            "Both the boys are so lucky to have you - you’re amazing",
            ">That makes it that much harder to admit that finding out about Bob has still hit me hard.\n\nThis is a perfectly normal reaction because, aside from Bob realizing he was being an AH and changing his behavior, this is the absolute BEST possible outcome.  Furthermore, Bob had been deceptive throughout the entire relationship.  Although the comparisons between Ben and your son may not have been made to get rid of Ben, I'm almost sure the idea of sending him to military school WAS.  There's a strong possibility that the woman he was cheating with got tired of waiting and he was getting desperate.  You don't want to be tied to someone like that.  I recommend concentrating on how much happier the three of you are going to be now.",
            "Hugs and a halo: you deserve both.",
            "Goddamn. I wish there were more people in the world like you. You are legitimately a kind, empathetic, and intelligent person, and I really hope your two sons—because you have stepped up so hugely as Ben’s maternal figure—appreciate everything you do.\n\nBob sounds like an absolute garbage human. And I’m glad you don’t have to spend the rest of your life with a close minded, narcissistic liar like him.",
            "A real woman ! You are an amazing person.he will get his, seeds you plant shall grow",
            "What a fucking animal. If he's from a \"decent\" family, I would have tagged all of his family members in a trash Jerry Springer style post. Fuck. Bob.",
            "Hey.  You are a wonderful person and I’m glad that you are able to have Ben in your life and not Bob.  While I’m happy that you have Reddit as a community to support you, I think it would be good for you to either find a therapist or a support group of some kind if it’s financially feasible.  You’ve been going through a lot and it’s important to take care of yourself and I think it would be good for you to have another way to process some of your emotions. \n\nJust want to reiterate what a bunch of people have already said and let you know what an awesome, badass person you are.  You’ve done so much for others, and I hope you find some time to take care of yourself in all of this.",
            "I am so sorry all of this happened to you but also really glad that it all worked out. You're a great mom and the living proof that you don't have to be relatives to be family.",
            "My god I wish that every child in this world had a mother like you. The extent your willing to go through for this kid brings tears to my eyes.",
            "I hope y’all throw a little bye bob party"
        ]
    },
    {
        "post_id": "hbckl2",
        "author": "wqzu",
        "title": "UPDATE TO: I [21/M] have been looking for my sister [18/F] since 2014. I found a way to contact her last night, but I'm not sure how to do it.",
        "url": "https://www.reddit.com/r/relationships/comments/hbckl2/update_to_i_21m_have_been_looking_for_my_sister/",
        "score": 6375,
        "num_comments": 153,
        "created_utc": 1592478437.0,
        "selftext": "This is an update to [this post I made in January last year](https://www.reddit.com/r/relationships/comments/8uknz2/i_21m_have_been_looking_for_my_sister_18f_since/). Not many people saw it but I figured I'd update anyway because I got some good advice and, I don't know, the outcome might be something good to read while having a poo or whatever. Fair warning, this is a lot longer than I expected it to be.\n\n\n**tl;dr (for the original)**: Sister has been involuntarily no contact with me since my parent's divorce. She lives with my narcissistic mother who would do anything to make sure I never see her again. I've found a way to contact her and I want to do it, but I don't want to step in her life and fuck it up for her. What's the best way to proceed?\n\n---\n\n**Update:** Well, I'm 23 now. Finished university, starting a real job, Dad and I no longer have depression, life is pretty good. As for my sister, a few interesting things happened to say the least. Firstly - I took the overall consensus from the original post and didn't make any attempt to contact her. I did drunkenly check her the page from time to time to see if anything had changed, and I found that I'd be unblocked on my main facebook account. Probably around August that same year, my sister rang my aunt and said she wanted to arrange a meeting with her and her son (our cousin, obviously). My aunt immediately rang my Dad and I and told us the good news, we were both uncertain about how we should take it but overall we were pretty happy. \n\nThey all meet up and apparently my sister has also been kicked out of our mother's house for some reason or another and is staying with a friend, and she hasn't spoken to my mother for over a year (at this point in November). The story goes that my mother and her new victim managed to ostracise themselves from all their friends down there and my mother took out her aggression on my sister, so she stormed out and turned up teary-eyed at this friends house and has been living with them ever since. She asked about me and my father, if we were doing well, and if we 'hate her'. Obviously my aunt assured her that we definitely don't. My sister says that she wants to get in contact with the both of us but she wants to take it slow and she didn't know how we would react. In my view that's completely understandable\\*.  That's interesting point #1.\n\n\n\n^\\*Just ^(as a side note, my mother once smacked my sister in the face for wasting a tampon when she was 12. I obviously am not completely familiar with that uniquely female experience but I did get the joy of hearing that moment unfold - just for an idea of the type of person my mother is and what she did to us both as kids.)\n\n\n**Interesting point #2** happens when my sister goes, with her new boyfriend, up to visit our Nan\\*. Another cousin of ours (big family) is also present for this meeting. My cousin tells me that my sister told our Nan that it had been 'a few months' since she had last spoken to our mother, which is quite a bit different to 'over a year ago'. Whatever, maybe my Aunt misremembered the meeting. However, my cousin did say that she got a very 'off' vibe from my sister, and to paraphrase her own words heavily, 'you would think [Sister] had last seen us all last weekend - not 5 years ago. She walked in to [Nan's] house like she owned the fucking place. She didn't really say why she was getting in contact with us and not [you or her father] other than she \"wasn't ready\", and she didn't really say why she hadn't spoken to her mother either. I don't know, I wasn't happy with it at all, and we were all thinking that you two [my father and I] should be in that room, not us. But maybe [your mother] has made me too paranoid.'\n\n^\\*My ^(Nan is my maternal grandparent. I phone her as often as I can which isn't as often as I would like it to be admittedly and I know I'll kick myself for it. I digress - every time I do phone her, she always asks about my Dad and his new partner, and sends them both Birthday cards, Christmas cards, so on. To me it just speaks volumes about the type of person my Mother is when her mother is more concerned about the wellbeing of her ex-husband and his new partner. Just tryna get this point home to any doubters.)\n\n**#3** occurs when I find out that my sister asked my Nan for some money to help her out with University and not living with her Mother anymore. My Nan, being the lovely little 86 year old Welsh sweetheart that she is, gave her around £2,000. Now, I'm happy to be proven wrong here, but asking for £2,000 within a few hours of reconnecting with family that you haven't seen or made contact with for *five years* is very strange. I find out about this, because around November my Nan called me - because she had promised me an update on the situation - to tell me that for about a week after my Sister met up with them all, they had been in regular contact via phone and Facebook. Since that week - nothing. Unreturned voicemails, Facebook messages left on read, my sister had taken the money and fucked off. I spent the day reassuring my Nan that she hadn't done anything wrong, and she definitely wasn't the idiot she thought she was for giving my sister the money. \n\n**#4** is the least interesting, but you'll be pleased to know that my ramblings end here at least. It should go without saying that since the first meeting in August with my aunt and her son, neither my Dad nor I have had any direct contact with my sister. On Boxing day, my sister *finally* calls my Nan and wishes her a merry Christmas. My Nan says thanks and hangs up. In January, on my Nan's 87th birthday, my sister calls up and wishes her a happy birthday, and also mentions that she's having some money problems. My Nan rolls her eyes and hands the phone to my Aunt who buys my Sister's sob story hook, line, and sinker, and rings me to tell me the, quote unquote, \"good news\" and that \"it's different this time, she really wants to see you\". \n\nAround May (which is my Birthday month btw), my sisters sends a text to my Aunt to see if she has any old pictures of her. My aunt says she doesn't, but that me and my Dad might (which we do). My sister sends a text back saying that she will get in touch with us. \n\nI know this is gonna come as a complete shock, but it's been radio silence since and in all honesty I'm fine with that. To me, it's crystal clear who my sister has grown up to be like. Toying with family members emotions, treating her own presence as a gift and using it to manipulate money out of people, inconsistent stories about her relationship with the one person she knows would be a deal-breaker if the rest of the family knew was still involved, and terrible at hiding her true intentions. Will she ask me for the photos? Probably not. Unless she gets really desperate and exhausts all other avenues for exploiting money out of people with pity stories, but even she knows that I know exactly who that money is going to. My mother knows that she's not in my Nan's will at this point. \n\nIf she does want to meet up, I will bring the photos with me. Part of me wants to bring two envelopes - half of the photos in one envelope, the other half shredded up in another, and depending on how well the meeting goes depends on which envelope she gets. I won't do that but it the thought of being that petty is very tempting. \n\nI'm not holding my breath. She was 14 and I was 17 the last time I saw her; she's turning 21 this year and I was 23 in May. I've had my years of anger and grief and done my time with depression, I've hurt many people and many relationships along the way. I'm still learning what's normal and what isn't, but on the whole my life is split up into *before* and *after*, and for the most part my sister lives and will remain in the *before*. Somewhat because I want to maintain the memory I have of her and not taint it by knowing what she has become, somewhat because I'm not ready to go through what I overcame again. I've accepted my role in the universe as the recipient of bad karma to make up for all the good karma that randomly happens to other people. I'm okay with that; for the first time in my life, I've been the one in control. As for my attitude to her and my mother, the best word I could adequately use to describe it is \"ambivalent\". They could win the lottery and be on the news tomorrow or they could get hit by a bus - my reaction would probably be the same. \n\n To everyone else out there with estranged parents or other family members - the one thing I learned is that estrangement is the best thing they'll ever do for you.\n\n\n\n**tl;dr**: I didn't contact her, and it turned out to be a good thing, but not for the reasons I thought.\n\n---\n\nEdit: Thank you all for your comments, I did my best to reply to everybody but given the response to the original post I had no idea this would get so much attention. \n\n* To the people that shared their similar stories, I hope you're all keeping well and staying positive and making the most out of what you've been dealt in life. Hard times make strong people. \n\n* In reference to my idea of ripping up the photos, that was always only ever half-serious. I wouldn't do something like that; it's petty, wouldn't be fair to my sister, and would only give me short term satisfaction in the form of a pathetic 1-up. I realised that before writing this post \n\n* In reference to the 'bad karma' line, I actually think I'm a very lucky man all things considered. I'm where I want to be in life, I have a fun and happy and stable family around me, and I'm confident in the person I've become. That line is a glimpse into my personality - some people got that, some people were genuinely concerned for me which I do sincerely appreciate. The black dog never really stops chasing you, but I get a much warmer feeling from being able to laugh at a universe that is seemingly constantly shitting on you than I do from pretending that everything is okay; that's what I meant by that line. \n\nThanks again to everyone for taking the time to read, it felt good to get this off my chest and know that a lot of people think I'm making the right moves. A good amount of people made the fair comment that my sister is still young and still possibly under my Mother's influence. I appreciate those people taking the time to give feedback and advice, but ultimately my life had already moved on. I made peace with the fact that I may never see my sister again long before the events I've detailed out here, and when this all kicked off the closure and acceptance I had moved on from began to unravel. I'm not ready to go back into dark days off of a risk that everything might be okay. Yes, in the future we may reconnect, but for now I am focused on my own life and am content with taking some of the rare happy memories I had of my family in my childhood with me, untouched by these developments.",
        "permalink": "/r/relationships/comments/hbckl2/update_to_i_21m_have_been_looking_for_my_sister/",
        "comments": [
            "It would be a good idea if your whole family committed to not giving her any more money.",
            "[deleted]",
            "Thanks for writing this - I personally don't have estranged family but my husband is NC with most of his family and sometimes I wonder about getting in touch. Definitely think that being estranged is better in our case as well. Glad you have found some peace in your \"after\" and hope you continue to heal and grow!",
            "I didn't read your original post at the time, but I'm going to comment anyway. I think you absolutely need to do whatever you need to for your mental health, and if that includes waiting for your sister to contact you and not making the first move then fair enough. But you're both still SO young. Its easy to say that she's as bad as your awful mother, but she's only been out from under her thumb for a short while, after a life time of being treated like crap by the woman that's supposed to love her unconditionally. It's going to take more than a few months for her to recover from a toxic mother-daughter relationship like that, and to realise that she shouldn't be treating people the way your mother has. \nI think you could both do with talking to a professional, to be honest. This isn't something that's fixed by time. I hope you keep an open heart and an open door, so she has someone to go to when (if) she has the realisation that she can be a better person than your mum is. \nI also hope you know that I'm not criticising either of you, and I think you're a very strong person for overcoming everything you have so far.",
            "It might get buried in the comments, but I just wanted to say that you should write this post in the form of a short story.  Not just because it's interesting, which it is, but writing about family has helped me in healing.  Write it from a third person perspective or first, your choice.  Start it with teh day you decided to get in touch with your sister and proceed with the back story.  Don't hope that it'll be published.  That's a one in a million chance.  But just write it for yourself.  All the best.\n\nP.S.  You made the right choice in keeping your distance with your sister.",
            "Did I read that you got joy from hearing your sister getting slapped?\n\nMaybe there's a typo there. \n\n\nOkay look, I have a probable half sister with mental health issues who has been in an abusive relationship and I grew up in a stable home. My dad didn't even know she could possibly be kin until her father passed, and my dad passed shortly after.\nBefore my dad passed he got her a cheap phone cause her husband wouldn't give her one stuff like that.\n\nThe point here is I had this idea \"wow I have a new sister this is awesome\"! \" \n\nWhen we met, I didn't like her at all. She was weird abrasive and just awkward. \nShe didn't ask for anything of me she was just weird.\n\nI had to realize she didn't grow up like me, now that doesn't mean we have to be besties and I think having her in my life would be bad for both of our mental health but im a lot more sympathetic to her because she's the byproduct of her upbringing. I will help her leave her absuve husband whenever she asks but I don't like her really at all. \n\nI think you need to think of her in a similar way, maybe your sister is an asshole, but she's also been with your apparently shitty mom for alot longer and without any of the support you seem to have like your cousins and Nan etc she didn't have anyone to turn to im gonna guess but your shitty abusive mom. \n\nHave you ever heard of \"fleas\" it's a therapy term, for when the victim spends long enough with their abuser they pick up fleas aka they mimic and copy behavior even if they themselves hate that behavior. It's extremely common in parent child abusive relationships. And it can't be unlearned in a weekend trip. \n\n\nHere's my earnest advice. Ask her if she needs help, offer to go to family counseling with her maybe you can find a low cost one in your area. I understand if you don't want to do this but I think your sister isn't a demon she's an abused little kid on the inside still. \n\nDon't give her any money or any more monetary value things. Donate things to her maybe like clothes or old stuff she might be able to use but that it's. Ban nan from helping. \n\nBut tell her that you are here for her when she gets therapy and can move on from the abuse cycle her mom threw her in against her will as a child. \n\n\nTLDR your sister like mine is a victim of emotional and physical abuse nd I think she can still be rehabilited. You don't have any responsibility to help, but consider the resources she might not have had and how she might have learned unhealthy habits to survive. You don't have to help her but I think guiding her to a place that will is more love than she's seen since she was born \n\nYou'll be surprised how a little empathy can reach a person.",
            "[removed]",
            "I don't blame you for staying no contact with your sister for now. That being said, she had more time under your mom's rule and was ripped away from the better family members for longer. Two people growing up in the same environment don't always come out the same. My siblings and I grew up in the same toxicity and went different ways. I \"got out\" while they didn't. I'm always hopeful they'll turn around.\n\nWhile I'm always hopeful, I stand from a distance. If I were in your situation, I would let her make the first move. I would not give her money. I would give her pictures, though, because they're pictures of her and don't cost you anything. (I'd scan a few for my own memories book before handing them off.) I'd listen if she ever opened up. If conversation ever got deep enough, I would tell her that your mother's toxic behaviors absolutely left a mark and she has to take care not the repeat the same patterns. She needs therapy, absolutely. Again, I wouldn't give her money, but I'd point her out to resources she could use.\n\nI fully acknowledge that you aren't me, though, and you might not want to try these things. It's fine; I'm just sharing my experience and how I'd navigate in your shoes.\n\nETA: I read in comments and found out more about the money thing. Obviously, she's getting help from somewhere. Is it mom or her boyfriend? Or someone else? Why isn't she comfortable contacting you - fear of rejection or fear she'd be found out? I absolutely wouldn't trust her, but I would keep in mind that there are other explanations. If she ever got in touch, I'd verify everything, of course. Even if Mom isn't pulling strings in the background (and she probably is), your sister is still acting shady.",
            "Oh OP, I'm so sorry. On a personal level I'm angry at your sister for throwing away a relationship I would kill to have (my sister was disabled and passed away so, not a traditional sisterhood) and I'm upset on your behalf that you have mantained a level head throughout all of this and tried to give her the benefit of the doubt, only for her to spit in your face.\n\nYou're both still very young, so maybe someday she will change, or maybe she won't. But you know better than to wait for her. It sounds like the family you're connected with is super kind and supportive, and I hope you all come up with an action plan for when she asks for money again. I would make sure that the truth is not actually that she is still in contact with your incubator (sorry, that woman does NOT deserve to be called your mom) and might be funneling some of the money to her. If so, I would head to r/legal for some advice.\n\nAgain, despite the overall benefit of being distanced from people like them, it doesn't make it hurt less, so I'm sorry. I hope for you that if your sister doesn't change that you lead a life so rich and full that she doesn't even cross your mind.",
            ">If she does want to meet up, I will bring the photos with me. Part of me wants to bring two envelopes - half of the photos in one envelope, the other half shredded up in another, and depending on how well the meeting goes depends on which envelope she gets. I won't do that but it the thought of being that petty is very tempting. \n\nDon't do anything like this. I know that 21 and 23 sounds very grown up, but you will both be very different people when you are 81 and 83. Even if she is making a lot of mistakes right now, don't respond in a way to widen the gulf to a point that your interactions will leave you both bitter toward each other for decades to come.",
            "Sorry you had to go through this. I think your mother poisoned your sister’s mind. Until your sister breaks free the hold your mother has on her, she will not be her own person. When your mother said she wished for you to have tried harder at suicide; it tells me that your sister was her favourite child and you were her whipping post. People have described your mum as narcissist, I’ll go further and say she may be sociopath.\n\nIts best if you and your family go no-contact with your sister and mother. Leave the door open for reconciliation but always keep her at arms distance. Don’t give money or anything else that you wouldn’t do for a stranger. You would have to see a great improvement in your sister over many years before you can start treating her as family. She needs to earn your trust and love again. Take your focus away from your sister, instead focus on the family you already have; your dad, grandparents, aunts and extended family. Remember they were there for you when you needed them. They are your true family. I’m glad you and your father have made it through the darkness on to the other side. Appreciate the people you have in your life while they are still in your life. Good luck in your future endeavours.",
            "My life is also broken up in to a *before* and *after*. I was much younger than you when my *after* started. Until I was 10 I felt like everything was pretty perfect. My parents were great, I never really wanted for anything, my grades were good, I had a ton of friends, I played a bunch of sports.... then my parents divorced and it was like a veil fell down. \n\nTurns out my dad is an alcoholic. He had been abusing my mom for years. Once my mom was available for him to abuse, he turn on my sister and I. But we couldn’t understand it. The shift was so rapid and so opposite... we didn’t want my mom to take us away, so she decided not to. It was a complicated situation. They had joint physical and legal custody. Sometimes things with my dad were great, other times he was telling me no one could ever love me so I should just kill myself. \n\nI’m 30 now. I still struggle with the image of my dad. I remember him being this amazing dad that taught me how to play every sport he could. Because of him I can hit just about anything you pitch out of the park, I almost never miss a free throw, and can kick most peoples ass at around the world and horse. He spent hours helping me to kick a soccer ball 75 yards. He didn’t get weird about my sister and I starting our periods and would answer questions and buy us tampons.  But he also threw a tumbler of whiskey across the kitchen and it shattered against the oven as he told me he wouldn’t have to drink if I wasn’t such a bitch (I was 11), then made me clean it up. \n\nI’m very limited contact now, but that’s what’s better for me. You need to do what’s best for your mental health, but I don’t blame you for wanting to keep the *before* image of your sister. It’s really hard to reconcile the two, almost painfully so. Do what you need to do to protect yourself!",
            "I feel terrible for your sister. Narcissists have the pattern of picking the Golden Child and the Black Sheep pf their kids. The Black Sheep (you in this case) usually avoids the worst of the emotional abuse and manipulation. The Golden Child (your sister in this case) is praised and used and brainwashed and usually ends up so damaged. Maybe she’ll smarten up as she gets older, or she’ll turn out just like your mother and the cycle will continue. \n\nAnyway, good for you for setting boundaries and staying clear of the sickness. It sounds like you and your father make a great little family.",
            "[deleted]",
            "I think you're doing the best you could do.\n\nI liken your attention to the matter to when you drive past road kill.  You don't want to see it, you really are not involved, but curiosity gets the best out of you and you look.\n\nNow it's time for you to keep driving off away from the road kill and forget about it.",
            "Point 1 she's not sure about contact with people she's not seen since she was 14, has probably been told a lot of nasty lies about, and they haven't contacted her either. Point 2, another family member didn't feel her behaviour at your grandmothers was, what, contrite, heartfelt enough? Just off in some way, but you didn't see it. Point 3, after being kicked out by her mother, she asked for money from her mum's mother. Point 4, she talked to the same grandmother and mentioned money problems again.\n\nI don't see any of those as particularly damning. Your thing about possibly giving her shredded-up photos is weird. It feels like you're projecting anger at your mother onto your sister, and making a bunch of assumptions.\n\nYour sister might have developed into a messed-up person, sure. She likely has been through a lot and been exposed to some bad attitudes. And you've certainly been through a lot as well. But she's the one making tentative steps to be in contact and you're hiding away. In her eyes, you're the older brother who never contacted her.",
            "Couple things. First off: I'm glad that you have cut these people out of your life. For family like this it's a healthy thing to do; I have two brothers I'll never speak to again and that brings me peace. \n\nThis quote: \"I've accepted my role in the universe as the recipient of bad karma to make up for all the good karma that randomly happens to other people.\"\n\nRefuse that. If you're not in therapy, please go in as soon as you are able. You are more than worthy to receive good karma for all the shit you've been put through. I struggle with a similar outlook and therapy does help. Just have to find the right therapist.\n\nPlease be kind to yourself. I hope to hear another update of you doing even better.",
            "This is my opinion. \n\nYou’re sister is 20 and is still young. I mean yes, she’s done some shitty things but I don’t think that defines her. Maybe she needs real guidance and a healthy relationship with her father (and you!!) to show her what being a good person is. Do what you’re gut tells you to do, but maybe it wouldn’t hurt if you reached out to her to meet up with the 3 of you guys (her, your dad, and you)?\n\nI don’t think it’s too late and I don’t think you should give up on her. Your mom is really toxic but she’s all yours sister has known for the past 6 years, so yeah she’s shaped her but I don’t think it’s too late. Also I’m glad your mom is not in your life anymore TBH, life’s better without the toxicity - family or not. I’m glad you and you’re dad have been doing great!  I think your sister needs you guys in her life. \n\n\nIt doesn’t hurt to try,\n\nIf it doesn’t work then tough luck for her.",
            "Really sorry she turned into someone like this. Your attitude is compassionate and wise. Good luck to you and your dad.",
            "Hey there, I’m so sorry you’re in this shitty situation. It’s extremely tough to not have family members in your life, even if they’re toxic. \nMy mother is very similar to your sister and has been manipulating my entire family for money. I started out as being extremely supportive of her when her life “fell apart” (she decided to cheat on her fiancé) but her awful treatment of my entire family and myself was too much. I don’t speak to her now and I’m much better off. You’re making the right decision to move on with your life. You’ve made it through a lot and I’m proud of you.",
            "> the other half shredded up in another,\n\nIF you do this, scan the pictures and use print outs or something so the rest of the family isn't deprived of memories.",
            "My mother died in another state while we were estranged and you wouldn't believe the crap my family said to me at her funeral. All about how she really loved us.. she was so proud of us.. but she never reached out to that effect and in her last contact with me she was so, so unbelievably mean. I completely agree with your 'let them be estranged' comment 100%",
            "I'm so sorry for everything you've been through.\n\nAs some advice: tell your nan to leave your mom like $1 So she can't contest the will",
            "Not relevant but I just wanted to say I really like your writing style and the personality that comes through.",
            "What I did with my sister was decide to just treat her like any other stranger. Haven't looked back.\n\nOnce you've confirmed what kind of person she is, decide whether you want that in your life and if not then just try to move on.",
            "Truly truly sad. In most cases, we are born a clean slate, a pristine hard drive, that our environment and family fill in. Too bad your sister got isolated and exposed to your mom. I do hope one day she can see herself in the eyes of the rest of her family. Good on you OP for moving on. Godspeed.",
            "Yikes I hope you guys find a way to move on from this because this whole situation is toxic. As for your sister I think it's time to see her in her true colors and try and sit your Nan down to stop enabling her narcissistic behavior.",
            "This is neither here nor there, but I love the way you formatted this post and the various side notes. Readability 11/10",
            "This whole situation is awful. I’m glad your family was able to see through your sister’s attempts to manipulate, while still giving her a chance. It shows that you are surrounded by compassionate people, but who ultimately will look to protect you and your dad. Let that be a silver lining. \n\nI also just wanted to say that despite your ongoing bad karma, I have faith that things will turn around for you. You have already taken huge strides to change your life for the better, and as you continue healing, growing, and moving forward, I think you will start seeing the fruits of your intense emotional labour. Just keep going. Your good karma is well overdue.\n\nYou sound like a wonderful person, and you deserve to be happy. Good luck OP.",
            "I'm sorry that your sister has turned out this way. The best thing you can do is to meet her, but not give her any money, and perhaps keep the lines of communication open while maintaining your own boundaries. Unfortunately, your mother shaped her to a large degree. She may be able to shake off your mother's programming, but you never know.",
            "Text book narcissism. Estrangement is truly the gift that keeps on giving in these situations",
            "A funny thing about people who live with narcissists, they generally pick up traits and habits of them. This especially applies to children of narcissists, as they are practically raised by them.",
            "Someone who doesn't care about you is a better person than someone who prefers to use, lie, and hurt you.\n\nI've got...or well had a similar sister. Honestly I've been much happier as a person without her in my life.",
            "Hope you’re having a good poo",
            "From one welshie to another, I'm sorry your nan got scammed. You should advise your aunt to not pay her any money either. She's made her intentions clear, stay away from her from now on.",
            "I’m very sorry you and your dad have had to go through this. My siblings were 12 and 19 when I was born (Second marriage for both of my parents) and their mom manipulated them a lot. Dad would call exactly the same time every week, but eventually their mom would say ‘you don’t wanna talk to your dad, do you?’, in a way that no child can say that they in fact do want to talk to their dad. Eventually my sister said a lot of really shitty things to our dad, and we lost all contact with my brother and sister when I was 6. \n\n7 years ago (I’m now 27) my SIL contacted us because she wanted us to be in their sons lives. Then, 5 years ago, my sister got in touch as well. My brother (the oldest) didn’t want to talk to us at first, but we’re now at the point where we can have pleasant conversations at family get togethers, and I’m a proud aunt to their combined 7 kids. \n\nI know it’s not exactly the same as your story, but my sister did also try to get money from dad for a while. Just please know that it’s not your sister’s fault. What she did is completely awful, and I hope you don’t have to worry about this any more, but I do hope you understand that she has been emotionally manipulated for a very long time. \n\nMaybe, long from now, things may change. And it might not. But I hope you and your dad, as well as your extended family, are doing well and remain closer than ever.",
            "I know it might be easy to be frustrated with her for seeming to tolerate your mother, and it's not your job to diagnose her or help someone who ultimately needs to help themself, but cluster B personality disorders (which include narcissistic personality disorder) definitely can be shared genetically. On top of an underlying disorder, her seeing your mom 'succeed' through life via this selfish manipulation is an unfortunately impactful influence. She needs to figure out how not to be selfish in her social and familial interactions, and i hope your Nan and aunt not conceding to her will begin showing her that doesnt work. Keep the photos, they may mean something to her down the line. But for now there's no sense in waiting for someone who's closed the door, if you can figure out how to move on",
            "Your story reminds me of my own. \nNarcissistic mother who lacks all empathy and steals money from children and family members. I was the only person of her four children that got out (at 24 yrs old at that). She had all of my four siblings and my sperm donor in her web of lies. \n\nEven though I am the youngest I am the only child to have realized and escaped the toxicity. All of my siblings are going down the same path of my parents and I have been no contact with my family for almost two years now. My family harassed me to the point of needing to block all forms of communication and change phone numbers. Not to mention I give fake google phone numbers to my extended family members that might share with the evil side. \n\nSadly once a narcissist gets their hook into someone it is really hard to get that person away. You did the right thing by prioritizing yourself. Your sister sadly seems like a lost cause, quite like my siblings. Getting out of the narcissists grip takes so much work that it is easier to stay in it at times. \n\nThe saddest part is she has a support system outside of your mother, but your mom likely painted everyone as enemies (which is what my mom did about the extended family members I still am in contact with).  It took a lot to train my brain that everyone is not evil and try to restart relationships with out my mother’s bias. \n\nUgh estrangement both sucks and is the best thing ever. Kudos to you for getting out! I remember reading your original post, I am so glad to see this update and hear that you haven’t reached out to her.",
            "I think you're handling this all pretty well. One suggestion I have is to not think too unkindly of her. You got away, she didn't. I'm not saying that you should reach out to her or loan her money or help her in any way. I'm just saying \"there but for the grace of god go I\" might be the way to look at this.",
            "I Hope your dad is doing well!",
            "It’s a sad thing, but it’s a trend I’ve noticed: kids of narcs go one of two ways - they either let it all ruin them and they too become a narc, or they get the psychological help they need from somewhere to realize they never want to be like the fucked up parents and will avoid it at all costs. \n\nUnfortunately, it appears that your sister has done the former.  I think your two envelope idea is great.  If she too is a narc, fuck her, she’s not worth having in your life.  If you sense some hope in her, give her a chance, but never let her play you.  Always better to give them the finger than to take their shit.",
            "I think the family making a pact to not enable her behaviour would be a good thing HOWEVER I also think your family needs to push her to get help. I know it's easier to feel hurt and used right now, but you have a family member raised by a narcissistic piece of shit. She did not ask for that path in life, and abusers have massively detrimental lifelong impacts on their victims. She needs therapy and compassion, which is something that can be given without handing over money to her. If you've not checked /r/raisedbynarcissists then it might be a good place to look, to really get into your sister's headspace. I know you also were raised by the same mother, but outcomes can be different for the each child in an abusive upbringing.\n\nShe needs people on her side, she needs to know she has a chance at growing into a person beyond the experience your mother forced upon her.",
            "Oh my goodness your Nan :( I'm so sorry mate. It seems this gave you some clarity at least? And I hope the rest of your whanau goes NC with mini-mum sooner rather than later",
            "Divorce laws are bullshit. How is she going to be able to cheat and get half of the husbands stuff.",
            "I just want to say that for all this to happen at a young age for the both of you, and the fact that you both are still very young, you are handling things very well for the traumas you’ve been through. \n\nYou obviously value the family you still have. All you can do is feel bad for you sister but know that you cannot lose yourself to that fight. She is obviously a product of a poor upbringing. From that, the way she ended up was put in the cards for her. Try not to hold resentment over pity. I am glad you came out on the better side of that divorce.",
            ">When she found out I tried to kill myself, she mentioned in a letter to another family member that I should have tried harder. I never want anything to do with her again.\n\nDamn dog.  That's mad.\n\nAlso sorry it ended this way.",
            "So I won't say much but I know someone very close to me who I think was an only child and had been through some really crappy childhood with his parents being alcoholics and I am sure even if he didn't say it, that he was abused as they were only happy at school / with friends. \n\nI still can't believe how lucky of a family I have and hearing this does make me really sad and upset for these kinds of people because, knowing me now, I'd probably be very violent on their behalf even though I'm usually very chilled normally because I think it's just unfair to go through something like that. \n\nI'm glad you are all feeling better now from whatever happens when you were kids and that even though it was probably difficult, you all know now that your mother is not your mother. Or she should not be respected as a mother. Just another awful human who cannot see how wrong she is. Hopefully at some point, she gets some help. Either by doctors, or by herself realising her mistakes. But I would definitely never talk to her again or anyone (friends or family) of hers unless she abuses them so you can steer them away from her. \n\nFrom the sounds of it she has just driven herself full throttle into a mineshaft that is only going to keep going downhill from here. \n\nGood luck OP with meeting your sister, and I wish you all the best.",
            "I’m sorry you lost out on your relationship with your sister. I can relate. I saw a quote on reddit once that said “divorce is like a murder where everyone is still alive after.” \n\nTyping it out makes it sound a little lame but it still resonates with me so deeply. \n\nI hope all of this provided you with some needed closure. I just recently got my own after 14 years and it feels like a weight has been lifted.",
            "Don’t give her any money. If you decide to meet, make it in some public place where you can walk away. Do NOT make it at your or anyone’s house. Make copies of the pictures. Don’t give her the originals unless you don’t care about seeing them again. And finally, be prepared to get up and walk away, with your head held high. You have done nothing wrong and you are a very generous person. I can tell who grew up to be the better person.",
            "Honestly; thank you. I needed that. I have a half sister who is about 18 years older than me. However, I havent been in contact with her since i was 16 (am now 28). She is narcissistic, manipulative, just overall horrible human being. Nonetheless, I find myself wondering how she is doing and if I should try to contact her. I never do",
            "I am so sorry, all you can do at this point is protect yourself, expect the worse and hope for the best. I am happy your depression is under control. I hope you are talking to someone. Take care of yourself...",
            "Is your sister on drugs? Just an idea. But, no contact is the right move IMO.",
            "I’d be really angry and sad if that was my sister’s behaviour too, however it’s worthwhile considering that your mother has most likely psychologically manipulated and warped her ever since she lost contact with you. There’s the possibility she only subconsciously knows her actions are inappropriate rather than actively. She’s possibly in survival mode. \nMaybe don’t write her off just yet, protect yourself and prepare for drama if you do reach out but she may shake off the brainwashing and come out of the FOG one day.",
            "Your sister is fucked up from living with a crazy abusive mother her whole life. I completely understand why she's doing what she's doing, but it's not OK. She needs therapy and support but also know she'll continue to have her episodes and fuck you over.\n\nMy ex SIL was the same way. She stole 2000 dollars from her own sister, who had a 1 year old baby and her ex husband just left her. She was 21 at the time, the theif about 19.\n\nShe actually eventually paid it back, unprompted, 11 years later. Then stole from us again. This is just the tip of the iceberg for ex SIL. Four different marriages, would gave been 5  but the new guy had it annulled  when he found out  that SIL never actually divorced her last husband. \n\nThrew away a decent career in nursing by stealing opioids. And there's the possibility that she's her own nice, and also her own aunt. Yes, she's from the deep south. \n\nBut it was her narcissistic mother. She fucked up everyone in that whole family.  My ex us the most normal one and still needs therapy and still sufferers from psychological problems. \n\nIt's understandable why your sister is acting like she is, and I doubt your sister even realizes why she's taking advantage of everyone she can (she never learned to trust anyone). But it sounds like she needs professional help.\n\nAnd for the love of God, get her to cut off all contact with your crazy ass mom completely. No phone calls, no nothing.",
            ">I've accepted my role in the universe as the recipient of bad karma to make up for all the good karma that randomly happens to other people.\n\nThis comes off as very narcissistic.",
            "I am sorry for what you have gone through. I can relate unfortunately",
            "I just read through your first post as well as this update. I’m so sorry to hear all your struggles with your sister. I’ve been in a very similar situation to yours for years now. My brother moved out when I was 14 and he was 17 to live with my dad after my parents divorced when I was 6 and he was 9. My mother is the exact replica of yours; manipulative, abusive etc so I can empathise with you. Unfortunately, I still live with her as my options are limited but my brother is far away from it all. My mother also manipulated me into cutting off all contact from my brother and my dad when I was 15 (this also included my stepmum and other brothers that aren’t hers - step/half). It took a while but I eventually saw through it and decided to reach out and regain control over those relationships. \n\nWhat I’m trying to say is, if your sister wanted a relationship then she would’ve reached out by now. I can only imagine how horrible it’s been as I know how hard my dad and brother found it when I stopped contact with them, but just find peace and relief in the fact that you are now away from all of that and your safe. Your nan is an absolute saint for keeping up such a healthy relationship with you (my mums side of the family is completely alien to me). Stay safe. Thank god you’re away from all of that.\n\nEDIT: you’re also an amazing brother, please don’t beat yourself up for any of this. It’s never your fault. Some people aren’t meant to be parents (ie your mother), you’re so lucky to have such a great dad though, god knows how you’ve both coped.",
            "I just wanted to come and wish you luck in your journey. Estrangement is my family's deal with pretty much anything and it's hard over the years. \n\nI got married and donated a kidney.....still estranged and that hurts .... All of life's events \"should\" be spent with family....so when they aren't, that estrangement gets difficult.....it comes in waves though. I pray you do a better job surviving the waves than I've done over the years. (I'm 38f and have been estranged from most of my family since I was 18....some family will reconnect every now and again, but it's rare.)",
            "I'm so glad you've been able to move forward with your life, and that you have people who love and support you.",
            "Bro she is still so young. She can still change, reach out to her, be her older brother. What the fuck",
            "[deleted]",
            "If you ask me, beyond this point, they (your mom and sister) aren't worth the time and effort you spend on thinking about them. Forget that they exist and move on with your life. You can put your effort into people who actually care about you and you'll be rewarded very very well for that. Good luck and all the best.",
            "It’s basically impossible for myself or anyone to understand the emotions you have experienced with this but I just wanted to say I’m very impressed by your ability to see the whole situation so clearly and to be so aware of how you must prioritize your mental health above everything no matter how painful that may be. That is like elderly person wisdom right there my dude. As someone who’s experienced a very different but also real life crisis, the best thing that comes out of it is the life lessons you learn - but what you come to see is that many people who have similar experiences don’t learn these lessons. You haven’t fallen into that trap and you should be proud of that. \n\nHang in there man, congrats on graduating uni and best of luck in your job. You have no idea how much of an advantage all of this perspective you have has given you in your career and life 👊",
            "[deleted]",
            "Damn. She grew up to become her mother, fam. Sorry that happened. She definitely needs therapy and it's up to her to get it. In a few years when she has her life sorted out, I do hope she returns and apologizes. And if not? Life goes on. Good luck out there",
            "Hey OP, so sorry to hear you're having to go through this. You might already be aware, but /r/raisedbynarcisists is a very supportive place for people who have gone through similar stuff.  It breaks my heart to hear that you feel like you are the bad-karma-sink, but I'm happy you and your dad are in a better place mentally. \n\n Stay strong brother, you truly sound like a great guy.\n\nPS: say hi to Nana from us! She sounds wonderful\n\nPPS: sod your mom, she sounds like a real fucking peach",
            "You're more than just a recipient for bad karma. Good things are coming your way. Keep being a good person and keep living your best life dude.",
            ">I've accepted my role in the universe as the recipient of bad karma to make up for all the good karma that randomly happens to other people.\n\nThis is one of the saddest things I've ever read. I feel for you, and I'm rooting for you!",
            "„Sup gurl?” You welcome",
            ">I've accepted my role in the universe as the recipient of bad karma to make up for all the good karma that randomly happens to other people. I'm okay with that; for the first time in my life, I've been the one in control.\n\nHonestly, this part broke my heart the most. I was in this particular pair of shoes in my early 20s, and it wasn't until 25ish that karma started paying me back positively. It'll happen for you too, and you're come a long way and learned too many life lessons. \n\nNow...your sh*t sister and mom. I'm so glad you and your dad are out of your mother's and sister's life; keep your distance. My mom says this about sh*tty family members, \"You can love them from a far, but you don't have to like them\".",
            "Damn, I'm so sorry you had to go through that. Props to you for having the strength to get through it!",
            "I'm so sorry your cruel mother has inflicted this all on you and your family :(. You should be proud of coming out of your depression and learning so much. I've hurt many people along the way too due to emotional problems and I didn't start learning how to manage until later in life than you. It's okay to still be learning what's normal at 23, and believe me you have a head start over many people.\n\nYour sister is still pretty young. Your mother has definitely warped her mind. It may take her a long time, but she's going to realize she's in for a lonely, unfulfilling life just using people left and right. She may change for the better and want to reconnect someday. But always do what is best for your mental health. It sounds like you've worked hard to overcome your depression and really grow and learn - don't let anything or anyone screw that up for you.",
            "I like you and your style of writing. I'm estrange from my brother my (choice) after he told me he could careless about me. Now I feel the same way stay away from toxicity even if it's family."
        ]
    },
    {
        "post_id": "ed44xf",
        "author": "throwingthisaway023",
        "title": "UPDATE: My (33 F) roommate’s (29 F) dog is literally killing me",
        "url": "https://www.reddit.com/r/relationships/comments/ed44xf/update_my_33_f_roommates_29_f_dog_is_literally/",
        "score": 6326,
        "num_comments": 83,
        "created_utc": 1576811335.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/e3b49g/my_33_f_roommates_29_f_dog_is_literally_killing_me\n\nThank you everyone so much for your advice. It gave me the confidence boost I needed to go to the higher ups. \n\nMy roommates behavior had progressively gotten worse after posting. She had stopped bathing the dog to protest being fired and kicked out, (also a fuck you to my allergies), she had stopped sorting recycling and started throwing trash away in the recycling bins, taking other people’s food, and several other things that just make you say WTF?! \n\nI knew after seeing what you guys were saying and seeing that behavior from her, I had to speak up and be so loud that no one could ignore me. I also knew I had to make the hard choice of resigning and moving back home if the company wasn’t going to take my worries seriously. \n\nSince it is company housing, I demanded a hearing with the company heads and the landlord. \n\nI took my visit summaries from doctors appointments and told them how this needed to stop and the move out date needed sooner. If that didn’t happen I would be forced to resign. \n\nThey were appalled and they wished I would have spoken up sooner. A mistake I will never make again. They made up a new contract they made her sign pushing the move out date to Jan 25th. \n\nThey also stripped her of some company items (phone & computer) they were going to let her previously keep. She’s going to be banned from company property as well after that date. In addition to all of this, the company will be reimbursing me for any medical bills I have because of the dog allergies. \n\nI think this is the best outcome I could have gotten realistically. Thanks you guys once again. \n\nTL;DR update: my roommate got crazier, I went to company heads and landlord, they moved up the kick out date, gave strict sanctions, and are covering any medical bills I have because of it.\n\nEdit to add: They are hiring professional cleaners and someone to clean out the HVAC vents after Jan 25th. \n\nAlso if the roommate is still here after that date the company told me they will have locks changed and police escort them out if needed. There’s no wiggle room with this new contract.",
        "permalink": "/r/relationships/comments/ed44xf/update_my_33_f_roommates_29_f_dog_is_literally/",
        "comments": [
            "Kudos to you for speaking up for yourself! You definitely had nothing to lose",
            "I'm glad they responded well. You should see if the company will pay for the cost of a professional clean (carpets too) once she and the dog are gone. With your asthma that bad, you probably shouldn't be trying to clean dog hair etc.",
            "uhh unrelated but your job gives u housing, a computer and a phone? y’all hiring??!",
            "Could you maybe ask the company to pay an Airbnb or something for you while your roommate is still there? If she's as awful as you described then I wouldn't be surprised if she escalates her behaviour even further... If you do stay lock your doors and be very careful with your food, she might try to sneak dog hair in it or something like that. Good on you for standing up for yourself though, OP!",
            "Glad you got it solved! I hope you can breathe easier now! \n\n;)",
            "Good for you! But the apartment is going to be full of the allergenes for months after the dog leaves, so I hope the company pays for a very thorough cleaning there after she leaves, if not letting you move to a different apartment. I'm allergic to cats, not nearly as badly as you are to dogs, and I got a reaction from a friend's previous flatmate's cat that had moved out two months ago (and the flat was cleaned normally, not some filthy bachelor cave).",
            ">A mistake I will never make again. \n\nA learning experience, then! Good for you. It's tough speaking up, sometimes",
            "Could you get a hepa face mask to wear for the month until she leaves? I'm allergic to dogs too and can't live with one without horrible allergies.",
            "What an awful person",
            "I love seeing happy endings like this!!",
            "So this is causing serious problems to your health, and they still expect you to suffer for a full months?   Shouldn't they be trying to find a new place for you to live or at least put you up in a hotel for a month?   Sorry - the company actions are still unacceptable.",
            "Good on you OP to stand up for yourself!",
            "Ask if the company can provide a thorough cleaning of the apartment after she is gone, allergens can stay in a room/home for years afterwards.",
            "Congrats! I think the company you work for is very nice in that they took your concerns seriously and will even reimburse you for your medical bills. I'm very happy for you (:",
            "Good. Next time Don’t let anybody make you a doormat",
            "The only thing that would be better than this would be if they put you up in a hotel till January 25th.",
            "Why in the world can't they re-room you? They want you to live with a woman they fired who is breaking rules, being destructive, stealing, and STILL HAS A DOG THAT IS TRIGGERING YOUR ALLERGIES WHO SHE NOW REFUSES TO BATHE, for **OVER FIVE MORE WEEKS**? That is not good enough, OP. Imagine that dog was black mold or asbestos. In what universe is it sane for your company to say \"just wait five more weeks and we'll fix that right up for you\". Five weeks of your immune system trying to fend off a threat that your doctors have documented. Five weeks for you to potentially develop more chronic conditions. Five weeks FOR YOU TO BE SICK, OP, BECAUSE OF YOUR HOUSING.\n\nProfessional cleaners will not completely remove the allergens. It will take time even after cleaning for every mote of dander to truly and completely break down and stop ATTACKING YOUR IMMUNE SYSTEM. The thing you really need to be fighting real threats like the flu right now.\n\nYou need to ask to be moved. This is insane.",
            "Hope that dog gets rescued.",
            "That was satisfying to read.",
            "I’m glad you spoke up, but in your original post you said she had signed an agreement to leave but had ignored it.\n\nSo she has signed another agreement with a later date to leave, noting that there were no real consequences for breaching the agreement.  If she ignores that too, what will happen?  \n\nSorry, but I’m not seeing a victory here.",
            "Buy a new lock for your bedroom door and move any of your possessions that you care for into your room.",
            "Well done! I'm glad your company saw to it that you have an adequate place to call home, and that they reimbursed you for all your medical costs.\n\nAlways remember: you are worth kicking up a fuss about.",
            "What a good company! They clearly value you too.",
            "Thank God I don't live with roommates anymore. Never again.",
            "The squeaky wheel gets the grease! Noice!",
            "Glad to hear! Congratulations!",
            "I'm glad this worked out for you! Please never refrain from speaking up the worse that can happen is someone saying no, and it's not that bad i promise :)",
            "Lock all of your things in your room. This person has nothing to lose and appears to be vindictive, she might try to retaliate by vandalizing your things just before moving out.",
            "Why are dog people like this?",
            "Aww yiss, justice has been served, good on you!"
        ]
    },
    {
        "post_id": "q1iqus",
        "author": "Complete_Mountain_78",
        "title": "UPDATE My girlfriend (25F) has not texted me (25M) in 2+ days",
        "url": "https://www.reddit.com/r/relationships/comments/q1iqus/update_my_girlfriend_25f_has_not_texted_me_25m_in/",
        "score": 6319,
        "num_comments": 237,
        "created_utc": 1633392008.0,
        "selftext": "Original post: [https://www.reddit.com/r/relationships/comments/q042yp/my\\_girlfriend\\_25f\\_has\\_not\\_texted\\_me\\_25m\\_in\\_over\\_2/](https://www.reddit.com/r/relationships/comments/q042yp/my_girlfriend_25f_has_not_texted_me_25m_in_over_2/)\n\nSo... let's just say the outcome is not good. I would have rather anything else happened but this.\n\nShe was in a bad car crash.\n\nHer sister had my old phone number (I changed phones a couple months ago) so I did not receive any of her calls. And when I texted/called her, they just went to spam. So, she messaged me on LinkedIn.\n\nShe told me that my girlfriend was in a car crash and is in the hospital right now. She was in and out of consciousness for about 3.5ish days. My girlfriend just woke up and became somewhat alert this morning. I called her and she seemed like her normal joking self - she told me to sell our shiba inu coins that we bought as a joke.\n\nHer sister said my girlfriend said she can't feel her legs so the doctors are going to do scans and tests. But other than some scratches/bruises and some sore spots, she has a sprained wrist. I saw the pictures and its a miracle she is not dead. The car is gone. I liked that car, it was a nice car.\n\nI am flying out tomorrow morning to visit her.\n\nI am just in shock. I don't know what to think.\n\nTL;DR - Her sister messaged me and my girlfriend was in a bad car crash.",
        "permalink": "/r/relationships/comments/q1iqus/update_my_girlfriend_25f_has_not_texted_me_25m_in/",
        "comments": [
            "That must have been one of the worst feelings. Hopefully everything works out in the end.",
            "I hope she has a speedy recovery... not being able to feel her legs sounds....worrisome,  but I am sure there are plenty of experts working hard to figure out how to move forward.\n\nMy daughter wasxin a horrifying car accident as a passenger in 2012. She was 16. She was in a coma for a week,  had massive internal injuries,  broken back, brain injuries,  etc..   it was BAD.. within 6 months,  she was 80% better and now, it is all just a distant memory. At the time,  doctors weren't sure she would live..point being....even if things seem scary right now, the human body has an amazing capacity to heal",
            "That's awful!  Best of luck to the two of you, and hopefully she makes a full recovery.\n\n> The car is gone. I liked that car, it was a nice car.\n\nThat car saved her.",
            "Hey, now you know what happened and you're going to be there for her. That's a ton of comfort for you both. Seeing you is going to cheer her up so much. I wish you both well.",
            "Hopefully the tests prove to be fruitful and she recovers soon. Best of luck to you both.",
            "Real talk, I’ve been worried for you two since I saw your original post a few days ago. I’m relieved to hear you’ve finally gotten in touch, but I’m so sorry about the circumstances. Take care of her, and don’t forget to take care of yourself, too. Wishing you both the best.",
            "I'm glad she survived.  Be hopeful about outcomes, a positive outlook makes a difference.",
            "Im sorry that you found out this way but thankfully you finally got the news! \n\nI’m glad that she’s getting treatment and seems to be in good spirits! Wishing you strength and your gf a swift recovery.",
            "That car did its job! \n\nSo glad she is alive and you know what's going on. This just inspired me to update all my contact information with the important people in my life.\n\nGood luck on you guys and your recovery. Buy her a shiba inu stuffed animal for the hospital!",
            "That is terrible!  I'm so sorry.  Jesus.  I can only imagine how you felt BEFORE finding out she was hurt that bad.  I really hope everything goes well and she is able to feel her legs again without any surgeries/therapy.",
            "You are a good boyfriend, and your girlfriend is lucky to have you. I hope, pray, and wish the best for you and your girlfriend ❤️",
            "Buy a chess board and take it with you to the hospital and set it up exactly as your current game before the accident was left off.",
            "im sorry (hug) take something cute/funny with you for her. maybe if she's allowed outside food, a starbucks drink she likes? flowers? chocolates? flood that hospital room with all of your love",
            "So sorry to hear about her car accident. I'm glad she'll have you by her side soon. Be strong OP :(",
            "I’m so glad she’s alive. Best wishes during this recovery period OP. Stay strong and be there for her, even if she sounded like her normal joking self on the phone, I’d bet she’s fucking terrified internally.",
            "The situation definitely sucks but the most important part is that she survived and can recover. The car shopping may be annoying and expensive, but still being able to lose to your gf at chess …priceless. I wish her the best in her recovery. <3",
            "All my prayers that your girlfriend recovers fully . I'm sorry this has happened to her .",
            "Godspeed to you and your girlfriend, OP",
            "I’m so sorry.  I hope she heals well. ❤️",
            "I hope she'll be ok, dude!  Good on you for flying out to visit her.",
            "Sorry to hear that. May she have a speedy recovery. \n\nHave a safe journey when you go and visit her.",
            "I’m sorry. I truly wish her well.",
            "Crap dude! I'm so sorry to hear that. I'm glad she's doing better than one would expect from a really bad accident, but man I hope she gets feeling back in her legs. Good luck to the both of you.",
            "Ah man this happened to me except I was the one in the crash and BF thought I was breaking up with him. Hope she and you are okay!",
            "What kind of phone sends things to spam? Or even has that function?",
            "It's good to have emergency contacts of family members for stuff like this. I'm not close to my husband's family, so we have a document with all the information.\n\nEveryone should do this.",
            "This is literally my worst nightmare. That my bf gets hurt or dies and no one knows how to contact me. \nI'm glad shes going to be ok!",
            "Gosh, I was sad at the whole not hearing from her for 2 days on the other post, and assumed something had happened. Then read someone saying hopefully not abducted and shit on your other post, while this is horrible I'm glad it wasn't the alternative above. I'm so glad she is alive, and that you've heard from her. I really hope her legs will be okay. Sending all my prayers to her. Get well soon 🙏",
            "I hope for a speedy recovery! That is honestly good you were able to get into contact. I know people who have disappeared completely and no one knew! Good for you for your due dilligence! \n\nWish the best of luck to your partner and you!",
            "Oh my, I'm sorry. You don't have to think anything, just be there for her, and try to take care of yourself too. Time and doctors will do their thing, and you'll both learn to cope with whatever the fallout may be. Wishing you both well.",
            "> So, she messaged me on LinkedIn.\n\nPerhaps that one good thing LinkedIn is good for.\n\nIn more important matters: I am sorry this has happened in your and your girlfriend's life.",
            "I’m so sorry, I hope she recovers quickly, that is terrifying. I really feel for you being far away. \n\nI won’t go into the details but I had a friend who didn’t text me back one night or the next day. People said I was overreacting, or he probably wanted space (we weren’t dating, I’m married but he was single). My husband and I had plans for a hike out of the city and my husband kept saying I’d hear from him eventually. \n\nHe was not ok, I was right to be worried. In the end I spent half of our hike sitting on a forest floor trying not to lose reception to the hospital. Always trust your gut—you felt something was wrong and you were right.",
            "That outcome isn't *good*, but certainly not nearly as bad as it could have been!\n\nShe's alive!  Her brain is good 'n' intact.  She's not tetraplegic.  She didn't ghost you.\n\nGood luck to both of you!  I hope her lower spine turns out okay.",
            ">The car is gone. I liked that car, it was a nice car.\n\nInteresting detail to fixate on. I hope everything works out.",
            "Why would you not port over your old number to your new phone?",
            "[deleted]",
            "Don't sell your SHIB just yet!",
            "What kinda car was it",
            "i dont see the problem when she is fine later then everything should be good i wish you both luck",
            "Sorry to hear that this was the result. Good luck OP and girlfriend! Really how she recovers well 🥰",
            "I hope she has a quick recovery.",
            "Best of luck for both of you two.\n\nGiven the circumstances the outcomes could have been worse, I hope everything is going to be ok.",
            "Oh shit, I'm glad she survived. Take a good care of her and yourself!",
            "Good luck in there, she will need all the support you can give, i hope she can feel her legs soon",
            "I hope she has a swift and speedy recovery and that her legs are okay OP.",
            "I'm so so sorry. I hope things work out OK for you both",
            "I really hope she recovers",
            "Thats rough buddy. Hope she gets better man",
            "I hope your girl gets better and her legs are ok.  Hang in there!",
            "So sorry to hear this!  Get out there and stick by her side.  Godspeed!",
            "I dated a guy who died driving home - I’m glad she’s ok",
            "Sometimes family can get really funny. My Ex wife's Dad passed away a week before our wedding, I was in another state at the time and did everything I could to be there for her.... But I wasnt.... He had a heart attack before I travelled for work, I wanted to stay, but he passed whilst I was away, even though I got the next available flight back, it wasnt good enough, even though I wanted to not go, I was told to go.... Alot of her family hated that I was not there... Very confusing times, we have 3 kids and remain the best of friends, yet I am not friends with her family or closest friends... We still are!\n\nMight sound a little long winded and off the plot, but from what you have said, I see similarities!\n\nBest Wishes bro! And dont dictate your love and hate between family and friends...  Is not good on you... Settle down and think, we can only guide you, good faith or bad.... But dont follow my footsteps!",
            "I'm so sorry that happened, best of luck",
            "This is literally my fear…. I will start searching car wrecks if someone doesn’t respond after 2-3x the time it should have taken for them to respond and get settled (roughly 2hrs). My family and friends know I have this anxiety and usually help me with it. I’m working through it but I don’t have any abandonment issues so it’s kind of tough. \n\n\nI hope your girl gets better.",
            "God this is my worst fucking fear oh my God.\n\nSo grateful she is ok and am glad your flying out to see her. Wishing yall the best of luck",
            "Hope your girlfriend recovers very soon.",
            "Holy crap so sorry you guys are going through this, very thankful she’s okay. Glad you’re able to fly out to her, it’s hard not to feel guilty for not being there when something like this happens but it ain’t your fault",
            "28 years happily married here. Realized a long time ago that love and sex are to very seperate and different things",
            "That’s tough bro. Hope everything is good.",
            "Wish you the best. Praying.",
            "Sending love from CO. motor vehicle accidents are no joke :(",
            "Hope you didn't sell the shiba inu coins 😋"
        ]
    },
    {
        "post_id": "ne1neo",
        "author": "lzharsh",
        "title": "[Update] I [29F] am unsure on how to put the moves on my husband [32M]",
        "url": "https://www.reddit.com/r/relationships/comments/ne1neo/update_i_29f_am_unsure_on_how_to_put_the_moves_on/",
        "score": 6270,
        "num_comments": 121,
        "created_utc": 1621209832.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/nakwe1/i_29f_am_unsure_on_how_to_put_the_moves_on_my/)\n\nTl;dr of last post: Due to coming off some long term medication, I have a sex drive for the first time in about 10 years. Realized I have no idea how to hit on my husband or initiate in general.\n\nMy last post didn't get a ton of attention, but I thought I would update people anyways. I took most everyone's advice and talked to my husband. He thought the whole situation was hilarious (in a nice way). But he was very reassuring. I told him about my fears of rejection, or doing something wrong. How my body issues have made it difficult to initiate because I fear I wont be able to turn him on. He gave me some ideas on how I might come on to him, what subtle moves might work to help initiate. He also reassured me that unless something major was going or he was sick, he would pretty much always reciprocate. He soothed my body fears and told me he finds me very attractive and I shouldn't worry about that. \n\nYou guys, this has been life changing. Talking with my husband completely alleviated my fears. After a couple of false starts, I was able to start initiating. And its been going great. We're both all over each other all the time, just like we were highschoolers again. Maybe even better. Thank you so much everyone for convincing me to just talk to my husband.\n\n&#x200B;\n\nTl;dr: Talked to my husband. Things worked out perfectly. It's like were 16 again.",
        "permalink": "/r/relationships/comments/ne1neo/update_i_29f_am_unsure_on_how_to_put_the_moves_on/",
        "comments": [
            "Your husband sounds lovely and still in love with you after so many years. Honestly, just saying \"Hey I wanna have sex\" works pretty dang well for my hubby and I who deals with very similar issues. No mind games, just love and honesty.",
            "So many downers in life and this sub, reading something that put a smile on my face is incredibly uplifting. \n\nI can’t wish enough for your happy marriage  and increasingly better sex life",
            "Congratulations. Now remember that talking out your fears and differences is the only way to communicate in a marriage and will result in a much more loving and bonding marriage so don't stop.  Next time something bothers you like this, talk to your husband about it before it becomes an issue.  Your husband has already proven to you that he is willing to listen, compromise and help find a solution so it sounds like you have a wonderful partner that is willing to communicate.  Good luck and I'm glad it worked out.",
            "Communication will resolve almost any issue.",
            "You know those spiders that have an extravagant mating dance? Just do that he will understand",
            "My gf literally says, \"mate?\"\n\nOn a serious note, glad you guys could talk it out. I was on medication that kinda killed my sex drive at first and would make it difficult to feel much sensation so I get it.\n\nEDIT: dunno if it's been mentioned but rejection is always tough, but it should also be something that both people are comfortable with. It isn't always something against the person rejected. Gotta think of it as your partner not being up for it, rather than something wrong with you.",
            "It gets easier. My partner starts work after I do and she'll usually message me and say something along the lines of \" let's have sex after work \" and that's it, makes the day go quicker and keeps us both excited. The most important thing I think you should take from this OP is that if your down then your partner is down because you both obviously love each other. Lack of sex drive is the worst glad to hear your back I'm action! Keep it up everyone needs sex",
            "Hell yeah girl- better than high school because love is definitely the secret ingredient in sex. Like restaurant dishes vs microwave, with experience as the cherry on top.\n\nAnd grats on being able to feel again. Getting off the numbing agent can be a scary prospect, but once you do it's a ***trip***",
            "I’m so glad to hear it!",
            "The math on this marriage isn’t adding up well",
            "Congratulations.\n\nIt really is amazing how he can get into our own heads to the point we paralyze ourselves. I'm glad you were able to gather the courage to meet it head on. That's encouraging.\n\nBe well.",
            "Omg I wish I had seen the original post because I have been through the same thing. \n\n\nWas on birth control that killed my sex drive and mental health, got rid of it, and we've been at it nearly every day. \n\n\nIt took me a little to understand how to flirt with him again, and my body issues defiently played at my confidence for initiating. But as you have said communication is key! \n\n\nI'm do glad you figured it out and Reddit helped you, it's fun to feel like teenagers again, and if I feel like this until I'm old and grey I'll be happy hahaha",
            "This post made me very happy, I am sitting here and smiling like a fool :)",
            "My favorite way anyone ever initiated sex with me was an ex. She'd just present her vagina and say \"get in here\". I always thought it was funny and adorable. I can still hear it all these years later.",
            "This brought a huge smile to my face. Thank you for the update!",
            "Nobody is at all concerned that this person has been married since they were 16?",
            "He’s a keeper, don’t ever let go of him! It’s so nice to see something nice come out of the posts on this subreddit every once in a while like this. I hope me and my fiancé can have a marriage like this someday.",
            "Heuréka talking about the problem solves the problem.",
            "This is heartwarming. I'm happy for you guys. Enjoy!",
            "There are so many marital problems that can be solved by one person lowering their guard and just express themselves. \n\nIf I were your husband in your situation and you're telling me that you now have the sex drive of a teenager I'd be happy like a kid in a candyshop. You'd have my permission to initiate anytime and it would always be reciprocated even if it is in the middle of the night. It sounds like that is the sentiment that your husband has. Take advantage of that! Satisfy the urges that you didn't have for 13 years!",
            "Quote \" Talking with my husband completely alleviated my fears. \"\n\n&#x200B;\n\nI dunno, seems like magic to me...talking to the other person....mmmm not for me....",
            "I will probably get hate for this but here goes: We men are simple creatures yes even married men are still basic and simple creatures if you were to just make out with him or grab him on his junk or any number of simple yet sexual things he is going to get the hint you wanna do the bedroom olympics.",
            "I don't initiate very often, but the last time I did, I waited until my husband took a nap, and then I had a shower and jumped into bed naked and said \"it's that kind of nap...\"",
            "Is rejection terrifying? Yes.\nBut you have to know that rejection coming from him doesn't have to do with you. Do you reject your husband because you find him unattractive, or you don't love him? No. Most of the time the rejection comes from external factors, such as time, tiredness, etc. If your husband is initiating sex with you constantly, you can be sure that any rejection that comes from him is certainly not about you.\nThere are several ways to initiate sex, you can literally ask for it, give him a long kiss, or grab his junk. It depends on what you feel comfortable with. I personally skip the kiss and go for the junk.",
            "Good for you!\n\nI just scanned through your original post, and I have a suggestion on initiating that I didn't see there.\n\nWake him up with oral sex.  \n\nTrust me.  He will like this so much, and he will like it even more if you've never done it before and it's a surprise.  He will have a grin on his face the rest of the day.",
            "Yayyy I love a happy update!",
            "Go down on him without any words.",
            "Haha, yes! So happy for you both!",
            "You mean to tell me open and honest communication was the solution the whole time!? 😏 I'm shocked!\n\nCongratulations, though, seriously. Happy for you.",
            "This is such a wholesome post",
            "[deleted]",
            "Straddle him. Seriously. Straddle him, and just take him. It’ll be a fantastic surprise.",
            "Aww this is really sweet, I'm glad it worked out, OP. Communication is key.",
            "I'm glad you getting the D lol",
            "Sometimes you just need a little encouragement! I wasn't there for your first post, but I'm very happy to see others were able to help you out. The best to both of you!",
            "This is awesome. After a year of crappy news, just a random wholesome post where everybody is getting some is a welcome sight.",
            "This is wholesome and sweet like nothing else I read today. Happy for you guys wish you all the happy fooling around for the next 10 years (and more).",
            "If you haven’t heard of it, look up Sensate Focus. My husband and I had a really positive experience with the exercise.",
            "Your husband response is pretty indicative of most guys. Unless we are sick, or the house is on fire. We are ready to go any time.",
            "Remember to use protection lol jk have fun.",
            "I think you might get a good suggestions from r/marriage subreddit Saw one recently and said, try to approach them in a playful manner. Both makes it funny and confident but still sexy and romantic. Remember, hes also your friend.",
            "I'm so happy for you OP. FWIW, if you're feeling self-conscious a tried and true method is literally sending your partner the french horn emoji",
            "This is wholesome. Congrats.",
            "Oh girl that's simple to initiate! \n\nYou walk up to him, look at him seriously and go: \n\n\"Hey...\" *Point to his face when he looks at you and gestures the whole face*\n\n\"Is that seat taken?? 🤔🤔\" and then let him know you tryna sit on it. LMAO \n\nThe same can be done by pointing at his manhood and going \"Is this available to order??\" 🤔🤔 \n\n😂😂😜✌️\n\nIt won't take him long to realize what you're tryna say to him 😂😂🤷\n\nYou can always let him know you're trying to get back into the swing of things by being silly when you flirt! 😁💓✌️ \n\nIt's absolutely fantastic to hear you are gaining that confidence back!",
            "90% of men are simple. Many don't pick up on cues, but the offer of sex alone is more than enough to get the party started.\n\nDon't have to dress it up, just offer sex and I'm sure your man will be happy to oblige.",
            "\"Talked to my partner - had lots of sex.\"   Is pretty much the holy grail of updates.",
            "A wonderful update. Very happy for you & your husband. Wishing you great health & great sex!",
            "Only 29 and you're already into your dirty thirties.\n\nCongrats on the sex.",
            "Grab him by the Weiner and yell \"let's get it on\"",
            "> he would pretty much always reciprocate.\n\n:)",
            "good for yall your hubby so a nice and understanding guy",
            "What a wonderful couple."
        ]
    }
]