[
    {
        "post_id": "51gpbb",
        "author": "idkwhattodo449",
        "title": "My (26M) girlfriend (27F) thinks she has body dysmorphia... she's just overweight. I don't know what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/51gpbb/my_26m_girlfriend_27f_thinks_she_has_body/",
        "score": 2653,
        "num_comments": 359,
        "created_utc": 1473187492.0,
        "selftext": "Been with Stephanie (name changed for privacy) for a little over 3 years. More or less relationship is good, she tends to be way overdramatic when we fight (which isn't often) but I can usually talk her down and things work out. \n\nWhen Stephanie and I first started dating she mentioned a few times in kind of a mysterious (I thought it was attention-seeking, still do) way that she had some kind of mental illness or mental health struggle. Eventually (probably two or three months in) she came out and told me in a really serious conversation that she has body dysmorphia and thinks she's obese and hates herself for it. \n\nNow let me be clear, I love her the way she is, wouldn't change a thing, I don't mind her weight whatsoever. But even when she said it initially, I almost thought it was a joke. Stephanie is obese. I'm not good at guessing weight and she's never told me her weight, but I know she's 5'4 and a size 22 in pants (US). She's by all standards obese. I don't mind it at all. I'm attracted to her, I think she's beautiful, I would never ask her to change a thing.\n\nIt didn't come up again for a while but last fall she took a psychology course for her college degree and they talked about mental illness and it came back up. She came in one night almost happy? in a weird way, saying that she understands everything that's wrong with her because they talked about BD in class and it all makes sense. She has never been diagnosed by a medical professional and can't see a doctor for lack of health insurance. \n\nEver since then, she talks about it a lot. I'm not one to poke at people just to poke, so I just let it be. But she talks about it all the time. She blames arguments we have on her BD. She uses it as an excuse to eat poorly and not take care of herself, because she is straight up convinced that she is smaller than she is and that the person she sees in the mirror is a dysmorphic situation. She is part of an online BD support group and talks openly to me about how she's met people who finally understand her, and she gives them advice and guidance based on her \"struggle\" with BD. She's pointed to actresses like Mindy Kalling and compared the actress's body to her \"actual\" body (vs. BD body) and says it's nice to see herself represented on screen. No offense intended to my girlfriend, but that's not her body type. She is much bigger than that.\n\nI'm getting to the point where I don't know what to do. She uses it as an excuse for all her behavior. I honestly don't know if she truly thinks she has BD or if she just uses it to justify herself. When we first moved in together, she would cover all the sizes on the tags of her clothes with Sharpie so I wouldn't see them. She's since stopped doing that (or only does it when she remembers), but it made me think she might be aware of her size and just tries to pretend she has BD so no one can talk to her about it.\n\nI know this is a weird situation. I'd like to get her or us into counseling but she doesn't have insurance and goes to a community college that doesn't offer student mental health services. I'm not sure what to do. \n\nTL;DR Girlfriend uses body dysmorphia as an excuse for everything, but she's not dysmorphic, she's just overweight. ",
        "permalink": "/r/relationships/comments/51gpbb/my_26m_girlfriend_27f_thinks_she_has_body/",
        "comments": [
            "So what you're saying is that she really DOES have body dysmorphic disorder, she's just got the direction wrong (she's bigger than she thinks instead of smaller). \n\nYeah, this one really sounds like something you want to hand off to a professional, unless you want to be the dude who breaks it to her.\n\nTry looking up low-cost mental health services. You can often find a therapist who will work something out for you even without insurance. \n\nThe good news is that you have your answer for every single time she brings this up:\n\nHer: \"I'm struggling with BD.\"\n\nYou: \"Yes. A professional can help you deal with that.\"\n\nDon't get sucked into conversations or arguments about it. Professional help is what she needs. Don't feed her delusion further. ",
            "You could send her to MyBodyGallery.com.  It's a website where you can put in your height and weight (or pants size) and see other people who are the same size as you.  It's really good for getting a reality check on what size body you actually have.  There's a good chance she's already heard of it though and possibly ignored whatever it showed her. ",
            "[deleted]",
            "If she took a psychological disorders course and learned about BD, she would know that she must seek professional help to get better. Encourage her to do this, it's the most you can do and this is above your pay-grade. If she DOES have BD, it doesn't get better by making excuses, she needs to take accountability to improve now.",
            "Regardless of whether she has or does not have body dysmorphia, or any other aspects of her weight or health -- this is not an excuse for anything else.  When you get in an argument about, let's say, who is supposed to do laundry, \"I have body dysmorphia\" is not a valid or relevant contribution to that discussion.\n\n\nThere's good advice here about her getting some help, but in the meantime, don't let that turn into a way for her to manipulate you.  Mental illness of any kind doesn't give someone a free pass to dictate all the terms in a relationship.",
            "If she's in college, they might have a health center where she can see a doctor for a reduced fee. And then the doctor can tell her she's obese and what the health risks are of that.",
            "She clearly has some sort of eating disorder and very clear delusions of her size (not quite in the way she believes, obviously.) From her height and pant size is sounds like she is not only obese, but technically, probably morbidly obese. Her health will very seriously decline if she keeps convincing herself that she's a healthy person. I'd work on her seeing a doctor or therapist, pronto. ",
            "When she talks about all this and talks about her body, what do you say? You just kind of go along with it or what?",
            "If you live in the US you can call or Google 211. It is a social services referral service run by the government. They can help your gf find low cost therapy. Also many counseling centers that train students have a ~$20 fee or sliding scale. \n\nShe needs professional help.",
            "Is she unaware of her clothing size or weight? I always feel larger than I am, but because of my clothing size and weight I know that I'm nowhere near fat. \n\nSurely knowing she's a size 22 should be enough for her to realise how big she is?",
            "Kinda sounds like she is dysmorphic, but not in the way she wants to think she is.\n\nYikes.",
            "If you are just overweight, then the remedy is to get moving and get healthy, but if you have \"body dysmorphic disorder\" then \"it's my disorder that I have, I can't do anything. I wish I could be healthy except is just this terrible disorder\" and then you don't have to do anything. It's a way to shirk the responsibility. I'm not knocking her, I can recognize that behavioir because I did the same thing with drugs and alcohol.",
            "At this stage I'd just tell her, there's no point being subtle about it, just say you find her beautiful etc. like you did here but tell it straight.",
            "If she is actually obese, she doesn't even need to go to any specialized doctor. ANY general practitioner worth their salt is able to say, \"Yup, you're obese and need a diet change.\"\n\nSource: Was obese, changed diet on doctor recommendation.",
            "I've seen this done with other body dysmorphic sufferers, but it was done with underweight people under supervision of a psych.\n\nGet a large sheet of paper, like, enough that her body can be outlined.  Have her draw what she believes her proportions to be.  Then have her lay down and trace her body over her drawn outline.  Let her then look at her size compared to what she believed she looked like.  This is an incredibly sensitive time.  She may get upset, clam up, or be defensive.  Ask her how she feels, encourage her to journal or write you a note of she can not talk to you directly.  Most importantly, remind her how much you love her and her body, and let her know you care for her mental health.",
            "\"I love you the way you are and am attracted to you, but I can see you are unhappy with your weight and appearance. I would like you to see a mental health professional, so you can be healthy and feel good about yourself. Let's try to find a doctor that offers low-cost services or charges on a sliding scale.\"\n\n",
            "[deleted]",
            "[deleted]",
            "Has she been around the same weight when she was in her teens? She might still be clinging on to her previous weight and all these are her way of rationalizing the changes.",
            "There is a lot of question about whether she has BD or not, so I'm going to leave that to everyone else and just assume she does (not that I actually believe that, but just for argument's sake) . Even then, this situation is not okay. She cannot use her illness as an excuse for every fight. It is not an automatic get out of jail free card. I understand that she cannot afford mental health and that is out of your control. One thing that is in your control is how you treat her when she takes the victim status and uses BD as an excuse. For example, when she uses her BD as an excuse to not eat well you could say something along the lines of \"everyone should eat healthy no matter what size they are. You don't eat fruits and veggies and avoid fried foods just to be a smaller size but also for your long-term health\" ",
            "Doesn't seem like you're getting much out of this relationship other than drama. Could be time to move on. ",
            "Help her find a professional. Whenever she says that x or y is because of her BD, tell her that a professional can help her with that. If she gets defensive ('I need no help! ') let her know how much you love her and how much you want her to be comfortable in her body, and maybe a pro can help with that. ",
            "> just overweight   \n   \nThat does not mean that she can't have BDD. BDD is about the consuming belief that your outward appearance is significantly bad, usually from the creation of or exaggeration of perceived flaws. And then, these perceived flaws will impair their everyday life. For example (as someone who does have BDD), I can't look at my own reflection or a photo of myself for more than a second or two, because the longer I look the more I ***see***, and the more I see, the more I hate, and the more I hate, the longer I spend looking and hating until I breakdown completely.   \n   \nSo your girlfriend very well could have BDD. And if she does, this is something you're going to want to steer clear of (in the sense of \"what can I do to help?\") and leave it to a professional. BDD isn't easy to deal with or live with, I've had friends from support groups kill themselves over this before. BDD is not an excuse. She being overweight doesn't mean she doesn't have BDD. BDD is about behaviour and ones mental state in relation to their physical appearance. BDD does not mean you *actually* have noticeable physical flaws, it means you *believe* you do, or *believe* your flaws are far worse than they appear to others. Your best bet is to encourage her to seek professional help, and you should probably try to learn a bit more about BDD as well",
            "This would be a deal breaker for me. If she's so delusional about her own situation, how is she going to be about other unpleasant truths in the future?\n\nRather than work on herself and improve herself, she takes the easy way out and finds an excuse to continue to eat more than she should, making her gain more weight.\n\nAnd of course if she continues down this road, and as she gets older her metabolism slows down, she's going to be even more obese. Okay you like her the way she looks now, but will you still feel the same way in ten years after she continues to over eat?",
            "Just tell her. Its not a looks thing and im sick of the \"beautiful how you are\" mentality we have. Plain and simple its shortening her life. Significantly. I'm fat and I need to lose weight for health reasons but I'm regularly told I'm fine the way I am blah blah blah. It's not an unreasonable body image standard or anything. It's heart disease, diabetes, back problems, high cholesterol, high blood pressure and early death. Count calories and exercise.",
            "I understand she doesn't have health insurance or a doctor to talk to, but talking to a medical professional who has actually studied and been trained to recognize BD will show her that she doesn't have it, nothing that you say will change her mind.\n\nDo you have any friends who are psychologists?",
            "Whether or not she has body dysmorphia it seems like she doesn't have a healthy relationship with/connection to her body and probably needs professional help.  It also may be that though it's not a 100% accurate descriptor it feels like it fits to her because it feels the closest to how she feels about her body.  To me it's not about convincing her she doesn't have BD and more about making sure she sees a professional.  As others have said, many mental health clinics have sliding scale pricing so she may be able to get free or low cost help.\n\nAs someone who has struggled with mental health issues (and now have them managed) it doesn't seem healthy to me to define yourself so strongly by a disorder.  And it's not cool to use it as an excuse for bad behavior.  There are times when my issues create problems in a relationship but I'm always trying to do better and improve.",
            "My sense is that she's manipulative. She wants you to feel sorry for her so that it's easier for her to get what she wants from you. \n\nI had a friend like this once -- granted she was about ten years younger -- who claimed to be anorexic and said that it was her friends' fault because we were thin and that made her starve herself. Thing was, she wasn't starving herself. People would see her eating all the time, including really unhealthy stuff like McDonalds. She also never lost any weight. She was actually considerably overweight. She was trying to manipulate us into feeling bad for her and feeling guilty for being naturally thin. It also absolved her of any responsibility for her own health because her \"only problem\" was that she was anorexic and that was our fault. \n\nShe is still the same size today and no longer claims to have a disorder... but she did find other ways of trying to manipulate us until many of us just broke off our friendships with her.\n\nMoral of the story: I'm not saying your gf doesn't have a mental health issue, because this is clearly not normal behavior for a 27 year old. But I don't think it's BDD, and the only one who can fix it is her. \n\nETA -- I've posted about this girl before and got a lot of skepticism, so I wanted to clarify that no she was not bulimic either. Because she spoke so often about her problem we watched her closely and she wouldn't purge after eating. She was just lying. ",
            "I think that body dysmorphia goes both ways",
            "A lot of folks giving her the benefit of the doubt, but she could be fully cognizant of being fat and be making up pure bullshit excuses to address it. I tend to think that not everyone has a \"mental disorder\" and assume they are full of shit, so take that into consideration. Sad doesn't = depressed, happy doesn't = manic, assholishness doesn't = psychopathy.\n\nEdit - deleted extraneous word",
            "Whether she has body dysmorphia or not, I think a good way to \"get the ball rolling\" in a positive direction is to be supportive and encouraging toward her getting help for it. You don't have to break the news to her. Tell her how much you want her to get help for this because you want her to be happier and for her to improve her life and mental health. Help her find a way to see a professional despite the obsticles. \n\nMaybe you could tell her to talk to her Psychology professor at her college for ideas or recommendations for metal health help w/o insurance? I'm in a similar situation where I'd like to see a professional, but I have no insurance - I've been looking up local resources and when looking under youth health resources I've found plenty of therapists that offer sliding scale payment to adults.",
            "She has quite a bit going on in her head.  More than she will be able to work through successfully.  Professional  help is definitely needed.  Don't  go the route of most men and just call her a wack a' doo Macgoo. ",
            "[deleted]",
            "I have no real constructive comment. I just want to mention that it's bizarre she marks over her clothing sizes, either for herself or you, which suggests she is aware of her actual size. It's hard to argue with numbers (weight, measurements, or size). A size 22 is objectively very large. Mindy Kaling, as you've pointed out, is much smaller than a size 22. I think I've read she is a size 12 dress. I wonder what your gf does mentally with such numbers. Seems she sees herself smaller than she is but simultaneously denies the actual math of the situation. Denial is a strong force to reckon with. As others are saying, that reckoning is best left with a trained professional.",
            "I'm gathering that her BD is on the atypical side of the spectrum—as in she sees herself as a smaller person than she me actually be?\n\nFirst off, mental disorders and delusional thinking is not rational, but to the person who experiences it, it can be very real. If you have hallucinations that spiders are crawling all over your body, and you can see them and feel them, they are every bit as real to you as if spiders were crawling all over you. The worst thing in my opinion that you can do to a person who may or may not be suffering is to invalidate their experiences. \n\nJust because you don't see yourself ever behaving the way \"Stephanie\" does, doesn't mean you should apply your rationale. It really isn't your role here to diagnose her or decide that she is just attention-seeking. It doesn't matter if it's true. I can see that fueling resentment and suffering in secrecy on her end.\n\nMy only advice if professional help isn't an option right now is to try to at least be supportive of her experiences as being real to her. It sounds like she's engaged in her own social support, and that's probably a really good thing for her. \n\nI hope you and your partner can talk and work out the way that each of you feel. It's important to communicate to her that you're concerned and want to be supportive before it drives you apart. Best of luck!",
            "Sorry to be rude, but why are you with her? As you said shes: \n\n1. Over dramatic \n2. Obese and negligent of her health\n3. Obviously lying to you and pretending she has BD  (you said she hides her weight so she clearly knows what it is)\n4. Is not someone you can have a direct discussion with",
            "Dude, you gotta break up with her.  This level of crazy is incompatible with a healthy relationship.",
            "Get her some professional help. She is sick, mentally and physically. \n",
            "I think your GF just invented reverse body dysmorphia.\n\n> Body dysmorphic disorder (BDD), also known as body dysmorphia or dysmorphic syndrome, but originally termed dysmorphophobia, is a mental disorder characterized by an obsessive preoccupation that some aspect of one's own appearance is severely flawed and warrants exceptional measures to hide or fix it.\n\nSee what I mean? She's more or less doing the exact opposite of this.",
            "I think it is best she seeks in a professional in this case",
            "I suffer from BDD (not self-diagnosed) and she seems to be majorly misrepresenting what the condition is. A lot of people here don't seem to understand either though, including comments which have been massively upvoted.\n\nFor a start, it's not a case of \"she thinks she's fat and she is, so she doesn't have BDD\". While in a lot of cases the person might look perfectly normal, sometimes they are actually ugly, or have a facial deformity, or are fat. The diagnosis can be given to those who have these physical problems and are overly obsessed with them, and let them shape their lives. However, if she's objectively overweight and refuses to accept this and instead label herself 'body dysmorphic', well, she's a lunatic.\n\n\nBDD is hell though. It engulfs every aspect of your life. ",
            "Tell her to go to therapy, and tell her the truth. It's really hurtful to people with these actual problems when others try and co-opt them because they think it makes them special or unique. If I were to hear your gf say things like that, it would be extremely hurtful and cause me to seriously question myself as someone who is trying to recover. She needs to see a professional, and honestly it sounds like she wants to use this as an excuse to act and do whatever she wants. \n\nYou should not engage, and push for her to stop that. It's a legitimate illness, not something to be thrown around to feel special about. ",
            "There's delusions going on here and potentially some pathological lying....\n\nThis has professional and ex girlfriend written all over it. If she's this deeply committed to the delusion heaven only knows what she has or hasn't told you. I mean can you really take anything she's saying at face value? ",
            "She sounds unbearable. You're a better man than I am for sticking around.",
            "She's 27 and she's getting a *psych* bachelors??",
            "Why would you date someone you think was bring up having mental health problem for attention? ",
            "Does she qualify for Obama Care?  See what kind of options are available for free care.",
            "Everyone is saying that she actually has BD. I dunno if I'd go that far. She sounds in denial. She doesn't like her weight and found a way to remove guilt and the fact that it's her fault from the situation. I actually see this type of behavior with a lot of people these days. They don't want to put in the effort or habits for a change, so they begin to make excuses that will allow them to make bad choices without feeling bad. By the sound of it, I don't think your gf has BD, sounds like she's just fishing for excuses and wants you to validate those excuses. It's extremely common behavior in this day and age, and rampant among the overweight and obese population, sadly. \n\nPersonally, I think maybe if you gravitate towards healthy changes together and she starts to lose the weight, you might see her feeling more positive about herself and looking for less excuses. If that doesn't work, maybe you should think about whether you want to stay in a relationship with someone who is unhappy with how they are, but unwilling to change and even partakes in habits that will make themselves worse. If she's too deep in, she will continue to make these excuses and shun anyone who says otherwise, while gaining weight all the time. Consider whether that's a future you're willing to have. She's already obese, and she's going the other direction rather than taking care of herself. ",
            "I have a simple rule  - whatever your problem, you need to take some steps to resolve it. Doesn't matter how small or how slow, you have to do something. \n\nThis would be dumping territory for me. She just wants an excuse to check out. ",
            "In the US not having insurance is a fine-able offense. She's old enough to qualify for Medicaid without having to her parents' income included. So why are you so adamant that she cannot receive therapy? All you have to do is look for therapists that accept Medicaid and tell them you need to sign up. They'll submit everything for you during the first appointment.",
            "The ship's sailed on being upfront with her, but I couldn't go along with this for the foreseeable future. If you want to discuss it, I wouldn't bring it up but I would stop colluding when SHE brings it up, and I would ask questions. How big does she see herself as? How does that hold her back? Would SHE be unhappy at that size or is she more worried what people think. If she point blank asks you what you think of her size you can say something like \"you're a size 22, right? I guess that's bigger but I think you're beautiful\" if you're feeling brave, you could drop it in if she refers to not really being overweight.\n\nCards on the table: I think she's probably quite immature in some ways and has a lot of anxiety about her size and how people perceive her. I think she uses the \"body dysmorphia\" stuff as a safe way to discuss those feelings without fear of people telling her to lose weight, with a side order of wishful thinking. I'd hope that if you give her an outlet to talk about her feelings about her size, the \"dysmorphia\" stuff will either be quietly dropped or will be pushed out into the open, unfortunately probably with some drama. But I don't think the status quo is healthy. You're doing it for nice reasons, but you're patronising her and she's embarrassing herself.",
            "If she's in the US, she should get Obamacare and see a doctor. As for you...I mean it's up to you. I don't think I could date someone so in denial. Too much stress. It sounds like she uses her \"BD\" to excuse shitty, lazy behavior. It sucks that she's having mental health problems, but that's not your responsibility to fix. She needs to do that.",
            "Buy yourself a scale. No one can deny weight and find her bmi and tell her.",
            "I'm probably missing something but what makes you believe that she doesn't have BD? It sounds like you think it's a one way street in that someone can only believe they're bigger than they are, whereas your girlfriend is the other way. That's still BD. ",
            "I can't believe the comments on here or that this actually exists. What it boils down to is she is self conscious of her body, isn't everybody? Fuck it I have body dysmorphia in that case",
            "put your hands on her hips and then back away from her keeping your hands steady then tell/show her \"you are this wide, honey\"  maybe that will snap some sense into her.  or ask her to measure her waist and show her the number..",
            "I browse /r/relationships all the time and this is the first time I've faced a situation I just can't comprehend at all. \n\nYour girlfriend is a size 22 and shes only 5'4. You've already stated that not only is she overweight but she's obese, but you're still attracted to her and think she's beautiful. Right now I'm a little bit uncomfortable because it's abnormal to find this someone who's obese to this point attractive but I'll give you benefit of the doubt and assume she must be an amazing person. Like knockout personality and beautiful facial wise. \n\nHowever, it really bothers me that you wouldn't ask her to \"change a thing\" I just can't comprehend this, I get that some people are attracted to people with more weight on their body but to tell people you're girlfriend is obese and obesity in itself is such a horrible and detrimental factor to health makes me feel like this is insane. I know I'm coming out of nowhere with this but how can anyone love someone so much yet let them continue on such a self destructive path and tell themselves they should never change. \n\nI'm sorry OP, I didn't really give you advice but I'm hoping some other redditors can chime in and help me understand this. I think OP does more damage to his girlfriend by letting her believe it's okay to be obese. I know she has body dysmorphia but the problem would still be there if she didn't have it, OP is okay with her obesity and I find that wrong. ",
            "If she attends University she might qualify for free or discounted psychiatric counseling through her college. When I was a student I could go to the university psych department for free. Their grad students needed real clients and I couldn't afford an expensive therapist. They all work under a professor and discuss the treatments and cases with a licensed professional. If she's still in college it's worth investigating. ",
            "Dont dip your wick in crazy. Thank me later.",
            "Leave this page open on your computer and let her \"find\" it. Kidding, but suggest a professional.",
            "Isn't there a universal healthcare system in the US? Anyone in the UK with a National Insurance number can get healthcare for free, maybe having a doctor talk to her would help. ",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "[removed]",
            "Improve her self esteem. Even though I am 185cm and weigh 150lbs, sometimes I swear to god I think my face is fat. But when I feel happy and look in the mirror, my impression of myself changes. ",
            "If she's in school then it's likely that her campus has a counseling center that she can attend for free to get treatment for her \"BD\".",
            "Body dysmorphic disorder can be about a flaw that exists. It's characterised by obsessive Intrusive thoughts. \n\nYou don't need to talk about her body size, and can still suggest she see's a therapist to discuss her relationship with her body. \n\nOften excessive can help - outside of weight loss (ex resize actually isn't the most effective thing for weight loss, but still has huge health benefits regardless of your body size) - can make people feel stronger, and more energised, and therefor more comfortable on their body. "
        ]
    },
    {
        "post_id": "48t3za",
        "author": "tiredofdoingevrythng",
        "title": "(UPDATE) My (23f) SO (30m) has decided he doesn't have to pay his half of rent anymore, and all of the money he makes is his alone, but the little money I make goes to all of our living expenses.",
        "url": "https://www.reddit.com/r/relationships/comments/48t3za/update_my_23f_so_30m_has_decided_he_doesnt_have/",
        "score": 2650,
        "num_comments": 241,
        "created_utc": 1457027702.0,
        "selftext": "**EDIT**\nWow! I didn't expect my post to blow up like this, and thanks to whomever sent me the gold! Reading everyone's replies has helped me realize I made the right choice by leaving him. It's been an emotional rollercoaster, I've cried, laughed, felt scared, felt confused and angered. I know want to go in to counseling, which I'm planning on doing as soon as I'm able to do so. I've managed to block him on my phone, so I don't think I'll have to change my number after all. I called my apartment this morning to see if they could grab the router and cables from my place and hang on to it until they can be retrieved, they were happy to at least do that for me, so now he doesn't have internet! I did listen to a few voice mails he left for me in one message, he was calling me by my pet name, and literally talking in cutesy baby voice to me. The next voicemail he was just yelling at me. They've made me laugh but also make me well, afraid, of him. I've taken everyone's advice and I will be extremely careful for the next few months - I have pepper spray, I won't be traveling alone, and I'll be using campus or police escorts when possible. \n***\n\nSo, things have happened rather rapidly since Tuesday. \n\n[Original Post Here](https://www.reddit.com/r/relationships/comments/48k7nu/my_23f_so_30m_has_decided_he_doesnt_have_to_pay/)\n\nI talked to my mom some more about what has been going on, I wasn't too open with my parents about how bad it was. She basically wanted to get me out ASAP after I revealed more to her. Anyway, so here is what has happened so far. \n\n* Apartment - it's in my name, the lease is up in May. I talked to my landlord about the situation a bit, basically they can't force him out because there's no official reported criminal activity. He has 30 days to leave. It would also be more expensive for me to break the lease than to pay out for the next two months. Which really sucks. March's rent has already been paid leaving April and May left. The penalty charge is 3 months rent and they can't do anything else. However, I did choose an option to put my apartment \"on market.\" Which basically means they can start showing my apartment after Dipshit's 30 days are up, so he'll have no choice but to leave after that. If they happen to find someone to take the apartment before May 1, I don't have to pay that month's rent. They did copy all the documents and everything I signed and a note for him about getting out in 30 days. I left that in the apartment for him. Since his name wasn't on anything he didn't need to sign anything or be present. \n\n* Jobs - First job: I talked my manager, she was very understanding and was able to start a transfer to a different store near where my parents live. My parents live an hour away from the apartment, btw. I still have to show up to work in my old town a few more times until the transfer is (chance it may not be accpeted) accepted, but my manager and I were able to work out a light schedule. And there will be at least 3 other people in the store with me during those times I'm scheduled. Second job: I called my old professor who was also super understanding, we had a under the table cash only agreement, so it was easy to end that working relationship. It sucked, but she understood. \n\n* A lot of people mentioned that this was an abusive relationship. I did a lot of research on \"signs you're in an abusive relationship,\" and he checks off a lot of boxes. There were a lot of other red flags I didn't even mention in my last post about how horrible he is. This was a huge eye opener for me, and I realized the level of danger I was in by being near him. Unfortunately the revelation I've had has also caused me to feel incredibly depressed, even more so then I felt before. I'm trying not to blame myself for how horrible things have gotten, but it's really hard. I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself. But, that's a discussion for another sub. *sigh* \n\n* As I mentioned earlier my mom wanted me to GTFO of my apartment ASAP. I had to convince her not to drive down and take me away in that moment. Dipshit worked last night and would be out of the apartment after 5pm. My mom, dad and uncle arrived at the apartment at 5:30pm. I told my best friend what was happening (who lives close to me) and she came by the apartment as well. The 5 of us were able to pack up pretty much everything I own and put it in all of our cars. So I'm now home! \n\n* Loose ends -\n\n1) I still have a few GRE classes to attend, but it's only once a week.\n\n2) Hopefully the transfer will be approved for my old job, I'm still scheduled to work a few days for the next two weeks in my old town, but it's extremely light. And as I mentioned, multiple people will be in the store with me, I won't be alone at any point. \n\n3) Anything else I need to discuss with my landlord can be handled over the phone/email. I've signed the appropriate documents. I'll likely have to pay damages after the lease has officially ended.  \n\n* Dipshit - He called me late last night after he got off work, and was obviously confused and angry. I refused to tell him where I was, which just pissed him off more. I told him that because he was financially abusing me, as well as emotionally abusing me and scarring me on a regular basis by yelling/punching things/throwing things that I couldn't take it anymore. That I deserved better, that he was a horrible person, that I didn't love him anymore, etc. Well, he stopped being angry and turned on the water works. He apologized profusely, he begged me to come back to him. He said he could change and that he was only acting out because he was depressed and I should give him another chance. He even claimed that he was \"just about to tell me that we're financially even now!\" What are the odds?? It was the most surreal conversation I've ever had in my life. I felt absolutely nothing for him, his tears didn't upset me, his anger didn't upset me, I was just cold and numb throughout the entire conversation. I felt like I was getting bored just talking to him and wanted the conversation to end asap so I could watch Netflix. I literally started to glaze over other things he was saying, he was going back and forth from being sad to angry, and I was just on the phone like \"uh huh, yeah, sure, no..\" Eventually he caught on that I stopped paying attention to him. He snapped at me and asked when I was going to stop this bullshit I was pulling. He started to rage about something, I interrupted him and said I didn't want to talk to him anymore, that he was horrible and owes me thousands of dollars, and I never want to se him again. And then I hung up on him just as he about to put on the water works again. He called and texted a lot, I haven't responded. He's been continuing to call me today as well. My next step is to get a new number. \n\nThanks to everyone who commented in my previous post, or pm'ed me. I wasn't able to get back to everyone, but I did read everything. The next few months are going to rough, but at least I won't be with that asshole anymore. \n\n**tl;dr** Friends and family came to my rescue in an emergency move out last night when Dipshit was at work. I'm safe at home now, but I still have loose ends to tie up with work and the GRE class I'm taking. ",
        "permalink": "/r/relationships/comments/48t3za/update_my_23f_so_30m_has_decided_he_doesnt_have/",
        "comments": [
            "You should have said, \"I finally took out the garbage one last time.\"",
            "You handled that wonderfully. Kudos to you for getting out quickly and discreetly. A few months rent is a small price to pay for your safety.\n\nI'm glad your parents are being so supportive. Best of luck in the future!",
            ">I'm trying not to blame myself for how horrible things have gotten, but it's really hard. I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself.\n\nThis is an extremely common effect of emotionally abusive relationships, by design. It's also exactly why the abusive behavior ramps up slowly... So you get attached and he can establish a history of good behavior. It makes it easier for them to turn future abuse around on you, and harder for you to leave.\n\nRemembering that can help mitigate it, but it will take time. Be patient and kind to yourself. \n\nOh, and CONGRATULATIONS! You're out! You're FREEE!",
            "Honestly, good job. Hindsight is always 20/20 so you're always going to think \"well, I should've...\", but when you're in the moment things are way hazier. It's human nature, and it happens to everyone -- don't beat yourself up over it one bit.\n\nAnd hey, look at it this way: you pretty much have nowhere to go but up from here! =)",
            "Good for you. I hope you took pictures before you left so you can prove that you didn't do any damage to the apartment. Beyond that make sure you don't talk to him but only communicate through the written word. Screenshot everything just in case. Also tell family and friends not to tell him where you are or what your new number is. \n\nAs always when dealing with family or people who live(d) with keep an eye on your fiances. He has had plenty of opportunities to open your mail and the like. So make sure there are no lines of credit opened in your name you don't know about and he can't access your bank accounts. I would even go so far as to tell your bank you have an ex who might try to gain access to your accounts. If you have any passwords saved on a device he has access to or passwords he knows change them.",
            "[deleted]",
            "[deleted]",
            "Be careful going to your GRE classes if he knows the schedule for that. A lot of abusers like to lie in wait for their victims if they know they'll be somewhere at a certain time. You no longer live with him, but this can be a dangerous time- possibly the most dangerous. Get security to walk you to and from your car if at all possible.\n\nAlso, if you have a smart phone you may be able to block calls from some people. Definitely on iPhones.\n\nGood luck and I'm glad you've made a clean escape from a nasty future!",
            "[deleted]",
            "Take this as it is: a great learning experience to ward off future assholes. Also, I hope your landlord walked your apartment with you.  Chances are this dipfuck will damage something before being kicked out.",
            "I wish every emergency GTFO manouver would go as well as this one did. You handle your life well, OP. Good future in store for you.",
            "I literally clapped when I read:\n\n>I was getting bored just talking to him and wanted the conversation to end asap so I could watch Netflix\n\nFucking YES girl!",
            "Thank you, thank you for telling your family everything. They love you and want you to be safe and happy. Not drained and abused! Do not feel guilty for being in that situation. Stories like yours are very common, unfortunately. Younger partner, limited relationships, meets older partner with experience. Everything is beautiful the first few months/years. Then the switch is flipped. This makes it easy for them to convince you that A.) You're the problem and B.) they're saints for putting up with you and also they're the only ones who understand and can help you. They paint a picture of you that is just... not at all accurate, but you're so isolated from friends and family that gradually... you start to believe it.\n\nOn average, it takes a person suffering in an abusive relationship SEVEN times to actually break away for good. They keep going back, keep forgiving, because the mind-fuck is just that strong. You did it in ONE shot. I'm stupid hella proud of you, you don't even know!",
            "awwwe man, right as you guys were almost \"financially even\". as if that's even a thing in relationships lol it shows a lot about who he is that he feels the need to keep score.\n\nso happy you are out of there!! moving out asap like that after coming to a realization about your relationship shows a shit ton of strength. you are a bad ass bitch and you deserve so much better!",
            "You done good OP. Nothing more satisfying in this sub than reading about people cutting dead weight. \n\n",
            "Good job, OP.  There are women out there who have put up with behavior like his for years.  You are a strong woman for getting out of that situation and for letting your parents help.  Stay strong and don't let him talk you back.",
            "Another one i was hoping to see an update on, well done for being so brave and getting out as soon as possible. What a grade A POS.",
            "I would have bet my life savings the conversation was going to go that way. Back and forth between begging and apologies to anger. It's because the apologies and the remorse aren't genuine. It's just what abusive people do in the moment to manipulate, and when it doesn't work, they go back to anger and put downs. Both tactics are to keep the blame on you for the relationship ending. Let it reassure you that he won't change into someone who cares about your wellbeing beyond what you can do for him.",
            "Nice to see you've started calling his by his real name. Dipshit indeed",
            "Amazing to read! Make sure you stay strong and I hope work pulls through. Good luck with everything and maybe thank your parents when you're back on your feet again for being there for you :)",
            ">I'm trying not to blame myself for how horrible things have gotten, but it's really hard. I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself. \n\nNope, you are definitely not damaged! I'm speaking as someone who was in an abusive relationship for 8 years, from 17 until 25. The guy was 7 years older than me as well, and systematically broke me down. \n\nWell, I rebuilt myself back up with others' help, and now I'm better than ever. I now know what a healthy relationship is, I've been in one for 7 years, and I'm living a life I love. You can do it, too. You are so much stronger than you know. You got out of there like a boss. I'm cheering for you, and all these other people are, too! \n\nGo ahead and go no contact with the terrible ex. Change your numbers, change your email, change all your passwords, and go low on social media for a while. Also make sure no utilities in your old place are in your name. I made that mistake and paid for it with Comcast destroying my credit rating. But it was so worth it to get out and make a clean break.\n\nYou're still so young, and your life is just beginning. Around the bend from this tunnel of darkness will be a great deal of light. Take care.",
            "> I've permanently damaged myself.\n\nNah, you've learned how to identify this crap. That'll make you stronger and more able to meet a decent person in the future.",
            "[deleted]",
            "I'm at work, so I cannot yell...\n\nBut I wanted to squeal out loud while I read through this entire post. You handled this BEAUTIFULLY. You were assertive, you were firm, and you took control of a situation where you had none. That is huge. \n\nYou should be incredibly proud of yourself. I'm happy that you didn't fall for his tricks, and I'm happy that you have friends and family willing to go above and beyond for you. I really hope your transfer goes through, and that you enjoy the better days to come!",
            "Don't beat yourself up too much about not realizing you were in an abusive relationship. From what I understand, it's like the frog in gradually heated water. Outsiders can easily see the red flags, but your SO has sown so much self-doubt, misdirection, and introduced the abuse in doses so that you overlook the behavior. At least you posted here and were able to get some feedback and are *now* out of there.\n\n> He apologized profusely, he begged me to come back to him. He said he could change and that he was only acting out because he was depressed and I should give him another chance. He even claimed that he was \"just about to tell me that we're financially even now!\" What are the odds??\n\nDoes anyone else get a justice boner when these abusers pull the about face from yelling to crying? ",
            ">Unfortunately the revelation I've had has also caused me to feel incredibly depressed, even more so then I felt before. I'm trying not to blame myself for how horrible things have gotten, but it's really hard. I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself.\n\nNo one can tell you how to feel, but I want to say that you absolutely SHOULD NOT feel bad about yourself over this. The abuse is a slow immersion that you acclimate yourself to over time.  But when you put the pieces together, you did everything you could to remove yourself from the situation and saw through his manipulation.   You are a loving, resilient person, once you've grieved for what you've \"lost,\"  you'll find someone you deserve.\n\nWhen you are back on your feet, you might want to try some counseling to address the emotional scars from that relationship, but    look forward to the life you opened yourself up to, not to the past that happened to you.\n\nedit for words.",
            "I always worry when we give advice to people in abusive relationships. Often we don't hear back or they dither about getting out and in the next update things are worse. You got out fast, like a pro and landed on your feet and this makes me glad.\n\nGood for you!",
            "A small note. If/when you do get a new number, you don't have to pay for it if you tell them what's going on. I had an ex calling and texting me non stop so I called my phone company, told them I was being stalked, and they changed my number for free! ",
            "Thank you for doing the right thing by you.\n\nYou are amazing and your depression will wear off once you realize that he manipulated you into this situation. You couldn't have known when it all started but you know now.\n\nSmile for yourself. Your life just got 1000000000% better.",
            "Don't get a new number, just block him.  ",
            "Top notch work!",
            "I'm so happy you have a supportive mom. Not your fault that this happened. Glad you have gotten out. Keep reading up on it and work through it.",
            "Doing it like a BOSS. Bravo. ",
            "Handled like a boss, OP. Well done. :)",
            "It gets better! As someone who also escaped from an abusive relationship with family help, you will be 100% OK if you completely cut this turdnozzle out of your life. Don't pick up the phone if a strange number calls you, don't reply if he says he urgently needs to talk about something, don't agree to meet up because he wants \"closure\" or to \"reconcile.\" If he sends letters in the mail, let a trusted friend or family member screen them to see if there's anything you actually need to know so you don't need to be exposed to his abuse. \n\nYou are right that the next few months will be a little rough. The adjustment period can be really hard, but please reach out to friends and family for support. You are not broken. You survived a toxic relationship and came out kicking, and now you will be that much wiser when you move on to your next relationship. Give yourself plenty of time to heal before you start dating again, and be kind to yourself. ",
            "Good for you. Don't beat yourself up about being in a bad relationship. You learned from it and you are a better person for it. You are stronger today and you will be even stronger tomorrow. The future you thanks you for all you have done to get to a better place. ",
            "Yeah, abusive relationships SUCK. But I remember that same coldness after finally leaving my ex husband. Like something just clicked and I didn't care. I wasn't angry or sad or hurt. Just done. I will say that a few days later, I had a bad meltdown. Everyone is different, but I've heard it can be common. The good news is, you're out and free. \n\nDon't blame yourself for getting in so deep. I married an asshole a lot like this. This type of person is very good at manipulating. They wear you down until you don't want to question their lies anymore and you take the abuse because they've *convinced you that you can't leave*. I used to believe I would never do better than him. Then I woke up. I hope you can move through the negative stuff quickly and start a new lease on life. You really do deserve better. ",
            ">As I mentioned earlier my mom wanted me to GTFO of my apartment ASAP. I had to convince her not to drive down and take me away in that moment. Dipshit worked last night and would be out of the apartment after 5pm. My mom, dad and uncle arrived at the apartment at 5:30pm. I told my best friend what was happening (who lives close to me) and she came by the apartment as well. The 5 of us were able to pack up pretty much everything I own and put it in all of our cars. So I'm now home!\n\nThey are amazing for doing this, I wish this happened more often for other stories of people trapped in an abusive relationship.",
            "Shoutout to OP's family and bff. You guys are the real MVPs. \n\nWell done, OP. The loose ends will get tied up soon. Enjoy your freedom!!",
            "How classic of him to cycle through charm, rage, and self-pity. Shitheads are a dime a dozen, fortunately they play by very similar rules, so now you'll know. I'm really happy for you, and glad you got out! Good luck in the future, keep your eyes and ears open.",
            "Holy fuck OP that ending.\n\nYou basically Simo Hayha'd him.",
            "Be prepared for a cycle of the crying and \"I can change\" BS followed by angry and abusive comments as soon as he realizes it's not working.  It's not easy breaking up with abusers.  Stick to your guns, don't let him get to you and be very open with your mom and any other supporters.  They will help when things get confusing for you.  ",
            "I am extremely proud of you! Are you still responsible for the condition of the apartment? Worried he might damage the interior to get back at you. Please make sure he understands that he will be held responsible for damages. In writing or by email. ",
            "You are not permanently damaged, you are immensely strong and I am so proud of you.",
            "This is the only time I'll ever advocate something like this, but we need to ban whatever abuser handbook he got those lines out of. I mean, really? Everything he said was a cliche.",
            "Are you worried the he will be smoking and trashing the apartment you're leasing? He is a man child when you're there, with you gone I bet he will wreck the place. Kudos on staying strong and not buying into any of his BS.",
            "It is fantastic that you took action quickly! Kudos to your family and friends for being so supportive. Best of luck on the GRE, I took it twice ;).",
            "I'm very proud of you. I didn't see your original post, but reading it now, it's clear what an abusive, manipulative person you were living with. Here's the thing though: that's on HIM. That is not on you. You are not to blame. Do not blame yourself. The way abusers thrive is because they convince their prey to blame themselves. Don't fall into that trap. It is not your fault. \n\nAlso, if the money is a large enough amount to make it worth it, you might want to consider suing him for the damages to the apartment, the damages to your belongings, and the money he didn't pay in rent. ",
            "Hey, I'm really proud of you for getting out.\n\nAs someone who was in an abusive relationship as well, your reactions aren't abnormal. I was feeling a lot of the same things. I didn't even really notice the abuse until I was complaining to my friend about something my ex was doing and she started telling me how fucked up it was. After that suddenly I noticed everything all at once. It wasn't fun to say the least.\n\nI know it's cliche to say, but try looking into therapy if you can. I leaned really heavily on my mom for support too when I finally left but I cannot even begin to tell you about how much therapy has helped me feel better about myself again.\n\nIf you ever need to talk about what happened or just how to find a good therapist, feel free to PM me. I truly wish you the best and I'm so happy you got out.",
            "\"I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself.\"\n\nOf course not. You loved him and worked on the relationship the best you could. Despite not being appreciated, you learned how much you have to give.\n\nWe all get taken advantage of at some point in our life. For you it happened young. I have an Aunt for who it happened late, when she was 60 and her boyfriend borrowed money to start a business, but left with the money instead.\n\nMy mother took advantage of my father for years financially.\n\nStuff like this may hurt, but it only makes you stronger and wiser if you let it. Just imagine what life would be like when you eventually find that guy who would be as dedicated, kind, contributing as you was in this relationship? Stuff is only going to get better, which is the best part of having made bad choices.",
            "Ugh, I was reading your first post and this sounds like my brother and his boyfriend, with some slight differences..\n\nThank God you got out of it.\n\nNow will you knock some sense into my brother for me? He won't listen to me even though I've been through it too.. sigh. ",
            "Based on how quickly you accepted that things were over and put your departure into motion, I think you're much stronger than you give yourself credit for. It is going to be a difficult adjustment, but based on what I've read here, there won't be any permanent damage. Very proud of you.",
            "Given his past conduct, consideration should probably be given to a restraining order if he continues to try to contact you.",
            "His reasoning that your parents need to pay for the wedding cause its traditional was so stupid cause traditionally the guy is the breadwinner. ",
            "Keep your number, just so you have proof of his escalating behavior. Btw, send him a text telling him how much he owes. If he says some bullshit like, \"I'm not paying you back,\" it's an acknowledgement of the debt, and may prove him responsible to pay it back in small claims court. \n\nAlso, congratulations on your weight loss. It looks terrific on you. ",
            "Are you responsible for water and electric? If so, shut that shit off on him.",
            "> I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself. \n\nIt's understandable that you'd feel like this, but I would encourage you not to. Hindsight is 20/20 and having been in a toxic relationship I can tell you you can spend all day wallowing in the what-if game.\n\nDon't.\n\nYou're making the right moves and won't make the same mistake twice.\n\nYOU ARE NOT DAMAGED.\n\nYOU ARE NOT DAMAGED.\n\nOk?",
            "[deleted]",
            "good luck the rest of the way!\n\n",
            "I can't tell you how relieved I am to see this update & know that you're safe. Good for you! I know you feel sad right now, but it will pass and you have whole wonderful future ahead of you.",
            "Please tell me you took pictures of the state of the apartment before you left! If it's all in your name he could trash the place and you'd be on the hook for the damages!",
            "Yes, mama!",
            "I applaud your strength! \n\nYour post literally helped me tell my boyfriend that is was over. It was like basically reading a mirror of my own situation and the comments were helpful to me as well!\n\n",
            "I am super happy for you and proud of you for getting out of that situation and for not being manipulated by The Turd's attempts to sway you. If I had a dollar for every guy I put up with this selfish, abusive, manipulative nonsense from when I was younger... It took someone actually physically abusing me to wake me up to the pattern I had fallen in with these losers who happen to be good at manipulating unsuspecting women into their hyper-dependent turdwebs. All I can say is enjoy being single and doing your own thing and building yourself as a person. \n\nThere will always, always be another dude out there - that's the nature of our society sadly that a female can literally walk out the door and find someone sniffing around - but we as females need to know ourselves and what we want really well and what we are (and aren't!) willing to live with before we worry about \"having a man\" like is pushed on us practically since birth.",
            "Well done, you! Minor question: why would you have to pay damages after the lease has ended (on top of paying out rent for the next 2 months)? Are you worried he'll trash the apartment or something? ",
            "You're a freaking rockstar. Whatever you do, don't go back because he will feel the need to punish you for daring to leave. Definitely get that new number and block him everywhere. Absolutely no contact. You got this, girl.",
            "Proud of you :)",
            "Baby girl, I was in a horrible abusive relationship and had to do everything you're doing and it was an absolute nightmare getting out of my lease just a few months ago. I'm also 23. I just want you to know I met the most wonderful man a month after I moved back home. Things will get infinitely better. I'm rooting for you!",
            "Can you change your number now? It was literally the only way I managed to get some peace in a similar situation.  Of course then he would send me insane emails with the whole email in all caps in the subject line, so I'd get about 40 of them claiming that he had severe sleep apnea that had forced him to be insane and abusive.\n\nAaaaaand then he'd call my work all of the time and pretend like we were best friends and he was just looking to chat.\n\nOh and there was the letter he wrote to my parents and dropped off at their house.  (I never saw it because my mom threw it away without reading it).\n\nSo, I guess what I'm saying is...it's probably going to be awhile before he goes away.  Mine took 3 years of no contact to stop.",
            "You may be able to just block him on your phone rather than get a new number. ",
            ">3) Anything else I need to discuss with my landlord can be handled over the phone/email. I've signed the appropriate documents. I'll likely have to pay damages after the lease has officially ended. \n\nMake an appointment with the landlord NOW, and do a walkthrough, with a camera.",
            "At first you were afraid, you were petrified... ",
            "Did you take photos of the condition of the apartment when you left it?\n\nIf he's not on the lease, he's not on the hook for any damage caused, is he? If he damages the apartment in any way, you are legally liable, I believe, but IANAL. If he's volatile, I fear he may resort to destroying the property in an effort to get back at you.",
            "Abusive people almost always turn on the emotion when you try to leave them. That's the bait they use. If you don't fall for it they get angry and then return to their abusive egocentric self. Abusive people are extremely selfish and also co-dependant. ",
            "You don't realize how lucky you are OP. You got a good momma bear.",
            "Congrats on your strength!! There are far too many that don't have the strength that you found to get out. Just look on here and you'll see so many examples. You are an amazing woman for going through what you did. Your family deserves credit as well for being there for you. Hopefully, you will stay on here and help others find the strength to get out.",
            "Good for you for having the strength to leave! I know you feel like you should have done it sooner, but don't beat yourself up about that. Guys like this are manipulators, they are GOOD at what they do, which is making you believe that you are in the wrong. The important thing is that you recognized it and got away from him! KUDOS",
            ">\"Well, he stopped being angry and turned on the water works.\"\n\nIsn't it scary how good mentally unstable people are at this? I dated a guy with bi-polar disorder so I know this first hand.\n\nGood for you for making the right decision. It may have been late, but it's better than never. Some women would have ended up marrying someone like this because they felt weak after all the manipulation and abuse. You're already stronger and beat the odds!",
            "Yay!!! So glad to hear this OP! You did so good here! Best of luck moving forward.",
            "Cheers to you, OP - you handled this awesomely in a very short period of time. Enjoy your new life without Dipshit!",
            "I'm glad you're out of that situation. Keep a record of any continued interaction with him. Also, please be safe and make sure any friends/acquaintances are in the know that they are not to share with him any information concerning your new number or location. I made a mistake where I neglected to notify certain individuals and news about me got back to someone who was searching for me. My friend didn't know he wasn't supposed to say anything.",
            "Wow, way to get it done, OP! ",
            "I know this is scary and you are going through so much right now, but you're going to do great.  You are a strong, intelligent person who has a kick ass support structure.  Lean on people when you need to and always remember that you can and are doing this!",
            "\"I'll come back if you pay me back for all the months of rent I had to cover for you\" and then never go back. ",
            "I don't even know you, and I'm proud of you!\n\nDon't ever doubt what you can achieve.",
            "Congrats, for getting out of what sounded like a terrible relationship.\n\n>My next step is to get a new number.\n\nYou can save some bucks by getting an app called \"Sideline.\" You get a new number based on the zip code you punch in. You can call, receive calls, and text from this number. \n\nIf you're feeling harassed, or threatened by the phone calls. File a police complaint. You'd very likely be issued an Order of Protection. Keep in mind this could escalate things. \n\nDoes he know where you're living now? Should he show up, call the police *immediately*. \n\nHopefully dipshit is just a lazy dipshit, but if you believe for a nanosecond that your safety is at stake (and your family's), I urge you to call the Domestic Abuse hotline, for tips, and advice: -800-799-7233 \n\nGood luck! ",
            "Congrats, I was in a very similar SE years ago & definitely didn't exit as cleanly as you did. I can totally understand the lack of reaction to him, I went through it too. Just to warn you you'll have moments of feeling shitty about it then not again. & if he's like my ex he'll pull out whatever he can to mess with you, don't react. <3",
            "Great job, I am proud of you. You deserve d much better ",
            "This is such a satisfying update that I've read it three times. Congratulations, and good luck on your new, jackass-free life! Be gentle with yourself and spend some time working out what makes you happy. You're AWESOME. :) ",
            "Financially even?  The part I don't get is, how does withholding money make for a healthy relationship?  What was he trying to achieve? ",
            "I'm reading the update, haven't finished but as soon as she referred to him as 'dipshit' I already started smiling and knew where this was headed! Good for you OP!",
            "Good thing you acted so quickly. I'm so glad you're safe now.",
            "Were you able to take photos of the apartment before you left?  If not, can you go back while he's at work and take some? If he trashes the places, that might help with a small claims court claim against him.",
            "Way to go! You are awesome :-)",
            "YAY!!! I love this update. Good things are ahead for you OP! :)",
            "> Unfortunately the revelation I've had has also caused me to feel incredibly depressed, even more so then I felt before. I'm trying not to blame myself for how horrible things have gotten, but it's really hard. I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself.\n\nTry not to get too down on yourself - abusers work specifically by gaining your trust and slowly introducing abuse so you don't notice it, and by the time you do it feels \"too late.\" Instead, count your lucky stars that you realized what was going on and dumped him!",
            "I'm proud of you, Internet stranger. Keep us posted.",
            "You are awesome!  Congrats in the rest of your life!",
            "GOOD. FOR. YOU!",
            ">I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself. \n\nDamaged yourself, what?? Recognizing and ditching an abusive relationship is a level-up in life. You have just become stronger, wiser, and more of a badass. \n\nIt's normal to need therapy to work through and process the clusterfuck that just happened to you. But I would never say someone like you who took control of a situation like yours has been damaged, it's the exact opposite. ",
            "Your mom is awesome. That's exactly how she should react. Keep your head up and keep moving forward. Be glad you have such a great support system!",
            "\"I felt like I was getting bored just talking to him and wanted the conversation to end asap so I could watch Netflix.\"\n\nThat actually made me laugh!\n\nI'm glad you were able to ditch that dead weight, but always keep in mind:\n\n1) No matter what he says or does, he's never going to change, he's going to try and do everything he can to hook you again. Don't ever talk to him or give him so much as a single text or the time of day.\n\n2) Leaving an abusive relationship is really dangerous. Studies say you are most likely to be attacked or even killed by an intimate partner while in the process of leaving. Give your friends and family a heads up about your ex. Make sure you're never alone at the places he knows you will go to such as class or work. If you've got a car, keep it in the garage in case he tries to find you and vandalize it. Be ready to record any interaction or call the cops if tries to confront you and things get hairy, that's what they're there for.",
            "i'm so happy you dropped that leaching piece of shit. don't be surprise if the next few months aren't as rough as you expected them to be.",
            "There shouldn't be a thing as \"getting even\" in a relationship. Yeah it's a give and take and it SHOULD be balanced but you never ever hold that above someone's head unless all they do is take and never give anything back... Do not let anyone take you for granted. I am so happy that you got out of there and realized your worth. ",
            "I am so proud of you! I know this was all really difficult, but you are being so brave and so awesome. Just wanted to say congratulations on starting a new and FREE chapter of your life! ",
            "I'm so glad you got away from dipshit and now this begins a new chapter of your life stay vigilant. Just one thing be careful of your security deposit if you even have one make sure he doesn't destroy the apartment if he still remains there. Good luck.",
            "I'm glad you got out! That last phone conversation sounds a LOT like the conversations I had when I tried to leave (and eventually did leave) my abusive POS ex. You deserve better than that BS!",
            "I know you are really beating yourself up for being in an abusive situation for so long, but, oh my god, girl, you handled that ending SO well.\n\nMaybe you dont see it now, but it seems to me like you are stronger than before. ",
            "I was hoping you'd make an update post! I'm so happy for you dude! Way to go! And fuck him! Jesus he really went off the deep end when he couldn't control you anymore, huh!? I'm glad your family was so supportive. You rock!!!",
            "OP, I was in your same situation and I am so proud of you! This is a great update! Stay strong.",
            "You're awesome OP.",
            "I praise you on stepping up and taking the courage to leave. I'm proud of you. & you deserve better. \n\nAlso, you should be very careful of guys like that. You shouldn't absolutely shut him out, that's how some guys get stalker-ish and dangerous. \n\nPlease be safe.",
            "Cheers to the *new* you! ",
            "Good thing you ended it. Best case scenario for all parties",
            "Good for you, and you have wonderful parents.\n\nAnd don't be too hard on yourself.  Having a bad relationship in your early 20's is not an unusual thing.  Just take away from it all the warning signs you can now see more clearly, and know that when you find the right guy, you're going to appreciate him SO much more.",
            "You are strong and fierce and so capable. Don't worry about feeling responsible for any of it. It's over and good for you for moving forward. I don't know you and I'm proud of you. ",
            "You fell in love with this guy when you were younger and we're blinded by your care for him. He is obviously a person that takes advantage of others and has made you feel sorry for him when it should be the other way round. You took huge leap and I'm happy for you because of that, I hope you find someone better in the future and someone who will not use you, someone who won't abuse you. \n\nThis guy was just pure toxic, I would say you've dodged a bullet, but this fool has taken some time from your life. Still, the sooner you leave a negative situation, the better.",
            "Listen to me okay, none of this was your fault. You were in an abusive relationship and he had done everything in his power to string you along just enough to think it would be different in a weeks time. \n\nThe *only* reason he turned on the waterworks and flipped from angry to upset is because he now has to fend for himself. He no longer has you to do everything and pay for everything for him and he's freaking out about it. Chances are he'll have to go back to mommy and spin a massive web of lies about how much of a bitch you are and how you kicked him out even though he paid for everything. Just keep that in mind and be prepared in case anything like that happens.\n\nBe proud of yourself; you asked for help and got yourself out of that situation and you handled yourself so well when talking to him too. I hope life starts to get better for you now. It might be worth looking into getting some therapy too, you're still in the mindset of someone being abused and I think it would be good to speak to someone about it all. ",
            "Awesome update. CONGRATULATIONS!",
            "I would just like to say kudos, first of all. You got out quick, and that's incredibly admirable! Second, you have *not* permanently damaged yourself!! Abusive relationships don't happen over night. It's a gradual thing over a long period of time until one day, you just snap back into reality and think \"WTF is going on!?\" \n\nSpeaking from experience and two long term abusive relationships...there can be shame. The \"how could I have let this go on for so long?\" And a lot of people commented to me about why I put up with it or \"*I* wouldn't have stayed that long if *I* was treated like that!\" If you have those types of people, ignore them.\n\nIt sucks right now, but take the time to enjoy yourself and finding *you* again. That's the best thing you can do! As I said, you are definitely not damaged...if anything, you will come out of this stronger! As I like to joke with my now-husband (with as much sass as possible) *I am a strong, independent woman and I don't need NUNNA that!* lol It's a good motto ;)",
            "I'm proud of you OP! ",
            "You're so brave. Even though the next few months are going to be hard, you're so much stronger for this.",
            "Well done!",
            "Here's a hint that may keep you from having to get a new number if you're particularly attached to yours.\n\nUse Google Voice for your voicemail.  It has a blocking feature that once a person has called and it's gone to voicemail you can block their number with one click.  Once it's blocked from that point on whenever they call and it goes to voicemail they get a \"this number is no longer in service\" type message.",
            "GreenPurple.org is a great resource for dealing with financial abuse I suggest you check it out!",
            "If that phone call wasn't emotionally manipulative in some way, I don't know what is.",
            "I am so glad to hear you're safely out of there! Best of luck to you.",
            "Jesus how do these guys get awesome girlfriends? I must be in the wrong side of town or something",
            "Good for you! You absolutely did the right thing. You sound like a strong person with a lot of common sense. You are right not to believe his crocodile tears.",
            ">I can't help but think that I shouldn't have gone this far in the relationship and that I've permanently damaged myself.\n\nTherapist here. Permanent damage isn't all that common - counseling can help a lot of traumas. \n\n>I felt like I was getting bored just talking to him and wanted the conversation to end asap so I could watch Netflix.\n\nAnd there's your proof! You are understandably depressed and shaken up, but your brain is already headed down the path to healing.\n\nI recommend some short-term trauma counseling to help you process this experience and move on to bigger and better things.",
            "When I started reading your first post, I was honestly concerned you were dating my ex. Or you and I are alternate versions of each other.\n\nIt's SO FUCKING HARD to see the bullshit when you're in the midst of it. So glad you got out.",
            "Awesome updates! Congratulations on getting out, and good luck on the future!!\n\nHope the dipshit isnt damaging the apartment!!",
            "Are you concerned about him trashing the place?",
            "You definitely did the right thing. A toxic relationship can invade every part of your life and eventually your internal self and self worth. I commend you for being so brave. \n\nThat being said I think it's important to address his \"depression\". Now you know him better than me so you'd know if it was more of a plea then true. However, lack of effort or interest in things and anger issues are definitive signs so maybe talk to a friend or family member of his to make sure is he talking to somebody and have them encourage him to seek further help if needed. ",
            "I'm so Glad you got away from that asshat! I have an ex almost exactly like him but I kicked him out of the house we were living in as it was my dads rental house, he didn't fight me on it and went back to his moms. 3 weeks later she kicked him out to go live with his grandfather so he could get his shit together. Not surprised he still hasn't done shit with his life and still lives at home with his mom.",
            "If you tell your phone carrier you want to change your number due to harassing phone calls (which you are getting), they will usually always let you change your number for free.",
            ">He even claimed that he was \"just about to tell me that we're financially even now!\" What are the odds??\n\nHAHA what a fucking coincidence. What a dick.\n\nP.S you're amazing and strong and none of this is your fault xxx",
            "Good job!",
            "For the record, most cell phone providers will let you change your number for free if you're a victim of harassment. Call them and mention it and ask what they can do to help you out. If they can't change the number, they may be able to provide you with tools to block him from texting or calling you from his current phone number. You may also want to consider saving any threatening or angry voicemails he leaves you right now, as they may prove invaluable if you need to contact the police about him in the future if he continues to not get the picture. ",
            "I'm so happy for you! Good job doing what needed to be done. He's gonna beat himself for the rest of his life for fucking up what he had with you.",
            "Honestly I would text him back and have him admit to owing you XXXX number of dollars specifically.  \n\nAsk him to pay it back.  When he doesn't take him to court and use the admission of debt you received as proof.  Not that you would see the money, but vindication is nice.",
            "Us commenters are only thinking about OP,  not SO, I've done this,  op your relationship is ending due to stress,  not depression,  if he was depressed he would most likely suicide or not tell you and just do it when he feels like it.  You are unhappy because you two aren't a good match and haven't been for who knows how long. And due to him not maintaining the relationship,  but anyway he will grow up once he gets better,  and by you launching a vicious personal attack to him,  this proves that therapy can help you solve your problems with relationships.  So what you need to do is change things the right  way,  this is a good thing even though it is very emotional,  it is the right choice. ",
            "[deleted]",
            "I've had this exact situation before, it's no fun.\nApproach him, but be prepared, to have responses that are intelligent, polite, and fair to both.\n(Unfortunately, you should be ready to accept full responsibility)\n\nLet him know that you both have financial responsibility, seeing as you both stay together, use resources, etc. and that is should be 50/50 as far as bills/rent go.\n--Tell him you will not agree to live with him again unless he starts keeping up his fair share **immediately.**\n(No matter the outcome, **do not sign into a lease and allow him to live with you unless he signs his name onto the lease as well.**)\n\nIf I were you, I wouldn't let him move in with you again at all. All due respect to you, *he* sounds like an insufferable prick, who from what I can tell is irresponsible, childish, and potentially emotionally abusive to you. \nPersonally, I divert these types of people away from my life as much as I can, because they aren't worth the mental, physical, and spiritual energy. They drain that shit like parasites.\n\nI hate to tell you this, but I don't see any outcome other than you having to take on the whole swath of responsibility yourself. \nMy best advice would be,\na) Accept that there's no way around it.\nb) do anything and everything you can to get him out. If he doesn't want to contribute, he has no fucking business leeching your hard earned dollars being a bum. Ask guys you know well and trust to help you get him out, preferably have at least two show up, ready to boot this douche out the door.\nc) change your locks asap, preferably before b.)\nd) ask somebody you know well and trust to stick around a lot, or move in, to deter this dude from stalking you\ne) get a restraining order\nf) On your next lease, (hopefully a decent distance from where you currently stay) consider moving in with a close friend as opposed to an SO.\n\nI hope you don't take my advice as rude in any way. It was my honest and thorough advice based on my own direct and very similar experience, and I seriously hope you carefully consider it.\nIf you'd like to speak further with me, feel free to reply or PM me anytime!\nGood luck and best of wishes!",
            "These kind of posts really wind me up tbh. I read your original post and thought \"why the fuck are you with this guy\" after the first line. Then you gave 100 more reasons to run for the hills. It's not rocket science. Did you really need a bunch of internet strangers to tell you that your Boyfriend is an asshole? A 2 year old could have told you that. I actually doubt the legitimacy of posts like these.  ",
            "Good on you for getting out and everything - and I am sure that you did the right thing. But the idea of my girlfriend breaking up with me, and me talking to her on the phone about it after she just leaves without notice and her being cold and basically not listening to me when I'm trying to talk to her sends a shudder down my spine. I honestly think that would be my worst nightmare - to find out that my SO just doesn't care anymore. \n\nI don't know you and your relationship, but if it were me, if I was gonna break up with someone, I'd accept that you have to deal with the emotional response of the person you're breaking up with. In fact, I'd say you're kind of obligated to. OBVIOUSLY I am not saying to fall for any abusive tricks etc, but at the decency to give someone you loved and who loves you the closure they need is important, I think."
        ]
    },
    {
        "post_id": "2le8dq",
        "author": "ditchtheringthrowawa",
        "title": "UPDATE: My [27M] girlfriend [23F, 3 months] still wears the \"promise ring\" she got from her ex. Is this weird?",
        "url": "https://www.reddit.com/r/relationships/comments/2le8dq/update_my_27m_girlfriend_23f_3_months_still_wears/",
        "score": 2650,
        "num_comments": 314,
        "created_utc": 1415215508.0,
        "selftext": "[Original Post](http://www.reddit.com/r/relationships/comments/2kwtvj/my_27m_girlfriend_23f_3_months_still_wears_the/)\n\nWell, I brought it up to her again that it made me uncomfortable.  She used her usual excuses \"i'm used to it\" \"it doesn't matter who it's from \" and all the other crap.  I took most advice and brought up the idea of a new ring.  Nope, not an option.  I maybe got a little more angry than I needed to after that, or stressed, I don't know.  Anyways, she began crying, a lot.  And then the apologizing.  And then the \"I'm sorry, I'm still in love with him\".\n\nand then awesome fucking truth where she told me she has been sleeping with him the entirety of our relationship (she never stopped sleeping with him after they broke up).\n\nPeople really suck sometimes. \n\nEDIT; I've seen this asked a few times - yes they are ACTUALLY broken up.  They used to live together and they no longer do.  They are never together in public.  He also has a new girlfriend. \n\n\n---   \n**tl;dr**: (ex)girlfriend wouldn't take off her exboyfriends ring even though it made me uncomfortable, turns out it was because she was still in love with him/sleeping with him. awesome. ",
        "permalink": "/r/relationships/comments/2le8dq/update_my_27m_girlfriend_23f_3_months_still_wears/",
        "comments": [
            "At least you figured it out relatively fast. \n\nIf you didn't press her about it, you might have stayed with her for another 6 months or a year, with her sleeping with her ex the entire time. \n\nJust move on, try to forget she ever existed, and remember that just because she is a lying, cheating bitch, not all women are like that. \n\n",
            "get an STD test!!!!!!!\n\n\nsomeone else posted about telling your friends of her misdeeds.... You could just talk to them about what you're going through (an STD test) and the reason why you're taking one (your GF potentially introduced shit to your junk through her ex and who knows what he also tapped)\n\n\nIt keeps your friends in the loop regarding your life (isn't that what friends are, people who care about you and your life?) and would be a testament to the shit she has made you endure. It would also be effective at convincing them that she wronged you and all...\n\n\ngood luck OP",
            "God damn!  We'll good ridance in that case!  Be glad you're rid of her now rather that when you're even more commited.",
            "> He also has a new girlfriend.\n\nDid you tell her? I would tell her, because that's a really fucked up thing your ex did and that other poor girl deserves to know.",
            "Wow. That is completely heartbreaking and yes, people really suck sometimes. \n\nOn the bright side you now know the truth (lots of people don't even get that!), and you can cut her out of your life since she doesn't seem to even think about trying to fix herself or the situation. Seems like she intended to continue this way and continue disrespecting you and your relationship. \n\nStay strong, it's going to be tough. But in the end you will be better off. ",
            "I'd get some STD tests.",
            ">she has been sleeping with him the entirety of our relationship (she never stopped sleeping with him after they broke up).\n\n...Wait, so are they actually broken up?\n\nRegardless, that really fucking sucks, man. I feel for you. Better luck finding a fish who's not already caught fast by another hook.",
            "If you never stop sleeping with your ex, are they really an ex?",
            "Well shit. Sorry to hear that man. But you'll get through this. Don't forget to get tested. Best of luck.",
            "I'm so sorry, dude. You really dodged a bullet there, as much as it hurts now just keep reminding yourself that she clearly wasn't the person you thought she was, and losing her is no real loss. ",
            "Awh, man. I'm sorry, OP. That had to be horrible. \n\nPlease tell me you two aren't going to try and \"work things out\"?",
            "Get in touch with his GF if you can. Oh what a piece of crap they both are. ",
            "Putting your foot down in situations like this is the right thing, regardless of how it feels.  3 months isn't much of a loss in retrospect.",
            "[removed]",
            "Human behavior baffles me.  If you're sleeping with an ex for months on end while you are dating someone else, what exactly is the point of the new relationship? Why even go through with a new relationship? My brain literally cannot comprehend these kinds of behaviors.  It is so far beyond the scope of my experience that I cannot understand it.\n\nI'm sorry you went through this OP.  At least you found out early in the \"relationship\", I guess.",
            "Get rid of her, and all of her memories now. She is useless. Literally a scumbag, why would she drag you into this. What a bitch* ",
            "Tell his gf as well. She needs to know that he has been cheating on her as well. ",
            "It sounds like she was cheating on him with you, though you didn't realize. It sounds like she also doesn't understand what a promise ring means. I think her boyfriend would be interested to know about you. I encourage you to tell him.",
            "I know it sucks now, but you've got a hell of a story to tell for decades. And in the end... isn't that whats important?",
            "I'm so sorry! That sucks :(",
            "fuck dude I am so sorry. glad you figured it out sooner rather than later, but that really stings",
            "Fuuuuck. Sorry dude, that sucks. At least you found out about it though. Who knows how long that could have gone on?",
            "Sorry that happened to you bud. Similar thing happened to me with my ex-fiance. Know that you're not alone and others have felt the same way as you are feeling right now. Time will make things better.",
            "Bitches be Crazy!",
            "Well that escalated quickly. ",
            "Yeah sorry man, you are better off without her. My ex of 6-7 months still wears a necklace i bought her. This is a good 8 months after we broke up...little freaky.  ",
            "I feel sorry for you and his new girlfriend, that behaviour is disgusting :(",
            "That fucking sucks big time and I feel for you man. This is why people shouldn't jump into relationships when they're not ready or they just end up hurting everyone involved.\n\nChin up bro, stay awesome and you'll attract more awesome people. You don't deserve this crap.",
            "[deleted]",
            "Tell his new, soon to be ex, girlfriend.",
            "I literally jawdropped reading this.  Holy shit dude I am so sorry.",
            "Well her and her ex sound like they are perfect for each other. Maybe you should ditch her and take his new gf and let those two assholes live unhappily ever after.",
            "She is your ex now, right?",
            "At least it was only three months! Some people, man, shit is fucked up. ",
            "Dude, I'm so fucking sorry. Seriously, fuck her. You can do so much better than that piece of shit. ",
            "Good on you OP for following your instincts on this one. Now you're only out three months, consider yourself lucky. Now, go get tested already, you're way overdue.",
            "I hate her so much for you right now.",
            "Im sorry dude. Try to take the positives out of this and be stronger. Be thankful you found out now and not in a year! Go out and live life my friend",
            "Wow... I'm sorry man, that sucks. \n\nLuckily you found out this early in the relationship though. You'll bounce back OP.",
            "Bro it sucks, but good job! Proud of you. 🙋",
            "Ouch dude, that's just cold blooded. More fish in the sea, but more importantly, way more respectful and mature fish in the sea.",
            "Wow",
            "Her loss dude. There are pleanty of better girls than that that will be loyal to you. Stay confident and you'll find someone. ",
            "People suck. I'm sorry man",
            "Well, you learned that your gut feeling is correct: when something seems off, it is. Three months is a significant amount of time to get to really like someone, but thankfully, it's not too much time to get attached. Consider this a solid learning experience, and keep looking for the lady who wouldn't dream of that. Like, perhaps, someone your age, and not a child? ;)",
            "Man I'm sorry. I hope you let her go. You were just a rebound. ",
            "Good riddance to bad rubbish :(",
            "Yes. Abandon ship.",
            "3 months in is better than 3 years. Chin up. She's got unresolved issues with her ex, you don't need that burden.",
            "Shit, sorry dude. Glad its out there though. Eyes on the horizon, keep on trucking.",
            "Welp. Good job handling your shit and not being walked all over. ",
            "Phew...I first read that as a 3 year relationship...I can't imagine someone sleeping with their ex that long. Good thing you know the truth now",
            "Aye man shoutout to you for not ignoring that shit and facing it like an adult",
            "I'm thinking the ex wasn't ever an ex. I'm thinking she cheated on him with you. \n\nI'd ask that dude if he knew you two were together. ",
            "Wow. Just reading the title I would have never guessed. This is the sort of thing I wouldn't even care about. You've got me paranoid.",
            "At least you dodged a bullet, OP. It stings now, and she is a terrible person, but imagine if you never brought it up and it kept going on. Good job sticking to your guns.\n\nNow go to the gym and get jacked like many of us men do after heartbreak.",
            "Better to find out after 3 months, bullet dodged. Sorry you had to go through this OP but stoked you didn't waste anymore time with her. ",
            "Ugh. Three months wasted. Fuck her. Lucky it wasnt more. Ive been here before and it is hard to believe it was any more than a lie. People suck sometimes.",
            "i dont get it. Why not just break up with you and his gf so they can both b together? obviously they are still obsessed with each other since they r still fucking behind u backs.",
            "Congrats on finding out! Now you can move on with your life!!\n\n",
            "You didn't fail. She did but after trusting your Judgement and pressing for more information you have your truth. I'd rather have bitter truth than happy make believe.  This is a new opportunity to get a more worthy human being to love. ",
            "Damn. That bitch is ice cold. Good for you for going with your gut and getting out before it got too serious! \n\nHey -Make sure you get tested just to be safe so you don't get stuck with a nasty souvenir of a shitty relationship. Good luck moving forward, man. ",
            "Ah that sucks. You should get tested soon. Try to steal the promise ring from your girlfriend and destroy it. Revenge time!",
            "Yeah bro. Life lesson. If you get with someone who just got out of a long term relationship, youre gonna be a rebound. Either take that and fuck them or don't get attached.",
            "Fuck that bitch.  ",
            "Well, a promise is a promise...",
            "Not going to lie, whenever I hear about stuff like this I always hope he tells the guys girlfriend that was also cheated on. I always hope to see him confront him in public with his girlfriend and then walk away with the girl the guy cheated on.",
            "A promise ring is a very serious commitment.  If shes still wearing it that means that shes still holding on to him in some way or another. It does absolutely matter who the ring is from. Its like being divorced but still wearing the wedding ring. A promise ring is basically a commitment to stay faithful and basically a promise stating that \"I will wear this ring until you propose\" you need to tell her that it makes you feel extremely uncomfortable and you really dont appreciate that. If she doesn't have the morals or respect to do something about it then that alone should tell you what to do even though it might hurt you. Definitely red flag. I hope everything works out though!!",
            "Tis the difference between a 23 year-old an a 27 year-old that is vast. I dated an early twenty-something once. Twice actually. It was awful.",
            "My ex tells everyone I'm an evil, terrible abuser, she had me arrested even though she assaulted me and moved the guy she was fucking behind my back in while my bed was still warm. But she is still wearing the fucking emerald ring I gave her! People do truly suck. You're better off without her, as much as it sucks. Now you are open to finding someone who will appreciate you.",
            "I'm about to go on a second date with a very beautiful girl, and this is not the thread I should have clicked on.",
            "Ugh. I am sorry. This totally sucks but you'll get through it. ((Internet hugs))",
            "What a fucking cunt. ",
            "THis may get buried, but I still wear a promise ring my ex got me. I wore it for two years and I just really like the ring in general and I'm sort of attached to it. Not my ex. It's not a diamond, so maybe that's different and I don't wear it on my ring finger but on my left hand. I have 0 feelings for my ex but after wearing this ring for like 4 years now, it isn't going anywhere. I feel naked without it. ",
            "Yikes. I'm so sorry.",
            "People really do suck sometimes. But aren't you glad you figured out how much this one sucked before getting too involved? ",
            "Its a shitty situation but on the bright side you didn't end up wasting years on a woman not worth your time.  But to be on the safe side you should get to the doctor and make sure she didn't leave you with any lasting gifts. ",
            "=/ sorry to hear that, at least you know 3 months in and not any longer like what the other comment-ers have said otherwise it would suck alot more.",
            "That is completely stupid, i pity her like i would pity a rat being squished.",
            "I'm sorry OP. :(",
            "What a piece of shit. Good riddance. ",
            "Then why not fucking date him instead?  He is fuckable but not dateable?  This doesn't seem so true if she says she is still in love with him.  This seems so confusing.  Sorry man :(",
            "That's a bummer man. But be glad you found out sooner rather than later. Not sure how vested you were in this relationship, only after 3 months, but be glad you found out now.  \n\nAlso, I'd be concerned whether about your health being put at risk, if she was sleeping with both of you during the course of your relationship.",
            "Sucks, bro.",
            "What a horrible human being ",
            "OP, I commented on your previous post, not realising that you had already posted the update.\n\nThat said, I'm so sorry that this is how it turned out. I'm sorry for you that most people here were right in telling you that she was definitely not ready for a new relationship. It wasn't \"just\" a ring, after all.\n\nI hope you can find solace in the fact that at least you didn't give her more of your precious time-- time that she did not deserve. I wish you the best and hope everything gets better for you. Once again, good luck!",
            "Sorry bro. :(",
            "that would be called baggage.  ",
            "That REALLY sucks! ",
            "I'm not sure if anyone has said this yet, but if you can tell her ex's new girlfriend. \n\nIf she doesn't know, she deserves to. Someone should tell her.",
            "Yes -- very weird.",
            "i'm so sorry",
            "Wow what a cunt.",
            "What a bitch. Sorry OP, but I'm glad you dodged that bullet.",
            "Cant do much for you, but here have an imaginary internet point.",
            "You done burst the Hoover Dam of truth. And tears, actually.",
            "I know it's something a lot of people think is overstated, but get tested man.\n\nShe has proven to you she can't be trusted. There is no reason to believe her sexual history or her ex's history can be trusted either. Not saying either one of them sleeps around a lot but why take the chance?\n\nStay safe brother. Best thing is to just move on.",
            "Yes. It is weird. \n",
            "You deserve better ",
            "That sucks",
            "I'm not sure how much more obvious it could have been that she hadn't let go of him yet.\n\nSucks to be you for finding it out the hard way. At least you'll see it coming next time, RIGHT?",
            "What a shitty, terrible human being. You're better off without her, op. It might take a while, and that's fine, but before long you'll realize that someone who was willing to betray your trust in such a significant way is not someone you need to have in your life. My girlfriend recently left me because she was cheating on me as well, so I know just how bad it sucks, but keep your chin up, we're here for you :)",
            "Weird thing is every time I hear about someone wearing one (including my own friends) it always turned into them using it to hide sex.   \n\n",
            "Bitches. Pfft.",
            "Shes banned for life!",
            "Stay strong but realize that this discovery saved you from even more heartbreak down the road. Chalk it up to experience and open the next chapter in your life. ",
            "I feel for you, OP.\n\nI really do. \n\nYou have to be so careful with everything about these kinds of people. More often than not they aren't looking for a way out of their mess and they don't care if they wound others with it.\n\nGlad you're rid of her. Be careful out there, don't let this affect your outlook on future dating prospects!",
            "Message that fucker's girlfriend, she's being cheated on too.",
            "She's a piece of selfish shit. Go find 1 out of the billion or so cool chicks out there that are worth your attention.\n",
            "I'm sorry man but way fucking DUH!",
            "ugh. good riddance. Sorry you had to go through this. onward and upward.",
            "Yo dude. You are going to be a very tough son of a bitch someday.",
            "Yes",
            "Whaaaaaaaat???? All this from just questioning a ring on her finger, and it leads to this?! Holy fuck, that did escalate rather quickly",
            "Two tears in a bucket. Mother fuck it.\n\nP.S.: get tested for the bug. ",
            "At be worth telling his girlfriend too since its not fair to her to be a part of this ",
            "Holy shit......\n\nYea get tested and let his supposed current girlfriend know too. Damn son.",
            "What a huge train wreck",
            "What a fucking bitch. Sorry, it's a sad situation, move on! ",
            "Wow.  Ok, before I noticed it was updates, my first question was \"Is it a nice ring?\" then, \"Does it really mean it's a promise ring?  Are you getting some?\"\n\nSo... it's all a disaster and she's been cheating on you.  I'm sorry OP.\n\n:(",
            "Ask her what she thinks of the concept of a promise ring. If she thinks it's stupid, she's probably just wearing it because she likes the ring.\n\nYes there are a lot of holes in my logic. Just accept it.",
            "People can be shitty.  Don't surround yourself with shitty people, and don't hesitate to cut them out of your life when you discover they're shitty.",
            "Holy fuck. Hugs, bro. I don't know what else to say. Fucking.. Yeah... Hugs.",
            "FDB!!!!!",
            "well tell her that she should be happy now that she can officially be his new side-piece.  They're perfect for each other.\n\nThere's a ton more mature, beautiful and amazing women out there that deserves good relationships and guys like you.  So don't be hurt or jaded from this... there's good girls out there just like there's good guys.",
            "You're lucky she had that goddamn ring lol.",
            "Dammit all to hell. Why do these almost never turn out to be innocent misunderstandings?\n\nMake sure the other man's girlfriend knows.",
            "Wow, you didn't know or had a feeling? Any red flags throughout the 3 months?",
            "Are you going to tell the new girlfriend that her boyfriend is cheating on her?  ",
            "I feel so fucking bad for you man. I hope you are doing better now. I can't believe someone could do this. Fuck.\n\nI'm here for you <3",
            "She is a terrible person. ",
            "Same exact thing happen to me. I feel for you bro",
            "Don't worry.  That just means you don't have to date a trashy cum dumpster anymore.\n\nForget her and more on.  Sluts like that aren't worth anyone's thought.",
            "I still wear a necklace i got from my ex and ive been dating my current gf for a year.\n\nFunny story, i used to wear a necklace that i got from my double ex while i was dating my current ex. 4 years into the relationship she asked me where i got it and i told her and she immediately bought me a new one because i wouldn't take it off. A year later we broke up.\n\nMy double ex of 4 years bought me that necklace for our 3 year. And about a year after that we broke up.\n\n\nMoral of the story. The necklace seems to start the countdown.",
            "I hope you took her promise ring off and shoved it down her piehole. ",
            "I was in that girl's position once.  It sucks, because she is completely twisted around her ex's finger.  She probably thinks she can win him back or is getting some special attention out of it, and she definitely doesn't give a shit about his new girlfriend.  Still pretty shitty that you got cheated on.\n\nIt doesn't excuse what she did, I just wanted to offer some perspective.  She's definitely being manipulated by her infatuation and desperate need for his attention.  She obviously made a mistake by getting into a new relationship.",
            "I feel bad cause I am like the other guy, but usually ignorant about the other person. The girls are obsessed with me. I don't know\n",
            "Trust no bitch.",
            "[deleted]",
            "Holy shit. Women can be the worst sometimes. We've all felt heartache and that same deep, sick, nauseating feeling in the pit of your stomach that you have right now. Just remember, it can and will get better with time. Chin up, move on and focus on making yourself better and happier and the rest will come. I used to have a terrible problem with relying on women to boost my own self confidence and it always ended with depression and addiction. Now I just workout, make myself look good and feel good and the rest falls into place. You'll make it through this, brah. Good luck and cheers!",
            "I love updates :) Unfortunately, the previous post didn't have much responses, so not much to glean.\n\nNeverfart 3 points 4 days ago \n\nI just want to say...I still wear a piece of jewellery from my ex. it's a 'love bracelet' so in a way it has even more sentimental meaning, but to be honest with you I **just really like the bracelet itself more than any other reason.** I have been dating someone new and they asked about it and I gave pretty much the same answer as your gf. I just really like it. it's a nice piece of jewellery. I know it's hard to understand but it's probably true. **if she didn't try to hide it...it's a good sign.** sometimes it's quite good to show you're the bigger person in these kinds situations. your gf will appreciate you that much more. just the right amount of caring/jealousy and not too much paranoia...\n\n\ntoblercity 1 point 4 days ago \n\nOf course it's okay for you to be upset, that's how you feel. But does she know that? Maybe she thinks it doesn't bother you so she continues to wear it. Besides, **at least she's open about where it came from and not trying to hide it's origins from you.**\n\nOR you could wait til she's having a shower and then get mister hoover out :P I jest, I jest! Just talk to her about it.\n\n",
            "I feel bad cause I am like the other guy, but usually ignorant about the other person. The girls are obsessed with me. I don't know\n",
            "[deleted]",
            "My boyfriend of 4 years wears a black ring that his ex gave him, it's nothing special but at one point his ex meant something to him and I respect that. I normally wouldn't think it was that big of a deal. But I was actually wondering if maybe you both rushed into this relationship a little too fast after her getting out of a 5 year partnership. You've been \" talking \" for 10 months and that was a few weeks after they split up. That is way too fast. She can't help the way she feels, back off and give her some time. "
        ]
    },
    {
        "post_id": "43gwdk",
        "author": "Throwawayavegan",
        "title": "Me [29F] with my vegan coworker [29F]. I don't know how to deal with her.",
        "url": "https://www.reddit.com/r/relationships/comments/43gwdk/me_29f_with_my_vegan_coworker_29f_i_dont_know_how/",
        "score": 2654,
        "num_comments": 328,
        "created_utc": 1454201814.0,
        "selftext": "Update from here:\n\nhttps://www.reddit.com/r/relationships/comments/42vdem/me_29f_with_my_vegan_coworker_29f_i_dont_know_how/\n\nSo the meeting happened on Friday. HR lady was a very much a \"let's all get along\" type and very enthusiastic and eager to mediate with buzzwords and talk about feelings.\n\nHR contacted me and I told them to get Vegan's perspective first so that she wouldn't complain not getting a chance to get her point of view. \n\nSo Vegan, boss and HR had a meeting. I'm pretty sure Vegan made it seem like she had been bullied which was pretty much what I was expecting.\n\nThen the rest of us were called into a meeting with HR to give our points of view.\n\nThe coworker who was a cancer survivor had gotten progressively more annoyed at what happened after the meeting with Vegan taking off so I told her she was welcome to take the lead in the meeting because her issues could have had an actual health impact. \n\nShe took up most of the time actually talking about how Vegan kept giving her unsolicited, medically unsubstantiated advice on cancer treatment and prevention and HR and boss started looking uncomfortable and concerned. A few other coworkers- like the one with coeliac especially also mentioned unsolicited advice.\n\nThe my Peruvian coworker brought up cultural insensitivity and the eating your pets comment and I didn't know Vegan said this to the Hindu coworker but apparently Vegan had told Hindu that veganism would make him a better Hindu because it eliminated all animal cruelty or something.\n\nA few people started laughing at this and one coworker joked that Vegan was like the vegan Amway- always selling something that nobody was interested in.\n\nSo I'd been pretty quiet at that point and HR asked me, why I had asked Vegan to only speak about work related matters and I told her that I'm a hunter and briefly explained that I believe in ethical hunting and how it befitted endangered species etc. But Vegan kept on calling it murder, had a dig at me for my leather skirt even though other people here had leather shoes, leather handbag and HR injected that her Filofax was real leather and I told her the talking to Vegan was stressful and demoralizing and she'd refused to respect my boundaries when I asked her on other occasions to keep things work related.\n\nSo then the \"mediation\" begun and Vegan was brought in and other coworkers left. I basically said exactly what I'd said before to Vegan with HR and boss there, that I respected her lifestyle choice and how passionate she was about making a change but I disagreed with her on certain pointed and even if she didn't agree with my lifestyle choices, it was unfair of her to single me out or harass me about them.\n\nVegan said that to her, what I was doing was morally unconscionable and she didn't believe in exploiting animals.\n\nI told her that her iPhone, her clothes, her computer were all produced via human exploitation and the quinoa that she loves so much has affected local income farmers in Bolivia but.. and then I qualified I told her it was great that she had her thing to try and improve the world but I also had a different perspective and different issues I was more passionate about and that I had respected her point of view and she should respect mine. \n\nVegan's response to all of this was \"it's still murder\". HR looked annoyed at this point and said that Vegan was not trying to find a middle ground.\n\nSo I turned to HR and said that this was why there was no middle ground and that's why I thought keeping things civil and work related because in the end we are here to do a job.\n\nHR agreed, boss agreed, I agreed, Vegan grudgingly agreed and HR wrote all this down and I had mediation meeting minutes saying all of this emailed to the 4 of us.\n\nAnyway, boss called us into a meeting around lunch and said it was a good that we were able to talk about things outside of work because it's good team bonding but \"it had come to his attention\" that there was unsolicited health advice and cultural sensitivity issues in the team we'd be discussing that in our next team meeting and we'd had a productive session but needed to focus on work and keep our spirits up. \n\nVegan had a meeting with boss after that and then went home early.\n\nWe had to come in on a Saturday and today end of month stuff (this happens when the end of month falls on a weekend- I'm in finance) but we get time in lieu.\n\nI just gave Vegan a cheerful good morning to which she didn't respond and when she said handed me a file and said she was leaving, I just said thank you for your work today and enjoy the rest of your weekend. Vegan kind of just grunted at me and left.\n\nI'm just going to keep it civil like HR said and Vegan and dig her own hole. I still feel a bit sorry for her, I still think she feels attacked but at least it got her off my back for the time being. \n\nTLDR: Vegan was told formally by boss and HR to keep things work related and civil.",
        "permalink": "/r/relationships/comments/43gwdk/me_29f_with_my_vegan_coworker_29f_i_dont_know_how/",
        "comments": [
            "[removed]",
            "OP: \"Please stop attacking and insulting me.\"\n\nVegan: \"How dare you bully me!\"\n\nGood lord.",
            "Her behavior has nothing to do with being vegan, and 100% to do with being an obtuse bitch. You handled this really well. ",
            "You did everything 100% right.\n\nI'm a vegan, and I'm not vegan *enough* for a lot of other vegans since I'm fine with my wife not being vegan and cooking with the same pots and pans (that we wash!).  I don't get it.  We're all doing our own thing here, and we're only responsible for ourselves (and underaged kids if we have 'em).  We all have our good qualities and setbacks.  I don't agree with the judgmental bullshit.",
            "That was very professional of you. And it shows you are a good person when you still care about her feelings despite the obnoxious stuff she's done. Hopefully she'll learn that she isn't the only person with beliefs and keep that stuff to herself.",
            "She's under the microscope now, and she knows it. Continue to be polite and keep all interactions as professional as possible on your end. She may come around and behave like a civil person, or you may have to start documenting when she starts back up again. Hope for the best, and prepare for the worse, but I truly hope she'll mellow out in a week or so.",
            ">Vegan kind of just grunted at me and left.\n\nI love how unless she is allowed to give gratuitous advice and criticism, she can't actually just exchange the usual meaningless pleasantries at work.",
            "Sounds like you are doing your best to be a professional. Your hunting, or use of animal products is not abnormal behavior, as long as you aren't shoving it into other people's faces, which you aren't. Vegan seems to have the inability to keep her preferences from keeping her not only professional, but civil as well. Keep your calm, and keep professional. Be yourself, but keep conversation at work aboit work. Vegan will not last if she cannot do the same. Good luck, bring me some back straps. ",
            "(Repost lol) I don't know if you have seen The Simpsons, but there's an ep (Lisa the Vegetarian) where Lisa became vegetarian after she found hypocritical she pets a baby lamb in a farm and then eat lamb at dinner. She suddenly started to be critical with everybody who didn't agreed in stop eating meat to the point she ruined Homer's bbq and didn't feel remorse about it. It wasn't until Apu (who is a vegan) told her he learned to tolerate others rather than forcing his beliefs on them. \"You know you can influence people without badgering them always\". So the ep ends with Lisa apologizing with Homer. Of course, Lisa is still vegetarian as promise to Paul McCartney.\n\nIt sorta makes me think someone should tell to that girl (again) that is pretty counterproductive her attitude against other people that don't think like her. But its obvious she doesn't WANT to change and you can see that with her comments (Specially the \"better Hindu\" thing. WTF? ). \n\nKeep going on keeping the work attitude as best as possible. Wish you good luck.",
            "Of all the meat eaters on the planet, it's the hunter that is the least hypocritical  of all. Everyone else can pretend their meat is a product, not a dead mammal.",
            "Sounds like the mediation went well. She might continue treating you with that huffy silent treatment, but if you keep treating her positively as you are about work only, I believe she will come around to at least treating you professionally.",
            "As much as her behavior is juvenile and wind, I'm glad she was dumb enough to keep it up at the meeting with HR.  No \"he said/she said\" here, she dug her own grave.",
            "Lol how hasn't she been fired yet?",
            "[removed]",
            "[deleted]",
            "Amazing bit about the iphone etc.  Air high-five to you.  ",
            "[deleted]",
            "I'm glad the world still makes a little sense.\n\nIf they hadn't been on your side, I think my head would have exploded.",
            "Well, that's a shame.\n\nI commented on the last one about how Vegan was at a crossroads and could either see that it was her actions causing her to become left out/ making people not like her, or convince herself that it's because she is Vegan. \n\nIt looks like she's choosing to convince herself that it's not her fault.\n\nShe still has a chance to turn herself around... but it gets harder once the delusion has started setting in.",
            "*sigh* She gives vegans (and vegetarians) a bad name.\n\n\nI was vegetarian for over 13 yrs...and I NEVER badgered anyone about their food choices. I had meat thrown at me, had an ex-boyfriend try to slip meat to me via kiss, had people lecture me about health issues and the food chain...all unsolicited. There are people out there who just cannot deal with people making other choices than their own. It is surreal.\n\n\nGood luck...and please know that not all vegans/vegetarians are like this. Most of us are pleasant and just don't want to be badgered either. :/",
            "My office mate is vegan and I am a big meat eater. \n\nWe talk about food together and our differences in what we do or don't eat is a complete non issue. \n\nBecause of that, I am inspired by her to try to eat more veggies and cut back on the meat and dairy, because her meals sound so delicious! \n\nYour coworker has not inspired anyone to do anything positive in that regard and is giving a bad name to vegans.",
            "As a teenager I thought hunting was bad, until I realized that hunters don't throw live baby chicks into meat grinders, and it really does diversify your protein intake and cull overpopulation. I don't always agree with hunting predators, but I feel like I'd rather eat meat from hunters than from big agri-business. Most hunters I know practice ethical hunting (many don't even use guns, only crossbows or bow & arrow) and nothing--NOTHING--gets wasted, not to mention family and friends often get a share.",
            "It's astonishing that she's almost 30 but still hasn't figured out that at work you keep your mouth shut about your personal moral compass unless it's somehow directly relevant to your job (and I imagine that occurs rather infrequently). Everybody's just there to earn a buck and get their rent paid, not to be lectured by some unqualified, soapbox-jumping ass.\n",
            "I have a feeling Vegan will find herself looking for a new job at the rate she's going. If you can't admit you've created a tense situation and move forward the work environment becomes too difficult to work well in. I'm glad you were all so proactive about communicating clearly throughout and with HR in the end, it's important to feel safe and comfortable in the workplace.",
            "Can I just say I love how we're calling her \"Vegan\"? This is awesome",
            "> I still feel a bit sorry for her, I still think she feels attacked\n\nDon't feel sorry for her. None of this is anything but entirely her own fault, and her *feeling* attacked has no resemblance to reality.",
            "It's okay to have your feelings hurt. Instead of moping around and getting more defensive, what Vegan should have done is move forward and learn from her mistakes. \n\nI'm vegan, too, and this is entirely inappropriate. Sure, I wish animals didn't have to be killed or go through unnecessary pain, but unless the other person wants to engage in the discussion, you're only pushing them away from your cause. And for that matter, ethical hunting is incredibly better than getting products elsewhere. When you see progress, you should be happy. Although she's probably stuck in the mindset where any and all animal exploitation is immoral. I don't necessarily disagree, but it doesn't do us any good by having vegans become unsolicited preachers. ",
            "Document every negative interaction you have with her. Dates, times, details, witnesses if possible. Chances are decent that this is not the end. I am going through something somewhat similar at the moment, and I'm pretty sure we're in the same country. Luckily my boss is on my side so every time I add to the list I notify him and he acknowledges it. When someone is making up negative bullshit about you to HR in this country, having a huge book of evidence goes a long way toward exonerating yourself. This is what your coworkers did for you in this first instance. Had they not been there, you would have been at least partially smeared with the bullying brush. Keep your dicks in a row. ",
            "Good job, just keep up what you're doing.",
            "I'm chiming in as a vegan here. On the one hand, I hate the argument that comes up when vegans and omnivores debate of exploitation of other people. It goes nowhere. \n\nThat being said, what she has done is completely out of line. It's one thing to talk about your beliefs *if someone asks about them specifically*. But when she goes out of her way to belittle you, that's definitely crossing the line. Granted, I'm no fan of hunting either. But it seems like you're not boasting about your catches or the hobby itself, so it shouldn't give her the right to talk down to you. \n\nI'd prefer us vegans to stick together, but some make it so difficult. You handled the whole awkward situation well. Kudos.",
            "My hat's off to you, OP.  Handled like a pure champ.  Don't change a damn thing in how you're handling it.",
            "I think the fact that you still feel slightly sorry for her in this situation speaks a lot about you. Obviously she's been upset about this all and I think it;s awesome that you acknowledge that while recognising that the reason this situation occurred has been due to her actions ",
            "Typical vegan.\n\n_kidding_ I know plenty of rational, respectful vegans. \n\nThe woman sounds like a crazy town. She's using being a vegan as a front for being obnoxious, she _wants_ the drama. ",
            "Fuck that bitch for telling your Hindu coworker who only has milk, cheese, and honey that he isn't being a good enough Hindu. I hate calling women bitches, it's so fucking derogatory but WTF!?",
            "Don't feel sorry for her. She is choosing how she acts.",
            "As a manager with a large staff I appreciate how you've dealt with this whole thing. Polite, not pandering and goal focused. Good on you. ",
            "I think this was the best of all possible scenarios, given how unyielding your coworker has been. \n\nStill, I wouldn't be surprised if she found a new place to work soon. Hopefully she has learned her lesson and will keep her advocacy to her private time. ",
            "You and your workplace responded well.  Vegan is now cornered and must behave by human standards in the workplace.\n\nIt's not cool, though, that Vegan is costing the workplace weekend pay and gets to go home early on two days.  I hope it comes out of her sick leave.",
            "its people like that that give 'vegan' or other dietary choices a bad name, you handled it well! ",
            "I'm just LOLing that she tried to introduce someone who I am assuming is from an Indian ethnocultural background to vegan / vegetarianism, like it'll be new to them.",
            "She feels attacked? yet she is cool with attacking everyone in the office on their lifestyle? boooooo!",
            "If she wasn't a vegan she'd be something else that would justify being a bitch to everyone. ",
            "I knew girls in college like her, they remind me of the \"snide hippie girl\" meme. Lol. But at 29 I'm amazed she hasn't either outgrown this phase or gotten a rude wake-up call prior to this. Sounds like you all handled it well, and it ended up the only way it could when you're dealing with an extremist. I would be really surprised if this situation is over, though. I hope it is, obviously, but I'd be wary of reprisals or backsliding into annoyingness. Good luck. ",
            "Vegans like her give all vegans a bad name. The same way there are ridiculous conservatives and liberals, vegans can also be over the top. I'm vegan and I don't do this shit...",
            "She will probably get fired soon. ",
            "Super professional. Very proud of you OP",
            "The boss and HR were right. It's good you kept your cool and spoke your mind. Most jobs will let you do that. :)",
            "Everyone passionate about something needs to learn to temper it at some point. It is not socially acceptable for me to tell everyone who doesn't like football (soccer) that they are wrong or that they should find something better to do like football on the weekend. \n\nJust because her actions may have a tiny net positive on the planet does not give her a right to try and convert other people to that.\n\nFor you directly though, you'd be amazed at how few people understand that conserving animals can and does involve killing other animals, even the cute ones.",
            "Having quietly lurked through both your posts with very little to add, let me just say, everything about the way you handled the situation, the points you brought up, the way you live life, has been fascinating to read about; just brilliant. You sound like an interesting mix of characters from a William Gibson novel (capable, elegant, and able to kill--be it in a metaphoric social context or in a more visceral and literal \"bringing home the bacon\" context--if the situation requires it): Molly Millions meets Cayce. Calling the vegan on the way her bullshit completely ignores how her networked relation with the real world is at least as exploitative of *actual humans* as your choice to eat meat and how your hobby, whether she is willing to accept it or not, serves a positive ecological purpose? Yes. Just yes. Fuck quinoa. *Checks pulse.* Yup. I'm in love. Peace out!    ",
            "It's funny to me that the sort of people that often scoff at religion, turn another part of their lives into a religion and defend it with the same fervor religious people do.",
            "Your story reminds me of this very simple mantra that many people find extremely difficult.  \n\n*\"Don't provoke and don't be provoked.\"*\n\nYou seem to have conquered it.  Congrats.",
            "This sounds like the correct approach. You are absolutely right on every account, and acted in a correct, mature manner. Well done, OP.\n\nI have a few vegan/vegetarian friends, and every so often they jab at me for eating meat. It's something I find I get quite flustered by - I hate when they try to say I'm morally bankrupt or hypocritical for eating meat, yet still having a love and respect for animals and their welfare. I hate having my morals questioned. They have their views, I have mine.\n\nReading this post (and the previous one) has kind of lifted my spirits a little bit. It's not that I ever questioned my own beliefs or diet, but this has inspired me to 'stick by my guns', as it were, and not let them tell me what to do. It's my life, not theirs.\n\nUsually my way of diffusing the situation of a preachy/aggressive vegan/vegetarian is to retort in a manner which turns the mood less serious - making silly remarks which do not add to discussion and are not to be taken seriously. Making light of it is the only way I know how to deal with it without getting angry, and how to escape the situation without becoming 'trapped' in their arguments, if you catch my drift. Surely \"I'm allowed to eat what I want\" and \"I make sure I buy good meat/I try my best to not let meat go to waste\" is good enough, but they keep nagging.\n\nAnyway, your situation sounds like it has invoked a lot more animosity, and has a lot more fire than mine and I'm happy to see that it has finally been resolved in such a peaceful manner, even at the mentioned cost.",
            "Sounds like classic crybullying to me. She comes in looking for a fight. Wants to single people out in pretty much every unacceptable manner possible then cries foul when someone says something she doesn't like. Well done to you and all involved for having the bottle to all say what they and you thought of the matter. Hopefully you'll have a better work environment in the future now :)",
            "I love how she can respond \"it's still murder\" to you bringing up the things she consumes that have an effect on real humans. Like the child exploitation that goes into so many things made in China and middle eastern/African countries. I'm impressed you handled things so professionally because I would've had a hard time biting my tongue that she cares so much more about animal cruelty than human cruelty. It's a general issue I have with moral veg-n evangelists. ",
            "You handled it beautifully. Even though the boss was lacking a bit of spine, they handled it well too by trying to see if there can be a compromise first. All is as well as it could've gone. It could've gone well for her too if only she can respect other people's choices. If she feels upset, it's all on her, not you. \n\nShe's going to be passive aggressive to you from now on, just try your best to ignore her and not give her the satisfaction of your annoyance.",
            "I don't really have anything to add but this situation reminds me of a joke I found quite amusing. \n\nHow do you know if someone is a vegan? They'll tell you. ",
            "[deleted]",
            "I just want to say I'm glad you posted this and got to read other people's comments because I'm literally going through the same thing right now except my coworker is not vegan but she's using all the same tactics to bully me and it's really a trying situation for me. ",
            "This is a nice update. It sounds like you have a functional workplace and she's not going to get away with bullying everyone else about her personal crusade.",
            "How does this woman keep any job? Seriously. ",
            "This will work itself out soon enough. She's going to hang herself and be gone in a few months. I'm a bit surprised that HR didn't just shitcan her on the spot when she doubled down on animal murder during the mediation. ",
            "[removed]",
            "If you really wanted to mess with her you could've printed out a list of all the different products that contain parts of a pig. Pig parts can be used in everything from Bullets and weapons testing to fabric softener and crayons.",
            "This was a good outcome for you! I hope you're able to stick to avoiding her and only discussing work related things when you do have to encounter her. I gotta say it's stories like this that makes me happy to work in construction. What is it about the mundane \"office\" setting that cause people to act in the way the vegan does? ",
            "You handled this perfectly",
            "I thought she quit at the end and that she was handing out a resignation letter, haha.  ",
            "Sounds like it went really well. Good job OP. \n\nP.S. Enjoy your next hunt! \n",
            "Worst case, you have HR involved and a documented incident with multiple people corroborating the same story about her.  She'll be digging her own grave if she keeps it up.  ",
            "Sounds like a real vtard",
            "Here comes the next tumblr blog post about how vegans are being  persecuted in society.\n\nMeat eater privelege",
            "This is quite the opposite of what I typically experience.\n\nI am a vegetarian trying to transition to vegan (which is hard because most breads have eggs in them, not to mention cheese).\n\nI don't push it on people, but experience is that meat eaters really fucking love to push meat eating on people.  If I turn down food with meat in it, they feel like they have a right to interrogate me about my reasons for not eating meat, and then start lecturing me about why they are justified in eating meat, and why I should do it to.\n\nI know there are annoying self righteous people out there, but I also know members of the dominant culture usually feel like it's ok to demonize people who challenge their view.  \n\nI don't know the entire story here, and the OP sounds genuine, but this is simply not reflective of what I typically see in the real world.\n\n\n",
            "[removed]",
            "[deleted]",
            "Please get a camera for your car and perhaps one for your desk. I don't trust crazy lady to not dabble in vandalism. It would also be good evidence in case she accuses you of starting something. If that's not possible make sure all of your interactions with her are in public or in front of witnesses. ",
            "[deleted]",
            "So, you're totally right; that vegan was out of line. No one likes to be told what they should and shouldn't eat, or made to feel bad about their choices. I'm hoping that most people reading this can realize that it often goes the other way, as well. If you have a vegan coworker, don't comment on their lunch every day, or tell them that they should eat meat, or ask them repeatedly why they don't eat animal products, or try to catch them out when you see them wearing leather shoes. Meat eaters are oftentimes more vocally degrading to vegetarians/vegans than the other way around, in my experience. As a habit, maybe nobody should comment on anyone else's diet, or advise them on health matters related to food. Just my 2 cents. \n\nedit:  You know what I find so ironic?  This whole post is about people bullying each other for their dietary choices, and sticking their noses in where they don't belong.  Everyone loves this post and upvotes it, until some vegetarians and vegans point out that \"let's not forget that it goes both ways.  Let's all have some compassion and learn from this example\", and then they get bullied and downvoted into oblivion.  It's incredibly hypocritical that the reddit hivemind is doing exactly what it despises the vegan doing in the story.  How about we all admit that this behavior goes both ways, and we should all be conscious of it?",
            "Vegans like that will ALWAYS feel attacked when told to stfu. Glad that you were able to at least get her to shut UP about all this nonsense and very glad to see you're being the bigger person here and behaving cordially. Thanks for the update!",
            "[removed]",
            "You should decorate your desk with some hunting pictures.",
            "Come on, we all know this whole situation is the animals' fault for being so delicious.",
            "I would demand her firing.",
            "Maybe she will find somewhere she is expected to act that way like peta or the westboro chapter of peta or something. ",
            "I still do not get anything of this. \n\n1) Yes, you are hunter. So fucking what? Why hide it? Why is this even a conversation topic in the workplace? \n\n2) Why do you even have to listen to her? Can't you just walk away and leaver on her own? \n\n3) Why can't you just keep contact strictly work-based? \n\nI don't get any of this drama. You do not have to get bullshit from absolutely anyone. ",
            "[removed]",
            "[removed]",
            "To be honest I can kind of see where the vegan's coming from. It's not that she personally hates you maliciously because of your personality or something, the reason she's so abrasive is because, the way she looks at it, everyone around her is taking part in systematically sanctioned unadulterated unnecessary violence. I can tell why you and your coworkers would be irritated by it, but it sounds like it is actually escalating to everyone alienating her (laughing at her because of the cultural insensitivity thing, excluding her from events etc.). Try to take the higher ground and make sure you don't fall into the trap of bullying her just because she's kind of abrasive with her opinions. "
        ]
    },
    {
        "post_id": "51wyaj",
        "author": "VuyTre",
        "title": "My [42F] nephew [20M] is telling everyone he has asthma like my son [12M] but he is just overweight. He stole 3 of my sons inhalers and he is refusing to pay for what he took.",
        "url": "https://www.reddit.com/r/relationships/comments/51wyaj/my_42f_nephew_20m_is_telling_everyone_he_has/",
        "score": 2646,
        "num_comments": 554,
        "created_utc": 1473421312.0,
        "selftext": "My nephew is really overweight, like extremely big. I promise I don't mean to sound like a witch but he can't make it up the stairs without being short of breathe. \n\nRecently 3 of my sons inhalers went missing, my son asthma is bad. He has really bad asthma attacks from time to time. My husband, children and I hosted a party the night before. So we thought maybe someone threw them out by mistake while drunk. We searched for them but to no luck. \n\nAnyway my daughter [17F] heard from one of her cousins that Stewart has asthma. I called my sister and I asked if this was true and she said it is the first time she is hearing of it. She went into his room and she found my sons inhalers. Her son still lives at home and is not doing anything with his life. No college, no job, nothing. \n\nYou can tell they are my sons Asters because we have stickers on them. His little sister who is 7 put smiley faces on them because she believes it helps. My sister confronted him about it and he cam clean. He stole the inhaler and pretended to have asthma so people would not think he is out of shape. \n\nI know he has no job, but those things are not cheap and honestly I am furious. I think he should pay for what he used because really 2 of them are broken. My sister does not think she should pay for them if he can't and is asking me to cut him a break. \n\nI don't think I should, but I don't know what to do. This is really tearing a rift between myself and my sister. But at the same time it's like he stole my little boys inhalers, that to my is unforgivable. \n\ntl;dr: Nephew stole sons inhalers ",
        "permalink": "/r/relationships/comments/51wyaj/my_42f_nephew_20m_is_telling_everyone_he_has/",
        "comments": [
            "[removed]",
            "[deleted]",
            "This sucks.\n\nAs someone who works as a pharmacy tech, I've seen those inhalers go for $50 a pop even **with** insurance. And then of course, if you run out early because someone stole some, insurance doesn't really care, they won't cover a new one until it's been roughly a month since the last one was covered.\n\n(They'll sometimes do an override and pay for it if it was stolen, but this *usually* requires a police report, and then getting in touch with your insurance company, so.. )",
            "He should pay and he's no longer allowed in your house. Your sister is right, she shouldn't pay, HE should because he's an adult. Gotta wonder if you have to press charges for this, but it's going to be hard to prove i guess. Imagine if your kids attack had been worse, your nephew would've been responsible. Doesn't matter if it's cos he's fat, maybe he's using it for other reasons. ",
            "Isn't stealing medication against the law or something?",
            "Even with insurance rescue inhalers are expensive, they absolutely should pay the cost!  Your sister needs to stop coddling her pathetic *adult* son.  How sad is his life that he has to steal a child's life saving medication because he's embarrassed by being fat...\n\nMy daughter has asthma, though thankfully in good control right now, and I'd be furious if this happened.  This would honestly be enough for me to ban the son from my home and it would fuck up my relationship with my sister.  This is not ok.\n\nedit: you said some of the inhalers are broken.  I don't know which one you are using, but can you take the medication canister out and pop it into one of the inhaler housings that isn't broken? Also...what the hell was he doing that he broke them??  I'm so angry and it isn't even my child!",
            "He's stealing inhalers to get high. His excuse to his mom is bullshit and his weight has nothing to do with it. If he was just using them as a prop to fake asthma he wouldn't need full inhalers, he wouldn't need to actually use them, and he wouldn't need three of them.\n\nYou should seriously consider filing a police report.\n\n",
            "Tell her that he gives the inhalers back now or you'll report him for stealing px meds.\n\nAlso, why did your sister not take them back when she found them? That is messed up. By leaving them there and telling you there's nothing she can do, she's supoprting her son in this.",
            "You're not going to get the money from him.  You need to stop asking.  But don't invite, or allow, your nephew into your home, any longer.  He's a thief, as well as a liar.  Don't allow him to your home.\n",
            "You can try demanding that he pay for the inhalers, but since your sister isn't pressing him to do so, I wouldn't expect him to do so. As much as I don't like the idea of letting bad behavior slide, it sounds like your sister has a lot more to deal with than the cost of the inhalers if her 20 year old unemployed son is stealing inhalers in order to poorly trick people into thinking he has asthma rather than a very serious and obvious weight problem. If your relationship with your sister is otherwise good (which it sounds like it is if she confronted him instead of immediately defending his behavior), I'd let the cost slide, but tell her his behavior is totally unacceptable, actively put your son's life at risk, and that he will no longer be allowed to your home.",
            "Your nephew is an adult, his mom shouldn't pay for something he stole. Talk to your nephew and let him now you'll go to the cops if he doesn't pay the inhalers back to you. Treat it the same way you would treat a non-family member adult stealing something from you.",
            "He most likely won't pay, especially since his mother isn't forcing him to, but you need to stop allowing him into your house and around your kids.",
            "Do you have any of this in writing? If not, text your sister. Then go to the police. Stealing medication is a serious crime, and with a police report you should be able to get replacements covered by insurance.",
            "I bet he's stolen other things. Just think about it... wouldn't just stealing one inhaler be enough to fool people with? He took 3 because he could. Because stealing is something he can do. Can't make it up the stairs, can pick your stuff up and put it in his pocket.\n\nGive your sister a choice... someone pays... or she lets you in his room and you just take goods of your choice that you feel are of similar value to you... or you file a police report about the theft and he'll probably end up cautioned.\n\nAnd never let him in your house again.",
            "I am so sorry you're in the predicament. He is a grown ass adult and should be prosecuted as such. I don't have to tell you how serious your son's condition is. Your nephew committed a serious crime and is putting your child in danger. Call the police.",
            "Make sure your sister understands how serious this is. Her son stole life saving medication from your son. I'm giving her the benefit of the doubt here and assuming she doesn't understand how important that medication is and maybe also doesn't understand what could have happened.\n\nThe nephew should pay for the stolen items and he should also get a lesson about how important those inhalers are to your son.\n\nIf they don't hear you out and then pay up, tell them they aren't allowed in your house until this issue is resolved.",
            "Is your nephew mentally competent? Considering he's obviously morbidly obese, I don't think anybody is buying the asthma story. It sounds like something a 6th grader would make up to impress an 8th grader. \n\nSo basically you have a big dumb man child who did a stupid thing because he's pretty stupid. He saw that your son had so many and thought it wouldn't be missed. Yeah, it's absolutely shitty. Yeah, your sister probably enables him. You're not getting reimbursed. I'd settle for a sincere apology if you want to restore some family balance and preserve the relationship with your sister. Or, take Reddit's advice and cut your sister off forever, call the cops and file a civil lawsuit for emotional damage.",
            "He's 20, I don't think your sister should be paying for the 2 broken ones. He should. And if your sister is any kind of parent, she'll agree.\n\nAlso, fuck, who steals asthma inhalers from a twelve-year-old? I'd want to see about therapy/weight loss counseling for him as well if he's that ashamed of his weight.",
            "He should pay and you should tell your sister that her thieving son who steals inhalers from a child with asthma is not allowed back in your home.",
            "He's 20 years old, and he stole *stole medication from a child*. Tell your sister you're calling the police if the inhalers aren't replaced in 12 hours.",
            "So let me get this straight.\n\nYour 20 year old adult nephew stole your 12 year old son's inhaler.  And this adult's mommy is saying that nobody will pay for it?\n\nI'm calling bull on the mother.  Your nephew is an adult and should treated as one.  File a police report.",
            "At first I skimmed the ages and assumed they were both children, I had a look back at his age and was absolutely shocked! Forget any civility here OP. Your nephew is an adult who stole medication from your son. He may refuse to speak to you, but I bet he can't refuse the police so easily.",
            "If your sister enables this sort of behavior he will never stop because there are never consequences.  Call the cops on him.  Stealing medication is a crime and given he is 20 he will not be treated as a juvenile.  Lessons need to be learned and discipline must be applied.",
            "No, make him pay it back. Tell your sister that sorry, these are medicine and they cost money and he is going to be held responsible because he's 20 years old.\n\nI'd probably emphasize that what he did is illegal. That you're not going to escalate this because she's your family and you love her, but your nephew is completely responsible to pay back what those inhalers cost.",
            "It's illegal to steal prescribed medication. I'd call the police.",
            "Replace inhaler contents with bear mace, let nephew steal again. Film results.",
            "He should be careful, check with doctors if the inhalers increase things like blood pressure or have anything else might be health risk to him. If so he's only increasing risk of other health problems. Doesn't sound like he's being dumb and thinking it will make him high but ive seen people do it. Your sister should talk to a doctor. \n\n",
            "He was willing to risk your son dying so that he wouldn't appear fat. Stealing life saving medicine from a child is just about the lowest thing you can do. The second lowest would be refusing to make restitution for this action. Frankly I'd give him the choice to make. Deal with you to pay for the inhalers, even making small payments, or deal with the police.\n\nI can't believe his mother isn't completely crushed with shame and isn't forcing him account for his actions.",
            "If I take my inhaler ANY less than twice a day, I'm wheezing and coughing non stop until I take it again. Stealing any medication, let alone something for BREATHING is really dangerous. Your nephew needs to face the consequences of that. What if your son really needed it when it was gone? You are right and justified in making a big deal out of this. ",
            "He stole life saving medical equipment *from a child* so people wouldn't think poorly of his weight. Does he have any idea how serious this could have become if your son had a serious attack and you didn't realize the inhalers were gone until the last second? I think people will think worse of him knowing that he put a child in danger to make himself look better, than they would think of him if he had some trouble climbing stairs. He should absolutely pay for them. He's an adult, and he needs to accept responsibility for his actions.",
            "[deleted]",
            "\nI would tell your sister that you will either talk to your nephew about the matter, or you will talk to the police about the matter. I would make it clear those are the options, and your nephew can choose one or the other. I would also outline the minimums you will expect in a conversation with your nephew if you are not going to report the theft to the policy.\n\n\n",
            "Report him to the police for stealing your son's meds.  We'll see what kind of motivation that supplies.  Get a text or email from her first admitting it.",
            "You need to tell your sister that nephew's actions could have killed your son. I've had to tear apart the house looking for an inhaler for my husband before, it's not fun. You have so many inhalers around your house for a reason. Insurance will not cover the cost of replacing all 3 inhalers at once, this is going to cost you hundreds. He needs to pay for them regardless of if it takes him months, he will pay you back. He is also no longer allowed in your home. ",
            "This is seriously depraved behavior. Who steals an inhaler from a little asthmatic boy? He's stealing a prescription medication from you. This is unacceptable. Tell him and his family to get your nephew checked out at their own doctor and get their own inhaler instead of taking it from your son who needs it (undoubtedly more.)",
            "*cut him a break.* My definition of cutting him a break would be not filing a police report.  Send them an invoice for the replacement inhalers (assuming you can *get* replacements due to prescription renewal period) and cut contact with both of them till you have been reimbursed.  Your sister is enabling his behavior.",
            "[deleted]",
            "Walk over there and ask for a repayment. If he doesn't repay you, steal his cheese puffs and xbox",
            "Tell them they're paying you back or you're going to the police. And follow through.\n\nA tip in case you have to take this further: make sure you have something in writing confirming that your nephew took them. Maybe send them a text reiterating that they need to pay you back.\n\nThis isn't just stealing, and this isn't just them putting you out of pocket. Your nephew put your son's life in danger (for all he knew l, those could have been the only inhalers you had) and apparently doesn't give a shit.",
            "Okay wait, but if he's really overweight, people don't need the lack of asthma to wonder if he's out of shape.",
            "He is 20 years old, expecting him to pay for an item he stole and then consumed is not unreasonable. Keep repeating this, to yourself and to your nephew - don't discuss it with your sister.",
            "Stay tough. Either he pays for hem or you file a police report. He's too old to act like an asshole. ",
            "You tell your sister that if her son can not afford them then she is the one responsible for them.\n\nIt is not a simple, oh you stole ten bucks for me and got caught, it is a you stole prescription drugs that are not cheap and then proceeded to use/or break them.\n\nAs a mom she should feel mortified and as your sister she should feel bad. \n\nThey do not seem like a healthy family at all.",
            "He's 20. Stealing as a kid is bad, but can be worked on and disciplined. Stealing as an adult has adult consequences. Tell your sister that either you get the money for the inhalers or you're taking her son to small claims court. ",
            "OH HELL NO\n\nOne of my son's has asthma so I completely understand how you feel. More than the money, if your son had an attack and you had no inhalers around (thinking that you did) he could very well DIE before help could arrive or you could get him to ER in time. This is no joke. Many people don't understand that asthma can actually kill you.\n\nHe needs to pay for the inhalers and apologize to you and your son. If his sister wants to 'cut him a break' then she needs to pay for the inhalers. If not, cut them both cold. These are people that are dismissing the severity of what your nephew did. WHAT in the entire!!",
            "The fact that he's 20 makes this a lot easier. He's an adult who stole incredibly vital medicine from a child, and tried to pass off that he had a disease. He's fat, he did it to himself, and thought that stealing a child's asthma medicine would shift blame from him being obese. What the Fuck is up with his mental state? I think he should definitely pay you back if not money, then labor of some sorts. He's an adult, he has to deal with consequences since his own mother clearly won't make him deal with the consequences. \n\nAlso he should really get his life together. It's fine taking time in your early 20's to figure shit out, but living at home doing nothing and remaining morbidly obese is not in any way healthy physically or mentally. ",
            "Well whether he pays you back or not he should not be allowed into your home period end of discussion.",
            "Stealing medication is illegal.  Stealing medication from a child is fucking low.  He needs to either pay for them or you need to file a police report.  Or both.",
            "LOL stole inhalers so people would not think he is out of shape. TIL that people become blind to how fat you are if you have an inhaler.",
            "Your sister \"cutting him a break\" might be why your nephew is 20, unemployed, not in college and desperate to hide himself. He might be in need of some actual tough love to push him into a better direction. I would not back down in your position, if nothing else than just for your nephew's sake.",
            "This is petty as hell, but you can spread it around. Tell other family members and such. Sometimes guilt makes people do the right thing. Obviously this may strain your relationship with sis and nephew.",
            "Either you need the cash or you don't. If you do and the thief can't pay (perhaps his parents can loan him the cash) then claim on your home insurance? Yes you'll probably have to file a police report and maybe state who you understand the thief to be, but needs must. If you don't need the money count your blessings and hope the thief's life turns around so eventually he can settle up.\n\nNow to the real issue : Stewart isn't working nor studying and has appalling health. Isn't some form of medical care and social security available?\n\n",
            "I trust that you have let the rest of the family know about Mr Stickyfingers. I wouldn't let someone that steals prescribed items from other family members into my house again either.\n\nEdit: I'd still call the police even if he repays you.",
            "This is serious. His actions could have killed your son. The fact that this has either not occurred to your sister and nephew or is irrelevant to them is fucked up. Personally, I'd be considering involving the police, but if that's not for you and he isn't willing to pay you back, I wouldn't let him back in the house again. No one who willfully puts your child in danger should be given a second chance.",
            "Tell that little shit that's it's illegal to have someone else's prescription and that he WILL pay you back.\n\nIf he won't talk to you, tell the mom. ",
            "Stealing prescriptions is a felony and your sister should be trying to appease you so you won't call the police. ",
            "Your problem, and your nephew's problem, is your sister. Remove her from the situation by talking to him directly... in person, if he won't take your calls. Tell him the deal is that he needs to pay for the inhalers or you have to file a police report to get your insurance to pay for them. Tell him your son's life is in danger because of what he did and you have no choice. And then follow through. If he offers to sell something or get a job to pay for them I would let him pay it off in instalments if you can swing it. \n\nIf you want to go above and beyond you can use this as an opportunity to stage an intervention on your nephew's life problems, namely his mother's enabling and coddling of him. I only say this because he confessed to the left and said it was because of his image problems... that's a cry for help if I've ever heard one, and his mother isn't going to help him. That's a huge responsibility that's going to require a ton of patience and forgiveness and I wouldn't think less of you if you didn't do it. ",
            "Here's what I think. **HE** should pay you back and I don't think you should ask your sister for the money because he's an adult. It doesn't matter how he gets the money (I mean, stealing it isn't ok, obviously) he can work for it, borrow it, pawn some of his own items, whatever it takes to pay your family back for what he stole from your young son.\n\n\nOK, first find out how much it will cost to replace the inhalers. Is it just a matter of covering the copays because insurance will approve a refill or will your insurance deny the claim because it's too early to refill?\n\n\nSince he won't take your calls I think you should call your sister about this one last time. Tell her you want to speak to him and if he doesn't want to talk that's ok, you just need him to listen. She can just use speakerphone with him in the room or something. Tell him that unless he repays you the $X that you need to replace the stolen items by a particular date (maybe give him until Monday or a week or whatever) you will be forced to file a police report for the stolen medication. You can suggest that he find some work on Task Rabbit, borrow the money, pawn his xbox or whatever, but you need the inhalers replaced. Then follow through.\n\n\nNow, I think some people will say that kind of a threat is extortion, which is illegal. I am not a lawyer, so I don't know if that meets the legal definition of extortion, so if you'd like to follow my advice you should find out for sure whether that kind of threat is illegal in the jurisdiction in which you live (I think the folks over at /r/legaladvice are quite helpful).\n\n\n\nI see a few people suggesting that one way he could pay you back is to do some chores for you. I think that is a bad idea given the way you have described your nephew. Is going to be \"able\" to mow your lawn, for example? Would he actually follow through on any kind of chore agreement you came to or would he stop showing after the first week? And finally, having some kind of chore agreement would probably require him to go into your home again, which I'm guessing you don't want.",
            "He needs some consequences in his life. He sounds like he has zero motivation",
            "He stole your son\"s life saving medication. \n\n**He stole your son's medication.**\n\nIf it was anyone else, and any other medication, you wouldn't even need to ask this question. \n\nShe needs to reimburse you, because I imagine your insurance will not cover the replacements unless there is a police report. I had a month of my Suboxone stolen (a medication I was physically dependent on) and had to pay 500 dollars out of pocket.\n\nI imagine this will be expensive for you. ",
            "Asthmatic here, who is both literally sick and tired of A) people falsely claiming they have any medical condition which brings unneeded additional stigma to actual sick people on top of the actual sickness they battle (e.g. people at restaurants claiming allergies to \"make sure\" they don't get food items they don't like while others sneak allergens into people's food to \"catch fakers\") and B) navigating an already Vogonish medical bureaucracy and HAVING LIMITS ON HOW MUCH LIFE-SAVING MEDICINE I CAN TAKE OUT AT A TIME.\n\nYOU NEED TO BREATHE IN ORDER TO LIVE.\n\nIf your sister wants to enable a selfish, entitled and unempathetic asshole, that's her prerogative, but someone is responsible for making reparations to your son. Regardless of whether justice is served (your nephew being punished or apologizing) your son is a victim and he deserves not to be left in the lurch, as do you.\n\nIf your nephew can't pony up an apology or reparations, he doesn't get to come over anymore. Perhaps he doesn't get to have a relationship with your son or you. HE IS AN ADULT.\n\nBut seriously, I frankly can't imagine not helping out one of my sisters, especially when something bad happening to them fell under my purview. If my sister were cat-sitting my cat and my cat scratched her cat, you'd bet your ass I'd be releasing my cat's medical records and paying any medical fees.\n\nYou let her (adult) son into your home and he put your (minor) son's health at risk. That's indefensible. That it was done intentionally is appalling.",
            "You can't get much lower than stealing a 12 year old's inhaler. He's scum.",
            "I bet we see this in a green text from his point of view in a couple months.",
            "Tell her that your insurance won't cover new inhalers without a police report, so you can file one or he can pay for the replacements himself. Sounds like she's given him more than enough breaks; you aren't being harsh or unreasonable in the slightest.  \n  \nSounds like he needs therapy, to be honest.",
            "Small claims court! Or, you can call the police. Time for him to get a job!",
            "\"Sis, he stole form us and lied about it until he was caught.  He needs to pay for the inhalers or he will learn its ok to steal and lie bc there are no consequences.  Why should we have to be the ones who suffer twice at his hands? If he doesnt pay us back he will not be welcome in our home.\"",
            "New rule: He is no longer allowed to come to your house. ",
            "Ok. So, the root of the issue here is that your nephew is **so** unhappy with his life/weight that he's willing to lie/steal to cover this up. Why is she not taking care of her sons health? I mean, I understand that he's 20.....but it doesn't seem like he has a parent who is trying to help him better his life. If your sister is not willing to pay up, then she at least needs to admit that she must do something to help him with his weight. She needs to get the kid to a doctor, a nutritionist, or a gym for goodness sake! The stealing of the inhalers in just a symptom of a kid who is desperately seeking help......either move forward in a positive way to make sure this kid doesn't steal from you again or cut them off (which you could rightfully do). ",
            "He might well even actually have (undiagnosed) asthma on top of his weight, but that doesn't give him the right to steal from your son. Nephew should pay.",
            "Your sister is just giving him the ability to feel like his actions were okay by sheltering him. Talk to her and call her out on it. Tell her that by her not forcing her deadbeat son to talk to you and apologize/pay for the damages, she's approving his behavior. \n\nI wouldn't personally file a police report, but I would just go no contact until they decide to come apologize/pay for damages.",
            "Whatever happens I want to read an update!",
            "Your son's inhaler's don't have whom the script belongs to on the plastic? Mine were on the box and the inhaler itself when I was dealing with asthma as a kid.",
            "Of course he should have to pay for it, or the police should be contacted, but aside from that I don't think he should be allowed back in your home for some time, and when he is all medicine, etc, should be kept locked up or on your person.",
            "Sounds like everyone is already constantly cutting this kid a break.  Maybe it's time he got a job so he can pay you back.",
            "Isn't what he did illegal? Nevermind dangerous for your son.\n\nI might press on the legal bit, because clearly your sister and nephew don't care about the part where it could've hurt your son.",
            ">His little sister who is 7 put smiley faces on them because she believes it helps.\n\nThis is the most adorable thing, my cold heart bleeds once more lol\n\nAs for the problem at hand sadly you can't parent someone else's child when your sister clearly enables your nephew like she does. \n\n>He does not want to talk to me according to his mother.\n\nAnd she thinks this is acceptable, to potentially cause harm to his cousin, yet not take responsibility for his actions. You know this is wrong, This sub knows this is wrong, yet your sister can't entertain the thought of your son getting a stern talking to because it might damage his delicate soul?\n\nThis is largely out of your hands sadly, i would just move on, count your blessings this didn't escalate further, or an attack didn't happen while your son didn't have his inhalers and move on. Also, out of curiosity, were those 3 inhalers his only ones? or did you have one on your person as well. I remember another poster a week or so ago mention that she (the child's aunt and legal guardian) carried one on her at all times, and her kid (the child's cousin, but raised as siblings) also carried one on her at all times.",
            "I would so call the cops on this grown-ass man child. This is theft and endangerment and I would have flown off the handle if I were you. His mom won't do anything, call the cops. He needs to learn there are consequences for this bullshit. ",
            "OP. \n\nAs someone who was diagnosed at a young age with severe asthma and grew up with it, fuck your nephew. \n\nThe fact his mom is enabling this behavior rather than force himself to be an adult and own up to it. She continues to defend him and not see the obvious signs of your son needs a reality check (Seriously trying to say he's not fit because of asthma? He's not fooling anyone.). You have more patience than I do. \n\nI'd send him up the creek and report it to the police and let him deal with that headache when you offered him an easy way. Make sure you contact other family to inform them of the situation and the fact they forced your hand being shitty people. You tried being civil and approaching them about it, but the son doesn't even have the balls to talk to you and the mom is telling you to drop it? Screw him, if your son had a major attack you would understand why I'm so upset. Family is family, but if they're assholes that doesn't mean it's ok to turn the other cheek. \n\nI've been in situations where my inhaler is not in immediate access and it is not fun, its terrifying. Having to focus on breathing and having my body panicking that it's not getting enough oxygen is a terrible thing to experience and I don't wish that on anyone.",
            "Instead of focusing on the cost (which I know is a big part of the problem), I would focus more on the urgency to have them for your son's safety.\n\nThat bit of pressure might make your sister pay up for your nephew. After all, he's at home not doing anything and she's responsible for him. It sucks but you break it, you buy it.\n\nThe point of asking for her to pay them back is not to expect them back, but they have to be held accountable. Not saying anything to them just because you know you won't get them or the money back is a bad idea because they will not see it as a serious matter. Don't let them think this is okay.\n\nAnd tell your sister her son isn't allowed over anymore as you can't afford to have your son die just because your nephew is stealing as a result of insecurity.",
            "He literally stole lifesaving medication from your son.  Of course he should pay you back!  Not having a job is no reason to let him off the hook.  If he didn't want to have to pay you back, he shouldn't have stolen from you.",
            "Who steals a child's inhaler? That is just evil. Cut him out of your life.",
            "So lete guess it's okay to steal from Family bit as soon as you want to be paid back you're the monster. What the fuck is up with relatives???",
            ">My sister does not think she should pay for them if he can't and is asking me to cut him a break.\n\nFUUUUUUCK THAAAAT. Nephew put your son's life at risk, and he needs to pay. With money, criminal charges, or both.",
            "He is an adult and there are consequences for his actions. From your sisters reaction to the situation it looks like it's normal for her to shield him from consequences. Tell him he pays for them or you go to the police. \n\nHe can ask his mom for the money, sell his stuff, walk dogs, mow lawns, mturk, give tech help or *gasp* look for a job. \n\nI can feel for the kid, he's embarrassed of his body. But this is at least two kinds of illegal and just plain immoral. Stealing life saving, expensive medication from a child to pad his ego. Wtf.",
            "What brand does your son use? My sister is a pharmaceutical rep, and has been able to get my inhalers for free for a while now. Maybe I could help.",
            "I haven't read all of the comments, but perhaps if you talk to your sister again, you can emphasize the LIFE SAVING nature of these inhalers for your son. That they are not just some tylenol or aspirin, but that your son could die if he does not have them on hand. Focusing on this might help her understand and actually compensate you for them......maybe.....maybe....sigh.",
            "Well, he should pay, but he has no money. Your sister paying would defeat the purpose.\n\nget some money out of him by having him mow the lawn, weed, clean house, lay some bricks. I like that idea because its an ironic punishment considering he said he had asthma. \n\nIf he wont, then no contact.",
            "Call the police, because this is a shitty thing your sister is doing.   You actually don't get to stop being a parent when your child is an adult.   You never stop being a parent.   Her hands-off parenting is likely why he is fat and thinks it's cool to lie and steal.   \"Whatever makes him happy!\"\n\n\n\nFuck them.   Call the police and get your shit dealt with.  You have done nothing wrong ",
            ">My sister does not think she should pay for them if he can't and is asking me to cut him a break.\n\nYour sister indulges her child to the point he can steal from family without negative repercussions. She is taking advantage that you are close family to indulge him more. She will keep indulging him as long as things stay the same. \n\nYour sister needs to hear something along these lines if you ever hope to wake her up. \"He needs to pay me back or he needs to work this off. Or we can't have him over anymore. I need to know I can trust him not to steal from us. He can call me when he's ready.\" Expect your sister to be livid and protect her son. Then the ball is in their court. They can learn to respect family and have some self respect, or not.\n\n\n \n\n",
            ">He stole the inhaler and pretended to have asthma so people would not think he is out of shape.\n\nIf he's as fat as you say he is the inhaler isn't going to magically fix that. He needs to pay up for the replacements, he needs to apologise to your son, and he needs some sort of punishment to actually learn something from this.\n\nHe's 20 and he's acting like a ten year old.",
            "This kid sounds like a NEET. Can someone make a Pepe using an inhaler? I'm on mobile right now",
            ">asking me to cut him a break.\n\nWhich is exactly the kind of weak lame-ass attitude that has brought him up the way he is. She's a shit parent and he's too ashamed to face you. I would demand the money or both of them get cut out of your life, period. It's not down to you to educate them, but really you need to put down the boundary on this, seeing as stealing urgent medical supplies doesn't seem to be a boundary that naturally exists for her excuse for a son. ",
            "Forget about the money. You're not getting it back. Ask for an apology instead.\n\nYour sister probably thinks you're being petty.  You need to express to her that this is about your son's safety and about the fact that her son stole medical devices from a child. Tell her that he's not going to be allowed in your home if you can't feel that your son's medicine is safe.",
            "What does your partner think of this?\n\nPersonally I'd stop calling and go over and talk to that lump. Tell him it is unacceptable to steal. Especially medical equipment that could save someone's life. He needs to know how dangerous this could have been. ",
            "My partner has asthma and often talks to me about the cost because he doesn't like that he has to pay for them (he works full time, just thinks it's kind of unfair that he has to pay to breathe properly.) \n\nThe fact that he took them means he has to pay for them. No question about this. It is inexcusable to take something that is so important to your son and he needs to learn from this. \n\nSeeing as he doesn't have a job though, makes this more difficult. I would not want someone like that in my home. ",
            "Time to cut your sister and nephew loose.\n\nIt is pretty cut and dried.\n\nShe's a bad parent and making her bad parenting your problem.\n\nHe's a rebellious youth that this sub tolerates.",
            "What did tubby think? He was going to carry around an inhaler and everyone would go, \"ohhh that is why you are out of shape\".  If that was my kid I would make them pay.  If they could not I would pay on their behalf and then punish them my own way. That is how it should be handled. ",
            "Till he apologizes and pays, he is not going to your home again. ",
            "Have you got them back?",
            "Cut that nephew off. Really. Shun.",
            "I wouldn't take it out on your sister. Don't maker her pay. Your sister didn't steal the inhalers. As for your nephew, you can make it clear you want compensation/replacements for the things he stole (and broke). Leave him messages (voicemail, letters, texts, etc.) that you will not forgive him or respect him because of what he did unless he makes amends on your terms. Likely, he won't pay or apologize and you can continue to disrespect him and cut him out of your life. Sounds like he's a bit of a dickhead that needs to see some consequences to his shitty actions. If people did this to him enough, maybe he would learn from his mistakes and change.",
            "He just sounds like an awkward NEET tbh\n",
            "Sorry if this is an idiot question but how much does an inhaler cost in the U.S.?",
            "Wow, I've had asthma my entire life and I still always like to have 3 working ones at all times (backpack, gym bag, and my room). I would be so FURIOUS at your nephew for stealing potentially life saving medication. I'm not sure how he decided that he needed to prove he wasn't out of shape by USING those inhalers. Also having asthma doesn't mean you are going to be fat, it just means you are less likely to be a world class athlete...",
            "If he's that Obese and having symptoms he should be really careful. Large people have small lungs in a big body and are at high risk of sleep apnea and drop there saturation overnight. Can lead to strokes and other problems. They also put a lot of strain on their heart which could also cause breathlessness. That said he sounds amazingly childish.",
            "Are these prescription inhalers?  If so this is a crime and you need to report it.",
            "Good Lord, those things are expensive! If I didn't have insurance I'd have to pay close to $1000 a month for mine. ",
            "Banned. \n\nNephew is definitely banned from your home and any events until someone pays for this. Your son's life could be on the line cause some people are in denial about themselves. ",
            "He literally stole from you. Stuff that wasn't cheap, either. Just keep that in mind.",
            "He's 20 years old? Won't pay? Won't apologize? Won't work it off? You have three choices then \n1) forget about it, cut your losses and lock that shit up every time he is visiting. \n2) never speak to them again, or at least until they pay up in some manner. \n3) he's an adult. Call the cops. Stealing medication is NO FUCKIG JOKE, and he will learn...oh...he will learn. ",
            "this might not be a popular opinion on here but I would suggest having a talk to him about his health. it's obviously at a point where he is uncomfortable but unwilling for whatever reason to change. I think of you show him different options and have him 'pay' you back by getting into better shape so he can go on to get a job or go to college would be good.",
            "Your nephew is abusing inhalers to get high and your sister is enabling him and she is asking you to enable him also. Like other drug abusers and their enablers, you are not likely to get through to them. The only break you should be considering is whether to involve the police with respect to the theft, but be aware that if you do make a report, you still might not be reimbursed. Either way, make it clear that since you cannot trust nephew, he is no longer welcome in your home.",
            "What he did was not only ethically wrong, it was illegal.  It's against the law to take medication not prescribed to him.  Your sister needs to pay up.\n",
            "If no one has said it before, stealing precipitation drugs is a misdemeanor. That's illegal. Stealing is illegal, but stealing drugs that are prescribed is not only illegal but endangerment of a minor.\n\nDo not let your enabling sister allow your nephew get away with this. Either he pays or she pays or you go the legal route. You tell them that, you stand firm, and you do what you have to do.\n\n",
            "The kid stole the inhalers. Either the kid or his parents should pay you back for them. It is possible that the kid stole the inhalers to use as a cover for being out of shape and overweight, but it could also be true that the nephew could also have asthma or sine other health isdue making it difficult to climb the stairs. He owes you a big apology for stealing from you. Then he needs a medical check up. Then he needs some type of counseling to deal with his feelings of inadequacy, if his out of shape condition was the reason he took the inhalers. He also needs helpin getting to a better point in fitness.",
            "I would make him work them off.  Maybe do some yard work.\n\nNot only would this be to pay you back, but it would also force him to do some physical activity and have a \"job\".",
            "More than the money, at 20 your nephew really should understand that taking someone's medication is serious; what if your son had really needed it? Your sister sounds like she's being really lax and frankly a terrible parent. Someone needs to tell that kid that what he did was actually pretty serious, both from the financial aspect and the health one.",
            "Here's a compromise.  If the kid can't pay for the inhalers, he's gonna have to settle his debt some other way.  Maybe even cure his \"asthma\" by doing a little exercise.  I'm sure you must have some grass that needs mowing, or a shed that needs painting.  If you live in an apartment, there's always a floor to mop or vacuum.  Don't let this kid get away with stealing prescription medications.  First, it's an inhaler, but next it could be oxys or benzos.  ",
            "First thing you need to do is make your sister realize how serious this actually is.  If he'd have done this to anyone other than you, he'd be facing much more serious consequences.  Additionally, he is not a child and any punishments he faced would reflect that.  Lastly, he's stealing.  He's a 20 year old who's stealing - from his own family! - and his mom doesn't see a problem here and is letting hims skirt any responsibility for that?  Wow.  High hopes for that kid.  Here's to hoping your sister wakes the hell up, otherwise her son is in for a really rough future.  Maybe you could show her this post?",
            "Your sister is enabling her son because she wants to avoid the problem. This isn't a situation where it can be ignored. Make him pony up or let him know you're going to have to report him.\n\nAlso, sometimes you can report medicine as stolen/broken and insurance will pay for the second lot. If they won't pay as they should because it is THEIR problem that THEY are now causing, then try that. I'm so sorry you're going through this.",
            "Honestly I'd get real petty, since it sounds like he isn't going to pay anyways.  I'd go to your sister's place and steal something that belongs to him.  Like an xbox or some fancy beats headphones or something.  When he gets pissed and throws a tantrum, tell him that you stole his shit as monetary compensation for your son's inhalers since he's such a deadbeat burnout and he refused to pay you directly like a decent human being.  I'd follow it up with \"At least what I stole didn't *endanger your life*.\"",
            "> I know he has no job, but those things are not cheap and honestly I am furious. I think he should pay for what he used because really 2 of them are broken. My sister does not think she should pay for them if he can't and is asking me to cut him a break.\n\nIf he can't pay them off, make him work for his debt.  My friend's son stole his credit card and racked up hundreds of dollars of in-game freemium app purchases.  So this whole summer, he had to paint his grandfather's house.",
            "Yeah, my vote is tell him to work it off. Make him come by and do some yard work or something--something unskilled that you don't really want to do. If his mom isn't a total tool she'll see the value and mended bridge in that. I doubt you'll be able to get much more out of him.",
            "Your 20M nephew is the NEETest",
            "Your nephew should pay for the inhalers. He can find out a way to pay for them on his own. Tell your sister that if her son doesn't contact you, then he'll be contacted by the police. He put your son at risk, take this very seriously.",
            "It's illegal to steal prescription medicine from another person.",
            "I don't really think your sister needs to be responsible for her 20-year-old son. He's old enough that he needs to be held accountable. Even if he doesn't have a job, perhaps he could do yard work or housework; something to repay you.",
            "He can work it off if he's broke...",
            "Your sister should not have to pay for what another adult stole and used. Yes, your nephew is an adult. He stole from a child. This man-child of a nephew, in order to justify his non-medically diagnosis of asthma, stole a child's inhaler, in order to justify his own reason for his breathing problem. He is delusioned. He needs help and help needs to come in the form of a GIANT reality check. I would say small claims court but if you got the law involved he would get arrested. You've given him an opportunity to make it right. Now threaten with law enforcement getting involved. ",
            "Tell your sister to stop enabling her son, make him get a job in a warehouse or grocery store where he'll have to do physical labour which WILL help him lose some weight, and work out a reasonable payment plan for the inhalers. \n\nYour sister isn't doing your nephew any favours, and if you love either of them, you should probably make that abundantly clear. ",
            "He needs tompay for the inhalers or his mom/dad do.\n\nYour son does need them for medical purposes. Your nephew doesnt; He just needs to learn how to get a proper healthy diet/exercise regimen for himself ",
            "You can't parent other people's kids against their will. But you can cut off your own relationships.\n\nSocially (assuming this isn't big enough to involve the law), you can't make him pay, period. You can ask, but he seems like a shit that wouldn't. The problem is he is also an adult legally (and barely socially), so having your sister pay for him is tough. You can graciously accept, but actively seeking it from her would be bad taste and hurt your relationship.\n\nI think it's probably best to let your sister know it's really fucked up of him to do, but not take it out on her too much. She didn't do it and he's 20 for Pete's sake, parenting failures have long been committed and it's a hopeless cause now. I straight up would tell her and him, that he is no longer welcome in your house. Family party or not, he is a black sheep and needs to grow up and own up to his mistakes. You are family and you can work past this, but it isn't going to be by letting someone act like a pampered brat and slide by.\n\nAlso this goes without saying, but it's far beyond monetary compensation. He put your son at risk. He needs to fully understand that and apologize to everyone involved. I'm summary disown your sister's kid, and mitigate the fallout with your sister—do not villianize or demean her.",
            "Nephew is an idiot. No one will look at him and think he just has asthma and isn't out of shape. He's put a child's life in danger for a lie no one will fall for.\n\nYour sister needs to know that her son put your son's life in danger. He took multiple prescriptions - which is against the law - which puts your son at huge risk and is a large unnecessary financial cost to you. Tell her calmly that her son needs to do something to repay you (chores, maybe? It might help the damn manchild develop a work ethic too) and it'll help him learn to attone for his shitty behaviour.\n\nWorst case scenario, go to the police. If his mother is enabling his immature behaviour (stealing, lying, not talking to you), he'll do it again and put other kids at risk.\n\nDon't ever let him in your house again. You should not have to lock up inhalers to keep this man from stealing them.",
            "Oh hell no. *Do not* let this go under *any* circumstances. He stole something that your son has to have in order to continue breathing. He can not be allowed to get away with that. Tell her that either the inhalers are paid for and a formal apology given to you and your son or you will file a police report and have him charged with theft. I guarantee that she'll pony up in a heartbeat.",
            "Is she ready to pitch in for ER costs if your son had had an attack with no available inhaler?  Is she ready to pay fines for abusing rx substances for her son?  Is she ready to tell CPS that you are not responsible for harm coming to your son and your sons rx medication being in the hands of her son?  You don't mess with meds, especially life saving necessities like inhalers.  Nobody is acting appropriately here, imo.",
            "Oh man, and it was almost a perfect crime too. If he hadn't been caught no one would have ever known that he was fat and out of shape. And if he killed your son in the process, well then, I guess there would be no loose ends./s \n\nWhat a shitbag idiot. Call the cops. He could have killed your son.",
            "> cut him a break \n\n\n\nHe is 20 and should know stealing is bad. For fucks sake he stole from a kid. He should get a job and pay back when he can. Maybe your sister is just embarassed and wants this all swiped under the rug. \n\n\nAnd people can tell he's out of shape just by looking at him. He's not fooling anyone. And people with severe asthma can do stuff like climbing stairs without dying, Jesus shit. ",
            "Lets be honest. You are never going to see that money. I know it and deep down you know it.  Your sister has probably babied him his entire life and now he is a 20 year old manboy.  Chalk this up to a learning experience and never take your eye off your nephew if you choose to allow him in your home again. \n  Just be glad your kids won't grow up to be like this.",
            "My inhalers cost £7 for two. For me at least - yes they are cheap. ",
            "The messed up part is, if your nephew went to a doctor and complained about shortness of breath, there's a good chance the doctor would say \"That's because you're obese. Here's a referral to a nutritionist, **and a prescription for medication to help you breathe.**\"\n\nObesity can exacerbate existing asthma and make breathing difficult for people who don't have asthma. Nephew could get medical treatment for his breathing problem but would rather steal from the child. ",
            "wtf man. just slap this fat Piece of shit in the face still he stops fucking around",
            "Poor fat kid already has enough problems. For fucks sake reddit, you really think involving the police helps out the FAMILY situation? Jesus.      \n\nHe needs to pay and he should not be allowed in your home again, but damn the police is a bit much. ",
            "I feel sorry for your nephew, it sounds like he has major self esteem issues due to his weight/health problems.",
            "He stole it hoping it would make him lose weight. Um, abusing albuterol doesn't help as much as getting off your ass does. What a jerk. I'd file a police report - that's the only way you're getting the inhalers replaced.",
            "You should be angry, your nephew did an idiotic thing and endangered your son. \n\nThere seems to be an underlying issue: your nephew clearly is ashamed of himself for being overweight. \n\nIt's not your duty but maybe consider advocating for him with his family to get him to go to a therapist/personal trainer/gym. He's clearly not in a good place and probably can't reimburse you and picking a fight with your sister about this will probably aggravate your relationship as well. Helping your nephew can give you some closure and maybe even make you feel better in a way that they can't. And who knows, once he gets his sht together he might then come back with an apology one he realizes what's wrong with his behavior.\n\nTl;dr: your nephew's behavior is wrong but also raises red flags for his personal well being. Since you're unlikely to get the money without staining relationships consider being supportive of your nephew getting help with his problems.",
            "Stealing medication from a child who desperately needs it because he is embarrassed is pretty terrible. However, his cover story doesn't quite make sense though. Why did he steal all three of your son's inhalers? If you are trying to fake asthma, wouldn't you just need one? \n\nYes, he (not your sister because he is an adult) owes you money for three inhalers. Your sister should be pressuring him to pay you back. He's long past due for a lesson in responsibility. Don't let him back in your house or invite him to any of your events, and when other people ask why he's not at your family event, then let them know that he put your severely asthmatic son's health and life at risk by stealing all his inhalers.",
            "Is this infuriating as fuck? Definitely. I have asthma and if someone stole my inhalers just as I needed one is be pissed and out of breath at the same time. If they did that to my daughter? Super pissed\n\nHonestly though - no harm was done this time thankfully. Your overweight nephew should have been taught it's wrong to steal about a decade ago. I think an apology is the absolute least you should demand - not to you but to your daughter for endangering her health. He may be 20 but it sounds like he's immature for his age. It's not up to you to fix that but the least you can expect is a proper all policy from him to your little one.\n\nShe's right by the way. The smiley faces help. ",
            "I might get downvoted for this, but honestly, I think you should cut him a break with the money, but have a serious discussion with him. He needs to understand that he put your son in serious, life-threatening danger (I'd literally use the words \"he could have died\"), and that pretending to have asthma will not abate his insecurities - he will still be overweight. \n\nThe reason I'm suggesting to cut him a break is because he is clearly very ashamed of who he is, enough to do something so stupid. Perhaps if he had someone to talk to about his insecurities, to help him find other ways to deal with the cause of his actions, you will be able to help in improving your nephews well-being and stay on good terms with your sister. He might be an adult, but even adults who do stupid things (especially out of a place of pain) are worthy of compassion. \n\nThe loss of the money is unfortunate, it really is, but forcing it out of your sister's family in one way or another (even if it's right that they do pay it back) will not address the underlying cause, which means it's only bound to cause more problems in the future. Perhaps it will also show your nephew that treating people with compassion means to right his wrongs of his own accord. ",
            "I'd let it slide either way. Your nephew sounds like he's got a pretty miserable existence and even though he's 20 he's probably got the mentality of someone in their mid teens and he may not have known the cost of the inhalers or considered the danger he could have put his cousin in. I doubt he has health insurance and he likely took them because he thought they could help him breath better, since he would only need one if it was just a prop like he said. He's probably embarrassed and ashamed at this point and obviously it's pointless expecting him to pay anything back without an income.\n\nIf your sister can pay and she is just refusing, I would keep on her  but try to mostly move on for your own sake. If she struggles financially and can't easily afford to pay you for them I'd just let it go but tell her she is paying for dinner the next couple of times you go out together even if that doesn't cover the cost.\n\nEdit - God forbid one of the suggestions in this thread is to forgive, or have some empathy for those that wronged her(blood relatives), or even just to let it go despite being her being wronged just so she doesn't have this eating away at her. It's her nephew, not a stranger. She probably played with him as a baby and changed his diapers. \n"
        ]
    }
]