[
    {
        "post_id": "4fn80u",
        "author": "chopper86",
        "title": "UPDATE - My (30M) dog (1M) ate all of my girlfriends (25F) shoes",
        "url": "https://www.reddit.com/r/relationships/comments/4fn80u/update_my_30m_dog_1m_ate_all_of_my_girlfriends/",
        "score": 2604,
        "num_comments": 351,
        "created_utc": 1461157663.0,
        "selftext": "Update to my post here https://www.reddit.com/r/relationships/comments/4eftot/my_30m_dog_1m_ate_all_of_my_girlfriends_25f_shoes/\n\n\nI am getting a surprising number of PMs asking for an update so here it is. The general consensus from my first post was that I should buy a few key pairs before she gets home so I decided to go with that. It was hard because where we live we are transitioning from winter to summer so I had to buy winter boots, rain boots, sandals, runners, and various types of work shoes. Only about half of them arrived before she got home on Friday. I wish I could have bought them in person so I could have been certain they would be here, but I wasn’t able to since winter stuff is out of season and lots of the brands she likes are only available online.\n \n\nFriday I picked her and her friends up from the airport. When we got a second of alone time I told her about the shoe situation. She was pissed initially. She wasn’t mad at me or our dog but more mad that it happened. I decided not to tell her about the awesome closet that I built her while she was gone and just hoped that the surprise would soften the blow. On the car ride back she told her friends what happened and they really helped turn it into a positive event that she could laugh about. She would only get sad when she remembered shoes that she spent a long time breaking in. Apparently her Birkenstocks took two full summers before they reached max comfiness so that was what she was the most sad about, I feel fucking awful about that. I actually took those ones to a cobbler because I KNEW she would be most upset about them but they couldn’t be salvaged, they were too far gone. \n\n\nWhen we got home she wanted to see the carnage. I wasn’t sure it was a good idea because I was kind of expecting her to cry but she just thought it was funny. She had me make a small pine casket for the shoes while her and her friends got absolutely blasted and we buried them in the backyard that night. She did cry briefly at the funeral but she was a trooper nonetheless. Her friends decided it was only fair for me to purchase every pair of shoes she wants for the rest of our lives and I drunkenly agreed, a decision that I’m sure will cost me a small fortune, but I stand by it all the same. \n\n\nOver the past few days she has ordered all of the shoes she needed to replace the ones she lost. She only re-ordered around 10 pairs that she previously owned, so it was a good thing I didn’t go ahead and re-order them all. She already had a Pinterest of every pair she wanted and had deemed to be worthy of her collection which made it was a fairly quick process. All in all, it cost around twice what I had anticipated but she didn’t break up with me so I’ll call it a win. I’m just glad I was able to afford it, I couldn’t imagine how awful it would be to be in this position without being able to pony up. It’s going to set me back a few months on buying an engagement ring but I’m sure that won’t be an issue. \n\n\nFor everyone concerned about the dog, she isn’t worried about getting him trained more because he behaves perfectly otherwise. She said if anything, I need to be trained not to be a careless idiot. Joking aside, it was a fluke and we’re usually very good about keeping the shoes put away. I made the doors to her closet and our front closet self-closing so we don’t ever need to worry about leaving them open. Like my girlfriend, the poor guy can’t resist shoes so we don’t really blame him for what happened, in fact we are quite proud of what he managed to accomplish in the 12 hours I was away. \n\n\n**tl;dr**: everything went better than expected, my girlfriend is cool as a cucumber",
        "permalink": "/r/relationships/comments/4fn80u/update_my_30m_dog_1m_ate_all_of_my_girlfriends/",
        "comments": [
            "So you had a.....shoeneral",
            "[removed]",
            "Good for you for being a great BF, and good for her for not overreacting. My pup ate a fair share of my shoes when we brought her home and I was always upset, but really, there's no one to blame. Good luck with the engagement OP! Sounds like you found a good one! ",
            "\"She had me make a small pine casket for the shoes while her and her friends got absolutely blasted and we buried them in the backyard that night. \"\n\nSUPER! You guys are awesome. \n\nYou are a cool supportive boyfriend and she takes life's bad turns well. I wish you well in your happy marriage.\n\nETA: read about the closet. Made my day!\n",
            "\"Hey reddit, I found a big pine box buried in the yard of the house I just bought, apparently filled with ripped up ladies shoes, WTF.\"",
            "[deleted]",
            "This update is pretty adorable. I cannot stop laughing at the image of a drunken shoe funeral. I want to hang out with those girls. \n\nAll in all, well handled all around. Brilliant.",
            "You guys seem like a terrific couple with awesome friends. I'm glad it worked out.\n\n>I actually took those ones to a cobbler because I KNEW she would be most upset about them but they couldn’t be salvaged, they were too far gone.\n\nThis made me a little verklempt (stupid, I know).  Its great that you knew which shoes would be most missed.  And now I know why I haven't liked Birkenstocks.",
            "OP you should consider giving a pair of engagement shoes along with that ring! You guys sound awesome- wish both of you and the pup a great future together",
            "Do you have renters or homeowners insurance? There's a chance they might cover this. ",
            "Damn if money don't solve everything.",
            "> it cost around twice what I had anticipated\n\nOuch.",
            "[removed]",
            "She can also put bitter apple on the shoes that won't be ruined by it and that should keep the dog off/train him not to chew them.",
            "[deleted]",
            "[removed]",
            "[removed]",
            "[removed]",
            "What about the closet surprise?? Did she like it? Also, one of my pups LOVED shoes so she was given her own 2 pair to do with what she wanted. She quickly learned that those were the only ones she could have and we never had another shoe incident.",
            "I didn't realize I needed an update to this story until I got it. This whole thing is amazing. \n\nYou sound like a great guy and handled a tough situation very well. Your girlfriend handled it fairly and with grace. And the shoe funeral is just a perfect touch. It sounds like you guys have the communication, responsibility, level headedness, fairness, love, and humor to have an excellent, happy relationship for the rest of your lives. \n\nCongratulations to you both for finding each other and having the grace and humor to get through tough times!",
            "Oh my god, that's adorable. It's nice to see a nice post mixed in with the grab bag of cheating and abuse that is this sub. When you propose you should totally buy her some bridal shoes to present to her with the ring. Ask if she'll let you buy her shoes for the rest of your lives. :)\n",
            "your carpentry skills are pretty fucking cool man",
            "You, your gf and her friends are awesome!",
            ">Apparently her Birkenstocks took two full summers before they reached max comfiness so that was what she was the most sad about\n\nSerious first world problems here",
            "Incredible! This was a nice update 2 read.",
            "Great ending to your story! Esp the fuck in the closet lol. But I'm curious because you anticipated having to spend $6000 on new shoes but you said it cost twice that much? Did she order 12 thousand in shoes or am I missing a key detail here? Lol",
            "She sounds like an expensive girlfriend....",
            ":') You're the boss.\n\nI wish I had free shoes for the rest of my life. ",
            "What did she think of the closet???",
            "As someone who has two dogs, both of which I had when they were around 1, I am happy to say that they both outgrew the shoe eating. But we did exactly what you did. We didn't keep shoes around for them to eat. After a while, we would forget, and then it turns out they wouldn't eat them. Although if we don't walk the lab enough, she will pick up a shoe with her mouth as if she's threatening us. Which is fair. Don't walk me? Lose the shoe, jerk. So I walk her.",
            "This is now one of my favorite updates ever.  \n\nSo glad it all turned out ok! ",
            "How'd she like the closet?",
            "I once worked for a vet office and would always recommend the following. Combine the no chew and yes chew, when he chews on the no chew, make a loud noise take it away, replace with yes chew and praise the shit out of him for chewing on the yes chew. Most exciting day ever ha-ha. Good luck!! ",
            "Heh - wow.  Great update.  Gift idea (since she is awesome enough to find the humor in it,) a framed picture of the carnage (tell me you got one) maybe with a funny anecdote in quotes.  ",
            "You did good and your girlfriend sounds like a keeper.  I guarantee this will be a great story for the future...drunken shoe funeral (haha).",
            ">She had me make a small pine casket for the shoes while her and her friends got absolutely blasted and we buried them in the backyard that night.\n\nShe sounds awesome, haha.",
            "I remembered in the original you said you expected replacement costs to be around $6k, and you said in the update it cost double what you expected... so you spent $12k? Wow lol. One dog did a lot of damage.\n\n\nEither way, it seems like you have an awesome relationship. Enjoy each other, you sound like a great couple :)!",
            "So wait, you spent $12,000 on shoes? Omg I want you to be my boyfriend!!",
            "So not only you didn't do the damage and will have to cough up $12k but you ended up being happy about her not breaking up with you.  \nPay attention, ladies",
            "I guess it wasn't a defeet ;) after all... \n\nIs the door over there? Okay I'm leaving now ",
            "All I gotta say is; when you pop the question, put the ring in a shoebox. And you owe us all pictures of that moment.",
            "I'm glad it worked out well.  \nThis whole post just illustrates what a difference money makes I guess. If you (or you/she) didn't have ample money to replace her shoes this would have been a very different update.  \nOut of interest, how much is her engagement ring going to set you back?",
            "My dog was the worst when a pup, he used to chew up only guests' shoes, leaving us so embarrassed. ",
            "Glad everything worked out :D \n  \n  Regarding the Birkenstocks, would it be possible to take your girlfriend and the new shoes to a cobbler and see if there's anything they can do to speed up the breaking in process?  ",
            "What a great update! Congratulations on being one half of a beautiful couple! \nI wish you a happy future together! :)",
            "Photo of puppy pls",
            "You two both sound like great people. You are both lucky. I wish you guys all the best. ",
            "I was thinking about your post on the loo this morning lol.",
            "In the 90s when I was young and poor, my Jack Russell terrier ate a brand new pair of Doc Martins. Some dogs just love shoes. \n\nGlad your gf has been so awesome about this and you handled it well too. ",
            "You seem like a really cool dude and it seems like you have a great relationship with your girlfriend.\n\nAll the best dude, go enjoy life!",
            "talk about first world problems.",
            "Take the time to train your dog or he's going to chew up a visitor's shoes. Someone suggested getting a couple he can chew then training him that no others can be chewed. Someone suggested bitter apple to give him a shoe aversion, but figure out something.",
            "Be honest, you just posted this because you wanted to use (1M), right? Clever.",
            "[deleted]",
            "Love this update...and love your GF. Dogs will be dogs, it's up to humans to make sure they don't get into too much trouble. Get puppy lots of toys. I hate that my house is full of dog toys but I've not lost anything in a really long time thanks to it. ",
            "This was a hilarious update. You all sound like great people.",
            "Haha awesome",
            "What did she say about the new closet?",
            "Great update. Love the idea of the shoe funeral! ",
            "That dog ain't gonna shit right for a month...",
            "Nice work, man. Keep it up. ",
            "I love that you had a funeral for her shoes.   I have some shoes that I am very attached to and would probably do the same thing.  Glad you were able to get through a crappy accident and move past it.  ",
            "Have you thought about making an insurance claim? I mean I don't know your financial situation but that would really ease the shock of having to fork out ~~$6000.~~  Nearly $20,000!!!",
            "Sounds like she is real nice person! I'm a shoe lover and I'm not sure if I can handle the situation as she has. Glad for you both :) ",
            "OP, I've seen a lot of people suggesting obedience training but destructive behavior is often simply a result of a frustrated, under-exercised dog. Is your dog a large breed? You said he's a year old- he's still a puppy, no wonder he's acting up! How often are you taking him out and is he expending enough energy when you take him out? Chances are he's just bored. Try giving him longer walks, taking him for runs etc before you sink more money into an expensive dog trainer. ",
            "Does your house & contents insurance not cover replacing them? I know if this happened to me my insurers would either replace them with the same if possible or with money if not. All I would be out is the £250 excess.",
            "Re: Birkenstocks, check eBay and Poshmark. I prefer buying things broken in, and you can find pairs  that are broken in but  in great condition. ",
            "Am I the only one around here who is fascinated and slightly concerned about the GFs obsession with shoes? \n\nI mean thousands of dollars on a bunch of things just to put on your feet? There are so many more useful things that money could be put to. Can somebody explain to me how spending so much on shoes is justifiable?\n\nThanks for the downvotes in advance! ^_^",
            "She's a keeper. How'd she like the new closet?",
            "Your girlfriend is a keeper.  She really loves you, her reaction was amazing.   One of my major pet peeves and a huge red flag is when people treat their possessions with more value than human emotions.   Of course it was an accident but just the whole way she took it and didn't try to make you feel bad or guilty about it is really awesome and shows that she really loves you.  ",
            "I usually don't get girls who have a crap ton of expensive shoes but your girlfriend is super cool!! You're gonna have a great marriage!",
            "I'm so happy to read this update! Your girlfriend is awesome :)",
            "This is honestly one of the best updates I've seen. You two seem great, with how supportive you are and how... Acceptive she was of the situation and didn't seem to go over the top.",
            "I just want to say I wish /r/relationships was filled with more adorable, happy, well adjusted couple stories like yours. Everybody involved took this event in stride and made it a hilarious memory. I wish you both happiness and no more ruined shoes :) ",
            "I saw blasted and buried in the same sentence and was like... you shot the dog?!?!?\n\nAlso sounds like your girlfriend is awesome.  That's a keeper!!!",
            "I don't think you should worry about the engagement ring. I'd marry you for doing that alone! ",
            "Your girlfriend (and her friends) reacted so well to this. Seriously, I've lost my shit over 100 times less. Never let that girl go. ",
            "Your GF sounds like an awesome person, keep onto her. I probably would have cried like a baby for weeks ",
            "Your girlfriend sounds hilarious.",
            "This whole post is so great. You guys took something shitty and made it fun and memorable. ",
            "You have found a gem! She's worth every single penny you spend on shoes :)",
            "[deleted]",
            "*Eye Roll*, I can't believe you won't train the dog. Good luck to your next visitors. ",
            "[deleted]",
            "[deleted]",
            "The dog only did her a favor by chewing the Birkenstocks. Hideous shoes.",
            "This is too funny. I love the fact you guys had a funeral for the shoes. That's epic. I'm glad everything worked out for the best. ",
            "She sounds like a keeper",
            "Wife her.",
            "lol at you including the dog's age.  Also, point cat.",
            "Dude you need to crate train your dog. You're asking for a very serious pet bill or even death of you don't. My neighbor lost a lab puppy to this exact thing because the shoe parts got lodged in his intestines and he died.\n\nPlease be a responsible pet owner.",
            "That woman is a saint. You're very lucky."
        ]
    },
    {
        "post_id": "f036gj",
        "author": "I_am_so_lost_again",
        "title": "Update: Midlife Crisis or the end of the Honeymoon Period?",
        "url": "https://www.reddit.com/r/relationships/comments/f036gj/update_midlife_crisis_or_the_end_of_the_honeymoon/",
        "score": 2605,
        "num_comments": 68,
        "created_utc": 1581040060.0,
        "selftext": "Well, I thought I would update everyone.\n\nOriginal:   [https://www.reddit.com/r/relationships/comments/e1hwe1/midlife\\_crisis\\_or\\_the\\_end\\_of\\_the\\_honeymoon\\_period/](https://www.reddit.com/r/relationships/comments/e1hwe1/midlife_crisis_or_the_end_of_the_honeymoon_period/) \n\n&#x200B;\n\nI (34F) had a nice short talk with my BF (46M) tonight.  \n\n&#x200B;\n\nWe started talking and at one point he told me \"I don't want to live together\" and I said, \"Then I think we should see other people.\"\n\n&#x200B;\n\nIt was odd because he seemed relieved.  I'm hurt but hey, I guess that's what needed to be done.  We are still friends, we have always been since we met.  We do a lot of work together so I know it will be weird but I actually don't think it will be that different.  \n\n&#x200B;\n\nThank you, everyone, for your suggestions and support.  \n\n&#x200B;\n\nTL:DR: 8 years not wasted only lessons learned.  On to the next step of my life.",
        "permalink": "/r/relationships/comments/f036gj/update_midlife_crisis_or_the_end_of_the_honeymoon/",
        "comments": [
            "This is sad but ultimately good. It seems like he never really wanted the relationship to continue or develop but lacked the courage and courtesy to tell you that straight so he just half assed it until you left. You, being seemingly a nice and supportive person, then suffered through that for years.\n\nTime to move on. For a while I suggest you avoid him to the extent you can. I realise you will cross paths but given he is, well, fucking lame, he may decide he made the wrong choice. You shouldn't let that happen.\n\nTime to go date. You need a change of scene. Use those weekends you got back to expand your social options. Join a dating site. Try a new activity. Your now-ex was not abusive perhaps but was stifling you. The right person will want to set you free then fly off alongside you.",
            "> 8 years not wasted only lessons learned. On to the next step of my life.\n\nExactly! You will be just fine. You may want to take a breather from talking with him for a bit just to help you clear up your mind.",
            "I hope one of the lessons you learned is to be a better advocate for your own needs in your next relationship. Decide what *you* want from a relationship and don't settle for anything less.",
            "Honestly, good for you! You reassessed your situation and realised what was going to be best for you. A LOT of people will just stay on those situations and be unhappy. So props to you for deciding that it wasn’t good enough anymore, even if he truly is a lovely guy and your relationship spanned almost a decade. Sending much love your way!",
            "[removed]",
            "I might suggest you learn that never spending the night with someone is a red flag. And you should be over their home more times than years you’ve been together. You deserve, and *will get*, so much more from someone. It may take time, but you do not deserve these relationships you keep finding yourself in. Demand more for yourself.",
            "Emotionally unavailable men are seriously the worst. Sorry this happened to you but like most commenters said, not a waste of time, just lessons learned.\n\nI broke up with my ex of 4.5 years who couldn’t commit to me last year. I felt like I had wasted so much time too but now I’ve met an incredible gem of a human and I truly believe that the timeline was exactly how it was supposed to be. \n\nYour next chapter might just be the best one yet!",
            ">It was odd because he seemed relieved\n\nHe probably was relieved. I don't doubt this is something he's thought of and worried about for ages but didn't know how to tell you.",
            "After reading your original post I am inclined to be really happy for you. He clearly was not committed and nor was he a good boyfriend in anyway. One person mentioned your 'normal meter' being off. Due to your past abusive relationship and this latest one I would really advise you to seek therapy. Only having 2 long term relationships in your adult life that aren't normal at all have you offset in terms of what a healthy adult relationship should look like. \n\nWhen it comes to this guy, don't look back. From my point of view being friends is honestly too generous but that is just me. I hope you get some professional help to learn and understand healthy relationships and the normalities that come along with them. You deserve someone who values and shares your needs and desires in a relationship! I truly hope you find that!\n\nBest of luck OP! You have a bright future ahead of you and this looks to be an amazing fresh start to achieve what you want, no matter what that may look like!",
            "I read the original post.  This is for the best.  He was controlling... but not as much as your ex.  And not inviting you ti his place when your shower broke was messed up.  Your next partner needs to be more caring and more focused on common goals.  Good luck.  It can only get better.",
            "It'll be the most freeing decision of your life, you won't regret it in the long run. When you're ready find someone who loves you and the animals with no conditions and doesn't make you seem like second best. You're worth it!",
            "I really like your TL:DR. That's a great attitude to have.",
            "This is the best thing that could happen, OP. Please take some time to work on yourself and don’t get into another relationship like this again.",
            "I just wanna say, good for you OP. Difficult situation to navigate but you seem to have done it flawlessly. \n\nIMO you will never be sorry you gave someone you cared about, the benefit of the doubt, that you could get on the same page. Sad when you realize it won't work but you hopefully know so much more about what you want and need now, that your next relationship will be significantly better than this one. Good luck!",
            "Sorry that it turned out this way. \n\nStay strong, you will be OK!",
            "Why be friends with someone lacking the decency and respect to be honest with you? He’s a coward that wasted your time. I am happy you are being positive about it but damn... asshole.",
            "I wouldn't even keep him as a ”friend.” He wasted 8 years of your life half-assing the relationship instead of letting you know sooner that he was not interested in building a life with you. He’s a POS and I would throw him all the way into the trash. You don't have to be friends with the people you work with, you can just be cordial. There's a big difference.",
            "8 years? That’s my worst fear. Glad you got out now though. \n\nI guess communication really is the most important thing.",
            "I'm amazed and your strength and your words. This is inspiring. I truly wish you a wonderful life <3",
            "very strong of you to go ahead and move forward. I'm proud of ya.",
            ">only lessons learned\n\nI think this is how you (the general you) need to view all relationships. Don't think of failed relationships as failed relationships, but as of lessons learned and knowledge gained.  Unfortunately, it took awhile to find out those lessons, but I think you're always better off in the end.",
            "Good on you for having the courage to have this conversation.  I hope the future brings you good things!",
            "I’m sorry that your heart hurts but you did the right thing, and you did it flawlessly. It takes a lot to recognize and an issue and make a decision and follow through with it. I’m proud of you.",
            "Good for you. I used to work with an ex and had to deal with him constantly. If there’s a way to remove yourself or switch with someone so that you don’t have to see him for a bit, I would do that. I thought I could handle it but honestly it was tough. It’s part of the reason we lingered off & on for a year afterwards.",
            "You were stuck in a holding pattern with him.  This was a difficult but necessary step.  It's too bad it wasn't done years ago but thinking about what could or should have been is a waste of time.  Whatever lies ahead is full of potential, and that is what makes life interesting!  Congratulations on getting to this next step!",
            "I'm glad you'll be moving forward. It's important to know you deserve the life you want!\n\nBut please don't sleep with him again. You'll fall. On the fwb path again.",
            "You should shift your concept of what a friend is. If you have to work together, you should be professional and cordial at best. \n\nBut if a friend of yours had no shower for a week, you would let that friend shower at your place a couple times. He couldn't even care to do that for you while together. \n\nHe was not a friend to you. Think about what that means moving forward.",
            "I'm kind of concerned that you're still friends with someone who valued you so little and treated you that way, but it's a step in the right direction and I hope it works out.",
            "Run and get out NOW! You're literally wasting your life being with him, you have 1 life and you need to live it.\n\nBTW, weekends aren't just for cleaning... Get out and do stuff for fun, unless you like to clean then go for it!"
        ]
    },
    {
        "post_id": "4m6h1y",
        "author": "PeruvianSpiderSnake",
        "title": "My [30s] BIL [30s] tried to ruin my wedding. He is upset I cut the stupidity out of my wedding video.",
        "url": "https://www.reddit.com/r/relationships/comments/4m6h1y/my_30s_bil_30s_tried_to_ruin_my_wedding_he_is/",
        "score": 2601,
        "num_comments": 504,
        "created_utc": 1464862142.0,
        "selftext": "I [34F] got married to my boyfriend Dan [35M]. We have been together for 5 years now. We have been married two months now.\n\nDan has two siblings. Moira [32F] is great, I love her like my own sister. Smith [30M] is kind of a weird character. He is fun, in small doses. I am not annoyed with him so much as perplexed. He seems stuck in middle school. \n\nMy wedding had a lot of small problems. I had a kid throw up on my dress, so I wore my MOH's dress while she changed into her street clothes. I tripped going up the stairs. Dan dropped his ring down the vent. One of my cousin's children knocked over a pile of cupcakes. For the most part, no one did anything on purpose and we have it on tape, which is hilarious. \n\nThere was one incident that felt intentionally done to make my day harder for me. It was done by Smith. During the actual vows, when the priest [60sM] asked if anyone protests, forever hold your peace, Smith stood up. He said he was in love with me and didn't think I should marry his brother. Then after a few seconds of silence, he said 'wrong wedding' and walked out. I could hear him laughing about it. \n\nI have a little brother [25M] who was prone to stupid shit like this when he was 11. I have learned not to take it personally, I work with kids. I am used to Smith. I just felt it was stupid and made him look bad more than me. I didn't want it in the video and asked the videographer to take it out. I didn't bring it up again, I let Dan handle his family like we have agreed. I think he spoke to Smith about it, I know my MIL [60s] gave him a stern once over.\n\nI let it go. I didn't really think about it much until we got the video and pictures. Smith was over while my cousin Cindy [40F] was. Cindy asked to see the video and pictures. I turned it on, showed her the video. It was hilarious. It was loving and beautiful. It also didn't have Smith doing something stupid. \n\nSmith got upset about it and said we kept all the other bad stuff, why not him. He was part of the wedding excitement. He was funny. Why didn't we keep it in? \n\nI told him I didn't think it was very funny, he did it to piss us off, and I didn't want it in my video. I said no hard feelings, it wasn't funny is all. \n\nSmith left and is actually upset about this. He has been texting Dan saying how I changed him, blah blah.\n\nI am just not sure how to go forward from this. I feel like I am dealing with a toddler. How do I explain to Smith that he could have ruined my wedding, and most women would have flayed him alive and told him to never come into their home? I feel he owes me an apology, but don't really care that Smith thinks he is funny. I just don't want to deal with hissy fits. So what do I do? \n\n\n**TL;DR** BIL made a stupid joke during my wedding vows and is upset the guy edited it out. NOt sure what is up? \n\n\n",
        "permalink": "/r/relationships/comments/4m6h1y/my_30s_bil_30s_tried_to_ruin_my_wedding_he_is/",
        "comments": [
            "What an intense idiot! Holy crap, he really thought that was funny?\n\nYou keep doing what you've been doing so far: Let your husband deal with his family.\n\nTell your husband how you feel, and that you need this adressed with his brother.",
            "He wants attention, don't give it to him. Ignore completely.",
            "The difference between the two is that he did this to purposely be recorded, to purposely be a part of your day. Everything else was an accident that's just a silly addition to the day and the memories. That's what he needs to understand.",
            "You literally couldn't have handled this with more calmness or grace. I was amazed while reading this how cool headed you were and are being about it - I can't say I would've done the same.\n\nI honestly think you should trust your gut - if Smith continues to sulk, point out to him how you're just trying to move on and \"you're lucky I'm not freaking out about this and demanding an apology, which I deserve by the way\". You didn't find it funny, he has to get over himself and chalk it up to a loss. It seems pretty clear everyone in his family agrees with you that it was dumb? He'll have to sit with that knowledge and get over himself.",
            "> Smith got upset about it and said we kept all the other bad stuff, why not him.\n\nBecause all the other stuff was *accidental*. No one planned for the kid to throw up on your dress, or for Dan to drop his ring, or for the other kids to knock over the cupcakes. \n\nSmith had some stupid idea of interrupting your vows for a laugh, and probably thought the joke was sooooooooo clever. My guess is that not a single other person laughed, did they? It was just an awkward interruption to make him the centre of attention for a minute.\n\nIt looks like you've already explained this to him, so just treat him as you would a two-year-old. Ignore him, ignore his hissy fits, ignore his attempts to be the centre of attention.  ",
            ">I let it go.\n\nYou are a queen among women. \n\nJust ignore him.",
            "If he wanted to keep that moment (of trying to ruin your wedding and looking like an ass) for posterity, he should have hired his own videographer and paid for it.  As it is, it's your and your husband's video of your wedding, and the two of you had the right to edit it however you wanted.\n\nI would tell your husband to talk with the BIL, if he keeps sulking and acting like you've done something to him.  He sounds like a big baby who wants to be the center of attention at all times, he just has to deal with not getting his way.",
            "He's an idiot, I'd like your husband deal with him like you did at the wedding.\n\nWith that said, I'm SHOCKED you think someone puking on your dress and you wearing your MOH's dress is a \"small problem.\" You are clearly the most chill bride of all time, haha. Also, how bad did that kid's mom feel?",
            "I am assuming your husband pretty much agrees with your piont of view? If let him deal with Smith and now you know how he will be for any other big events, he is insecure and he created drama to shift the attention back to him. I think he is somewhat jealous of your husband.",
            "Your patience and grace are unimaginable to me. You seem like a pretty incredible person. ",
            "He honestly sounds like an idiot instead of an asshole. Like he was trying to make you laugh.\n\n\nIf you guys do anything, your husband needs to sit him down and give him some real talk. That it wasn't personal, but that what he did was really immature, vows are important to people, and 99% of people would not have found that funny, in fact, most would be pissed.  He kind of needs to be talked to like the 11 year old he acts like. \n\n\nYou guys seem to handle everything well...congratulations on the wedding!\n\n\nExcuse me while I go panic about the idea of a kid puking on my wedding dress....",
            "I'm assuming no one laughed but him, so it's weird he'd want his bombing to be preserved forever. ",
            "What a maroon. I'd just roll my eyes and ignore him and let your husband deal with it. You're not going to get an apology.  \n\n",
            "\"Smith, this wedding was a one-time, very important event for [Dan] and [me]. We intend to be together for the rest of our lives, so it's not like there would ever be a do-over. I thought we had a good relationship, but based on what you did, I'm not sure that you care that much about [me] very much at all. Is that really the way you feel?\" \n\nThis is my lawyer-lady diplomatic response, my gut response was: BURN HIM. Also - you're not married to Smith, so eff Smith. Whew, okay, I feel better.",
            "You just let that go?! Wow you are a saint! You've already handled this admirably. Let idiots be idiots. Funny enough in Canada, pulling a stunt like that at a Wedding is a Criminal Offence \"Disturbing Religious Worship or Certain Meetings\", not sure which country you are in, but there's a chance that he actually committed a crime for a few luls. So no, it isn't funny, and I don't blame you for taking it out of your video. Just keep ignoring him.",
            "What a fucking brat. Unacceptable behavior at 30yo. God, I'm sorry, it's just disguising, and for him to get mad about it beats all I've ever seen. I'd be cautious inviting him to any more important events. ",
            "Note to self: don't invite children to wedding.\n\nOnto the actual advice: you've been remarkably graceful about this whole thing, but it's time for you and your husband to stop engaging with Smith. The whole thing is frankly pathetic and more than a little concerning that he still behaves this way at his age. He tried to make your wedding and vows about *him* and now he's salty that you handled it as you saw fit. \n\nDo not under any circumstances apologize. Continue to let your husband handle his family. ",
            "I think \"hahahahaha\" is a valid reply to Smith. \nSeriously, if your husband is siding with you, just let Smith have his tantrum. No amount of explaining will work because he probably doesn't want to understand it and it just further buys into his attention seeking. Given the type of person he seems to be you probably won't get an apology, and it honestly wouldn't be the hill I'd die on if he makes it more dramatic within the family. Just let it blow over, and deal with his hissy fits like you would a toddler's: ignoring them. ",
            "How is this guy 30??  He sounds like an attention seeking brat.  \n\nI tend to believe each SO should deal with their own families, so I think it's your husband's job here to ride herd on his brother. But honestly, I don't think you should do much \"explaining\" here.  At this point, Smith either understands that he fucked up and is doubling down because he can't admit it, or he really is so far up his own ass that he doesn't get it.  Your comparison to a toddler is a good one... don't reward the tantrum with attention, don't let him think he can make you justify yourselves if he just throws a big enough fit.\n\nIf your husband does talk to his brother, it's imperative that he NOT frame it as \"you upset my wife\" but rather \"you upset *us* and made a really uncool joke at a wedding we spent X amount of time and money putting together.\"   Your BIL needs to hear that this is coming from Dan as much as, if not more than, you.  But honestly, I'm not sure Smith is worth even that much of a conversation.",
            "Smith's got zero validity. He tried to usurp your day with his joke, and is now upset that you didn't let him. He also apparently can't tell the difference between legitimate accidents and deliberate befuckery, or figure out why you might want to remember one and not the other.\n\nJust don't engage with him on this, because there's no \"winning\" with someone who is on the kind of ego trip he's on. Don't defend yourself, don't rationalize, don't justify, just flat out don't talk to him about it. It takes two to tango. He can try to create all the drama he wants but it'll go nowhere if you refuse to play.\n\n",
            "He's mad about the video? He's lucky he wasn't dragged out of the church by his ankles, barely conscious. He got off easy. ",
            "If he's not a good old fashioned run of the mill idiot then he is someone who thrives on attention. What sane person disrupts a wedding for shits and giggles?! Let Dan deal with him. Don't acknowledge his tantrum, don't expect an apology cuz you ain't gonna get one, pretend his butthurtery never happened and pretend like everything is normal, the only way to \"win\" with attention seekers is not to play. ",
            ">I feel like I am dealing with a toddler                \n\nYou are. Respond as such. Just as if one of the kids you work with was throwing a tantrum.",
            "He wanted the attention focused on him during your actual wedding ceremony, and clearly didn't care about your comfort or happiness then (accentuated by the fact that he walked out following his stunt and didn't care to watch his brother get married!), so why do you think he would feel any differently about the wedding video? He is the problem, not you. I'm guessing he does attention grabbing stunts all the time, not just with you, and while your husband might have gone along with it when they were younger, he's grown up a bit since then but Smith hasn't. If you want to try to address it, discuss with your husband first and then maybe ask Smith to coffee and an overreaching conversation about wanting to connect with him on a personal level, and get beyond this joking pull your pigtails stuff he's currently relying on for personal attention and connection. ",
            "Does anyone ever outright TELL these douche-aircraft carriers that they're doing it for attention because they think the universe should revolve around them? I mean in those words.\n\nBecause rolling your eyes at them and telling them off without saying those words DOESN'T GET THE MESSAGE THROUGH. ",
            "Just ignore him.  Like a toddler, any attention is simply rewarding him.\n\nIf he has really never apologised for what happened I'm amazed you let him come to your home... but it sounds more like Dan's failure to stand up to him or set proper boundaries that is the issue.",
            "Next time, keep a pacifier in your purse, and when he starts again, offer it to him for self soothing.\n\nIf he is acting like a baby, treat him like one. \n\nI mean, he won't mind it because it's funny, right? Just like he expected you not to mind his 'joke'.",
            "Just remind him no one was laughing but him, which means it wasn't funny.",
            "\"I'm truly sorry for the hardship you've suffered from me removing you from our video, please accept this  $500 dollars as token of my thanks for your inclusion in our wedding day. \n\n\nOh, sorry, wrong apology\". ",
            "Never wrestle with a pig, you both get muddy and that pig likes it. Ie. You cant reason with a toddler. Its my understanding that if someone speaks at that point in a wedding in the UK, joke or not the wedding has to stop. Or maybe that is an urban myth.  You handled this with grace, he is a plonker.",
            "Honestly this is exactly why most ministers won't do that part of the wedding now.  It isn't funny, and it just goes to show how immature your BiL is.  Don't do anything. This is a way to try and get attention, just ignore him or have your husband deal with him. Also to be honest you are dealing with a toddler like mentality.",
            "Tell him that you had it removed because it was an attempt to ruin the wedding. If he retorts about the other incidents, tell him \"No, those were accidents. They were not a deliberate attempt to divert attention away from me and husband, *your* stunt was. It was all about you, on a day that was supposed to be about US. This wasn't an audition tape for your comedy routine, it was our wedding. Something we only get once. I unfortunately have to live with the memory of your interruption, but I don't have to posses it on film.\"",
            "[deleted]",
            "I read not too long ago that in some country, if someone stands up and objects, by law the wedding stops. This prank could have been costly. ",
            "Just as a side note you have taught me to never invite kids to a wedding. ",
            "If Dan used to be like Smith I hope you did change him!",
            ">I am just not sure how to go forward from this. I feel like I am dealing with a toddler\n\nHandle like you would a toddler.  Ignore it.",
            "Cut him off-your husband needs to shut him down HARD-not just roll his eyes and say \"thats just Smith.\"\n\n\"What you did wasn't funny and no human with even a modicum of good sense would think it was anything other than stupid and disrespectful.  I don't want your stupidity memorialized on MY wedding video.  You are free to ask the video service to make you your own copy since you seem to think you played a starring role.\"",
            "Classic case of someone who, as my father used to describe it: ' has to be the bride at every wedding and the corpse at every funeral'.",
            "He's probably just embarrassed that his hilarious prank went over like a lead balloon. He might have even been planning it for days expecting a better response. Since it was just 2 months ago, learning that you cut it from the video reopened his raw wound a little. Lashing out at your husband / his brother was just to ease his pain. That doesn't make it right, but that's why he did it.\n\nAs an isolated incident, this isn't that bad. Just wait for it to blow over on its own. You sound over the actual stunt anyway, no reason to rehash it any more than that. Hopefully after this fallout your BIL learns that his juvenile tendencies don't go over so well with you guys. Maybe he doesn't, and then you revisit this issue in the future if it builds to unbearable levels.",
            "Holy shit this sounds just like my dad. He loves telling jokes, making people laugh, no matter how dumb he looks or if it hurts anyones feelings, his main goal is to get a laugh and he will try as hard as possible to get it. When we don't laugh or when we don't find it funny or get our feelings hurt, he gets very sensitive and huffy. \n\nAt first I would always laugh because I felt bad and didn't want him to react the way he usually does. But now, I ignore him or act like I didn't hear him and if he reacts that way I still just don't say anything. Because why should I change the way I act around someone that I not only care and love about, but should be doing the same to me. \n\nIf this situation happened to me, I don't think I could ignore it simply because that was MY day and NOT his and he did not need to interrupt like that.\n\n I think you should let him know it hurt you, or at least made you upset, and talk with him about it like adults one on one. If anyone else is in the room he might throw a fit (like my dad does) to see if anyone is on his side and get even more angry to see no one is. So keep it between you two. I'm sure it will blow over after that.",
            "This brings back memories. Something very similar happened when my father got married for the second time. One of my uncles also decided to jokingly (and loudly) protest. \n\nIt's been 25 years since then, and it still gets brought up every now and then, but never by my uncle (who has since passed). Thankfully there were no video cameras around back then for the wedding. \n\n\nI think you should have your husband have a talk with his brother again and explain that there are limits to how far you carry a joke, and that while he may have found it funny, the two of you did not, and you would rather not have the reminder whenever you watch the video.\n\nYou can also mention that there is a clear difference between the other accidents and his intentional joke.\n\nIf he doesn't respond to you with an apology along the lines of \"I'm sorry. I thought it would be funny, but I guess I hadn't quite thought about how you might feel\", well then to hell with him. He clearly doesn't care about your feelings at all.\n",
            "Sounds like there might be some legitimate mental disability at work there... Has anyone in his family ever considered this?",
            "it was your wedding, your video.  It's his tantrum.  Treat it like one. ",
            "I scrolled down and I might have missed it but I didn't see anyone else suggesting that he might actually have some mental issues--clearly there isn't enough context here to make that judgement but I can't imagine any fully mentally developed adult finding that appropriate. ",
            "First of all, you are a saint. I've heard tales of the bride and groom going no contact with people for things as small as wearing the wrong dress to their wedding. \n\nYour BIL sounds like an absolute child. He did it for attention, and now he's upset because you didn't let him get his way and took his pathetic, tasteless joke out of your videos, denying him attention in the future. When he tells Dan you've 'changed him', he's saying 'you're not enabling my jokes now!' \n\nHow you proceed is up to you. If I was in your shoes, I'd ask Dan to text him a verbal smackdown, but that's probably more my style then yours. It may benefit y'all to just ignore him. Like the child he is, he's pouting and making a scene because he didn't get his way. He'll run out of steam eventually, and if he sees that you won't bend, maybe it'll get through his head it wasn't okay?  ",
            "Your wedding, your decision. He is pissed because he has learned that he is not funny but a nuisance. Let him be angry, that will show him to not ruin other people's special moments.",
            "He is lucky you didn't punch him in the face during the ceremony. ",
            "Sensible people, even jokesters and pranksters don't interrupt a wedding ceremony. Maybe make a joke toast during the reception, but never with the intention of making yourself the center of attention. That's bad taste and immature. ",
            "OP, Smith could have actually ruined your wedding. The Priest can take these things seriously and is obliged to defer the wedding and investigate the claim if he see's fit. \n\nSmith is incredibly childish and props to you for not going apeshit. Your husband needs to carry on dealing with his family, you've done your part.",
            "It's only a game if both people want to play.  <--- What your BIL is missing.",
            "I actually did this at my brother's wedding, except the bride burst into tears and admitted she felt the same way about me. Not wanting to ruin the joke, we then ran off together and got married. It's been 20 years and I've still not found the heart to tell her it was a joke. \n\nThe last thing you need is someone validating your BIL's shitty sense of humor. He may be learning finally that these things aren't so funny. I'd put it on your husband to let him know this. The guy is a RL troll and surprise this only seems to work online.",
            "You've handled the situation perfectly and should just not engage it any further.\n\nIf he wants to carry on about his \"hilarious\" bit that didn't make your wedding video just let him.\n",
            "I'll be honest, I've JOKED about doing this at a friends wedding but I Just Joked. I would never ACT on it because as you said.. It's a childish thing to do...",
            "Smith is a *real life troll*. Ignore him and pray that your kids don't get whatever genes he got.",
            "It's not funny when you are the only person laughing! It's incredible that he is 35 and still hasn't learned that. I might have been more understanding if he were 20 and still learning the ways of the world. ",
            ">I am just not sure how to go forward from this. I feel like I am dealing with a toddler. How do I explain to Smith that he could have ruined my wedding\n\nDon't even bother trying to explain it. He's not going to get it. You are doing the right thing by letting it go and removing it from the video. He is like a child who wants any kind of attention, whether it's negative or not. Ignoring him is the best way to not give him what he wants.",
            "Wow, him doing his joke at the reception would have been drama llama enough, but at the ceremony? Actually interrupting the priest at the church? Even if you are not religious yourself anyone should know that's wildly inappropriate and disrespectful not a fun prank.",
            "You dealt with it perfectly. Let him sulk like the middle-schooler he obviously is.",
            ">I am just not sure how to go forward from this. I feel like I am dealing with a toddler. How do I explain to Smith that he could have ruined my wedding, and most women would have flayed him alive and told him to never come into their home?\n\nYou treat him like a toddler.  Toddlers don't understand logic and reason.  So you just say \"No!\" and leave it at that.  You can also use \"Because I said so!\"\n\nAnd he sounds like a real asshole - this is a wonderful excuse to severely limit your contact with him.  I highly suggest using it.\n\n",
            "You let him be upset. This isn't your problem, you're not his mother and he;s not a child. He is an adult man responsible for his own actions. If he complains about it then tell him to fuck off and behave himself like an adult. ",
            "It feels like you are dealing with a toddler because you are dealing with a toddler, hence treat it as such. The same methods of dealing with a child's tantrum should suffice.",
            "He's like someone who wears white at the wedding, drawing attention. \n\nIf he keeps getting salty after enough time to process the dick move, guess push the point other stuff was an accident and this was intentional. It was at point about vocalizing that you don't like the wedding, so it felt like a personal hit or soured the big moment. Plus its your wedding and you can edit the footage how you like, he can do the same for his wedding if he wants it to be a prank video. Maybe thrown in a the footage also makes him look really bad and not funny, depending how he'll take it. Been to wedding where a group did this style of joke, so cringey ",
            "Don't do anything. Let him wallow in his own hissy fit.",
            "Not that it matters now to you, but for other readers, this is why a lot of people don't include the \"speak now or forever hold your peace\" part. It easily avoids this possibility and really isn't needed.",
            "He absolutely has the emotional maturity of a toddler. He did it for attention at the wedding, and now he's sulking because his attention-seeking moment won't be witnessed by posterity. \n\nDon't respond at all because any attention he gets (even negative) is just giving him what he wants. Just let him sulk himself out.",
            "Honestly, it doesn't matter if he gave you guys the greatest speech/song/preformance at the reception as a surprise gift. \n\nIt's your wedding and you control what you want on the video. \n\nYou didn't like what he did and asked the videographer to edit it out. \n\nYou did nothing wrong. ",
            "My advice? Show him this thread. He thought he was funny? let him bask all the redditors who think otherwise. I haven't read all 417 comments (at this point), but I'd be surprised if a single one of them was on Smith's side.  \nThis is so cringeworthy, that if I saw it in a movie I'd either stop watching, or fast forward through it.",
            "Wow. So he is really that butt-hurt that you had his rude ass prank edited out of your wedding video? Plus he's even giving his brother that whole \"she changed you\" spiel? What a dick. The only person who has the right to be pissed off is you and it sounds like you were pretty chill about the whole thing. Most girls would destroy him for interrupting their wedding with that dumb ass prank that only he finds funny. \n\n\nYour husband should say something to him so he realizes nobody thought that little stunt was funny. He needs to get over himself and apologize. He should have let you have your day, but he decided to put a stain on it.",
            "Tell him to grow a pair ",
            "\"My wedding had a lot of small problems. I had a kid throw up on my dress, so I wore my MOH's dress while she changed into her street clothes. I tripped going up the stairs. Dan dropped his ring down the vent. One of my cousin's children knocked over a pile of cupcakes. For the most part, no one did anything on purpose and we have it on tape, which is hilarious\"\n\nOh god, I am never having kids at my wedding. Good for you for being so good natured, I would have cried and called the whole thing off by the time the ring was down the vent. ",
            "I don't think he did it to piss you off or to get attention. He did it because he thought it would be funny. He just an idiot. If you have tried talking to him with no result, then the best thing is to just avoid him.",
            "God he sounds like a moron. Is he in fact delayed a bit? I have a sister somewhat like that, I recently found out she is actually delayed. It's a long story but it explains so much of her social oddness, her strange behavior, and her child-like sense of humor. Your BIL may have a borderline IQ",
            "Pulling this prank makes your BIL an incredible asshole. Honestly, he tried to screw up one of the most important moments of your life. \n\nWanting this prank to be immortalized on your wedding video shows him being *committed* to being an incredible asshole. \n\nI would explain to your husband that BIL isn't welcome in any part of your life, or in your home, until he offers a genuine, convincing and sincere apology for his actions at your wedding. Seriously, I would not trust someone like that with any aspect of my time or company. I'd be waiting for the 'I stole $5000 from your line of credit as a joke, hahahah why are you upset it's a joke...'\n\nSeriously, I cannot imagine what kind of an asshat it takes to pull something like this, but to double down on it later? Be done with this tool.",
            "I'm a guy who doesn't really like weddings, and even I think he was out of order.  To then be upset that you removed him from the video is insane.  That you dealt with everything and even found most of it funny is amazing - just ignore him and continue to be amazing!\n",
            "Smith doesn't get to use your wedding as his moment of fame in the next youtube viral video...",
            ">My wedding had a lot of small problems. I had a kid throw up on my dress\n\nNOT a small problem. I'd have lost my shit. (I had a backup dress for exactly those types of fears, but still.)\n\n>when the priest [60sM] asked if anyone protests, forever hold your peace\n\nYikes. When I've been at weddings I'm always cringing when that line comes out for fear that some IDIOT will do that. I know it's tradition and all, but dear god\n\n>How do I explain to Smith that he could have ruined my wedding, and most women would have flayed him alive and told him to never come into their home?\n\nYEAH, I don't know that they would have used my wedding video for anything other than evidence at the murder trial. I'd have Rick Grimes'd him in the throat for that shit. \n\nUntil he understands to drop this, I wouldn't see him.I'm sure that your in-laws, who sound like reasonable people, would understand that you don't want to be harassed about something that he should never have done in the first place. \n\nGood luck and congratulations!  ",
            "Ugh. He wanted it on video so he could post it to YouTube and Facebook so people can tell him how hilariously funny he is. He would probably label it as being 'Epic!' Now he can't. You have ruined his chance at going viral. \n\nI have a mild desire to kick this guy moderately hard in his knee caps. ",
            "What sort of monster are you?  Don't you realize your wedding is all about him, the brother of the groom?",
            "Flay \"to whip or beat (someone) so harshly as to remove their skin\"\n\nI think you should just go with flaying.",
            "I didn't invite my SIL or her husband (my husbands brother to our wedding) because she acts inappropriate at weddings. We went to a wedding where she started telling people her favorite sex positions. We didn't want them there. It was a big deal and hurt feelings. \n\nAnyone who tries to intentionally mess up your wedding is an asshat. This guy is an adult that doesn't deserve the time of day. You handled it well. If he is pissed off, then good. Hopefully he'll realize no one thinks he's funny. ",
            "I must have missed the part where this was his wedding, and that he chose the videographer and was paying for it. Because those are the only reasons why someone would have a say in what was ultimately in the video and pictures of the event.  ",
            "What if he was serious and just saved himself when it obviously didn't give over well?  And now is offended you pretended his declaration never happened. Either way he is being stupid. I don't think a wedding is a place to object even as a joke. Like when people object at weddings, why couldn't you say something before the huge venue was rented and stuff. ",
            "Can't believe this guy is 30...",
            "It is the same idiocy which fueled his initial antic that now creates this latest outburst. Handle it like you did with the video. Ignore it happened completely.",
            "Your motivations for cutting him out of the video are perfectly acceptable. You are showing remarkable restraint and patience in this instance, I know brides who would have straight up murdered him.\n\nViewed another way, many women dream about their wedding day their whole life, and he intentionally tried to ruin that day for you because he thought he was being 'funny'. I daresay most women wouldn't have been anywhere near as charitable or forgiving as you. \n",
            "is your brother in law micheal scott",
            "nothing's up. he's a moron. let your husband handle him. it's not like he's about to grow up now.",
            "It's a video. He'll get over it, but he also needs to grow up, from what it sounds like.",
            "Wow, I can't believe how well you handled this. You have some real grace, patience, and tact. If Smith gives you any more grief, I would just remind him \"You know, most other women would kill someone who did that at their wedding. You're lucky I just cut it out of the video. I have moved on and so should you.\"\n\nHe's a drama-seeking adult child. Don't let him rile you up. He will never get it. He has his head stuck so far up inside of his rectum he will never get it.",
            "What do you do?  I say absolutely nothing.  \n\nYou are a sane person wading through the world which, among many wonderful things, is full of crazy people.  If you stop and interact with each of them on their level then you may as well be a crazy person yourself.  \n\nCrazy people are like the weather:  you wear a rain jacket but you don't try to reason with the rain.  And even if it somehow *insisted* you get wet, you could and should still leave your jacket on.\n\nYou owe nothing to the situation, and your BIL's emotional distress over this is his own responsibility to deal with.  ",
            "I feel like you said everything you need to say in your post.  He thought it was funny, you didn't, it's your wedding video, so you took it out.  End of story.  When he makes his own wedding video, he can put it in there.\n\nAs for getting an apology, seems unlikely.",
            "You're a saint. Your husband is lucky to have you. That said, you'll never get him to change his behavior or apologize in a heart felt way. So the best thing you can do is what you've been doing. Let family take care of family. \n\nYou're in your rights to cut him off. The fact you won't is so high road that my neck hurts looking up at you.",
            "Part of me is wondering if he expected your wedding video, and his contribution, to go viral with some click bait headline. \n\nAnyhow, nothing more to see here - Smith gets no apology. \n\nThis is the kind of thing you *maybe* joke about doing but you don't actually do.",
            "> I just don't want to deal with hissy fits. So what do I do? \n\nLet him throw his hissy fit and do nothing. Over time, this will show him hissy fits don't work on you.",
            "Let him pay for his own video if he wants. ",
            "Tell Smith in every masterpiece there are always great scenes left on the cutting room floor. Nothing personal.",
            "Pretty sure you don't need to do anything. Just drop it. Ignore him, and font engage. He sounds like the kind of person who is self centered and immature enough that common sense doesn't work on them. Just ignore it. \n\nIn a few weeks or months you can have a come to Jesus talk with him, or even better your husband does. It's his brother. ",
            "Do you have a mother in law or a father in law?  Because it seems to me that now would be a great time for them to sit down with Smith and explain to him exactly how inappropriate his behavior was, with, perhaps, added guidance about future hilarious jokes.",
            "What do you do with other people's annoying toddlers?  You ignore them.\n\nYour husband's circus.  Your husband's monkey.",
            "It's your wedding and your right to keep in the video what you choose. ",
            "I would say talk to him and say maybe it'd have been better if he had warned you and your husband beforehand. Try to get him to understand the sensitivity of the situation and how it could've been handled better. It's the same way I deal with childish acts and childish people. Don't scold them on what they did cause they won't get it, explain to them that it didn't work and what they could've done to make it work.",
            "You are dealing with a toddler... mom, mom, mom, mom, mom, MOM, MOOOOOOOM!!! LOOK AT ME!!!\n\n",
            "He'll get over it. Children get over stuff like this pretty quickly.",
            "So I guess Michael Scott from The Office showed up to your wedding. Honestly, I'd talk to him and tell him how you feel about the whole situation. But if he doesn't understand, ignore him and let him get over himself. He just wants attention, especially if he thinks he was the highlighted entertainment of the ceremony. ",
            ">I just don't want to deal with hissy fits. So what do I do? \n\nLet him throw his tantrum, and engage with him again when he's behaving reasonably.  Just like with a child.",
            "he is 30 and pulling that shit?  and shocked you didnt keep his stupid stunt as part of your memories video?\n\nsome people are too dumb to ever grow up",
            "Maybe he really is in love with you? No, but it seems like your H has this well in hand. ",
            "I just want to say, I think you've handled everything incredibly well. Just keep doing what you're doing. Ignore his hissy fit, he will get over it. He seems to be an attention seeker and if you don't pay him any mind he will see attention elsewhere. ",
            "You just ignore him. He just needs to learn to deal. Maybe your hubby should ignore his texts as well. Ain't no one got time...",
            "freaking IGNORE this loser. who cares if he's pissed? what he did was objectively tacky and, while you seem to be giving him the benefit of the doubt because he's a manbaby, I just think he's an asshole. adults don't get to behave like that for shits and giggles. I can't comprehend why he thought it would be funny to try to fuck up your wedding. but for the record, you seem so easy going and down to earth considering all of the complications. your perspective is awesome and it sounds like the day was lovely regardless. ",
            "Yeah, he owes you an apology.  You're unlikely to collect on it, though.  Probably just let it go, since it's out of the video.\n\nIf it were me, I'd be satisfied if my husband spoke to his brother, told him his \"prank\" was a childish piece of crap that NO ONE considered humorous and that if HE did, it speaks volumes about his maturity.  And that brother is lucky you both are willing to forgive him for his childish attempt to ruin you wedding.\n\nPush it to \"you're not welcome unless you apologize\" *might* be far, that's up to you.\n\nIf HE pushes things further, that changes the situation.",
            ">He has been texting Dan saying how I changed him, blah blah.\n\nEveryone's said what I want to say. I just want to touch on this. He probably already you a gave bad name to your character by pulling that selfish prank - I wouldn't be surprised if some sceptical relatives are now whispering behind your back because of what he did. Now he's tarnishing your name even more by bad-mouthing you to your husband?? Reiterate to him that 1) no one thought he was funny because that joke was stupid and humiliating 2) everything else that went wrong on your special day were unintentional mistakes 3) other brides would've seethed with anger and scolded him or run out crying, but instead you chose to forget it (despite him not having special needs) because it's embarrassing, and 4) that the attention was supposed to be on you, your husband and your union - not him, especially not during the vows, the most momentous part of a wedding. Then don't give him any more attention, and let your husband and the rest of your in-laws deal with him and his childish sulking.",
            "Ignore it, it will go away soon enough",
            "You're husband is so lucky, you are amazing.  *Small problems?*  \n\n> My wedding had a lot of small problems. I had a kid throw up on my dress, so I wore my MOH's dress while she changed into her street clothes. I tripped going up the stairs. Dan dropped his ring down the vent. One of my cousin's children knocked over a pile of cupcakes.  \n\nYou weren't able to wear your own wedding dress! Hugss!!!",
            "I'm not sure why your husband isn't dealing with this instead of you having to worry about it.\n\nIf my brother pulled some shit like that at my wedding, he'd have had to answer for it.\n\nThis is absolutely something your husband should be taking care of... in no uncertain terms the brother should be made aware of how ridiculously inappropriate his actions were, and that he can go fuck himself if he's looking for sympathy around the idea that it was removed from the video.\n\nIt's not a funny joke at all.\n\nIs he jealous of his brother??\n",
            "He sounds like an attention seeking 12 year old\n\nalso, I'm an CG guy/editor/videographer and I likely would have cut that segment out of the video too so you definitely made the right choice. I'd be willing to bet that particular segment stands out as just super awkward",
            "This is exactly why we told the minister not to ask that question.\n\nJust give it time. He sounds immature. He will forget about it soon enough.",
            "Stand your ground. No further explanation or attention is due to him. He's an ass clown and can do shit like that at his own wedding if he thinks it's funny. Let him have his silly little tantrum alone. ",
            "Can I just say that if you want, you can choose an officiant that doesn't put this bullshit line in the ceremony. I worked with my officiant to design the ceremony that was right for us, and it did not include the \"speak now or forever hold your peace\" and he also did not ask my father to transfer ownership of me to my husband. I know some things are tradition, but if you choose, you can change your tradition.",
            "That's so cringey, it takes quite an idiot to to inject himself and his crude humor into such a personal moment, and a much bigger idiot to become upset that you don't want to cherish his stupid joke as integral to your marriage for the rest of eternity. I think you need to rely on your husband and your SIL and their parents to handle this one.",
            "Do nothing. who cares if that idiot is mad.",
            "If he didn't get it after years of being an adult, he is not going to get it just being told by OP.\n\nI think OP should just let her husband handle it and let Smith think about it. It is a self discovery.",
            "You ignored the situation on the day, and it's not in the video. Basically he tried to ruin your wedding and couldn't. That's why he's upset. Nobody wants to remember it, and nobody thought it was funny",
            "Stuff like getting puked on by a small child, or The cupcake tower getting knocked over, or tripping are ACCIDENTS. And While you could've cut them out, accidents happen, you chose to take it in stride and keep those memories.\n\nHe chose to 'prank' you by essentially stealing the spotlight during an important part of your ceremony. You have Handled it with more grace then I would've. Let him throw his fit, enjoy your wedding Video with the memories you and you husband want to keep that don't involve his attempts at thunder stealing.",
            "The BIL def needs grow up a lot/calm things down a bit",
            "By the way, you are totally on point in your last paragraph. I don't think Smith realizes just how gracious and good natured you are because myself and my immediate family would never talk to an in-law again if they pulled a stunt like that at what is, by a nature, an expensive and extremely crucial event in someone's life. How selfish of BIL to make your and his brother's wedding all about him. Did he pay for the wedding video? Doubt it. Pay for the venue he foolishly stormed out of during a very unfunny and inappropriate joke? Doubt it. Would it have been funny if it was, say, during a grad ceremony and he stood up and yelled \"I completed her thesis!\" say wrong grad and walk out? Would it have been funny at a funeral? No. It's just not a funny joke. \n\nYou are definitely owed an apology. You have been extremely kind thus far. Show him a couple of bridezilla videos and he will see the bullet he dodged and how lucky his brother is to have you. I wish you a happy marriage and congrats!",
            "Honestly just ignore it. You already made your feelings and boundaries known. Just restate them if you truly must and leave it at that. ",
            "Out of all the bridezilla posts we get here I'm very impressed at how you and your hubby handled things. You focused on what was important, which was the marriage part and the being happy part. Your BIL is an idiot. Like others said you already told him what you thought of his \"joke\", now is time for your husband to handle him: every time he says something bad about you hubby should reply \"I will not hear you speak ill of my wife\" and immediately disengage. If it is in person, same thing, he needs to live and not give him any time/attention which is what he's seeking (I feel very sorry for anyone that dates him). If he brings up the \"joke\" husband needs to say \"it wasn't funny and we don't want to remember it, you owe an apology to my wife, don't bring it up again\". ",
            "Tell him if he wanted to ruin a wedding he can pay and plan one himself, until then you'll make the decisions about yours and he should thank his lucky stars you didn't insist on an apology as public as his \"prank\".\n\nNow, like every other toddler tantrum this is the part where you tell his mother.",
            "Is this guy on the spectrum or something? The lack of tact and self awareness he's displaying is mind-boggling.",
            "You handled this way better than I would have. He's complaining he was cut from the wedding video? I would have banned him from the reception entirely. Don't let him get to you at all. ",
            "[deleted]",
            "Oh my god, I'm stressed out just reading the list of what went wrong! But weddings go like that sometimes, I guess, and the ability of everyone involved to just roll with it is what makes or breaks the event. :) At my brother's wedding last month, my grandma gashed her head open and had to leave in an ambulance,   the caterers put gravy on the dessert instead of caramel sauce, and then they forgot (or didn't bother) to serve the wedding cake the couple had worked hard designing and picking flavors for. But it was still one of the most beautiful weddings I've ever seen, because everyone just went with it and had fun. Even grandma, after she got back. ;)\n\nWith your brother in law, I wouldn't extend him any further courtesy or energy. You're doing him a HUGE favor just letting this go in the first place. Don't bother wasting any time on placating him. Let him sulk, he just makes himself look bad.",
            "Continue depriving him of the attention he craves and the payoff for his bad behaviour. The worst thing you can do to a spoiled brat is ignore them. So keep doing that. Don't give him the emotional reward of showing him you're upset or that you give a damn about his antics.\n\nIt seems nobody ever taught him about not being a self-centered jerk. It's too late and not up to you to do so now but you can establish that you're not going to give him the satisfaction and there's no point to making you the target.",
            "So, one of my friends keeps joking about doing this. Everytime she jokes I get pissed. I told her I wouldn't be happy and I would even consider throwing her out of the wedding because I wouldn't find it funny and have told her as much. There will be a police officer present (alcohol) and since I'm paying him I am well within my rights. I think you're right to be upset and to remove it and it definitely was deliberate. I'm sorry that happened. Hopefully he stops doing stupid stuff.",
            "I scrolled up to check the ages, yours I can I understand. You handled this in a very calm, mature way.\n\nBut I can't believe that guy is in his 30s! It wouldn't be such a huge deal (as you said, it's not an issue that he thinks it's funny) if it hadn't been your wedding. And you just got on with your life like a reasonable person, why can't he?\n\nAs for advice, I'm guessing you've already spoken to your husband (also congratulations by the way) and other than that the best you can do is wait until it blows over. It most likely will unless there's something incredibly wrong with BIL. Just move on with your life, mayne ask your husband to talk to his brother about stopping his tirade, and it's unlikely you'll have to deal with much.",
            "You can't reason with a child, as I'm sure you know. Smith is, ultimately, a child. Don't bother to reason with him. Everyone else understands your side, so at this point your only action should be to ignore him. If he complains, just say \"It's our prerogative to edit our wedding video however we want.\" And then exit the conversation if necessary. Just keep drawing firm, mature boundaries with him. ",
            "Well, the first thing is to try and make sure you don't do permanent damage by how hard your eyes are rolling at him (this will be difficult). Then, continue to live your life. This guy doesn't get it. He hasn't personally matured nor does he seem to have had a serious relationship and thus doesn't get it on that end either. You guys are kind of your own convoy now, he can join or he can not. This is all about his insecurities and focus being on his brother and not him, eventually he'll realize that he's in a incredibly unsupportable position and will come back.",
            "You are absolutely right that you are dealing with a toddler type mentality.  You've already told him what he did was wrong and why, which is step one.  Now there are two options you'd normally use with such immature behavior.  Punish him or ignore him.  At his age, and given your relationship, punishment isn't an option which basically leaves just ignoring his child like behavior and his tantrums over you're not paying attention to his prank.  \n\nSo just ignore him and don't deal with his hissy fits.  If he has them then just turn a cheek and walk away.   \n\nThe only other real option is to let him know he is uninvited from your life until he apologizes which is probably a lot more trouble than it's worth and will cause other problems with the rest of the family.  I'd only recommend that for a much more serious offense.",
            "So... he's making the wedding all about him? \n\nYour husband needs to tell his brother that and tell Smith to grow the fuck up.",
            "Continue to ignore him - just as you would ignore a toddler.",
            "Husband's monkeys, husband's circus. Let him deal with it. ",
            "If he wants to be a comedian he can head to open mic night not a wedding that isn't his.  I would play this off with humor sense he is so big on it.  I would tell him of he wants you guys will build a tiny stage in the corner of a room just big enough for him to stand on.  Say you'll even throw in one of those big muticolor toy microphones from the dollar store if he plays his cards right.",
            "At best -- these are my opinions, and a theory of a possibility, not an insistence on fact -- you are dealing in some ways genuinely dealing with a toddler, and it sounds like you have the basic skills required to deal with him.  It may require patience.  It may or may not be necessary;   there's no way from to tell to what extent Smith's family has enabled or encouraged his behaviour, or to what extent Smith is simply like that and suffers because of it.\n\nIn this scenario, its possible that Smith is genuinely hurt at the moment because the other funny stuff stayed in and the funny scene he made was edited out.  The thing to note here is that *your* feelings about *your* wedding would be a vague, fluttering notion like a moth on the very edge of his awareness.  He'd sort of know but not really, and it would pale in comparison to the excitement of his idea.  He would be firmly rooted as the immovable axis around which Smith's World revolves.  So telling him things like \"he did it to piss us off\" and \"you tried to ruin my wedding\" might not get through to him, if it didn't seem fair, because it wasn't true.\n\nWhere things get icky and messy is the question of how Smith's World stays safely fixed on its axis, what sort of rationalizations Smith is willing to make to keep it there, and what sort of person Smith the toddler is really like.  \n\nBeing firm but calm, being willing to explain things clearly and more than once, and giving Smith the benefit of the doubt in terms of what you think was actually going on in his head might be a good idea for the time being.  He might be distressed by the change in his relationship with his brother.  He might adjust.\n\nIn this scenario, and in all others, expect that Smith has succeeded to an extent in getting his family, and friends if he has any, to conform to his behaviour as if it was a complete disability and he had no choice but to act as he does.  You might need to be firm with Dan as well as with Smith.\n\nThis is my best advice based on my understanding of the (mostly past) experience of my family and those who care about me.  \n      ¯\\\\\\_(ツ)_/¯",
            "What a selfish, immature and shitty thing to do. He deliberately tried to steal the spotlight from the bride and groom on their wedding day in the douchiest way possible and then has the cheek to get annoyed when you don't pay it any attention? You're a better woman than me OP because I'd have probably had him thrown out for pulling a stunt like that at my wedding and would definitely not even entertain being in contact with him afterwards. Ignore his little temper tantrum because he is, again, trying to get attention. What a beg.",
            "He is embarassed. He put himself out there to try to be funny, and it wasn't well received, so he is hurt.\n\nAnd if it had ended there, I'd feel bad for him. I can be awkward, and have tried to do funny things that weren't well received. But my response was to just be a little embarassed and get over it. He's not stopping there though. He's staying actively mad, taking it out on you, trying to talk bad about you. That is childish and selfish. Fuck Smith.\n\nEDIT: Seriously, why the fuck is this getting downvotes? Because I'm trying to understand his actions rather than just blatantly crucifying him? I already said he was childish and selfish and in the wrong. The fuck...",
            "I personally find it hilarious, but still, good on your editor. ",
            "If he had done this in uk legally the wedding couldn't continue and you couldnt have gotten married on that date even if it was a joke. The minister warned us about that when we got married.",
            "[removed]",
            "Smith sounds like a Tosh.0 fan",
            "I would just reply in a way a toddler would understand:\n\n\"Too bad, so sad.\"\n\nThen laugh the same way he laughed at the wedding.",
            "I, for one, thinks this is funny. You absolutely have to pick your audience when you make a joke like this. He should have known you would find this funny for him to pull it off. The fact that he just pulled it, it's just a shame.\n\nI'm almost positive he didn't do this to make your life harder. He just tried to pull a dumb joke, and it fell flat. If you keep thinking he did this maliciously, you're just going to make your own life harder for yourself.",
            "To be fair, it was funny... In a rom com. In real life it's simply a dick move. "
        ]
    },
    {
        "post_id": "5wkq00",
        "author": "fJHzXbXWkN",
        "title": "I [32 M] gave my brother [38 M] a laptop for my nephew, but my brother is now using it as his work laptop",
        "url": "https://www.reddit.com/r/relationships/comments/5wkq00/i_32_m_gave_my_brother_38_m_a_laptop_for_my/",
        "score": 2596,
        "num_comments": 306,
        "created_utc": 1488242505.0,
        "selftext": "My nephew is turning ten and is really into minecraft.  He has played with the lego sets since he was little and even reads the books about minecraft adventures (I didn't know that was a thing!).  The only time my nephew was able to play was on my mother's tablet every once in a great while because my brother uses his laptop for work.  \n\nI was presented with an opportunity to get a used laptop for $100.  It's not a gaming laptop by any means, but it will play minecraft just fine.  Before I bought it, I spoke with my brother and told him that I wanted to buy the laptop so that my nephew would have something to do homework on but also so he could play minecraft.  He agreed and so I bought the laptop.  I spent some time setting it up, installing minecraft and other stuff like antivirus so that it was safe for him.  I gave it to my brother last fall.  \n\nFast forward to just recently when I was watching my nephew for the evening.  He said he wanted to play minecraft on my computer so I agreed.  I asked him what he liked to do in minecraft, what types of things he liked to build, but he said he never got to play.  Confused, I asked why not.  He said that they didn't have a computer for him to play on.  At this point I was already pretty certain of what had happened, but I didn't want to throw my brother under the bus.  I asked if he could use his dad's laptop to play on.  He said, \"Well, his black one has it installed, but that's always at work.  His silver one is too old and slow.\"  The black laptop, is the one that I gave my brother.  \n\nI'm pissed.  I never would have spent $100 to buy my brother a laptop.  I just wanted to do something nice for my nephew. \n\n  ---   \n  **tl;dr**: I bought a laptop for my nephew to use but my brother kept it for himself instead.  \n\nAm I wrong to be upset? I understand that he is the parent but I feel taken advantage of.  I'm pretty sure I already know the answer to this, but would it be out of line for me to demand that he either give it to my nephew or give it back? \n\nEdit: Holy shit.  I responded to the first couple of people that responded and thought that was the end of this, so I went to bed.  I never expected this post to get so much attention.  I'll never be able to respond to everyone, but I'll try and respond to the highest comments.  I'll update later if/when I confront my brother. ",
        "permalink": "/r/relationships/comments/5wkq00/i_32_m_gave_my_brother_38_m_a_laptop_for_my/",
        "comments": [
            "Text your brother \"Hey bro, what happened to the laptop I gave nephew?\"\n\nThat's it. No judgment. Just ask an honest question.",
            "You didn't even buy your brother a laptop, he leaves it at work. You bought his employer a laptop.  \n\nIt is totally fine to inquire about the laptop. You are confused, you bought a laptop for your nephew, but he recently told you he does not have one.",
            "You are not wrong. Have you talked to him about it?",
            "Wow that would piss me off soooooo bad. What a selfish move on his part, taking something meant(and agreed upon!) as a gift for his *son* as personal gain without *ever* having given it to his son. \n\nI would definitely ask him about it. If it were me I'd tell him he owes me $100 bucks so I can get his son something since he decided he needed that laptop so much more. ",
            "Is your brother a volatile person? You say you don't want to burn bridges but you bought it for your nephew. Casually asking \"hey, nephew was saying he doesn't play Minecraft a lot. Is his laptop working?\" If he lies I'd call him on it. \"Oh...nephew said he thought it was at work but I didn't think that could be right...\"",
            "Ask him about it and with no judgment in your voice offer that, \"hey, if you like that for work, it only cost me $100, so if you want to give me the cash for that, I can get nephew a desktop for home instead\" \n\nHe might go for it, especially if you make it clear he can pay in installments (my assumption is that anyone who would take their kid's gift has to be hard up for funds). \n\nIf a home computer is out, then at least you can give the kid something else and directly to him. But unfortunately, even though he is totally in the wrong, you have to tread carefully so that he doesn't end up vindictive. If you sense things going bad, back down, give it time, and just take the kid fun places in the future or give him gifts directly that his dad can't steal. \n\nGood luck. ",
            "Is $100 alot of money to you? Could you afford another $200? If you want to be super passive aggressive buy another better laptop for your nephew but this time get a whole bunch of minecraft stickers and a huge label clearly with your nephew's name. ",
            "I want to kickstarter a fund to buy nephew an $1800 laptop inscribed with his name, is bright neon green and emblazoned with \"Nephew's mine craft machine\" on the back of it.\n\nEdit: you're well within rights to be mad about this. You bought your nephew a gift and it's like now you bought your brother a gift. It's incredibly tacky of him to have stolen from his own son. Is he in financial difficulty? Why can't he but his own 100 dollar laptop?",
            "[deleted]",
            "Unfortunately, considering the comments I've read here, I think you may have to swallow this one. Your brother does not sound like the kind of person who will admit to a mistake when confronted. He also sounds like he may be the kind of person who withholds contact with your nephew as punishment. In my opinion, it's not worth the risk to confront him. \n\nYour brother sucks. He took advantage of your generosity. Take this as a hard lesson. Anything you give your nephew, you give directly to him from now on. No middle man. \n\nIf you want, a simple \"I guess that that laptop I gave nephew didn't work out, huh? That's too bad, he was telling me the other day how much he loves playing Minecraft, but he's never had a computer to play on. So weird, that machine looked like it was in pretty good shape.\"\n\nIf you're brother has any brain at all, that statement will tell him you know he never gave your nephew the computer, and also guilts him a bit. But also isn't aggressive, so hopefully won't have any negative repercussions for your nephew. \n\nAnyway, just my opinion. From an Aunt who would be devastated if I couldn't hang out with my niece. ",
            "When you got the laptop, did you give it to your nephew directly or to your brother? I think you should have given it directly to the nephew, as a birthday/christmas gift so that it was publicly known to be *his* laptop. If you gave it to your brother, then there was no accountability for your brother to actually give it up.",
            "Have you spoken to the mother?  What is she like? \n",
            "The thing about kids is that they sometimes lie or fib about the truth. He might have gotten in trouble and was grounded from the laptop, so his dad could have taken it to work.. Or he might have been telling you that he never gets to play so he could play at your house, when really his parents just limit his amount of time on the computer.\n\nJust ask your brother a direct question. \"Hey, nephew said he doesn't get to play minecraft on the laptop I gave him. Is everything okay?\"",
            "Either your brother is struggling financially an doesn't want his brother to one up him as a father by giving him a computer... or your brother doesnt think his son should have a laptop this young yet. Or he's a shady mofo. Ask him about the computer and then question from there. Maybe he had good reason to use it at work. ",
            "This is out of order. You aren't wrong to be mad at all. You should talk to him about it.",
            "Man, I would verbally whip my sister's ass if she pulled this kind of shit over something I gave one of her kids. And I wouldn't give a single shit if she got mad. Then I'd demand the laptop back if he wasn't going to give it back to nephew. Computers are so cheap now, if your brother needed a new one that bad, he can cough up the money for his own. What the fuck kind of person steals gifts that were given to their kids?",
            "Why didn't you give the laptop directly to your nephew? That would have been more special since your nephew would have seen how you customized it especially for him.",
            "Ask your bro, hey, hows the computer working out for nephew?  Would love to come over this weekend and play with the nephew on it. \n\n\nGo over and play with nephew on it.  Then, \"accidentally\" take it back home with you.  \n\n\nYea, you can't have a direct confrontational with your brother.  \n\n\nOn a side note, your brother shouldn't be using a personal computer for work.  If he needs a PC for work, then his company should give him one, or he can buy one and expense it against his taxes as a work expense.  ",
            "Everyone's assuming your brother is telling your nephew the truth about the laptop \"always being at work.\" That might just be a line he spins the kid so he stops asking for a laptop he's decided to keep, or even worse, sold.",
            "No. Tell your brother he's a cheap asshole who puts himself before his children and that he can take everything off that laptop and give it back or give it to his son. Because he's a selfish jerk. I'd be really upset and I'd have no problem saying it like that. Take my $100.00 for yourself. Bshhh. ",
            "I just wanted to say you need to do something, anything suggested. My girlfriend has a father who has stole literal thousands from her before she was 18 (she had a job).\n\nHer grandpa (on her father's side, he doesn't like his son (her father)) sent her a $2,000 check to pay for her new car she bought with her own cash because the grandpa decided he wanted to be the one who bought her a car. Her father cashes the check and spends it, never giving it to her or talking to her about it. That was the single most expensive thing he's done, but he does other things too. He bought her a new car radio for Christmas, but after he tried it out he started driving her car to work (he has a 1hr commute) and using her gas and refused to pay for her gas. He has a car, but she doesn't like to use it because he trashed it (he smokes inside it, leaves empty fast food bags, etc). \n\nAnyway, that kinda devolved into a rant, but here's the intended takeaway: I don't know your brother, but letting him get away with taking your nephew's stuff sets a bad precedent. If you confront him, if he's anything like my girlfriends dad (and I don't know him, so I can't say he is), he will get angry and deny everything and either play victim or just get verbally abusive. \n\nI don't know your family and I hope this isn't the case, but I just wanted to put that out there. ",
            "[removed]",
            "forget about the laptop and buy your nephew a desktop. You can get a refurb off amazon around 100 dollars that will play minecraft and pick up a monitor at goodwill. ",
            "Put that $100 down to experience. Hopefully your nephew is worth much more than that?\n\nNext time, give a present direct to your nephew - wrap it up and put his name on it.",
            "A laptop is a big responsibility and privilege for a 10 year old. While your brother was initially ok with it, maybe your nephew did something to lose the privilege, and is too embarrassed to tell you about it? \n\nEdit: pronoun clarity ",
            "Is it possible that your sister-in-law vetoed nephew having his own laptop? Experience has shown me that certain things require two-parent permission. ",
            "I'd just take an honest and non-accusatory approach. \"Hey, I noticed that Nephew doesn't have the computer I gave him because you're using it for work. What gives? Is everything okay with you guys?\"",
            "[deleted]",
            "I feel like it isn't fair to accuse your brother straight up.\n\nAsking him in a non-confrontational was is probably for the best. Your brother could tell you that \"nephew did X bad thing the other day, he was grounded for two weeks.\" Saying the computer is at work could just be a cover to keep nephew from griping while he's grounded.\n\nHe could also tell you that SIL wasn't comfortable with nephew having laptop at 10. Would need another discussion about what happens with laptop, but it's a situation where your brother/SIL are parenting.\n\nOr, your brother took it. This is the bad ending. Best of luck if he took it from your nephew. ",
            "We don't know the laptop is actually at work. What you have is the word of your nephew which may be accurate to his knowledge but the knowledge may be wrong. \n\nYou have: a missing $100 laptop, a nephew who somehow knows it has Minecraft installed, and a strained relationship with your brother. \n\nYour brother could have sold it, he could have it locked in his bedroom using it for her personal untracked spank bank, or it could have just irreparably shit the bed and your brother didn't want your nephew to know. \n\nI don't understand why people need to come up with a million ways to ask a question to an adult. You're an adult, he's an adult. Use your fucking words: \n\n\"Hey, I was looking for the laptop I bought for (nephew) so we could play Minecraft. Where is it?\" \n\nHoly shit. A direct, honest question. And it's true. And it doesn't paint your brother out to be a monster. Or involve some conspiracy. ",
            "Unfortunately, you cannot control what your brother decides to do with his own son's belongings. That's his son, and he makes the rules. Maybe your nephew did something bad and is being punished, or maybe there's another good reason why he took the laptop away. In any case, I'd simply ask your brother what happened to the laptop and that's it. Lesson learned, no need to get into it with your brother over $100.",
            "I'd be the asshole to  tell your mom. \" I was watching nephew and he asked to play Minecraft on my laptop because the laptop I bought him his dad leaves at work.\" Let your mom do all the yelling . :D\n\nEdit: I'm not saying YOU should do this. I would cause I'm a dick.",
            "The best thing you can do is ask him. You know his personality best so ask him at the best possible time so it does not end up in a fight. Ask him what happened to the laptop since your nephew asked to play on yours and said he does not have a laptop. If he says it has a problem offer to get it fixed. If he is being dodgy about it then you can politely let him know that you don't appreciate him not giving your nephew presents you buy him because you were trying to do something nice for him. Tell him if he felt your nephew is too young for it, he should have said so and not take it for himself and you can actually appreciate it if he gives it back since it is currently not serving its purpose.\n\nThe worst thing is that it is now a company laptop, he leaves it at the office. No man.",
            "never again ask your brother to give anyone anything. do it yourself. \n\nI'd confront your brother I'd say you talked to your nephew and he told you that your present never arrived. ",
            "He's your brother. If anyone has a right to call him on his shit, it's you. That's a shitty thing he did. You bought a gift for youe nephew, his kid, and he took it from him. I wouldn't even mince words. Just call him out on it and give him shit.",
            "When it comes to things like this, Never take a child's word at face value. Ever. \n\nEdit: I would talk to your brother first, as I'm sure there's a perfectly reasonable explanation. Don't be accusatory when you talk to him. In this specific instance, you could be getting a half-truth, which is why you shouldn't be taking what a child says as gospel. I'm currently dealing with a 10 year old girl who isn't exactly completely honest and I spend a lot of time deciphering something as innocuous as her day at school from hyperbole and exaggeration. It's tiring. ",
            "I'm just curious. Who uses a cheap $100 laptop for work?\n",
            ">I [32M] gave my brother\n\n>I gave it to my brother last fall\n\nIs it possible, after you gave **your brother** the black laptop, he gave his son the old silver one to play his game on, because you said you wanted the boy to have his own machine? But his son doesn't like playing on that one because it's slow. \n\nI get the difference is nuanced, but a gift to me for the sake of my son isn't a gift to my son. If you gave me a new laptop, I could see myself using it and handing down my old one for my kid to play with (provided it fulfilled the stated goal of permitting him to play his game, which is kind of uncertain here)\n\nIf you wanted to give the machine to the boy, you should explain the mix-up and make sure it becomes his ... or figure out what's keeping the silver one from playing the game and suggest a fix. Few functioning machines can't play Minecraft. \n\nI know this is contrary to all these other posts, and I get it is weird when a gift is used differently than you exactly intended, but if you gave the gift to the father, it is his to adjust his own household's technology allocation. \n\nLike buying a bigger TV so the kids have one of their own and moving the old one into their room, or a better phone to make sure everyone in the family has one. \n\nIt's wicked unfair if you had been explicit about who the intended user was, and maybe you were careless about how you chose words, but the recipient of a gift chooses how it is used, and perhaps there is more to this than meets the eye.  ",
            "Ask him what's up it might just be that your nephew is grounded or something & he's using it temporarily.",
            "Everyone is saying confront him, and I agree. But I also think you should consider what his responses may be, and how you will navigate the conversation. If you tell him \"hey I got this for your kid, not for you. It is not your property and I would appreciate it if you gave him the gift I got him.\" He may easily act like he plans do give it to the kid \"soon\" and tell you to calm down. Or, he may get defensive and tell you no. Think about what his replies might be and how you can find the best outcome. All said and done that is shady and he needs to give it back.",
            "trying to see it from his mindset, he sees it as his, ie everything his son has he claims as his to use.\n\nso all in all it may be best to take the laptop back and make an excuse till he buys a new one.\n\nmaybe you could have given it to your nephew as a bday present or christmas, that way it has more weight and it would look even worse for dad to use his kids christmas laptop.\n \nmy 2 cents\n",
            "Is his mother in the picture?  Maybe try talking to her about it instead.  If they're seperated and share custody, buy another laptop and keep it at her place.",
            "If you can afford it, buy another laptop for your nephew, a better one. Don't say anything. Actions speak louder.",
            "Is your nephew's mom in the picture?   I just want to know if she's around and if your bro lied to her about it too.\n\nIf she is around, I think maybe the best route to save face would be to wait for the next birthday/Christmas and ask BOTH  bro and mom via text or whatever that you want to buy nephew a laptop.  Don't try to approach mom alone, or it will look like you're trying to pull one over.  But make it so that Mom is also aware of your plans.",
            "Why didn't you give it directly to your nephew? ",
            "I'd go right for the throat on this one. He knew what he did and he invited confrontation when he did it.. This is the type of prick that gives his kid a 40 thousand dollar line of credit debt on his 18th birthday and justifies it by saying he took him to Disney.. You see it all the time on here.. Nip this fucker in the butt!",
            "Is there a reason that your brother may not want his child to use it?  Or is your brother having a financial situation himself?",
            "If he knows you watched your nephew, why wouldn't your brother think that you'd ever ask about the state of the gift you got your nephew? Asking your giftee \"hey, how's that thing I got you working?\" is always a valid question. And since your nephew answered honestly and you have every right to know that information, AND you didn't get that information nefariously anyway, you have every right to approach your brother about the laptop in anyway you see fit. A confrontation may not be what you're seeking, but god damn I'd be pissed if something I gave to a CHILD went to the use of an adult for any other reason than what it was intended for.",
            "Going to play devil's advocate here.\n\nWhat if the brother just wants to limit Nephew's Minecraft time? Not all parents would be comfortable with their child having internet game access 24/7. Maybe the brother is holding on to the laptop until he is comfortable giving it to Nephew to play on - say, summer vacation, spring break, et cetera. \n\nMaybe Nephew is having a problem focusing in school or is too obsessed with Minecraft at the moment, and Brother just doesn't feel like now is the right time for him to have access to the online game at all times. Perhaps when he agreed to the plan in the first place, Nephew was doing ok, but then he re-evaluated his stance once you actually gave him the computer. He may be keeping it at work to avoid any fights with Nephew - \"But I want to play it! Give it to me!\" et cetera. Kids are kids.\n\nIf I had a child and someone gave my child a laptop, I wouldn't allow them to have unlimited access to it at all times. ",
            "Ummm... did you by chance go on Tad and Melissa's group therapy on the radio about this or copy the story....?",
            "You're certainly not wrong to be upset.\n\nYour brother is not only a bad brother but also a bad father ",
            "Did you consider maybe the parents don't want the 10yr old having his own laptop?\n\n",
            "It's something that you could bring up, but ultimately it's not your business. Maybe they don't want their kid on a computer all the time? Maybe he already spends too much time in front of a tv or something.\n\n",
            "To be fair, there might be a good reason for that, e.g. he doesn't want his son to play video games too often. He's a parent after all, he decides what's good for the child. \n\nI'm not saying he handled the situation well. He didn't. But those who comment here seem to agree that this guy is a Sauron reborn, and I doubt that's true. ",
            "Not to sound rude, but why didn't you contact your brother about this to find out exactly what is up, before making this topic?",
            "Dude, throw him under the bus.  Tell your nephew you got the laptop for him.",
            "As mad as that makes you here's something to understand: you may have bought something for his child for entertainment that he can't even afford for himself and his work.\n\nThat said, it should be remedied, and there are other suggestions here how to handle that. But I think it's important to understand how it might have happened.",
            "In my opinion, nobody can control what people do with the gifts they receive. It's a shitty thing for your brother to do, but any confrontation would make things really awkward for your nephew. He's the one who would have to suffer any consequences. \n\nMy suggestion is to let it go. Set up minecraft on your computer so your nephew will have a place to play. If you can spare some money, maybe buy a used tablet or inactivated phone with a large screen. Install minecraft on it and keep it at your house just for your nephew. You don't even have to let anyone know it's only for him. You can say it's yours and you let him play on it when he's over. Something like that can mean the world to a kid. ",
            "This calls for straight up aggression towards him.  Show him this post,  what a f*ckin' d*ck.",
            "your brother is a class A con\n",
            "Just curious why you gave it to your brother and not to your nephew directly?",
            "[deleted]",
            "Ask him to come to this post so we can scold him. ",
            "Honestly, I would be mad if someone tried to give my kids a computer, especially if that computer was meant for playing video games. That stuff is really addictive and should be a special treat for kids at that age, NOT something they can do just whenever. Personally I think it's great he plays with lego and reads books instead :)\nI know that's not the point here, just putting it out there!"
        ]
    },
    {
        "post_id": "e0y0i4",
        "author": "crazyjack24",
        "title": "Update: I [F26] have been having intense sexual dreams about my flatmate [M29]",
        "url": "https://www.reddit.com/r/relationships/comments/e0y0i4/update_i_f26_have_been_having_intense_sexual/",
        "score": 2593,
        "num_comments": 69,
        "created_utc": 1574599021.0,
        "selftext": "Hi guys! First off I wanted to say thank you for all the comments, they were super insightful for me. \n\nFeel free to see my last post for context: https://www.reddit.com/r/relationships/comments/e008nu/i_f26_have_been_having_intense_sexual_dreams/\n\nI just wanted to give an update on the situation and maybe a bit more background to the situation. \n\nSo I recently broke off my ldr of 4,5 years. For a long time I had been coming to terms with the fact that I can't see a future together for the two of us, even though he had been talking about marriage and proposing for ages. There were many things happening in this relationship that added up made me realise that is not something I want to pursue forever. This relationship hadn't been doing it for me emotionally und sexually for quite some time. \n\nMy flatmate and I have been part of a close knit clique for around ten years. For seven of those years he had been in a relationship with another girl from the clique. It turned long distance quite some time ago and didn't work out. They broke it off at the beginning of this year. They talked about how they want to go forward from this and vowed to tell each other about potential new first partners. She has been sleeping around for some time and not directly talked about it with him. \n\nSo after we went drinking and went home we spent some time talking, the topic turned to my birth control situation, the frustration and dreams. At one point he told me to come over to his side of the sofa and asked me if I was talking about him. It was pretty surreal for the both of us I guess. Since then we have been pretty much inseparable, laying around on each other, making out and what not. I feel so happy at the moment and he does too. We have also been doing a lot of talking and being honest with each other. \n\nHe says he wants to hold off on having actual sex, until he's sure he wants to pursue a relationship with me, because he doesn't want anything casual. Of course at this point in time is too early to say if it will work out, but that's OK. I want to see where it goes as I haven't been this genuinely happy in a long time, and I'm so glad he feels the same way. We're concerned about what the rest of the clique will say and how they react once it gets out. Truly a sticky situation. \n\nI'm ready to see if it works out and I'm ready to commit. I can sincerely say that he is not the reason I broke of my last relationship, but I can understand how it can seem that way. Of course the way we worked together did show me many parts of my last relationship that I was absolutely not happy about. \n\nTl;DR it all kinda worked out. We feel the same way about each other and life is good.",
        "permalink": "/r/relationships/comments/e0y0i4/update_i_f26_have_been_having_intense_sexual/",
        "comments": [
            "I was in a situation very similar to this (long time friend became house share became dating)\n\n3 years later me and the person are married. Not saying it always works like that, but there's nothing inherently wrong with dating a flatmate. I think the taboo comes more from college dorm situations and doesnt really apply to independent adults pushing 30.\n\nAfter a decade of friendship you know each other well, and being roommates you've already seen them when they're sick, on laundry day, resolved issues over housework. It's actually a great trial run for a relationship, imo \n\nThat said just **tread carefully, use your best judgment, and KEEP YOUR SAME SEPARATE ROOMS** \n\nAnyway good luck (:",
            "If youre both happy, your clique will support it. Or you need a new clique.",
            "Doesn’t sound like a particularly sticky situation to me, other than the fact that you live together. I’m confused about why he and his ex vowed to tell each other about new partners? That level of involvement with an ex is odd.",
            "The native American's have a wampum belt that is two horizontal lines. One representing Americans, the other, Natives. Both are walking through life, side by side, as friends, companions, but the lines never cross. Separate but a similar path. \n\nRelationships that make it often have this similar strategy for themselves. Both people are truly individuals, with individual interests, desires, and goals, and yet they walk together, sharing common goals and a common future. \n\nRelationships that fail, often do because one person grows faster or slower than the other, or the people and their respective lives become like one, and they become bored with one another (a single line), or they grow completely apart (lines expanding apart). To have two lines, side by side, it represents a healthy relationship in life, and balance. \n\nAt this point in your life, both you and he are walking VERY similar lines in life, and there are many pros and cons. Pros are you know each other and are living together. Con is you are 'too close' to the point where if you have 'issues' it can rock the social group, and give both of you 'nobody outside to talk to' about relationship issues. The lines, might be too close. \n\nAs with all relationships, I truly wish you and he the very best. I think it's great that you feel this way, and are taking things one day at a time. I truly hope a year from now you are on the path to having children and marriage.",
            ">He says he wants to stick out with having actual sex, until he's sure he hasn't to be in a relationship with me\n\nWhat does this mean?",
            "Sorry if I'm being rude, but it doesn't seem like a good idea to bang your flatmate, and him not being sure of wanting a relationship isn't a good start. I'd start making a backup plan for if things go south.",
            "Remember. You find people attractive the more you see them. Be honest. Be aware.",
            "Y'all are two consenting adults who broke off with their other parents before persuing one another. \n\nWhat's the big deal? \n\nYou're not at the age that you cannot live without friends anymore. Do whatever makes you happy, and if it means being together makes you both happy, a total win win.",
            "Enjoy the NRE.  Dont think about committing for at least 6 months, give those chemicals a chance to calm down.  The proximity and convenience can be so alluring.",
            "You've known this guy for ten years, you have lived together for part of that time, and he still doesn't know if he wants a relationship with you? This relationship would be so convenient for him, and yet he still doesn't want it.\n\nThis isn't going to work out.\n\nAlso, keep in mind that you probably have to move now if you want to date anyone else because no guy is going to want any part of this situation. A woman with a male roommate raises an eyebrow, but knowing you have made out with that roommate is going to push everyone else away.",
            "Be cautious. Don't shit where you eat. If this relationship doesn't go as you expect it, you still have to live with him. If you want to date and explore a relationship, I would suggest one of you moving out. You would never start dating someone and instantly move in with them, even if you've known them for a decade. This isn't much different from that.",
            "I also started dating my roommate and were engaged now! Hope it all works out!",
            "This sounds so familiar....and we will marry now in 6 month and will be together for 10 years\n\nThe best for you too. You have something special",
            "This is so wild because almost the exact same thing has happened to me recently - I came off hormonal birth control, started seeing my friend who I share a flat and close friendship group with in a whole new light, and after a conversation about my experiences with coming off birth control he told me he had feelings for me too. Bonus points for the similarity in that his ex is in our social group too. This happened a couple of months ago now, we’re together, and it is going so wonderfully. Good to start slow, especially when you live with someone, because that puts a massive acceleration on some aspects of the relationship which you just can’t help. Good luck and congratulations OP.",
            "I am very happy to see that you didn’t decide to ignore your feelings. I’m happy to see you didn’t suppress your needs or have empty flings. \n\nI’m happy to see you had the courage to reach out to him.",
            "AMAZING. I was hoping this was the outcome, he sounds wonderful so don't let him or you down. Best of luck!",
            "This was the end you deserve and it is both a relieve and a good news! I wish you the best for both of you!",
            "This is almost exactly the situation I was in 3 years ago. We both recently ended our 2+ years relationships and then we kind of made out at a NYE party. I took a train home and she stayed to see her family for a few days. When she came back, we were both gauging how we feel about it to not pressure another person and ruin the nice thing we were having. The agreement was to keep it casual just in case it doesn't work out. Two months into hookups and spending lots of time together and we realized there's nothing casual about this. Still going strong three years ago, it all worked out.\n\nGood luck!",
            "Sounds like with your update, the potential for something more is possible. So I guess as long as you keep in mind that pushing too hard might upset this current idyll, then good things might just turn especially great",
            "Even money says your friends will ask what took you two so long.",
            "Hooray for lust! It's there for a reason ya know. Hope you enjoy many more sticky situations in your future.",
            "I'm more worried about at least one of you two being haunted by LDR baggage.",
            "Please. Do. Not. Bang. Your. Roommate.\n\nWe all know college dorm rules. Don't bang from the same floor. Its always messy. So yeah..",
            "[deleted]",
            "The longer you wait for sex the better the outcome. There are exceptions, but generally.",
            "You are probably too young to have watched Steinfeld, but you could have a relationship like Jerry and Elaine, but remains best friends."
        ]
    }
]