[
    {
        "post_id": "7v1szb",
        "author": "AnhDuck",
        "title": "My [22/M] girlfriend [22/F] accidentally damaged my friend's [21/M] laptop, and he wants me to break up with her because of it, or else he's ending our friendship.",
        "url": "https://www.reddit.com/r/relationships/comments/7v1szb/my_22m_girlfriend_22f_accidentally_damaged_my/",
        "score": 2598,
        "num_comments": 331,
        "created_utc": 1517689205.0,
        "selftext": "**I AM NOT BREAKING UP WITH MY GIRLFRIEND OVER THIS. I WANT TO MAKE THAT CLEAR. THANK YOU.**\n\n---\n\nI've known my buddy [21/M] since I started going to university 4 years ago. My girlfriend [22/F] is my best friend of 16 years and we've been dating for two months. \n\nShe asked to borrow his laptop to do homework, when the three of us were hanging out at his home. While carrying it she slipped on a water spill, she didn't get hurt, but the laptop was damaged badly, albeit still repairable. \n\nMy friend started losing his shit at my girlfriend, even though she apologized and offered to pay for the cost of the repair. I pulled him aside and asked why the hell he was freaking out. He said I needed to break up with my girlfriend because of how careless she was, or else we couldn't be friends anymore. Then he went on a weird rant about how I shouldn't have started dating her in the first place because I deserve better, but I think he was projecting hard about something.\n\nIt boggles my mind that he wants me to break up with her because she accidentally damaged his laptop, over his negligence in not cleaning up the spilled water. I'm not breaking up with my girlfriend, so I assume my friendship with him is over. \n\nThe thing is, he's a member of our team [5 people including myself] for the video game [League of Legends] that we play. He's irreplaceable, there's no one that we know of who is equal in skill level to him, that also plays his role. We take the game very seriously by meeting up and practicing every weekend, going over our replays to see how we can get better, improve our communication, etc. \n\nI don't want to play with him anymore, or have him on the team because of the way he handled everything. I'm not sure how, or if I should bring up what happened to my other teammates.\n\n---\n\n**There has been a recent development in the situation and an update will come soon.**\n\n---\n\n**tl;dr:** My girlfriend asked to borrow my friend's laptop and she slipped on a water spill while carrying it. The laptop was damaged badly but is repairable. My friend lost his shit at my girlfriend even though she apologized and offered to pay for the cost of the repair. \n\nHe told me I needed to break up with her because of how careless she was, but then he went on some weird rant about how she didn't deserve to date me. He's a member of our team for the video game that we play together, and he's irreplaceable. I don't want to play with him, or have him be apart of the team anymore, but I don't know how or if I should bring that up with everyone.\n",
        "permalink": "/r/relationships/comments/7v1szb/my_22m_girlfriend_22f_accidentally_damaged_my/",
        "comments": [
            "> Then he went on a weird rant about how I shouldn't have dated her in the first place because I deserve better\n\nIt's pretty obvious he's been stewing in resentment over her for a while now and this incident, in his mind, justified his feelings and gave him an excuse to express them ",
            "You should talk to the other three people in the gaming group before he does. You want to take control of the narrative and establish that he's behaving badly - you especially want to emphasize that your girlfriend takes full responsibility for her mistake and will pay to have the laptop repaired. Get the other folks on board with the idea that his demands are nutty and of replacing Jerkface if he won't back down. \n\nThen, give Jerkface a few days to calm down and get back in touch with him. Explain that his demand is unreasonable...you love your girlfriend and of course you're not dumping her. Let him know that the offer to pay for repairs still stands and you're open to continue gaming with him if he apologizes for his way out of line demands to break up with your girlfriend. I suspect he will back down when (if) he sees that the other players on the team are backing you up. ",
            "Are you sure your friend doesn't secretly love you or something?",
            "Hey, I have a gaming group like yours and have been in a situation with a team member that was 'irreplaceable' but also flipped the fuck out for some bizarre reason.\n \nIn my case, from a gaming standpoint, it didn't matter how I approached our next games, it was never the same again. The perfect team mate I had before turned into an asshole that our team couldn't trust to cooperate with strats and became argumentative for no other reason than to just defy me or my ideas/opinions. It was disruptive to the team, caused a lot more fights and we ended up having to replace him because of his attitude anyway. \n\nThe guy in my situation had a problem where he couldn't separate what happened socially outside the game to what we'd all been working towards and practicing for inside the game. \n\nMy point here is that if being friends outside the game is a requirement for the team, then your team is already broken. Mourn it, move on and replace him. \n\n",
            "You 'friend' sounds toxic and controlling.  I'd tell him he doesn't get to tell me who to date and if wants to stop being friends with me that's his choice.",
            "Is there any chance that he might be into her? I couldn’t say what everyone else has been saying better. This dude is weird either way and sounds like a bad friend.",
            "You guys aren't a military battalion, you're a gaming group. You can find someone else to replace him. Don't dump your girlfriend because of your insanely unreasonable friend.",
            "This really doesn't sound like it's about the laptop. My guess is it's either: a) he likes her, b) he likes you or c) he feels neglected because of your relationship with her. I'd put my money on \"a)\". Either way, his reaction is shity.",
            "He spilled and didn’t clean it up, she fell, offered to pay to fix his computer and he’s mad??  I’m you’re girlfriend I’m telling him to go eff himself, it’s his fault she fell in the first place. He was negligent. I’d pay him nothing. If he doesn’t want to be your friend anymore that’s on him. ",
            "you offered to pay damages so there's nothing else to do.\n\nhe's being childish and has had a problem with your relationship long before the accident happened. whether that's a personal problem or a problem that he has with your gf, doesn't really matter.\n\nno need to look into anymore. if he asks you if you've dropped her just tell him straight to his face that you won't and whatever happens, happens. and mutual friends hearing the story will instantly side with you.",
            "I think your gf offering to pay for repairs is more than enough, this guy must have some serious bone with your gf ",
            "> and he's irreplaceable\n\nFalse. nobody is irreplaceable.",
            "\"We will make this right to you by fixing your laptop. You will stop acting nuts and crying over spilt milk. Please don't choose to end our friendship over something so silly.\"\n\nDon't cave if he turns out to not be bluffing about ending the friendship.\n\nIf he's a friend, them he'll apologize and he's worth keeping around. If he isn't, then this toxic person will remove himself solving your problem.",
            "He over reacted, it was an accident. He’s either secretly in love with you or jealous of your girlfriend.",
            "First of all, unless your girlfriend created the water spill on the floor she should most absolutely NOT be paying the entire repair bill, let alone replacement. If I leave standing water on my floor and someone slips in it, that’s my fault entirely for providing an unsafe environment.\n\nAt very most your gf should be paying half the repair bill, and repair only, not replacement. Better would be if this “friend” shut up and took responsibility for the hazard he created and/or failed to mitigate.",
            "Sounds like a \"nice guy\" type. Might be upset about his imagined entitlement to women and projecting about thinking he deserves one. At least he was right about one thing... You deserve better *than him*. ",
            "I would give a straightforward account of what happened. I would also prepare yourself to walk away from the team if they decide to keep him.",
            "He’s jealous of your relationship and handling it like a child. Get him to talk about it and it’ll blow over and he’ll feel like an idiot. ",
            "He might be angry because if he's a serious league player, he might be insanely attached to his laptop and that it being damaged and requiring a few days to be fixed could be threatening his practice time. \n\nElo does crazy things to people, I'm sorry you're going through this. ",
            "Has your girlfriend paid for the laptop to be replaced/repaired?\n\nTell your team exactly what happened and let them decide, they will either tell you to keep playing with him, you just don't need to be his friend, or they might kick him out. Chances are they will just tell the two of you to forget about it and keep playing, so if you don't want to play with him you might need to leave the team. ",
            "There is not garante the between choosing benefiting their hobby and having healthy friendships that your friends are going to make the sensible choice. But you are going to have to give them that choice nevertheless.\n\nYou contact all three other games as soon as possible. You tell them your version of what happened, your reacting to it, and your decision that you can not continue being in close contact with this person after his behaviour, then yousay that you know this will effect the group and whilst you would of course would hope they trust that you have a reasonable judgement you know that they need to talk about this and get back to you as soon as they have something to tell you. You should come across as being as rational and truthful as possible, which you do by being calm, not embellishing the story, and not needlessly insulting this person (like in your text here). Really make clear that your girlfriend immediatly apologiesed and offered fair compensation. Doing this over text is okay, via phone is better, and in person is best.\n\nIf you are close friends to anyone in the gaming group, then confide in them more about how you are feeling about the situation and ask their advice on how to handle your mutual friend.\n\nEven as you said you would wait to hear from them, if you don’t hear anything within 24 hours you reach out to them. A too long silence is an oppertunity for the other guy to manipulate the narrative.\n\nThere really isn’t anything else you can do but tell the truth. Doing it quickly and calmly helps though. Good luck!",
            "Just show this post to your teammates so they too can see how fucked up your friend is being.\n\nHow anyone could ask you to break up your relationship with someone, let alone someone you’ve been friends with since you were six and are now dating, is beyond me.\n\nThis dude either loves your GF, you, or is just one of those people that’s so bitter over other people’s relationships that he’s toxic to anyone who’s happy.",
            "Reading the subtext: are you afraid they're going to choose him over you? I don't really see a magical way to get around that, all you can control is the choice he gave you between the gf you want and living under the thumb of a power-tripping geek (a choice you've already made correctly). And I say that as a gamer. If that gets you kicked off the team, so be it.",
            "You need to decide how important League of Legends is to you. ",
            "Wild guess here but he's gay and in love with you",
            "I am sure he can be replaced. Tell your friends what happened, go on some league subreddit and recruit some players.",
            "So your girlfriend accidentally broke his laptop. She did 100% the right thing offering to pay to repair it. And your friend... flips out? And says you need to choose between them?\n\nAnd you're CONSIDERING IT because he plays a video game with you? \n\nLook, you don't want this unstable individual in your life anyway. And your girlfriend... I assume you want her in your life as she is the reasonable one in the situation. You're just going to have to choose your girlfriend over the video game (as that seems to be the sticking point for you). You can still play the game (duh) but without him in it.",
            "Your friend sounds like an anti-social sociopath. He's probably jealous that you have a gf and he's never had one.",
            "You had nothing to do with the accident yet he is willing to leverage your friendship against you? That's not friendship",
            "Tell your friend to clean up his messes and apologize for putting your girlfriend at serious risk of hurting herself, because he spilled water and didn't clean it up and refusing her offer to repair the laptop, or you're done as friends.\n\nTell the other three what's going on, but seriously no one is irreplaceable or get a new hobby. This guy sounds like the kind of rock star mentality that trashes rooms and has tantrums over having blue M&Ms in his snack bowl. \n\nP.S. He's projecting something all right with this over the top attitude. And whatever it is, no good is going to come of it since he can't communicate like an adult and gets all weird and shit. ",
            " Honestly who cares that much about a videogame? You care enough to potentially stay teammates with a guy this unreasonable and weird? If my friend pulled something like this, I wouldn't want to associate with them at all, even in a game.",
            "Yeah, going to bet he's in love with you. ",
            "Your friend's out of line... ",
            "I'm writing this hours after you posted and skimmed comments, which seem to be: you're right, he's wrong.\n\nI AGREE.\n\nBut I didn't see much about talking to him directly...  if you've been friends with him for FOUR years...  can you have a little discussion?  A confrontation?  \n\neg: Dude, we've been friends for 4 years.  I don't know why you're hating my girlfriend for an accident she already agreed to pay to fix when it was mostly your fault, anyway.  What's going on?  What's your problem?  Is there some other way to fix this?  Is there something else going on?\n\n(And perhaps you might want to say Get your shit together or noone will ever f*ck you and all the men who can get girlfriends will eventually leave you, too.\n\n(Even if you are a great gamer!  (Ha ha ha /s)))",
            "This is definitely not the whole story. It really sounds like he already hated you being with her and waited until this moment until he had a reason to take it out at her. Or he's madly jealous.\n\nYou need to tell him to chill out and that he should be thanking her for offering to fix the computer like a decent human being. He is the only asshole here. Also pretty controlling. Ask him if your friendship means so little that he'd never see you again over *a little damn split water*. Contact him in a few days after he's calmed down and try reason. If that doesn't work, you can assume his mind is made up.",
            "I'm actually not sure I'm using this phrase right, but the first thing that popped into my mind is \"emotional blackmail\".  So yeah fuck that. \n\nAs for your team...I mean I guess just contact one of them or show up on the weekend and just tell that that you're out. Tell them that Freak Out Boy has pushed the issue, that he has demanded that you choose between him and your gf and that you are choosing your gf. Tell them sorry for the inconvenience of finding a new player, but this mess is not of your making, and you are choosing the only reasonable option. \n\nIf Freak Out Boy backs down and says he still wants you to play on the team, you're going to have to know ahead of time what your response will be. Can you play with team but not see him otherwise?  Or maybe you've decided to quit the team no matter what...you're just going to have to decide exactly what outcome you want and then tell them. Let him be the one to feel awkward, what a weirdo bully.  ",
            "[removed]",
            "Honestly, right now give him a few days to cool down. Then shoot him a text asking to talk about the situation in person. Discuss what happened, how it made you and you gf feel, let him talk about his side of the story. Then figure out what to do based on that discussion.\n\nLet you LOL team know about the situation and decide after the discussion what to do. Which would be:\n\n1. Your able to solve the problem and play\n2. You guys just deal and play\n3. One of you leaves \n\nI don’t think he has a crush on your gf like others are saying and even if he does, not like she’s going to leave OP for him after this crap. \n\nI think he’s just mad right now, even though it wasn’t your gfs fault I think he was just projecting the anger at himself on her cuz it was due to his stupidity that he left the spill and she slipped.\n\nI mean worse case, friendship is over and you may have to leave your LOL group. BUT you will have your gf and can always join a new one if you’d like. I realize I’m making it sound simple but would you want to be in a group with someone who blames others for their decisions? Nah. But hopefully it won’t come to that.\n\n",
            "Well sorry about your league team. I think you should tell them what happened. I mean if he apologizes and you forgive him that works. Idk if he was having a rough day or he secretly loves u or something if she doesnt deserve you. Its okay like I'd be upset too but if its gonna be fixed I'll be happy. Asking you to break up with her and sayimg she doesn't deserve you is going too far.",
            "That sounds like the kind of friend you probably don't want in your life. It was an accident. Shit happens. Maybe she can pay for a new one, or the repair of the one that is damaged. Any \"friendship\" that ends over a laptop getting broken in an accident isn't a true valuable friendship to begin with.",
            "Sounds like he likes your girlfriend man. He just wants to break you up. ",
            "This isn't about the laptop. It never has been about the laptop. There's something deep down that is bothering him, and it's up to you to decide whether you're willing to stick it out and find out what it is, or to cut ties completely.",
            "If he's willing to dump you as a friend over a laptop. He's not a friend.",
            "Sounds like he's gay for you",
            "Hey AnhDuck, sorry to hear your friend is being a real dickweed here. I think it should go without saying here that your girlfriend handled this situation really well and your friends actions are unacceptable! He is totally trying to be controlling here and didn't express himself in a manner that helped the situation. Rather than accepting your girlfriend's nice offer he loses his shit on your girlfriend and demands you to break up with her or nix your own friendship.\n\nNow I get the feeling a bit of your friends freak out might come from the fact that his laptop potentially broke in front of him which can be a bit of a traumatic experience for gamer oriented people. I do not however think that is the only thing going on here and feel that if you really want to continue your friendship with this guy you've got to let him know his actions were uncalled for and have him apologize not only to you but your girlfriend as well. He should give you an explanation before you even consider really continuing this friendship. he should also give a fully thought out apology before paying for the computer repairs.\n\nAs for you LOL team, as others have stated better than I, explain what happened to them. If for some reason things actualyl do take a turn for the worst but you still want to play league please feel free to message me. I have a solid group of almost 7-9 people that I play with who vary from bronze players to plat players and most of us (6-7) have been trying to improve our skills as well. If you ever want to shoot the shit even if things do workout feel free to contact us. my team loves trying to set up 5v5 in customs for skims but we usually lack the numbers. it would be an awesome experience to have another 5 stack to help us improve while we help you. Nothing like some friendly rivalry to help players grow.",
            "You might have a problem if you care enough about the game to care about your league team to make this post. \n\nFor God sakes, before I read league of legends I thought it was some a team at the workplace. This is an open and shut case. ",
            "Does your friend not have much luck with girls? Maybe he's actually jealous of your relationship and her being around really just reminds him of his own loneliness?",
            "From my perspective...\n\n>...went on some weird rant about how she didn't deserve to date me.\n\n* He may have a crush on you or your girlfriend.\n* He was irrational at that moment. If you had a gaming PC and a friend were to break it, accidentally or not, it would be a shame, no?\n\nMy advice would be to let things cool off for a while and discuss the matter with him. If things go well, great. If not, it might be best to discuss the problem with your teammates because the resentment would affect how your team performs in games--- I can imagine a possibility of toxic arguments in times where you or him make mistakes (which is inevitable). Comfort your girlfriend, too. She might be sad after that incident.\n\nedit: formatting",
            "She offered to cover the repairs, so why is he still flipping shit? I get being upset something happened, but she offered to fix it",
            "Don’t let the door hit him on his way out of your life.",
            "Just drop him from the team man jeez.\n\nIt's just LoL man. You aren't exactly a top tier team. He's replaceable.",
            "Jesus, take is from a guy who actually spent 8 hours today playing BotW. Video games aren't as important as relationships. Games are for relaxing after busting your ass. Don't make life decisions based on them. ",
            "\"He started losing his shit at my girlfriend, even though she apologized and offered to pay for the cost of the repair.\"\n\nAnnnnd that's where it ends. Mate you'll make more friends in the future but this shit is childish.",
            "That really sucks that it caused the strain in your friendship but it was his fault for demanding that you break up with her. If she didn’t offer to repair it or flat out said no, that would be one thing. If you need a gold jungler lmk :)",
            "> I AM NOT BREAKING UP WITH MY GIRLFRIEND OVER THIS. I WANT TO MAKE THAT CLEAR. THANK YOU.\n\nNo problem.  That means either a) you call your friend's bluff and he's still your friend (but he sounds like an asshole, so maybe dial back the friendship) or b) your friend isn't bluffing and he ends the friendship (good riddance?).\n\nP.S. your friend has a crush on either your girlfriend or you, and his jealousy is getting in the way.\n\nEdit: Just checked your post history.  Spend less time gaming, and more time with your girlfriend.",
            "im gonna assume he's a jg or adc main l0l",
            "Friends bein an ass dude sorry. Your gf offered to pay for the repair that should’ve sufficed. I mean obviously it sucked to get his laptop damaged but still went a little overboard on that. He should be more understanding about the situation, if not he was never really your “friend” in the first place",
            "With how seriously it sounds like y'all play League, combined with how *irreplaceable* your soon-to-be not-friend apparently is, I feel like YOU'LL end up being the one replaced in the group - but that might depend on how reasonable the rest of the group is, I guess. Outside of League of Legends reason, anyways.\n\nAnywho, this guy sounds like a massive tool... It's possible he's got some deep-seated issues that he's not disclosing, but that surely doesn't give him the right to behave the way he is.\n\nBest of luck with this fiasco!",
            "he sounds like the kinda person that gets caught before a team fight and then spends the death timer pinging everyone with a \"?\" \n\nhes not irreplaceable dude. LoL is one of the biggest games in the world, plenty of people can play at a high level. unless you 5 are D1 or master im sure it wouldnt be hard to find a replacement. hell Im a pretty solid plat and i just play in my spare time and main fill. ",
            "OP what server are you on and what role and rank I might be able to sub till he’s in a better mood",
            "Sounds like he has a crush on you",
            "Are you playing league of legends by any chance?",
            "This is why people have renters/homeowner insurance--to pay for damage to belongings, or for medical care for someone who was injured.  \n\nHow seriously injured was your GF?  Could be it's really the friend who owes your GF money, not the other way around.",
            "it's a fucking videogame. i can't beleive this is something you had to ask reddit.",
            "if your looking for a support on league hit me up dimond 2. if its dots ew",
            "Has your friendship with your friend changed since you started dating your girlfriend?  ",
            "Why would you even want to associate with someone who tries to control his friend's dating life due to an accident-- an accident surrounding circumstances that someone is responsible for, the safety of their own home around guests-- that the accident-er took full responsibility for including apologies and offering to pay for the damages?? Someone else above has really good advice for dealing with the gaming team by getting them on board with the craziness and confronting him about it as a team. Another possibility, if on reflecting you honestly don't want that kind of asshole in your life anyways, especially if it doesn't look like he'll drop it, is to cut off your personal friendship with him but ask if you can maintain a teammate relationship. \"You don't want to be my friend anymore over this, whatever. Even if you don't want to hang out with me anymore, are we still cool for the sake of the team? Or are you going to bail on them too?\" In this option, be very clear with him that it was his choice to cut off the friendship, not yours. If he chooses to leave the team, it's honestly on him: and he must not be invested enough anyways if he's willing to bail over an accident. ",
            "If it comes up again clear the air - it was an accident and a solution was immediately offered.  Hope that he can apologize for his rant, and if you do want to continue your gaming relationship then forgive him and let him take back what he said.  If he can't apologize, if he won't take back what he said or he brings it up again then that's that. You don't interact with him anymore.  Ensure the repair is paid up and move on with life.",
            "Your buddy is a controlling ass. Ditch him. Done so to the toxic friends in my life and I'm happier now more than ever. They hold you back buddy. They may even do worse....",
            "You’ve made it clear you aren’t breaking up. You can pay for the damages and hope that makes it better or you can end your friendship. Personally - it someone reacted that way toward my SO I’d question the friendship. Certainly I’d offer to pay - but coming at her like that. Yeah no. ",
            "A \"friend\" would probably not put you in \"its her or me\" situation.",
            "Friends come and go, but relationships can last really long and if your friend doesn’t understand that you need to dump him not her🤷🏽‍♀️",
            "Yeah, I think your buddy is in love with you. This was just the boiling point.",
            "It was an accident, she wasn't careless, it was an overreaction on his part, if he can't get over that well that is terrible, however it shouldn't be an issue of you choosing your GF over him, it is all very immature in my opinion.",
            "Your friend is obviously in the wrong. Shit happens! And he was offered money for the damage so it makes it way less than a big deal. He sounds pretty controlling. If he can end your friendship over this then he wasn't a real friend to begin with. ",
            "Dude even if he’s the best player in your group, just find a fill. Is it really worth it? The guy seems super mentally unstable, even if you satisfy him now that doesn’t mean this won’t happen again.\n\nI’ve also played league and know from experience that you can find a 5th member to join your team without putting that much effort. Care only for skill? Post on one of the forums and have a godlike teammate. Care to have fun? Try to make another friend that plays. This guy is definitely not the most skilled and fun person you could ever possibly play with",
            ">but I think he was projecting hard about something.\n\n\nI think you hit the nail on the head with that one. When it's something that was a total (non-careless) accident like that, people don't normally fly off the handle unless there's something else bubbling under the surface.\n\n\n\nSo far you've handled this really well, though if this is the first time he's acted this way I'd maybe take your buddy aside one more time to see if there's something else gong on. It could have nothing to do with your GF at all, or who knows maybe he's secretly in love with her/you, IDK. \n\n\nIf he refuses to apologize to her for taking it too far though, I'd say screw him and have a word with your league team about how to navigate this. It sucks losing a player but finding a new jungler or whatever is better than having to tiptoe around a toxic teammate.",
            "No one is irreplaceable, also your friend sounds irrational as hell. I certainly wouldn't break up with someone because of a slip or fall. ",
            "Dude can't help but to leave pools of water lying about his home but you need to leave a woman for slipping in water?\n\nYour former pal sounds like he has a serious health issue, and like someone you should avoid.",
            "This whole situation sounds like a whole lotta “yikes”. Your friend seems pretty abusive and shitty. If your girlfriend wants to pay for the repairs, I don’t really see the issue on his part. Sounds like he’s just upset that his buddy is dating someone in the first place. ",
            "Yeah sounds like it would be reasonable for your gf to just pay for the repair on the laptop and he can just suck it up. ",
            "What’s his role? My boyfriend is a pretty good ADC ",
            "If he’s going to end your friendship over a mistake that you guys offered to pay for, that is really his fault, then he’s a shit friend anyway. Sounds like he’s projecting hard about something though. ",
            "Give him a few days to calm down, tell him your relationship status isn’t his choice, and say your gf will pay for the repair, but if he doesn’t want to be friends that’s his decision and you’ll respect it.",
            "I don't see how a video game could make or break a relationship. I'd throw that excuse out. But that's fuckin weird. Either there are underlining issues with your girlfriend that you don't see but everyone else does, or he's just really messed up on how people work. Figure out which it is, and if he's just over stepping boundaries,  cut him out.",
            "IMO, there's something on that laptop he doesn't want lost, or others to find out about.",
            "Give him time to cool off. Maybe find out his irrationality? Also what position and champ does he play? hahaha",
            "She was willing to pay damages, he’s being a sour ass.\nHe either likes you or your girlfriend imo",
            "Your friend overreacted to the moon, this accident is no indication at all to break up with her, I would actually give him some time off and give him the money for the reparation, if he still doesn't understand he overrracted time to cut him off, on the other way, I kind of get it, for someone who games, my laptop is an MSI and those don't come cheap nor they are easy to repair specially in my country, I would lost my shit if my friend damage it by being careless, but I wouldn't actually lend my lap to anybody to be honest.\n\nSo yes, he overreacted to the moon, but there are other aspects, maybe he worked and saved for close to a year to finally buy his laptop, it could have an emotional value, so without knowing the full details I'm not inclined to demonize your friend, like most people here.\n\nBut whatever you do pay him the reparations, that just petty and bad karma.",
            "A girlfriend that has been your best friend since childhood is a prize behind rubies. That's what is irreplacable. \n\nA gaming buddy with mad skillz? Dude. That is what Craigslist is for. ",
            "If this just happened I think you just need time . He might be over it tomorrow and just be reacting off of emotion . . . And you could be too don’t make any decisions while being angry or upset. ",
            "Considering that she fell due to his negligence, the laptop breaking is on him. She's really nice to offer to fix it, but it doesn't sound like that would solve anything.\n\nLeague of Legends: there's tons of players, and I don't care what position your friend plays, there's someone better. Probably even in your area, so he's definitely not irreplaceable. \n\nIt's probably a good idea to talk to the team and explain before he does. It's probably also a good idea to talk to your girlfriend about it (with clear explanation that you think she's right and you're angry at his suggestion). \n\nI'm guessing you're probably going to have to call his play after talking to your team and see if he follows through. Imo I wouldn't want to be friends with someone who acted the way he has.",
            "I play competitive Dota so I get the whole team thing.\n\nBut this dude is a fucking psycho.\n\nSo your options are either cut him out, and figure the team aspect out. Or keep him as a professional only relationship. Or, find yourself a new team.\n\nBut I'd prefer to call my teammates friends first, and great MOBA players 2nd.\n\nEz call for me. GL HF to you.\n\nGG WP",
            "Seems like you got the advice you needed but if you are playing on euw and dia + i can probably find you someone to replace him. I coach lol professionally and know a lot of people.",
            ">It boggles my mind that he wants me to break up with her because she accidentally damaged his laptop, over his negligence in not cleaning up the spilled water.\n\nWait, so it was his mess? Was it at his place? If so, she shouldn't even offer to pay for the repairs. His place, his mess, his responsibility.",
            "Who spilled the water? If it was his spill then it’s his fault anyway. Don’t pay the costs, especially after the freak out. Is this guy a robot? He sounds like he has no idea how normal human beings behave....\n\nBuy him a one of those yellow “wet floor” signs with the little cartoon guy slipping and falling over as a peace offering. Means it can’t happen again!",
            "I would say either find another group or have a group meeting about it. The thing that makes teams work well is respect and trust and at the moment y'all won't have it.",
            "What is he? A jungler? You can definitely find someone else. Hold try outs. ",
            "Just pitching in a small thing here. I have played DotA for years, looked... Think 2007. I've played at different levels, but I spent a few years in high end amateur play, even subbed a few pro games. Everyone, and I mean everyone is replaceable. There is a ton of talent out there, it just takes some time to find it.  As far as what I'd do, I'd hold a meeting and explain what happened and if he won't leave, you may need to find a new team. Ultimately he doesn't sound like an emotionally stable teammate, I bet he's raged on them before as well. If the team doesn't want to lose him, then you can always find another team too. I've been on a lot of teams, tons of tryouts as well, you get used to it.",
            "I think you should give him a few days to cool down and make the members of your League Clan aware of what’s going on. Once he has cooled down approach him and make him explain what he meant about you deserving better. Something doesn’t add up to me.\n\nOnce you have that cleared up you can decide what your next move should be.",
            "Im curious....what role does he play?",
            "Sounds like he just needs a few days to calm down. Seems like this happened in the heat if the moment. I'd have a chat with him in a week or so about how wildly inappropriate his reaction was.  This is a fight. But I do not necessarily think it will be the end of the friendship...if he calms down and sees sense.",
            "I'm late to this party but I wanted to add the fact that she slipped on a water spill in *his* house. He shouldn't have slipping hazards in his house if he doesn't want things to be dropped.\n\nYour friend is acting like a grade A jerk. I'd talk to the members of the game group before he does because he **will** embellish everything. He will probably tell them she did it on purpose. \n\nHonestly I'd be glad to lose that jerk as a friend. What an immature ass.",
            "put me on the team dude pretty sure ill replace him easy ",
            "First, he's irrational to expect a replaceable and repairable laptop to more important than your GF.  If she stole it then it would be an issue.\n\nI wouldn't want to play with the guy either.  All it will do is stir up more friction.  Studies and your relationship with your GF would be more important than League of Legends to me.",
            "Just saying.... I might be bronze elo, but if you need a support let me know, currently crawling out of bronze.",
            "Maybe there is an underlying issue. A crush or something on your girlfriend? Possible? Jealousy?",
            "It sounds like your friend may be jealous of you for dating this girl? And perhaps since he can’t have her since you’re with her, he figures he will just sabotage your relationship so he doesn’t have to hurt. That’s the only reason I can think of on why he would react so foul and unreasonable. I mean, your girl is offering to pay to repair the fucking laptop for fuck’s sake. \n\nIn short, emotions trumps logic, hence why this is my opinion on your situation. I hope you work it out soon OP! Keep kicking ass at League of Legends. ",
            "I hate to break it to you bud, but it kinda seems your friend has a little bit more than friendly feelings for you. Which isn’t a problem, but the ways he’s handling it is. ",
            "He was not a jerk to the team. If you don't want being with him. Leave the team yourself.",
            "I'd cut out him out of my life if I were you. People like that are not good to keep around",
            "Hey man, cut that guy out at I'll be your ADC/Support/Jungle or anything else you need me to be. I learn quick.",
            "OP you don’t deserve this shit. Friendship is a privilege, not a right and it should be cherished. The fact that he publicly shamed, embarrassed and freaked out on your GF like that disrespects your girlfriend, your relationship, your friendship and you. I want to say you should drop him, period. But I know that’s easier said then done with a close friend. For the sake of closure I would give it a couple days to see if he cools down and comes to his senses. If he does I would insist on an apology from him to your gf for being so cruel and overreacting. If he refuses to do so or doesn’t see anything wrong with his actions I would end this friendship and never look back. Don’t waste your time putting energy into a friendship or caring for someone who behaves this way. This is toxic behavior and believe me, if you do not nip this in the bud right now this behavior will probably continue or get worse. Stand up for yourself and make it known that you will not tolerate being treated this way, especially when it’s directed towards the woman you love. I’m sure your girlfriend is mortified and feels awful, I’m glad you stood up for her and hope you stand your ground. I was in this situation with my now husband when we were dating and him defending me and “protecting” me really showed me the kind of man he is. Please continue to reassure her that you are in her corner and on her side, trust me it will mean a lot to her. Good luck! Try and update us!",
            "Time to end that friendship!",
            "DotA team manager here\n\nThere are no irreplaceable people, even on the highest level. If you can find 5 people of a similar skill level, you can always find 6. There are many ways to look for them, such as local (or not-so-local) gaming groups on Facebook for example, or subreddits on Reddit even. You can get to know people in other teams and ask if they are interested in joining you.\n\nFor most professional teams, roster changes are unavoidable, and this behaviour towards a friend and a teammate is obviously unfriendly and unprofessional and kick-worthy. Don't be afraid to let people go - that happens and you need to be prepared for that.",
            "He left water on the floor that your girlfriend slipped and fell on. Sounds like he had no one to blame but himself.",
            "Did he say this immediately after she broke it?\n\nHe could have just been upset and acted irrationally. I suggest you pull him aside ask to have a serious chat with him and talk it through.\n\nMake him understand that you aren't breaking up with her for this and that taking this road is going to hurt everybody but mostly him.\n\nI did something similar where I left a gaming group i used to play with daily because of some minor beef I had with one of the other guys. \n\nIt could have easily been resolved but I took the nuclear option because I was upset at the time. Was a stupid move on my part and regret it.\n\nHopefully, you can get to the root of the issue, maybe he doesn't like your girlfriend for a legitimate reason that you can't see and he is using this event to try and break you up.\n\nIf you can understand the new dynamic of your relationship you can better make the correct decision.",
            "You can try and reason with your friend, but it sounds like the friendship is over. \n\n>he's irreplaceable.\n\nAs you get older you'll realise that friends are replaceable.  Family, not so much. Toxic friends? They are SO expendable. ",
            "He definitely over-reacted, and said some kind of weird things. Even if he wasn't making you choose, I get why you wouldn't want to be friends with him anymore. But if you go to your game group and try to get him kicked out, it will look like you are the one causing drama. That kind of shunning or ostracizing is pretty severe for what amounts to a non-violent verbal dispute between friends, that the group wasn't even involved in. The rest of the group might wonder, even if you don't like this guy anymore, can't you just tolerate his presence in the game, and interact with him for game purposes, while still maintaining your boundary about not being his friend anymore? You are making them choose between you two, while you are mad at your friend for demanding you make a similar choice. Unless it's a matter of personal safety - that he threatened violence, it seems like an over-reaction to get him kicked out from the group, which your GF isn't even a part of.",
            "You should leave the video game team regardless because that’s a ridiculous thing to be on in the first place. ",
            "Maybe he's gay for you :0",
            "How fresh is this? You might give him a week to pull his head out of his ass.",
            "well shit if its his gaming labtop and he takes that shit as seriously as it sounds I understand, Since hes ur buddy and team8 Id recommend letting it cool off and approaching it again. If hes still adamant I mean shit, drop it and dont say anything. Make him unfriend you basically ifyou need him on the team. ur job as a team8 is to remain pretty neutral and not stir the pot. Now anyway back to the situation, he reacted really poorly if she offered to replace it. My gf spilled alcohol on my 1500 macbook and turned it off for good but it wasnt anger I felt. just sadness lol. Then again I was dating her and hes not dating your gf so maybe this has made him hate her unconditionally, it only takes one thing for some people to make that decision\n",
            "tell him you'll reimburse the cost, otherwise he can fuck off\n\nLoL is trash fyi",
            "Probably lost his porn collection and is salty. \n\nIf the team you're on is professional, or semipro at least, I don't get why he doesn't have a tower he games on? I could understand how upset he would be if it was his only gaming computer, but as for what computers can run league... its really not that intensive. \n\n",
            "There is more to this story than meets the eye, I would be happy to Mediate this situation for you DM me",
            "I'm curious about what game it is?\n\nOh, and he's being super weird but I think you see that. ",
            "Jesus, the issue is between her and ur friend idk what YOU have to do with this at all. Shitty friend you’ve got there, sounds a bit possessive ",
            "I gotta know, what game?",
            "You, or your girlfriend, should pay for the repairs. You shouldn’t break up with her though. You can try one last time to talk to your friend about why he’s so upset. As for your team thing you can just be honest with the other players. Say you and him aren’t on good terms so playing with him would make you feel uncomfortable. Find a new team to play with. ",
            "let him cool down a bit and then let him know how ridiculous he sounds.  If he's a little Aspie he may not realize how abnormal he is behaving.\n\n\"Hey dude, you know you sound ridiculous right?  If she had broken it on purpose, or refused to pay to repair it then you could have a point.  But it was totally an accident, which could happen to anyone\"\n\nIf he still expects you to break up or he will drop you as a friend then I think you are better off without him.  No one is irreplaceable.",
            "[removed]",
            "So ... a few points:\n* your girlfriend borrowed the laptop, her responsibility for due care, etc.  If it's lost/stolen/damaged while she's borrowing it, she's responsible for that to your friend.  E.g. covering costs of repair (or if not feasible) replacement.  Seems your girlfriend has adequately done (or at least offered to do) that.  That should be the end of it (presuming she follows through on her offer in reasonably timely manner).\n* your friend is way out of place asking you to break up with your girlfriend - or even offering unsolicited commentary on your relationship - none of his business (unless you invite him into it).  So ... tell your friend to drop it and knock it off with his commentary and demands in those regards.\n* you may need to drop your \"friend\" - he sounds like quite the \\*ss.  Nobody needs that.  You may need him as a friend about as much as you need an extra large hole in your head.\n* nobody is irreplaceable\n* video games are even much more replaceable than people\n* oh, yeah, if you let your friend get his way with such horrible behavior, demands, etc., that will only further encourage such behavior from him.  Not recommended to comply with such outrageous and inappropriate demands/requests - best recommended to at least outright refuse such ... period.",
            "When a guy has to choose between friendship and a girl. Usually, the girl is chosen. Remember the bro code son. ",
            "I think he's just angry that he lent her his laptop and it got broken. But both guys are completely overreacting. Girlfriend needs to pay for the repair. Boyfriend needs to say you were out of line with how you spoke, the laptop will be repaired of replaced, so calm down. Laptop gamer guy needs to cool off and apologise for blowing his top. And everyone move on from it.",
            "[removed]",
            "You should offer to replace the laptop, not just repair."
        ]
    },
    {
        "post_id": "bke0dw",
        "author": "SensitiveKitchen7",
        "title": "My brother [18M] got caught smoking weed; now my parents [51F, 56M] want to drug test me too [23F] to be \"fair\".",
        "url": "https://www.reddit.com/r/relationships/comments/bke0dw/my_brother_18m_got_caught_smoking_weed_now_my/",
        "score": 2589,
        "num_comments": 529,
        "created_utc": 1556920543.0,
        "selftext": "My younger brother, let's call him John \\[18\\], was subjected to random drug testing at his high school last week. (He knew he was eligible for it, students must sign a consent form at the start of the school year). He is a frequent smoker, and tested positive for weed. He tried to get ahead of the situation by telling my parents what had happened. My parents freaked out, acted like John is a complete failure, and started to think of ways to punish him. My parents and my brother already didn't have a great relationship, and this event made it much worse. Thankfully nothing criminal will come of this, John just has to take an online drug counseling course. He is going off to college this fall.\n\n&#x200B;\n\nI \\[23F\\] am in graduate school in another state. I never smoked in high school, and now in college it's a very infrequent activity, mostly when I'm home by myself to de-stress or at small social gatherings. Weed has never negatively impacted my life, I've gotten good grades, internships, fully-funded grad school, never in trouble with the law. I've always had a great relationship with my parents and feel close to them. \n\n&#x200B;\n\nNow, my brother and I haven't always had the greatest relationship. My parents tend to view me as the \"golden child\" and compare my brother and I. I've tried to be close with my brother but I think he feels some anger towards me because of my parents. However, one thing John and I recently bonded over was weed. I suspected he smoked and told him I have too. Our relationship improved a bit, I think it helped him see me as more relatable and more of a friend. We talked about it a few times but never smoked together or anything like that.\n\n&#x200B;\n\nNow, back to my parents finding out about John and freaking out. My parents decided they were going to drug test him from now on, and he could lose his phone, car, and even college if he keeps smoking. Well, John ended up ratting me out to my parents (who had NO idea I'd ever smoked). I think he threw me under the bus to try and make his actions look better. Now, my parents are saying that to be fair, they're going to drug test both of us, and if I test positive they will take my car. My parents seemed like they don't really want to drug test me - in fact, my mom said she would try and tell me in advance of when they would do it - but they want to be \"fair\". Keep in mind, I am still living out of state this summer, so any drug testing would take place when I visit home (which is only going to happen a few times).\n\n&#x200B;\n\nI wasn't planning on smoking the next few months because my internship random drug tests. However, I feel like my parents aren't respecting my decisions and privacy as an adult. It isn't like I still live at home, and weed isn't impacting my life in any way. It was solely my brother's fault that he got caught. Additionally, my boyfriend lives in a state where weed is legal, so really, what do they expect? The only thing that still ties me to my parents is that they own the car I drive. They agreed to let me drive this when I started grad school, as they knew I wouldn't make much money and they valued me furthering my education. However, I pay for everything else myself.\n\n&#x200B;\n\nDo you think my parents are being reasonable? Is it fair to apply John's punishment to me, even though we are at very different stages in our lives? How can I tell my parents I am uncomfortable with this while maintaining a good relationship? And how do I address this breach of trust with my brother? \n\n&#x200B;\n\nTLDR: My younger brother got caught smoking weed, and my parents plan to randomly drug test him. He snitched to them that I've smoked too, and now they want to drug test me.\n\nEdited to add: My brother came to me right after he was tested asking for help and advice. right after this situation went down, I was very clear with my parents that I have smoked and I thought they were overreacting. I defended my brothers actions and tried to educate them about marijuana. Many people are attacking me for the way my brother has been treated but I have very much supported and defended him.",
        "permalink": "/r/relationships/comments/bke0dw/my_brother_18m_got_caught_smoking_weed_now_my/",
        "comments": [
            "Tell them, politely to pound sand.\n\n\"I've thought about it and I won't be taking a drug test for you.  I have smoked pot on a few occasions, in the past, but haven't recently.  At present, I'm subject to drug tests as a condition of my internship.  But I am an adult and it is legal for me to smoke in several states, BF's included, so if I want to smoke in the the comfort of his home, I will do so.\"\n\nBe prepared to return their car, if that's what they want.",
            "It's long past time your parents stopped invoking you in how they parent their other child. That's the real heart of the matter, isn't it? Insisting on drug testing you too is just more \"sister vs. brother\" games. The fact that your mom wants you to pass makes it sound like they want to prove their golden child is still golden. You know they'll throw it in John's face if you pass the test. But if you fail they'll freak out on you too. Even if you do exactly as your parents say, you cannot win.\n\nFor that reason, if you can remotely afford to risk giving up the car, this is a stand worth taking. You might even be really blunt about the fact that you no longer want to be invoked in how they parent John.",
            "You're 23 and don't live at home. It's absolutely insane that your parents would think that it's okay to drug test you. Laugh in their face and tell them to pound sand.",
            "Wow, your parents sound controlling. Forcing your brother to \"lose college\" over something as harmless as weed. They are going to make his life worse than any amount of smoking.\n\nOther comments have it right. You don't need to take the drug test and your commando anti drug enforcing parents need to take a breather",
            "\"Dear Mom and Dad, upon review of your request and some brief research, I discovered that collective punishment is against the Geneva Convention.  Specifically:\n\n> Article 33: Individual responsibility, collective penalties, pillage and reprisals\n>     No protected person may be punished for an offense he or she has not personally committed. Collective penalties and likewise all measures of intimidation or of terrorism are prohibited\n\nI hope this sufficiently clarifies my position on this matter.\"\n\nI mean, if they want to be ridiculous, so can you.",
            "Tell them you’re not taking the drug test, and you’re happy to have them pick up the car next time they visit you.\n\nAs for your brother, you can probably tell him something like “Hey, the fact that I told you I smoked weed was something I told you in confidence, and it really hurt me to know that you betrayed that trust.” But realistically? He was a panicked teenager, and he reacted more or less how a panicked teenager would. I would take this as a lesson not to share as much about yourself with your brother for now, or at least until he gains some more independence.",
            "Just refuse to take the test. State that you're an adult and if they want to be petty and take your car it would negatively influence your opinion of them. Then be prepared to go on craigslist and get a car or lease one or something else. As has been said on this sub a million times: adulthood is not given, it is taken.",
            "Just tell them no.  Just say \"no, I don't think so, I won't be submitting to a drug test.\"\n\nIf you feel strongly enough about it, tell them if they want you to take a drug test when you come visit, you just won't come visit until they drop this BS.\n\nYou live out of state and you're an adult, so they can't come make you do anything.\n\nIf they threaten to take the car tell them to come and get it, but be prepared to buy your own car.  Bike, walk, carpool, public transport, or find a craigslist beater for cheap.  I'm a hard headed a-hole so me personally, I'd give the car back and tell them to shove it just on the principle of not letting them have something to hold over my head once they've shown that it's something they're willing to do because they suck at parenting their other child.  Just because your parents help you out doesn't mean you should submit to any stupid degrading treatment they bark out.  Being a good parent to an adult child doesn't entitle them to intrude in your life and make demands, so if that's the attitude they are going to take, I'd personally make sure they have zero financial/legal stake in your life from now on, and adamantly refuse any help and/or large gifts from this point on, with this as the verbally stated reason.\n\nAlso be sure to let them know how stupid they're being by trying to treat you like a minor child when you live out of state and are 23.\n\nAs for your brother.  I'd tell him if he's old enough to smoke dope, he's old enough to handle his own problems without throwing you under the bus.  Also that you thought your relationship was improving, but you're probably not going to be able to trust him with information for a while since he can't really keep things between you two when your parents put the screws to him.",
            ">any drug testing would take place when I visit home (which is only going to happen a few times).\n\nAre you actually considering going home? Tell them to come get the car and go buy a beater to get to through grad school. As far as hills go, this is a good one to die on.\n\n Tell them this: \"Mom, dad. I'm an adult and will not be treated like a child. I'm responsible and I will not be letting you impose on me like this. Come get the car and drive it back if you want. Are you absolutely certain you want to destroy our relationship over this?\"",
            "Unfortunately I think you want something that's impossible. \n\nI don't think you have any way of staying neutral in this dispute between your parents and your brother. You either side with your parents and say smoking isn't OK (which will hurt your relationship with your brother), or you side with your brother and say your parents are wrong to freak out (which will hurt your relationship with your parents). If you just say nothing, then by default you'll be siding with your parents.\n\nI'm not sure it's fair to say that your brother breached your trust (unless you made a big deal of \"never tell our parents this\" - in which case yeah, he did). I think you're right to say he was trying to make his actions look better - but it sounds as though you don't even think there was anything really wrong with his actions. Smoking at a time when he was near guaranteed to get caught wasn't smart - and I think you could reinforce that by talking to him about why you don't smoke during your internship - but it sounds like your parents are making a much bigger fuss than you think is reasonable. So if you do choose to side with your parents, your brother is likely to think you're a hypocrite.\n\nCan you afford to pay for transportation without your parents' help? If you can, then I think the most supportive thing you could do for your brother is offer to give the car back. Explain to your parents that you didn't realise the car came with the condition that you didn't smoke, and that you wouldn't have accepted it if you had realised.\n\nIf you can't afford to pay for transportation without your parents' help, then your choices are trickier. You either refuse the drug testing and essentially dare them to take the action they've threatened, or you accept the drug testing (and accept that their money gives them some control over you). Neither of those are good options.",
            "Tell them you smoke weed sometimes. And that if they took the car away it would impact your future far more than the occasional salad bowl. Ridiculous.",
            "When they ask you to take a test, or tell you one is coming up, act baffled. \"Absolutely not.\" If they try to take their car back, tell them that as it's their car they can collect it at any time they like, but that you are very disappointed that they are reneging on their agreement and it will negatively affect your relationship with them going forward. \n\nThey can withhold their car, you can withhold your contact. But I'm petty like that.",
            "I don't think your brother \"snitched,\" as in he was trying to also get you in trouble. It sounds like he (naively) thought it would prove to your parents that weed is not that big of a deal, since their favorite child is also smoking weed. \n\nYour parents are being ridiculous. But if you take money from them, don't be surprised that the money comes with strings. If you accept their financial support, you accept their conditions, and one of those conditions is no drug use. \n\nI supported myself through grad school. I worked 2 or 3 jobs, I usually got up at 5am and was not in bed before midnight. It was awful. (Neither did I really have the spare time or spare cash to smoke weed) but that's the price of being truly independent",
            "Ask Mum and Dad what's the end game here? Were you concerned about Johns behaviour before the random drug test? How was he doing in school, was he setting goals, was he depressed or withdrawn, were there any issues setting a long term goal like college admissions? Nope? Then maybe we're making a bigger deal of this then it needs to be long term. Short term - how can he finished with school if he's facing expulsion or whatever. Then ask  - Do you have any concerns about the progress I'm making? No? Then what are you hoping that taking a drug test will show you? If John was failing school/athletics/not setting goals/withdrawn or depressed then I understand his drug use could contribute to that and John needs to find a different coping mechanism and a consequence of taking away his phone/car might help motivate him. Why don't we book a few sessions of family therapy to figure out what the best suggestion will be to move forward?",
            "Schools drug testing students, parents drug testing their children... is our society sick or what?",
            "Tell them you are already submitting to drug testing through your program. Offer to share those results, but tell them that you won’t submit to any further testing. Maybe that will be enough to placate them and let you keep the car. It’s none of their business what you do in your private life. And as long as you are keeping up your grades and supporting yourself I don’t see why it matters.",
            "What kind of high school drug test their students? My job stoped doing that a decade ago after they found out only weed shows up and everyone is doing harder shit. Tell your parents to fuck off and to grow up it's only weed, it's not like you guys are dirty alcoholics or popping needles.",
            "[removed]",
            "No it is not fair. You are an adult not living under their roof.",
            "23 and in grad school, and your parents are gonna test you for pot? Wtf. You're more of an adult than most people at 23. Ridiculous.",
            "Lmao what?\n\nTell them \"Either you drop the idea of drug testing me when I visit this summer or I don't visit at all.\" Your parents clearly need to get more familiar with their boundaries.",
            "Obviously, 23yo adults do not submit to parental drug tests. And certainly not to be fricking fair to the younger (adult) sibling who knew a drug test was coming (not that I agree with this high school).\n\nThat said, GIVE BACK THE CAR. It belongs to them. They were doing you a solid. They asked for a drug test. That's idiotic. But it's their car.  \n\nYou are allowed to live your life. They can't control it. It's a CAR. Go get another one. And yeah, it's *that* simple.",
            "Your brother consented to random drug tests, and got exactly what he consented to. Your brother lives at home and knows his parents don’t approve of weed.\n\nNeither of these things apply to you.\n\nYour brother made a conscious decision to violate a rule he’s already agreed to follow. You followed the rules and conditions that apply to you. Therefore, forcing you to take a drug test would be the opposite of fair. \n\nThey can take their car away if you don’t. It’s a shitty thing to do...but unless you are paying for it or have your name on the title...your use of the car is at their mercy.",
            "I’d straight up tell them that you smoke weed occasionally and if they want the car they can come and get it.",
            "I’m assuming the car is really not your but rather theirs... otherwise you could just say no. \n\nProbably need to give the car back so they don’t keep holding it over your head.",
            "If you're willing to lose the car possibly I'd tell them to politely fuck off, you dont live at home and it seems like the bud is not causing problems in your life, however your parents are",
            "Microwave your parents! Problem solved.",
            "Their car, their rules. Granted this was not part of the original agreement, but the situation has changed. A new cost of using their car is having your privacy violated whenever they feel like it, and judging you. You have a choice. Whether this is \"fair\" is irrelevant.",
            "Ur a grown women above 21 tell them your life is urs I live in a legal state and have my medical card they are being very petty and i would turn the test down...cannabis is so misunderstood i can understand saying don’t use to someone with a developing brain but thats not the case with you Ur 23 ita none of their bussiness",
            "I'm going to take the opposite view here. \n\nJust take the drug test and keep the car if you can't negotiate with them at all.\n\nSure your parents are absolutely shit for making you take one but if you're in grad school and can't afford to get your own car and your quality of life would decrease considerably without it, just do it.\n\nPrinciples won't replace convenience at this point.\n\nOnce you're totally independent, tell them to get lost.\n\nIf you can afford to get a car relatively quickly/easily, then call their bluff, tell them you'll return the car and see if they back down or pay them back and put the car in your name.",
            "Wow am I the only one who feels bad for your brother he’s clearly the scape goat child. I don’t even blame him for ratting you out tbh. He’s a total failure for smoking weed but when you do it they don’t eben care and they’ll warn you in advance so you can pass? Totally fine for you? But your brothers a failure? Uhhh I understand his resentment.\n\nIf you’re using their car either decide to keep smoking weed and give it back or don’t smoke weed so you don’t have to deal with a car loan. It’s their car it seems totally within their rights to reclaim it or cut off financial help for anything else.\n\nYeah they’re not respecting your right to be an independent adult because you’re not entirely independent of them. Get independent and show them you aren’t beholden to their rules... or continue to be beholden to their rules. But it doesn’t seem fair that you should get to smoke weed and get financial help while your brother doesn’t? He’s an adult too so it’s weird to me that you think you should be getting any different treatment.",
            "Just give them the car back if it isn't in your name.",
            "Testing him is a punishment. You did nothing wrong. Why do they think it is ok to punish you?\n\nYou are a (mostly) independent adult. They no longer have any say in how you live your life. If John doesn't like it, tough shit on him.\n\nIf you refuse, how likely is it that they will actually take your car? Do you feel comfortable calling their bluff? Can you live w/o it? Can you avoid going home until you are finished with school?",
            "At 23 you shouldn't be subjected to having to take a drug test from your parents. That's just bullshit!\n\nBy the time I was 18 my parents knew I smoked as I had been caught before. I told them point blank that I couldn't promise them I'd never smoke again. But by 18 it was out in the open. Because I live in a legal state, I now tell them all about my trips to the dispensary!",
            "Tell them that you will drop off your car ASAP. You have shown repetitively that you are trustworthy, het good grades, and earn respect and trust, and that you will figure something else out",
            "Refuse the drug test. They have no right to do it. If they want to take the car, let them.",
            "As you said, it's your life, you're an adult, and you have autonomy over your own choices. There is no reason for you to be drug tested by your parents when it doesn't impact your life and it's *legal* where you live. It doesn't negatively affect you, it doesn't affect them, it doesn't affect your brother, there is no real precedent for you to stop, and you need to nip that in the bud.",
            "fairness: impartial and just treatment or behavior without favoritism or discrimination   \n\n\nYour body, in the name of the law, is yours, and yours alone.  You did not consent to a test.  Your brother did.  You did not break the law.  Your brother did.  Fairness most certainly is not punishing people with test results they didn't consent to, which prove nothing illegal, simply because a sibling failed a test which he consented to that prove something illegal.  Fairness would be making sure the punishment fits the crime, and you have not committed one.  He has.",
            "No, it's not reasonable to drug test you because of someone else being on drugs. It makes no sense. \n\nBut yeah if the car is theirs and they are lending it to you, it's totally within their rights to take it back if you smoke and they don't want you to or if you refuse to test. Even if you are responsible and pay for everything else. It sucks but it's theirs and honestly, at least they actually are trying to avoid favoritism now. It's a bit too little too late but ah well. That's what therapy is for.\n\nStand whatever ground you want, just gotta know their car is the collateral. Make whatever choice you want given that info",
            "Your brother probably tatted you out because your parents were rubbing it in his face to be more like you. If it’s their car it’s reasonable especially since you will know when you will be drug tested, but at the same time you are an adult... if you bother we’re in the same house, then yeah, all is fair. The biggest lesson he could learn from this is that LIFE ISNT FAIR.",
            "Wow I'd understand if you were 14 or so but they can't just demand things like that off of you at 23. You're an adult now with your own life. They are overreacting, and this is coming from someone who doesn't smoke.",
            "Are you, or have you ever paid for any of the car? If the answer is \"no\", then you are going to need to bend to their request in order to keep it. It's theirs and you don't  have a leg to stand on, unfortunately. If you have been paying on the car, you need to gather up the receipts, statements, canceled checks, etc and keep them incase it comes to a point of your parents trying to take the car. If it comes to that, you need to go on r/legaladvice.",
            "I’d say give the car back. My parents tried to pull something similar when I moved in with my boyfriend. They didn’t pay my bills but I was on their family plan for my cell phone, for which I paid my portion of the bill. That was the only area where they were even close to having any financial impact on my life and they tried to threaten to kick me off their plan. I immediately went out and got on my own plan. I think it’s just a grasp for control, but as an independent adult it’s liberating to cut that tie honestly.",
            "You've gotten good answers from what I've read. I would add just pick yourself up another car, doesn't have to be expensive or new just something to get you from under their thumb. Or else they'll always have something to hold over your head",
            "I would remind them that your internship already drug tests. But if they want the car they can have it back. Acknowledge that it will hinder your progress financially/educationally but if that’s what they want to do to you for no credible reason then accept that.  Let them feel the guilt.",
            "Okay, maybe I'm unethical, but realistically you and John are at very different parts of your lives. Unlike John, you have a job and quite a bit more responsibility on your shoulders with your life in a positive way. You yourself know how to handle your time and manage it well, you don't find weed detrimental to your lifestlye.\n\nI would just pee in the cup, watch it come up negative, and make everyone feel stupid by saying \"I can't smoke because of my job.\" Let your bro take the heat for getting caught and trying to rat you out. Keep your car and carry on without the drama between you and your parents at least.\n\n3/10 would not rob a bank with your bro",
            "Yeah, I think that you should give the car back and tell them to shove their drug test: \n\nYour parents are hugely overreacting but if they paid for the car, they get to set the terms.",
            "It’s your parents car. So the weed thing is fair game. Get rid of your car to get rid of the problem",
            "Just own up to it. Fuck the car. Take the bus. You are an adult they have no right to invade your privacy like that. I say own up to it to help your brother out. Poor kid sounds like hes never had a fucking chance with them. I know exactly how it feels to be in a position like that and never once did my sister stand up for me.",
            "Give back the car and free yourself. You can get a used car for fairly cheap. Once you are fully self-sufficient they lose all their bargaining chips.",
            "Force them to sue you for the car and then never speak to them again. \n\nStop trying to maintain relationships with garbage people just because they're related to you. You don't have any obligation to your parents, people.",
            "I feel like this thread confirms my suspicions that this sub skews realllllly young. OP, you are driving your parents’ car and you don’t appear to have another transportation option. You are hosed. You either play their game or be prepared for whatever life would look like for you without a car. Standing on principle is a luxury that not everyone has.",
            "I would say to make your opinion on their decision to drug test you (and your brother) known, because it is completely ridiculous, but then Go along with it anyway. You're doing it for your internship anyway so what is another drug test, really?\n\nWhat is the point in losing your car over something like this? If your car is absolutely necessary, then put up with what they throw at you. Don't lose out on something that is benefitting your life just because of the principle of the matter. Sometimes you have to put your feelings aside and do what is practical.",
            "ITT: jUsT gEt YoUr OwN cAr, ItS sO eAsY",
            "The fact they don’t agree with weed and its legality is behind the times.\n\nI think your parents are with complete objectivity, cruel and harmful to disapprove of weed because it’s a useful drug and it’s a wonderful anti-anxiety with all these medical benefits. It also seems they’re intensifying it’s negative stigma just as a way to punish your brother.\n\nHowever I can understand why a lot of people still find it a stigma. And they can’t be blamed. But since you’re asking for an opinion, they’re not in the right.",
            "It’s their car, so they make the rules. If you really need the car, don’t tell them that you smoke, and let them drug test you since you’re not planning on smoking for a while. If you can make other arrangements for transport, give them back the car and then you’re free to do as you like.",
            "Meh, you'll probably piss clean if you're an infrequent smoker. Ant local pharmacy had a drug test you can try yourself. Weed only stays in your system for 30 days if you smoke a lot, and you have a lot of fat to store the thc in. \n\nIf the exchange is a clean piss test for your car, take the clean piss test. You need the car",
            "You have full rights to draw this line in the sand. Whether or not you want to do so really comes down to whether or not you want to give up that car, though. It's likely that if you refuse they are going to try and take the car, so you're going to have to decide if you're okay with that. \n\nAs for your brother, it's obvious that your relationship has only improved so much. Either that or anger and resentment of how your parents treat him compared to you caused him to blurt it out in the moment. You won't know until you talk to him and your gauge on what happened will probably guide you on what to do from here. Think about that before you talk to him so that you know how to proceed once you get an idea from him what his thoughts were when he told your parents.",
            "[removed]",
            "Tell them no, your an adult on your own, do not take their drug test.",
            "What i do alone at home is no one else's business.\nI keep my grades I have a great job if you want to ruin our relationship by taking the car and making my life difficult then do .. but there are better ways to deal with your feelings around this issue and I welcome a discussion.\n\nAlso some therapy sessions with ypur brother without your parents they caused this rift so this could give you the foundation to build some bridges . Ypur parents rely on this dynamic to be viewed as successful parents if only 1 of you does well",
            "do your parents support you? your 23 if you have a job and they don't support you just blow them off.",
            "Are your parents that controlling that they will actually attempt to force drug testing? How will that be administered? Are they willing to pay for it? Are they going to drive your brother to a medical facility or whatever and force him to pee in a cup or force him to at home and then mail it in and get results? Like I guess I don’t really know the specifics of actually performing a drug test but it seems unlikely any testing of your brother or you will ever actually happen just due to the mechanics of it. It’s just a ridiculous threat and really only a punishment to your parents. Keep us updated",
            "until you start buying your own toilet paper you are not free and living on our own",
            "You’re an adult fuck them",
            "You're an adult... tell them to go drug test themselves.",
            "Get your own car or learn how to manage without one. Drop theirs off at their house. \n\nSeriously. If you are the \"golden child\" the best thing you can do for your brother is establish clear boundaries now so that when he is an adult they don't think they have a right to control what he puts in his body...as long as he maintains his independence.",
            "\"Parents, I appreciate your concern but I am an adult and do not live under your roof so I would like you to respect my privacy and my ability to make choices and decisions.\"",
            "compare my brother and me*",
            "To be fair, both of you are adults and I feel like your parents completely forget This.",
            "Has nothing to do with \"fairness\". Has to do with control. Time to assert yourself.",
            "Tell them you’re not doing it and that them setting up circumstances where you are “alllwed”\nTo smoke it and he isn’t, (letting you know beforehand so you DMs get it out of your system before the test) is absolutely hypocritical you’re in your 20’s and he’s also a legal adult now. They wouldn’t use it to take away college, so why would they o that to him? Stand up for him a bit too. Golden child and scapegoat child roles are extremely toxic and abusive dynamics to have in any family. \n\nOf course I’m sure they won’t like any of that. Both of you will have to work on getting your own footings, like a car. He needs to move out sooner than later if they’re willing to ruin his chances of a decent livelihood (by keeping him form college??? Like what the fuck?) like seriously. What kind of person doesn’t want their child to succeed and jumps at the chance to take away their opportunities?\n\nYou both deserve better than that. Get close with your brother, you guys deserve a better relationship.",
            "You’re 23. Just tell them yea I have smoked some weed.",
            "In france, at 18 we are not minor anymore, then we just become fully independent, our parent r supposed to have no more power on us, and I think this is the right age, ur brother can smoke if he want, till he not become adict obviously. At 15 i already tried weed, and now I smoke some in party, this is the same fur all of my friend, idk if this is the same in others country, but now weed is easier to get for minor than cigarettes, I think ur parent are a little bit '' late'' with drug in our society.",
            "Just say NO\n\nto your parents.",
            "You’re 23, just tell your parents No, it isn’t happening and to chill out.",
            "Your parents are manipulative as fuck holding the car over your head to comply with them.",
            "I mean.. group punishment is a war crime... \nbut in all seriousness you probably need to talk to your parents about boundaries.",
            "No. You're an adult. Just tell them politely that you're not going to do a drug test and, if they insist, then return their car. As a parent of similar aged children, I would never do this... It's awful. Totally undermines your freedom to do as you choose - though it's up to you to take the consequences of your actions..... From college, maybe. Parents? Definitely not.\n\nThey're trying to control you. If you have to, then return the car and do what you have to do to get another car, no strings attached.",
            "Yeah you're an adult. I'd tell them to shove it",
            "It probably isn't the best solution, but if it were me I just wouldn't go back to their home. If they ask why, I'd say I value my privacy and with the way they're treating your brother, I feel like they wouldn't respect it.",
            "Buy a cheap car.\n\nExplain to your parents that you’ve smoked and inhaled and enjoyed it and plan to do it again.\n\nStay in touch with your brother. He needs your support at this time.\n\nStay in touch with your parents ONLY if they learn mature, adult boundaries fast!",
            "What a country to be alive amirite. 'muricas freedom where you can't even walk around without getting drugtested",
            "Punishing people for doing nothing wrong is the opposite of fair. They need to be taught the difference between equal and fair. Talk about a black and white approach to life.",
            "Don’t do it, they are being ridiculous. Give them back their car and get you something you can afford to get around in. If you let them control you at 23 with money and things, you’ll never be free of their control.",
            "I guess you can send them the results of one of the random drug tests they've done in your workplace and tell them that as an adult you don't need to prove yourself to no one but yourself and you 've been doing a great job with it. Ask them politely to respect your privacy.",
            "Show them a print out version of your post, without the tl;dr but include the reply from u/teresajs instead as a final note. (well, without the username but just as one text, you get what I mean).",
            "You are amd adult your brother is an adult tell them to go f themself",
            "I’m probably going to get downvoted for this but..\nIf they are drug testing you at home it is likely they are using a cheap drug store urine test. When you go home just pour fake pee into the testing cup. You can get them cheap at pretty much any head shop. That will insure your parents sanity and that you get to keep your car. \nMany might argue that this means you aren’t standing up for yourself but you have to ask yourself if this a battle that is really worth fighting. There is no reason you should stress over something that is so silly and petty. Keep your parents in the dark and focus on school and your internships. Trust me, everyone will be happier because of it.",
            "This seems to me like an ignore and call-their-bluff situation. Don't bring it up, don't get involved in any relevant arguments, and this will probably blow by like the empty threat it was to show equality to your brother.",
            "Sad this is still happening in 2019. Maybe give them some resources to de-brainwash them about cannabis.",
            "I think you should tell them that there is no fairness in punishing both of you because of the mistakes of one.  There is no greater lesson to be learned here because you've always had your shit together. Furthermore, this will only teach to your brother that he doesnt have to take full responsibility for his actions and that it's okay to throw someone under the bus in order to look better himself. Finally, it's plain wrong that your parents are educating you two as if you were both living at home and have the same age. He's barely legally adult and still under their roof, it's perfectly normal that your parents are more strict with him than they are with you. \n\nHonestly,  it looks like a lazy way for them to solve the situation without having to explain to your brother that he's not entilted to the same freedom that you are and to manage his feelings.",
            "Uhm that is not reasonable. You are a grown woman who does not live with them. Why should you have to have your brother's punishment? Just give them back the car if they want it so badly.",
            "As my father would say to me, \"tell them to piss up a rope.\" Buy your own car and tell them that you're an adult and will live your life as you see fit. My mom used to try to do stuff like this to me, when I was in high school, so I started working full time in the summer and part time during the school year so that I could buy my own personal car.",
            "Your parents are in the wrong here. Sure, they may not find it very positive to know that both you and your little brother smoke, but since both and your brother are adults they legally have zero say in the matter, especially if smoking is done in a state where it is legal. Smoking in your free time is your decision and same goes for your brother. Your parents may force a rule that no smoking is to be done at their property but that is about it. \n\nYour parents are completely in the wrong for using the car as a scare tactic and control measure to force you towards their believes. If I were you, I'd save up for a car of your own and return their car as fast as you can because this will not be the first time that they will threaten you.",
            "Give the car back. But if they are paying for school, be prepared for them to hold that over your head next. Are they paying for your apartment?  How and when can you assume those expenses? \nHow you go about telling your parents is a big deal, especially if you have more on the table to lose.  Find some quick articles on negotiations. Find a way to sell your side. Are they trying to control you, or are they coming from an upbringing that says all drugs are bad and smoking weed means you'll end up a junky? You know your parents better than us so take all things into consideration before going nuclear.",
            "Um... both of you are adults right? Like, your parents do not have the legal right to unethically drug test you for a substance that is becoming more and more legal by the minute. I'd honestly ask them if they really want to start this, this interrogation of their family through fear and ignorance just to push you both away so you never want to come home? I would just flat out tell them that if they do this shit I'd stop coming home to visit. Full stop. You're what, 23? Really ask them if they want to be pushing you guys away rn during a time where both of you are becoming independent and leaving the house. All I see is them being fucking alone within the next 3 years due to being crazy about pot.",
            "I mean you could take a stand and refuse (as an adult that is your right), but you’ll lose your car that you seem to need.\n\nSeeming as you’re not taking drugs right now and you need this car, I’d just do it for the easy life. It’s not really invading your privacy if you choose yourself to allow it to make things easier for yourself.\n\nTake a stand = lose car\nDo drug test you know you’ll pass = nothing changes. \n\nSeems like a no brainier myself, sometimes being an adult is putting aside all the “my privacy” bullshit your scream as a teenager, and just taking the easiest route because life is hard enough.\n\nJust my opinion.",
            "I’d say tell your parents that you’ve smoked before and that you aren’t going to take their drug test. Your brother is subject to their rules as he lives at home and is in high school but you aren’t as you’re an adult. However, if they decide to take your car I think they are within their rights but it would be really dumb. Also, maybe use this as an opening to talk about drug safety and why he shouldn’t do it at 18 (brain development plus it links to increased anxiety in teens) and explain how when he is independent he can decide for himself.\n\nPersonally, as a freshman in college who has recently started smoking weed (both socially and on my own time) the stuff is legitimately why I’m still in college right now. My depression is practically gone, I don’t have trouble falling asleep anymore, and I really like college. I used to cry driving back but now I’m home for the summer and can’t wait to go back in the fall. Obviously this won’t be the case for everyone but as long as you use it in moderation you’ll be fine. It’s (chemically) non-addictive plus it’s not even half as harmful as alcohol (rolling papers in your lungs is about as bad as it gets). I’m not saying everyone should go get high but I’m saying that if he’s gonna smoke (which he probably will later in life) make sure he’s being safe and smart about it. It can be beneficial but it can also steal your ambition.\n\nGood luck! If you ever wanna know more about weed or need anything feel free to DM me :D",
            "Your parents are insane. And will permanently damage their relationship with your brother by acting like this. No trust, no respect. Just damage.",
            "The US certainly is a backwards country with all these random drug tests.",
            "Go buy your own car and smoke all you want. Since you're an adult and all.",
            "When you’re on the dole, expect strings from the provider, no matter how stupid those strings are.",
            "I also have a younger brother. If this happened to me regardless if whether I smoke or not this is what I would do.\n\nI would tell not brother to F off and he can expect zero assistance from me in future until he apologises for being an ass hat.\n\nParents need to understand you are 23 and have made it this far responsibly so they really have no right to \"punish\" you as though you are a child. They had done a great job raising you and you are grateful for your car and tuition (if they are paying for that too). I would tell them straight up you are not a child what you do in your free time is none of their business especially if it is legal where you are. You are responsible and get good grades they need to trust you and not involve you in your brother's issues.\n\nI get they might pull the our money our rules card but you are on campus and doing well they have no reason to stress you out further over something that is a non issue in your life.\n\nGood luck and honestly stand your ground they are being ridiculous you are too old to be treated like a child.",
            "I’ve been in an extremely similar situation. It’s sucks that your parent are so close-minded about weed, mine sure were for a long time (They have since researched and come around to not caring who partakes).  \nHonestly what it came down to was I had to buy my own car. They would not budge on being responsible for someone else driving a car they owned that could not pass a drug test. I ended up buying the car I was driving from them and they were still pretty unhappy that I smoked but I was not willing to give that up for them; after all I was already an adult and that is not their decision to make. \nI’d refuse the drug test; you’re over 21 and you don’t even live with them. You do not need to do whatever they want. I’d just go ahead and return their car (or ask them if they’d like to sell the one you are driving to you) and that’s that. \nIt sucks but as long as they’re supporting you in any way they’re probably going to make a huge deal out of it. \nGood luck!",
            "No offence, but your parents are psychos.",
            "If the ‘gift’ of allowing you to use the car has strings attached, then it’s not a gift. Give them the car back and get a bus pass. This raises red flags for their future actions as they clearly don’t respect you as an adult, so I would be wary of future behaviour especially when you have children.",
            "So when I got caught I thought the world end, because my parents freaked out. They were pretty mad in the beginning, but after a week or two everything was fine again... Now Im actually casually joking about it with them. The other day I accidentally left a small metal box in my jacket where I store j's in. My Mom found it, smiled and said that I at least had the right gear....\n\nSo I guess even if you get tested you're gonna be fine. Eventually even parents realize that weed isnt that bad.",
            "I just read in the comments that your parents were okay with underage drinking but not with weed? That makes no sense on their part. You are 23 year old grown woman. Yes they got you a car but what you do with your life as an adult is none of their business.",
            "I had pretty good parents who did their best to be \"fair\" between my brother and I. My brother was always the \"problem\" child though and was always getting in trouble for things I did and just didn't get caught doing. \n\nThe tides changed a bit when we were in high school. I skipped a lot of days but still managed to keep a high GPA. So when my brother got caught skipping his first time he immediately threw me under the bus. My parents called and got my attendance reports, realized what was going on... I didn't even have an opportunity to deny it. \n\nMy parents then changed the rule to an long as you have all A's then you can skip school as long as they knew where we were. They knew it was more important to keep communication open between their teenagers than punish us for something that we were likely going to do anyway and start keeping secrets in a time when kids need to be learning independence. They didn't want to be the parents who had no clue what their kids were doing and when. \n\nIMO you need to open up with your parents, essentially making the argument you made here, and that your brother tried and failed to make by using you as an example. Coming from you, the GC, might make them see how their rules aren't going to accomplish what they want. Call their bluff and tell them if they really feel like taking the car back they can, but point out that they should be striving to have healthy, happy, honest, and open adult children. That if they want to make other rules regarding weed, such as not bringing it in their house, that that is reasonable but what they're asking and expecting of the two of you is not. Hopefully, your parents will see the bigger picture in the sense of their long term relationship with their children and let this go.",
            "Tell your helicopter parents to fuck off. If they want their car back so bad they can drive out to pick it up. Let them know that if they go this route, you will no longer be maintaining any sort of relationship with them.",
            "*ahem* at the age of 18 they lost the ability to tell you to do anything and make you follow through. \n\nFuck them. \n\nThat is all.",
            "You tell them your 23 and to fuck off.",
            "It might be hard to see it this way, but I’d try to take the high ground, admit I smoke weed, and try to get them to change their punishment for your brother and build your relationship with him.\n\nSure, they can say what they want to him to an extent as he is under their roof... and it’s probably fair to have expectations. \n\nBut at least it will help to normalize it and your brother will feel you stuck up for him.",
            "This isn't about weed, its about control.   \n\nDo not let them control you.",
            "This is not a reasonable request from your parents... Unless they are supporting you financially or otherwise, in which case you might have to go along with it. If so, you might consider telling them, \"I am 23 years old and I don't think I have a choice about this, but do you really want to compromise our relationship for the rest of our lives for this? Because it will affect everything about our feelings toward each other, there's no way we can avoid that.\"",
            "Tellthem to bugger off you are 23 you are an adult not a child.",
            "Are your parents paying for your classes and your car? Sorry, but if your life is being funded by them, then yes, they are being fair and reasonable, more than fair since your mother will tell you ahead of time when you’ll be tested and you barely even smoke anyway.\n\nIf you are living on your own and paying your own way through school with very little help from mom and dad simply tell them that you are not reliant on their funding and refuse to take the test. \n\nI don’t think your parents sound very fair to your brother, he smoked weed he didn’t rob anyone. But in all honesty, if you’re attending classes on your parents’ dime it’s pretty ridiculous of you to think that you shouldn’t be subject to their petty stupid rules 🤷🏼‍♀️",
            "You have to call their bluff. Tell them that you have smoked, but don't take the test because it's insulting to be forced to do so. Tell them if they really want to take away your car for something so stupid, fine, you'll figure something else out. And mean it.\n\nMy parents held money over me as long as they could, and calling them on it was the only way to get out. Throughout all of high school, it was \"if you don't listen to us we won't pay for your college\". Then in college it was \"we'll stop paying for your college\".  I called their bluff a few times and did a lot of planning into how I could pay for things myself (even considered joining the military, ugh), but they always backpedaled and we'd reach a sort of intermediate compromise on whatever it was we were arguing about.\n\nThey'll continue to do this to you and your brother as long as they hold anything over you, and it's not okay. It's not healthy. And it doesn't stop. At age 30 I was visiting my sister after she gave birth and got into an argument with my parents about something dumb, and it turned into them threatening what they could (which wasn't much) but I called them on it and booked a flight home within hours. Now they walk on eggshells around me because they realize that getting to see me is a privilege and if they treat me like shit I will leave. Not the most healthy situation, but a hell of a lot better than them trying to force their adult daughter to conform to their wishes by holding money over her.",
            "You're an adult at 23. If youre not living with your parents tell them they can shove the test where the sun don't shine. If they tell you to give back the car then so be it. Start saving for your own car or use public transportation. I'd laugh right in their face if i was in your position and they told me I'd get drug tested because a little pissant brother tried ratting you out",
            "18 and 23... You are both adults. I would just reject taking a drug test. You are old enough to decide yourself what to do with drugs.",
            "How you going to random test a grown-ass woman that's a college graduate? I would not allow it at all even if they were paying every dime of my existence. It's just will have to fall as they may if you allow this they will try to control all aspects of your life and you are now officially grown.",
            "Your parents are major assholes for putting you through serious hardship (i.e. taking your car) over something your sibling did when you are at one of the most vulnerable points in your adult life. \n\nMy guess is that they probably need the car back for another reason and are just using your brother as an excuse to take it from you.",
            "You're an adult, tell them to fuck off.",
            "Just give the car back. Then they will have no hold to go through this silliness.",
            "So first off, are you from Oklahoma? This is a policy that has recently been enacted at the high school I went to. I personally believe the policy oversteps the constitution - the school should search students without legitiment cause. It leads to this sort of forced self-incrimination to the school, the community, and government agencies. Also if your brother was under 18 when he signed the consent form, he might have even more options. Tl;dr your brother should fucking sue. \n\nAnd your parents? You are well into being a legal adult. They have authority no here and you can tell them that. What’s fair is your brother never being drug tested at all.",
            "Well, you are 23, you are a legal adult and have every right to decline taking this drug text. Holy buckets, drug testing at school, is this even legal??? Be supportive of your brother.",
            "As over the top as your folks are being here you can't accept handouts from your parents but also expect to be completely autonomous from them. The only options are that you either do what they ask, or you get your own car and tell them you will not be submitting to a drug test",
            "Maybe try to take up for your brother. It kind of sounds like your parents are being shitty. Playing favorites, comparing the two of you, they sound like he is a scapegoat. And they didnt seem to be to concerned when they found out you smoked, your mom even giving you advance notice of the drug test??? They aren't being fair to either of you. It seems that they are adding to the wedge between you two. Maybe you guys should talk to your parents. The both of you ARE adults after all.",
            "Be careful claiming to be an adult while still living off of your parents to any extent. \n\n\nIf they're paying for your car, there's still a significant parent/child dynamic to the relationship.",
            "The icing on the cake here, if you can afford to do so—i.e. lose the car—would be just to tell them that you’re an adult, wouldn’t be taking a drug test to appease some sort of conservative ideological grade-school sibling “fairness” parenting tactic, and that they could have the car back if they cared so much about controlling your life.",
            "What do they expect you to do, ship them piss? Spend hundreds of dollars on a flight for you to come home and piss in a cup? They're acting like complete idiots.",
            "If they are paying for your car, they can have the same condition your brother faces.  It is equal treatment.  It doesnt sound like your brother used it with any different outcome than you.  I would tell them that you do indeed smoke from time to time, dont plan on stopping and will continue to do so.  Tell them they should respect that because it hasnt adversly affected you and they should respect your decision.  Mention that that same respect should be applied to your brother also who is a legal adult.",
            "I assuming you're brother's high school is a private school?",
            "i would tell them that because you are an adult living on your own and making a life for yourself that you don’t feel that it’s necessary for you to have to take a drug test. your brother is under different circumstances considering he is in high school, an athlete, and still living under your parents roof. plus as you said, it’s not showing any negative impact on your life in terms of school or work. \n\nworst case scenario they say no to you and you still have to take the test, but i feel like that won’t happen since they don’t seem to want to do that to you in the first place (since you’ll be getting a heads up and you can plan when you visit accordingly)",
            "You could try and get them to sign the car over to you so that its legally yours. Then tell them politely that they are over stepping you and your brothers legal rights since you are both adults and he is doing it legally as far as i can tell",
            "It's time to cut the apron strings.   You are legally an adult.",
            "What baffles me is these drug tests being thrown around. Those suckers aren't cheap!",
            "No freaking way. This is absurd.",
            "As a parent I think it’s ridiculous, reading over these experiences, that other parents use things as leverage over their already grown kids. This is NOT a healthy way for a parent to establish an adult relationship with their children. Yes, parents are people and can and should establish boundaries surrounding relationships with their adult kids (ie continuing to freely give money to a healthy adult who should be working is not a healthy boundary). But this situation, holding a car over the head of an adult who is successfully living and working independently is ridiculous. I agree with the others, give back that car and claim your right to independence. Shame on them.",
            "Lmao look at their ages",
            "Tell them that you are 23, and you won't submit to a drug test unless it's required by a doctor, school, or work.  Asking your 23 year old to take an at hime drug test for weed is ridiculous if you are not living in their home.  I could definitely understand if you or your brother were on harder substances and they were trying to keep you on the straight and narrow, but that's ridiculous.\n\nThen please turn around and tell your brother when you get time alone with him that while he might have to submit while he's living under their roof, should go to a college where he doesn't need to live with them, and do the same. \n\nI have sisters, and one of the big lessons my dad taught me is if they have a secret that isn't hurting them or someone else, you keep it, even from him.  My sisters will be around a lot longer after he is gone.  Try to repair the damage this might do to the relationship with your brother if you can, let him know there might be someone out there that thinks what your parents are doing is a bit over the top.",
            "Refuse the drug tests, and as your parents seem to respect and favour you maybe you could help your brother out? Yeah it sucked he told them about you, but you guys sound close and your parents are being pretty unreasonable. Maybe help argue his case than there is nothing wrong with smoking weed sometimes and you don’t agree with their actions.",
            "Doesn’t really matter if they are being reasonable or not. They own the car and can stipulate rules for you to use it. That’s their prerogative.",
            "If my parents had said that to me I’d have told them to come get their car and then expect not to hear from me for a few years. This kind of manipulation will continue unless you put your foot down. You are an adult working towards your own future and they are going to have to accept that. I’d also find a way to stick up for your brother on this as well maybe there is a chance for a deeper relationship with him because of this.",
            "Why not be honest and just tell them you've tried it, but it's not really your thing? I mean...yeah, it's shitty that they've got this power over you, but if they're supplying you with financial support, you're sort of beholden to their rules. They don't have to give you *anything.*",
            "Wow my school didn’t have a consent form for the students, they just made us all do it with no exception since we got into 6th grade.\n\nSorry, not helpful, but now I’m mad",
            "Your parents sound controlling and it sounds like you're a golden child. The only respectable move is to stand in defense of your brother and call them out on their bullshit. Your brother is probably going to need years of therapy to get over being a scapegoat and your parents are just ridiculous for trying to control their adult children.",
            "You're parents aren't being reasonable. You're 23 and don't live at home. Tell your parents you smoke and not to waste the money on drug tests. Being an adult comes with tough conversations and this may be one. \n\nIf your parents bought your car and pay for the insurance, it's 'justifiable' they can take it back...but depending on your finances, you could buy a used car to get out of the power grip they still want to have on your life.",
            "It isn't fair. I'm with the other people who say to return the car if possible- my first car was only $750 from eBay, so hopefully a small loan will cover affordable replacements for you.",
            "You're an adult and can refuse a drug test.",
            "> they want to be \"fair\"\n\nLife isn't fair.  And you are a 23 year old adult. \n\nOutright refuse, and tell them you won't be treated like an irresponsible child.  If they take away the car?  *Let them take away the car.*\n\nIf they are going to use material possessions against you, it's better to live without those possessions than permit a stranglehold on who you are.\n\nDon't negotiate with terrorists.",
            "I’d tell them to go fuck themselves. They don’t get to make you take drug tests. You’re fucking 23 years old and an independent adult. Your drug use, medical info, everything are none of their fucking business. Your brother’s drug use also has nothing to do with you. If they make you give the car back, so be it.",
            "That stinks. \nBut one point I read that I don’t like is that you have drug tests as a condition of your internship. Is it an internship in operating heavy equipment? Because other than physical safety issues, I don’t know why anyone has any business drug testing you. I realize this is a term of your internship, but this is so overreaching.",
            "Your parents are the ones that are high if they think this is even remotely appropriate. Tell them to go to hell.",
            "Nope they are being illogical and kind of a holes. They will take your car away I know it's theirs. That hurts you more in the long run than weed ever did. If your brother lives at home not much he can do but keep his head down till college then peace out. Try explaining your side be scientific use facts, I told my parents when I was 16, I presented them with valid points an research an a bit of guilt. I was able to smoke to replace all proscription pills that I hated taking.\n\nTell your parents, op, to relax take a it easy there's way worse things he could have been doing",
            "You're an adult and can say 'no' to anything you don't want to do. If the car is that much of a dealbreaker though (as in, you literally will lose your job and be unable to function without it, and unable to get one of your own), I would say go along with it for now. Make sure you pass the tests, toe the line, and keep your head down until you can afford your own car and are 100% out of their grasp.\n\nThat said, the 'easiest' thing to do isn't necessarily the 'right' thing to do. The right thing to do would be to refuse the test entirely, because you are an adult and you don't need to submit to anything your parents tell you to do. Them even threatening to take away the car is them trying to strongarm you into their plans, and they will continue to stomp on boundaries until you tell them 'no'. But if you go this route, be prepared to give the car back and buy one on your own.",
            "\"No\" is a complete sentence. You're 23. The idea that they would try and punish you is abusrd. \n\nAs for your brother, I think you need to explain that breaching your trust was wrong, but he was also a teenager who just got caught. He needs to apologize and understand it was wrong, but I'd cut him some slack.",
            "Tell em (politely) to go suck an egg. You’re an adult, you live on your own in another state, they shouldn’t have to dictate that kind of thing to you. The only issue is if the car technically belongs to them and they ask for it back.\nAnd you might counter that with how lack of reliable transportation will affect your (promising) future. \nAlso it was really shitty of your brother to rat on you. :( I’m sorry that happened",
            "Drug test a 23 year old?!  LOL!\n\nYeah...no.",
            "23 and 18 still letting mommy and daddy control your lives.  Lol.",
            "Why are high schools making kids submit to random drug tests?",
            "\"You appear to have forgotten that I am an adult, no longer subject to your parenting or house rules, and deserving of respect. If preserving my integrity and privacy come at the cost of losing access to the car you have until now generously allowed me to use, then this is a price I will gladly pay. Furthermore, I deeply resent your use of me and my accomplishments in your attempts shame and control my brother. As can clearly be seen here, this only results in you driving a wedge between me and my brother, compelling him to try to diminish me in your eyes, to make himself look better by comparison.\"\n\nAnd then, no matter what their answer is, \"For your information, I am already subject to random drug testing as part of the conditions of my internship, so the taking of one more test would actually be of very little practical consequence to me.\"\n\nFollowed either by \"The consequences of my own parents, trying to continue to control me and my life as an adult, are, however, huge to me. Going forward, the only topic I want to have any further contact with you about is the subject of the return of your car. Once returned, I ask you to please consider your words and actions, and not to contact me again until you are prepared to provide an apology not only to me, for trying to meddle in my life, but also to my brother, for your attempts to ruin his relationship with me.\" if they don't back off and apologize.\n\nAlternatively, \"Having to subject myself to such intrusive probing into my life by my parents, however, would have been deeply troubling to me. Yes, I am a young adult who can still benefit from her parent's help and support, but as an adult, moreso from her parent's respect, and I am glad that you have realized this. I urge you to try to extend similar respect to my brother, because I do not believe that infantilizing him is going to do either him, nor your relationship with him, any favors.\" if they realize that what they were trying to do is deeply offensive to you as their adult child.",
            "I could just see them freaking out, \"honey grab me an ambien! I cant believe our son is a drug addict! Omg i need a glass of wine to settle down!\".\n On the real though, tell them to kick rocks, you are an adult who hopefully takes care of themself. Now ,if you are driving a car THEY bought you and spending THEIR money still...then you might be in some trouble lol that is why i'd been working and buying my own belongings since high school, parents try to take away my phone or car? Nope! You didn't pay a dime on either, so you have no right.",
            "I mean, they are allowed to have contingencies on the car.  I'd offer to return the car, but tell them they will NOT be drug testing you. You are an adult and will make your own decisions. They may back track and allow you to keep it, as this is likely just to make bro abide. \n\nIf you want to keep the car, I would highly recommend abiding by their request to stop drugs, even if you dont have to. Its just my moral compass would point that direction. You're doing me this huge favor, the least I can do is temporarily halt my drug use.  That doesn't mean they get to test me (or my brother) like some common criminal, especially if it's a legal activity. When he's living under their roof, I'd expect some level of mutual respect, but it seems a little far gone to expect that from their relationship with bro.",
            "\\>  I feel like my parents aren't respecting my decisions and privacy as an adult. ... The only thing that still ties me to my parents is that they own the car I drive.\n\nIt's pretty simple. You are correct that they are not respecting you as an adult.\n\nBut they have the right to put a condition on letting them use their car. It's not fair, but it is still their car.\n\nYou just have to weigh the benefit of the car use against not being treated as an adult.\n\nWhich is more important to you?",
            "Tell them to come back with a warrant",
            "you’re not living with them and you are over 21, they have no reason to",
            "Chances are that car is their insurance policy to stay in contact with you. It's their security blanket for still getting to have a part in your life, whatever their relationship with you. My guess is if you are kind to them, and explain that you aren't going to participate in any drug tests, you know, because you're Twenty-Fucking-Three, they won't take the car away.",
            "I wouldn’t submit a drug test because fuck off but I would come clean. My sister threw me under the bus when she got busted for seriously hard drugs to my grandparents and I came clean and used my responsible life as proof I’m ok. When I was 17 my mom went through my purse and came to me all concerned, mad and and worried that she found a pipe and some weed in my purse. I said “mom yeah I smoke weed, I also have a job and make my car payment and attend school. And mom if you’re going to snoop through my shit you’re going to find things you don’t like so I suggest you stop” and she left me alone. I even got her to smoke weed with me some time after that. She’s a boomer who never smoked it before and I was like huh? You have to at least try it. So I suggest you stand up to them. One it will hopefully end their judgement over cannabis. Use the fact that you’re a very capable adult. Bring up that today high school and college students are under more stress than ever. It’s not like either of you are popping pills or shooting heroine. Weed is vastly less dangerous than alcohol. I refuse to hide my way of life and it’s been so much easier. From the 90s-now all my family has embraced the products I make from cannabis even my Ex cop Dad. Since I’m successful and one of the most stable members of my family, no one can say shit!",
            "Give them the car back.  Find a solution that allows your autonomy.  You're not a child any longer and if they want to hold the car over you, give it back.  It'll mean no visits home, but they are choosing to be histrionic.",
            "You’re 23 and living in another state. Why are you even considering this as an option?! Tell them no.",
            "You´re an adult, not only legally, but you have also moved away and is living your own life. Your parents are in no position to tell you what you can or cannot do, and they certainly can´t require you to take any drug tests. Tell them politely to respect your privacy as an adult, or you will have to cut them out of your life.",
            "Cant believe \"weed\" is an issue in some families still.",
            "I think it should be a good time to give up weed if you're not addicted to it already.   It may be legal in a few states, but it's still illegal in most.   You can still go to prison for possession.  In addition, many employers drug test and will fire you if you are caught.  Weed will do nothing good for your future; it's time to stop smoking it.",
            "23 and they still act like you’re a child? I think that the signoff was completed when you turned 18. What you do at 23 is your business, not theirs.",
            "You can say something to them but if you’re already going to take a break and can hold off going home, I would just do it when I knew I was clear and keep the car. It wouldn’t be worth fighting for in my opinion as it is something that could happen to me as well. So that’s your call. It’s definitely unfair and ridiculous but I like not paying for my car.",
            "Be honest. Honestly the best thing you can do is say \"yes I smoke weed, but look at what I have achieved.\" They may not like the answer you have given them, but at least you're giving your parents respect and keeping your own dignity by not having to pee in a cup. \n\n\nJust my opinion.",
            "Lol they can’t drug test either of you. He’s 18 and you’re 23. Tell them to fuck off",
            "I’ll never understand parents threatening to revoke thing such as one’s car or college over something like this.\n\nIt’s always over weed too. \n\n“Oh, you’re smoking a harmless plant that will have next to zero impact on your ability to be a succesful human being? Lemme just yoink your education to push you in the direction of what our conservative ass minds percieve the life of a DrUg UsEr’s life would be.”",
            "I think it's worth highlighting to your parents how much losing the car would affect your ability to thrive as you have been. As said by other posters I would let them know that you have smoked a few times but it's not a habit and it obviously has not affected your trajectory.\n\nI'm regards to the testing, I would instead offer, as the Golden child, to have a conversation with your brother about it (if you're willing to) to ease their worry and position this as an alternative to testing.",
            "Hell no. I'd tell them Im not doing any tests, theyre overreacting to the most normal teenage behavior on planet earth, and if they want the car, they can come get it. No one has any power over you in this situation and they are overreacting to a major degree.",
            "Idk, I feel like I’m in the minority but I think you should just do it so you can hold onto their car. Sometimes you have to give up pride for a good opportunity.",
            "It’s their car.. so their rules, you don’t want to take a test, get ready to take bus .. it’s not like you are a regular smoker. Don’t see a big deal taking the test to keep them happy.. having a car is really useful when in school.. small compromise imho",
            "It's pretty fucking unreasonable. I get why they're against it, but you don't live under their roof, and there are worse *legal* substances anyway. John, on the other hand, is in a high school that doesn't tolerate it, while living in a house that doesn't tolerate it. And even then, they've overreacted to some degree, as, again, worse legal substances anyway.\n\n&#x200B;\n\nYou should tell your parents before you go visit them that you are definitely *not* taking a drug test over this.",
            "Your parents sound like total assholes. \n\n>  right after this situation went down, I was very clear with my parents that I have smoked and I thought they were overreacting. I defended my brothers actions and tried to educate them about marijuana. \n\nSo what's the point of testing you if they know you smoke? They've being weird. You could stop smoking long enough to pass their test but that's kind of shitty to your brother. You smoke, he smokes, and you have time to get away with it. So did he, I guess, but if you get off scot-free, it sends a message that you're the \"better\" child, so your parents will get to justify their double standards and shitty treatment of him, and it will make him feel like shit. It also enables your parents to have zero fucking boundaries and drug test their adult child.\n\nMy advice? Give them back the car. Get a job and save up to buy your own car. Don't let them use that as power over you. I know having a free car is convenient but if you do that you let them use that as a bargaining chip. And at this point I'd value my relationship with my brother over my relationship with them. Especially if you're aware you're treated like the \"golden child.\" Your brother shouldn't have ratted you out, but I can kind of understand his anger, getting punished for something you do too.\n\nBuy a beater car for a couple thousand and send a message to your parents that the shitty double standard and unfair treatment need to stop, and that you're an adult entitled to privacy. People like this will never stop being shitty as long as they have bargaining chips they can use to control others. Take that away from them.\n\nI will say that your parents are within their rights to ban him from smoking in their house/if he's gonna live in their house. Sucks, but that's how it goes when you live with your parents. But the rest of it -- including drug testing their adult daughter who lives out of state -- is fucking ridiculous. I'm also a proponent of paying for your own eduction (especially when you have shitty parents who lord this type of thing over you — mine didn't, but I am proud that I worked my ass off and paid my own way) but threatening to take college off the table over a little weed is fucking stupid. If I were him I'd ride it out, play by their rules and work to GTFO of there as soon as possible.",
            "I'm a 53 yo father of 2 teenagers, 16 and 18. I used to smoke a lot a very long time ago, before grad school.  Weed is legal in my state.\n\nFirst, your brother getting in trouble with his HS is enough. Your parents shouldn't be piling on him.  He's an adult, so they legally have no say in what he does. His school does because he goes there, and the state does depending on the law there which is 21+ or totally illegal. They can, however, take away his car if they pay for it, kick him out if their house, refuse to pay for his college.\n\nThey have no rights over you at all except that they can take your car. Personally, since you don't plan on smoking for a while, I'd firmly tell them that you need the car, so you will take the drug tests, but they are seriously infringing on your rights  as an adult and if they take action in any way against you for a positive test, they will suffer severe consequences. If they do, for example, take your car for a positive test or just telling them this, I'd walk, and cut them out of your life for a few years. You don't need that crap.\n\nBest of luck!",
            "If you live with them it’s kind of their decision.",
            "You can and should refuse to take a test as an adult. As an adult, that also means you can support yourself so be ready to return the car. If you and your brother are at different life stages that should be the difference - you can stand up for your choices because you’re living as an independent adult.",
            "Tell them you'll do it only if they do as well... In the name of being \"fair\". \n\nIf they follow through be sure to light up a fattie right in front of them first.\n\nGet used to taking public transit like the rest of us plebs.",
            "Your parents have absolutely no right to drug test their self supporting adult child. Period.",
            "Tell your parents to fuck off and give them back the car.",
            "Same thing happened to me and i had to return the car to my parents, bought myself a moped instead!! But at the end of the day if the car is more important to you then pot then agree to the tests since you know exactly when they will be",
            "If your financially reliant on them, you play by their rules. If not, just say no.",
            "wait do you live with them? If you don't live with them this isn't an issue. And if theyre going to be a control freak over you choosing to smoke weed, I think it's time for you to move out. I smoke weed literally all the time right when I wake up as well. Actually vape. but the point is my dad hates weed and he thinks it's terrible but I live on my own and I live apart from him so he will occasionally mention to me studies that show marijuana is bad but I just say okay. if you're living in their house, they do have leverage. You should respect their rules at their house or at least hide it. but it's a little bit overboard to say I expect to live at their house and have them be okay with me smoking weed. It is okay to say I can do whatever the hell I want mom and dad I don't live with you",
            "I'd say the adult thing to do is to explain to them that you don't want to submit to drug testing because you feel it encroaches your personal integrity. From what I gather they haven't used the car as leverage and they don't seem to want you to have to test. Best case scenario they feel like they have top ask you too for your brother's sake but if you clearly and respectfully say no they might simply leave it at that and be able to tell your brother that they tried. A clear \"No, I don't want to\" can be surprisingly useful. \nM2c",
            "You're 23. They aren't your boss any more. Tell them to fuck off.",
            "Wow lame move by the little bro but somewhat understandable if he was trying to defuse the folks by telling them you’ve smoke “cannabis” before as means to ease foreseeable punishments (which if the folks are going to be  drug testing him for weed  now and being this anal about it, then he might just need to move out of their domain to be free...)\n \nWhat they want from you, in the name of fairness (lol) isn’t really fair or worst. So Just give the car back and tell the folks that as an adult your entitled to whatever you want and so that will be the end of this discussion. Might help the bro to get out as well if he can.",
            "\"Mom, Dad, I'm a grown ass woman in graduate school with a job on the side. I don't have time for this shit. Parent John however you want, but leave me out of it. I'd love to talk but I got a ton of stuff to do. Bye.\"\n\nThat's how I'd do it if I were in your shoes.",
            "No, they aren't being reasonable.   And you've been an adult for five years. \n\n>  I feel like my parents aren't respecting my decisions and privacy as an adult.\n\nThe car is the one thing that makes them able to treat you like a child.  Tell them you're an adult and won't be monitored or subject to tests as though you are a child or a prisoner, and tell them if those are strings that come with the car that they can have it back.",
            "You’re 23. End of story.",
            "If you depend on your parent's support,  in the same way you depend on your employer for the paycheck, on your school for the diploma, then follow their rules or risk the relation being terminated, unless the said support is legally mandated.\n\nIf you only have a problem when your parents want something from you, while complying every rule by the school and employer no matter what, then it only shows that you are rejecting control selectively. It's probably unwise on your parents' part to continue their support and accept the discriminatory treatment, provided, of course, that they don't believe that they have a dependency on you.",
            "Tell them it isn't 1965, and that they can respectfully grow the fuck up. You're 23 and you're smoking weed... you're not shooting up heroine.\n\n&#x200B;\n\nThe fact that you are 23-years-old and they are threatening to take away your car shows that you have never really proven to them you are your own adult. I guessing from the Golden Child dynamic you explained in the post that you have been the suck up child through life so far... Grow a pair and tell your parents no for once.",
            "When I was in graduate school, my parents weren't paying for my schooling or living expenses, but they did give me a car to use. They asked me to do something I didn't want to do and suggested I \"owed\" them because of the car. I did what they asked. The second time they mentioned the care to 'motivate' me to do what they wanted, I drove the car to their house, thanked them very much for the use of it, and said I didn't need it anymore.\n\nIt's extremely nice that your parents have provided a car to you. But apparently they think you're not an adult yet. They only way to be fully independent from them is to become financially independent.\n\nBut I don't think you'd be doing the wrong thing if you took the drug test and kept the car. You just have to decide what level of independence is right for you.",
            "Your parents are pretty dumb and also pretty shitty and the sooner you can reduce their presence in your lives to once or twice a year the better you and your brother will be.",
            "Your not a kid and your an adult, tell them no. If they get upset then boo hoo",
            "How about:\n\nYou just take the drug test. It's not for you or your parents. it's for your brother. Nobody is arguing that weed is going to cause your brother to fall into a world of drug use, obviously. But he's still young, too young to be doing that stuff.\n\nAnd this is coming from someone who is of similar age to you, and also smokes pretty infrequently.\n\nIf you're already planning not to smoke, I say you take the drug test for your brother. And have a word with him after and teach him about going to school (college) and managing recreational marijuana use aswell",
            "I think it'd be a good choice to stop smoking in solidarity with your brother. I'd make very clear what your motivation is, to both your brother and your parents and that is that he has a problem and you want to help him overcome that problem. I think the moral point here is not whether you are in the right or in the wrong. I think the moral statement here is that your brother has a problem that jeopardizes his future. You not smoking, shows him that you are in control of this habit and that is what makes the difference between relaxation and having an actual problem. \n\n&#x200B;\n\nI think everyone in this whole story (both your parents and you) are missing out on what this is about. Your brother might be 18, that in no way equals being an adult though. He needs help, not rules, to overcome his issue. Instead of negotiating on your behalf, communicate that them drawing a line and creating rules doesn't help the problem, but makes your brother feel more incompetent."
        ]
    },
    {
        "post_id": "1cdk1ae",
        "author": "Soft-Comment-5711",
        "title": "UPDATE: My husband turned 40 and suddenly became the man I married again",
        "url": "https://www.reddit.com/r/relationships/comments/1cdk1ae/update_my_husband_turned_40_and_suddenly_became/",
        "score": 2586,
        "num_comments": 132,
        "created_utc": 1714134256.0,
        "selftext": "I wanted to give an update on my post from a few days ago since everyone who commented was so helpful.  \nI talked to my husband and asked him if he was taking testosterone as many of the commenters thought he was. He said no and was curious why I asked. So we talked a bit and I really pressed him hard on what was going through his mind a year ago to make him change so much and I was able to tease 2 things out of him.\n\nThe first was an incident at work. It happened about six months before he made his transformation and I knew about it at the time because he told me. He didn’t make a really big deal about it and barely mentioned it after telling me so I just forgot it even happened until he mentioned it.\n\n  \nMy husband is a VP of Finance at a rather large private company and two members of his staff were engaging in an affair. The woman involved in the affair was married and about my age and her husband had started to call the office. So it became a thing he had to deal with since he was their boss. He told me at the time but I guess this saga dragged on for some months and when the woman in question began to open up to others in the office regarding the reason she had the affair, some of those reasons hit home for my husband. Her husband was behaving much like he was. So he said that isn’t going to be me and set out to fix it.\n\n  \nThe second thing I teased out of him is that he quit watching porn. Now I do want to say that I don’t care that he watched porn, I do myself on occasion. But when he watched it and obviously finished himself afterward, it drained any desire he had for me. I guess he started when the kids were really young and I was just exhausted all the time and he just kept it up because it was easy. He quit because to fix our marriage he had to get that desire back for me. So he did it.  \nSo after this conversation a lot of things make sense. I also understand why he didn’t want to tell me. He didn’t want me to think that the possibility that I could cheat had entered his mind. And the porn is sort of self explanatory.\n\n  \nORIGINAL POST:  \n[https://www.reddit.com/r/relationships/comments/1cbk3cf/my\\_husband\\_turned\\_40\\_and\\_suddenly\\_became\\_the\\_man/](https://www.reddit.com/r/relationships/comments/1cbk3cf/my_husband_turned_40_and_suddenly_became_the_man/)  \nHi, I’m new here. I create this account because something happened to my husband about a year ago and I don’t know what to make of it.  \nMy husband has always been a good man, and he’s a wonderful father. He also has a great career and very driven to succeed. But after the kids were born his passion for me had waned. He was once very affectionate and flirty and he couldn’t keep his hands off me. We had date nights and would take weekend trips filled with kissing, hand holding and a lot of sex. But after the kids all of that began to fade and it continued to the point that I felt like we were roommates. I kept myself in shape for him and initiated sex often. He would never turn me down but it was lazy. It was basically get off quick and go to sleep. So after a while I just stopped imitating.  \nThis continued for years and I had just grown used to it. I still loved him, I had no desire to cheat or divorce. I just figured this is what happens after kids and I’ll just deal with it.  \nThen, about a year ago he got a babysitter and asked me if I wanted to go away for the weekend just the two of us. I was shocked but agreed. And the entire weekend he was affectionate and flirty and just fun. He hadn’t acted this way in years. He was a completely different guy and that included in the bedroom too. This may be TMI but my husband hadn’t performed oral sex on me in 10 years and every time he had before he was kind of terrible at it. But while we were away he just did it without asking and he was amazing at it.  \nThis new attitude continued when we got home and a few months after that I started to notice that he had lost weight. Shortly after that he started to look more toned as well. He had gotten a dad bod but now he looked better than when we got married. I won’t lie, I had difficulty keeping my hands off him.  \nHe’s basically become the perfect husband overnight, I don’t know what happened. He says he just wanted to be a better husband but there was no event that triggered it outside of turning 40. Could that be it?\n\nI’ve read that middle aged men sometimes get in shape because they are looking to cheat. But that’s not the case. He’s never cheated or had any desire too. We have lifestyle 360 for the kids and I see where he is. It’s work and home. I also see all his texts since we share an iPad.  \nSo I’m kind of stumped.  \nTLDR: My husband suddenly became a perfect husband and I don’t know why",
        "permalink": "/r/relationships/comments/1cdk1ae/update_my_husband_turned_40_and_suddenly_became/",
        "comments": [
            "Amidst all the negativity here, I'm glad for the positive ones such as this!\n\nAlso a wake up call to anyone with a relationship out there.",
            "Wow, that takes some pretty uncomfortable self-reflection to recognize your own faults in other people’s actions. I hope you two continue to build back a strong, loving relationship. :)",
            "Damn, this was a great update. Wish you both all the best!",
            "Awww that’s actually kinda wholesome. Best wishes for y’all to have continued happiness together.",
            "Best update I’ve seen so far.",
            "This is lovely and wholesome. Enjoy it!  ",
            "What a great update! I do remember in the comments on your original post you were adamant that he wasn't cheating and I felt like you were probably right about that. I get why people suggest it a lot -- it's the case a lot -- but I also know so many couples where something is up and you just know it's not *that*. Like a friend was having issues with her husband's sisters and one of them told her she'd seen his profile on Tinder -- no one who knew him believed it. To the degree that we all burst out laughing. When was he Tindering? Between his job, childcare and World of Warcraft -- when? Plus, his phone was so old it wouldn't support the app. Some guys aren't cheating and you just *know* it. \n\nAnyway. So glad you talked about it. Congrats on your renewed marriage. Congrats on having a husband who took some initiative to improve your life together. Congrats to him on his self-awareness and forethought and emotional intelligence. Congrats to you for noticing and appreciating and acknowledging the change. I wish you guys the best.",
            "It's refreshing to see an update with a possitive outcome.\n\nYou two have fun!",
            "In theory I don't have a problem with porn. But I know that when I watch it too frequently, I don't have enough desire for my boyfriend. I'd rather desire my boyfriend than watch porn, it doesn't feel right otherwise.",
            "I'm so glad to hear that you two talked about this. I'm also glad you drowned out the assumptions people were making about your husband in the original thread you made.",
            "My husband recently had the same thing! His friend is going through a divorce after his wife hit her limit. He recognised some of the behaviours of his friend in himself and chose to change.",
            "This was never a trust issue, but one of Love:  He never would believe that *you* would cheat yourself, but that you would feel the misery that led your husband’s co-worker to cheat.  He loves you enough to recognize that and change for your sake.",
            "You are very lucky to have such a man. Hope both of you together forever.",
            "I was very curious about this. I knew there must have been an 'inciting incident', like in the movies where something happens that moves the plot forward and changes the character's lives...but I couldn't imagine what it could be, there were so many possibilities, and I didn't want to speculate. \n\nThank you so much for updating. This adds to my understanding of people and relationships, which is what I'm on this sub for. 💚",
            "I am saving this one for the next person who needs a positive example of men.\n\nI am glad that he acted like a grown up and reflected.",
            "It's kind of funny to me that, in a way infidelity WAS still part of the reason, just not the way everyone was assuming",
            "Wholesome and educational. Your husband is helping to pay it forward to many other men with their head in the sand even if he doesn't know it. \n\nThank you",
            "I love this. We stan a self-reflecting king!!",
            "Marriage is a beautiful thing, you guys are a testament of that. I hope in the future, should you couple encounter any problems, you are also willing to change for him the way he changed for you. Happy weekend here from Australia",
            "I'm happy for you but I'm sad for me because I like drama.",
            "Congratulations!\n\nYou have yourself a keeper!  One who wants YOU to be happy and is willing to do the work to keep you happy.",
            "Conclusion from a 19yr old kid:\nW husband. Here's to hoping this bliss that's getting a respark gets to continue forever more!\n\nEdit: for a man to really change to keep his woman to stay really needs dedication unless the woman he loves is his motivation. Granted it's understandable how he would feel for not telling you upright, all this reflection in him and your relationship really is touching. All to hope now is that this love rekindled may be maintained well! All the best!",
            "It is so nice to hear a success story, especially when one comes to the realization that they need to work on themselves to fix things. Hope you guys have a wonderful life.",
            "This is the kind of fan fic I can get behind.",
            "Well this was probably the best way this situation could have ended. What a good guy.",
            "What a great W, happy for you OP! I was one of the minority who didn’t just assume your husband was cheating in the last post! Wish you guys all the best!",
            "Whoa, I needed this today. I’ve been feeling particularly sick of male toxicity but so good to be reminded of the good ones.",
            "I wish a long, happy life together for the two of you 🩷",
            ">I guess he started when the kids were really young and I was just exhausted all the time and he just kept it up because it was easy. \n\nNot directed at you OP...just speaking generally.  But this is something women dont think about regarding men.  If we get told no enough we will just mentally give up.  So thats one part.\n\nAlso the other part is that its difficult for some men is that what was their sexy hot girlfriend/wife who'd they'd have raunchy hot sex with is now suddenly the amazing angelic mother of my children who we cant imagine doing dirty nasty things to anymore.  The classic madonna/wh*re complex.  Its a real thing. Unfortunately for men love can enhance sex...but it doesn't drive our sex drive.\n\nSo the combination of getting told no on top of seeing your wife wonderfully baby and nurse your child doesn't fire up the dirty mind sex drive to do all the shit you'd do before.",
            "Thanks for sharing OP! It's really heartwarming to hear good news that comes out of relationships!",
            "Great Update! Glad it worked out",
            "Someone who recognized a problem, fixed it, and didn't make it an issue for the other person.  Wow, he sounds great, is he single?  😂😁",
            "Your story inspired me to be a better husband ✌️",
            "This is the best update I have ever seen in here.",
            "well im glad that someone elses affair served a valuable purpose somebody...it's crazy sometimes how hard it is for people to understand how damaging their attitudes or behaviors are until they view it from the outside looking in.",
            "Good for you both.   You know i think if More married men read there posts on here i think many might have the same epiphany. Women too!  It seems to be so easy to get completely complacent upon never really learning how to communicate to begin with.",
            "Jeeze you have a good man!",
            "So nice to read a positive update! All the best to you and your family OP!",
            "What a wonderful update ✌️",
            "Respect....\nYour husband was proactive and took action by learning from mistakes of others.",
            "Yay! Happy update! :D",
            "Your guys won the game of life. Congrats.",
            "Glad this worked out. If your partner loves you, they will want to fix the problem instead of defending it.",
            "Wow great update very interesting reason",
            "dude this is awesome :)",
            "Phew! I thought he was cheating. Glad this is how it turned out!",
            "That's awesome, I'm so glad you and your husband were able to communicate and he was able to make that change within himself. May your marriage be more blessed and beautiful every day!",
            "Sounds like he just had an epiphany 😂",
            "Tons of women think the best man starts at 50.",
            "Your husband sounds like an awesome guy. I’m happy for yall that pretty much on his own he wanted to do better for you guys and that’s so beautiful 🥲🩷🩷🩷",
            "Alright, I’m jealous.",
            "Such a great update! Happy for both of you 🩷",
            "Great update, I loved to read it.",
            "Awesome to hear OP! Happy for you and your husband.",
            "Learning from other’s mistakes is a good quality IMO, glad your husband’s coworkers’ affair worked out for you OP",
            "Awesome! This entire post is just awesome! Y'all really love each other, and for him to identify those events for what they were and change himself is... Just good on you both!",
            "Your husband is a smart man! Better to think about things now instead of dealing with it later!",
            "Thanks for sharing this with us. It's good to read with a happy ending.",
            "Thank you so much for the update. I read your original post at the time and really felt it was from a good place the reason why your husband sought to change. It's given your marriage a second wind certainly, cherish and run with it!",
            "So, not surprisingly: My husband stopped watching porn and started putting that attention and sexual energy back on to me (after having an epiphany that he had been neglecting you in that department for years for porn). Porn is and always will be problematic to some degree.",
            "Such a great update. Super glad his changes didn't come from nowhere.",
            "Damn so thats the attitude of a successful man. He knows if there’s something may go wrong, and he attempts to fix it immediately, with strong discipline. \n\nLesson learnt.",
            "It's amazing to hear that your husband made such a positive transformation! It sounds like he really took your relationship to heart and made a conscious effort to improve. It's great that you were able to have an open and honest conversation about it. Wishing you both continued happiness and love in your marriage!",
            "Thanks for the awesome update!",
            "That's a very rare(Good and Healthy) Midlife crisis for the Husband. I hope your relationship will keep of getting better as both of you grow older.",
            "Can I just say that whilst it’s wonderful that your husband has turned things around and fixed any underlying issues he has, I’d also like to say that you sound like an amazing wife. There’s lots of sections on here where (mostly) men discuss the issues you were experiencing where their wife has no interest in them any more. It hurts and it’s horrible and it makes you feel utterly worthless and even dirty for trying something with someone who constantly rejects you when they are supposed to love you (especially when they weren’t always like that)\n\nI’m so pleased for you that things have sorted out and that you now have the relationship you deserved. It’s lovely to hear ",
            "So happy for you and your husband.  My wife and I went through something similar around the time I turned 40.  It is unfortunate that it took your husband and I so many years and a wake-up moment to finally make some big changes.  It seems like 40 is around when many people finally have the time/energy for true introspection and change (after young kids and early career demands).  Not many are fortunate enough to have a partner who can remain patient and committed through the more challenging years.  I am sure he really treasures you and your relationship.  \n\nMy wife is a bit worried that we might slip back into old patterns at some point.  I hope you realize that the change in outlook your husband has gone through is not something that he will un-learn.  Porn can be an addiction, so there is danger of slip-ups on that part.  However, having you fully aware and available to help him avoid issues should be a game changer for him.  My wife never had issues with porn/masturbation in general.  She will still say things like she would never tell me to stop relieving myself.  However, that is exactly what I need/want from her.  I have made a decision to reserve my energy for her and our relationship and appreciate her support in helping me follow through on those commitments.  \n\nThose who have issues with porn addiction tend to have addictive tendencies in general.  Making sure there is a relatively healthy outlet is important.  My latest is commenting on reddit posts.",
            "I love this story so much. Reddit totally click-baited me into even seeing it because I don't follow this sub. Usually irks me that they can so easily manipulate me into clicking lol. But this one makes my heart smile. Thanks for sharing and best to you and your husband. ",
            "This resonates.  I am 61, married to an amazing woman.  We both have had high stakes jobs for years.  In my very early 40s I went with her to a function at the hospital she worked at.  I didn’t know many people there so I spent a lot of time people watching.  So many great looking people, very social, having a great time & here I was , 30 lbs overweight just feeling kind of invisible.  \nIt wasn’t immediate, but that was the beginning of what became a “transformation” of sorts.  The first thing I did was apologize to my wife for not paying enough attention to her, and letting myself go.  I also quit porn altogether.  I wasn’t deep into it, but it hurt my wife deeply when she found out I was viewing it occasionally because she felt she wasn’t enough for me.\nI started a fitness routine, lost some weight and generally felt better \nThe fitness aspect of all of this had such a positive impact on my mental health that I can’t imagine not working out.\nThis was a gradual “transformation “ but it saved my life and it saved my marriage (although she has told me since the day we married that I could never get rid of her).\nIt’s possible, you can change and have a long, happy and fulfilling marriage.  \nOP, your husband is committed.  I love this.  I chuckle at some of the comments about how he learned new skills, if you are committed, you figure it out.  \nBest of luck to you.",
            "Legit wondering when the sex tape drops LOL",
            "Hi there, amazing update. Love it. May I ask what he saw the husband doing that made him change? Like what behaviours were similar to your husbands?",
            "It takes a whole lot for a man to change his ways and you really embraced that change. He liked the attention it got him too. Porn is a relationship killer and can really do damage too. I understand people watch it but in a marriage your focus should be your partner. Your really fantasizing with another person and it can really damage your relationship in the attraction department as this did for him. Honesty is best and I am glad you two can have honest communication with one another. Sound like also your husband is very private about how he works on himself and does not tout about it. These are great characteristics as a man know you got a good one. Good luck moving forward and happy bliss!",
            "Im scared to say that im actually heartened and happy for them, not wanting to jinx it and not wanting to encounter any Reddit shoes dropping.\n🙏🏼❤️🏆💪🏼",
            "I still say couples counseling wouldn't hurt as you both lack in communication. Will also be good at teaching you both tools in all aspects of your marriage.",
            "Gutting, wanted some drama.",
            "*didnt read*\n\nHell yeah!!! Get that man some beers! He’s your husband, I’m sure he was battling something. And now he’s back to normal! Take the W!",
            "As a former side chick who hears mens confessions that they can never tell their wife-  *he’s still lying*",
            "Thank you for sharing! Porn is a huge intimacy killer! ",
            "So how is he \"fitter\" all of the sudden, where did he learn oral sex from.",
            "Glad things worked out. Im just curious what happened with the married woman at his work. Hopefully she got served with divorce papers?",
            "Well...\n\nSo your husband covered for the emplyees whe were / is having an affair??  \n\nHe lied to the womans husband??  Was complicit in her betrayal of her husband??\n\nAnd you have no problem with this, OP???",
            "boooo!!! no drama??? kidding..wishing you both the best :)",
            "I quit because the kids were young and I was exhausted. \n\nHe had to quit to get desire back for me.\n\nSounds like a problem you created and let continue. Kinda sad that he has to fix your problem and your knee jerk reaction was to think he was up to something. What have you done? Let him? Do better"
        ]
    },
    {
        "post_id": "9uugfu",
        "author": "kaypond",
        "title": "Update: My [19F] boyfriend [20M] regularly does things he would be furious at me for, like hanging out with the opposite sex and more",
        "url": "https://www.reddit.com/r/relationships/comments/9uugfu/update_my_19f_boyfriend_20m_regularly_does_things/",
        "score": 2587,
        "num_comments": 226,
        "created_utc": 1541552347.0,
        "selftext": "Second time trying to post this cuz automod removed it for not having an original post link but it did. \n\n[Original post](https://www.reddit.com/r/relationships/comments/8x63sx/my_19f_boyfriend_20m_regularly_does_things_he/?_branch_match_id=509169239196061035) \n\n\nI appreciated the responses from everyone who commented. I don't really want to make this update but since you guys made the time to comment, I guess you deserve an update. After the post a few months ago, he had read all of the comments and begged me not to leave him. He apologized and swore he would change. He didn't.\n\nWhen I made that post, I did not expect the comments to be unanimous in saying that he was abusive. And I slowly came around to that idea. Some of those comments were a huge wake up call for me, and I started realizing just how horrible I had been treated the entire relationship. Apologizing profusely for unwanted attention from men, swearing I would never be nice to them or even talk to them again, reassuring him that my outfit wasn't revealing. It was my first relationship and I just didn't know how abusive all of this was. I don't want to be with someone who controls and micromanages my social media, dictates what I wear and my hairstyles, accuses me of being unfaithful or doing slutty things for men, tells me \"I'm not going to have sex with you after we break up if you start adding other guys\", constantly lies about his feelings for women in his life, and much much more.\n\n2 nights ago he was bothering me because he wasn't responding to a question I'd asked him, and it was the straw that broke the camel's back. I broke up with him. We broke up via text because he always refused to meet me in person when I wanted to break up. I guess he thought if he refused to meet me in person to say goodbye then I would wait to break up with him, and he was right because it did deter me a few times (we live an hour away). But this time I knew he would be immature and not want to meet with me so I just had to message it to him which sucks, because it feels really awful to end a year and 4 months relationship via text.\n\nAll he had to do was try. The sad thing is, I know he wants to change and he wants to be with me, but he just can't bring himself to treat me right. No matter how trustworthy I was to him, he only ever saw me as the kind of girl who would run off with another guy the second she had a chance, a girl who loves male attention. No matter how much i was there for him and I tried everything to motivate him and comfort him through his struggles, he just couldn't force himself not to act in a way that he knew was wrong. Which was extreme jealousy, disrespect towards me, lying, cynicism towards all men and their intentions, and toxicity.\n\nThe past month I would just be disgusted with myself for letting myself be treated like that. Every day I would be resentful and think to myself, \"what the fuck am I doing with someone abusive who doesn't try for me, when (for the most part), I am a really good girlfriend to him?\" I know my worth now. I am a very generous and loving girl that I think a respectful and kind person would be lucky to have.\n\nI'm still having thoughts that it feels wrong to not be with him, and I feel guilty for having freedom and doing what I want. I really have struggled with guilt and anxiety from this breakup.\n\nAll in all I am truly thankful for the comments on the original post who I probably wouldn't be here without. So thank you. I feel free. I haven't even cried yet. I feel like I did the right thing even though I am really sad. I am finally putting myself first despite how hard it is. I know he will read this and I originally wrote something to him but I don't want to put more of his personal info on the internet than necessary. In the end he is not a horrible person by any means, nor is he a sociopath like someone said in the last post. It sucks things can't work out right now at least.\n\nTldr: he continued to be abusive and i finally grew a pair and left him. Learned to never stay with someone who doesn't match your effort.\n\nedit: thanks so much you guys for the comments, i cant reply to them all. you really give me strength which i lack so much of right now. i know i did the right thing even though it feels wrong and pretty miserable right now. so thank you for the reassurance... every comment honestly does make me feel better.",
        "permalink": "/r/relationships/comments/9uugfu/update_my_19f_boyfriend_20m_regularly_does_things/",
        "comments": [
            ">I feel guilty for having freedom and doing what I want. \n\nHe was already warping your thought patterns. I'm so glad you got out.",
            ">  I know he wants to change\n\nNo he doesn't. If he wanted to change, he'd change. He's not failing to change because of some weakness or because he just needs help. He's failing to change because changing is uncomfortable hard work that requires a lot of introspection and attitude adjustment.\n",
            "[deleted]",
            "I'm happy you were able to get out of there. Don't feel guilty though. A lot of his actions were totally manipulative and you had to get out.\n\nBest wishes in the future.",
            ">No matter how trustworthy I was to him, he only ever saw me as the kind of girl who would run off with another guy the second she had a chance, a girl who loves male attention. \n\nThing is OP, shitty abusive guys like these they view ALL women that way, and he was projecting his own feelings onto you\n ",
            "I read the OP and was frankly disgusted at his behavior, and I'm so glad that you got out. I'm sure you know it by now, but that type of behavior is not only not healthy, but it's incredibly manipulative and abusive. Nobody deserves to be treated that way. ",
            "I read your OP and was horrified. So glad you got out. Please read the book Why Does He Do That?  And keep your OP to read when you think about getting back together with him. Also maybe talk to a professional to learn why you were ok with putting up with this because women tend to date the same type of guys and you don’t want a repeat of this. Good luck!!  Proud of you!!",
            "Once this has had some time to sit with you, you’re going to feel so much better. So much more confident. You won’t have to second guess every interaction you have with the opposite sex because it might upset your ex. You made the right choice. But I would recommend therapy, just because going through a trauma (and yes this emotional abuse/controlling behavior does count) can really effect your emotional well being and I want you to be safe, happy, and healthy. I wish you all the best ♥️",
            "Kick ass, you did great.",
            "OP. Babe. I am SO HAPPY FOR YOU. \n\nI read your first post with this gnawing pit in my stomach because I was you at that age. Constantly grovelling and apologising for existing. I’m so so happy that you’re out of that (mine took me five years!) and I’m so happy you’re realising that it’s HIS problem and not yours. \n\nYou got this. You have the whole rest of your life to set your boundaries, figure things out and to find someone who embraces you the way you deserve to be embraced and makes you as happy as you deserve to be. \n\nAs someone who lived the same abuse - I didn’t cry either, so don’t worry about that. But when I got in my next relationship with an actual nice man I had certain hang ups which you may find too - for example I was overly-apologetic about everything (because I had been trained to be that way) so I had to tell my new boyf that he needed to reassure me that it was fine and nothing further would be said on the matter because if he was like ‘uh? Whatever?’ my anxiety would go through the damn roof waiting for him to throw my (completely innocent) action back in my face. \n\nI don’t know if it’s possible for you to go to therapy (so many people recommend it here with no thought to the availability or affordability) but they will also be able to teach you coping techniques for dismantling his abuse. \n\nI’m going to echo a comment on your original post which was advice to read ‘why does he do that’ by Lundy Bancroft. It’s a book written by a guy who has acted as a therapist/counsellor to abusive men for many years but the book is written for victims. It helped me process what happened to me and get a sense of closure around the events. I may or may not be able to hook you up with a free copy if you PM me.\n\nThe rest of your life has begun OP, I wish you the absolute best and from a stranger mama hen on the internet, I am so fricking proud of you. ",
            ">The sad thing is, I know he wants to change\n\nNo he doesn't. He wants YOU to change and go back to being compliant.",
            "[deleted]",
            "There's a really great book called \"Why does he do that?\" By Lundy Bancroft. I suggest you go pick it up from your local library or buy it. It's going to make dealing with your feelings of guilt a lot easier. ",
            "Don't worry about breaking up via text, I had to do the same thing for an abusive relationship of 2 years and 9 months. It's the safest way to deal with it and you shouldn't feel guilty - if he hadn't been as much of an asshole as he was you wouldn't have felt the need to do it that way.\n\nTake some time for yourself, toxic relationships take a while to heal from (hell, I'm still healing 3+ years later). Keep remembering that it wasn't your fault and you did the right thing. Good luck and take care! x",
            "You did the right thing. Wish you the best.",
            "OP. I'm sorry to say this, but he did not \"want to treat you better,\" nor will he ever do so. It takes an unrepentant, shitty attitude to act the way he did.\n\nIf he'd felt an inch of remorse, this would never have happened.\n\nThe fact he's apologising/\"showing remorse\" now is emotional manipulation. Stay strong and keep him miles away, honestly.",
            "I just wanted to say: he didn’t think YOU were the kind of girl who would cheat or run off with another man etc etc, he views ANY attractive women as existing only for sex with men. ANY woman who looked good in a picture “is only doing it to entice men” and ANY woman who was attractive and friendly at her job “is only acting like that because she’s a tease.” It’s not YOU, it has absolutely nothing to do with you other than that he found you attractive so all other men must also have found you attractive, and it’s impossible to find someone attractive and not want to have sex with them. He views women only as a sex object so that’s how every OTHER man must view you, and the only reason women exist is to BE sex objects so obviously your acting as if you were an independent human with a life was only so you could sleep around. Because that’s how HE views the world. Please don’t make the mistake of even KIND of attributing his toxic, abusive, screwed up mentality to you or ANYthing you did or represent or said or wore, or who you talked to or how you talked to them or whether or not you have friends and a job or wore pigtails. It is 100% about him.",
            "I was in a similar situation to this for 2 years. It took me a long time to feel normal again. Be patient with yourself and remember that you come first. I hope you stick with it, and you find your happiness. 💖",
            "glad that you got out of that. it may hurt now, but as time goes on and you sit and think about it more, you’ll know that it was the right thing for you. you’re 19! you have a whole, wonderful life ahead of you! and that’s no way to start it out. remember this as you go through more relationships, and not just romantic ones. be happy (:",
            "I hope he's reading this. What do you have to say for yourself, douchebag?",
            "You're pretty empathetic about this guy now, but as you get farther and farther away in time with this relationship, you will become more and more aware of how terrible it was. The biggest thing is that he doesn't seem to have ever had this level of empathy for you.\n\nIn the meantime, please go absolutely no contact for at least some length of time. Give yourself an actual minimum time, like 4 months or 6 months - that will help prevent you from unblocking him on your social media until you're less vulnerable.",
            "I am proud of you in words I cannot even express. You've avoided so much wear on your self esteem and worth, so much abuse, just by ending things with him. You deserve the world and more, and you've been nothing short of a decent person. He cannot say the same. He may beat himself up over losing you, but that's not your problem anymore: you're free, and you should feel nothing but the wind on your face and the fresh air now that you're not being crushed to death by an abuser.",
            ">  The sad thing is, I know he wants to change and he wants to be with me, but he just can't bring himself to treat me right.  \n\nHe doesn't want to change. If he wanted to change he would. He doesn't like or respects women, he likes sex with women and using them as his emotional and mental punching bag, but he doesn't actually like or respects women. That much is clear from the way he treated you. If he liked and respected women he would be able to treat you as if he respected and liked you. He didn't love you, he didn't even like you. \n\nThe way he treated you was not about YOU as a person, it was all about his lack of like & respect for women period. He will treat EVERY woman he's with the same, because he doesn't like, trust or respect women. You didn't do anything wrong to cause his behavior, every way he spoke to you and treated you was a choice that shows you exactly who he is.\n\n> In the end he is not a horrible person by any means \n\nHe IS a horrible person. Horrible people don't always hurt others in big dramatic ways, they do it in little ways which slowly destroy someone. They manipulate and control, they get off on abuse, they're selfish and petty and mean. He was all of those things and did all of those things. He is horrible, and you should pity any woman who ever has anything to do with him. \n\nIf he wasn't a horrible person, if he was just hurting or didn't know any better, once he realized how much he was hurting you and how wrong he was he would have WORKED to change. But he didn't, he just manipulated you with crocodile tears and lies and kept on being himself.\n\nGlad you finally broke free. Better luck in future, at least you know some of the red flags to look for. Don't ever be with someone who doesn't respect, trust and like you, even if they say nice words like \"I love you\".\n\n&#x200B;",
            "When I was young I married a man and had two children with him. He did some intolerable things. He promised to change and seemed to sincerely want to change. I gave him a final year of my life, an irreplaceable year of precious and finite time in addition to the 5 years I'd given previously, and there was no change. I left him, filed for divorce, and moved on with my life.\n\nIt's been nearly 20 years. I get regular updates from the now adult kids whether I want them or not. He's behaving in exactly the same ways he did back then. The only difference is that now he's someone else's problem and I'm free.",
            "The reason he was seeing all men as predators is because he is a predator.  He looks at women the way he was saying men are looking at you.  He wanted you to be as invisible and unappealing as possible, because he was afraid that either you would talk to a normal guy and realize that most men do not police their girlfriends the way he does, or that you would get sucked in by another predator like him.\n\n\n\nI’m so glad that you realized that you are not a possession or a child, and that dressing and acting like a normal person doesn’t mean it’s your fault if men look at you.  You weren’t encouraging them.  You weren’t trying to attract their attention by existing.  Make sure you learn from this experience, and don’t let any other men get away with treating you this badly.\n\n\n\nAlso, keep your eyes open.  Whenever men are this obsessive and controlling, you need to be careful that once you break up they don’t move on to stalking you.  Be aware of your surroundings, try not to go out alone especially at night, tell friends and family to not give him any information about you, and block him everywhere.  Good luck moving forward as a free woman!",
            "This is amazing news! I wish I was a strong as you are at 19! ",
            "Wow I just read your original post. It was horrifying. I am glad you left him. Reconnect with your friends again. You'll start enjoying life again soon enough. ",
            "So glad you left. This was never about trust for him; this was about him needing to control you. ",
            "You feel guilty for being free. Sounds like someone grown up in slavery to me. Don't let such a thing happen to you ever again.",
            "It honestly pains me to read the original post and update, because I see so many similarities between OP’s relationship (or now ex-relationship) and my ex relationship. I feel heartbroken for you, because I know how tough things were for you and will be until you heal. The relationship I’m referring to lasted 3 1/2 years, and began when I was 15. Ended when I was 18 and it’s been over a year now since the break up. \n\nIt’s like things just build up and build up until you can’t physically, mentally, and emotionally handle it anymore and you just snap and have to break up with the person; no matter how much you love them and don’t want to. The human mind can only take so much. It’s good that you’re putting yourself and your happiness first. This goes to anyone out there who is struggling in a toxic relationship: Remember that you’re the one who has to live in your own mind. Make yourself happy. Leave those behind who cause pain to you. ",
            "In a few months, once you’ve gotten some clarity from this fog, you will see that he doesn’t actually want to change and you’re much better off without him. He wants control and he always will. He may not be doing it maliciously, it may be the trauma he’s faced and his trust issues causing him to act like this, but that does not mean that he’s not abusing you. He needs therapy to work through these issues, not you. I’ve been in the same situation and nothing felt better than realizing the truth, but it took time. Give yourself the time. But stay away from him. ",
            "Married 46 years, cheated on three times before I got married. All I can say from my personal experience and what I have seen with other couples we have known for the last 50 years. With a 50+% divorce rate, something like what you describe brings those odds close to 100%, so why waste time with a guy you have no future with. I know the type. They are the king and are allowed to fool around with other girls and go out with friends to bars and clubs, but not their wives who are expected to be faithfully waiting for them at home. There are so many nice guys out there, so it constantly amazes me why girls cannot tell the difference between them.\n\n&#x200B;\n\nLove does blind you to your partner’s faults which is one of the reasons so many blissfully enter into a marriage that has a better chance to fail than succeed when they would not board an airplane with a 50% chance of crashing.  When courtship type love (the kind we feel at first) goes away and you see your mate, warts and all, that is when you decide to continue or leave, hence the reason why most get divorced 2-3 years after they marry. My wife and I used to bet which of our friends and family will not make it long in their relationships, and we were right every single time\n\n&#x200B;\n\nOnce I was listening to the fiancé of my wife’s workplace friend telling me how he is banging girls by telling his fiancé he is out with his friends. Why would he tell me, a stranger whose wife was a friend of his fiancé. He was one of those guys who felt that men could do what they want, but not women. He saw nothing wrong with what he was doing guy to guy. It was an expensive divorce for him when his wife found out. Be smart and don’t date losers. Dating is like test driving cars before you buy one. Make sure you get the make and model you want with all the extras that will make you happy and not settle for a model that just has the minimum needed.",
            "Be strong. You have nothing to be guilty about. You are free to do whatever you want! Go out and talk/flirt/date any men you feel like! You have a whole lifetime of experiences ahead if you.",
            "Oh that's kickass! I'm super glad to hear this fantastic update OP. That first post was really shocking, I couldn't believe the hypocritical rules that only applied to only you but not him, the bizarre paranoid behavior, and the tantrums that he threw. Your first post was just a huge list of manipulative abusive red flags. \n\nGood riddance! Never look back. That wasn't a healthy relationship at all, and when you find someone great you'll look back on this and understand how different an equal relationship really looks.\n\nSo for now, go and enjoy life! You're young, go get out there! Go see your friends and whoever the hell you want! Go to the gym! Wear ALL the cutest outfits you want! You deserve so much more, and I wish you all the best!! ",
            "OP congrats on the breakup! Good work. Please be careful now. Abusive and controlling can be dangerous now. Maybe call you local domestic abuse hotline and talk about this relationship. Make sure your friends know what's up.",
            "I re-read the original post, and will read the comments after I type this. \n\nI am amazed how many relationships where someone says, you can't talk/hang out with the opposite sex.  I have multiple married female friends, and multiple times, I have met up with one at a Starbucks or a very cheap restaurant and we go dutch.  That is how to handle that type of friendship.  \n\nYou are young, you will find someone that trusts you and doesn't tell you who to talk to, or to hang out with.  ",
            "People who want to change will put the effort into it. He wasn't even showing effort. He DID NOT “want to change.”\n\nAnd I think classic abusers ARE narrowly focused narcissists or sociopaths. They fit the entire symptom list. Including the part about appearances hugely sincere and charming. They tend to fool everyone. He fooled you, at least for a while. Thank god you got out when you did, when his true self began showing. ",
            "I think you underestimate the crocodile tears that an abuser can whip up when you said he wasn't a sociopath. There's peple that fuck up and then gaslight you to make you feel sorry for them and pretend it's not their fault to get you to stay. My ex of 5 years was like that and he ended uo knocking me up by rape while he was publicly dating another girl and isolating me so much i didnt even know. People who show these reds flags are not usually good people trying to change. I'm glad you got out anyway and I hope maybe perspective will help you find peace",
            "Looking back over the decades from when I was in your shoes: Good job!\n\nYou're both very young, in the greater arch of your lives. You're still learning how to \"adult,\" and I think you're both going to come out of the relationship having learned something about yourselves, and about other people.\n\nIt'll hurt for a while in the short term, but long-term, you will hopefully both take the lessons forward and have successful relationships in the future.\n\nGood luck to you both!",
            "The next step is a doozy! You think the next guy that treats you like a human is a good guy but remember, your boyfriend wasn't crazy day 1 either. They bait and switch you. Even guys that seem sweet in the first few months can slowly turn into this. Maintain healthy boundaries. It is not your job to fix anyone or help them come around, the reality is that you never will, you only ever end up chipping yourself away while you try.\n\nVery often women exit an abusive relationship and enter another abusive one but they think that it isn't because it is slightly better than the last.\n\nAnd finally, low self esteem makes you compulsively feel like you have to go above and beyond to be a good partner. Being a girlfriend doesn't mean going above and beyond, if anything that just makes your partner comfortable doing less. And when you lean back into just being a regular good girlfriend either they notice that you aren't going above and beyond and complain, or they just never get it up to meet you in the middle and you sadly realize that it wasn't sustainable and efforts to change it don't make a difference. You have nothing to make up for. ",
            "> he only ever saw me as the kind of girl who would run off with another guy the second she had a chance, a girl who loves male attention.\n\nNo, not you. This is how he sees ALL women. He doesn't respect them, or you (he kinda sounds like a red piller, which, ew). He thinks they are property to control. And just because he's a perv, he assumes everyone is. Just because he can't be trusted, he assumes no one can.\n\nI dated an abuser like this. You know how you would cry remembering the guy he was when you first started dating, the guy who wooed you and was so respectful? That guy was the act. The shitty abuser? That was the real him. That's how abusers operate. Because they'd never get a partner to abuse if they showed their true colors from the start. No, they lure you by being charming, sweet, the perfect partner. And then when they've got you convinced, they start with the controlling, abusing bullshit. They'd never get anyone to stay and put up with it if they didn't do the Mr. Perfect act at the start. And you think if you are \"perfect\" enough, they'll go back to being the sweet guy they were at the beginning. But that guy never existed, it was all a fake.\n\n> In the end he is not a horrible person by any means, nor is he a sociopath like someone said in the last post. \n\nYou're wrong; only a horrible person would treat you the way he did. Good people don't act that way. He doesn't really want to change; if he did, he would have. He knew he was treating you horribly, and he kept doing it. Because that's who he is. Don't delude yourself. There is something very, very wrong with him. Otherwise he wouldn't behave so psychotically. To the ex boyfriend: You need help. A lot of it. None of your behavior is normal. None of it is loving. None of it is OK, no matter what shitty excuses you have for your behavior. People are allowed to look at your girlfriend. That's part of living in the world. Getting so psychotically upset about it is not normal. Controlling the way another adult dresses, where they go, who they see ... it's not normal. It's not OK. It's totally fucked up. Get help before you even consider dating again, because you're an abuser, and you're an awful person.\n\n>  I feel guilty for having freedom and doing what I want. I really have struggled with guilt and anxiety from this breakup.\n\nI went through this too when I finally escaped from my abuser. The freedom ... it was too much at first. Not walking on eggshells. Not being afraid of pissing someone off all the time just by living. That's not normal. Therapy probably would have helped, and is a good idea for you. The good news is, that dumping his emotionally abusive ass freed me up to find the guy I married. He's amazing. He's sweet, he's kind, he's proud of me, he makes me feel awesome about myself (instead of cutting me down and making me cry all the time). If he sees a guy looking at me, he tells me, \"Hell yeah, of course guys are going to look at my girl, you're hot.\" He's proud to be with me, he trusts me completely (and knows he's the only one I'd ever want). He likes it when I dress up and we go out -- he says he's showing me off. If a guy talks to me, he doesn't get upset because he's not insecure. He's my best friend in the world and he encourages me to go out with my friends and have fun (and my friends love him). Because that's what a good partner does: They want the person they love to be happy and have fun. The best decision I ever made was leaving my controlling ex and I'm so grateful I did so I could be with my husband. Having such a shitty ex also makes me appreciate how awesome my husband is. I have literally had nightmares about being back with my ex. Thank god he's gone.",
            "wow he sounded like he had many issues that he projected onto the relationship.",
            "I went through the exact same situation a few years ago. I’m now happily married to a guy who respects me and my autonomy. Stay strong, you got this. Your life is going to be so much happier without him.",
            "I’m so glad you pushed through. I highly suggest seeing a therapist. It will be hard, but trust me it’s worth it. It’ll take a while to reverse his “brainwashing” he’s done and the mental and emotional abuse but I know you can make it through. You deserve to be treated well. You will find someone who sees your worth and shows you that. It’s sad to say, but it does sound like he was cheating/would cheat. I was in a very similar relationship (heck Almost identical) and found out he was cheating majority of the relationship. He was projecting his guilt of cheating onto me by accusing me of cheating 24/7. ",
            "First heartbreak is always super painful, and you want to run back, or run away to make the hurt stop. These reactions are wrong. Especially when your partner was not a partner but someone who did not respect you as a person and who’s behavior would have only gotten worse. He wants your existence to be all about him. That’s not a relationship.",
            "I never saw your original post, but I'm happy for you and proud of you.",
            "Soooo proud of you, OP. You have so much strength and deserve better. BELIEVE THAT!! My only advice is definitely seek a therapist and get yourself mentally healthy. Love yourself. You won’t regret or feel guilty for that. ",
            "Hey OP, I have been to a similar situation and I know how difficult it is to leave that person. But in my situation, he came back with promises that he will change, he begged to get back together and I believed him. He didn't change. Things only got worse. In the end I had to block him everywhere to not hear from him again cause I knew that if he came again, I would accept him.\n\n It is so hard to leave an abusive relationship especially when it was amazing in the beginning. I read somewhere that it takes 11 attempts to leave an abusive relationship. Stay strong! You might feel the urge to go back to him hoping that things will be better, it won't. All these people in the comments want to help you, so just write here again if you feel like going back to him.",
            "I'm so happy for you! Please, take your time to heal and get back to your life and friends before dating again. It's a good time to be alone now. Maybe see a therapist if you can.",
            "Good on you for realizing what he was doing to you! You are still young and have so much time finding someone that will treat you right. Take this as a learning experience of what NOT to put up with in a relationship.",
            "Please research narcissists and codependent relationships. This is a mental prison he's put you in. Run and never look back",
            "I absolutely understand. My first boyfriend was also abusive. But when it's all you know, what else is there to compare to? \n\nI was 15 and he was 16, we'd also met online but he live closer to 4 hours away. I would visit Tom every two months for the weekend. He had 4 brothers, one who had moved out andd 3 younger. They shared 2 bedrooms, so when we went to bed we shared his and his brother was across the room. He guilted me into my first time and every time after that. I cried every time we had sex and if I told him I didn't want to he would ignore me and go play wow as punishment. He wanted me to only dress in loli-goth clothes and regularly told me that my boobs were too big. (I was only a b-cup at the time) and that I should bandage them down. \n\nIt took a year and a half before a friend made me take my blinders off. He was a racist, sexually abusive asshole and I wasn't happy. He wasn't the guy he'd portrayed himself to be when we were online friends, and he wasn't the guy I kept pretending he was. \n\nYou're better off without him. Trust me. Now just don't make the mistake most of us do and find another bad guy and excuse it because he's \"not as bad\". You can do this. ",
            "My ex did this to me. Except I didn’t have a whole community to help me wake up to what shitty treatment I was receiving. \n\nI’m glad you got the hell out of there. If he’s anything like my ex, he’ll make the motions of “I should have done this... I should have done that...” But that’s the thing, they don’t because it’s not in their comfort zone to do something for somebody else. \n\nIf they really cared, they would make the changes to be a better person and a better partner to you. Good on you girl. Find someone who is deserving of your time who doesn’t tear you down to feel better about themselves. ",
            "proud at you for leaving- things will only get better! ",
            "Moving forward will be hard, but it'll be worth it. You deserve happiness. ",
            "Just a word of advice; since you’ve finally broken up with him, he might suddenly start acting the way you wanted him to, to try and get you back. DO NOT FALL FOR IT IF HE DOES.\n\nMy first ex did this; after 3 years of treating me like shit and him breaking up with me 3 times, I finally had enough and started moving on, and as SOON as he realised “Shit, I can’t just get her back anymore” he started being all affectionate and kind to me, the way I had wanted him to be for those 3 years we were together, because he knew this time I wasn’t going to beg him back and be his plaything anymore.\n\nIt’s a manipulation tactic to try and keep you for himself, but if you get back with him, he’s just going to revert to his old ways because he’s satisfied that he won’t lose you. So yea, just a heads up in case he comes at you acting like a changed man.",
            "I hope you're doing okay. Having recently gotten out of a similar situation myself, reading your post really made me realise how bad my last relationship was. He wasn't as controlling as your ex, but I found myself saying very similar things to you - he doesn't mean to hurt me, he wants to change etc. And the truth is it doesn't matter. He didn't treat you right, and whether that was his intention or not, you are much better off without him, and soon you'll be more sure of that I assure you. It took me some time, but I've realised I'm so much happier without him, and how much I loved him and wanted to be with him wasn't worth putting up with his shit. ",
            "You go, girl! Focus on yourself and your hobbies, and maybe talk to a professional to help sort things out. ",
            "I think that if someone *really* wants to change, they will. Not instantly, especially if it's a big change, but small steps. It sounds like he couldn't even do that. All the \"I want to change\" is hot air if there is no effort behind it. He just isn't a good person. That's it.\n\nYou're very kind and sympathetic to believe in him, but I think it's wasted energy. I've been there. These are great qualities. It will pay off so much more when you find someone equally as kind, trust me. :) ",
            "Glad you got out! Dont beat yourself up for not realizing he was abusive. I had a similar situation at 20. There is nothing you did that was wrong. Focus on regaining yourself, practice mindfulness, think about what makes you happy. You are much better off and now even wiser. ",
            "I'm so happy you made this decision and I really hope you continue to be strong from here. \n\nI want to mention that you absolutely are not to blame for any of this. I see you saying things like \"The past month I would just be disgusted with myself for letting myself be treated like that.\" While I think it's good to understand this concept, the wording puts the blame on yourself. He is the only one at fault for his shitty and manipulative behaviour. \n\nIt will take time to undo the negative feelings and anxiety that come with enjoying some things, but it's not impossible. Just allow yourself to take that time and try to recognize your true worth, which you seem to be doing a great job at already.\n\n\"No matter how trustworthy I was...\" You are trustworthy, and you are kind. His issue is not that he thought you were untrustworthy, please don't think that. He was trying to alter your thinking so he could be in control.\n\nDo not blame yourself. This is a fantastic new beginning and I'm glad you feel free. Onto bigger and better things! Don't look back and keep your head high :-)",
            "I get it. I went through a rough time when I got out of an abusive relationship in college. I went to a university counselor for a couple sessions just to talk to someone and it made me realize I was just mad at myself  for putting myself in that situation. I am a strong person and I let someone beat me down. Once I realized that, I forgave myself and decided to be the best  version of myself that I could be. I try to be positive and encourage other people to love themselves too. \n\n&#x200B;\n\nI promise it gets easier and you learn to set your bar high for the future. Make some new friends, join a sport league or go to a flea market or go to a local concert. Take up a craft on pinterest or redecorate your room. Keeping yourself busy helps.",
            "It's what we do that defines us. he ***IS*** is horrible person. Good riddance.\n",
            "Sorry, but he is a horrible person for abusing you emotionally and mentally. ",
            "Reading your original post was like a flashback to my relationship with my ex. Seriously, your words could have been written by me. The only difference was I put up with his behaviour for 4 years. I am so happy that you got out of this abusive relationship only a year in. In a couple of months you will look back on this and be so glad that you ended it.",
            "You did the right thing! So proud of you. You will find someone better. In the mean time it may be beneficial to talk to a therapist or counselor who can help you process your emotions. I am sure you're feeling guilt and sadness, but those are normal and to be expected in leaving an abusive situation. Abusers can turn your head inside out. ",
            "coming in here late and wow! so proud of you leaving a bad, red flag relationship! i know it feels weird, its how he warped your thoughts,  but you will come back to yourself, and wiser. \n\nremember you knew enough to ask us, and you knew our responses were right, snd you know its a better life without him. stay strong; sometimes abusers come back, because they are actually very weak & dependent & desperately need someone to push around to make themselves feel ok.  you don’t need that anymore. \n\n\n\none comment specific to what you wrote; referring to yourself as girl. i think you might be naturally submissive, and in looking for a ‘take-charge’ kind of guy, you got an abusive one. theres a difference between domineering [ bad] and dominant,   a dominant kind of person would respect you by protecting you with consent. a domineering person doesn’t care about consent. a dominant person would offer some return for the control thats given to them; actual care, respect, honesty & integrity in the relationship.  so something to keep in mind as you continue to move forward. ",
            "You learned in four months what took me four years to learn. And some don’t learn at all. ",
            "Sad im in this kinda situation myself...except opposite.\n\nShe's going to therapy to at least show me an effort, i just hope something changes...\n\nHope all goes well!",
            "You did the right thing- the sadness will pass, one day you’ll look back and be so happy with yourself for being strong and leaving. Going forward- constant jealousy is a HUGE red flag. People automatically assume that their partners will behave like they do- if someone is honest and trustworthy, they assume that their partner is too. If someone is constantly jealous and accusing you of cheating, you can bet on it that they’re cheating on you. You deserve someone that treats you with love and respect, don’t settle for less. Congrats on finding your strength:)",
            "It's normal to miss him and even feel guilty, I'd suggest some counseling to deal with these feelings and what will be residual from this experience as it will help you move in a more positive and healthy direction. Good for you for being so strong and respectful of yourself because in the end that's what really matters! ",
            "> The sad thing is, I know he wants to change and he wants to be with me, but he just can't bring himself to treat me right\n\nThe thing he, he doesn't want to change for the right reasons. If he did, he would have tried harder over the past year and four months. The entire basis of your relationship was built on his controlling behavior, and it sounds like that's how it always has been. And that's how it always will be. \n\nThe reason he wants to change *right now*, however, is because he is suffering consequences. But if you two got back together, you would inevitably end right back where you left off.\n\nWhen I was exactly your age, I was in a painfully similar relationship. He was so convinced I was someone I was not and assumed that interacting with men at all meant I might just miraculously fall onto someone else's dick by accident. But I stuck around because all the above, to me, meant he was crazy about me. And crazy was right.",
            "now comes the hard part. going \"no contact\" so he doesn't worm his way back into your life begging for a second chance. stay strong.",
            "I know you've got a million comments here, but I just want to say: I'm so, so proud of you. You are stronger than you know. It is so easy, especially at your young age, to confuse sadness with \"wrongness\"(and thus try to repair a toxic relationship) and feelings of love with \"rightness\" and it can take people twice your age a lot longer to free themselves from a toxic situation than it took you. Abusers are really, really good at what they do..and they are also humans with other traits, ones that can make people who are loving and sympathetic want to stay. Someday you will see the way a healthy relationship looks, and it'll be so, so different than what you just experienced (and I say this from tons of experience). Stay strong, and know that you made so many of us so super proud.",
            "„Things can’t work out *right now* at least“? I know you want to think that he is a good person but he isn’t. He is sexist and abusive. Don’t hold out hope for getting back together with him. Just cut all contact with this guy and remove him from your life forever.\nYou are kind and generous, loyal and trustworthy, and I am very sure that you are stunning if so many men hit on you. You are a catch. You can have a guy who not only doesn’t control, demean, insult, mistrusts, and abuses you, but who lifts you up, supports you, loves you, buys you flowers, doesn’t cheat on you emotionally and doesn’t lie to you. \nYour ex boyfriend is an abusive liar. He can go get fucked. ",
            "I’m so glad you broke up with him even though it’s difficult and painful.\n\nAlso—\n\n1.\tNothing you do excuses his bad behavior. Don’t excuse abuse because you’re not perfect. *Nobody* is. You’re a good person and deserving of respect.\n\n2.\tHair styles aren’t sexual. That’s ridiculous. I do understand why you’d go along with that. I just want to point this out so other women don’t think this is ok. If it’s a religious belief, it’s still not ok. Jesus said that men are responsible for their sexual thoughts. Islam also teaches something similar. You can dress modestly as a sign of respect to other men to help them not sin, but the onus is on them. No matter what you wear. Controlling your wardrobe and hair is a red flag for abuse.So is lots of negative comments about the way other women dress. It’s none of their business and a sign of victim blaming, No women deserve that.",
            "Really glad you got out of there. You seriously need to go no contact because it sounds like you may be willing to get back together next time he hits you with a sob story. If he wanted to change, he would. It's REALLY easy to not micromanage another person's life. \n\nI've never been in a situation quite as bad but in my experience, the worst part of these toxic relationships is that this insane controlling behavior becomes the new normal. By the end, you start getting mad at stupid stuff that you shouldn't get mad at. You start getting bothered when they don't follow a schedule. You start feeling guilty even if you did nothing wrong. Your SO having trust issues is not a license to make your life hell. Everyone's been hurt before. \n\nNowadays, I really don't entertain it anymore. You either trust me or you don't. If you don't, then we can stop wasting time and end it. Don't have the time or energy for all of the stuff that comes with it. ",
            "Happy to hear you've broken up! I'm sure it wasn't easy - just my two cents:\nNobody sets out to be in an abusive relationship. You end up in one because the person knows how to act nice and woo you, and once you're in love, they are comfortable demanding more and more ridiculous things and only put in the minimum effort to keep you - eg. treating you like that but when you want to leave, he suddenly says all the right things again, about how he's going to change. Because you're a good person and because you still hold on to that guy he showed you when you just met, you believe him and find it hard to just leave. There's always the \"what if he DOES change, it would be so great\". That's normal. That's how people end up in abusive relationships. It doesn't happen over night, it's a slow process of normalizing things (\"me telling you what to post on social media is normal in relationships!\") - Don't beat yourself up over your actions. Leaving was hard. Even now, it's ok to be sad and miss what could've been. But it's also important that you remind yourself that it WAS indeed abusive, be proud that you managed to end it - and in the future, treat those things like the red flags they are. Don't tolerate this behaviour even one second.\n\nAnd you're right, someone who loves you would never do those things. They'd want you to express yourself, to have friends (whether male or female), to be the best version of yourself. And if that made them insecure and controlling, they would actively work on that before you could ever even say smth, bc they would want better for you. Maybe he loved you, but what he loved more than you is the control and power he had over you. He was so insecure that he enjoyed putting you down to feel better about himself (like saying it's your fault guys stare at you and making you feel bad/apologize). That's heartbreaking, but now you know not to tolerate this. Like the saying goes, believe someone's actions, not their words.\n\nAlso: it's okay to be single. Enjoy it. No need to rush into dating again - actually it would probably better if you didn't, so you can truly process this relationship and have a healthy one the next time around.",
            "I'm so proud of you.\n\nRelish this moment. Finally being free of an abusive relationship is a wonderful feeling. When you have the time and feel ready for it, I would encourage you to pick up Lundy Bancroft's book \"Why Does He Do That?\". It's online as a pdf if you can't set aside the money for a hard copy. It's a very good read for people who have been in abusive relationships. \n\nIt's also not a bad idea to consider talking to the people you love about this relationship. Therapy can also be good if you find yourself exhibiting trauma symptoms-- you might not, but you're not weak if you do! \n\nBut that's all a little bit into the future. For now, just enjoy your new abuse-free life. :) Rooting for you! ",
            "I can't wait until you get to the rage stage, you do absolutely brilliant things then ",
            "I applaud your courage to get out before you fell even deeper into that rabbit hole. You got this. ",
            "I think there's one thing you got wrong about him in particular.  It's not that how he sees you affected his behavior. It's how he sees himself.  Dudes with a lot of insecurities that make them feel like they need to have absolute control over others before they can trust them.  Like most fear, it comes from a place of weakness. ",
            "Your ex boyfriend reminds me of myself. I was an abusive and controlling boyfriend back in the day until she left me for good. It was a huge wake call for me for being an asshole. As a result, I becoming a better person day by day and hopefully I find love again soon. Getting tired of the meaningless night stands",
            "First of all, good for you, it seems that you made the right decision based on everything you said. According to what you stated, he has extreme jealousy issues that are very difficult if not near impossible to change from within a relationship. It's difficult to recognize when a relationship is bad for you, especially when you care about the person so much. You did well.\n\nThat said, I just wanted to address the plethora of comments on here completely demonizing this guy. Is he a jealous, controlling person? Yes. But people are talking about him as if he's the scum of the Earth, and Beyond any compassion. He needs help. Yes, he treated you horribly, and you should not be in a relationship with him. However, being jealous and controlling is indicative of insecurity which is brought on by issues he's dealing with. He is a victim, as well, of his own insecurities. People who feel insecure don't enjoy the feeling of insecurity. They don't choose to feel insecure. And when this results in them being controlling and jealous, they have difficulty being self-aware that what they're doing is wrong. It's a mental health issue, and just because he's victimizing somebody else, that doesn't mean he isn't also a victim himself. It also doesn't mean that he is some evil Puppet Master.\n\nWhat this situation needs is understanding and compassion from all angles. It's not a relationship that should have continued, and his actions are not acceptable, but the comments I've seen talking about this guy as if he's a lost cause psychopath isn't the best way to go about this. It needs to be made clear that what he's doing was completely wrong, but it's not okay to treat him like a rabid dog.",
            "Simple: He's not into you. \n\nFind someone else. ",
            "When I read this, I say to myself why  did this girl listen to reddit and decided to dumb the guy without trying to save the relationship.. some of the topics I read around here can workout.. \n\nBut when I read the other post.. oh god, you did the right thing to dumb that guy.. and you were stupid to stay with him after what he did.. you deserve someone better know how to treat a trustworthy girl like you.. I get that jealousy is a good thing in relationships but sometimes it become like cancer and lead to trust issue..\n\nYou are too young live your life and I hope you find someone kind and far better than Your ex a year ago.\n\nExcuse my language, English its not my native :\"(",
            "[removed]"
        ]
    },
    {
        "post_id": "cziqqi",
        "author": "StrangeMistake5",
        "title": "How do I [32F] protect my work relationships from a bad nepotistic hire?",
        "url": "https://www.reddit.com/r/relationships/comments/cziqqi/how_do_i_32f_protect_my_work_relationships_from_a/",
        "score": 2587,
        "num_comments": 152,
        "created_utc": 1567591017.0,
        "selftext": "**TL;DR:** Senior colleague hired his wife to join my team and she sucks, how do I manage the relationship with her and minimise collateral damage to my own relationship with other colleagues who are friends with her?\n\n...\n\nDetails:\n\nI work for a small company with 11 employees, soon to be 16. I like my job and most everyone I work with, bar one member of the senior team I'll call Gavin \\[40M\\]. Gavin isn't the top of the food chain but he has a lot of clout, as the CEO really likes him and handpicked him to join the company based on their past relationship.\n\nMost of the people at my company have worked with each other before in past roles or know each other personally. Hiring friends is the norm, though I'm one of the few \"outsiders\". This hasn't been an issue at all up until recently, when Gavin hired his wife Donna \\[F39\\] to work part time at the company and asked her to work on some of my projects without consulting me first. I only found out she was going to share projects with me on the day she started.\n\nUnfortunately, Donna is not experienced nor naturally talented in the work she's been assigned. She's been insecure, needy and anxious from day one, and lacks the basic skills necessary to do her job well. I've tried to help her adjust because I would actually welcome some help with my workload, but she pulls me into meetings for an hour or two every time she's in the office, asking me really basic questions and/or just quietly panicking at me. She also does this with CEO, who she knows personally through Gavin.\n\nI've tried to pull away a little bit by not responding instantly to her Slack messages and not accepting every meeting she's tried to book with me. The result has been that she's started interrupting me in meetings, asking basic but usually inappropriate questions addressed to me. I don't think she's intentionally undermining me because she's always grateful when I 'help' her but I'm finding it hard to stay patient. Gavin, of course, always chimes in to support her in team settings.\n\nI've also tried to build my 1:1 relationship with Donna so there's enough trust to establish boundaries, but unfortunately I can't really find much common ground with her. She's quite negative, complaining loudly that no one at the company has their shit together and I feel like she probably says the same things about me to her husband and the CEO outside the office.\n\nThere are very subtle signs that the CEO may be starting to realise hiring her wasn't a great idea - if she wasn't Gavin's wife I think she'd definitely be on her way out, so I think my best strategy here is to wait this out and try to stay calm. However, the CEO booked a 1:1 with me next week and if he asks me about Donna I'm not sure what I'll say. I feel the resentment growing, not just at Gavin and Donna, but also at the CEO for not establishing a fair work environment.\n\nI don't want to ruin my place in the company over this. My question is, how do I handle Donna while covering my own ass? And what should I say if asked about what I think of Donna's work?\n\n\\*\\*EDIT\\*\\*: Whoa, this blew up. Thanks all for your comments and advice - I just read everything. To clarify a few things:\n\n1. Donna isn't my direct report. We don't have managers at our company, so technically no one is. I wasn't asked to train her, but when I found out on her first day she'd been told to \"support\" some of my projects I sort of had to step in.\n2. I don't know if the CEO is going to talk about Donna in our meeting, but I don't like being caught off guard so I'm thinking more 'what if?'\n3. She doesn't have a JD or even a title, so I understand her anxiety to some extent as our environment is pretty chaotic. Given her personal connections I told her she could probably just define her own role and give herself any title she wants, but she hasn't done it.\n4. I don't ignore her messages, I've just stopped responding \\*immediately\\* because it fucks up my focus\n5. I'm not the only person she's doing this to. She naturally also books Gavin into long meetings and also the CEO . She's the only one who gets this level of attention from the senior team in the company and it's not really sustainable in any case\n6. The work I've tried to help her do is still substandard, which is mainly what's worrying me, and she doesn't really have the right mindset for this type of business that I've seen. She might get away with it as just an average employee in a big company, but in this setting it's glaringly obvious.\n\nShe's made references a few times that she's been near quitting from stress, so I really don't want to get any more involved in this unless I have to. I don't want to get her fired. But her flailing around, taking up my time is indeed disruptive to my ability to get things done, especially right now because I have additional project work on top of my daily responsibilities. I would just talk to her but I'm afraid she'll take it totally the wrong way because she's so wound up, and I already have a not great relationship with her husband so I don't want any of that backsplash.\n\nI think my best case scenario is that the CEO takes over her coaching completely if he wants her to stay. I don't feel like I can really ask for that directly but maybe I could angle for it.",
        "permalink": "/r/relationships/comments/cziqqi/how_do_i_32f_protect_my_work_relationships_from_a/",
        "comments": [
            "My advice: Be honest but tactful, and focus on the impact to your work. Even though she's obviously frustrating as hell, don't share that. Say things like, \"It's hard for me to spend the time I need on my own tasking when Donna is asking me to meet with her several hours a day; for example, on both Tuesday and Wednesday I sat with her for ninety minutes answering questions. Is there a better way for me to be handling that?\" \"The document she produced needed an extra two hours of editing before we could give it to the client.\" Act in the manner that you aren't complaining, simply giving him information about how things are going and if this is what he wants then that's fine with you. \n\nAnd if he indicates that he doesn't want to hear negative things, then stop going down that road for your own sake. But you can't expect him to fix things if nobody has told him what needs fixing - you need to give him a chance to be a good manager until you see that he's not going to take that chance.",
            "Don't go into this unprepared. This meeting may also be in your performance. Have you missed any deadlines? The wife may have complained that you aren't taking the time to train her. I would have a list and length of all the meetings you've attended with her and a list of the ones you denied and what you were working on that you felt it was necessary to deny them.\n\nedited to say - I don't mean take a list in with you obviously. Just have the info at your disposal in case you need to make a rebuttal to her claiming you are unhelpful.",
            "You have the right idea, play it cool for the time being let her incompetence do the work for you. Do your best to maintain a good and helpful relationship (this is for your benefit, not hers). If asked in your 1:1 about her, phrase things in the most positive and helpful way you can but be truthful (these are not mutually exclusive). \n\nI have learned the hard way that in situations like this, being \"right\" is not enough to protect you from fall out from going up against a nepotistic hire.",
            "With being interrupted in meetings, I used to have an assistant like that. The only thing that worked was to say \"hey, I'm in a meeting right now, we'll talk later,\" like a stuck record every time he tried asking a question or saying it would only take a second or whatever.\n\nI think what I would do at this point is set up a regular meeting slot with her- daily, weekly, every other day, w/e- and then turn down any meeting requests outside of it. If she keeps asking to meet, just tell her your next meeting with her is on [DATE].\n\nIf she asks questions, ask what she thinks she should do (quickest way I've found to redirect stuff like this!) And if she complains to you about people, just make the most noncommittal response possible- or 'oh, that's odd, X doesn't strike me as being so bad', and then go back to work.\n\nIn terms of what to say to the CEO, be cautious. Don't say anything about her unless he asks, and ideally wait until you have a sense of how he's feeling before he says anything at all. Point out specific things, and make it clear that you've discussed them with her or otherwise tried to work on it before bringing them to his attention. \n\nSo rather than \"She's increasing my workload', say that she still needs a lot more support than someone at her level would be expected to, and that that's eating into your time. Tell him that she's repeatedly interrupting meetings and other work despite being asked not to. Mention specific instances where the work she's produced hasn't been up to scratch and what impact that has had.\n\nAlso, I would suggest job hunting. You don't want to work for a company with that level of nepotism, because it *will* bite you in the ass at some point.",
            "Diarise your interactions with her: time/date/nature of interaction. When CEO asks, show him your diary. You needn’t give your opinion, he should be able to deduce from the length and nature of the interaction whether it’s a good use of his employees’ time.\n\nIt isn’t your job throw her under the bus. But you can offer unbiased accounts of your interactions with her.",
            "Could you not direct her to books, courses, tutorials, videos, or other training to help her with the things she should be able to do but can't? So the next time she asks something you have already explained, or which is something that she should have known coming into this role, you can say: \"Sorry but I really don't have time to teach you this, but you could take this (online) course to learn about this topic as well as other things relevant to your role.\"\n\nI would be honest in your 1to1 but perhaps more by asking questions:\n\n* I was not told about this hire until the morning she started, so I had no chance to prepare. Why is that?\n* What exactly is her background? I wasn't given the opportunity to review her CV.\n* Is she going to be taking some courses or formal training, because I think she could really benefit from that.\n* She's frequently requested to meet me to ask very basic things that I think someone starting her job should know about. I am happy to teach people but so far it's taken quite a lot of time out of my week to train her (mention number of hours if you can, or a ballpark number such as 'around 10 h a week') and I feel it's affecting the time I have for my other tasks. How many hours a week are you happy for me to allocate to training her?\n* I think she's not very used to our company culture as she's started to interrupt me when I am in meetings. What is the best way to bring her up to speed with our office culture?",
            "> I feel like she probably says the same things about me to her husband and the **CEO** outside the office   \n>  \n> However, the CEO booked a 1:1 with me next week \n\nI would be very careful with this and would advise looking for other jobs. What is the purpose of the 1:1? Are these normal in your workplace or is this a random occurrence?",
            "I think you should stop ignoring her on slack or with meeting requests. Perhaps set up one or two weekly meetings with her, set a firm time limit for them, and when she approaches you at other times, say, \"we will discuss this on Tuesday during our check-in.\" \n\nRegarding how to talk *about* her work to your superiors, that's trickier. I would approach any problems you have with her from a perspective of, \"I would like your advice on how to manage this so that we can work together more effectively, and here are the challenges I am facing with her,\" not from a perspective of complaining about her. This is assuming that she has not done anything really terrible.",
            "I think you should approach the situation and what you can do to make things better.\n\nE.g. “I’m finding it hard to balance my workload and meetings whilst training new people, what do you think I can be doing better?”\n\n“This is how we’ve been interacting as far as meetings etc are concerned, I’m worried my approach isn’t working best, how do you want me to handle it?”\n\nIt’s totally fine to explain there’s an issue as long as you take responsibility for it in the first instance and ask for his guidance and how to do things differently. It’s win win for you - you’re following his direct orders and advice, so doing what he wants, and if it backfires it’s on him and the situation and not on you. This is how I’ve handled a tough situation at my new job and it’s worked great.",
            "I would definitely bring it up in the 1:1 meeting if the boss brings it up. I don't think its wise to say anything about the prospect of letting her go because that seems like an overstep, but I would talk about how its affecting your work and ability to do your job productively. She's still asking questions that a beginner would have mastered by now and indicate that she's not developing in her role at the pace you would have expected. She interrupts you which affects your focus and disrupts your meetings with other coworkers/clients. \n\nApart from what you might say in the meeting, maybe a helpful instruction you could give her would be to try and figure out the answers to her questions for 15 minutes before she comes to you.  Ive heard of big companies like Google doing this because it increases productivity. Just say that you think it will help her learn better to try it herself and then that could help get her off your back for a while. Good luck!",
            "“She’s a unique hire, definitely have a lot to learn should she decide to stay long term. I believe she would do a lot better with her husband training her than she does with me.” \n\nMeanwhile, start looking at other jobs. Whenever this blows up, and it will from the way you’ve described your interaction with her, her husband will point his fingers at you since he assigned her to you. He will try to cover his ass, so you need to as well.",
            "OP, who do you report to and who does Donna report to? This is relevant to your approach here.\n\nIf you report to the CEO, then you should have the type of relationship with him that would allow you to be truthful, although you should still approach it like a formal performance review.\n\nIf you don’t report to the CEO, then you need to discuss this with your manager ASAP. If he or she is anything close to decent then they should try to help you out and protect you from potential fallout.",
            "I'm not really sure on the reporting chain here. Who does Donna report to? \n\nI think the danger here to you is that it appears that there's some expectation that you'll train her and that's clearly not happening, and it looks like there's expectation that you'll be managing her, and you aren't. I think ignoring her Slack messages and not accepting meetings lends credence this and I think this is a possible problem for you. To be honest, I am not sure whether this situation reads as \"OP has a grudge against her employee and isn't capable of managing her\" or \"OP is managing a bad employee.\" \n\nIn my career, I have seen managers who struggle with the concept of onboarding people. This is especially true when its not \"your\" hire. In your case, it seems like you're scared of upsetting the political situation, so you're letting this linger and get out of hand.\n\nNot every new employee is a rock star whether there is nepotism or not. By definition, most employees are just average. If you're in a managerial position, your role is to:\n\n* Do your best to set people up for success\n* Set performance standards and hold employees to those expectations\n* Give them feedback, so they know how they are doing (good or bad)\n* Performance manage them\n\nGenerally, you can lead a horse to water, but you can't make it drink. Not checking off those boxes makes it look like you're the problem.\n\nMy questions would be:\n\n* How is she failing? Can you cite specific instances where she's failed? Is she missing deadlines, producing work that isn't up to par, or what? Importantly, what documented conversations have you had with her about the quality of her work? You need to provide measurable performance standards.\n* If she's asking too many questions, what has her training looked like? Have **you** adequately prepared your employee to do the work? Have you taken adequate steps to train her and she's still failing? More importantly, can you defend your definition of \"adequate training\" to your CEO, or will he look at what you've done and say \"You're failing as a manager?\"\n* If she's asking questions at inappropriate times, or trying to over collaborate, then have you given her this feedback and is that documented?\n* Do you have a standing meeting scheduled? That provides a place to talk and get her questions answered in a structured way, which should cut down on interruptions\n\nFor example, the next time she interrupts your meeting to ask you a question, do the following:\n\n* Take her out of the room\n* Explain to her that you're in the middle of a meeting and its not appropriate to interrupt other meetings unless its vitally urgent\n* Tell her that, moving forward, she should either send you something in Slack or wait until your meeting is finished to ask her question, and if the question is a \"blocker,\" she should work on another task until she can talk with you\n* If its a question she should know the answer to, then say \"And we've talked about this question already, so my expectation is that you should be capable of handling that task on your own by now\" and give her a definite date/time and way she can demonstrate competency here \n* Give her a chance to ask any questions about the feedback you've just given her\n* Return to your meeting, apologize to the people in the room. If they are manager level or above, explain that you are coaching her on her over-collaboration issues.\n* After your meeting, send an email summarizing your conversation. Something like:\n\n>Hello Donna,  \n>  \n>I just wanted to summarize our conversation in the hallway, just to confirm that we're both on the same page. Moving forward, please refrain from interrupting me when I'm in a meeting, as this is disruptive to our team.   \n>  \n>My expectation is that, if you have a question and I'm unavailable, that you work on other things until I'm available, and that you're able to manage your own workflow in an efficient manner.  \n>  \n>Additionally, I want you to handle tasks independently when possible, and my expectation is that you can complete your work on your own, without my direct supervision. This task, in particular, we've reviewed on A, B, and C dates, and my expectation is that you should be able to complete it on your own now.   \n>  \n>Next week, I'd like you to take a stab at completing this task on your own. When you're done, bring it to me and we'll review it together to make sure everything is right. Please have this done by Thursday, and schedule 30 minutes for us to sit down together.   \n>  \n>Please let me know if you have any concerns or would like to discuss this further.  \n>  \n>Thanks,  \n>  \n>StrangeMistake5\n\nIn your conversation with your CEO, I'd focus on presenting it by saying something along the lines of \"I prepared her to do the work by doing X, she failed to do the work. I gave her feedback on how she did X, but she isn't listening to it.\" For example:\n\n* Donna is struggling with (quality of her work, timeliness of her work, total work output, etc)\n* I've provided training by doing X. She failed to learn the tasks.\n* I've answered her questions and coached her on her performance issues. She's failed to receive feedback and failed to perform even after given feedback.\n* She has an attitude that's demoralizing to my team. She's done X, Y, and Z. I've coached her on this. She has failed to receive the feedback.\n\nYou can present this as if you're soliciting feedback (\"I've tried all this, but I'm not reaching her... how would you handle it?\"), or just be frank. Feel out your CEO.\n\nThe truth is, you can do everything right and you can still either have to live with the situation or get fired. I would look for another job, because making a hire like this speaks to the quality of your company, and your fate is really out of your hands now.",
            "A lot of these answers are in the cultural vein of larger companies.  In small companies it's very different.  PM me if you want, I work on problems like these professionally for startups.\n\nHere are some important things to know about the situation:\n\n1)  Hiring, managing, and *especially* handling poor performance is very, very hard and very, very counterintuitive.  It's 95% certain that the leadership and CEO at your company are kind of inexperienced and shitty at it. \n\nWhy?  Because in a company of that size, they didn't get to those positions by being professional bosses / execs / recruiting / HR folk.  They got there because they're totally normally people good at the job in the industry (or good at starting a company, or whatever), who incidentally now have to take on this extremely difficult, unintuitive, and devastatingly socially awkward task.\n\nThe CEO might be intimidating with respect to the work, but with respect to handling Donna, think of him as someone just like you, with more power.\n\n2)  So this means a number of things:\n\na - Gavin probably also doesn't know what he's doing.  Changes are high that he knows the issue with Donna and is actually mortified, and is defending her because what else is he supposed to do?  I mean, imagine that you referred in a close person who you genuinely thought would be good, and they drive everyone else up the wall.  And there's ONLY 11 people there, so you know everybody else is secretly blaming you all the time.  How would you feel?\n\nb - Donna, in fact, is probably also mortified.\n\nc - The CEO thinks this is incredibly awkward because they've built up the business successfully based on trust and strong relationships, and now they have to tell this close bro that his wife is not cutting it.  They *really want* the solution to be easy.  Enough that some people will bury their heads in the sand or look for a scapegoat.  Others will figure out how to walk that boundary.  Depends on CEO's emotional intelligence, mostly, and experience with managing poor performance and making hard choices.\n\nd - All this adds up to:  Your problem is pretty much everyone else's problem too.  It's just that nobody knows what to do.  The fact that the work environment that's emerged isn't \"fair\" to you is actually kind of like the third tier of priority on the scale of the problem that Donna is intrinsically.  \n\n5)  So this is both good and bad.  It's good because you *actually do have a right and ability* to come out with your *real* issue and talk about it directly.  It's bad because the indirect ways it's affecting you don't really matter.  (Life in a small company is just never going to be fair-- there's too much unexpected shit like this flying around with too little infrastructure.  Instead, like volleyball, each team member just needs to handle the shit that flies toward them on behalf of the team.)\n\n6)  Senior leadership typically has a lot less direct power than people think.  Everything they do is systemically balanced against buy-in and established routines in the company.  Don't assume the CEO is not snapping is fingers because he has made the choice not to-- he may well be talking to you precisely to gain the context to maneuver himself into a position where he can make the move that you want down the line.\n\n...\n\nSo, what do you do about it?\n\n1)  Give peace a chance.  Start by assuming the best intentions from everyone, and that all 12 of you as a team really will fix this.  You know the saying \"it's not you vs me, it's you and me vs the problem\"?  This is exactly how small teams like this work.  Come at the situation from an attitude of it's you, CEO, maybe Gavin, maybe even Donna, vs the problem that Donna is not as great a match for the team as the team originally thought.\n\n2)  But don't let your trust lead you to be backstabbed or blindsided!  Trust but verify.  Still document all issues and verify all claims / promises, people do shitty things they wouldn't ordinarily do when faced with extreme social awkwardness.\n\n3)  Related to 1, be the solution, not the problem.  **The single biggest mistake I see people in these situations make is that they allow their resentment and fear drive their actions before they are verifiably betrayed.**  As soon as you make the conversation about your issues instead of about the company's issues, now all the awkwardness has an enemy to work itself out on: you.  \n\n3b)  Be a source of sanity, clarity, and \"everything is okay\" to the CEO, rather than a source of stress.  If he experiences you as another source of issues to be solved, as mentioned before, your problems are so much smaller than the problem of Donna that he's going to both feel like he has to resolve Donna without you, and also avoid you until he's ready to handle you.  This is a permanent loss of status.\n\n4)  Framing is everything.  Frame the Donna issue by taking the guilt and awkwardness about it.  Come up with a way to present it that shows genuine support of both Gavin and Donna, because CEO can't afford to lose Gavin on this.  Give everyone an elegant, empathic, happy out.  Tone of voice really matters.\n\nSpecifically, be the person who puts welcome, acceptable, relieved-to-say-out-loud words to the nagging discomfort the CEO is feeling.  (While representing your side of this, of course, still don't overstep your role.)\n\n---\n\nA script example:\n\n\"So, honestly, the past few months have been challenging.  Donna is {positive descriptors}, but she also comes from a different skill set.  I see her career in this space as being more optimized toward {different reasonable career direction for her that's true, like \"customer-facing relationships\" or \"systems-based rather than project based work\"} than {tactful description of what you do that Donna is shit at}.\"\n\n\"I've worked with her a lot to {way of saying 'teach her stuff' that is tactful but clear because it uses specific examples of how basic it is, such as \"show her slides, show her the X system\"}.  In that time, it takes 1/3 to 1/2 my time to collaborate with her.\n\n\n\"{More detail on how your work is affected from a company-first perspective, like \"I don't have enough time to output more than 10 widgets a day\".}\n\n\"Donna is concerned about {reframing of criticisms she's leveled at you that makes it sound like you're the adult putting her criticisms into the context of her own development, that also resonates with what's likely to annoy the CEO, such as \"how thorough our documentation is\"}, which is what makes me think that she's more culturally adapted to {something that you're culturally not that you know the CEO will stand behind, like \"a big company\" or \"a lower-risk environment\"}.  \n\nShe's also expressed to me a lot of times how much all this is stressing her out.  Do you think she might be happier / more successful if we tried to {whatever you think you can get away with, anything from \"partner her on Gavin's projects instead\" to \"find a role at competitor\"}\"\n\n--\n\nShort version:  Your script should\n- describe your experience in terms of what's good for the company\n- frame Donna's poor fit with respect to the parts where you collaborate in terms that the CEO resonates with\n- Be fundamentally benevolent toward Donna and Gavin",
            "Been there, done that, word of advice: Don't forget - YOU are the outsider here.  No matter how tactful you are regarding Donna, CEO will use YOU as the excuse to be rid of her, passing the buck on the responsibly so YTA.  What's that? Oh, *he'd never do that to youuuuu?*  He's the guy who hired her without checking her skills - and then pawned her off on YOU.  C'mon man.\n\nDon't say ANYTHING NEGATIVE ABOUT DONNA!  Make the meeting about your own lack of training ability - 'that's why we're always in one on one meetings'  CLEARLY I SUCK AS A TRAINER, maybe have somebody else take on the responsibility - like her husband.   \n\nBest way to CYA is to pretend Donna AND Gavin are in the meeting with you & CEO and not say anything.  Let them have the rope to hang themselves, time will out her.",
            "It's hard to know the state of mind of the CEO. From what you wrote it can go either way. If I were asked point blank about your co worker then I know my boss likely wants to affirm the direction they are leaning (firing her) and I wouldn't want to stand out from the people who made him think this way for the sake of the co worker, and it will look this way to the CEO if they have taken feedback about how bad she is and there you are, alone with her husband, in defending her.\n\nI'd be honest, and deliver it in the same way the meeting is going.\n\nIndirect Q - how is project x? Anything holding you back?\nA - the project is taking longer than usual as I am still helping new hire get acquainted.\n\nIndirect follow up Q - how do you feel she is coming along?\nA - It's great finding myself in a role to help develope others but as I am a new trainer I don't really know how long things should take on average? How do you think it has been going?\n\nDirect Q- What do you think about new hire?\nA - Co worker's wife? She is nice. How do you think she's acclimating to the role?\n\nYou want to nudge your CEO that you're aware of the complexity and politics of the questions. That you see other consequences down the road he wants you to go on.\n\nYour CEO is going to answer your question that everything is awesome. So slip in you're glad that all of the time you spend \"training\" her hasn't impacted their expected time or quality of your projects.\n\nOr that there are rumors, or problems, something negative... This is where you keep talking about time. Would the CEO like more of your time dedicated to her? Would they like you to dedicate more time to your projects? Is there a nominal amount of time for meetings? Time time time. How can you stop being productive and spend more time on this pet project? Don't say that, but this is the point you're trying to make.\n\nIf there is no problem in the CEO's eyes but others aren't getting along say you get the sense that interactions between her are a bit strained, but that's other employee's wife so there's an extra dynamic there. There are work clicks or inner circles sometimes, but this is a full blown marriage. I mean, they have legally privileged conversations with each other.  Make this part, and all parts of my reply, your own. Talk how you talk, you understand what's going on here better than anyone who read a few paragraphs. Mostly people gather the sense you want to be honest and move past this. Some people have experiences where this situation played out poorly. I am having you perform a subtle behavioral interviewing and trying to limit your words so you speak less.\n\nGood luck OP!",
            "i would take on the mentorship role as though it's your job.  set up meetings and some sort of structure to work with her and explain what you've been doing on projects she's now on.  if you keep it positive, then it's going to be hard to blame you for her failure.\n\nthen be honest but tactful with the CEO.  maybe ask that the mentorship be a shared duty, if it's going to make you miss deadlines.  having multiple perspectives really helps people learn anyway.\n\n>She's quite negative, complaining loudly that no one at the company has their shit together and I feel like she probably says the same things about me to her husband and the CEO outside the office.\n\nthe CEO notices this, rest assured.  don't complain, but be clear about this when you talk to the CEO.  \"she seems to speak very negatively of others in the office, and i don't know how i could best address it.\"",
            "I wouldn't say anything negative about Donna to the CEO, and I would give evasive answers to any prying questions. As far as Donna taking up all of your time, tell her that you need to concentrate on your own job, and she needs to concentrate on hers. Don't let her waste your time or interrupt you in meetings; when she does interrupt a meeting, just tell her that you are in a meeting and you don't want to be disturbed. You need to set some boundaries with her.\n\nI'd definitely keep my resume polished and my eye out for other jobs.",
            "This is a best case scenario for a work situation rife with nepotism! 100% chance he wants to talk about her, possibly other dynamics of the situation. This is your opportunity to plant the seed for him to do what needs to be done without actually saying it. Just answer honestly, whatever is asked of you and don't expand outside of what is asked. She is already on the way down, can't imagine CEO is a dumb guy and would let such an unqualified person stay. \n\nI think there is an even better opportunity here: You have proven to hold more value, you obviously understand the politics and respect and preform for the interest of the company. You deserve a raise after this bullshit and a significant one at that. She just made you look like even more of a rockstar by merely existing as a failure in the office. Take what's yours my friend.",
            "> However, the CEO booked a 1:1 with me next week and if he asks me about Donna I'm not sure what I'll say\n\nSay that you like her as a person (even if that's a lie) and that she's really trying to learn, and you are trying to teach her.  But she's lacking confidence and things that she does know she often needs reassurance that she's doing correctly.  Also she sometimes speaks negatively about others, even though she's still new and just learning herself. \n\nAs a result of that she's taking up a lot of your time and while you defiantly appreciate someone coming on to help with your workload, she's not yet at the stage where she's adding value.  Rather she's taking more time than she's saving.  Say that you think there might be potential in her but she lacks some of the basic skills you'd like to see in a new hire.  Make explicated mention of the fact that you're giving her the benefit of the doubt because she's Gavin's wife. \n\nSee what he responds with.  He may say that he's seen the same things.  If so, inquire if he has advice about training her?  How to build her confidence so she feels more comfortable doing things on her own without interrupting you during meetings. I might go so far as asking the CEO to see if he can get any insights from Gavin on this problem without it coming out that the criticisms were coming from you. \n\nIf he asks what your feelings are about her future, this is your chance to bring up the company culture and your feelings as an outsider.  Just say something simply like, I love working here but everyone already knows one another.  Honestly, that's part of what I love but sometimes I still feel like a bit of an outsider trying to break into a club.  Where she's Gavin's wife and his (the CEOs) friend you don't really feel super comfortable expressing an opinion on that.  Plus she's still new and deserves an opportunity to learn before being judged.\n\nAt the end of the day she has what's known in business school as informal power.  So you kind of have to treat her as both your superior and subordinate.  So it's not your call to hire or fire her, so just don't concern yourself with that.  If you are doing some training with her, ask about how to do that better.  Talk about the areas where you feel like she is falling short in a way that sounds like you asking how to fix them.\n\n> so I think my best strategy here is to wait this out and try to stay calm\n\nSort of.  You don't want to be inactive because there's the possibility that she's causing others to blame you for her failings.  Being critical of others is a key sign that she's likely critical of you.  Don't shy away from telling the CEO that you've noticed problems X, Y and Z but do try to frame it in a way where you're asking for his guidance rather than throwing her under the buss. \n\nBasically you are attempting to show the CEO that you do see failings in her, but that you are doing your best to get her up to speed.  If he wants to let her go, and anger Gavin, it won't be because of you. \n\nIf he does end up letting her go.  I might mention something in passing to Gavin, say how sad you were to see her go and how you tried really hard to bring her up to speed.",
            "I would pre plan meetings with her, say every Monday and Wednesday  for an hour each. have an agenda for the meeting to discuss actual work you are both doing together and leave wiggle room for her to vent. Plan another actual meeting with other folks right after you meeting with her in the exact same room so that the other people come in and she needs to leave.",
            "To CEO \"Due to the personal situation, I feel uncomfortable giving a personal review. I hope you understand and respect the situation I have been put in.\"  \nIf she's bad, the CEO will notice and have the remedy the bad situation he's unfortunately put himself in. Refusal to comment is a comment on it's own. You wouldn't pause to say shes great if it was true. She complains alot maybe she doesn't enjoy it thier and isn't cut out for the \"unorganized\" enviroment. It's his problem though to sort that out.",
            "Step 1 - start applying for jobs elsewhere.  You're in a lose-lose-lose situation here and you need to cover your ass when you either get fired for her incompetence, get fired because they have to choose between you and her, or decide to just absorb the bullshit and realize you can't take it anymore.",
            "1. Donna sounds scared that she can't meet expectations which can heavily impact someone's performance.\n\n2. You don't know the whole situation and you don't see all of the work she does.\n\n3. She's panicking at you because she trusts you. In some ways, you might need to take off the training wheels and stop totally bailing her out. Instead of just showing her how to do something, guide her in the right direction and let her figure out how to do it from there. When you train someone something, have them do it and talk them through the steps, and then ask them to show you how they remember to do it by doing it again. Then follow up later and ask them again how they do it, because never assume they learned the first time. This is essential in training.\n\nYou are right, wait it out, don't get involved, don't get too personal, and focus on your own work. If you aren't her manager, it's mostly none of your business. Get your work done, help her in the mostly hands-off method I described, and she'll either sink or swim.",
            "[deleted]",
            "Just be honest in the meeting: \"donna is obviously trying very hard to do a good job, she ask questions when she has to and she wants to perform well. However, she is obviously behind other people and I think it would be at your discretion as CEO to decide if its worth having other employees slow down in order to help her.\"",
            "If he asks you about her, be honest and stick to work-related impact. Keep it impersonal.\n\nIf he doesn't ask about her, don't stick your neck out. Stay out of office politics. You've judged that complaining about her in this workplace would be a risk, and you're the one who's in the best position to judge that risk.",
            "Be honest, but fair and as impersonal as possible. Focus on her ACTIONS and not HER. So instead of saying, 'Donna is annoying and distracting' try saying 'Donna does not seem to retain information when she is trained, and repeating the training seems to be wasting both my time and hers'.\n\nI had pretty much the exact scenario a few months ago when I was asked to train a manager's son. He wasn't a negative person, I actually like him as a person, but he was like a human etch-a-sketch - he'd come in the following day having forgotten totally basic skills, like how to find stuff on Excel etc. I had to have a very similar meeting with management - I focused on how he was a really great guy, but perhaps not entirely suited for this role, and it was beginning to affect my work.\n\nIt's important not to be openly negative, as you want to maintain the high ground here and be seen to be doing everything in a fair and impartial way.",
            "Wait it out. Let her inadequacy make the statement. If the CEO asks questions tell the truth as tactfully as you can stating only facts, leave out emotions and feelings. Fluff yourself up by telling them what you have done to try and bridge the problem, be expansive with that.",
            "During your meeting, keep to the facts. Do not share your feelings. I would prepare a list of the times she’s asked for help, what skills she needs to develop, the number of times she interrupts meetings, etc.",
            "With regard to how you speak to managers regarding Donna, Just be sweet as sugar about everything you say.  This doesn't mean that you need not say anything negative, just make it extra nice, like she is someone you wish the best for.  For example, Oh Donna is really working on being detailed.  We had a few hiccups in her last report, but I spoke with her about them and now it's looking like she's doing well with it.  Or stuff like, she has the best intentions with regard to her work quality.   For the long meetings, you could say how she is very interested in guidance from management.   Best wishes.",
            "Keep your distance. She’ll implode eventually.",
            "I worked with my supervisors husband and it was a nightmare. They both ended up getting fired, but it took eight years. When I was especially annoyed at my coworker, I would go to my supervisor and say  \"your husband is doing this\", or \"why does your husband do that\". \n\n It annoyed the hell out of her that I  kept bringing up their relationship.  Jump ship if you can. It's a nightmare situation.",
            "I don't have any answers, but I think it's really cool that you are working so hard to try and make this working relationship be better instead of running out the door or complaining. I hope your colleagues recognize how you handled this difficult situation with grace and made a real effort.",
            "I have personal experience with this type of thing and if the CEO doesn’t bring her up at your meeting I strongly suggest you bring it up. You’ve been put in an impossible situation and this will not turn out well at all. I kept my head down for two years and did everything I could to work well with my boss’s wife, but no matter what I did she was continually jealous of my competency and how her husband was so pleased with my work. In the end her jealousy exploded and she accused me of attacking her verbally and having “too close” of a relationship with her husband (neither of which were true). It permanently damaged my working relationship with my boss. She left for a while but then after six months of miserable tension with my boss I ended up quitting and as soon as I was gone they brought her back and now she’s wreaking havoc without me there.\n\nNip this in the bud before two years pass by and something completely ridiculous blows up in your face because of her incompetence. Right now you have the upper hand. Nepotism is dangerous business and you don’t want her to put down roots in your workplace.",
            "Wait, so you didn't get to interview her and she was just thrust on you?\n\nWhat the fuck?  I would be in the CEOs office and tell him what's up. \"This is effecting my productivity, she's not qualified and should not have been hired\" is what you can start with.   If the CEO isn't professional enough to deal with this because of personal relationships then your company is likely not well led anyway and you should find another place to work.  You'll likely get a raise anyway ;)",
            "When you have the meeting with the CEO just be extra quiet and steer the conversation towards you helping out the new person and that is why you haven't been able to perform at your best over the last few months etc.\nGrey rock time.",
            "I would frame it as \"these are the difficulties I am having, do you have suggestions as to how I can approach? Is there a way you would handle this? How can I course-correct?\" Because then the conversation is less about her being bad at her job and more about how you're trying to work with it. It addresses the issues but in a proactive way, rather than complaining.",
            "Pm me. I'm living this exact nightmare and my tactics have been a little untraditional...\n\nBasically, if you go against the romantic partner of someone important... You will be the one who gets fucked over. So tread lightly and remember that there are strength in numbers.",
            "Do you think she will be incompetent forever? Maybe after a while she will catch up enough to be decent help?",
            "Instead of focusing on your own response, try focusing on asking the right questions. That could force the CEO to not beat around the bush too much, but be careful not to let your hand show when asking these questions. Think about how you phrase them, what the response will be etc. That makes you come off much better than neatly packaging your opinion",
            "my friend had a similar situation in a larger company (large enough to have an HR dept). She told them how stressed she was and how grateful she is to have the help, but this new temp has been CAUSING more work than they're doing and now she's even more behind.\n\nHR laughed and said we call those people \"makeswork\"s, and the temp was gone the next morning.",
            ">lacks the basic skills necessary to do her job \n\nLet me guess, she can't even navigate basic Microsoft Office programs?",
            "Been through something similar really recently myself. IF the place isn't totally dysfunctional (and I don't think it is, otherwise you wouldn't have been happy there prior to her joining) then she'll probably eventually get pushed out, and it's your job right now to keep your nose clean. Keep in mind that the CEO probably feels backed into a corner right now - he wants to keep the peace at least as much as you do, and he wants his business to keep being successful.\n\nYou need to frame everything as trying to find solutions. You really want her to be up and running, but you just don't have the bandwidth to train her, and that's impacting all the projects she's on with you. Is there anything you can be doing better? Is there anyone else who can help take some of the load off in getting her comfortable? Is there some third party training the company could get for her? What's an appropriate amount of time for you to spend on working with her to get up to speed when you're also working on X, Y and Z?\n\nIf you frame it this way, trust me, he'll read between the lines, but it will also give him a psychological 'out' to maintain harmony while the situation plays itself out. If you can keep it together and unfailingly professional while it does (while also maintaining strict boundaries with her), then you're only going to look better in the end, and she'll find another job in due time.",
            "Either find a new job or document everything.  The meeting times, the topics, the work, everything.  The key here is not to put it in a burn book, but in considerate, detailed, direct emails with the wife.  \n\nIf the CEO and you have a conversation about her or any slip in performance or deadlines or priorities let him know roughly hope much time you're spending on her and offer to send him the follow up emails or cc him going forward.\n\nAlso be prepared to talk about overall priorities that will slip now that you're spending so much time on this new project.\n\nDOCUMENT ALL THE THINGS.\n\nReally though, find a new job.  If he's bringing her in he's unlikely to want bad news and his judgement is questionable anyways.",
            "If CEO in a such a small company has not caught on the issues you have mentioned, either the impact is not there, or it is being overlooked. In both cases, establishing boundaries, mentioning it to the manager, or having a \"frank\" discussion may resolve the issue; however, there are also serious consequences to consider if it does not. \n\nFinding a new job would be a great way to resolve it - you deserve better than this!!! But it may not be an option. If this is not an option, than risking the blowback from taking corrective actions is not justified in my view.",
            "if i was in this situation i would let her know i understand the work can be complex and hence would arrange a meeting time with her every afternoon for 30 min to go over what task she has and discuss a plan \n\nu arrange the meeting time to suit u\n\nif she comes to u out of that time slot.. acknowledge her enquire and tell her u will talk about it in yr meeting \n\natm she is controlling u, change it up so u control the situation",
            "Definitely bring it up to the CEO in a 1:1 since you are in a small company.\n\nA quick question of \"How do you feel Donna is doing getting acclimated?\"\n\n\"I'm trying to help her get up to speed, but it's been a bit challenging and somewhat time consuming.  Is there more I should be doing without letting it affect my performance?:\n\n\"Has Donna spoken to you about how things are going. The other day I heard her and she seemed frustrated which is unusual for employees here\".\n\nQuestions like that will show whether it has hit your CEO's radar or not, and in a small company it should have by now.  He should be able to give you direction on whether you just need to wait it out or if you need to help more. If it's not a good fit, these issues tend to get resolved by themselves or by management.\n\nIf fingers coming pointing at you, then you may need to look at exiting the company if the company culture has turned against you.",
            "Be completely honest in your 1 on 1 with him. Let him know that you aren't Donna's trainer, and that Donna needs to pull her weight, and that every little thing she brings to you makes you question her ability to be a productive employee. It's begun to effect your work because you spend so much time digging her out. Stick to her work, say nothing of the nepotism hire or how you feel about Donna as a person.",
            "[deleted]",
            "Why does not every Reddit post have TL;DR part at the beggining? It s more efficient",
            "\"Your wife is terrible at her job and here's why.\""
        ]
    }
]