[
    {
        "post_id": "34ez2x",
        "author": "familywoes225",
        "title": "My (26m) family just discovered my fiance of 5 years (27f) is MTF. All hell broke loose.",
        "url": "https://www.reddit.com/r/relationships/comments/34ez2x/my_26m_family_just_discovered_my_fiance_of_5/",
        "score": 2572,
        "num_comments": 482,
        "created_utc": 1430410932.0,
        "selftext": "I want to make this as quick as possible. My girlfriend, Annie, is MtF. She started transitioning early on in our relationship, but honestly, not that much changed. It was a year before she met my family due to timing, location, etc. They all loved her though. We eventually moved closer and she spends a lot of time with my family, especially my brother and his kids and me. \n\nAbout two weeks ago, hanging out at a backyard BBQ with my family, some of her friends, etc, the subject of kids comes up. Annie and I are not having kids, as we're not interested. But someone came up with the whole \"Oh you'll love them when their your own\" stuff and Annie just smiled and said, very politely, \"Oh, I can't have children. And I'm not interested.\"\n\nSo the nosy nelly pressed, asking why not, why doesn't she try IVF, etc. Annie just said, \"Well, I don't have the parts, for one.\"\n\nNosy Nelly, confused, asked what she meant.\n\nLet me preface this next part by saying that we never purposely kept that she was MtF away from the family. It just never came up, and it's not like it's their business. \n\nAnnie said, \"Oh, I was born with male genitalia and all that, that's all.\"\n\nNosy Nelly thought she was joking, but eventually caught on. Her entire demeanor changed. She got up and moved, she started whispering with other people. But no one had the audacity to say anything to us.\n\nTwo days later, a message on Facebook:\n\nNosy Nelly:\nHi. I'm sorry to inform you that I'm no longer comfortable with having Annie babysit the kids anymore. I'd also like it if you could please keep me informed if she is attending any mor BBQs or events. I don't feel she's a good influence to have around my children.\n\nI was shocked to get this and didn't know how to respond. As the day went on, a few more messages like that came in. I haven't told Annie yet, because I want a chance to fix this or do something before she finds out. \n\nAny suggestions?\n\n\n   \n**tl;dr**: Family discovered my long term gf, now fiance, is MtF. Some of them are starting to say they don't want her around their children or at family get togethers. What do I do?",
        "permalink": "/r/relationships/comments/34ez2x/my_26m_family_just_discovered_my_fiance_of_5/",
        "comments": [
            "\"Your loss.\" Block and unfriend. And go to any event she is invited to, without checking with nosy assholes.\n\nYou'll need to tell Annie very soon. Ask her if she would like to contact them or do anything. Otherwise, your family, your problem, you run the interference between them and her. Good luck. ",
            "[deleted]",
            "You can't fix this. Talk to Annie and make sure she knows you will stand by her, then respond to the messages as follows. \n\n\"Dear Nosy Nellie,\n\nI have no idea why you no longer feel comfortable with Annie being around the kids. We have babysat, interacted, genuinely loved and cared for my niblings. Has Annie said or done something to offend you? Because it seems like the only objection you have toward my fiancée is the status of the genitalia with which she was born.  If that is the case I cannot remotely understand why the kids would be interested or affected by what's under Annie's skirt any more than what's under yours.\n\nI love Annie very much. She is the best woman I have ever met, her status at birth notwithstanding.  And you or anyone else who makes me choose between them and Annie won't like the outcome.  So no. I won't be informing you of whether Annie will be present at any family functions ahead of time as if she's a sex offender.  Any person who doesn't welcome my fiancée can go ahead and strike me off the guest list as well. As for the kids, they are in no danger from Annie.  The only bad influences they have in their lives are from small, close-minded ignorant people like you.\"",
            "I'm not sure we have enough information to really say. How close are you with your family (i.e. how often are these gatherings)? How many people are at these gatherings and how many objected? Who hosts them? How close are you otherwise with Nosy Nelly?\n\nIn general, just be upfront with Nelly.\n\nFor example, my instinct is just to say \"I'm sorry if you are uncomfortable around my girlfriend. But I don't feel that it is reasonable for you to expect me to give you notice of when we will be attending family events.\" Then just see what happens. (I would let Annie know immediately though. She is probably used to prejudice and may have some advice and preferences on how to deal with the situation.) Best case she just gives you guys the cold shoulder for a while and then things just blow over after the shock wears off.\n\nHowever, you sort of imply that you had several other people make comments. If the host of the parties is likely to be a problem, or there is enough people objecting that it would be a hostile environment for Annie to participate, then you might have to draw a line in the sand about it. Make it clear that you find their comments bigoted and that if they want to exclude your girlfriend that they are excluding you as well. Again, consulting with Annie earlier rather than later is probably best here.\n",
            "I'd tell Annie about the messages and then ask \"How do you want me to handle this?\" Your SO might want you to cut ties or she might want you to try and work it out. She is the one being slighted so let he decide how to handle it, you just need to be willing to stand up for her and work with her on handling it. ",
            "Okay so I'm gonna recommend a slightly different suggestion from everyone else. Before I do let me say of course that what nosy Nellie did was totally unacceptable and you have every right to completely cut her out of your life. However, this might be an opportunity for promoting openness and understanding. I would give her one chance, and send an email explaining how much you love each other, how wonderful your fiancé is, and how hurtful her comments were. \n\nSometimes a little unreciprocated understanding  and love is all it takes to help someone lose their hate. Sometimes not. If not, then yeah, tell her to fuck off and that you don't want any immoral degenerates like her around your new family. ",
            "This is my advice for dealing with bigots: be better than they are. Continue to act loving and kind, be patient, and assert for yourself without being confrontational. They may never catch on that they are the ones in the wrong, but you will know that your lashing out did nothing to exacerbate it.\n\nI think, rather than assuming you know why your gf's MTF status upsets them, you should just ask them. Say, \"I don't understand, in what way is she a bad influence on your kids?\"\n\nSee of you can get them to talk about it. Do they think its contagious? Send them some studies. Do they think is just unnatural? Send them some studies. Do they have a religious objection? Seek out some LGBT-Affirming religious resources / verses / blogs (I can help with that). Do they equate it with something they would consider deviant sexual behavior (like fetishized cross dressing)? Send them some medical information about gender dysphoria. Do they think someone who is GSM is more likely to be a sex offender? Send them some data. Or do they just feel betrayed and lied to? If so, maybe express some sympathy and explain that it was a private matter that you all had not planned on discussing with others. \n\nFind out what is the root of her prejudice (and that of the others in your family) with an open heart before addressing them. Escalating to confrontation will not improve the situation, but kind, patient responses armed with clinical data and delivered with love can prevent this from tearing a real rift between you all and your family.",
            "This is already a HUGE thread, so this will most likely get lost, but here goes:\n\nHere's an important component of your response to Nosy Nelly:\n\n>Annie is my girlfriend and you can expect her to be at any event I am attending. \n\nYou are not required to give that person any \"warning\" whatsoever, and most importantly, you make *them* be the bad guy and throw a fit if they're going to. Whose house do these BBQs happen at? As long as the host of the event is cool with Annie, Nelly can STFU. If it's at Nelly's house, I would decline any invitation until/unless Annie is welcome. \n\n**Where are your parents in this? Or even your brother?** Everyone's family is different, but I notice you specifically don't mention what relation Nosy Nelly is. Maybe your parents have passed, or are otherwise not in the picture, or just not nearby and at these gatherings. But it seems to me that if you can have them as social allies, that will help you navigate what may become an ugly family politics situation.\n\nYou said you never wanted to hide Annie's transition, and I think that's fair. But it's come up now, so you probably need to plan for conversations about it. And it may be a good idea to start some of those conversations yourself, as opposed to waiting for others to come to you. The people that do bring it up to you will probably do so to pick a fight. The people who are confused but not against you won't know what to say.\n\nI'm going to take a stab in the dark and guess that if you're marrying Annie, you have at least one other family member who will accept Annie now, without much question. Sit down with them, tell them something like:\n\n> We weren't trying to hide anything, but yes, Annie is transgendered. If you liked Annie as a person before you knew that fact, please remember that Annie is in fact that same person you came to like. And actually, her transition is part of how she became the awesome person I know and love.\n\nEssentially, you're going to need allies in this. And you're going to need to know who those people are, soon. The cat is out of the bag, and make no mistake, people *are* talking about. So you should talk about it too. People are going to have awkward questions, some people may take a while to come around, and realistically, some are simply going to write you off forever. Which as people have already said, good riddance.",
            "These family members sound like horrible, hateful people. Tell them they're no longer welcome at your family events.",
            "Damn. I love it when people find out and completely disregard all previous encounters and experiences with a trans-woman.\n\nI bet they also ask you if your gay now right?",
            "\"I'm sorry to hear that. What has changed?\"\n\nThen let them tell you and cut them out forever.",
            "Holy shit. Nosy Nelly's behavior isn't justified at all. Your girlfriend hasn't done anything to make NN question her I fluence over the kids she's babysitting. NN is a huge prude.\n\n\n\nThe right thing to do would be to reach out to NN, because it sounds like she's only acting this way because she doesn't understand your girlfriend or what she has went through. Offer to visit with NN to answer questions she might have, to get her to see that there isn't anything wrong with your girlfriend.\n\n\nThough you could go down the road of ignoring her, maybe sending her a message back explaining why you're going to ignore her. \"I don't want to be around someone who is willingly being ignorant to something that isn't your business anyway.\"",
            "\"You should safely assume that Annie will be attending any event I am invited to. So rather than have us notify you of our intent to attend, I recommend you speak to the host of any gathering to determine whether I have been invited, as we are not inclined to police ourselves in the fashion you suggest.\"",
            "'Those who matter don't mind, and those who mind don't matter.'\n\nThere is nothing for you to fix because neither you nor your fiancée are at fault. Tell your SO what's happened, that you support her 100%, and ask her what course of action she would like you to take. The most important thing is that you don't waver in your support to your SO- this might require you to cut people from your life or disinvite them to the wedding. Be prepared to do that if it comes to it.",
            "I have a neighbor who is gay Alfred, and his friend Dursley (?! dont ask me I dont understand) is another neighbor who is a huge homophobe.  \n\nI once mentioned to Dursley that I was going to ask Alfred to babysit my kids (boys) for a few hours that weekend.  He freaked out on me and told me that he would NEVER leave his kids alone with Alfred because *gasp* HES GAY! ... my response was \"so I should be afraid to let your wife babysit?\" He said no no his wife is wonderful! and I said, yeah but she's attracted to males too, so shouldnt I worry? NOPE apparently being gay makes you a pedophile.  \n\nMany people do not care to understand the lives of others, and it is very sad that they equate anything other than what they think of as \"normal\" with pedophiles and rapists etc.\n\nI agree with all the advice here to just cut your losses and inform them you will not put up with their bigotry, and that you will continue to attend any family functions you are invited to.  (Unless of course you think it would be a hostile environment for Annie of course.)  Also, tell Annie, I seriously doubt this is the first time she has dealt with bigotry, and especially people assuming pedophilia/rape/lack of morals etc.  It's a very common theme in bigotry.",
            "Check out /r/mypartneristrans for people who experience similar stuff.",
            "My wife is MtF, and we similarly haven't told my family. Hearing this just absolutely infuriates me that people could react this way.\n\nI've long since decided that if someone in my life, even if it's my parents or siblings, reacts like this when/if they find out that she's trans, they can bet on never having any sort of contact with me or my wife ever again.\n\nPersonally, I wouldn't try to hide this from your fiancee, she's surely used to this sort of reaction, and it will help her not get caught off guard by two faced people near you. I would further completely excise these people from your life, and refuse to even acknowledge their existence from here on.\n\nThere is no excuse for this sort of reaction, whatsoever, and I would not tolerate it.",
            "It's not so much \"my family found out about Annie, and all hell broke loose\".  It's \"I found out that some of my family are jerks\".  ",
            "Uhhh you should question Nelly on \"What is inherently different before hand to now that makes X unable to look after your kids? She was a good influence before you pressed the issue, like a rude person, and after pressing you decide she's a bad influence? What gives?\"",
            "You need to cut contact after a basic shaming. I say this alot, and I will admit I'm sometimes spiteful. Maximum damage is achieved when you just never respond. It drives people up a fucking wall. People seem to handle hatred better than being ignored. If you can work a bible quote into your break-up, bonus points. Until you get the text that's just -\"I'm sorry, what can I do to be better,\" do not engage. I personally think after you get the text admitting what they did is wrong you should try to begin the long and slow process of rebuilding that relationship. It's totally your right to never speak to them again, I get that, but I try and believe in a fundamental ability for people to change. ",
            "\"Good, because I don't want the person I love and care for around hateful bigots. Stay away from us with your small-minded judgement. Everybody wins.\"",
            "I know a lot of people are recommending a more confrontational approach but I really think this is the best. \n\nDon't respond, don't ever mention that you got this message to anyone. Carry on as if this message never happened. Be nice to NN, sugar nice. Let them stew over whether or not you even got the message. Let them ponder whether they should send another one or risk going unheard. Because it sounds to me like this person LIVES to stir up self-righteous drama. They are so proud of themselves for standing up to evil (or whatever their small petty minds are thinking right now), let them wonder if their protestations are lost in the ether. \n\nThen be nice (but a little distant, just to make them wonder) at family gatherings and smile and let them wonder. \n\nNothing stings like being ignored. ",
            "Go to every freakin barbeque that they have and tell her every time.",
            "Your relatives reactions are regrettable, but not unexpected. And while there is nothing wrong with you or your girlfriend, i think you could have rolled this out better. \n\nWhen people are suprised, they react in ways that are not always logical or reflective of their normal behavior. You could have potentially mitigated this by informing your family regarding you and your girlfriend's situation, and providing resources to provide greater context. If you are still interested in continuing your relationship with your folks, you could *still* do this. \n\nThat is why what some folks are saying regarding shaming or shunning may be counterproductive, come off as petty, and ultimately not in your best interest.\n\nDan Savage talks on his blog about how in the process of coming out, you should give your family a certain amount of time ( like a year) to get their tantrums out of their system before deciding to cut them off. That may be an approach you want to consider.",
            "Maybe instead of being quick to throw these people to the fire, you could use this as an opportunity to educate them? Ask them what exactly makes her a bad influence for them and then attempt to quash any misguidances or fears. Most bigots are just people who've been fed false stories about these people without ever meeting one. ",
            "*Dear Nosy Nelly,*\n\n*Hi. I'm sorry to inform you that I'm no longer comfortable with having you around us anymore. I'd also like it if you could please keep me informed if you are going to be in our neighborhood or attend any of our events. I don't feel you are a good influence to have around.*\n\nBut seriously, fuck her. Annie is a woman. Don't tell her about this because it can only hurt her. Just conveniently forget you have a relationship with Nosy Nelly and, if you ever see her again, chew her out for being a bigot. Ask her when she'll learn how to respect people and have an apology for your fiancee. ",
            "I would tell Annie everything NOW. And then keep on going to those BBQs without telling Nasty Nelly beforehand. She's the transphobic one, she's the one who has to deal with it.",
            "Haha you are handling this more maturely than I would. I'd screenshot the conversation and expose her on social media for being a huge bigot. But that would just push people away even more, so don't do that. I'd send a response like this, \"Nelly, I'm not sure I understand. What did Annie do to you that made you feel uncomfortable?\" and get her to admit flat out that she's a bigot. Respond, \"I see. Annie is a wonderful, gracious human being who has been so kind to your children. Your concern with the status of her genitalia is rude, intrusive, and quite frankly, none of your business. If Annie didn't actually do anything to you, then I'm not sure what I can do to help you. If you are unable to treat her with the same decency and kindness you would treat any other human being then you should be ashamed of yourself.\"",
            "As unfair as it is the way Nosey Nellie treated you and Annie, your reaction to the situation will set the tone for the future of your relationship with your family.  Rage-quitting and calling them bigots may be cathartic, but it's likely to alienate you from your family and cause people to start taking sides which is ultimately destructive to you, your relationship with Annie and the entire family.  I've seen it in my own family.  Even the people who love you and Annie may avoid you just to avoid family tension (especially older members of the family).\n\nI would encourage that you tell Annie immediately.  Regardless of how you handle the situation, she is at the center of it and needs to be made aware of the situation.  It's up to her whether or not she wants the attention and responsibility that comes with educating your family on trans issues.  The very last thing you want to do is to (unintentionally) make Annie feel like she is the cause of a rift in your family.\n\nRegardless of what people are saying here, you CAN change a bigot's mind.  Doing so requires kindness and openness, not aggression and putting them on the defensive.  Especially when their negative reactions are due to fear and ignorance.\n\nFor those relatives that have expressed negative feelings about Annie, it is important to let them know that you are upset with their comments, that Annie is important to you and that you will not be adjusting your behavior based on their comfort levels.  Don't close off all communication and don't put them on the defensive by calling them names or saying something you will regret later.\n\nIf their offensive behavior continues, it may be appropriate to end the relationship, but please don't let that be your first option.  As others have said, trans acceptance has lagged way behind gay acceptance and if you had any indication previously that your family had transphobic thoughts, dropping Annie's transition on them in such a casual way was bound to illicit a reaction.  The way things *should* be isn't always the way things *are* and coming out to friends and family is still something that needs to be handled with tact, even if it was they who initiated the conversation.\n\nAnyway, congratulations on your engagement!  I hope you and Annie have a happy and healthy life together regardless of your family situation.",
            "People are assholes.\n\nI'm glad you and Annie found each other and have a beautiful life together.",
            "Just wanted to say I'm really happy with OP and the reddit community in general on this post.\n\nYour future wife has honestly probably been through a bit of this, but if she hasn't, she has a right to know that no matter what *she* comes first in your life now.\n\nTell her that you received some offensive messages, and that you will no longer be having a relationship with the people that treat her like she's inferior in any way.  This is how I handled backlash when people took issue with my wife.  She is cis, but because she couldn't cook and she was quiet some of my family rejected her.  I rejected them right back and our marriage is still wonderful after all of these years.\n\nYes, it hurts to find out that loved ones are cruel, but at the end of the day they're just blood.  Your spouse is the person you *chose*, and you commit to hold above all else.  Communication is part of that commitment, even during the not so great moments in life.\n\nYou aren't a lone wolf anymore.  You work together, and make sure that whatever move you make in life you at least *try* to agree on.\n\nCongratulations on your future wedding!",
            "Fuck your family.\n\nTell them to get te fuck if they can't respect your mate.  That's what I'd do.",
            "I would explain how she was born a woman with the wrong body parts. As someone born with a deformity is changed or someone who has say cancer has body altering changes, they remain the same gender regardless of body parts.   ",
            "I'm surprised they bothered to write \"she\" in the letter at all.  Maybe there's a bridge half crossed and Nelly needs a little help to get over the rest of it.",
            "Reply:\nHi _____,\n    \nI just wanted to thank you for your message/note/letter. You may have thought I would have been hurt or angered by what you said, and please don't get me wrong, I am, but I am also grateful to have this opportunity to see who in my life does not deserve my respect, love, or loyalty. \n\nAnnie and I are so very fortunate to have an amazing circle of family and friends with whom we share our lives. Our relationship has flourished with their support and our love for each other. It is truly unfortunate that your own misconceptions, ignorance, and complete lack of common and fully accepted medical science has lead you to make the decisions you have, as you are the one who will be missing out.\n\nI regret to inform you I will be unable to let you know when and where we will be due to the fact I have decided to no longer have any contact with you, under any circumstances. From this point forward I will have you blocked on all social media, will ignore all phone calls, text messages, as well as any other forms of communication. If we happen to be at an event or gathering, you are more than welcome to leave, or stay, we really don't care.\n\nAnnie and I couldn't be happier and who knows where our futures will go but I can say with 100% assurity I will be forever grateful that her presence in my life has allowed me to see the true colours of those around me, some good and unfortunately, some not so much.\n\nThe only tragedy I see in any of this is your poor children. You of course are free to believe what you wish, but I implore you to reconsider pushing your ignorance onto them. They deserve a mother/father who will help them to reach their full potential in all aspects of life, including compassion for others.  \n\nWe wish you no ill will, and hope that some day you will begin to accept diversity and the unfounded hate and anger towards undeserving people will subside.\n\nThanks again,\n\nAnnie and familywoes225\n\nEdit: could someone tell me why my post looks like that on top, if it looks strange to you. Fixed it.\n",
            "Annie isn't broken,  they are.  I'd let Annie know the decision and your decision to stick by her side.  They don't want to be involved,  it is their loss.  I'd probably also tell nosy nellie that often what we don't understand is confusing and scary.  Offer to help educate her if she would like more information or direct her to some websites.  Be sure not to get into a battle of who is right or wrong,  just information,  if she wants it.  After that,  be done with her.  Focus on you and your fiancee and those that support you guys, no one else. Best of luck! ",
            "I got quite upset reading this. I hate bigots. \n\nI'm sorry but it really is their loss. Your girlfriend sounds  amazing. Don't let the bastards grind you down.",
            "You and your fiance have your life.  You have no obligation to keep nosy bigoted assholes in it.  Ask fiance what she wants to do, but I would say something like\n\n\"I'm sorry you're too narrow-minded to accept people different from you, but I'm glad you signaled to us that you are a person who doesn't deserve the privilege of being involved in our lives.  If you don't want to be around us that's your problem and you'll have to find a way to deal with it.\"\n\nThis is going to have to be you going to bat for your fiance.  As a gay man, I know what bigotry can look like a little bit, but transphobia is a different beast.  She's going to be incredibly hurt personally, and will need to know that you love her and have her back unconditionally.  See what she wants to do, but this is pretty much a line in the sand moment.  Either people are willing to be accepting, or willing to learn to be accepting, or not.  Nosy Nelly seems like she's in the \"not\" camp.  Which means there's no compromise.\n\nAlso, \"I'm not comfortable letting Annie do me favors by babysitting my kids\"?  What an entitled cunt.",
            "Good grief why the fuck does it matter what parts she has or had in the past. Presumably her genitals didn't play a role in her babysitting before they knew so what on Earth is their problem now they know what her genitals *are*?  \n\nThis is your time to shine and support her man, don't let these people touch her in any way - physically or emotionally. Before lashing out I'd discuss with her what she wants (as its her situation) and present as a united front. Don't go to any of their bullshit BBQs either, have your own and invite all the good human beings you know and exclude these losers.",
            "You: Hi. I'm sorry to inform you that you're a bigot, and I'm no longer comfortable having you around Annie anymore. Your kids are OK, though as they get older I might not be able to allow them to hang around Annie if you've brought them up to be bigots too. I'd also appreciate it if you took a trip somewhere where you are minority and got a small taste of how you are treating Annie currently. I don't feel like you're a good influence on society.",
            "\"Sorry, do you mind telling me what this is about? As far as I know, my fiancée merely told you about a birth defect she was born with that she has since had corrected. I was born with webbed toes which I got fixed, do you not want me around your kids either?\"",
            "I would what to know how other family members feel. If they agree, and *if* they do. Cut those people out of your life and Annie's life and good bye to them. No further explanation to family is required.\n\nYou've chosen to make Annie a part of your family, your family is choosing not to part of *your* family any longer that's on them.",
            "Send a mass email to your whole family, name the people who have came out of the woodwork.  Don't make the email mean sprinted, focus more on being sad.  Just calmly and coolly state that due old fashioned, bigoted,  world view surrounding the gender identity of your girlfriend it has become the responsibility of anyone holding a family event to uninvited you if they are intending to invive any of these people.  As if now you are going to assume you and your girlfriend are invited all family events unless specifically uninvited.  Tell them exactly what these people have requested and say that you are publicly refusing that request.  You hopeful that the remainder of the family will live in the year 2015. \n\nDon't apologise to them that you have to do this.  It's not your fault these people are insisting on this accommodation.  Rather the people stepping out of family events because they are bigots should be apologizing. \n\nSend the message to all family members, anyone above high school age. ",
            "Fuck that bitch. Goddamn, I would POUR some hate on her.",
            "Fuck those people.\n\nSeriously, fuck'em.\n\nThey can eat a bag of dicks for not being accepting of your relationship.\n\nBtw, congrats on the engagement! I'm sure you two are a cute couple. ^.^",
            "I hate your family. Ugh. Disgusting ",
            "Reddit can be your family now.",
            "Not sure how I would approach the family member. I would be so tempted to tell them to fuck off if they are going to be prejudice against the love of your life. \n\nAs far as Annie goes, you need to tell her. Let her know that what your family thinks of her does not matter to you because it's not like you are marrying them, you are marrying HER. But she does deserve to know. It would probably eat her up if she found out some other way and you didn't tell her.",
            "Be honest, tell your fiance exactly what happened. Do NOT try a cover-up. It will backfire sooner rather than later, now that the cat's out of the bag and your relatives have ZERO boundaries. \n\nLet the chips fall where they may. You can't do anything about people who've made up their minds. ",
            "Think of it as a free \"asshole-filter\"! Seems like they did you both a favor by showing who and what they really are. There are plenty of truly wonderful people on this little blue/green marble of ours, and while it may not always seem that way, you now have even more reasons to scout around, looking for new friends! You both seem like good peoples and I wish you the best!!",
            "Cut nosy Nelly out of your life.  And continue to go to family events",
            "I don't think that Nosey Nellie is a good influence on her own children, with an attitude like that. ",
            "The hell year are these people living in? Grow up.\n\nDon't talk to them anymore.",
            "\"I'm sorry that your children have bigots as parents.\"",
            "Email them the Bruce Jenner interview :) hehe",
            "Call the little shit a coward.\n\nTell her if she has shit to say about the person you love to get off facebook and do it face to face.\n\nCopy the convo and send it to the rest of your family.",
            "My husband is FTM and it continually eats my mother alive. When she has nothing else to harp on, it's to the \"against gods will\" and \"not understanding\" and \"uncomfortable\"... We plan to soon distance ourselves from them geographically which will make things easier. He's worth more than anything she could ever offer me. I'm sorry you're going through this and I wish I had something profound to say. Don't let them determine your happiness. Best wishes to you and the lady!",
            "I may get downvoted for this, but I think what some people may be saying regarding shaming or shunning may be counterproductive.\n\nWhen people are suprised with something, they can react in ways which are not indicative of their normal nature. \n\nYou and your girlfriend could have also handled this better as well; instead of suprising your family at a party, you could have sat everyone down, informed them of your situation, and provided some resources for providing greater context for whats going on. \n\nYou could *still* do that. \n\nDan Savage  frequently talks about how when you first come out to your family, you should give them some time ( like a year) to have tantrums and get over themselves. That might serve you well too.",
            "Dear Nelly, \n\nGo fuck yourself.\n\nLove always,\n\nfamilywoes225\n",
            "You can't fix other people's ignorance, unfortunately.",
            "Wow fuck those people. They're not gonna change, so you might as well forget them. Start throwing your own BBQ's if you have to, and you don't have to worry about people not coming to a BBQ. \n\nIs she handling it alright? That would be my main concern.",
            "OK here's the thing.\nAll the reddit hate bandwagon completely aside.\n\nThe said Nosy Nelly has every right to exclude your girlfriend due to conflicting moral values. \nYou, on the other hand, have every right to not associate with that person and that person's family.\n\nA lot of ledditors will tell you to go further and write them a message to preach tolerance etc. etc. etc. but that is a passive aggressive act that will not help in any way. Just leave it all behind. ",
            "What shits. It seems like other people one here have good advice, but ugh.\n\nIn other news, congrats on your engagement!! ",
            "You can't fix assholes, unfortunately. \n\n\"Nelly, I'm sorry to inform you that I'm not comfortable associating with bigots or hateful people.\"",
            "They sound like they are not good people, and i think you have to talk with your family and tell them that she is one of the most important person for you.",
            "Honestly, ask her, \"Why?\"",
            "Tell that nosy nelly C**t to fuck off, closed minded people like them need to be isolated.",
            "Wow this is just disgusting and sad. You guys don't need nosy nelly in your life anyway. Many blessings and happiness to you two - and may Annie never be treated like that ever again.",
            "Fuck what ANYONE says. Family, friends, acquaintances, etc. \n\nWith that being said, your family is probably getting blindsided right now cuz they had no idea, and have no idea what to say. \n\nIf you're interested, in informing them and some more details, just have a heart to your family. As for Nosy Nelly, fuck her. I'd suggest saying something snarky - if your family is cool enough. I'd say, \"Oh it's ok, with that attitude, you're no longer invited to anymore functions.\"",
            "Good riddance to bad rubbish!\n\nThat Nosy Nelly bitch needs to be out of your life!",
            "I wouldn't even engage Nosy Nelly. Her behavior doesn't warrant a response. Say nothing. If she comes to her senses, great. If not, she has no one to blame for the break in the family relationships but herself. She'll have no message from you to show. She'll be on her own with her own lonely, sad thoughts.",
            "Congrats nosy Nelly, you're now untermensch to me.  It will take 10 seconds to inform her and the rest of your intolerant family and the next 5 to forget they ever existed. ",
            "If you love her and she loves you and you commit your lives together - that's the important things to know.\n\nYour family needs to educate themselves on the issue. Ignorance, fear and superstition are at play here. They need to learn the facts of the situation. Hopefully they choose to do that. If they don't - that is their decision and you both will have to understand some people choose wrong.\n\n\nYou both take care - I wish you happiness, long life and much love.\n\n\n*Nana internet hug*",
            ">Her entire demeanor changed. She got up and moved, she started whispering with other people. But no one had the audacity to say anything to us.\n\n>Two days later, a message on Facebook:\n\n\nThat's the part that pisses me off the most. Besides the obvious fact that they are bigots, they talk behind your back and are too afraid to confront Annie and you about a problem they have with you. Even if they change their mind about this issue one day, they are not worth your time, because they can't talk about problems like adults.",
            "\n\n1.  At no point inform these assholes where and when you are going to be at family events (where you are supported by the host). Their issue, they will have to call hosts and say \"I don't want to be around transgender people so are they coming or not.\"  Not your job to do that for them.  Them making that call every time will crystallize it for everyone where the problem lies. \n\n2. it's your family and while Annie should be involved in deciding how to proceed, ultimately it should be you that does the proceeding.  You need to protect your loved one and not leave her to do the scary stuff.  Good luck",
            "Damn they didn't even have any suspicions? Must've been one hell of a transition. \n\nTbh, I've always wondered what I'd do in the same situation, I wouldn't hesitate at all to date a person who was m2f,  and I'd sure hope my family wouldn't be bigots like that.",
            "Regardless, providing you love her, their opinion doesn't mean shit. She'll feel terrible because of this, you know. Be there for her.",
            "There's nothing to fix here. Your family has already decided how they feel about someone in your girlfriend's position and reacted accordingly. It's narrow-minded, hateful and just overall awful of them to discriminate against such an innocent life choice as transitioning to a gender she was simply meant to be, but it's a very big and tough concept to change one's firm views on.\n\nYour girlfriend has been nothing but good to you and your family. They loved her until she was honest about one detail, and they have chosen to regard her as a bad influence. I wouldn't go to anymore family events with Nosy Nelly or her minions anymore.. That was just shitty.",
            "I mean, it's disgusting to hear them totally change their position on this person.\n\nMake sure after saying \"your loss\" to point out how it's funny that only now is she not fit to be around them. I would throw it right out there. Not rudely. But matter-of-factly.\n\nThey deserve to feel like assholes for being so scummy. What a bunch of sacks of crap.",
            "I would just show up to family barbeques with her anyways. They can tell you and her to your damn faces. Obviously tell your fiance and get her input. ",
            "Everyone keeps saying \"your family are all bigots and assholes!!!\" but your GF blindsided them with this info after years.  I would be a little shocked if a buddy or family member after all that time told me off the cuff out of the blue \"oh yeah my GF used to be a guy\".  Just give everyone a little time to get used to this and if they are still acting this way then cut them off.",
            "All the advice in here is really great.  I just want to add that I hope you continue to foster and enhance relationships with other family members that don't feel this way towards your fiance.  Host your own BBQ's or family get togethers, be proactive in maintaining the good relationships in your family.  Don't stop going to events or pull away from the other family to avoid conflict.  It may be perceived as shame.  The best (and healthiest!) revenge is to live well.  ",
            "I'm sorry your family isn't accepting of your finance. But you and your fiance are welcome to babysit my kids. I want them to learn that good people come in all shapes and sizes. ",
            "Is this really \"Nosy Nelly\"? Sounds more like a normal conversation.",
            "\"I truly feel sorry to know that your children will grow up under the influence of such hateful, uninformed, and bigoted parents. I am glad this has come to light so that I can discontinue our association.\"\n\nAlthough you should ask your SO first, she might prefer that you simply do nothing at all, which is also a totally valid and good reply. Whatever you do, be sure to block all such people - your SO needs to do this now, IMO - and if need be, report any harassment to Facebook. I would also screenshot them just in case.\n\nEDIT: Oh look, a downvote; just spotted the bigot!",
            "Welcome to the club of having backwoods ignorant fucktards as relatives. It sucks sometimes. You just have to see them for what they are and decide if you want or need them in your life. ",
            "The world has lost it's mind.",
            "I can't tolerate ignorance. No one should. All that matters is that you're happy. I hope it all works out ",
            "you can't fix stupidity and bigotry easily, if at all. \n\ni'm so sorry, it's complete and utter bullshit.",
            "I physically gasped, that's how appalled I was by that message. What an ignorant little shit. So sorry you have to deal with people like that in your life. Those poor kids. I don't have any advice really, except that I hope this is the last bigot you'll ever have to deal with. Hope everything continues to go well with her transition :).",
            "In my family, such events have led to factions/permanent camps.  Those of us who are welcoming and open continue to hang out - and frankly, avoid the others.\n\nIt's not like it's something you can solve by yourselves or address with a PR campaign.\n\nAs everyone else is saying - their loss.  Definitely block and unfriend IMMEDIATELY and don't look back.\n\nLife is better that way.  ",
            "Normally, I'd think that NN is a lost case, but if you note very closely, NN still used female pronouns in the email she sent you. That means that on some level, she still sees Annie as the woman that she is. So she might not be a completely lost case. I'd consider taking a more gentle approach (whatever suggestion you end up following). I wouldn't consider going nuclear unless she reacts very badly to the gentle approach.",
            "While it's bigoted indeed not to accept Annie for who she is, I don't think it was realistic to think the family would not find out.  When you start talking about marriage, people are going to ask about kids.  If you wanted to keep them in the dark, you could have been vague like \"maybe someday,\" but you chose to be straightforward, and they found out.  I suspect you expected this reaction from some members of your family, and that is why you chose not to tell.  \n\nIs it nosy?  Maybe, but it's a common line of questioning, especially among family.  If you have the stomach for it, I would suggest telling them you are sorry they feel that way and it's just who Annie is and leaving the door open if they decide to be more accepting in the future.  If you don't respond to their anger with anger, they won't feel humiliated if they change their minds about Annie's transition.\n\nSorry you're going through this.",
            "what is mtf? Like started out as a boy and is now a girl after surgery and stuff?",
            "There isnt much you can do to change a bigots mind, they will have to come around themselves. \n\nYou two sound very happy, so screw the haters. ",
            "Unfriend Nelly and block her. It's her problem, not yours.\n\nAlso, if the two of you are invited to family get togethers, you do NOT to tell \"check in\" with anyone else about it. You are not obligated to tell Nelly, or anyone else who has a problem with it. It's the hosts that are supposed to do that, if it really is an issue.",
            "Well, try and talk to your family first, and explain where you're coming from, and give them a chance to explain where they're coming from. Explain to them that you're serious about Annie and that she's not going anywhere anytime soon, and that you want them to remember that they liked her just fine before they knew she was mtf. Aside from that, tell Annie that you support her one hundred percent here. Oh, and give her a giant pat on the back, because she's passing hella well if no one in your family could tell. Good for her!",
            "Fuck 'em. Extricate yourself from their lives. If they can't accept what makes you happy in your life, then you'll probably be better off without them.",
            "Tell Nosy Nelly that if she is attending any events to let you know too so you can stay far away from stupidity.",
            "I think everyone else has it covered I just wanted to say I am sorry for your families behavior. ",
            ">I'd also like it if you could please keep me informed if she is attending any mor BBQs or events.\n\n\"I'm sorry Nosy Nelly, I can't comply with this request because that would involve interacting with you further than this one last response and I don't don't intend to ever speak or interact with you in any capacity ever again.\"",
            "If I had relatives that horrible, I would cut ties. It's not worth caring about people that are that inconsiderate to other humans.",
            "Ignore them. If they're uncomfortable they can fucking LEAVE. Fuck them.",
            "I love the ones that while insulting you to your face ask a favor in the next breath. \n\n\"I think you're sub-human. Please do me a favor of informing me when blah blah blah. \" \n\nI mean, what goes through people heads that they think they have any right to be informed of who-the-fuck is coming to the barbcue after they just threw down such a powerful indictment. ",
            "There is already an abundant amount of good advice, but the way you handle the situation is completely up to you. It's all about what you're comfortable with. I'm a more in-your-face kind of person with topics like these so I would let them know that their close-mindedness is a bit ridiculous. I'm so sorry you guys have to go through this. All the best to you both. ",
            "I don't have anything more to offer than has already been said here regarding supporting her and protecting her from knit wits that might get access to her. But, I wanted you to know how sorry I am you both had to go through that and I wish you both great happiness in your lives together. Congratulations on your engagement. ",
            "Don't be afraid to cut off negative relations. If any family member is that negative and ignorant towards you and your partner just cut your ties with them, don't expose yourself to their negativity.\n\n",
            "Fuck those people. You can try to reason with them and explain the situation, but judging by their reaction they have already made up their minds. Your fiance is fine and beautiful the way she is and under no circumstances is there anything wrong with either one of you. That Nosy Nelly should have their kids taken away from them for being a poor influence on them.",
            "Tell your family that you won't inform them that your significant other in advance is attending, and if she's uncomfortable with you being happy, that isn't your issue.",
            "That sucks that your family is so bigoted towards someone you care for, but it's probably better you find out sooner than later. \n\n",
            "If I were you I'd visit forums and do research on how to best approach this, especially because it sounds like your family and might like to stay connected to them. \nCutting them off and saying we don't need you in our lives like many people have replied isn't as easy as it sounds and furthermore hasn't taken into consideration that you might love your family. \nI say, kill em with kindness and help them open their minds. \n\nIf not, both sides lose a relationship with a part of their family they love.",
            "Honestly i feel like the 2 of you should've known this topic would come up with your family and yall should've already had a story to say to prevent any awkwardness. Some things are better off not said and avoided.",
            "Ignorance is *not* bliss.",
            "People say you can't choose your family, but I disagree. You absolutely can. That is exactly what we do when we find our life partners (unless I guess you're related to them already... not common in my part of the world). You've been given some wonderful advice here on ways to approach these people, but if they are unwilling to listen to reason, feel free to remove these people off your \"family\" list. I have a whole group of people I'm related to that I don't talk to, correspond with, etc... they aren't my family. My dogs, my husband, my \"good\" family, inlaws, and my friends are my family.",
            "So sorry they can't support your feelings and embrace the person you are with. I hope it gets better for you. ",
            "you can't help what other people do, chances are your gf is used to this from certian crowds, tell her in as nice of a way as you can, maybe with time some of your family will come around but I wouldn't hold your breath. her being a good example of the transgender community will be the only thing that can change their point of view, breaking stereotypes and such\n\nsorry, gl, grats on the wedding/etc",
            "Now you get to choose your family.",
            "Don't even give this bigot the time of day.  Send her a message detailing you're ok no longer babysitting, its the children's loss.  As for a heads up on the family barbecues? fuck them.  If the rest of your family wants you there, they aren't worth the effort it takes to come up with a visitations schedule.  ",
            "Seriously, never assume people can have kids. Or want to. Just never say anything like that. Even/especially on their wedding day. You never know what people are going through. It's one of the most difficult stressful personal private things in modern life. Just don't bring it up.",
            "I think it being a secret so long added lots of fuel to the fire.",
            "wrtie back please let meknow of the events you are attending so i will not attend them too...",
            "Well I'm not sure I understand who is flipping out or your relation to that person for sure here, but I think I'd tell them that they have no business dictating the terms of your relationship with Annie. If they're not hosting the party they can go get stuffed, if they are then no reason to go to hate HQ.\n\nBasically I think I might say, \"I'm with Annie and if you can't respect her and our relationship there's no place for you in our lives. We will not be changing our plans regardless of your feelings about them.\"",
            "You can live without your family, dont worry",
            "Bring her to every BBQ unannounced, fuck that. ",
            "You're both more than welcome to BBQ at my place, kids n all.",
            "I'll never understand people. How has Annie's transition ever affected anything nosey Nellie has ever done? ",
            "If you're anything like how your attitude implied in the story, just use your same healthy logic on not telling others about her, on her.\n\nNamely, don't tell her the fuckshits blacklisted her or whatever. And don't go around them anymore. Unless of course it comes up somehow. Then you don't have to lie, but phrase it in a way that does the least amount of damage to your fiance.\n\nEG; \nHer; \"Hey, how come we don't babysit anymore and havent been to a BBQ in a while?\" \n\nYou; \"I dunno, I guess they just didn't really like us all that much. OR. I don't really like my family that much. Shit happens.\"",
            "I'm appalled that that was the reaction from your family. They had no doubts *before* any of this, so why should this knowledge make things any different. Lord, ignorance has a way of wiping people's memories and logical thinking skills.\n\nAs far as a suggestion, I would send out an email or hold a meeting, depending on how close your family is, and just break it down how important Annie is to you and your life, and that if they loved and respected you, they would still offer the same respect to your coupleship that they had before. Maybe a little education on the topic and answer questions they may have.",
            "Wow.    \nThis just put into perspective all of my relationship troubles.     \nThat is a horrible occurrence to have to deal with.  Those kind of people need to be cut out of your life. The good part of your family will stand by you and your fiance.",
            "WOW. I want to track down This NN and reveal their most personal secrets. Ugh I'm so not a violent person,but NN makes me wanna slap a bitch",
            "Anyone who treats you like that is very clearly not worth your time.  You'll be better off without them.",
            "I just want to say that my heart goes out to you and your girlfriend. Not being accepted by a S.O.s family is a bit of a fear of mine.\n\n\nTruth is though, that shouldn't change anything. Their loss.",
            "Do I have to google MTF?",
            "Your family is a piece of shit",
            "You guys can come to my family BBQ! We are fucking weirdos tho, so be warned :)",
            "Write a really heartfelt letter about how wonderful a person she is, and how bigoted it is for them to change their opinion just because of that, and how hurt and ashamed you are of them. Shame the fuckers into doing the right thing.",
            "I hate that people like that don't see the hypocrisy of seeing her as a perfectly acceptable influence on their children up to that point.",
            "Why in the hell is it anybody's fucking business whether you and Annie have children?!?! Nosy Nelly overstepped that boundary by a fucking hundred miles! And Nosy Nelly needs to get their fucking head examined because just because the information about Annie's past was just revealed (rather rudely) it does not change who she is as a person inside.\n\nI would tell Nosy Nelly that Annie only babysits for families that only care that their children are cared for by a competent and loving person. And then wait for them to make the next move. This will show that you love Annie and are standing by her and that their prejudism is unwanted/unneeded/unnecessary. ",
            "It's depressing reading about families that do these kind of things, that's now what family is supposed to be about. If they were fine with her before, this shouldn't change a damn thing.\n\nDitch the family if they refuse to act like adults and live a happy life together.\nBest of luck to both of you!",
            "5 year fiance?   Sounds like you've been hesitant about closing the deal anyway.",
            "What horrible people. You and Annie deserve way better.",
            "Where's OP at?",
            "There is no reason for them to be prejudiced against your gf. If they liked her before well you should inform them she is the same person. I would communicate with your family and explain to them how ridiculous they are being.  ",
            "This is late and might have already been said but, if she doesn't know how to behave like an adult then you show her. Continue to go to family events,  be humble, be kind, don't scream, don't demand, be patient like you would with a child. I don't know how best to describe it but it's a very sort on zen like state where you accept and forgive and instead of getting angry you get calm. Loving some one who's actively hurting you is difficult, but if you decide now that you are going to handle it this way and constantly remind yourself of your decision things will get better, if not with her then with the rest of your family.\n\n\n\nPeople in your family are going to want to discuss it but be smart, assume everything you say well be repeated and misinterpreted. ",
            ">tl;dr: Family discovered my long term gf, now fiance, is MtF. Some of them are starting to say they don't want her around their children or at family get togethers. What do I do?\n\nwow I would have setup a together when fiance is not around and gathered them in the living room, then I would just tell them to go fuck themselves and to get the fuck out. this kind of shit pisses me off. I would cut myself off from them all, no longer would I have family. ",
            "\"Oh you'll love them when they're your own.  It's like having tiny friends that you can force your own twisted worldview on, and they're basically powerless to disagree!\"",
            "you should order a pizza for delivery and fire up netflix",
            "You'll have to tell Annie soon. I don't know what you can do at this point. Are you or she in contact with a trans support group? They might have better advice.\n\nI would tell the relatives you're disappointed in their actions and that you don't want to be around bigoted people. I would put the onus on them to stay informed when Annie is around.\n",
            "MtF? ",
            "If she prefers 7th century views then treat her the 7th century way. Oh wait, maybe telling her to learn to repeat human beings and then unfriending is enough. And by all means tell Annie asap, there's nothing for you to fix, not your responsibility to fix other people's xenophobia. ",
            "This is horrible. I can't believe in the age we are in people still have problems with this for who knows what reason. I feel for you and Annie that you have to go through this. I'm sorry I have no advice but that it's your families loss for treating a person you love like this. ",
            "you just have to let them deal with it...i honestly don't  think you can do a whole lot. \n\ni think you should have told your family sooner. five years is a long time and you must have known how they would respond. i feel like they may feel lied to and hurt. you can't  expect people to just accept something like this...and to find out the way your family did is kind of bad. i mean five years and then just bam at a bbq? thats pretty fucked.",
            "Thank them for letting you know that they're bigots and tell them you don't want them in your life anyway.  Then tell Annie and show her the email you sent.",
            "Do not change your life to accommodate toxic people, even relatives. Either they accept you, or they bugger off.",
            "Could anyone tell me what an MtF is? I am not familiar with that acronym. Thank you.",
            "Nosy wants you to let her know if you plan on bringing your fiance to any more functions? Lol. Tell her that's not going to happen, that it's unfortunate she's so closed minded and to please not contact you again. That goes for anyone else who has a problem with it. Tell your fiance what they said, I think you should be the one responding though. I'm sure you have some supportive family still, stick with them! ",
            "I think it is fucking ridiculous to expect people to be comfortable with transgendered people.\n\nThat doesn't mean you should disrepsect transgendered folks, but it's just, at least in my eyes, entirely unfair to FORCE people to accept something that they have every right to view as \"unnatural\" or whatever reason they want to give. \n\nI haven no problem with Transgendered folks.  Some people do- that isn't going to change. Not everyone has to repsect you or your life choice and the sooner you wake up to the reality of this the better. ",
            "This is completely off topic but I am interested to know how you two (you and your gf) became romantically involved.\n\nIs it something similar to Orange is the New Black trans girl? (Basically he(she) tells his wife he identifies as female and the wife supports him(her) more or less)\n\nAre you attracted to men and women?\n\nGenuinely currious. Hope I don't offend.",
            "[removed]",
            "I think a more diplomatic response would have been, \"I had to have surgery that left me infertile.  The doctors say there's no way for me to get pregnant.\"  That way she's not lying about anything, she's just not telling the entire truth.  If pressed for details, she could even say, \"I had a growth removed.\"\n\nNone of this is your fault.  It's all on your shitty relatives.  Sometimes you have to gloss over the truth if you want to remain on good terms with small-minded people.\n\nOr you could always go with the classic, \"None of your fucking business.\"",
            "There's no \"fixing\" this. The news is out and now people in your family are going to react however they react.  You could try to change their minds but you have to accept it's not really in your power.\n\nI think in your position I would be a little upset with Annie... or maybe with myself.  If she was feeling like she wanted people to know she should have given you a heads-up and given you the chance to help her figure out how to tell people and who to tell.  If she didn't want people to know it would have been easy enough to just say \"Look, it's really not your business, can we change the subject\" or something like that.\n\nNow this nosy nelly was the first one to know, rather than (say) your parents or your brother.. she found out in public in front of people she didn't know.. and now a bunch of people in your family know not because either of you told them, but because NN did, probably with ugly and biased language.  \n\nI would have wanted input. I would have wanted it to happen differently.  I don't know whether I'd be upset with Annie, or if I'd be upset with myself for ignoring the issue and not taking any time in the last 5 years to figure it out.  \n\nAs for what to do next, I'd say that you two have to go and tell those people who are the closest to you, the ones you expect to stand by you, maybe your brother and your parents.  You have to do it *right away* and you maybe should apologize for not letting them know this way.  And then you let them know that you won't be associating with anyone who has a problem with Annie being there so you are gonna need to talk about some of your family traditions and which ones you're going to continue participating in.  ",
            "Fuck'em",
            "Can't fix stupid.  Don't tell Annie just stop going to events and focus on your happiness.",
            "Sadly, there is no \"fixing\" this. They are transphobic to a degree that can't be worked on.\n\nA lot of transphobic people fear the UNKNOWN TRANS THREAT, and then find out someone they know has always been trans, and after the initial shock wears out, they realize trans people are... people. Sometimes these people actually get over their transphobia, and sometimes, they just get selective about it. \"These trans people are probably pervs and damaged, but not you, no, you are fine, honey, I _know_ you.\"\n\nAt any rate, you'll need to accept that some of your family members are gone from your life. Those are the ones that won't come around even with time. As for the ones that will eventually come around, it is up to you and Annie together, to figure out which will be accepted into your lives again and which have said or done things that are past what you guys can forgive.\n\nAbout telling her, do it ASAP, and reassure her (although, from the tone of your post I don't think this is even necessary) that you have her back and ask her what she wants to do. Does she want to block, ignore, and avoid going to events these people are in? Or does she want to keep up what you guys are doing and everyone that has a problem can change THEIR lives to fit their prejudice?\n\nOne final thing - if any of your family members react badly to being treated like the bigots they are, be careful about wedding related information when the time comes. I am not saying they are going to go as far as picket your special day, but ignorance makes people do some hurtful things, and it'd be a shame if they were to ruin your wedding day, regardless of the type of ceremony/event/party/whatever that you guys have.\n\nEdit: a word",
            "\"I don't discriminate against your husband for fucking animals.\"",
            "> I'd also like it if you could please keep me informed if she is attending any mor BBQs or events. \n\nLOL, fuck this!    You're not under any obligation to disclose your plans or whereabouts to her.\n\n> a few more messages like that came in. \n\nI would talk to the others and see how they truly feel just to make sure it isn't NN trying to rally them to her side before they truly understand how jerk-ish they are being.\n\nNN may be a lost cause, but talk to the others first.",
            "Man, they sound like assholes",
            "[removed]",
            "[removed]",
            "Are these family members? \n\nYou have two choices, in my opinion.\n\n1. Tell them good riddance and don't look back. Have your partners back and commit to only allowing them in contact with family/friends of yours who respect her and treat her with the respect she deserves.\n\n2. Take your family and friends side, let them \"banish the monster\", and grab a pitchfork. Cave to their bs, allow your partner to feel like a source of your ostracized position, and allow this kind of thing to continue... because this kind of disrespect comes in MANY forms and for MANY reasons. \n\nI don't allow ugly people in my life anymore. I did for a long time, and it enabled them to be even worse over time since no one ever called them out. Eventually the snack got too big and eventually bit me. \n\nGood luck.    ",
            "OP hasn't reply to anything? I wanna call BS.",
            "[removed]",
            "[deleted]",
            "You can't fix stupid. Ignorant yes; stupid no.",
            "This is the 21st century. If they can't accept Transgender as apart of social norm then they're living in the past. Might as well categorize it as racism and sexism and homophobic (the last one being a certain extent related.)\n\nRegardless, I say you with her and tell her the truth of your family. While you yourself maybe accepting of her as who she is, your family might never will. And that is something you both will have to live with if you think about the long term. \n\nOn the other hand, I give you lots of props. I don't think I can do it. Not that I'm against transgender or anything, it's just that I see myself dating a female born as a female with female parts and able to produce babies in the future. I can see how they might be uncomfortable to a certain extent if they were dating somebody and found out they were born without female reproductive parts. BUT, they're not. And they should just learn to accept it hopefully. ",
            "\"Bitch.\"",
            "I think you should her but that you should do it in a way where she understands that you still love her and that what your family says does not mean as much as that she is happy. Also hug her a lot and make her feel comfortable after telling her.\nFor your family, I think you should ask them why they think that way about her and try to get them to understand(because possibly they may not understand and be afraid of it in that way) and if you can't well simply ... Fuck them. As long as you and her are happy that is all that matter. On the baby thing if you ever change your idea about them science will probably be able to make her have them if you both want that then of course. Science is advancing quickly right now. Even faster than we realize :P",
            "you cant fix stupid. sorry :C",
            "You should definitely talk to your SO. I'm sure she's had counseling that would help her deal with situations like this. And now she can teach you how to deal with this kind of situation. Also, since this is specifically about her, if you don't tell her, then she'll feel like you've been talking about her behind her back, which is never a good feeling.\n\nWhen you and your SO reply, I think you should first assume that they have been mislead in some way to believe that the transgendered are bad for their children. You'll find out if they truly are bigots after they respond.\n\nI think your reply should be something like this:\n\nHi Family, \n\nI wanted to start by saying that we will, of course, respect any boundary's you have. If you don't want us near your or your children, even though we don't agree that our presence is harmful, we will keep our distance if that's what you want.\n\nHowever, it really saddens us that you feel this way. I really hope that if we can talk, maybe we can try and set some less restrictive boundaries.\n\nI know that this circumstance is uncommon. And I can understand if you feel it's strange. I think that it perfectly natural to want to avoid things that feel strange things. And I think that if you take the time to learn about our situation specifically, you'll find that it isn't as strange as it feels. Out of all of our friends, none of us feel that it is strange. Uncommon? yes, but strange? no. So we encourage you to feel free to ask us anything that you might be wondering. And whatever it is that makes you feel uncomfortable, please definitely ask us for our perspective.\n\nTo get the ball rolling, my SO doesn't feel like she's a man who want's lady parts, she truly *feels* and *thinks* like a lady. Unfortunately she was born with the body of a man. This discovery about herself was not an easy one. It took time, self reflection, experimentation, and years of therapy to really understand this about herself. Not just anyone can chose to switch their gender on a whim, only those who are truly one gender inside the body of another (determined by professionals) can have sex reassignment surgery. So if you're worried that your children might be influenced to \"decide\" that they want to switch their gender because of my SO, then therapy will be very effective at sorting that out.\n\nThank you for your consideration in this delicate matter,\n\n<signature>\n\n\nOnly after this converstaion and they haven't changed their mind should you mention that that it's their responsibility to keep track of which events you and them have been invited to, and it's their responsibility to find out if you are going. In no way is this you're responsibility. ",
            "[removed]"
        ]
    },
    {
        "post_id": "3319tc",
        "author": "Throwingthings124",
        "title": "[UPDATE] I(21M) don't have facial hair. My girlfriend(20F) of 9 months is disappointed because she finds bearded men attractive. She's making me insecure.",
        "url": "https://www.reddit.com/r/relationships/comments/3319tc/update_i21m_dont_have_facial_hair_my/",
        "score": 2576,
        "num_comments": 462,
        "created_utc": 1429370430.0,
        "selftext": "Original post - http://www.reddit.com/r/relationships/comments/32yl3g/i_21m_dont_have_any_facial_hair_my_girlfriend20f/\n\nSo, I talked to Amy about how her comments are making me feel and that she should cut it out.\n\nIt didn't go well :(\n\nShe got a bit angry and said that she's allowed to have preferences and desires. I told her that I know, but that doesn't mean that she should bring it up all the time. After that, she said that I'm immature and that I need to get over it. \nParaphrasing what she said:\n\n\"You already look immature without facial hair, so don't complain, you'll look even worse\".\n\nI told her that I'm fed up with her comments, and that she should tell me if she prefers to go find a hairy man.\n\nAnd then she crushed me by saying that she's been having a crush on her coworker (22M), who had a full beard.\nI asked her if anything ever happened between them. She looked at me in silence, and then stormed off to her room.\n\nTo make a long story short, I broke up with her. She cried, saying that she'll stop, but I wasn't having any of it.\nSo that's that. \n\nTl;dr: broke up with girlfriend.",
        "permalink": "/r/relationships/comments/3319tc/update_i21m_dont_have_facial_hair_my/",
        "comments": [
            "What's her logic here? 'I like bearded men so much that I will cheat on my non-bearded bf with a bearded man. Maybe if I somehow force bf to grow a beard I will no longer be forced to cheat.' \n\nAt least you found out relatively early how monumentally stupid she is.",
            "Good!  You should have a girlfriend that appreciates you and respects you.  Don't settle for anyone who makes you feel insecure and crummy. ",
            "Wow...the level of her immaturity is staggering!",
            "[deleted]",
            "OP, as a matter of personal disclosure, beard friction against my face really irritates my skin, to the point where I avoid dating bearded dudes because the acne breakouts aren't worth it and there aren't any products that help.\n\nThere are a ton of ladies who will love you just for the fact that you're not super hairy. ",
            "As a fellow guy who is five years older than you and can't grow a beard I just wanted to let you know there are girls out there that also have a preference for less facial hair. They're not that uncommon actually :) sorry about your experience though, but don't let that make you self conscious! Think of the money we save as well! :p ",
            "/u/Throwingthings124, if I were to write you a song about being smooth faced and fabulous, would you send it to your ex? If so, I'll do it right now.\n\nEDIT: Okay, here's a tune just for you (I just learned Flogging Molly's \"Drunken Lullabies\", so I borrowed the chord progression). Let me know what she thinks.\n\nListen/download here: [http://clyp.it/lwoi4lh0](http://clyp.it/lwoi4lh0)\n\n**Facial Hair**\n\nI was good to you--  \nfor your love I cheered--  \nuntil you told me  \nI was nothing without a beard.  \nNo matter how I tried,  \nyou said I would never win.  \nI was no viking man;  \nI had smooth skin.  \n\nThe love we find in this life  \nwill not scratch every itch.  \nYou wish I had facial hair,  \nand I wish you weren't a bitch.  ",
            "Good for you for having a pair of balls dude!",
            "Wow. Take it as a win I guess?",
            "She sounds immature. If beards are her priority, she's got some dumbass priorities. Maybe you should start telling her you wish her boobs were smaller/bigger (whichever one she isn't). See how she fucking likes that. I'm glad you broke up with her. ",
            "Lmfao she resorted to insulting you yet you're the immature one apparently. God she sounds awful. Good for you for dumping her. ",
            "Holy fuck. Someone on this sub with self-respect?",
            "Jesus.. Good riddance. What a selfish thoughtless child. \n\nI know it hurts now, but it will get easier, and there are TONS of girls out there for whom less hair is better. And who would never shit on you for something completely out of your control! That part boggles my mind, how she could so stubbornly think that's ok, when you're sitting there telling her how it makes you feel. You deserve to be with someone much more considerate than her. Before long you'll wonder how you put up with this so long. \n\nCongratulations, man. Enjoy being single!",
            "I read this and I was like. \"Man, I have that kind of girlfriend too.\" When she sees a full bearded man she's like looking into him and sh*t. She keeps on suggesting me to have a beard which I don't have, no one in my family has it. (probably not in the genes). ",
            "When we married 46 years ago, my husband had such little facial hair he shaved once a week or so. Neither of us found it to be an issue.\n\nAround his 30th birthday his beard came in sufficiently to warrant shaving every other day. By 35 he had an attractive short beard that he has kept to this day. He trims it every other week.\n\nI have no idea why - if you love someone - facial hair is SUCH a big issue.\n\nI loved kissing his hairless, slightly haired and bearded face through the years.  :)",
            "Good for you on breaking up with her, OP. I mean, I like guys with beards, but my boyfriend can't grow one. That doesn't mean I shove it in his face and make him feel insecure. The immature one is your ex. Screw her. You deserve someone so much better!! ",
            "[removed]",
            "[removed]",
            "She cheated fuck that hoe",
            "I have a beard ... and sometimes I don't ... I can tell you this. Immature women have nothing to do with facial hair. If it wasn't the beard, it would be something else. Good on you for dropping her. ",
            "You immature? She was the immature one. Cried, begged and stormed off...\n\nYou're better off without her anyway. Hope you'll find a woman who will appreciate your hairless body and who actually cares about you.",
            "Lol what a dumb bitch.",
            "I have a glorious beard and it would refuse to be in a relationship with such a wench.",
            "Good for you, OP. A spine looks better than a beard on any man.",
            "Significant others should help build you up and not facilitate breaking you down. The world does enough of that as it is. GG sir.",
            "You both deserve to find a partner you find attractive. The grass is always greener, so please, think long and hard about her flightyness and her recent comments if she comes back after the crush comes back a failure. \n\nYou're a good, mature dude. You don't have facial hair. So what? It's okay if she's not attracted, but it's not okay to purposely make you feel shitty over it. \n\nYou're much better off. It hurts, but one day you'll wipe your brow in a \"phew\" gesture and consider the good decision that was made. Go find some friends and get drunk tonight. ",
            "What a dumbass thing to ruin a relationship over. I prefer women with certain features and styles but I'm not going to throw away a great catch because they have a few different features. Of all the most shallow reasons to pull shit. You dodged a bullet man. It sucks but that's just total nonsense and you don't need to worry yourself with such a fool. ",
            "this sounds like a discussion between 14 year olds wtf",
            "Tell her her boobs are too small, that'll even it out.\n\nOh, I see you already broke up with her.\n\nTell her her boobs are too small anyway.",
            "This bitch is toxic and needs to go. ",
            "\"...to her room\"\n\nYou guys had separate rooms?\n\nSounds like you dodged a very selfish and unfriendly person, good for you :)",
            "She sounds pathetic.  You've dodged a bullet, in fact probably a grenade.  ",
            "I'm so fucking sick of this whole beard / facial hair culture that's going on. ",
            "What a weird—or should I say *beard*—girlfriend. You did the right thing!",
            "Ew! What a horrible way for her to react. You are so much better than how she's treating you. I'm sorry you're caught up in this. ",
            "Wow good shit dude. As a female who has a preference for facial hair, if the dude I liked didn't have any, it just wouldn't matter to me. If you like someone for who they are, doesn't matter what they look like. In fact, if I start digging on a clean-faced dude, that becomes a new standard of attraction. I agree with the majority of posters here, she's super immature and will hopefully grow out of it when she realizes that's retarded.",
            "Good job dude , you'll find somebody better .",
            "If it makes you feel any better, I think beards are like pubic hairs growing on someone's face.",
            " who would have thought wanting a beard with the first step in trickle truth",
            "So happy reading that you dumped her! I was going to say, if she's being such a tool, stoop to her level briefly. Obsessively talk about a feature you prefer in girls. Still not cool, but sometimes a dose of their own medicine feels good for you, sometimes makes a point. ",
            "Rock on!",
            "You did good. Sticking up for yourself is hard, but I'm sure you already know how rewarding it can be. Props op",
            "She told you that you \"look immature\" and then acted shocked when you wouldn't put up with that?\n\nAchievement unlocked:  Dodged bullet.",
            "Good on you for dumping her. I wish you good luck in any future beard growing endeavors.",
            "Good riddance.  Life is too short to be with someone like that.\nMy hubby also has problems growing facial hair, and it doesn't bother either of us.  We both sometimes joke about it, in a silly, loving way.\nDon't feel insecure about it.  It's just one of those unique and quirky things that make you who you are.  Embrace it because it's definitely not something to be ashamed of.  And on the plus side, you are probably lucky in that you will keep most of the hair on your head.  Hubby is 39 with a full head of hair.",
            "Wow.  It's normal for 20 year olds to be somewhat immature, but she's way out on the left tail of the distribution.\n\nBe prepared for her to tell people her own version of the story.  She might even try to broadcast it widely to turn it into the accepted truth.  You will not look good in her version.  Feel free to tell your friends if they want to know the truth, but I wouldn't fight her directly about it.  Rise above the fray.\n\nYou need to totally disengage from her.\n",
            "What a bitch.  ",
            "I'm still trying to get over the fact that this girl *likes* beard-burn. I admit that groomed facial hair on a guy is typically pretty attractive, but I *hate* the sharp stubble. Who likes getting road rash on their face?!",
            "Good move dude.",
            "Congratulations on having the backbone to not allow a shitty person bring you down. ",
            "Good for you!",
            "fuck her room kick her ass out. no reason for her to stay there. or if your the one who has to leave pack your stuff and stay with a friend. dont be around her anymore. ",
            "Beards are over ",
            "You dodged a bullet there, friend.",
            "Yeah, she's immature as fuck. You're better off without her. She's obviously only thinking of her feelings and desires. Even if a person has a certain type or preference, when you're with someone who doesn't embody that it's ridiculous to lambaste them for things they can't change. ",
            "I hope her hairy co worker shaves off his beard.",
            "Dodged a bullet on that one.  Good for you, move on and find a sweetheart that will love your beautifully smooth face.  :)\n",
            "You are one lucky man. She sounds terrible. You don't want to be with someone who makes you feel bad about something that's great. What's next? She's going to try and make you feel bad that you're not balding or that you don't have enough of a belly?",
            "This fuckin bitch has the nerve to cheat on you, I swear to god OP, you're 10x better without her. You're probably a stud. Fuck her. ",
            "So sorry! But it's better that you brought up the problem and found out what was at the root of it now. I know in your position I've put off bringing up little things because I didn't want to cause waves, and then later on when things blew up in my face, I realize that all those little things would have led to the root of the problem if I had chose to bring them up at the time. \n\nSeems like you handled it really well. I wish everyone who posts to this sub would follow through with communicating about the problem, accepting the response for what it is, and sticking to their guns.",
            "Sounds like a bullet dodged, she doesn't sound like she gave a shit about being in a loving relationship at all.",
            ">\"You already look immature without facial hair, so don't complain, you'll look even worse\".\n\nWell, someone was immature in that relationship, but it wasn't who she thought it was....",
            "You probably realise by now that she wanted out of the relationship and the beard was just an excuse.",
            "Dude. Facial hair to her might look sexy but every Asian girl I've talked to hates it and thinks it looks like facial pubic hair. To each their own.",
            "Your ex sounds extremely immature. You dodged a bullet so hard it's like you're in the fucking Matrix.",
            "Good on you. Your ex sounds like an immature little mind-fuck.",
            "I'm so sorry buddy. I've been drinking and some shit happened tonight that's a bit similar to this story you're telling. Either way, I hope you find someone better who cares for you.\n\nI'm going to lay some truth on you. After reading your other post and this one (no other posts or anything by you), I have come to make my own opinion.\n\nI'm sorry this is the best formatting I can do. I'm on mobile. Either way, you seem like a really cool person. The fact that you let her treat you like this shows true willpower. I know that in a year or more you will find someone that makes your core buzz. I'm not talking a one night fling or someone that makes you smile one or twice with a joke.\n\nI think you'll find someone that you really love and that you truly care about. She'll love your face and any hair/lack thereof that you have! You are a beautiful person and you need to realize that you will find happiness.\n\nIf you don't know it, then I will know it for you.\n\nHonestly, I'm sure you can point out flaws in her. Flaws are what makes us who we are. The simple fact that she acted the way she did was ridiculous. Dude. I have a beard, but it's just a rugged thing. I don't know what else to say about it.\n\nI think that you will find an amazing person soon. This could be a person you don't even know yet, or maybe even someone right under your nose. You know what man? Let me know.\n\nLet me know when you find her. When you find her, you'll know that you are worth more than a 100 billion dollars. Don't ever let anyone tell you that you are worth any less. Cheers and heads up man.\n\nLife will be okay! :)",
            "Her comments actually made my jaw drop. How the hell can she have the cheek to say that? You'll do better off without her mate. It's always a shame when you start to see cracks in a relationship, but sometimes you gotta do what's best for you. We've all been there.",
            "> she said that I'm immature and that I need to get over it.\n\nThe lady doth project too much, methinks.",
            "Hey OP, semi off-topic question: how's your hair in other places?\n\nI have friend who has some sort of auto-immune disease that's started affecting his hair (on head), went down to eyebrows, and I haven't asked any further.\n",
            "Jesus. This is why is I believe you should fuck for most of your 20s with no GFs. Then around late 20s and early 30s everyones been through some shit and mostly knows how to act.",
            "During finals season every semester i stopped shaving. In may 2012 i didnt shave for two weeks and nothing happened. When i did it in december i got a great beard. I was 21 at the time and since ive had a full beard. \n\nDont fret about it. If it doesnt happen just get big muscles instead",
            "My man -- you did a great job. Based on all the shit I read here I would have half expected you to take her back, but you stood your ground. It'll hurt for a little while but just know that the ex didn't value you for who you are. Top stuff",
            "Wow. What a bitch. Well good for you for sticking up for yourself. She sounded shady as hell. Of course everyone is entitled to their preferences, but to keep throwing it in your face, when you can't do anything about it is not cool. Then that shit with her Co worker, red flag there. You made the right choice, definitely",
            "Yeah. Dude, congratulations.  I don't know you but you're way better than that.  As someone with an immature nitpicky ex, I know it's really easy to put up with a girl saying shit like that and putting you down.  It may be hard at times but remember that you're winning here.",
            "She should grow a beard! Immature Female Dog.",
            "At least uou didn't get trapped by having a baby with her!",
            "Bearded man. I wouldn't touch her. Good on you mate.",
            "> \"You already look immature without facial hair, so don't complain, you'll look even worse\".\n\nMate, you're making your fakepost too obvious. Real humans don't always have such perfect retorts.",
            "[removed]",
            "I'm a 24f who hates facial hair. My 26m boyfriend can't grow a beard, and I couldn't be happier. Sometimes, after a WHOLE WEEK without shaving, he gets this awkward five-o-clock shadow, which gives me razor burn from the kisses, but that's my only facial hair related complaint. Someday soon you'll find the facial hair hating love of your life.",
            "Go you!",
            "I'm half tempted to shave my beard for you. A beard is not something that every man just grow. Some can, some can't. The fact she based an entire relationship on that is astounding. Not having a beard ended up saving your sanity.\n\nI'm sorry for your lack of beard, but props to you for dodging the train wreck.",
            "Good on you man! Have some respect, it's tough but chin up and hit the gym, get on tinder, move on.",
            "Good for you! I know it must hurt but you're better off without having such a childish, insensitive, possibly cheating asshole like her in your life.",
            "Look man, you did the right thing. This would have eaten you up in the long run, and even if you stuck through it she obviously got off on emotionally abusing you so it could only get worse. Find someone who likes you for who you are.",
            "She was lucky. I have to deal with my SOs stubbly chin since he has to shave for work. And hair all over the bathroom sink.. ):<",
            "Yeah, no way in hell was she gonna stop.",
            "Damn, i'm sorry about that OP. Can't believe she didn't understand that that would he hurtful- it could've gone completely differently had she not been so mean. I'm sure you're really cute with or without facefuzz. ",
            "God most mornings I wish I couldn't grow a beard. I'm the opposite as my beard grows stupid fast and I have to shave it. How about I'll trade you my upper lip. You get a mustache and I get one less section to shave every morning",
            "Delete the gym, hit a lawyer, hire Facebook. Good work bro!",
            "Really glad you dumped her. You haven't even been with her for a year.\n\nImagine how shitty a boyfriend you would be if you were \"disappointed\" that she didn't have something on her body that you find attractive.\n\n\"Boy I sure do like everything about you, but I'm so disappointed that your breasts aren't several cup sizes larger.\"",
            "Better off without that passive aggressive mess,",
            "Don't think about her anymore! What a bitch. You did the right thing! And don't worry there are plenty of girls out there that love the smooth face, I and most of my friends have that preference. You'll now have the chance to find a girl that will build your confidence instead of ruining it. ",
            "That is such a pathetic reason your girlfriend wouldn't like you in the first place. Imagine the type of stupid stuff that would occur in the future. Good for you OP, just don't crawl back to her. That whole reason is so immature that it's better you just steer clear of her completely.",
            "Good for you, did the right thing imo. No point in staying with someone like that, let alone consider them your significant other, when all they do is bitch about such childish things. \n\nShe clearly doesn't care about your feelings enough to shut up about this idiotic facial hair thing, so who knows what hell you'd have had to deal with as the years went on.",
            "Good for you OP! \n\nPeople like that are a waste and no one needs them in their lives.",
            "You're better off without her OP and for what it's worth, I love guys with no facial hair! Beards are itchy. ",
            "Looks like you dodged a bullet here, OP. Throughout your posts, she's come off as incredibly immature. Now that it's obvious she cheated on you, you're just leaving the garbage behind you. She's not worth the hassle. Now go find someone who likes you for you :)",
            "Her reaction to your concern was very poor. She tried to use your insecurity against you to avoid taking even a little responsibility for your feelings. That's mean and wrong.\n\nYou handled it the right way. Move on my friend. She was the one who was immature. You may not have a facial hair, but your heart is covered in a rich manly mane of maturity.",
            "Good.",
            "Yeah the moment she threw that other guys name into the argument she had proved that she was starting to entertain the idea of being unfaithful or she had already cheated on you man.",
            "How did she ever think that would end well? Silly fool. ",
            "It's okay. You'll hopefully find a girl that doesn't give a hoot or prefers no facial hair. I always found the feel of beards a bit unappealing, tbh. :(",
            "Good move.  Who needs that nonsense?\n\nF her.",
            "Good job. ",
            "A friend of mine claimed that if you rub garlic on your face after a shave your hair comes in darker and quicker. Also wash you face very well after or you will break out bad. ",
            "She's being shallow and unappreciative of your feelings when she says this.\n\nGood riddance!",
            "You do not deserve her. She is acting immature and cheated on you.",
            "Plenty of girls would want you I've been told to shave so many times its pissing me off.  My last GF mentioned how \"no girls like a guy with a beard, you look like a terrorist\".   \n\nI'm growing it longer.  ",
            "Well done, OP. You deserve much, much better.",
            "You should definitely be glad dude. Facial hair isn't that great. I cherish the time between shaving and when it begins to sprout again. \n\nDon't ever let your part pressure you into doing something you don't want or make you feel about about something about yourself. You did the mature thing in talking to her about it and the right thing in cutting your ties when she refused to communicate.",
            "Don't worry OP,  retarded bitch is retarded, you're much better off without her. ",
            "I like men who are taller than me, ripped like lumberjacks with the voice of Gordon Lightfoot and the southern Drawl of Rhett Butler.\n\nBeing 6 foot, that did not happen. Do I make my husband who I find absolutely attractive feel terrible because of it? Ofcorce not. We all have preferences, I'm sure my husband didn't imagine ending up with a wife who's got shoulders wide enough she gets caught in doors. \n\nYou can't hold genetics against anyone, your girl friend needs to get a reality check and snuggle up with a badger. ",
            "You got out while it was still easy. Good for you",
            "Good for you beardless man! Personally I love beards but I know girls who don't like them! You'll find someone much better who will talk about how attractive you are, not other people (:",
            "Good ridens. You deseve a faithful woman who is happy with who you are. ",
            "There are plenty of girls out there that highly appreciate a smooth, stubble free face. You dodged a bullet. ",
            "Immature as hell. Those are the ones you find on Tinder or some shit. Good job OP. You saved so much of your precious time, money, feelings by doing so. Time to hit the gym, go out with your buddies and find a mature woman not a girl. ",
            "Good riddance. Looks like you dodged a bullet.",
            "You did the right thing.",
            "Good for you for standing up to her.  I'm a woman and  of course,  I have preferences too.  A mature woman decides on whether or not she cares about the person  enough to look past the physical stuff and love the man inside.  Just like men do to women.  What she said to you is the equivalent of you telling her how you prefer a girl with bigger boobs.  That would not go over well with her at a,  I'm sure.  Personally,  I'm anti beard.  There are many women who are.  I'm glad you figured out w how shallow this girl is before you got more serious.  Move on and soon enough she will be a funny anecdote to a story and nothing else.  Stay strong and dont call her! ",
            "Good riddance ",
            "I've always loved bearded men, but it turned out that the man I fell in love with doesn't grow much in the way of facial hair (and what he does grow is hardly visible because it comes in as a very fair blond). That's okay though because my love for him is greater than my love for bearded men. It's not like any man without a beard is a hideous troll... He has plenty of other features I love too.\n\nIMO, you're much better off.",
            "You did the right thing!",
            "Gonna be honest dude, you did the right thing. Not all guys want to/can grow massive-ass beards, just like not all women can have double D size tits. At the end of the day, people can't help how they look, and if she couldn't handle the fact that you don't have facial hair, you're better off without her.",
            "Kind of off topic, but I'm 20 and I don't even like facial hair on guys, , it really puts me off seeing beards on young guys. I like guys to look a bit more boyish. But that's just personal preference.\n\nAnyways, that being said, you are better off without her. If she had a preference for bearded guys why was she with you in first place? And her complaining about it is really unfair considering you can't do anything about it. She sounds like a very manipulative person.",
            "You dodged a bullet, thank the stars. You don't need this crap in your life.\n\nI am sorry for your pain, but this was the correct move.",
            "Now that you're single all you have to do is grow a beard and everything will be great",
            "Good for you, OP. You stood up for yourself. That's INCREDIBLY hard to  do with any situation, let alone someone who you've let in to your heart. \n\nYeah, it didn't go as planned but you earned more self respect, learned how to set boundaries and at the very least don't have to be with someone who doesn't love you for who you really are.",
            "What an idiot. I'm sure she'll never tell anyone she broke up when the someone because the couldn't grow a beard...don't worry dude, karma will get her. Someone will break up with her for being an idiot....",
            "She's an immature asshole. ",
            "Good job. She is the immature one trying to fuck with you. ",
            "You aren't immature!  YOU ARE A MAN!",
            "Any time a woman insists you must change who you are and how you look to meet her needs, your only response must be to admit she doesn't really care for you.  She sees you as someone she can mold into her desires....\n\nThat is a huge red light.",
            "Wow, this girl is a douche. Congratulations on getting rid of such a crappy girlfriend.",
            "You did the right thing, OP. You'll find better. Focus on yourself now and have fun. Goto the gym and get stacked. You're a one man band, again! Good job, brother!",
            "it's better this way",
            "Awesome. Now you know where all this shit was coming from. She was cheating on you with a bearded guy at work and trying to make you into something lesser in her mind so she could feel good about cheating on you. What a bitch\n",
            "You did the right thing. She had a need that you couldn't meet. She would have cheated on you with the guy from work if she wasn't already.\n\nIt's not your fault. I knew a guy who could only be attracted to really skinny flat-chested girls. For him to stick with a girl who wasn't skinny would have been a disservice to them both. Girls with big boobs will find other guys. You will find other girls.",
            "Beards are a weird thing.\n\nYou know the basics of evolution, yes? \"Positive\" traits will get selected for by improving chances of reproduction, so any given positive trait will eventually spread through the population.\n\nFacial hair is a weird thing where women generally only like them if they're uncommon. So if a lot of men have beards, women will tend to prefer the clean-shaven look. If a lot of men are clean-shaven, women will tend to prefer a beard.\n\nUltimately with the popularity of beards right now I think you'll easily find a partner who prefers the clean-shaven look, or at least doesn't mind either way. You'll be fine.",
            "Fuck that bitch",
            "What a shallow and controlling girl. Good for you for getting away from that!",
            "Ur so gay lol",
            "Good move, OP. ",
            "Are you triggered?",
            " She sounds loopy and childish if you are looking to settle down don't do it with that one.",
            "Your actions today should have granted you a beard, well done",
            "Never hit a woman my ass.  What she said was totally slapworthy.  She has no respect or consideration.",
            "You dodged a bullet there for sure.",
            "I want to up vote you more for not giving her another chance..\n\nNo one deserves disrespect like that, good on you.",
            "Attaboy! I believe that if you really care about someone you don't try to change them. This is along the same lines as anyone else having a problem with a SO appearance in any other way. I just couldn't believe the part about her co-worker. Too bad she doesn't understand you don't need a beard to be a fucking man. Good on ya.",
            "What a bitch.",
            "Good on you my man, anyone who disrespects you like that should be kicked to the curb as a matter of principle. Life should not be wasted on people who don't add to your well-being.\n\nNow go forth and multiply with that lovely baby-butt chin of yours.",
            "What does she expect after being so mean to you about how you look?  You will find a girl that will love you no matter what. Beard or no beard.  She's a jerk.",
            "I feel for you man. I can't grow facial hair to save my life, Baby faces have to stick together!",
            "Well now she can go be with a hairy man.. ",
            "In my opinion, if you pressed this really hard, you'd probably find out this is about a LOT more than beards... I'm guessing she's had some pent up frustrations for a while. ",
            "Can she have her preferences?  Absolutely.  Doesn't mean she gets to act like a total bitch towards you, though.  \n\nA person that loves you wouldn't say \"you're being immature and to get over it,\" when you tell them that their comments hurt your feelings, nor would they continue to insult you.  \n\nI'm sure it feels pretty rough right now, but you're better off without this girl.  You deserve somebody that makes you feel good about yourself.",
            "Your ex is an asshole. Congratulations.",
            "You dodged a fucking bullet, OP.",
            "As a 39 year old man that couldn't  grow a decent beard until my 30s dont sweat it. It may seem like the worst thing in the world now but in 10 years you will look back and wonder why you wasted such good years on someone so shallow. Tldr the beard may eventually  come but you are only young once enjoy it. ",
            "BRI, the kind of girl who chooses a guy for whether he has a beard or not isnt the type of girl you want to be with. Good on you!",
            "Good for you, man. I hope you find someone who will love you firstly for your inner attributes, and then find aspects of your ever changing physical appearance attractive.",
            "Solid",
            "OP, you just dodged a huge bullet",
            "The projection is strong with that one. \n\n\nYou did good, OP. Now find yourself a great girl.",
            "She preferred men with facial hair, and you preferred women with some common decency--a happy ending after all.\n\nYou should've just taken my suggestion and gotten a fake beard for the laughs.",
            "Oh my poor brother, I'm sorry you had to go through this. She's stupid one mate, I'm glad you left her. Perhaps you'll find somebody else soon, but I hope you'll find solace without. Good luck to you mate.",
            "Don't feel bad, OP.  I'm female and I hate men with facial hair. I think it looks dirty and unclean.  I like fresh shaven men.  :) \n\n<3",
            "Anyone who won't date you just because of the hair on your face or head is not worth worrying about. ",
            "You dodged a bullet OP. Your SO should not be saying shit like that. ",
            "Just to give you some hope, I'm remarkably hairless and my girlfriend wouldn't have it any other way. So there are women out there that like hairless dudes.",
            "FWIW - I couldn't grow facial hair worth a damn until I was in my mid 30's.",
            "Wow, what a bitch. Glad you got out of there. You deserve someone who appreciates YOU. Beard or no beard. ",
            "Good on you OP for leaving, it takes a lot of  strength to pull the trigger first on that kinda stuff sometimes. I bet You will look back on it someday, as one of the best decisions you have made, I promise. Now go  find a new one and be happy bro! And now you have a better idea of what to stay away from with the next one. If they are that hung up on something like a beard or not that that's a person with issues you don't wanna deal with anyway. Good luck, finding the right one.",
            "Good man. Find yourself an amazing woman that appreciates a clean shaven Imperial god (we get the whole shaving thing largely from the ancient Romans, who were pretty much badass enough that cultures started to imitate their look).",
            "She sounds like a giant waste of time.  Good goin, go find someone who actually values your dignity and their's. ",
            "Wow. Just wow. I'm sorry this happened OP, but at the very least, this situation and your posting has helped expose her for the loser she truly is. Hope things will be better in your next relationship.",
            "Making me think i should shave my beard for a while and see how my missus reacts. ",
            "My god. You have actually dated the stupidest girl in the world. ",
            "I am jealous of my bf's lack of body hair.  He can't grow a beard that OK with me.  But his arms and thighs are frigging smooth and hairless. He has beautiful thighs, hands and feet that will make any girl jealous.",
            "A sad ending to this furry tale.",
            "You should have told her that you prefer a woman without facial hair....",
            "find someone who actually likes how you look, and she can go do the same",
            "She's a silly bitch. She'll learn. Stand by breaking up with her OP.",
            "I didn't read the original post but just from this post I am shocked! Good for you! She sounds horrible!!! Go out and find a girl that appreciates men without facial hair - There will be ALOT!!!! ",
            "I thought women usually prefer clean shaven men to bearded men?\n\nAnd I say this as a man who can grow a badass brutal beard, but keeps it trimmed to look professional like a modern man should.",
            "You're better off without her, she sounds kind of awful. Plus, you should be with someone who loves you no matter how bald your face is, and doesn't place impossible standards on you, and act as if it doesn't mean anything.",
            "I don't know if it has been said before, but man, if you had facial hair, she would have found something else to fancy in other men. It's just the way to get out of relationship, nothing less, nothing more. Some people just don't accept anything, whatever it is. ",
            "Good for you, kick her to the curb! ",
            "She is allowed to have preferences, you're allowed to have yours and I'm pretty sure the women you watch in porn look nothing like your girlfriend . ",
            "Of ourse she's allowed to have preferences, but that doesn't mean she has to be a bitch about it. She's together with someone who doesn't have a lot of hair. It's okay not to have a lot of hair. It's not okay to make you feel like shit about it.\n\n\n\n\n\nI Hope you'll find someone who isn't like that.",
            "I think you handled this very well. You told her how you felt without expectation, and she showed you that she didn't value your feelings. I know this is hard, but you are definitely better off. Stay strong brother.",
            "Good for you!  You are much better than that shitty GF.  Be who you are and be happy with yourself.  The right woman will come along soon enough.\n\nLike I told you in your prior thread, my wife hates facial hair so I keep mine shaved.  I had a beard and mustache in college and I looked like an idiot.  There are a lot of great girls who love clean shaven men.",
            "Wow, how shallow and vacuous can a person possibly be? Better off without it mate, there are plenty of women out there who do not give a flying fuck about facial hair.",
            "Go to the gym op. It will keep your mind of things and you'll look better for the next real WOMAN in your life",
            "I'm sure there are all kinds of reasons that some men don't have beards. Most of the ones I've met are Native Americans or have heavy Native American ancestry, depending on the tribe. I think there are some other indigenous groups around that don't grow beards either. My point is that you probably can't do anything about it, and beards are optional anyway. Don't worry about it.\n\nBeards are fun until I get close and suddenly I've got sandpaper on my skin. There are plenty of ladies out there who love a smooth face and will love everything else about you as well. Do not let this woman back into your life, and stay smooth my friend :-)",
            "Dont try to find out what happened between them. The fact that she was silent and stormed off means def something happened even if it was flirting. Find someone for you. Those tears were fake tears. She can go after that crush and u can get someone deserving of you. ",
            "> To make a long story short, I broke up with her. She cried, saying that she'll stop, but I wasn't having any of it. So that's that.\n\nGood. She should find a bearded guy and be happy. \n\nAnd as for you, it's personal anecdote, but the vast majority of women do not like bearded guys, so your pool of girlfriend candidates is extensive. \n\nWin-win. ",
            "She's shit testing you, don't stand for it.  Have the balls and tell her \"If you like beardy men so much, why don't you go find one then?\"\n\nThat's all it is.  If she actually does, trust me, it ain't your loss.  Plenty of fish out there who will treat you good.",
            "Good job,  she doesn't respect you,  you next her.",
            "you did the right thing OP, I'm proud of you!",
            "> I asked her if anything ever happened between them. She looked at me in silence, and then stormed off to her room.\n\nThere's more here, but really, it doesn't matter anymore.\n\nGood for you! You stood for yourself! You made the right choice. You deserve to be with someone that RESPECTS you. Someone who doesn't tell you to 'get over it' and 'suck it up'. \n\nYou can do better.\n\nGO NO CONTACT. GO NO CONTACT. GO NO CONTACT. GO NO CONTACT. \n\nRepeat this mantra to yourself.",
            "I love my man with a beard, stubble, or baby face.\n\nYour ex is a dumbass.",
            "OP, you are the man! In my opinion, she has not be respecting for a long time; not okay at all. You made the right move.",
            "I like guys with longer hair, always have. My husband? 32 and bald (not by choice). Sure I've made a few jokes here and there (we regularly rip into each other in a playful way; we were best friends before marriage and still act as such) but I couldn't care less whether he has hair or not because I love him. \n\nAmy sounds like an immature bitch and you're so much better off without her. You'll find someone who loves you no matter what.",
            "As a fellow facial-hair-deficient guy, I say good riddance.  I'm 42 and if I let it go for a week or two, it's visible...but not in a good way, lol.\nBeards are a current fad anyway, so don't worry.  Eventually the hipster fad will die off, once they all find something else to cling to.  In the past, you had a beard because you wanted one, and there weren't memes, clubs, t-shirts, vines, etc about it.  Now it seems like beards are used to add 'masculinity' to men who possess none of it otherwise.  I build cars and shoot guns for a living, I don't need a beard to feel macho ;)."
        ]
    },
    {
        "post_id": "cyms4r",
        "author": "workspace001",
        "title": "I (F/28) am not sure what to do about creepy housemate (M/27)",
        "url": "https://www.reddit.com/r/relationships/comments/cyms4r/i_f28_am_not_sure_what_to_do_about_creepy/",
        "score": 2572,
        "num_comments": 261,
        "created_utc": 1567416540.0,
        "selftext": "Hi Reddit,\n\nI live in a share house with 4 other people, I’ve been living here now for 3 years.\n \nOne of the housemates let’s call him David has always tried to make cringeworthy jokes to me and thinks he’s really funny. He always thinks he’s right and said little insults to me I.e why do you buy this brand of food, it’s so bad and always asks me about my ex boyfriends. \n\nI was dating a guy who was a little bigger and his response was “why did you date him? He was such a douche and did the bed break when you were with him”\n\nOne night ( a few months ago) he wanted to watch a movie and I agreed. He turned the lights off and halfway through the movie I didn’t feel comfortable. I explained to him I was tired and wanted to go to my room. I left and he started sending me abusive text messages about how I was so rude to leave. I responded back saying I have the right to leave the room if I want to. \n\nI also explained that I didn’t want anything more to do with him than just a housemate- that’s it. He again got angry saying that he only wanted me as a friend. \n\nThis guy walks around in expensive brands and always has to buy the latest Apple product even though he has perfectly good Apple products already. (He works in a grocery store)\n\nRecently, the last 2 weeks, I’ve decided to buy the game UNO to get everyone together and have some fun as usually everyone sits in there seperate rooms and don’t socialise. \n\nThe only person who wants to play UNO is David. He’s starting to ask me questions like: “have you had sex in the shower before” “we should play UNO in my room” “if you ever want to come into my room, you can” “have you been to a strip club before” \n\nLately he’s said to me “we should seriously go for a drive” or “we should go to this particular place where there is a lookout over the city” then when I said “no” he says “we can go anywhere where you want to go”\n\nLast night he says to me “tomorrow let’s go out for dessert after your work” I said “no, because I just don’t want to” \n\nSince then this guy has completely ignored me and will sit ages away from me on the other side of the room. \n\nIt’s been super awkward and it’s obvious he’s pissed off because I keep rejecting him. \n\nI’m not sure where to go from here or what to say to him?\n\nI really want him to move out of the house.\n\nTLDR: housemate has made advances towards me and is asking inappropriate questions. He is now ignoring me and it’s super awkward.",
        "permalink": "/r/relationships/comments/cyms4r/i_f28_am_not_sure_what_to_do_about_creepy/",
        "comments": [
            "Inform the other roommates of the situation.\n\nOnly interact with David when other roommates present. \n\nEach time he makes sexual innuendos reply with the truth \"When you speak like that David it makes me feel very uncomfortable and I lose respect for you as a person.\"\n\nBetter boundries need to be set as well as david needing to learn proper ways to interact with women. He's approach is offensive and immature. He is attempting to bully you into a relationship thinking persistence will wear you down. I commend you for trusting your instincts.",
            "[deleted]",
            "Please, be careful. I’ve had a creepy housemate who wouldn’t stop harassing me. He went as far as watching me sleep, undressing in front of me (pretending to “lose” his clothes, pretending to not know I was in the house), would tell me he masturbated thinking about me, tried to ruin my relationships and would act nasty, pouty and downright mean when rejected. \nEven after moving out, I had to deal with him and his stalker behavior for years. He would show up in my house and threatened to ruin my career with false complaints because I didn’t want to sleep with him. I was only 19 when I met him and should’ve been way more cautious, blunt and take it more seriously. Unfortunately, some people around me thought his behavior was way too outlandish to be true because he was “cool” and some even said I was overreacting until it became too obvious. This guy will interpret anything and everything as inviting behavior so be dry, blunt, move out and avoid him at all costs. In the meanwhile, lock your door, always check for hidden cameras, hide your belongings. Never, ever be alone with this guy. Be careful with your information online and if possible don’t have any kind of relationship with his friends or acquaintances.",
            ">I’m not sure where to go from here or what to say to him?\n\nDo nothing. Right now he's sulking but he will be sniffing around again and will take anything (apologies or friendliness) as a green light. You need to shut down the comments, questions, and behavior as they come up. Be as assertive as you can without undermining yourself with \"please\" or \"sorry\".\n\n\"You're making me uncomfortable, knock it off.\"\n\n\"What a rude thing to say.\" (Or \"wow, rude\" if you're feeling bold) \n\n\"If you're going to use my number to text insults or be abusive, I will block you. Going forward only use my number for actual emergencies or things that pertain to the apartment.\"\n\n\"No, I'm not interested in going out with you.\"\n\nDon't cushion the blow or make him feel comfortable for the sale of harmony. He's crossing boundaries and feels he can get away with it because he thinks you're not willing to rock the boat. Talk with your other roommates too about how he's making you uncomfortable and that you're thinking about approaching the landlord.",
            "[deleted]",
            "Also, avoid being alone with him. I would carry some pepper spray with me and plan escape routes just in case. Always trust your gut and never feel sorry for this guy if he makes you feel uncomfortable. Would you be able to install a surveillance camera outside your room door and inside your room as well? Just in case. If he ever threatens you or puts you in a situation where you feel you need to call the police but you’re not sure, call them anyway. Always take your phone wherever you’re going. Read “The Gift of Fear” for more tips.",
            "One thing that strikes me is that you've bought into the mentality that you need to care about this guy's feelings. You've been polite to him, friendly even, but he's acting entitled to your time and attention even after you said that you didn't want to be more than roommates. If you're not going to move out and you're stuck with him, then... \n1) don't socialize with him at all. You can say hi and bye, but don't ask him how his day was and if he asks you how yours is, just a one word neutral answer is all you give him. \n2) call him on his shitty behavior. When he texts you abusive things, don't respond in text but go into the other room and say \"you can't talk to me this way. You may only message me about the apartment. We're not friends, you have no reason to text me. So don't.\" \n3) STOP FEELING BAD FOR SETTING BOUNDARIES!!! That's how guys like this manage to guilt girls into giving them attention. Is he pathetic? Yes. Do you owe him anything because of it? Absofuckinglutely not. \n4) talk to your other housemates especially the women, and let them know that you're setting this boundary. Ask them if they've had similar interactions with him and give them your support. \n\nSay it with me again ladies - you don't owe him your time or attention.",
            "God, please be careful.",
            "Start recording the things he's saying and keep all the messages. Tell the other housemates about what's been going on too just so they know and if he's being creepy again and they're around they might be able to help in some way. \n\nYou've said that the landlord decides who moves in so if I was you I'd go to them and tell them you enjoy living there and the other housemates but David is making you feel unsafe and uncomfortable and ask can he be removed from the house. Show the landlord the messages you have too as proof. If the landlord isn't having any of it then I'd say move out for your own safety and peace of mind\n\nETA: Don't engage with David unnecessarily just ignore him for now and let him have his hissy fit",
            "Make sure you aren’t alone with him. Guys who act this way purposely misread signals so if you’re nice to them they believe you’re leading them on. Even if he’s having a good day and doesn’t seem creepy don’t agree to watching movies or anything alone with him.",
            "Unfortunately it looks like you might have to move out. If he likes you, there’s no way he’s leaving because he wants to stay close to you. I’d probably start looking for a new place. Rejection can be hard on someone, especially if they do really like you, sounds like he may resort to being vindictive in the end and if it was me, I’d get out of there.",
            "Check for cameras and do not come home extremely intoxicated around this guy. Move out",
            "' Since then this guy has completely ignored me and will sit ages away from me on the other side of the room. '\n\n...... good?",
            "I'd keep any unsealed food of yours in your room and look into buying/renting a mini fridge. I wouldn't chance it for a creeper to try and mess with your food.",
            "I'm so confused what his purchase of the latest Apple products has to do with anything?",
            "Tell your other roommates about David.  Then move out as fast as possible.  Also, check the bathroom and your bedroom for any cameras involved.  Keep the text messages as possible evidence against him.  Take this to the landlord and see if you can break the lease.  If you have trouble doing that then see an attorney (to see how you can get out of the lease) as well as about David because he is harassing you and you will need a restraining order against him.",
            "I'd fucking move out before he causes any real harm. And be smart about moving out. Keep your searching low key and one day just pack up and disappear. I don't know about the other room mates but you can let them know as a courtesy if you think they are trustworthy.",
            "Definitely talk to the landlord - this is not okay and harassment.   Write down every instance with a date, so you have a list of incidents for sure.  \n\nBut yay for you being straight forward and standing your ground! Under the circumstances, you’re handling it very well it sounds like. M\n\nLet him sulk. Maybe the discomfort of being rejected will help him move out.  And Hopefully he’ll go into debt cuz of apple anyway and won’t be able to pay rent lol.",
            "Had a creepy guy in a house share when I was at university. Not going into all the gross stuff he did but we complained to the landlord and he got booted out. Izipizi.",
            "I agree with the majority of advice here; you need to move out. David won't get better no matter what you do. I'd also be prepared that he will likely continue to textually harass you. \n\nI also think you're a fantastic person for listening to your intuition and firmly saying 'no' to him - establishing boundaries and learning to say no is such an underrated ability.",
            "If you've got other female living there talk to them to see if they feel the and way. Talk to your landlord, preferably in writing. Say that you think he's a problem and that you don't feel safe with him there (the not feeling safe part is important to get in writing). Some landlords are responsive to this kind of thing, some are not, but most don't want to be sued if something does happen to you and they were aware of the risk.\n\nNext if he harasses you in anyway way that can be captured (text message or Facebook messages) or is witnessed, make sure you keep logs of it. Also very clearly say to him at the time it is occurring that you do not want the interaction and that you do not feel safe around him. Especially if he won't leave you alone after you say that, or even if he does for a while and then it starts back up, go to the police for a restraining order. If you have a restraining order he won't be able to come back home, so he'll almost certainly move out.",
            "I would suggest you have a meeting with the other housemates and explain your side of it and that you do not feel comfortable. Do this in a public place away from the house, probably while he's at work if your schedules sync up. There is no reason you should feel uncomfortable where you are living and he sounds like a major douche.",
            "Guys like this will not become better. You’re either going to have to tolerate him, or move out. You could also try telling your other roommates about him, but I don’t know what the dynamic is between them (if they’re closer to him than you, or have some other personal ties to him, then they probably aren’t going to side with you or force him to move out).\n\nI’m the meantime, I’m baffled by why you would think organizing games is a good idea. You know this guy is looking for any reason to interact with you. Why would you want to force your roommates to socialize, knowing that he’s a part of that (very small) group? Just stop doing that. If you like your other roommates, you can always socialize with them once you’ve moved out.",
            "I would start looking for a new place to live. This guy is a creep and I wouldn't feel safe there. And definitely do NOT go for a drive with him. Honestly, I know it's shitty to have to find a new place but your safety is more important than the inconvenience. This guy is full of red flags. Get out of there. Or talk to your other roommates and see if they're willing to have him evicted (but that will be awkward and you'd be at risk of him lashing out).\n\n\nThough I don't get what this has to do with anything:\n\n> This guy walks around in expensive brands and always has to buy the latest Apple product even though he has perfectly good Apple products already. (He works in a grocery store)",
            ">Since then this guy has completely ignored me and will sit ages away from me on the other side of the room.\n\nSounds like the problem has sorted itself out. Maybe you 'll need to be the one to move out when your lease is up. Sucks but better to be safe than sorry, imo.",
            "[removed]",
            "You shouldn't have to move out.  You need to be clear in telling him you're not interested and him and to stop behaving that way.  If he doesn't stop, call a house meeting and ask the roommates to put pressure on him to stop.  If he doesn't, you guys should kick him out.  Sexual harassment is illegal.",
            "talk to your landlord and get him out, he is a leer",
            "OP, I am hella nervous for you. This guy is obviously trying so hard to get you alone. He is super creepy and it seems like he’s looking for any chance to take advantage of you.  If your landlord won’t let you kick him out, find somewhere else to live. This is not worth it at all and your safety is the most important.",
            "OP I cannot stress enough - this guy will do everything he can do to make you look like the unreasonable, rude one including avoiding you and sulking when you don't melt for his awkward advances. Let him!! You are not the one being rude - he is. Google \"return the awkward to sender\" and read up on some Captain Awkward posts about people dealing with That Awkward Person Who Won't Take No For An Answer and some of the advice she has for dealing with that. I don't love all of her advice but her advice on this stuff is A+",
            "If he's finally giving you distance, then take it. He's just a housemate, and you don't have to interact with him beyond what's strictly necessary. Give him a cold shoulder when he's not respecting boundaries; be respectful in return when he is. With people like this, it's best to just emulate the kind of interactions you want and ignore the rest. Even if you spoke seriously about why you need him to leave you alone, he is probably not mature enough to absorb it, so you have to lead by example.\n\nIf he gets openly difficult or abusive or refuses to respect basic boundaries, you can ask for a house meeting and call him out on it as a group. Public shaming like that may not change his behavior but he might get self-righteous enough to leave.",
            "He's ignoring you now... problem solved. Just be ok with the awkwardness or you'll have to move out.",
            "Move out. You can't make someone else leave. You can ask, but I wouldn't expect anything good to come from it.",
            "It honestly sounds like the only solution is for you to move. If the landlord won't do anything and your roommates won't either then it's all that's left. Obviously you should not subject yourself to such harassment but it really sucks that no one will support you. Hopefully the next place you live will be more supportive and safe. No one should need to lock their door because they're afraid of someone implanting cameras or going through their things. You're in a hostile environment so please don't downplay your own suffering. You're not overreacting at all,you're 100% justified to feel the way you do!\n\nAs a last ditch effort you can flat out tell him,very bluntly,\"I do not like you. I will never like you. If you keep trying to flirt with me then gaslight when it doesn't go your way, we're gonna have major issues. I'm no longer going to sweep your behavior under the rug and refuse to excuse it. You're a grown ass man so deal with your feelings now.\" And when he next tries to do it shut it down asap,as blunt as possible. He wants to play with Powe moves and you are more than capable of meeting it.",
            "I’d get out of there.  like someone already suggested, if I were you I would get at least 1 camera so you can get an idea of what might happen when you aren’t aware. I’d also search to make sure there is nothing he has hidden to spy on you... that may be too far, but People are crazy. Be safe!",
            "i say move out, and dont get drunk around him , only eat and drink the food you know for a fact he hasn't tampered with. he's not safe to be around at all and dont be alone with him  \nalso tell him off when he's creep,y fuck politeness you need to be safe",
            "You have zero obligation to interact with him or be polite to him. Just completely ignore him. Don't answer his messages of any kind. If he confronts you in person, simply tell him that you're not interested in any contact with him in any way. You don't owe him any kind of explanation.",
            "tell your landlord that he is creepy and you are scared. also tell the police if anything meaningful happens.\n\nalso tell him your thoughts honestly and judge how he reacts to it.",
            "I used the voice recorder on my phone to record my abusive ex housemate yelling and screaming at me through my bedroom door. Then took that to the landlord who evicted him. He was my sisters ex boyfriend who we let stay as he didnt have anywhere to go, i believe his aunt took him in after he left. To this day, my cat is terrified of men yelling as he was usually in my bedroom with me as the ex housemate would go for my kitty too.",
            "Boundaries. \n\nYou need to clearly say “I have been getting persistent hints and suggestive remarks from you that make me uncomfortable. We are roommates, nothing more. Please respect that and behave accordingly”\n\nIf he can’t deal with that and it’s your place, you should give him notice. If not you should consider moving. \n\nIf he’s as bad as you say the other roommates will be aware of this and if they’re decent people, will back you up.",
            "Him ignoring you seems to be the best outcome? I mean what do you gain from interacting with him?",
            "The one thing I don't see in the story is you directly asking him to stop the problem behavior. You've told him you're not interested in him sexually, but he can still plead ignorance regarding particular behaviors being a problem (genuinely or disingenuously). Remove that plausible deniabity by telling him he needs to stop the behaviors the next time he harasses you. \"David, asking me about my sex life is really inappropriate; don't do that.\" \"David, don't send me angry text messages, I don't appreciate it.\" Once you've done this, or if you've already done it, you can go to your housemates and tell them David has to go because he's been harassing you, you've asked hin to stop (clearly and directly!), and he won't stop. Since you've removed any ambiguity, you've undercut the common apologetics for harassment, and your housemates' reactions will tell you what to do: you either have their support in kicking David out or you need to get away from all of them because they're intent on enabling his behavior.\n\nThere may be a way you're sabatoging your own efforts so far: you seem interested in a sort of shared living arrangement in which your other housemates are not especially interested, where you get along well hanging out together and do shared activities on a regular basis. I read their lack of interest from the existing pattern of hanging out seperately in your own rooms and their disinterest in a game night, and your interest from that suggestion and the fact that you present the fact that the guy who's been bothering you is now ignoring you as a problem about which you need to do something rather than a successful assertion of boundaries. You can still be friendly and pursue friendship if they're also interested, but they may not be, so it might help to let go of the idea that there's anything to fix if David continues to leave you alone and your relationship with your housemates is polite but distant (or even avoidant).\n\nAnd if you are really interested in a kind of household dynamic in which your other housemates are not, it may be a good idea to consider looking for other housing irrespective of the David problem.",
            "Screenshot his text messages and post them to r/niceguys",
            "If you do have a good relationship with the other 2 roommates, you can have a little meeting with them and see what they think about him. If that is not an option, then there's not much you can do... You either put up with him and keep your pride or you \"give in\" and move out.",
            "You making a dramatic deal out of an easily solved issue",
            "OP, while I’m not going to diminish the fact that this guy sounds like a creep, I’m also going to say you haven’t given me much to go off of here Other than he’s annoying. Things in your story have been glossed over. \n\nHe turned the lights out while you guys watched a movie? It’s 100% normal to watch a movie in the living room with the lights off. Yes, even with roommates. What’s not normal is if he’s encroaching on your physical boundaries or saying things. Did he? You didn’t say. You just said you were uncomfortable and left the room. But why? What did he do? (Note: I’m not blaming you in this situation, but My advice would vary depending on what exactly was done). \n\nI saw nothing in your message to make me suggest he’s taking sexually creepy photos of you on a webcam as others have said. I totally could have missed something though. \n\nSo my advice on how to handle a socially awkward loser who thinks he’s cooler than he is? (Cause he seems more along those lines vs a sexual predator.. but again.. I could have missed something). Do not go out of your way to pay any attention to him good or bad. Do not hang out with him.. at all. Do not answer his texts. You owe him zero explanations. He is not your friend. He doesn’t have to be your friend. That’s okay. You can say this to him if he questions you, and why you’re ignoring him. You’re 100% in your right to do that. \n\nAlso. Not to be rude, but you’re 27 years old. Buying Uno and having ALL your roommates play but him is childish.",
            "is 28/F and 27/M a typo? did you mean 18/F and 17/m? \n\nbecause this is ridiculous. He is WAY out of line. And you also seem a little naive about the situation. \n\nhe's trouble. Ignore him. Move out as soon as possible. Put pressure on your roomates not to be 'neutral' in the face of such creepy and inappropriate behavior.",
            "Maybe try actually talking to the man",
            "It’s not your landlords problem it’s yours, so don’t expect your landlord to take sides.\n\nThe best response is no response, every time you justify your answers to this guy you’re inviting conversation.\n\nIf he’s sulking and trying to guilt you it’s time to celebrate. Enjoy his childish behavior. If you really need to talk to this guy then say something like “Can you please return to your sulking behavior, I like you best when you’re invisible”. Ignore ignore and ignore him some more.\n\nDon’t share a game with him, why you’re inviting social interaction.\n\nIf he texts you your reply is simple, “Don’t text me unless it’s something important about our shared home”, keep sending this reply and don’t justify it.....”Why don’t you like me”.....”Don’t text me unless......\n\nYou need to act like a broken record.\n\nHe asks about a boyfriend, NO REPLY\n\nYour goal is to shut him up and make HIM uncomfortable.\n\nStop sharing your life with this guy, he shouldn’t know who you are dating, where you work, and what you do.\n\nI have had to deal with extremely difficult manipulative dopes in my life and the only way to deal with them is to flip a switch in your head and make them invisible. \n\nDon’t expect the rest of your housemates to gang up on your problem child, he’s your problem and it’s up to you to solve it.\n\nIf he threatens you in any way shape or form, DO NOT WARN HIM,\n\nCALL THE POLICE. None of this shit “I’m going to call the police, do you want me to call the cops, or any version like that”. Just do it.",
            "Laugh at him. Creepy men hate being laughed at.",
            "I should tell him ur gonna file a police report if he talks to u again, and u should straight up fill one out, u have told him no many times he is now harassing u and is extremely creepy make sure during ur report u explain how creepy and in denial he is I wish I could talk to this man maybe I could make him stand straight, he such a coward",
            "Wow this sounds like it belongs to r/niceguys ...",
            "You don't  deserve all these drama from this creepy housemate and your other housemates asking you inappropriate questions. If I were you, it's time to move out and find another place",
            "Don't let him make you feel bad for his sulking! Essentially, this was the goal - for him to stop being innapropriate with you but if this is the only way that'll happen, so be it.",
            "Jesus. I had flashbacks to the guy who lived next door to me in the dorms in college from the \"have you ever been to a strip club before\" line. Dude would ask that to women all the time. He did not get a lot of women. \n\nMy advice, move out as fast as you can. Like couch surf if you have to. Dude seems creepy as fuck. Honestly, even talk to your other roommates, see if you can vote him out.",
            "You should talk to your other roommates about this and if they are understanding you can kick him out. If they arent understanding then you should start looking for somewhere else to live",
            "Have you talked to the other housemates? What's their opinion on this? Is he making them feel uncomfortable or just you?",
            "Talk to your other roomates and get him evicted by consensus, dude sounds like he was homeschooled but couldn't use proper romantic attraction skills",
            "If you can find a replacement roommate your landlord will be fine with it. As long as other person shows proof of income, background check etc. You all would just have to add the person to the new lease.",
            "I have had issues with a housemate making me uncomfortable. I told the person that owns the house and he was told to leave at the end of his payed month. He didn't go as far as your guy did but your landlord should have your back. Until then just avoid him at all cost.",
            "is this the same MARRIED housemate from your post history?!?!!",
            "I would totally want an update of this one!!",
            "Speak to your other roommates and landlord about getting him out. If this isn’t possible, I would suggest you move. In the meantime please avoid being alone with him.",
            "It is not your responsibility to be nice to him and he does not deserve any explanation from you. No is a complete sentence.",
            "Establish clear boundaries; “I do not feel comfortable when you say those things.” Also contact LL.",
            "Always answer his questions with a question.",
            "Where are you located? Local Tennants rights organizations and or a lawyer should be who your really seeking advice from.",
            "I have been in a similar situation. Do not trust this guy. The fact he’s trying to take you out to random locations is hella creepy given the context. You don’t owe him shit, your safety is the number one priority. Who cares if it’s awkward at this point, tell him directly your boundaries (e.g. don’t speak to me, I don’t want to hang out, etc.)  and don’t be nice about it. There is not much you can do for creepy behavior even with the cops. The cops can run a background check on him though, and if it comes up with stuff on it that went unchecked you might have a chance of changing the lease. Make sure to tell friends and family your situation and details, in case anything does happen and so they can check on you more frequently.",
            "Girl...time to move the hell OUT, ASAP.\n\nThis dude is the kind of creeper who would probably sneak into your room to watch you sleep, or steal your underwear. The guy has masculinity issues and he clearly doesn’t respect your boundaries, and you don’t need to be on the brunt end of his continuous and unwarranted sexual frustration. \n\nRun for the hills, and buy some pepper spray while you’re at it. I can’t stand anything more than a man who ignores a woman when she says NO.",
            "It depends on who has been there the longest. who's names are on the house paperwork and/or who were the first original people who lived there before anyone else? (I assume they'd be the ones to make the decision of him leaving or not). Do your other housemates know about all this or are you guys not even friends with each other, you just live together?? I would get with your housemates and talk about his behavior and have a sit down with him about changing his approach/attitude towards you while you're both at home or HIM start looking for a new place to live. You aren't the problem so you shouldn't be the one to leave, especially if you don't want to and are happy where you live. I would sit down with him and have an adult conversation about how he acts and carefully explain that not everyone is gonna be attracted to him, that being that aggressive towards a housemate/friend isn't healthy or cool AT ALL. THEN, if that doesn't work, I'd sit down with everyone except him and explain the situation if they don't already know. Its unacceptable of him to act like that and make you so uncomfortable that you leave the room of your OWN house.",
            "Be careful, like several others have said trust your gut. Honestly if the situation or anything to do with him makes you uneasy any decision you make for yourself or to make yourself feel better or safer is the right decision!",
            "Hi, I was in this sort of situation at uni. If it wasn't for the ages, I'd wonder if it was the same guy. I didn't deal with it soon enough, and it escalated to the point where I was terrified of him, and I didn't know what he was capable of. \n\nIf you can get out of there, please do. Discuss with your landlord whether you can get out of your lease/find someone to take it over. \n\nMake sure the other housemates know so they have your back or can look our for you if things escalate. If they don't believe you, get the fuck out of there. \n\nKeep a log of what's going on.\n\nLock your door when you're out. Lock your door at night. \n\nYou're better off with him being awkward and ignoring you, but please, watch your back.",
            "I’ve been in a very similar scenario in the past. \n\nI’d say either tell your landlord about his behaviour, or just move out and find somewhere where you don’t have to deal with that. \n\nHome is somewhere you should be able to relax and feel at rest, not anxious ‘cos some creepy guy is bothering you all the time.",
            "Just be really creepy back.  Get a bunch of photos of you, make thousands of copies, plaster them on his bedroom wall while he's away and with a big paint brush write in black, \"Do you love me?\"  \n\nRule of thumb with creepy dudes.  If you can out-creep them, then they'll never mess with you again.",
            "Be careful. Are you safe? Make sure you’re safe in this situation. Him trying to get you alone is a tad alarming. Don’t go anywhere alone with him (not that I need to tell you). Like the others said talk to your roommates and your landlord about how you feel unsafe and intruded upon, maybe the other roommates feel the same and I’m sure if the three of you come to the landlord with this concern they’ll do something about. Maybe you’re not safe there, so first and foremost always make sure you’re safe and do what you need to do to ensure your safety. \n\nAgain, him trying to get you alone is somewhat alarming and he seems slightly obsessed with you.",
            "One thing I wish I knew when I was younger was how to draw boundaries. It ok to draw boundaries, even if it makes others upset. As soon as he asks about sex in the shower you can firmly say that question is not acceptable, never ask me stuff like that.  When he mocks you for drawing a boundery you say well I don't know why you would have a problem with me setting my own boundaries I quess this conversation is over, goodbye. Some people push against others boundaries till they are way over the line. He is either a creepy guy you need to be careful of or he likes you and is inept at relationships. Talk to him, draw boundaries. Be careful and talk to you roommates. Talk to the guy in charge and let him know what's going on. You might have to move out if you still feel unsafe,",
            "Check his criminal history.",
            "I was thinking \"creepy, but somewhat ok\" up until the Uno part. \n\n\nIf he does leave, you should. This feels like a behaviour that can escalate to something much, much worse, for you or others.\n Please be careful, OP. Check your house for cameras, lock your room at night, interaction only with other people present. Talk to your other roommates, just in case someone also feels harassed or uncomfortable, and ultimately talk to the landlord, if you feel the situation gets out of hand.",
            "I would suggest leaving. Sorry. \n\n&#x200B;\n\nThis is a legal issue as much as a relationship issue. If he is on a lease, there's no reason here he can be evicted early - I assume he's paying the rent. If he is month to month, it could still take months to get him out of your home if he fights the landlord's request to leave. \n\n&#x200B;\n\nIt's not fair, of course. But as a tenant he has rights too.",
            "You should ask him to move out if he makes you feel that uncomfortable",
            "How did you handle your previous housemate from this post?\n\n\nhttps://www.reddit.com/r/relationships/comments/a27pk9/i_f27_am_not_sure_if_my_housemate_m35_is_trying/?utm_source=share&utm_medium=ios_app\n\n\nSeems pretty similar in nature.",
            "Have you ever just told him... hey dude you’re not amusing... and then walk away? Being direct is hard but definitely important. Especially when y’all live together.",
            "Explain to the landlord/other roommates that you don't feel safe and that David needs to back off....\n\nAlso - Check your room for cameras",
            "I would gather evidence, get a restraining order, and then he wouldn't have a choice but to leave lol",
            "Well sorry but I think either you or him gotta leave, otherwise the uncomfortable stuff will continue. Maybe it will be much limited and you can set boundaries, and maybe it gets really bad and he tries to assault you or some shit  (that's the worst case, depending on what type of person he is).. so ye if you can just leave and give yourself a break from all the be don't hesitate.   \nWith these things I don't suggest having the mentality of \"no im not going to run away\" and all the brave stuff, there is a person living in the same house who is physically stronger than you and probably have bad intentions, be a coward, put your safety first, life is just much better when you don't have memories of frkn sexual assault.",
            "Tell him you don't shit where you eat, then he moves out. Followed by you blocking him.",
            "I had a roommate alot like this and it ended badly get out or make him get out and fast",
            ">he started sending me abusive text messages about how I was so rude to leave\n\nCalling you rude isn't abusive lmao",
            "Tell him not to speak with you, period. Don't talk about my sex life, don't talk about my relationships, don't talk about my fucking food. Keep your fucking opinions to yourself. Just like that. Say it just like that. Then slam the door, block his number. And if you hear as little as a peep out of him, scream \"SHUT THE FUCK UP\".",
            "\"David, it feels like you are hitting on me and I don't like it. I am not interested in you, and it is very uncomfortable because we are housemates. You really need to stop it. I know that sometimes you are just joking, but I don't like those jokes either. No more sexual innuendo, please. No more come on lines. No more dirty questions. \"",
            "Contact your landlord.",
            "Share David's behavior with your housemates and how it makes your feel so that the dynamic is clear and you are not alone. Abusers like to isolate victims. Perhaps tell your landlord everything via email so that you have a paper trail. Hopefully he is all bark and no bite but stand your ground and never be alone with him. I wish you the best.",
            "I think his use to girls that cave in to his advances. If you want to help him slowly explain each time hiscbeing inappropriate to him. It does depend on how he takes the first explanation. You possibly will one day who knows. I only say this as anything can happen and he may flip his act around and grow on you.",
            "I bet he is unattractive right? Is that why he is creepy? You mentioned he stopped talking to you, what's the problem now?",
            "I don't understand why you keep leading him on if he \" creeps \" you out.....just tell him you're NOT interested in him and let it go at that",
            "If not even your other roommates socialize, I\\`d say just move out. There is no better thing than living with people you actually like and can hang out with regularly i.e. play games and have drinks",
            "Talk to your roommates about the situation. Keep track of convos etc. If he sends harassing texts, keep them on a file and then email your landlord. You shouldn’t have to move out, the creep should.",
            "I really think you should talk to the landlord ASAP and explain what’s been happening and how he keeps coming on to you regardless of what you say. This is where you live, you shouldn’t have some creepy dude who doesn’t respect your boundaries being inappropriate",
            "He's a nasty person and you need to tell your landlord everything about what he has been doing, for starters.",
            "You don’t owe him anything. Watch your stuff, and watch your back. If you feel unsafe, tell your other housemates. Or call the cops.",
            "Sounds exactly like a sociopath I “dated” for all of 3months, during which time I tried to breakup with multiple times but each time he would spiral into an abusive crazy zone, and we had a ton of friends in common, so I’d agree to a fwb deal thinking I’d slowly fade out, but he was a piece of work. Without going into the scarier details, I think you should talk to your other roomies and discuss his privilege of living in the house. You deserve to live in a safe environment. He should be given his 30days. \n\nLegally, in case he tries something, you need to send him a text requesting that he not contact you unless it is house related, as he has on multiple occasions made you feel uncomfortable and been invasive.\n\nThen don’t worry if he acts like a pouty little beez, cuz you have every right to unapologetically request a safe zone of a home.",
            "You rejected him and while he may have handled it semi-poorly, hes kept his distance. So now you want him to move out? \n\n\nYou get to determine your boundaries with other people and how you communicate with them. You don't get to determine how they receive that.",
            "[deleted]",
            "[deleted]"
        ]
    },
    {
        "post_id": "qn4rsl",
        "author": "lapras_49",
        "title": "UPDATE: My (23M) coworker (21M) is a really great guy. How do I stop jealousy from ruining our friendship?",
        "url": "https://www.reddit.com/r/relationships/comments/qn4rsl/update_my_23m_coworker_21m_is_a_really_great_guy/",
        "score": 2573,
        "num_comments": 85,
        "created_utc": 1636092714.0,
        "selftext": " Update to [this](https://www.reddit.com/r/relationships/comments/qjztwf/my_23m_coworker_21m_is_a_really_great_guy_how_do/) post.\n\nIn my last post I basically said that I'm jealous my coworker gets flirted with a lot, and I ended up turning down an invite to hang out with him because of my insecurities.\n\nWell, I decided to ask him yesterday if I could take him up on that offer of watching movies like he previously mentioned. He smiled really big and genuine and said he'd love it. Why not tonight?\n\nI couldn't believe he actually said yes, and even wanted to do it THAT NIGHT. No excuses, no pushing it back for weeks. I was fucking ecstatic.\n\nWe couldn't decide on a film, so we started talking about TV shows, and decided to just watch Breaking Bad, since we'd both watched it and enjoyed it before.\n\nTbh we talked through most of it, but it felt amazing to just be able to let go and be comfortable around him outside of work.\n\nThanks to everyone who talked to me and helped me!\n\nTLDR; I decided to ask my coworker to hang out and it was great. Hopeful for the future",
        "permalink": "/r/relationships/comments/qn4rsl/update_my_23m_coworker_21m_is_a_really_great_guy/",
        "comments": [
            "That's great!\n\nWhen you're a bit more friendly with him, and you start talking about relationships, just don't lie to him. Tell him the truth. You're insecure and you never had a real GF.\n\nHe sounds like a good guy, he'll probably offer to be your wingman!\n\nDon't be jealous of your friends. They are there to push you up, not to bring you down. So push him up and he'll do the same for you.",
            "First of all well done for putting your insecurities to one side to accept another person's company, don't mistake it for jealousy.\n\nThis friendship can offer you a lot in terms of becoming a stronger and more self aware person. As you get to know each other more just be open about yourself, he'll appreciate it and he could actually really help you become a more confident individual!\n\nBut also do ensure you don't simply displace your self-esteem issues onto him, be a positive influence to him also. And honestly, if any engagement does fizzle don't start assuming \"Oh it's happened again\" - people have their own things going on.\n\nWell done for taking the first step, and all the best in your new friendship!",
            "Good work mate. Good friends last a lifetime but need to be cultivated and worked on like any relationship.",
            "So uhhh, i hope OP isnt blindsided if his friend is gay or bisexual and is into him and he just missed it.\n\n&#x200B;\n\nBeing that excited to hang out one on one with a dude may indicate more than just friends",
            "Nice, happy for you mate! Friends are a great way of meeting women too :)",
            "Bro if women are flirting with him a lot, he’s going to be the ultimate wingman. Anytime you go out with him there’s going to be women approaching you guys. The heavy lifting is already done. This is an absolute win",
            "OP is it possible you might be bi and misinterpreting this jealousy slightly?",
            "That’s great that it worked out for you guys! Making friends can be hard. I had a friend in hs that I felt was prettier than me. I had low self esteem, and she didn’t, while I acted like it. She was more open and got flirted with more, or so I thought. Turns out, guys flirted with me all the time, I was just too paranoid to believe it. It always felt like a joke at my expense. Once I accepted that, I could let go of my jealousy. You may not realize how attractive you actually can be, because of something in your own mind. Relax and try to be more open to positive vibes in your life.",
            "That’s a really great update! I do still agree with people who have suggested counseling, though. That issue hasn’t resolved itself and it’s good to talk it out with someone. You’ll find that it’s amazing to have someone to talk to about these things that could slowly help you become less insecure.\n\nYou should know, though, that *most* people are insecure, even the ones that seem to be very confident, ones you feel are good looking, ones that are rich, etc… I don’t know if it helps you feel less alone to know this but it IS true. Many people that seem confident are faking it, which isn’t a bad thing. I think it helps get them to a place where they really do become confident in themselves. That’s something you can try, too. Confidence with kindness. (we don’t need more entitled people in the world. Hehe)",
            "It seems like you may be basing your happiness on others approval of yourself. And when that is in Jeopardy you feel resentment. I suggest personal introspection. And forming an idea of what you value and sticking to it. That will bring a sense of self/identity and you won’t feel jeopardized by being (in your own perspective) challenged by someone else’s prescience.",
            "In RE your previous post, I'm happy to tell you that no one worth spending time with cares if you're a virgin or not. There's no shame in being insecure about it (I was too when I was younger!), but ultimately it's a meaningless distinction. We're all on journeys with different timelines - hang out with your friend, live your life, and know that if he's worth a damn he won't judge you if you tell him.",
            "I love this! Keep working on your insecurities (we all have them) but I love to see you working through this",
            "Just do your best to like you as much as your friend does.",
            "I only just read the original post right now, but this update makes me so happy! I know I don’t know you but I deal with anxiety and am proud of you.",
            "I like where you ended this too.  You didn’t go into a whirlwind romance or what happened after x dates.  Maybe you simply haven’t had more dates and it’s been left off here, my point being; it doesn’t matter!  You got over that barrier, it’s done and left off on a positive note.  Solid update!",
            "I had friends that would get lots of women. I just wouldn’t put myself in activities were that was possible. So we’d do things like this most of the time.",
            "Aw this is so wholesome! I really related to your post because I’ve only ever had horrible friends and since the pandemic I’ve basically had 0 friends or anyone to do fun stuff with. I’m really happy for you! Making new friends can be really fun and exciting",
            "This is the cutest fucking thing I've ever read.",
            "I dont mean to sound disrespectful, but have you maybe considered the possibility that you're not jealous/insecure about this dude? There may be a chance that you're gay and you like him?\n\nIm not judging cos I used to be in the same situation before. I thought I was getting insecure that my best friend is getting the attention from the boys but it turns out Im a lesbian who was attracted to her.",
            "What is with all the comments assuming one or more parties in this situation has to be gay? Nobody was saying that in the last thread but now that they've ... (checks notes) ... watched a tv show together (gasp!) it's all \"I was expecting... them being happy together\" and \"My gaydar is ringing,\" and \"Being excited to hang out indicates more than just friends.\"\n\nCan't two men be friends and be happy about their friendship without sexual overtones? Slow your roll, shippers.",
            "i occasionally look for peers that are better at things than i am to see how they do it, and become better.\n\nyou are wise to accept this invite.",
            "Dudes rocking, nothing better.",
            "Good luck! Are you into him as well? It seems like he is super into you. Don’t get stuck in the friend zone. Be confident.",
            "Maybe he's gay? He could be into you.",
            "So happy to hear this. I used to get jealous my girl friends seemed to always have guys falling in love with them. It took a bit to accept that the same reason I like my friends are similar reasons why guys go for them.\n\n…and then I realized my friends sorta had a curse. Because all these guys would put my friends on crazy pedal-stools. When I stopped getting jealous, I started to attract some awesome guys myself. \n\nGirls can sense your insecurities. If you don’t love yourself, they will most likely stay away. Be the person who your dream girl will want to fall for. Looks/status don’t matter nearly as much as people think.",
            "[removed]",
            "Anyone else unexpectedly invested in this friendship/OP's happiness now?",
            "That’s amazing! Funny bc I bet as you get to know him you’ll find out there is something about you that his thinks is extremely awesome and a little jealous of!",
            "https://t.me/angiecorineof",
            "I'll tell you this, dude. Around 23, I was still hanging out with all my closest \"friends\" from high school. Living with them, even. Eventually, I realized I couldn't stand them. They were all still acting like high schoolers. That's around the time I met my current best friend. She got me out of that situation, made me realize what real friends were, and I never looked back. And, truth be told, real life doesn't start until about 25. And don't worry about being a virgin, dude. Another super close friend of mine was a virgin until about 28 and I'm literally jealous of him a bit because he's now got a kickass girlfriend and I'm still single. Life takes time. Just let it happen.",
            "Thanks for the happy update! \n\nKeep working on improving yourself and being a good friend. It’s not always returned, but eventually you’ll find those friendships and relationships that matter!",
            "I want a move story between these two omg",
            "you still virgin? Just curious, 3 days later. :)",
            "Just wanted to say good job, man. I read your original post and I think we struggle with a lot of the same negative thoughts. Props to you for overcoming and managing to make a connection."
        ]
    },
    {
        "post_id": "3n0kti",
        "author": "Stpthrwy",
        "title": "I [21 F] received a message on Facebook from an employee at a company I applied for a couple of weeks ago [M 30?] - I feel upset and stupid.",
        "url": "https://www.reddit.com/r/relationships/comments/3n0kti/i_21_f_received_a_message_on_facebook_from_an/",
        "score": 2566,
        "num_comments": 535,
        "created_utc": 1443646317.0,
        "selftext": "Sorry if this is terrible, I'm on my mobile. \n\nI'm not sure if I should even be posting here, but I really didn't know where else to ask and I have no idea what to do and I feel truly terrible. \n\nI applied for a job at a company a couple of weeks ago, really seemed like a job I'd like to do. It was becoming a junior web designer at a company. I'd been interested in it for a while and I have been teaching myself how to do it amongst other things by using books, reddit and just reading about it online. It's been fun and I've been loving it. Anyway, I work at a typical job, a supermarket and I have been looking for another job for a while as I wanted a career and to start doing something with my life. I mainly do online job searching. I saw the job advertisement for a junior web designer at this company and they said they would teach you everything on the job, no experience needed. Seemed ideal to me and I thought I'd give it a shot. What's the worst that can happen? So a couple of days after applying I got a e-mail and then a phone call from HR and they said they wanted me to come in for a first round interview. Of course I said yes. \n\nI went along to the interview, very nervous as this was the first 'real' job I've ever had an interview for. I asked for advice from some co-workers and that helped me feel better and get a clearer head. I got there a littl early and waited nervously. \n\nThe assessments were for English, Maths and Logic. Now, I will be the first to admit, I do really suck at maths. I just don't get it. I can't really do it. I'm not totally unable but it gets hazy when percentages, fractions, diving large numbers, times tables, ect it gets hard for me. But I have been trying to improve my maths! It sounds stupid but I've been doing maths homework with my younger brother who is in secondary school, final year, and it's been helping me out loads. I got maths training games too. \n\nSo I did the assessments and I didn't really do well at the maths I thought. I came out of the interview feeling unconfident but I tried to not let that show through. They said they will be in contact with me. \n\nA day later, I got a Facebook message in my outbox and it was from someone I didn't know. I read through this message and was gobsmacked. I don't know what to think. Here is the message: \n\n\"Hi OP,\n\nI am just e-mailing you to let you know you definitely won't be getting there job at _____. You are a different shade of absolute stupidity. I work here and I'm the head of the department of which you applied for. I would never in my life ever employ someone who is as utterly simple and unable to do maths. It's a shame as you aced your other tests. But English and logic aren't a sign of intelligence to me. Maths is. You should be ashamed of yourself and go pick up a maths book and learn. No one will take you seriously in life. I seriously hope you take my advice. Your life won't be anything more than menial jobs. \n\nTake care, \n\nAsshole.\"\n\nReddit. I am so upset. I know he's right. I am stupid. I just don't know what to think. What the hell do I do?! I feel worthless.  \n   \n**tl;dr**: Applied for job, suck at maths, did assessments, head f dpt who analysed tests messaging me on fb calling me stupid, I won't do anything with my life, ect. \n\nEDIT: I can't reply to any comments because the post is locked and I went to sleep soon after posting this as it was getting late. I will when I can. I do really appreciate all of the comments and advice. I have some thinking to do about how to go forward with this. Also, I say 'maths' because I'm from the UK. That's just how we say it. ",
        "permalink": "/r/relationships/comments/3n0kti/i_21_f_received_a_message_on_facebook_from_an/",
        "comments": [
            "[deleted]",
            "Just because he says he's the head of a department, it doesn't mean it's true. Even if it is true, it doesn't mean he doesn't have a boss who will look unkindly at this kind of unprofessional behavior.\n\nScreenshot and send it to everyone in the chain of command above him.",
            "This is fishy. Are you sure he works there? Did you tell anybody about the interview? I imagine you telling your IRL or Facebook friends afterwards: \"I really want that job but I'm worried I failed the math test! I'm sooooo bad at math!\" and one of your frenemies spitefully sending a fake message to prey on your insecurities.\n\nI know that sounds far-fetched, but I find it easier to believe than the idea that:\n\n- the head of a department would send a facebook message instead of an email\n- a total stranger would feel the need to personally insult and berate another stranger\n- that an employee would take the time to do so instead of just saying, \"Sorry, we chose another applicant.\"\n- that they would know exactly where to hit you where it hurts the most\n- that they would not know the name of their own department\n- that you failed as poorly as you suspect, when you are actively studying to improve your math skills\n\nWho did you tell about your interview? Maybe coworkers at your current job, who don't want to see you leave?\n\nI don't advise forwarding the message to HR as others have suggested. Instead, find out if they even HAVE an employee named Chad Asshole or whatever. My guess is that they don't.",
            "If you send that to HR, he will be in trouble. Probably fired. That is...the most ludicrous thing I've ever seen, and I used to work for a company that was sued (deservedly so) regularly. \n\nI suck REALLY HARD at mathematics. I can barely help my son with his 9th grade homework. I'm a psychologist and have had a successful career. My husband sucks at math too-- somewhat less than me because he's able to limp along well enough to help our son through homework without losing the will to live, but still, pretty bad. He's a tech writer with an extremely successful career and makes enough to support our entire family by himself. \n\nI'm sorry that a person who sucks at life, made you feel badly for sucking at math. What this person thinks of you is none of your business and I PROMISE, truly, I swear, this person's message was not about you. The message was about this person's own self hatred. No one sends a message like that to a virtual stranger unless they are in a huge amount of pain themselves. ",
            "i have a really hard time believing this is a legitimate message.  NO sane person interested in keeping their job would do something like this.\n\nnote, 'interested in keeping their job'.  screencap, send to HR.  if it's real, well, if you don't get hired, you can at least be reassured he's going to be on the unemployment line right alongside you.  this kind of thing would be immediate termination for someone anywhere i've ever worked.\n\n(i'm in the states, though.  your mileage in what i presume is the UK - or somewhere in the vicinity - may vary.)\n\nbut i feel like you're being trolled to high heaven.  i wish i knew the name of this company and this person, because i could probably suss out its legitimacy in 15 minutes.\n\neither way, send a screencap to HR.  \"hi, i received this message via facebook today.\"",
            "Forward the email to HR. He won't have a job tomorrow",
            "Dear [Company], \n\nMy name is [full name] and I interviewed for [position] on [date.] On [date] I got an e-mail from [full name] (see enclosed picture) from a Facebook account. The message was highly unprofessional. I am informing you of this because I do not think the message was a sign of how you ran your company. \n\nI hope that you will take appropriate actions if this message is proven to be from a member of your staff. \n\nSincerely, \n\n[Your name]",
            "/r/thathappened ",
            "[removed]",
            "Send the message to HR and to his boss. He will be doing 'menial' jobs tomorrow\n\nAnd keep up the studying! It's great you have an interest and passion to learn yourself! And if you show that drive you will find your dream job somewhere. Also maybe look at some official course to help build your CV. ",
            "I have no idea if this post is real or not, but those who are crying \"fake\" are unaware of two things:\n\n* The Brits (and Aussies) say \"maths\" while we here in America say \"math.\"\n* People can be really, really cruel and unbalanced. This kind of thing DOES happen. It's possible this guy is a competitor for the job, like others have suggested. It's also possible he is who he claims to be and he's a dick, for whatever reason. I've posted about this before, but a supervisor at a stupid temp job I once had told me  that because I was a unmarried receptionist, I should kill myself. I had just met this person. It turned out he had a brain tumor and his wife had recently left him. \n\nTo OP: Don't let the miserable assholes of the world get you down. I think it's awesome you're teaching yourself a new skill and that you applied for this job. Keep it up. ",
            "That sounds like some random jerk at the company that got a hold of your results. I'd wait and see if you actually get contacted by their HR, since that's completely unprofessional and I highly doubt that is the final notice. If you don't hear anything in a couple of weeks, I'd consider sending that to HR and send them a message that you thought that the notification you received from their company after the interview was completely disrespectful and unprofessional (include the response you got).\n\nOn a side note, I'm software developer, been doing it for a long time now. I completely suck at math as well, always have. I even failed it the same math course 3 times in HS. I find math to be a completely different ball game when it comes to using a computer and programming. It's not going to hold you back. Also, I've never had to do an aptitude test like that as part of an interview, so don't give up and keep applying for places.",
            "Have you confirmed that this person works at the company you applied for? (LinkedIn profile, Facebook details) \n\n",
            ">redditor for 5 hours, \n>no responses, \n>obvious way to solve a problem, \n\ncome on guys. COME ON",
            "Definitely forward this on to the company's HR department. I can't imagine anyone with any official power sending something out like this on behalf of their company and NOT having heads roll when superiors find out.",
            "What a fucking dick. The guy sounds totally maladjusted and angry at the world.\n\nForward it to the owner of the company and ask if this is the image that he/she wants portrayed to people that apply for jobs at the company. He'll probably get fired.\n\nDon't reply and keep your head up. Web design is fun and you just need to do more of it - you don't even need to be good at math.",
            "he's an ass; i'd forward the message to the recruiter along with a note that one of the interviewers is being unprofessional.\n\nanyway, you suck at math, but you're going for a webdev position, not a stats position. ",
            "I would be going a lot further than to his boss. Absolutely disgusting.\n\nAlso, don't give up on what you're learning. You're doing good!",
            "I work in software and never in my life have I ever heard of anything like this happening.  Unless this company is made up of recent college grads, this is horribly unprofessional.  I highly doubt he's actually the head of the department because no one is that stupid.  Because now you can send that message to HR and his ass is gonna get fired so fast, it'll leave skidmarks on the way out the door.\n\nAnd fwiw, I've also never heard of a web development company doing tests like that to hire people.  Usually the only thing they care about is, well, web development.  ",
            "Oh jesus, that's terrible!  You are probably not stupid.  Can you call the HR department and find a way to no-comment forward that message to someone who might discuss it with his supervisor?  Even if a company doesn't have a....you know what, I should check to see if anyone's said exactly what I'm going to say, and two people already did.  Too slow, Danielle!  Seriously, though, you're probably not stupid.  Nothing about the way you write says \"stupid\" to me.  \n\nEdit:  I do a full time job, with zero supervision, that involves putting eight people who may or may not ever have ridden a motorcycle on motorcycles for two days, and shepherding them through where to go, what to do, and how to do better at it.  There are also five hours in the classroom that involves making them do all the work and only stepping in when they start to wander away from what they need to learn.  It's the joy of my life, and according to the state and the reviews the students leave online, I'm very smart and very good at it.  And when I miscount students for a moment, or find myself with one fewer cone than I thought I needed, or announce their lunch and am met with questions on whether I really meant to give them a five minute lunch hour, I say \"Oh darn it, math is hard, Barbie tells me so,\" and we all snicker and things are just fine.  I'm not saying math is important, but I AM saying that being math-weak doesn't mean you're screwed forever.",
            "Your interviewer (or their boss) would *never* write this.\n\n\nWhy? For one, nobody with this kind of mindset manages to both get and keep a public-facing job; it is just too unprofessional. More importantly, *anybody* in the media industry knows that it takes just a forward to some news outlet (all of them, from the smallest blogger to your biggest newspaper *loves* shit like this), and they will be out of a job while the company they worked for would drown in a storm of bad publicity. This is *not* coming from them.\n\n\n**It almost surely comes from someone you know personally** . Somebody is trolling you.\n\n\n**Do not* forward this message to the company like some other posters suggest -  they will not *want* to believe you, and it will certainly not help you land the job (which you have *not* gotten an official response to yet).\n\n\nBtw, some of the posters here seems to not know the distinction between a web *developer* and a web *designer*. Yeah, math is a huge advantage for doing programming. Logic is even more important. But a designer is not a *programmer*. Artistic skills, some language skills, an understanding of typography, things like that, is what you need. Photoshop knowhow, HTML, CSS and some basic Javascript are the tools, and none of those requires math you cannot do on a basic calculator. Web design is, fundamentally, about understanding how people think when they use a screen and then draw solutions that promotes usability and branding; it's about psychology, not math.\n\n\nSo, keep going! Learn what you can online, and take some classes to get something on your resume; you will find a position without being a math wizard.\n",
            "What a jerk! What an absolute jerk. You did nothing wrong and this adult man went out of his way to make you feel bad about yourself. It's super lame that he doesn't have anything better to do than shit on people half his age. \n\nSo, now that the ranting indignation is over, I have actual real advice for you.\n\nI work as a junior web designer and I can tell you about .0005% of my job is math. In fact, the only real math I did today was calculating out a grid... i.e. How wide is my page and how many columns do I want? 960 px wide with 12 columns... Hmm 960/12=80 px wide columns. Seriously. That is the full extent of the math I did today. \n\nWeb design is more about creating intuitive experiences for the users. Yes, it needs to be visually appealing (appropriate fonts, color scheme, visual hierarchy, etc.) but it's a lot more about how it works. And you, my dear, were raised on pixels. You grew up post-Internet (like me) so you already have a leg up... You just know where buttons \"should\" be or where it'd be helpful to have a link, or what's the best way to treat certain pieces of content. Math is such a small part of what I do and you absolutely do not need a strong math background to get into web design. (That being said, web development is different. It's split into front-end development which uses HTML/CSS/etc. (still not a ton of math) and back-end dev which involves Computer Science and does sometimes require more math and logic skills.)\n\nDo **not** let this fucker make you give up. You should join us over at /r/graphic_design to get more familiar with current aesthetics and design principles. Another good sub, though not terribly active, is /r/frontend. It'll help get you familiar with front-end development if you want. A designer-developer is like the \"unicorn\" in this industry and having those skills could only help. It's going to seem super intimidating and technical at first but please do not give up. You can do this. \n\nIf you PM me, I'd be more than happy to give you some career advice, point to some resources, help focus your efforts. Seriously. I wouldn't mind at all. Good luck!\n\n",
            "Like many other posters I also suspect that the message you were sent is from a fake account. \n\nIf it is a fake account, unfortunately I think it is likely to be someone you know personally, a colleague or one of your 'friends'. Someone who wants to put you down for some reason. Someone who knew you were nervous about the maths test. \n\nI suppose it's also possible that it's from someone else within the company you applied to, but that seems unlikely. You'd have to be pretty mentally unbalanced to send this to a stranger. What does this person have to gain by doing this? ",
            "Are you kidding me?! He's the idiot for sending this to you. You have so many methods of recourse. First and foremost, absolutely send this to the HR dept at his company along with his boss and any other superior of his.  Assholes like this don't deserve to keep their job when they do something so stupid.  \n\nyou're not good at math? who cares. no one is perfect at everything. at least you can fix your problem....I'm afraid this asshole will be an asshole for life. Don't get discouraged. Be strong and do NOT let people treat you like that. You're better than that. Prove it.",
            "You are NOT stupid just because you may not be the greatest in math. I have my master's degree and guess what? When I add and subtract things I still have to use my fingers. Algebra kicked my ass, it's the only class I ever failed. I sucked at math on the sat and gre, like laughably so. Science kicks my ass, too. That does NOT mean I'm stupid. I'm good in other things - English, logic, memorization, etc. I'm 1000% sure you have things you're great in. Please don't let this asshole get you down. ",
            "All these comments tell you to forward to HR, but are you SURE this person even works at the company? If you don't hear from the company soon, I'd send a friendly follow-up to check on your status. If you're in, great. If not, there's other jobs out there. Only then would I follow up with a screencap to HR.\n\nDon't accuse them of running a BS company full of assholes. Just say very calmly that you got this strange message and is this from one of their employees? If it's a real employee, they can handle it. If it's not, then you have a weird security leak probably among your social circle.",
            "Report him to his boss. That's grossly inappropriate and unprofessional. I don't care if you got negative points somehow, what he did was wrong.",
            "The man who wrote this is an idiot. Please report him to HR. For reference, anyone who assumes that being good at math is the standard by which someone's intellect should be judge is a moron. There are many, many types of intelligence. \n\nNot being good at math does not mean you're stupid. It just means you're bad at math. It's not the end of the world. I've known many people who are great at math but are atrocious writers. Everyone has weak spots and that's ok. \n\nIf you want to get a bit better at math (for yourself, not this jackass), the Kahn Academy is a free resource online. It's broken down into topic areas and includes practice problems and quizzes. It's really low pressure and you can do it at your own pace. ",
            "I applied for a job like this, once. Went in,  did the test, aced it - it was a scam to get you to pay money to go on their courses.\n\nWould not be surprised if that was the case here. No one in a professional position would be stupid enough to do this.",
            "Dude. Think of the bullet you just dodged. Could you IMAGINE working a day with that guy? Imagine if you had to ask a question about basically anything. What a turd. Send this to all the bosses at the company-- chances are he's abusing his employees and they feel as upset as you do at this moment every day of their lives. Hell hes lucky he didn't send that to someone like me... I'd send it to sites like yahoo and buzzfeed with his name and the company's name and watch him burn all over the country. \n\nP.S. Being bad at math doesn't make you stupid. Don't let anyone tell you that. ",
            "OK, I'm going to try to depart from what everyone else is saying here and focus on your obvious insecurities with your math skills. I'm a software engineer who just quit my job to go back to school to study math at the graduate level so I'm only halfway qualified to say anything. \n\nFirst, you probably do suck at math but that's ok and it doesn't make you stupid. I'll be the first to admit that 90% of the time I suck at math and I still manage to get by as a young professional in the field of mathematics so my first caution to you (in the words of Douglas Adams) are, \"Don't Panic!\" Being bad at math is like being bad at a language you haven't learned. You can't feel badly about not speaking fluent French, you've barely studied any French in your life (maybe, I don't know you). If you want to be good at Math you have to *learn* to be good at Math and I can see that you've taken some steps but secondary school math and some games aren't going to cut it for the level of logic that is expected of programmers. \n\nSecond, this is a point I try to drive home to all of my friends when I help them learn math or programming (I do this quite a bit), *Math should make sense.* Most of the problems I see people encounter with mathematics stem from them taking something on faith and trying to memorize an algorithm for solving very specific problems. If you can't understand why you're doing something, what your doing, or why it works, the minute a small change is made to the circumstances, you won't know how to react and reassess. The reaction IS math and almost everyone is incapable of it due to faulty teaching methods that go back for forever. When you are relearning math, it is crucial that you convince yourself that everything you learn *makes sense.* \n\nSo what should you do? There are great books to buy for programming interviews. They are more geared toward more technical programming interviews but are incredibly valuable in my opinion. These books are, Cracking the Coding Interview and Programming Interviews Exposed. In addition to these you need to really assess where you're at in terms of education, and there is no shame in finding out that you need to start at basic algebra. It's simply a matter of buying the write book, finding the write online courses, or finding the right night courses, whatever works for you. But it NEEDS to be more formalized then helping your little brother with math or some games that are incidentally related to mathematical logic. \n\nI assure you, OP, you are not stupid. Teaching yourself web dev, even if only a little, is an incredibly hard thing to do and requires intelligence. Being good at math requires training. Whoever this person is, they have no right to speak to you that way and no basis for doing so. When I interviewed for grad school I had some of the worst interviews imaginable. I couldn't even solve the most basic of problems at times. Interviews are very scary things and this was your first, so beyond not judging yourself for your intelligence based off of something that is entirely learned and doesn't come intuitively to you like math I also would be careful not to judge yourself by the results of this or any future interviews to come. \n\nConclusion: Don't let this get you down. Turn on the attack mode and go kick some ass. Everything standing in your way is something that can be tackled, which means your goals are within sight. Don't let your self esteem in your intelligence be determined by the outcome of your FIRST interview. \n\nMore resources: \n\ncoursera.com : online courses \n\nudacity.com : online courses \n\nprojecteuler.com : programming problems to keep your mind sharp (very hard, reading solutions will help you learn to think more mathematically) \n\n/r/math is always here for you and we're a great community. ",
            "I don't believe this post. ",
            "Unlikely.",
            "Take a screen shot and forward this message to their HR department.  This is 100% inappropriate.  I've gone on a lot of interviews.  Probably 30 in total in my life. For both companies in tech and finance.  I have never, ever encountered a response like that. It's rude and unprofessional at best,  and I think HR and his boss would be very interested in seeing that a guy they let manage people treats people so poorly. \n\nPlease, please, try to get in contact with the HR department.  You are not stupid just because math isn't your strong suit. My friend that's a successful history teacher never got past algebra in college, but he's still intelligent and fully capable of teaching history and secured a position in the highest paid school in my state. \n\nFuck that guy.  ",
            "This is absolutely unprofessional. I recently did an interview for a position that I am really unqualified for... I have the education but not the experience and the job was managing an office in my field. I had a panel interview and got stuck on one question. The interview rephrased the question and told me to take my time. This isn't about you, this is about him. Contact the HR person, forward his e-mail and tell them you are offended at his unprofessional manner. \n\nOn a personal level... getting good grades in math is not the definition of intelligence. There are many skills in the world and many different types of intelligence. Yes, work on your math but also cultivate other skills. Remember it is easier to teach math then human decency, respect and professionalism. You have a shorter ladder to climb then he does.",
            "This sounds ridiculous, I've worked in all sorts of jobs, from manual labor to high end computing, I've never heard of a company doing those types of tests for a job interview.  \nOP, that doesn't seem like a place you'd want to work for anyway.",
            "Jokes on them, they suck at being a professional.\n\nScreenshot and send to his/her boss. Use your most professional tone, don't say anything mean about the company, just that while you understand you might not have met the maths criteria but this response was extremely inappropriate, you trust this is not the usual approach of the company, blah blah blah.",
            "Alright, listen up. \n\nThe guy that sent you the message is probably some ugly ass misogynist dude (and i don't use that word often) who liked you, but knew you he would never stand a chance with you, so in a hating spree sent you this shitty message to try and get some symbolic revenge of shorts.\nThis was all there is to it. Or he got probably rejected by some pretty girl and is taking it out on other girls.\n\nNow, first things first.\n\nYou are not stupid because you are not good at math. While yes, being really good at math can be a sign of brilliance, it is by NO means a solid indicator. If you devote enough time to it, you will inevitably get good at it, though it requires A LOT of time. I have seen tons of people being good at math, but are not that intelligent, they only got good because they studied 24/7. So don't let it get to you, it was just some angry guy hating.\nNot to mention that math are not needed at all to theoretical/philosophical studies, so everything he is saying is complete bs.\n\nDo whatever the rest told you and email his boss, his coworkers or make this thing public.  ",
            "OP, take plenty of screenshots in case the account is deleted, then email them to yourself now for some verification of date and time. I'd send something like this, just modify it to your liking and copy and paste for each person, to everyone above him at the company:\n\n\"Dear [Asshole's boss]:\n\nI would like to bring to your attention the potentially damaging behavior of one of your employees. I applied for the Junior Web Developer position at [Company Name] a couple of weeks ago. The job was described as requiring no experience so, as I have been teaching myself web development and really enjoying it, I decided to apply.\n\nAfter my interview, I was told that I would be contacted. The following day, I received this message on Facebook from one of your employees who claimed to be a department head:\n\n'[Asshole's message]'\n\nThis sort of behavior, apart from being uncalled for and personally insulting, is an incredibly poor reflection on your company. I am confident that you will want to deal with this situation as promptly and tactfully as possible.\n\nI do not at this time intend to share this message with the media or anyone else, but I do expect that the situation will be handled appropriately. Please do inform me of what steps you intend to take to rectify this unfortunate decision on the part of your employee.\n\nRegards,\n\n[Your Name]\"\n\nYou can change the last bit to ask for a specific outcome(s) you desire (that the employee be punished or their employment terminated, that you be apologized to, etc.), or you can leave the expectations bit out entirely if you want it to be a bit more open-ended.\n\nIf this were my employee, they would be gone. This sort of unstable, hostile, and completely unnecessary behavior would be grounds for termination in my eyes. I would recommend against going to the media because it is possible for it to hurt future employment opportunities for you. Mentioning it, on the other hand, might make this asshole's bosses realize that you are serious and that you understand what will hurt them.\n\nSorry this happened to you. This person had no right to talk to you that way, and you really shouldn't take a single word of it to heart. Plenty of people out there looking for any opportunity to try to make someone else feel bad because it's the only way they can ever feel good. Whether you pursue anything with the company or not, make sure to move past this as soon as you can because it isn't worth your time to dwell on it.",
            "'Logic isn't a sign of intelligence to me'\n\nHahaha fuck this guy",
            "1st, I'm really sorry about that OP. That guys an ass and I definitely know how you feel. But math isn't the only thing that matters in the world. No company in their right mind would turn down an applicant that aces 2/3 assessments but does poorly on the last one. Hell math isn't even that important for a junior web designer. Which brings me to number 2...\n\n2nd, I highly, HIGHLY doubt that guy is who he says he is. Facebook is an incredibly unprofessional way to contact someone, and saying shit like that is a million times more unprofessional. If he really is who he says he is, if the company ever found out about that he would get his ass kicked, probably fired even. If I were you I would talk to someone who you actually know works there and make sure someone higher up sees those messages. Even if you really don't get the job, that guy will get whats coming to him for being so horrible.\n\n3rd, Like I said above, I know exactly how you feel, but just know you are NOT useless, you are in NO way stupid. Assuming he's telling the truth, you did do great on english and logic right?Sure you might not like math, but who the fuck does? I friends majoring and doing well in engineering and they hate math. The point is, don't feel bad because of one bad assessment. Focus on what you did well on, and try t find jobs that use those skills! If you really want to be a web designer dont give up because of one bad experience. Find a better company/work environment and move one. Keep your head up OP!",
            "This makes me so angry.  I cannot believe someone would go through the effort to contact you on Facebook and be so unprofessional (assuming this person works for that company) and cruel.  I'm not sure what happened to him in his life to make him feel like this was an appropriate action to take, but he is obviously a small and petty person. \nPlease don't let him make you feel stupid.  You obviously are not.  And you are most certainly not worthless.  ",
            "Be thankful.\n\nYou dodged a fucking bullet.\n\nAlso, go to the HR of the company. he has no right to send you an abusive message. ",
            "By messaging you on Facebook, he's given you the rope to hang him with. Forward the conversation to his supervisor, or the closest member of the chain of command you can get a hold of.",
            "Guy sounds like a dick.  He probably is a dick.  His boss and/or colleagues are probably wishing they had a reason to fire him.  This would help.  ",
            "I'm a senior executive in HR in advertising & marketing in NYC.\n\n1.  No company works so fast that in 1 day you receive any type of feedback including a rejection letter.\n\n2.  No company corresponds with a potential candidate through a Facebook message.  (all companies have legal compliance regulations when corresponding with a candidate)  The companies have legal protocols in place, that HR must follow governed by state and/or federal regulations  \n\n3.  No one representing any company would be permitted to use that type of language in a rejection letter, again there are legal protocols in place, what is an acceptable letter/and language\nfor both managers and HR to send.\n\n4.  This email did not come from any potential employer.\nYou should not email this potential employer regarding this email, because if they were considering having you back for a second/follow-up interview, they would reconsider now.\n\nA potential company would view you as high maintenance, as for whatever reason you are bringing problems to them that don't exist.  They might also feel you are not savvy enough if you believed that this was a legitimate correspondence sent from them.\n\nI wish you the best of luck, believe in yourself and you can get the job you want.",
            "ITT: Americans being offended by \"maths\".",
            "I'm seeing a lot of advice about sending this to their HR, if you can find the right channels. If you get the sense that isn't going to do anything, screencap it and put it on their facebook page/twitter/glassdoor. Companies will bend over backwards to right a bad PR situation. ",
            "That's really gross and terribly unprofessional of them. Screencap it and send the letter to HR or someone in charge and if you don't get anything back, I personally would just blast them on social media (ala ocean marketing vs penny arcade). \n\n\nBy the way, I'm terrible at maths also. Awful. I don't pretend to hide it. It's just the way I am. I ask for help when I need it and I can do basic math in my head. Don't be ashamed. Not everyone is good at everything. Embrace your faults and be proud of the things you can do well. This dude went out of his way to put you down just to be cruel. Don't let it bother you :)",
            "OP, please listen to everyone. This is harassment. Find the boss, email them screenshots of your conversation, get every bit of documentation you can. \n\nOn a side note, good job for knowing where your weaknesses are, and working on them. That, to me, is a sign of intelligence. Knowing where you fail, and trying to learn.\n",
            "I can't believe anyone 'professional' would ever send something like that out. It's not true, not one damn word - you're not stupid or a failure or any of that other BS - you aced the other tests! You were asked to attend an interview! And even more admirably, you acknowledge that maths isn't your strongest subject (it's not mine either) and you're working to improve it. I think you're awesome!\n\nDefinitely take other posters' advice though and report this asshole - to HR, his boss, the media etc. I wonder how many other people he is harassing and undermining. Fucking troll.",
            "As an HR person what this guy did was an absolute nightmare. \n\nInterviews etc are a way for a company to present itself.   Doing them unprofessionally is really shitty advertising - not only prior won't want to work there, they will be turned off from doing business with them.\n\nThat guy would definetely be fired. He acted like an ass and probably breached some privacy laws by contacting you ( kinda like using your interview data to send you advertisements).",
            "Contact HR, send them a copy.  Don't accuse anyone, just say that you are confused and thought they would like to know.",
            "I agree with everyone who's said you should forward this to HR and/or his management.\n\nAlso, I need to say, please please *please* don't let this deter you from applying to other jobs. Keep your chin up and keep pushing yourself. You are not stupid! You're doing great. Don't let this random asshole destroy your confidence.",
            "Maybe send a email to the company but don't initially send the content of the message.  You don't know this person, or why the sent this email, so proceed cautiously. Maybe say something like:\n\n\"Hi, I recently interviewed at your company.\nAfter the interview I received a private message from a facebook account that appears to belong to xxx. It was a really inappropriate message and I am very offended. I do not know if this person was representing your company or not, but the message was completely out of line and unprofessional.\"\n\nAnd then reveal more information about the message content if they ask about it.",
            "Think about it this way: even if you did get the job, would you ever want to work with that kind of person?\n\nThis just means there are better opportunities out there. Go find one, you can do it. ",
            "NO HE IS NOT \"RIGHT\". NO YOU ARE NOT \"STUPID\". You need to message the company and tell them that you fully plan on releasing that message to show what kind of company they are and to show their true colors. Make sure you really make it known to them that you know a lot of people who own websites, blogs, etc. Tell them that if they find the person who said that and provide proof of their termination that you won't do it. A person like that doesn't deserve to have a good job. \n\nYou may not have good math skills, but he/she doesn't have ANY social skills and THAT is what gets you good jobs. \n\nHonestly, I would like to know what company that is so I can make sure to avoid them and I know most people would feel the same. They can either show that they don't tolerate behavior like that or if they don't immediately terminate that person that company needs to have their true colors shown to the world via the internet. \n\nThis is literally the biggest lack of professionalism I have ever seen in my life. It literally makes me sick. YOU need to do something about this to show them that you aren't to be pushed around and bullied. \n\nThe one question I would like to be asked is this: Did anyone else know about your interview? It sounds to me that it must actually be someone you interviewed with because they knew all the details. LOOK UP that persons name and see if it pops up on that businesses website! People can't just do that. That has to be some form of harassment and you can do something to make sure it doesn't happen to anyone else who interacts with this company in any way, shape, or form. ",
            "Sounds really fishy some one from the company would take a time to write someone on facebook knowing he will be tracked down and can get fired in the process.",
            "No, he's a fucking dick. You're not dumb if you aced the english and logic tests. *He's* dumb for sending you this, if he even works with the company. You need to sent this to his boss and HR. This is unacceptable and there's no telling how many other people he's passed over for being good at math and shitty at everything else. ",
            "As a web developer/designer myself with around 13 years experience now, I can tell you that complex Math is not at all important in this field.\n\nI'm pretty useless at Math, I can't remember complex equations, I'll just turn to Google for calculations but that has never been on issue with anything web dev related.\n\nHeck, I've even been doing game dev for around 8 years now which requires a lot more math - still isn't a problem, almost any problem can be solved with a Google search.",
            "Name and shame, get the guy fired.",
            "Seriously, I know you feel like shit because that was harsh.\n\nTake a moment and please, please, PLEASE for the love of god forward that to the head of that company with complaints about lack of professionalism.\n\nHe is *SO* in the wrong here it's ridiculous and he should be suspended or at most fired.\n\nHe *will* absolutely get what he deserves if you send that to the head of the company and if they do nothing, seriously, send it to your local news agency in an email. \n\nIt sounds over the top, but that is what local news is for. \n\nLooking out for local people.\n\nI'm sorry this guy is such a dick face. \n\nPlease let us know when you do this.\n\nAlso, he facebook messaged you, which means he used your personal information to look you up (on a public site, not the worst, but still it shows how far he went to personally insult you which is 100% never ever EVER what you do in a professional setting. e.v.e.r.)",
            "Send this to the company, but if I had to guess I'd say its another potential candidate who is trying to make sure they get the job instead of you. If this is the case it is also something to send to the company because they will almost certainly not get hired if that is the case. Either way, send it to the companies CEO/HR department",
            "No, you didn't.",
            "Companies with any reputable shade of professionalism usually have some sort of personal media policy in place. This is the exact sort of thing those policies try to keep from happening.\n\nSend this to their HR department. Honestly, just fucking forward the thing to as many emails at their address as you can. I guarantee they won't take kindly to his actions, especially if he did it from his OWN personal Facebook account. ",
            "Nobody would ever send that lol",
            "Like so many posts in /r/relationships... this is obviously fake.",
            "No one would EVER contact you in a professional context over Facebook. Not even Facebook employees. Furthermore, no one would ever reject your application for a job so rudely. So don't worry, real life isn't like this. \n\nContact this guy's boss with screenshots of the email. \n\nAnd, if there's a billion in one chance that this guy sent the FB message with his bosses approval, then you wouldn't want a job there anyway. ",
            "Logic is a HUGE sign of intelligence. It's really hard and it goes hand in hand with Maths. So keep up your hard work in learning math skills :)\n\nAs for the douche, everyone's advice is spot on.",
            "Send it to the local press. The love sensational stuff like this. ",
            "DO NOT feel stupid. You are trying really hard. My boss is hopeless at maths and he is the best boss I've ever had and everybody respects him. He has strength in every other area just maths isn't his thing. The person who sent that message to you is an arsehole and clearly their self-esteem rests solely on belittling people around him/her. Feel lucky you don't have to work for such a prick.",
            "Better yet, name the name, name the company, screenshot the message. Let the internet do what it was made to do. ",
            "ITT: No one knows that \"maths\" is correct.",
            "What country are you from? \n\nIf it is the US, then this guy far exceeds anyone's stupidity with his own. Send this to the person who invited you to the interview.\n\nIf not, I have no idea what you should do. You would know better if this is a good idea.\n\n",
            "Give us his facebook, well take care of it. ALso send it to his boss\n",
            "being good at maths is only one facet of your intelligence.  Okay.  Maths isn't your strong suit, but you obviously have other qualities in spades.  You must, if only because having a deficiency in one area channels us to develop our strengths in others!\n\nalso that guy has a serious, serious problem.  I hope you follow the advice of other posters and report him.",
            "OP, I'm so sorry about what happened. I agree with anyone who suggests you should contact HR about this asshole. However, don't let his troll message discourage you. I doubt you're stupid. \n\nIf it's any consolation, I am absolutely terrible in math. I hate it. I can't stand it. I've failed math twice in high school, and believe me, I've been called stupid by my own family for years because I just didn't like the subject. Didn't matter if I excelled in my other classes; I was considered a moron. The worst part? For most of my life, I believed it. How silly is that?\n\nBut here's the thing: just because math isn't for you does NOT mean you are stupid. I'm sure you are intelligent in another field. Besides, why should you dedicate your entire life to education alone if you want to be \"smart\" in every single field? It'd be a waste of time.\n\nDon't let this asswipe get you down, even if it was a joke. Any person who judges your intelligence on your mathematical skills alone is the idiot.",
            "Send it to the freaking media as well and have them tear this unprofessional company a new one.\n\nAnd logic is a way better gauge of someone's intelligence than math.",
            "OMG! stupidly unprofessional of them. Firstly - why the hell where they testing the math skills for a design position? Secondly - so unprofessional to contact you via Facebook. Most importantly - what a douche! So so unnecessary. Honestly, be glad you dodged a bullet. Also, I'm sure the company would be so mad if they found out this person had not only contacted you but also sent you such a rude message. Forward it to HR. And idk about where you are, but in the US you are interviewed for the skills you use on the job - not just random maths. ",
            "I'm so sorry OP. That was incredibly unprofessional and downright cruel. Definitely forward screenshots of that message to HR and his boss (if you can). In regards to your math skills, don't give up hope! I studied math in college & tutored students for years and I'm a firm believer that everyone can learn math once they (and their teacher) figure out the way they learn best :)",
            "Did you copy and paste that message from him? It's very badly written. Not sure he's in a position to judge or criticise anyone's intelligence! Try not to take it to heart - he sounds like the kind of guy who just gets kicks out of being a dick. And I agree with others who have said you should circulate it at his company. Definitely send it straight to HR!",
            "Screen cap it and send it to HR. ",
            "I kind of agree with what another poster said buried in the comments somewhere. He might be applying for the same job and used some inside knowledge to try and drive you off. I can't honestly believe his behavior otherwise.",
            "You send this message to their HR department, NO ONE has the right to send you a message like that. Very least a professional.",
            "That guy sucks, full stop, write to HR as others have said.\n\nI just want to warn you, don't feel discouraged learning maths, don't let this impotent dick influence you. I know doing something that dick told you to do can make you feel like the dick is right about other things, but they're not, they're just a dick and trying to target something you're insecure about, and make it worse, don't let them.",
            "lol you are not stupid this guy is. This is unprofessional and bordering on harassment. He wont be working for this company much longer unless he is the ceo, and if he doesnt get fired. Post the message and the company here. They wont have business much longer. You put yourself out there which is scary as fuck. Source: i have been there, rejection is tough under any circumstances but this is unacceptable. I dont know much about the law yet but you might want to even speak to a lawyer about this.",
            "Glass houses, stones, and all that. As if this guy has any right to bitch about someone's lack of math skills - his English grammar and comma usage (or not using any, as the case may be) is atrocious. Each and every sentence he typed has at least one error. He ought to be ashamed of himself for his utter lack of any semblance of an ability to communicate properly. ",
            "\"I am just e-mailing you to let you know you definitely won't be getting there job at _____.\"\n\n\n\" I work here and I'm the head of the department of which you applied for.\"\n\n\" But English and logic aren't a sign of intelligence to me.\"\n\n\nNo wonder he doesn't respect English skills...his are dire.\n\n\n",
            "Screenshot and send to their HR company, perhaps mentioning that it is very unfortunate that this person is a representative of their company and you do hope that this is the first time that he's done something this terrible to a candidate. He may actually be violating part of the interview process by even discussing this with you.\n",
            "Fuck this guy and his stupid ass opinion! He is not an authority on intelligence. He’s just some asshole. The type of asshole who would send a nasty message to a kid to discourage her from trying to grow! \n\nOP, understand something: what he did is not the behavior of a responsible, respectable professional. That man is a fuck boy, and his opinion on your intelligence is completely unworthy of your consideration. Caring about what people like him think will hold you back from your goals. It’s a blessing from the Universe that you did not get hired there because a smart, good kid like you should not be subjected to such discouragement.\n\nNow let me tell you why you are a smart, good kid, and why you deserve a good opportunity in which you can further develop your budding skills and grow professionally. I’m a university librarian, and 90% of my job involves interacting with students to support their academic work. Most of our students are young adults, like you, in their early 20s. Our students come from varying academic backgrounds and have varying natural abilities that cause them to struggle in some subjects, but excel in others. That’s normal, and is true at all levels of education.  But, natural ability and background are not always what distinguishes a student from her peers at this level. It’s the level of effort that some students put into their time here that makes some stand out while others don’t.  Now, I love all my kids and I believe in them. But I especially favor the disciplined, hard-workers. These students take their studies seriously. They know their own strengths and weaknesses and know when they need help and how to get it. They take advantage of growth opportunities. Most importantly, they have goals to keep themselves motivated and they are very focused on developing the skills they need to reach those goals, even if that means they have to work twice as hard as the next student. To my thinking, these are the smart students! These are the ones you know will be ok and will do well. Reading your post OP, you sound like my favorite students! Here is what I mean:\n\nOn having a goal and working to develop your web design skills:\n\n>I wanted a career and to start doing something with my life.\n\n>I'd been interested in it for a while and I have been teaching myself how to do it amongst other things by using books, reddit and just reading about it online.\n\nOn taking opportunities seriously, knowing your weaknesses and when to get help:\n\n>I saw the job advertisement for a junior web designer at this company and they said they would teach you everything on the job, no experience needed. Seemed ideal to me and **I thought I'd give it a shot**.\n\n>I went along to the interview, very nervous as this was the first 'real' job I've ever had an interview for. **I asked for advice from some co-workers** . . .\n\n>I have been trying to improve my maths! . . . I've been doing maths homework with my younger brother who is in secondary school, final year, and it's been helping me out loads. I got maths training games too.\n\nThese are not the thoughts, words, and actions of a stupid person! What amazes me most is that you, a 21 year old, seem to be making these efforts on your own without pressure from parents. You are self-motivated! This is a character strength that can potentially carry you far in life!! You ARE NOT stupid!! You hear me?? You’re NOT!! It’s just that math is not a strength for you. But you have so much else going for yourself that I cannot see how that will hinder your future success in whatever you choose to do. \n\nOP, I understand this threw you off and your feelings are hurt. But it’s important that you do everything you can to not let this message penetrate your psyche. You are on the right track and you have the spirit it takes to do well at whatever you choose. You are going to be just fine.\n\nI think it’s CRUCIAL that you follow the advice of the others in these comments and take steps to get this guy reported. He should not be allowed to continue to function without consequences. I swear, trying to tear down young people who just want to make something of themselves should be a crime!!\n\n**Tl; dr**: Facebook message guy is an asshole and a fuck boy. OP is wonderful and will be just fine! Fuck boy needs to be exposed and subjected to consequences.\n",
            "Whoa, being bad at math does not mean you are stupid. I'm a fucking wizard at languages and comprehension, but I can barely add and subtract without a calculator. Don't let this asshole make you feel worthless. Imagine how worthless HE is that he has to go online and belittle someone he doesn't even know. He probably hates his life, and he should because he's a dick. I hope you report him to everyone else who works at that company, and don't stop trying to get the jobs you want. ",
            "Please, Please, PLEASE forward this to the company. He should be ashamaed and feel stupid for thinking his actions are ok-and that he can get away with it!!\n\nPLEASE report him!!\n\n",
            "I know it's upsetting to hear, but honestly do not listen to it. If anyone is the idiot, its the douche. First of all, you aren't supposed to contact candidates via social media and b the language the person used was inappropriate.  The person was VERY unprofessional. You should contact HR because their job is at risk. ",
            "i think your missing your lawsuit gold here.\n\n",
            "Screencap that shit and then report it. ",
            "Know that despite the fact that math is challenging for you, you still deserve a better boss than that asshole. Get a beer and celebrate the fact that you dodged a bullet by not having that horrible guy for a boss.",
            "What. the actual. fuck. \n\nThis is so inappropriate I don't even know where to start.\n\nOP, anyone who feels the need to contact someone via FACEBOOK (a personal attack) to put them down like this has serious issues on their end. This has nothing to do with you or your maths test. This guy likely has some sort of mental disorder, so consider this a bullet dodged! ",
            "Share this in the internet with the names in-tact. Reap internet karma and real-life boost from people who will become enraged on your behalf.",
            "If it makes you feel any better I never got past algebra and make a great living as a web designer... This person clearly is a control freak with a personality disorder, normal people do not send emails like that. Go prove him wrong OP and become his boss soon enough... Vengeance can be a fun motivator sometimes! Hah",
            "Please send this to HR as someone who works closely with programs that help women in Tech, this guy needs to be fired. It took a lot of guts for you to apply and that is amazing! We need more women like you in the industry and every single technology company knows that. For the sake of helping other women in STEM please send this to the HR department so they can take corrective action. \n\nYou probably would make an amazing web developer. Please don't give up because of this one looser! ",
            "Talk to HR, if they do nothing, post to Glass Door and save someone else the trouble of working with such a chachbag. ",
            "Cheer up! People usually get this shitty if you were able to score higher than him. Maybe he's bad in English and Logic? And I don't think a Department Head will do this to their applicants. You said it was great company? Great company will never have this informal practice. Shrugged this off OP, it's not worth it. ",
            "Why in the world would you be taking English and math tests for a web designer job? I've never heard of this. Just like everyone said, send a screen shot of this to their HR this is absolutely uncalled for.",
            "This is so fucking unprofessional. Even if you don't get the job, just  remember you're not stupid. He was for sending you a messsage like that on fucking facebook. That's just common sense not to bully people like that.\n\nSecondly, if that's the kind of people this company employs, let alone MAKES A DEPARTMENT HEAD, you definitely don't want to work there. Thats effing ridiculous.\n\nHopefully he maths his way out of getting fired, for his sake.",
            "There is something really wrong about this, no normal person would be so incredibly unprofessional to send the message that you got.  Either that was sent by someone who is a fraud and trolling you, it is the correct person and they have some serious personality disorder, or the company has an incredibly toxic culture.  If it's anything other than option A, you wouldn't have wanted to work there.\n\nYou should consider contacting the company to let them know they employ someone that is acting in such a horrible way.  No company wants a bad reputation.",
            "You screen shot that shit and send it to a lawyer, the hr department, the ceo, whoever. That is fucking uncalled for.",
            "I'm 99.9% positive it's one of the coworkers you asked for advice! Did you tell them about the tests, and about which subjects they'd be in? S/he feels jealous that you're looking for a \"better\" job, because it makes them feel bad about the one they're in. S/he wants to take you down a peg.\n\nBy the way, don't worry if you don't get this one! Keep trying! Interviews are tough and it takes a lot of applications sometimes. You'll find something if you keep at it! I also recommend seeing if you can join some local meetups, maybe for beginning developers. You may meet friends who can point in the right direction or make introductions. Good luck!",
            "Seems to me that you should forward that onto that company's HR department. Or a viral Internet post. ",
            "A 30-something year old did this? There is no way this guy could be that dumb. ",
            "This is appalling and one of the most unprofessional things that I've ever seen. You should post screen shots online and contact HR immediately. You don't and rejections over Facebook and you certainly don't send them in such a rude manner. Personally I'd try my best to get his name out there for this so once he gets fired his name comes up every time a company he applies to Googles him.",
            "Honestly, I read your post and am jealous of your motivation to teach yourself something. I'm going to college and work but I have to force myself to do both and certainly don't do much aside from reddit by the time I get home(and not using it to teach myself anything lol). I want to be able to do something like what you're teaching yourself but I just don't have the motivation to push through the obstacles that make it tough to be successful in that. I don't have advice about what to do, just thought I'd drop by and say that that determination is going to take you farther in life than just about any amount of smarts can. Brush it off, you're not stupid! I struggle with math too and understand the feeling of thinking you're stupid. Best of luck! Keep at it and it'll work out for you! :) ",
            "Ignore it, it isn't real. Any real hiring manager would contact you via phone or email, not Facebook. ",
            "Sounds like a thunder cunt on a power trip. Imagine if you were good at maths and got the job. You'd be dealing with that prick every day. There are other comments here saying what you should do in response, so I won't bother with that. You should however not take those words to heart. Maths is just maths. You'd be surprised how much of the general population has the same if not less knowledge of math than you. \n\nMath is relative to the career path you choose. You are not stupid because you're not confident with it. You realise you need to study it more so really all you need from us are reassuring words. \n\nYou're not stupid. That guys just an asshole.",
            "Screenshot and post it everywhere on their social media site and boss, colleagues and hr.\n\nYou are going to show him how stupid he is",
            "Do you have proof that this guy actually is who he says he is? Does he really work for the company? Does anyone have reason to sabotage you? This sounds really fishy, dig deeper. ",
            "Nobody's mentioned Khan Academy yet?\n\nIt's an awesome way to stop sucking at maths and it's free.",
            "Can we just by chance see the fb message version of this? You can blank out the key descriptors..",
            "The message to you sounds like it was written by you. I doubt this ever happened. At least not to this extent.",
            "Knowledge in one particular area doesn't equate to Intelligence. We treat maths as one of the more important subjects to know but it doesn't change the fact.\n\nYou wouldn't judge a fish by it's ability to climb a tree would you?\n\nI'm also shit at maths, but I'm good at other things, I'm sure you are too. It matters very little, the guy sounds very ignorant, you probably dodged a bullet by not having to work there. I'd just move on, don't be discouraged.",
            "Hey OP. \n\nWeb developer here. \n\nYou don't even really need very good math to develop websites. Even a lot of back-end coding only requires a working understanding, and front-end even less (basic addition/subtraction and percentages ... stuff you can do with a calculator anyway). \n\nSo don't let that job interview set you back. A good memory for general knowledge is more important than having amazing math skills.",
            "Strange that this is her only post and yet she said she wrote this on her phone... Suspecting this is not real.",
            "That would have been your boss.   Lucky miss.  \n",
            "ITT: \"Send the message to HR\", \"This\"\n",
            "[removed]",
            "This is the biggest load of bullshit I have read in a while.\n\nSome girls REALLY want attention.\n\nEdit: You can really tell she wrote that message because of these lines\n\n \"It's a shame as you aced your other tests. But English and logic aren't a sign of intelligence to me. Maths is. \"\n\nYeah, the guy verbally harassing you is going to compliment you on every aspect of your performance but selectively abuse you about math. Yeah fucking right... lol.",
            "He has a boss somewhere. Share  your letter of rejection to their Corporate office. I would go right to the top and try to share it with the CEO/Owners social media or email address if you can find it. Don't be discouraged, you didn't want to work for that asshole anyways. ",
            "Don't feel stupid. You might not be great at math but you know how to not be a ding-dong who sends inappropriate emails. People like him are just bitter and hate themselves and need to put others down to give themselves any value. I can't believe this is from a grown man. It's hilarious how dumb *he* looks. Rest assured, you can learn math. He can't unlearn being a cowardly a-hole. I mean, a Facebook message? Really?",
            "What kind of advice is that? \n",
            "Get this to his boss. And damn, if intelligence was based only on ONE subject, I guanrantee you, almost everybody would be stupid. I suck at math and I'm a freaking doctor for fuck's sake. Find another company OP, and pleeeeaaaase don't listen to this asshole. You are not stupid.",
            "Take this from someone who's worked in the industry(advertising and other related industries). \n\nDesigners don't know shit about math. Math doesn't require creativity in the traditional sense. Sure, you may have to be creative in solving your problems, but that's not the same at all.\n\nIf you take anything from this, take this as a sample interview or a practice interview. I've flopped at a bunch of interviews. It happens. Keep doing what you do and start doing side work as much as possible. The side work will do the talking for you. Everyone has people around them that need websites. You can charge very little as a favor for these people and get - a) a bit of money and b) a bit of professional experience to show.\n\nI'd totally ignore this asshole. He's clearly very upset with his own life, which may mean that working at that company really sucks. \n\nGood luck!",
            "Everybody has already said this, but Im going to reiterate anyway. Find out who his boss is or contact HR, send them a letter as well as a screenshot of \"asshole's\" message to you. Not only is that so utterly uncalled for, it's completely unprofessional.  Keep studying and building your skills, don't ever let one dickhole keep you from bettering yourself, don't give up. Good luck :)",
            "That is beyond fucking mean and unnecessary, but even more so, unprofessional, uncalled for and just fucked up. I'm sorry they did this to you. I agree with the other comments, report this to his higher ups, and if they dismiss you, definitely send this to the media. If anything, you might even be offered a job ;)",
            "I'm also going with the advice for you to contact HR and discuss as per other comments. I only want to add that if this is something that happens there, it might be a really awful work environment to be in. \n\nThe fact that it happened is bad enough. How they handle it will also tell you something.\n\nI try to find out if they have high turn-over of employees or not when I am interested in a company. The most toxic place I ever worked at had a huge turn-over rate, and had I known that going in, I probably would have turned the job down because it clearly made a lot of other people seek employment elsewhere. \n\nI once got a call after a great interview for what sounded like a decent position. It was from the HR person who had been in on the interview, and she was drunk. She was calling to warn me not to accept the job because she was miserable there. I took that as *OK, so if she's a crazy person, I don't want to work there; and, if she's not a crazy person, I don't want to work there.*\n\nI think you got a message from a potential crazy person, a certified dickhead, and maybe it's a gift in disguise (albeit from an asshole) because maybe you don't really want to work there.\n\nAs for Maths- i suck at them too, but got better when using them on the job. I have also had the experience of being pushed to the bottom rung at one place, only to get the General Manager's job at the next place.\n",
            "I just want to tell you that that asshole is dead wrong. Don't believe a word of his bullshit.\n\nIt's clear from your post that you are a bright, motivated young woman.  You're going to do just fine in life.  I'm not worried about you.\n\nAnd just to reassure you, it's possible to do just fine in life without being good at math.  I'm fucking terrible at math and I have a great job and a master's degree in a major that had absolutely nothing to do with math.  Fuck that fucking guy.  ",
            "There are some good responses here, but I'll add this: You dodged a bullet.  YOU DO NOT WANT TO WORK FOR THIS COMPANY!",
            "Blow this shit up. Screen shoot the message, screen shoot his FB pics and find him on Lindkin and screen shoot his pictures on there. Then email his boss and HR and ask them when you should start. ",
            "My bet is either this guy's Facebook got hacked or someone set up an account with his info. ",
            "Who the fuck would want to work for a company that acts like that? Any decent company would never do that. ",
            "\"I may be dumb, but I'm not 'Doxx and harass someone on Facebook while representing my public company' dumb\"",
            "I'm a senior software engineer and have been in the industry for 10 years. I make six figures. I never got past 11th grade math, and I was terrible at that. Never got better than a B- at school in the damn subject.\n\nYou'll be fine, this dude is just being a dick.",
            "FYI, you don't sound stupid at all! You sound motivated, smart, resourceful, willing to take a risk, and willing to work hard. You should be proud of yourself, not ashamed.  I am a math teacher. Math is not the only way to show smarts. I have plenty of past students who struggled in math and have gone on to be quite successful and happy. Getting better at math is about being willing to work hard, which   you obviously are. That company missed out on an opportunity to have a great employee. Thank goodness you don't have to work for that asshole. Don't give up!! Don't believe that jerk. Don't give him any power over your life. Good riddance. Can't wait to see an update from you in which you tell us all about your awesome new job.",
            "He's not right, you're not stupid. You are bad at math there's a world of difference, if you were stupid you'd have failed at all your test. Don't let this asshole make you feel worthless. ",
            "Lemme know if you'd like some help improving your math skills. It's not hard once you get the ball rolling :)",
            "Screw that guy. Get him fired then get you hired. He deserves to be shoved under a bus. ",
            "Screenshot it, and send it to HR. You should be able to find contact info on LinkedIn. I would try to copy a few people including your initial point of contact. ",
            "I'm so sorry this happened to you, OP. This guy is an incredible jackass and ought to be fired. Some people just get off on being cruel to others, and it looks like you found one.\n\n",
            "Please send to me! I would love to investigate this guy and let his supervisors know. ",
            "What the fuck. This is horrible. Save that message and take it back to the person's supervisor. ",
            "I am a newish web dev. In the beginning stages, about a year in, and 100% self-taught. My degree is in humanities and I never did more math than I had to. I never especially sucked in math, but was never motivated beyond the bare minimum.\n\nI really wish I had paid more attention to formal logic, though, because guess which of those skills I've used more? Hint: it's NOT math. I haven't had to do more than simple arithmetic in the design and development of a website. That might change now that I'm teaching myself app development, but logic seems to rule the day here too. \n\nWhatever the outcome of this situation, don't get discouraged. Not only is that guy rude, he's also full of shit.",
            "Hey, OP.  Don't worry about the math part too much. I'm a web developer and I'm absolutely terrible at math. I have to constantly double check things when I set calculations up to be sure that I'm doing them properly. However, it's not an absolute roadblock and you can definitely work in this kind of job without being great with numbers. Don't let an asshole keep you from doing what interests you in life. Keep trying; you'll eventually get to where you want to be. \n\nAlso there are tons of free tutorials on how to get into web design or development. Go through a couple of them and start building your portfolio. There are tons of places that would love to have you work for them as long as you have a body of work to show them. ",
            "I would love to see an update on this.   I hope you send an email to HR. ",
            "Selection specialist here. No hiring manager would ever do this, and if they did, the company would fire them. Take a screenshot and send it to the HR department.",
            "Lots of people are bad at maths. He's an asshole and unprofessional. If he is the head of the department, you wouldn't want to work for someone like that. Ever. I'd screen shot the messages and send them to the HR people who interviewed you as well as his superiors. If you need help locating them, try LinkedIn. I'll help you if you have trouble locating his bosses...I spend my life on LinkedIn for my job.",
            "No one in their right mind would say that to another human being.  This person is a miserable piece of shit and just be happy that you won't be working with him/her. ",
            "You need to contact the companies HR team and let them know he sent this. It's completely uncalled for and very unprofessional. I think at the very least HR would have words with him on this",
            ">I am just e-mailing you to let you know you definitely won't be getting **there** job at _____. \n\n>You are a different shade of absolute stupidity. \n\nOh, the irony.",
            "I just want you to know I have been in this position. Not the email, but working at a grocery store, dabbling in programming and wanting to change.\n\nFirst of all, you don't need much math for the job, especially web design. I mean really. I also sucked at math, but I spent a ton of time on Khan Academy and last year I aced calc II. Learn the math, but don't stress about it. Anything you need to know your can look up.\n\nToday I work at a video game company and I couldn't be happier. Don't worry about that asshole. Logic is way more important.",
            "This sounds extremely odd. If anything, the person who sent this is just a douche. Also, don't feel bad about not doing so well on the math section. Everyone is at a different level and all you can do is try your best. It looks like you really have been working hard on improving your skills so please keep doing that. Keep working hard and I'm sure you'll strike luck somewhere--just stay determined. ",
            "Sounds like a troll to me.  Unless OP is paraphrasing, the person who contacted him is pretty damn stupid himself.  ",
            "Someone is being trolled. Either one of your frenemies wrote it to fuck with you or one of his work rivals did to fuck him.",
            "He's not right. Everyone has different skills and lots of people aren't amazing at math. Don't be down on yourself because of this asshole, report it.",
            "Oh man, you can burn him so bad with this.\n\nBurn him, then update.",
            "> But English and logic aren't a sign of intelligence to me. Maths is.\n\nWell, that shows how intelligent this douche is.\n\nI love the letter /u/KaedeJoyner wrote, but I would say make sure you put your phone number on there and encourage them to contact you for more details.\n\nThat being said, I have to say: Facebook profiles can be faked or hacked. Is it possible somebody is setting this person up? ",
            "Fuck that guy. You're not stupid. ",
            "I fucking suck at math too, OP. I wouldn't worry about this asshole. Take what everyone else has said and don't automatically believe this guy is who he says he is and go to his boss. It's completely unprofessional and so classless. DO NOT LISTEN TO HIM or let him make you feel bad about yourself! fuck that guy",
            "Holy shit. If that's actually legitimate, you dodged a missile working for a huge asshole",
            "Take a lovely screenshot of it with the name of the person included and send it to HR stressing your concerns over their professionalism. ",
            "I'd report that shit.  If I had a employee that acted like a piece of shit I'd fire them.  They represent the company and that shitty attitude might lead people to think the company is shitty also.  Sorry to hear that someone was a jerk to you.  Fuck em man.  You'll find something better. ",
            "> Your life won't be anything more than menial jobs. \n\nPfft, I suck at math but I excel at English/logic/etc.  I'm a law clerk and I'm awesome at it.  Ignore that turd.",
            "Should make a movie out of this, like the karate kid but with math.",
            "If you're interested in brushing up on your math, I suggest Khan Academy, it's really helpful.",
            "Hey, if you want to get better at math, there are a ton of resources! Khan Academy and YouTube are starting points. I've helped a couple of people who thought the same about their math skills get through coursework and improve! ",
            "I suck at math too, even pretty basic stuff. But I still managed to get into a really competitive university, get full scholarships and am about to graduate. I am what is considered \"smart\" by most people and I know I will have a really great career. And I didn't need to be good at math to get where I am. There's no amount of dumb you could be that would excuse his behaviour.",
            "I know so many people that are terrible at math and have rewarding gainful employment. That person is terrible, and his life can't be going very well if he's that miserable to other people. What a shitty feeling to get that message in your inbox though, I can only imagine. ",
            "Math teacher here. I hate hearing when people have negative math-related experiences, so although your question is about what to do with the company, I want to address your feeling shitty. \n\nPeople who \"suck at math\" aren't stupid, they just haven't learned certain math concepts yet or they learned them at some point but don't practice, so they've gotten rusty. It's just like how you're not an idiot because you can't play an instrument or because you don't speak a second language. You haven't acquired that skill... yet. If you were into math and you put your mind to it, I'm sure you could learn it like you did with web design. \n\nAnyway, I'm sorry that Asshole projected whatever insecurities or issues they have onto you. I hope you do follow up with HR at the company and teach them a lesson!",
            "There's more to life than just math, don't stress too hard about it. It sucks that you lost the job, but you can look for another. ",
            "I agree with the sentiments shared here. He's a dick, don't listen to him. That said, if you want to learn more maths come over to /r/learnmath, they're a helpful bunch.",
            "If you are not good at something it's because you ever gave it any time or never really worked on it. So try to learn more math just like you are learning g the Web Development and give it equal time &  get someone you know (ex. math teacher/friend)  to help you out) ",
            "[deleted]",
            "This post has been locked and removed.  Numerous people felt that it was a fake/trolling post.  Regardless of whether it was/is or wasn't/isn't, the OP has received an abundant wealth of advice and comments, and the comments are veering off-topic fast.  Many other posters need your advice and help; Kindly help some of those OP's.",
            "I call shenanigans on this story",
            "That's a lawsuit",
            "Somewhat off topic - have you ever been checked for dyscalculia? It's a learning difficulty, a bit like dyslexia but for numbers. Some of the signs are having trouble with analogue time, mixing up left and right as well as a general difficulty with numbers. The best way I've heard it described is somewhat joking, but also sort of spot on. 'How I see maths word problems: If you have seven pencils and I have four apples, how many pancakes will fit on the moon? Purple, because aliens don't wear hats.' I've also heard it described as processing numbers as words, so of course adding 'seven' to 'six' doesn't mean anything more than adding 'house' to 'bamboo'. \n\nAnyway, there are plenty of jobs you don't need maths for. I worked in the cash office of a large department store and no one ever asked me to do a maths assessment (I had maths GCSE). My current job as editor of a magazine I also needed no maths qualifications whatsoever. ",
            "Why is math plural?",
            "As others have said, you don't have to let this discourage you. Not doing well on their stupid assessment test doesn't mean anything, and that guy is a troll at best and a sociopath at worse - there is a chance that he could be fired for that, and you should definitely look into that.\n\nI would encourage you to visit /r/cscareerquestions if you haven't, already. It's a sub for people looking to get into programming and development and there is a lot of good advice from people already working in the industry.",
            "My mom grew up in a third world country and the principal actually took her aside and told her she would never be good at math..The fucking principal.\n\nShe ended up coming to America and becoming a Loan officer, obviously very proficient in math. \n\nDon't listen to that piece of shit.",
            "Indeed as others have said. \n\nI'm almost sure the company would be interested in knowing how much one of their department heads suck at being a decent person.",
            "Try and make sure that person actually works for the company. Google his name, can you find a LinkedIn? Or call the company and see if they have an employee directory.",
            "I smell a lawsuiittttttt",
            "If I was his boss, I would fire him and hire you in a heart beat. Do not let this go. Talk to someone in HR then his boss directly.",
            "Oh my. So, how much is 7x4?",
            "/r/thathappened\n\nThat said - contact HR about the message",
            "[deleted]",
            "[deleted]",
            "Have you ever been tested for a learning disability? ",
            "Oh dear, op. I'm sorry that by doing your best to improve your career prospects you've had to encounter such a complete and utter bell-end. It's shit craic.\n\nAm I right in saying you're in the UK? If so, there's a few options, with varying degrees of dramatic outcomes,\n\nFirstly- screenshot the shit out of that message!\n\nNext- get on to his company, check their website for a contact us section, especially complaints departments. Forward them the screenshot and ask them if they think this is an appropriate way for someone to address an applicant for a role. Indicate that as he has insulted your intelligence and used abusive language, you consider it defamation of characterl. Ask them to come back to you with a response- including an apology and a suggestion from them as to how they compensate you for the stress and upset this has caused. Ask them to come back to you by a certain date, and let them know that if they don't, you'll be straight on to the Daily Mail or a solicitor.\n\nBear in mind if you have any learning issues (dyslexia for example) or you come from a minority religious/ racial background, it might be worth mentioning.\n\nI've done recruitment in the past and There's any god's amount of laws and legislation to protect applicants and ensure they're treated fairly and with respect. I'm sorry this wasn't shown to you, but you can take back some control here by speaking up.",
            "\"Everybody is a genius. But if you judge a fish by its ability to climb a tree, it will live its whole life believing that it is stupid\". Maths is not a sign of intelligence, and this guy is an idiot for thinking that. You think many of the great historians, novelists, philosophers or politicians were good mathematicians. This guy just sounds like a pretentious wanker",
            "sick troll",
            "Some of the dumbest people I know are great at math. Anyone can learn math.\n\nCommunication, creativity, emotional intelligence, social savvy, those are all measures of intelligence too, and to some degree are very hard to teach.  \n\nIt's hilarious to me that this troll is calling you stupid when he clearly is the idiot here. If he DOES work for this company, he's as good as fired. \n\nI would call the HR department enraged. I would demand to know who had access to my application materials and test results, and how it's acceptable for their employees to harass you and demean you via Facebook. \n\nI would investigate your privacy rights. Usually places have to get permission to share test results with anyone else. \n\nLastly, that person, whoever they are, is the one we should all be feeling sorry for. Their life must be so tragic and pathetic, their time so meaningless that they've got nothing better to do than find people to unjustly criticize and mock. \n\nGirl, shake it off. You're brave. You're motivated. You're an excellent communicator. You can use a god damn calculator if you need to do math just like everyone else does because very few of us are awesome at math especially when we don't use it daily. \n\nBeyond measuring and simple addition, I don't understand why you need maths for a web design job anyway. It's all absurd, and that company is a sack of garbage for handling privacy so poorly and hiring such unprofessional associates. \n\nYou're doing everything you should, you're awesome. Haters gonna hate. Listen to some Taylor Swift and move on to the next job, persistence and growth are the keys to winning. You're nearly there. ",
            "ITT: very vindictive people. \n\nYou know you need to work on math, so this is just more feedback to reinforce this. Yes, he was not nice about it, but no need to burn bridges with the company. Study study and study some more!\n\nYou will come across many people in this world and in business who are not nice to you, handling those situations with grace and aplomb will speak well for your character.",
            "[deleted]",
            "Maths...  New message in outbox.... \n\nSo much confusion in this post",
            "I'd contact the media. This is a whole new level of unprofessional. ",
            "He's an asshole.  I'm about to get my PhD in a life science, and I suck at math.  Everyone has talents and abilities, and no one particular talent is more important or valuable than another ",
            "I consider common sense to be a basic form of intelligence over math. Math takes patience, time, applied learning and some people just have to work harder than others to be good at it. While those people usually excel in things other people aren't good at it. Hes going to call you unintelligent? That's a laugh, because I am sitting here absolutely floored by his rampant stupidity. I actually googled  synonyms for unintelligent because I couldn't think of a word that described this level of it.\n\nHow off his rocker is this guy to send something that would *so obviously get himself fired?* Is he some sort of closet narcissist? I just can't even fathom it.\n\nRant aside, report it to his superiors. Watch him get fired, and message him back on facebook about where he figures common sense and empathy rank on the scale of basic intelligence in juxtaposition to math.\n\nWhat a fucking twit.",
            "Keep a record of the message, including screen shots.\n\nTry to get legal advice if you can. The wording of the message was completely inappropriate and possibly broke the law (I won't definitely say it broke the law as I'm not qualified to say that). \n\nI will say the sender of the message did something that is wrong and I hope they wind up losing their job because of it. Do complain about the message. Maybe consider if it's appropriate to bring this to the attention of a news organisation, like a newspaper or a TV news show.\n\nIt's one thing to say you didn't get the job because of your lack of skills in maths. But there is never any good reason to be rude about it.",
            "LOL that guy is an idiot.",
            "First of all. Fuck that guy , second of all if you don't suck at something you'll never get good at it and 3 of all who does this guy think he is. Whatever he says it's just his opinion it means nothing ."
        ]
    }
]