[
    {
        "post_id": "3zwvsu",
        "author": "worriedmamabear",
        "title": "UPDATE: How do I [F37] tell my daughter [MtF16] that her father and family don't want her coming for Christmas?",
        "url": "https://www.reddit.com/r/relationships/comments/3zwvsu/update_how_do_i_f37_tell_my_daughter_mtf16_that/",
        "score": 2563,
        "num_comments": 206,
        "created_utc": 1452192845.0,
        "selftext": "[Original](https://www.reddit.com/r/relationships/comments/3xo4dm/how_do_i_f37_tell_my_daughter_mtf16_that_her/)\n\nWell the holiday season is over now and there's a lot to tell you guys about how everything went down.  Things didn't end up as well as I'd hoped but they weren't as bad as I feared so honestly I would call that a win.  Let's start with how I told Claire about not going to Christmas Eve.\n\nI basically told her what sarah8 said: \"Your dad's family isn't ready to accept you for who you are, and that is their loss. They are in denial, and they think that they can change you by not inviting you for Christmas. I'm sorry Claire. We both know you deserve better.\"  She didn't take it well.  She was heartbroken but I knew she would be no matter what.  That night we had ice cream and she just cried for a while and I comforted her.\n\nI researched a bit on the churches in our area and called a few to ask about their views on transgender people and found one that might work before I asked Claire if she wanted to go with me to a midnight mass.  She was grateful that I would go with her and we went to a nice mass that was not so religious that I felt uncomfortable, but religious enough for her to enjoy mass.  We will probably continue going there in the future.\n\nChristmas Day was good.  She invited one of her closest friends over for a while so that she wasn't the only teenager.  She loved her present from me.  I got her those fake gel insert breasts and some nice bras so she can feel more like a woman instead of a little kid.  Some of you might tell me she isn't old enough for a gift like that but I could tell it made her feel more comfortable in her own skin.\n\nThe bad part is that she's still hung up over her father not wanting to see her.  I learned recently that she emailed him or Facebook messaged him and begged him to at least come to our Christmas or come visit and she never got a reply.  Last week we went to her therapist and so far it didn't seem to help.  I think she's still in shock that someone she loves so much sees her as something that shouldn't exist.  We're still trying to work through it.  I contacted some of her aunts and uncles but they don't want to see her either.  It's upsetting but we will find a way.\n\nClaire also read some of your responses to my first post and she wanted to say thank you.  I wanted to thank you as well.  We're just going to send her father some research on trans people and hope he eventually sees the light.\n\n\n   \n**tl;dr**: Had a fun Christmas, made new traditions, but Claire is still heartbroken and upset over everything.",
        "permalink": "/r/relationships/comments/3zwvsu/update_how_do_i_f37_tell_my_daughter_mtf16_that/",
        "comments": [
            "[deleted]",
            "You are a fantastic mother and I am so glad that Claire has you there to support her.",
            "Don't hold your breath on him changing his mind. This is something you both need to prepare for, that he may never come around. The sooner Claire can come to accept that as a possibility,  the sooner she can move on and deal with the loss of a father. He may surprise you but its more prudent to prepare for the worst, Claire's life for the foreseeable future will be hard enough as is due to the fact that public perception of transfolk hasn't quite caught up to the rest of LBGT. \n\nYou seem to be doing everything right, and I don't think Claire could have asked for a more supportive mother.  Good luck to both of you. ",
            "[deleted]",
            ">Some of you might tell me she isn't old enough for a gift like that but I could tell it made her feel more comfortable in her own skin.\n\nShe's 16. Most girls go through that phase around 13. She is more than old enough to feel like a lady. ;)\n\n>The bad part is that she's still hung up over her father not wanting to see her.\n\nThat's not an easy thing and it's going to take a lot of time to deal with that level of abandonment. It will take time but this may always hurt her. \n\nYou are a great mom. You are doing good. Stay by her, and see about a trans support group. It may help her.",
            "[deleted]",
            "I work as a service provider for LGBTQ clients and you are really doing everything right. What your daughter needs is support for who she is and you are doing just that. \n\nUnfortunately, trans folks and especially trans women are treated with an incredible amount of contempt by many in society. Claire going to a therapist already is great so she can learn strategies and coping mechanisms to protect herself from hurt. However, like another commenter said, both her and you need to plan for her father and his family not ever accepting her. This is an unfortunate reality that many, many people in the queer community face. \n\nNothing comes over night, and Claire is going to be very hurt, but dealing with the grief of losing a parent in a constructive way will only help her in the long run. Some folks learn to forgive or empathize with family members where as some are less constructive and turn to anger. Ultimately, as a trans woman, Claire is certainly going to face similar or worse behaviours from fellow students, colleagues, and strangers. Learning to deal with this in a positive way is only going to make her that much stronger of a person. ",
            "You're a good mom who will stand up for her kid and do what's right and what's compassionate and loving.  I think Claire will be just fine as long as she has you.",
            "Claire is so lucky to have a mom like you!\n\nThe only suggestion I have is do what I've done and build new traditions, and look at certain friends as family.  I had a Friendsgiving this year and it was one of the best Thanksgivings I've ever had. Keep positive people around her and those that accept her, and she will be okay.  It'll always hurt how her dad is acting, always, but keep good and positive people around her, and she won't become jaded.\n\nNew Traditions are great things as they REALLY do help make holidays better.\n\nI hope her father and the family come around, but if not, at least she has you, and that's so much more than some trans people get.",
            "Realizing you're not loved by a parent can be so, so hard. I'm incredibly glad that she has you, and her friends, and her faith. It's an absolute tragedy that her dad helped build a person who's growing up so full of affection and idealism, only to turn his back on her when faced with the unexpected, but I hope she's able to fill up on so much love from those other sources that she'll one day be able to heal even if her dad never comes around.\n\nAlso:\n>I got her those fake gel insert breasts and some nice bras so she can feel more like a woman instead of a little kid. Some of you might tell me she isn't old enough for a gift like that...\n\nNah, she's 16! Most girls start trying on womanhood around there regardless of whether their parents are supportive open books or try to repress the hell out of 'em. Plenty of parents don't even like to think about their kids developing breasts, and it screws people up; having a mother who just flat-out hands her a pair of artificial boobs to try on for size can only be helpful!\n\nBest of luck to you both.",
            "I hope one day when I'm a mother I am like you.",
            "You're a good mom, and I am sure Claire will appreciate what you did for her, especially as she gets older and reflects upon it.\n\nAs far as the dad's side of the family is concerned, hopefully they'll come around to Claire once they figure out it's not \"just a phase,\" but I wouldn't hold my breath.",
            "*Christmas Day was good. She invited one of her closest friends over for a while so that she wasn't the only teenager. She loved her present from me. I got her those fake gel insert breasts and some nice bras so she can feel more like a woman instead of a little kid. Some of you might tell me she isn't old enough for a gift like that but I could tell it made her feel more comfortable in her own skin.*\n\nThis is incredibly touching, and also absolutely age-appropriate. You're a great mom.",
            "> Some of you might tell me she isn't old enough for a gift like that but I could tell it made her feel more comfortable in her own skin.\n\ni absolutely would not if it means anything. i think that sounds like an excellent gift for her. teenage girls wear bras and many pad them so it's totally appropriate. anything that can help her feel more feminine and comfortable in her own body is a great gift, especially until she can start fully transitioning. \n\ni'm sorry for both of you that her dad is being such a tool about this. you are being a kickass mom. you keep doing you. your daughter will never forget the understanding, caring and loving you have given/shown her through all this. \n\nto OPs daughter: sweetie, i'm sorry that your dad isn't being understanding about all of this and that he's not showing unconditional love like he should. it can be really painful when someone we love deeply, especially a parent, does something that hurts us but you will get through it. stick with your therapy. it will take time but things will become better. remember, for every one person who doesn't love/accept you there will be 5 who do. keep your chin up! \n\n<('.')>'s to both of you!",
            "This made me tear up...I usually lurk but just wanted to add on to everyone telling you what a wonderful parent you are.  I'm so glad your daughter has you to take care of her even if some other family members do not accept who she is.",
            "I don't think she's too young for breasts or a bra, that's just part of being a teenaged girl. But really, you sound like a fantastic mom. ",
            "Claire is so very lucky to have someone like you in her life. I hope the very best for you both.",
            "You are such a wonderful mother. ",
            "i wish i had you as a parent. no matter what happens with her and her dad, she'll always have you and that's better than whatever he would offer her anyways. ",
            "It would probably help tremendously if you can find a local support group, either for trans, or GLBTQ? youth.  That way she has peers she can talk to and see she's likely not the only kid who has a parent (or parents) who aren't handling things well.  She needs friends she can commiserate with and are going through some of the same things.",
            "I don't think she's too young for that gift at all. It was sweet of you to get those for her. ",
            "You're doing everything so right. (Even the bra + inserts, because if she's old enough for you to be buying her bras if she'd been cisgender, she's old enough for you to be buying her bras and inserts.)",
            "Your daughter is extremely lucky to have such a wonderful mother. I'm sorry that you have to see her hurt, but you're right, you'll find a way. *hugs*",
            "Your daughter is so lucky to have an amazing mom like you.",
            "Your daughter is lucky to have a mother like you. ",
            "I think I already know the answer to this question but would her father consider an invitation to an appointment with Claire's therapist? I'm wondering if an outside perspective on her transgender experience might help him come to terms with it. \n\nIn any case, he's an ass and you are great. ",
            "Claire is lucky to have such a wonderful mum in her life. ",
            ">Last week we went to her therapist and so far it didn't seem to help\n\nDon't let that discourage you, therapy takes time to \"work\"",
            "Oh my God, you're a good mom. This hit me so hard. Thank you for existing. We desperately need more people like you.\n\nAlso, check out yourholidaymom.com. I think you might like it.",
            "You're a good mother.\n\n*hugs*",
            "I hope to be as awesome of a mother as you are!\nSomeone's cutting onions here at my office.....",
            "This is much better than I thought it was going to be, based on the title. Good on you, mom.",
            "You're an awesome mom! ",
            "Your daughter is very lucky to have you. My partner is also MtF and has been for over half of our relationship. I'm helping her through it all. Thankfully her family is accepting, but she is facing a lot of hardships still. I'm here to talk if you like.",
            "Unfortunately, this will be par for the course for her life for a long time. People are afraid of what does not fit into their little world view and honestly, there has not been a secure place carved out in our culture for transgender people......yet.\n\nShe is where homosexuals were in the 70's, acknowledged but still persecuted. My friend Emily is Trans, she gets shit on by her family every day, it is real real horrible.\n\nTell her that even though it is very bad at times she is who she is and people who deserve her love back will love her for who she is.\n\nAnd Mom, get into a support group or something, you will carry a lot of her pain and burden, you need support too!!!!!",
            "You're not a good mom OP; you're a great person. \n\nBeing a mom has nothing to do with how you have handled this situation as I believe you would treat any person in this situation with the same tact and same temperament as you did with Claire.\n\nYes, you are a good mom, but you're a great person. \n\nI read your OP when you posted it and had zero idea of what to advise, however your course of action seems to have worked perfectly. \n\nCheers OP, you da real mvp",
            "People can be just horrible. I'm sorry. You're a good mom though. In time either he will come to accept her for who she is or she will come to accept him for who he is. ",
            "You are the kind of mother i want to be when my kids get older, i worry about them in the world the way it is. You give me hope that there are good people still and if i just keep trudging along trying my best then maybe when my kids get older they will join up with the kids raise by people like you and they will make the world a better place together.",
            "She's lucky to have you as a mother.  ",
            "I'm so sorry for your daughter that her father and his family has taken that line. Others have said all that I would. I'm writing mainly to add my voice to those who will accept your daughter for who she is. It's important for her to know that she will encounter welcoming and acceptance from many, even though she will also encounter the opposite as well.",
            "She's so lucky to have you, you're a great mom.\n\nYou mentioned that she loves hanging out with her cousins. Is Claire Facebook friends with them? Assuming they're younger and more accepting/understanding, can you maybe help her see them without your ex and ex MIL involved? \n\nIt may not be so realistic, but there may be members of that family that don't think her exclusion is right, and would be more than open to keeping those relationships intact, even if her father has decided otherwise. ",
            "Honestly, she'll remain heartbroken for a long time. Perhaps, forever. \n\nI'm 35 years old, and the pain of my dad choosing another family over my siblings and I, over and over, has never gone away. \n\nIt's the support that gets me through it. My brother and sisters are tight, and we are each others parents, essentially. They are my rock, and I would die without them. \n\nSo, continue to be her \"rock\". It's unfortunate that her dad is missing out, but you and her will have the best memories.  \n\nGood luck :)",
            "You're the best mom!\n\n\n\nI'm so sorry your sweet girl is going through this. She's, over all, being very brave in this situation. Rejection from a parent is the worst feeling and mentally broke me (and I'm sure many others). But she seems so strong and smart from what you've shared with us and I'm sure she will be fine. She has all of your support, as well as your family's. And now, she has a new church group to lean on, so that could help, too. \n\n\n\n\nAnd just remind her. Just because you share DNA with somebody, doesn't mean they are family. Just like if you're born with a penis doesn't mean you're a man. \n\n\nSeriously, though. Claire sounds amazing. Her father is missing out on having a wonderful child. But like you said--it's HIS loss. Claire isn't missing out on anything by not having somebody so hateful in her life. ",
            "You're a great mom. As a trans person who had a similar situation occur as a teenager when I came out, I think you handled all of this in the way I wish my own mother would have. You're doing all the right things to support your daughter and that is just such a great gift in itself for her. No matter what happens with her father, as time passes one day your daughter is going to be so glad she has such a great mom to support her through everything. Thank you for being the type of parent we need more of in the world. ",
            "When it comes to family dysfunctions, new traditions are often the best cure!",
            "I'm glad she has you.",
            "You're a kickass mom. A friend of mine growing up is FTM and I witnessed how his mother supported him and his father came around eventually. His name is Ryan Cassata, he's a bit of a trans activist. Keep doing what you're doing, making sure your kid is comfy and happy!",
            "You handled it well.  Thank you for giving your daughter such a strong support system.  And seriously dude fuck your ex.  My sibling is MtF and I am angry for you both.  ",
            "I don't understand how parents can be so shitty towards their kids.   ",
            "My heart's breaking for your daughter. I know everyone else in this thread has told you, but I don't think it can be said enough that you're doing an awesome jobs as a mom. I hope your daughter knows that there are other people out there who will love and support her for exactly who she is like you do! ",
            "you are a wonderful mother.  i'm so sorry your daughter is suffering through this, but with you by her side, she will be just fine.  keep doing what you're doing.",
            "This is very good I think.",
            "As unfortunate as the situation with her father is, she still has you, and you're going to be the biggest asset she has as she grows up. Keep being the awesome mom that you are, and I'm sure she'll get through anything. \n\nAnd I don't think she's too young for the feminine stuff. She seems at about the right age. Definitely take advantage of the female bonding that is shopping and salon days! She'll love it!",
            "You are a fantastic mother. Keep on showing all that love and support because your daughter is going to need you now more than ever. This is one reason I hate religion. While not all religious people are like this, SO many of them are hateful, hurtful and just plain hypocritical. I hope her family comes around, but I wouldn't hold my breath. Good luck in all your endeavours and your daughters as well.",
            "Thank you for being the supportive parent trans kids need. You have no idea how much of a difference you will be making to her life.\nFrom one trans kid with a supportive parent to you, you are vital in her journey and in her staying mentally sound. \nIf you have any in your area, I'd also suggest support groups. They can be hit and miss but often have ones for parents too. They were really helpful for me feeling less lonely.\n\nBest of luck. PM me if you ever need some support or advice.",
            "As a father I can't wrap my mind around how her father can do that. Seriously, how does he look at his face in the mirror each day and not feel like a monster? ",
            "Omg no matter what your daughter is going to get through life just fine because she has someone like you as her mom. ",
            "Any child would be over the moon to have you as a mother, OP.  You're doing such a good job at loving and supporting your daughter unconditionally.",
            "you are one hell of a mother. I just wanted to get that out there. not the exact same situation but my father is a homophobic arse, as is all of his side of the family, and me coming out was really painful because of it. my mum has been 100% supportive though and that meant the world, as I am sure it does for your daughter in this case as well. regardless of what her father does in the end (and I hope he'll come to accept who his daughter is), having you will make it easier. you're doing everything right where most others seem to be doing a lot of wrong. keeping you both in my thoughts, lots of love and best of luck <3",
            "Claire is so lucky to have a mom like you in her life.\n\n",
            "You're a good person and a great parent. The world needs more people like you and your daughter.",
            "I think a bra is a perfectly acceptable gift for a 16 year old girl, and that gel inserts for a transgender 16y/o girl is even better - most other girls her age will have developed boobs naturally by now. You're an awesome parent.",
            "Damn. There need to be more people out there like you. Well done, hugs. ",
            ">Christmas Day was good.  She invited one of her closest friends over for a while so that she wasn't the only teenager.  She loved her present from me.  I got her those fake gel insert breasts and some nice bras so she can feel more like a woman instead of a little kid.  Some of you might tell me she isn't old enough for a gift like that but I could tell it made her feel more comfortable in her own skin.\n\nOh, I think this is so perfect! Those gifts, to your daughter, say all of the things she needs from you: \"I love you unconditionally, I accept who you are no matter what, you are beautiful, I support you, *you are a woman. You are my daughter*\" As a fellow woman, you know that feeling when your mom or mother figure says that to you the first time is indescribably elating. \n\nI think you did really great and are just winning so hard at parenting here. You can't change her feelings, but you've successfully showed your daughter that she 100% has your support. Your relationship is going to be *so* different now, in the *best* of ways. So so thrilled for you both.",
            "You know what? One day she might even think to herself, 'screw the dad. I got everything needed from my mother.'\n\nGrowing up without a supportive dad, I used to question why he was not there. But over time I realised my mother's efforts were phenomenal and I didn't even feel like I missed out. Today I don't even have any ill will towards him. I got everything I needed from her.",
            "You are an awesome mother. Your daughter is lucky to have you. Hopefully his family will have their \"come to jesus\" moment and realize their wrong doings. Honestly, this is why I left the church. Too many people using the religion, to preach against what he would have stood for. The hypocrisy was overwhelming. It's sad. Jesus would have embraced your daughter. She is part of the crew that he rolled with. ",
            "Wow, you're a fantastic mother. Her dad may never come around, unfortunately. Hopefully he will someday. Have you watched the show Transparent on Amazon? Season 1 at least is really good and helped me understand trans issues a lot better, I wasn't judgemental or whatever about it before but didn't really \"get\" it until I got into that show. Not sure if it would help anyone else but it helped me understand one of my little cousins who is gender fluid? not sure the term, anyway I was a bit confused I suppose about what she's been going through, but understand better now.\n\nEdit: This one scene specifically (spoiler?) a character is with a group of cross dressing men and they're saying, we're not women, we're men! Men wearing women's clothes, and we're men! She doesn't chime in; you can see on her face as she realizes/acknowledges to herself that's them, but not her.  She's not a man wearing women's clothes, she's a woman wearing a man's body, and women's clothes. Anyway don't mean to derail your thread, I just thought that scene was great.",
            "\n\nIt can take time for therapy to show results.  \n\nAs now she has to mourn the man who was her father, and accepts who he is really. \n\nContinue as you do, you are doing a great job !",
            "All children love their parents and want them to love and treasure them.  This is a blow to her and she will need time to rearrange her mental and emotional world.  Expect her to seem to come to terms with it on the outside but inwardly keep hoping for a magical moment that will change everything.  Keep being awesome!  See if there is a support group either nearby or online to give her a safe place to talk with kids her own age.\n\nAlso, create a voodoo doll of your ex and then burn it for your own amusement.  Anybody who devastated my kid better stay away from me.  I am...not as nice as you are.",
            "You're doing a wonderful job, OP. Best of luck to you and your daughter.",
            "Happy New Year, Claire and Mom.  It's gonna be okay.  You two are a great team together.\n\nMy brother waited until he was almost 30 to transition (FtM), and our family found that his transition was a lot like winnowing grain. Those that remained after all the chaff blew away (because they disapproved, or were uncomfortable, or didn't know how to alter their own perceptions in order to accommodate that someone they knew for a long time had a new name and a different gender on his driver's license) were the real treasures. \n\nThose were the people who were invited to his wedding when he married his love. Those are the people who will be part of their children's lives when they start a family. Those are the people who are lucky enough to have him and his wonderful wife at their holiday tables and framed on their walls at home. \n\nClaire, if you read this, please know that your courage and your sweet spirit are gifts to the world. Your mother loves you so much, and you'll be loved by so many more people in your life, just because you're you. The rejection you experienced this Christmas is *not* a reflection on who you are or what you deserve. It's a product of bigotry and fear.  You're just as you should be.  \n\nThe hard lesson here is one that a lot of us learn later in life, unfortunately.  And that lesson is that not everyone we love is going to nurture and treat us well. Many of us go a bit longer before we realize that someone we love is toxic, or wants to change us, or that their love is conditional.  It's no less painful, but those rejections do steal a lot of our innocence and idealism, especially when they come from family. \n\nDon't let this crush you. Don't let this darken your spirit or make you bitter.  Put on your new boobies and march into 2016 feeling brave and beautiful and loved, because you are. ",
            "I know Claire is heartbroken, and it sounds like from your original post that her dad has always been in and out of her life, dropping in to spoil her when he feels like it, I doubt this is the first time he's broken her heart and let her down. And he's a petty criminal who comes from a family of cold-hearted knuckle-draggers, too. Still, being rejected and abandoned on Christmas for being who you truly are is a deep and major blow. \nWild idea, is it possible to move to a new town as far away as possible from these people? I just cringe thinking of her running into them at the mall or something.",
            "Everything you did is amazing. I'm so so happy to hear how supportive you are and wish you and your daughter nothing but the best! :)",
            "Came here to say that you are a wonderful parent. Truly. And I'm sorry more than I can say that Claire is having to go through this.",
            "She is very lucky to have an amazing mother like you ",
            "I'll echo the you're awesome comments! Also, as a father, there's no way I won't support my childrens' paths, regardless of where it takes them in life.",
            "This made me tear up. Claire is so lucky to have a mom like you! I hope her dad's family comes around. You handled that situation very well. I'm eager to see what type of woman she becomes and all that she accomplishes! ",
            ">I got her those fake gel insert breasts and some nice bras so she can feel more like a woman instead of a little kid. Some of you might tell me she isn't old enough for a gift like that but I could tell it made her feel more comfortable in her own skin.\n\nI think this is a wonderful gift and will go a long way. Your daughter is so lucky to have such a loving and supporting mom like you. \n\nGive the therapy time. It'll take a while for her to process and deal with the emotions attached to that. \n\nKeep it up OP!\n\n",
            "My husband and I run a support group in our small Texas town for trans folks and their families. It's beautiful seeing such a great mom. Thank you. ",
            "I'm sorry to hear your daughter is going through this. She's lucky to have you.\n\nWhy are you the one that had to break the news that her father didn't want to see her? That should have come from him, no matter how badly it would have gone, it would have been from him and may have given her some  real clarity (or closure) over this situation. I really hope I'm not coming off as rude or aggressive in this, but in all honesty you shouldn't the messenger between Claire and her father and his family. Good luck in the future dealing with this, it's not going to get any easier.",
            "> I got her those fake gel insert breasts and some nice bras so she can feel more like a woman instead of a little kid. Some of you might tell me she isn't old enough for a gift like that but I could tell it made her feel more comfortable in her own skin.\n\nThis is a beautiful, wonderful gift.",
            "Why would anyone say she is too young for a gift like that? It seems super in line with how women mature. She will be right with everyone else - not too far ahead or behind. So many people spend their entire lives waiting for their parents to accept them for whatever reason - your daughter is very lucky.",
            "Keep being an awesome parent. I feel sad for your kid. Most likely her dad isn't going to turn around. She's gotta give up on her own... To me that would be the worst part- watching her be heartbroken and knowing that if you got involved would make things worse. One thing you can do is re-enforce any positive male figures in her life. I like how you found a balance for both of you at Christmas.",
            "His family can't change what they don't acknowledge.  There must be a hero in that relationship.",
            "This is everything to me. I'm so sorry for your daughter's father. She doesn't deserve that, but she has a kick-ass mom. I honestly just want to hug you for being so supportive. I know how hard it is for your child to have someone in their life who isn't supportive. And it's a terrible loss. But she will be okay. One day she will realize that she doesn't need her fathers approval. I normally wouldn't say that, as I know how hard it is for trans youth to deal with, but with a mom like you... I think she'll be able to get through this. I want to say thank you from all of the trans kids out there. My little brother will love to hear about this in the morning! ",
            "You're a great mother. Best of luck to you and Claire.",
            "This is a pretty touching story.  I wish your daughter and you the best of luck.  It isn't an easy situation you guys find yourselves in, but remember, Fire and heat makes iron into steel.  ",
            "Sounds like you did amazing. People (family especially) can get really tangled up when someone comes out as trans. My family certainly did. It's been about two years and we've seen each other basically once (for a funeral), which went awful.\n\nI am so jealous of Claire for having you as a mom. Sometimes family members never come around, sometimes it just takes a looooooong time. Try and focus on the positives, and I think Claire will pull through. You've given her a lot of advantages. \n\nOne of the things my therapist told me early on has really stuck with me. He said the biggest factor in how successful someone's transition is, is the support network they have around them. Even when my family dropped me, having my friends standing strong meant the world to me. Stay on her side and you'll both be fine, in time. ",
            "Your definitely a good mom, keep doing what you're doing",
            "Your a good mum and like you said it's their loss. It'll hurt your daughter, probably forever. But one day she'll realize she's better off without people who can't support her at all in her life.\n\nAs for the bras, she is absolutely old enough for a gift like that. Most girls her age have developed by 16 so if it makes her feel more like herself who cares if it's not appropriate. (Which it's not)\n\n",
            "Thank you for being a great mother. I know things aren't going as well as you'd like, but I'm sure what you've been doing means a lot.",
            "Her dad sucks. Sorry about that.  \n\n ",
            "As someone who has had many friendships and a couple relationships with trans* and non-binary people, I just want to say thank you for being such a great mother. I've met so many people whose parents are straight up abusive because they choose to not accept their child's gender identities. I bet Claire will grow up to be an amazing woman with a mom like you by her side. I'm rooting for both of you :) ",
            "Just came across this and i want to say, as a trans woman, im glad youre a caring mom.  Theres a lot of suffering in this world and most if not all of it is unecessary.  I can only hope things will continue to improve for her, her fathers side, and society.",
            "I wish you were *my* mom! You're so good to Claire. ",
            "Thanks for being supportive of her choices, this will make a huge difference in her life! There needs to be more people like you!",
            "My FtM son just recently came out to my parents. My mom is VERY religious and wasn't very supportive that first night she found out. But-- after a few weeks went by, my mom told me that she has found a way to make it \"ok\" in her head. \nShe says that once we (humans) are done with our physical bodies on this earth and we move on to our next life as spirits- spirit beings are genderless. She says the only reason god gave humans sex was so we could \"go forth and multiply\". She says since our spirits (souls?) are essentially genderless, that she's okay with my son, because in the end it won't matter anyway. Our physical bodies are only on the earth for such a short time, compared to the millennia of spirit beings... Or something like that. \nSo- that's how my mom has managed to find a way to accept it. I told her \"whatever works for you!\" \nMaybe your husband and his family can understand my moms point of view if suggested? ",
            "I know I'm letting the world know I'm a big jerk here, but I'm very uncomfortable around transgender people.  I don't know why.\n\nI want everyone everywhere to have a happy life, but I it's a very deep-seated thing and I don't know that I can change myself on this.  \n\n:(",
            "I dont want this to be taken as sexist in any way. I would love for you to be the mother of my childern. My kids are already grown up but wish you could have been their mother. They both turned out to be decent human beings but they could have been so much better if they would have had a mother who not just gave a damn about them but went over and abouve what a mother should be. You are an inspiration to parents everywhere. We should all strive to be like you.",
            "If her dad can't accept her, he doesn't deserve her as a daughter. My dad was, at best, a zig zagger. It's hard, losing a dad, but the sooner you let her know that it is his decisions that make him lose her, not her own. And it is incredibly hard to realize that. I'm still trying to. But with a mom like you, I'm sure she'll be fine",
            "OP, you are fucking awesome and one of the best moms anybody could hope for.",
            "Thank goodness you are her mom! It's a damn shame that her father and his family are a bunch of transphobic morons. Hopefully at least her dad will realize that it's not bad to be trans, it just is. Sometimes people need some time to mourn what they expected for the person's future. I hope he comes around and realizes he didn't lose his child, that she is the same basic person she always was.\n\nI think your present is a great one and if she wants to do physical options like hormones, she's at the best age to do hormones. I have some trans friends that have opted not to do hormones and that's fine too. Everyone has to do what feels right for them. ",
            "you are so supportive. you really are a good mom. give claire my love, she will be ok :)",
            "she's young and with long future chance people may change or she will over years find new connections or it wont matter as much as it feels it does now. Any good trans forums or social groups she can join or set up so her and other kids can feel accepted when they have to go through this with some family. ",
            "You're an amazing mom! And to your comment about people thinking she is too young for that type of present - forget anybody that is telling you that is wrong! When you're 16, I think your body/having the right size boobs/etc. is a majority of what a 16 year old is thinking of! I can imagine how pleased she much be with your present and it was definitely a wonderful idea!",
            "The second I saw this update, I was crossing my fingers for some happy news. I'm very sorry your daughter's father and other family members are still being so close-minded. But I think you did an absolutely amazing job at being there for her and keeping her spirits up during the holidays. You sound like a wonderful mother. :)\nI sincerely hope that Claire is doing well and staying positive. She also sounds like a pretty fantastic person. Ya'll take care!",
            "You are seriously an awesome mom OP.\n\nI think that it wouldnt be a terrible idea to turn this into a bit of a learning experience. There are people out there who are not understanding and accepting like you. There are people out there who only like you for certain things. Some people just *suck*",
            "Check out the Episcopal church if you're in the States. Very LGBTQ friendly, and since you're saying, \"mass,\" I assume you're Catholic. Episcopal church, especially the Eucharist will be very familiar to you. There are some doctrinal differences, like less emphasis on saints, no need for regular confession, and the priests can marry, and are less likely to be fit fuckers, though they are quite likely to be fuckers of consenting adult members of their same sex. The priest that did my wedding worked at Budweiser to pay for his divinity school. \n\nYou'll like it. ",
            "You are doing exactly what you need to be doing. You won't be able to take your daughter's hurt away from her, and therapy won't yield immediate results, but I promise you that with time and love and consistent counseling, she will get better and be stronger for it down the line.\n\nYou rock.",
            "You need to do everything you can to un-fuck your husband's priorities. Kids come first.",
            "Hi. I'm a bit late to the party here but I thought I'd also add my two cents.\nYour daughter is going to be amazing. Please remind her not to worry too much about her dad. Though she does love him and of course in future hopes he returns the affection, she also has you who has provided her with unwavered and everlasting love that no one could ever replace.\nTell her to continue to be her own person and to remind herself that she is worth love and affection. And not to forget that she is also human.\nI hope your daughter transitions smoothly and I'd just like to say thank you. \nThank you for not only being an amazing mum, but for teaching your daughter that transitions will never matter in the eyes of the ones who love you, that no matter the changes those who love you for who you are will have your back and those who care for you will always want nothing more than the best for you.\nContinue being a great mother. I wish you both a great future. ❤",
            "Once again religion is the cause for great sadness. Hope she pulls through. On the other hand, at least this prepares her for real life. There are, unfortunately, a lot of people out there who hate TGs with a passion. I can't speak on the subject, because I don't know one, but I know I wouldn't hate them for what sex they feel they are. Yes, it's awkward, but her \"father\" is a special kind of *expletive*. If she pulls through this with your support and that of her therapist and her friends, she'll be stronger in the end.",
            "[removed]",
            "[deleted]",
            "I'm sorry, but what the hell is \"midnight mass\"?",
            "[removed]"
        ]
    },
    {
        "post_id": "7if511",
        "author": "strfcker",
        "title": "I [18 M] found out a number of my relationships were sabotaged/being sabotaged by my closest friends [18-19 M&F].",
        "url": "https://www.reddit.com/r/relationships/comments/7if511/i_18_m_found_out_a_number_of_my_relationships/",
        "score": 2555,
        "num_comments": 185,
        "created_utc": 1512741799.0,
        "selftext": "I consider myself as being happy that I can maintain a small number of circles of friends with some overlap between them. I'm even more extremely grateful to have this core group that I've grown up with for most of my life that stays mostly separate from the rest of the circles because it gives me the chance to speak *in confidence* about other people without any bias in the opinions that they give to me.\n\nRecently I found out that said closer circle of friends had been playing pranks on me for the greater part of this year, and had been getting a kick out of watching my frustration with new friends I had made this year decide to cut contact with me. I only found out as in a group chat I'm in someone accidentally referenced an event I had not told them about in a way that could only be described as them being orchestrators behind the drama.\n\nTurns out this insider knowledge came from my closest friend who had been actively reading my messages on numerous social media on my devices and with the help of the others in the group, began thinking and acting out ways to subtly mess with these newly-formed friendships and relationships.\n\nThey've told me that they only went after specific people that they deemed that my relationships with them won't last, and I had to agree to disagree because it was as a result of their interference with them that they didn't. And it hurts me deeply because I tried to be a more open person this year and I wanted these new relationships I made to work but negative experience after negative experience led me to returning to being defensive and overly-cautious with making genuine lasting friendships and relationships.\n\nI'm not sure how I'm to make a decision to address this. One part of me tells me to cut these people out of my life but I had known them for so long that to do so would leave a big hole where the mostly positive experiences I've had with them would be. What do you guys think I should do?\n\n  ---   \n  **tl;dr**: people I considered to be in my inner circle betrayed my forthcoming nature when speaking about relationships in order to influence the formation of my current circles of friends *for their own enjoyment*, what should I to address this?",
        "permalink": "/r/relationships/comments/7if511/i_18_m_found_out_a_number_of_my_relationships/",
        "comments": [
            "[removed]",
            "These are not \"pranks.\" This is bullying and isolation. This isn't funny or well  intentioned, it's cruel. However well you got along with these people in the past, they are not your friends now. Cut them off, every single person who was in on it. If your budding relationships are salvageable, go for it; also be on the lookout for a new friend group who won't treat you this way.",
            "[deleted]",
            "With friends like these I can't even imagine what the word enemy would mean. These people are shit, why would friends actively try to make you unhappy and laugh about it behind your back?",
            ">but I had known them for so long that to do so would leave a big hole where the mostly positive experiences I've had with them would be.\n\nSometimes it's better to cut your losses before the negative experiences start to far outnumber the positive ones. \n\nYour friends don't respect you. They 'deemed the relationships won't last'? Of course they didn't once they interfered! They betrayed your trust in them by messing with your life and from the sounds of it, snooping through your phone as well. They show no remorse from what you've said, and their behaviour is that of people who feel superior to you because they think they know better than you do.\n\nI would cut them off and move on. Maybe reach out to those people whose friendships you lost and see if you can make amends, otherwise make new friends. You deserve better than this crap. ",
            "You're going to get eleventy messages that say, \"dump them\", and that is, in fact, what you should do.  However, if you don't want this to happen again in the future, you need to figure out a) why \"dump them\" was not the obvious, only, and mandatory solution to you, to the point that you had to ask strangers what to do and b) what criteria you use to choose friends.  These two questions are related.",
            "Obviously cut them. Like seriously? It's not up for debate, that's some mental shit. I have a really insular group of friends who are definitely NOT the norm (we're all intense, not drink orientated, highly sociable yet antisocial, intensely loyal and private humans), but I can't imagine any of them (or myself) doing something to negatively interfere with my friends' other relationships, and certainly not to the vindictive degree they'll clearly been doing it. I can ALMOST see pulling a prank and at the end fessing up for all to have a laugh about it, but this shit is dark man. These people aren't your friends; you're their guinea pig. \n\nEither they're jealous and want to keep you for themselves, which is unhealthy and untenable, or they're purely malicious and don't give a fuck about you, which is also unhealthy and untenable. \n\nTime to move on; maybe you can reach out to these spurned friends and explain to them what happened? Might help kick-start your new social circle. ",
            "You sure they're your \"Friends\"? You sound more like a toy for them to play with. You don't need them",
            "\"Oh, so you think being cut off by friends is funny? Well start laughing, I'm out\"\n\nMic drop and walk away. But then actually cut contact, don't let them weasel their way back into your life just because you've known them for so long, or whatever other BS reason they'll try to manipulate you with.",
            "     I'm not sure how I'm to make a decision to address this. One part of me tells me to cut these people out of my life but I had known them for so long that to do so would leave a big hole where the mostly positive experiences I've had with them would be. What do you guys think I should do?\n\nI think you should let them go before their toxicity erases any fond memories you have of them. What they did is not okay to do to an enemy, let alone someone they claim as a \"friend\". It reveals a manipulative, rather evil side to them that I don't see how you can ignore now that you're aware of it.",
            "These people are manipulating you and are not your friends OP. Find better friends, you are still very young!\n\nAll my closest friends now, I have happened to meet after I turned 20, so never too late to find real friends.",
            "Cut them out. You are nothing more than a play thing to them. Believe me I know how you feel. I had a very close group of friends from middle school - through high school. We all survived different colleges and remained tight. But sooner or later, when you're dealing with toxic people, everything falls apart. I learned this lesson the hard way and had to cut all my friends out in my early 30's. Starting over is hard and as an adult making new friends seems impossible. Making new friends is difficult enough with out your so called friends sabotaging you. Cutting them out will be painful, it will be lonely and it will mess with your head. But it's still better in the end. At least by doing this early on in your life you'll have the opportunity to really take advantage of new opportunities to meet new people and the right kind of people. I am sorry this is happening to you. I know first hand just how painful this can be. ",
            "OP, I think you're not seeing your place in that group of friends clearly.  You're not \"one of them\".  You're the object of their ridicule, a target for them to get their jollies by attacking.  Obviously you're able to find better friends; I suggest you do so.\n\n",
            "OP please run. I had 3 'close' friends who knew I was on immune suppressing meds, use my toothbrush to clean out our sink drain (full of harmful bacteria) over me not attending one of their birthday outings. I had mostly positive experiences with them too. I cut them completely and never looked back, and its been better than ever without them. it'll be hard, but is WAY worth leaving the crap behind. what they did was NOT OK in any way and nor was it funny.",
            "Am I the only one here who thinks this is very much like “The Truman Show”??? \nIndividual being manipulated in situations for the entertainment of others? Ok it’s a very loose association but I hope you get my meaning. \n\nAmounts to the same thing though, man discovers his friends even very close friends are not who he thought they were so he dumps them and takes a leap of faith into the big wide world. It’s up to you buddy but if I were you I’d make that leap.... good luck",
            "These are not your friends. I wouldn’t deal with them anymore. It is not okay to sabotage someone’s relationship. ",
            "I dont know if Im just not understanding fully or what. But this old close friend was reading your messages and trying to sabotage yoyr newly formed friendships? Was this because you were talking crap about these new friends? I'm Just not understanding how/why these new friends would just cut you out with no reason/evidence of you doing something wrong. Either way...this \"close\" friend doesnt sound like a very good friend. So you need to cut them out. And if you are talking bad about people behind their back then you probably need to stop doing that also. If I am misunderstanding that then just ignore that. But it isnt a very good character trait to be the person that is always badmouthing people begin their back",
            "Your friends are massive piles of shit. You've opened up to them and they've exploited you. They're going through your devices and actively interfering with your life. And when called on it, they try to justify it by saying \"oh that wouldn't have worked out anyway.\"\n\nTHAT ISN'T FUCKING UP TO THEM. It's also probably not why they're doing it; they're doing it because they think it's funny to control your life.\n\nSeriously, remove them from your life. You'll be much happier in the long run. Also, change every single social media password you have, starting with your email account.",
            "My god these people hate you and they are also psychos.  Please cut them off and secure all of your social media accounts.  Report them where you can online for getting into your accounts.  I assume that's what you mean by them reading messages.  ",
            "Cut them out of your life forever. these people are not your friends OP, regardless of your past experiences. You've become their plaything. They don't respect you.",
            "RUN. These are not your friends, they are bullies and psychos. \n\nNO one who would do this to another person can be called a friend. Ever.",
            "Ewww, how awful. These aren't good friends. They are just having fun playing with your life. Change all your passwords. Email, social media, apps. Privatize your insta and FB. They don't get to be involved with your life anymore. ",
            "This is such an invasion of privacy. I'd get rid of that friend stat.\n\nThat said, don't say anything about anyone that you wouldn't say to their face. The undertone of this post is that you gossip to different friend groups about other people outside of that friend group. I'm guessing this friend got hold of some of these messages and passed them on? So he's an asshole for doing this. But don't badmouth friends either.",
            "wow. your friends have serious mental issues. ",
            "I also had this experience back when I was in high school with my childhood friends. Initiallly it was hard for me to admit it, but after my mother and counselor convinced me, I decided to block them and ghost them. I've never felt so relieved afterwards.\n\nYou may have been friends with these people for so long, but the fact that they're stifling your relationships and growth as a person by interfering in the shadows and making you suffer for it for THEIR enjoyment is highly immature and intolerable behavior. \n\nLike what the others have said, you'll need to block them and cut them out of your life. It'll be difficult at first, but you might be surprised how relieved you'll feel after dumping all that drama away. \n\nI don't know if you're already in college or going to be in college, but there're so many opportunities for you to meet new people, form new friendships, and make wonderful new memories with them. I wish you the best of luck!\n\nEdit: spelling",
            "I think you're best off ditching them, at least for now. Most people don't stay super close with people they grew up with anyway. \n\n\nIf you're 18 then chances are a lot of people you know now will be moving away to study/work soon (great if you are too because it's a fresh start, but no worries if not, since you sound like you make friends easily). If they do, then maybe they'll mature and get some perspective and if you want, maybe you could re-engage with them in the future. But honestly, I wouldn't want to bother with people like that, they don't sound like friends at all. \n",
            "You are 18. You have known these people for a long time and they have played a huge role in your life so far.\n\nBut you have a LOT of life ahead of you. You have many decades of friendships ahead of you. Don’t waste them with bullies who fuck with your life for their own sick entertainment.",
            "This is awful.\n\nYou only feel close to these guys because they have made it so no one else can get close to you. This is not how friends work. What they are doing is extremely cruel. ",
            "Those are not friends. They're evil. Life's too short to deal with assholes like that. Tell them to fuck off, tell them why and cut them out of your life.",
            "Sounds like you may be the designated punching bag. Only allowed in the group under the condition that they can abuse you for their amusement.",
            ">One part of me tells me to cut these people out of my life but I had known them for so long that to do so would leave a big hole where the mostly positive experiences I've had with them would be. \n\nOr, a big shape for friendships with non-shit humans. Dude, these are not good people. They fucked with you and your life - they've messed your ability to relate to others up - for kicks. Because they thought they had the rights to you. They were laughing at you behind your back.\n\nCut them out and try to repair relations with some of the people you lost because of their interference.\n\n",
            "They broke your trust and prevented you from improving and becoming a better person. You need to cut them out or take a break from them. I already feel so betrayed from reading your story and it hurts. It is not worth it and they are not your friends for doing that. The decision is yours to make.",
            "Ghost them, totally and completely.  These people are not on your side, and are not your \"friends\".  Easier said than done, but they would have kept up with their manipulation and sabotage had they not been caught.",
            "Post publicly about what they did and what terrible friends they are. Explain to your lost friends what happened and what these people put you through. And then cut them off from your life 100%. Block numbers, accounts, email addresses, even change the locks.\n\nWhat a bunch of assholes.",
            "I call bullshit, this guy is making a [How I Met Your Mother reference](https://en.wikipedia.org/wiki/The_Front_Porch), the same way one guy did a [Friends reference](https://en.wikipedia.org/wiki/Friends_\\(season_8\\)#ep178) [some time ago](https://www.reddit.com/r/relationships/comments/3jgiyh/i_33m_just_found_out_that_my_wife_32m_held_a/)",
            "Whether relationships will or will not last has nothing to do with them, so them interfering is just wrong. I would do what other people have said, cut them out. ",
            "Cut them out. You don't sound like a friend to them - just someone they can fuck with. There won't be a hole - the mostly positive experiences you've had with them will always be there. But you'll be to move on without them screwing things up for you.",
            "As everyone else has said, these are NOT your friends. People do stupid things all the time, but this behavior can ruin people’s lives. They have no sense of good judgement. I have some lifelong friends where I had to cut ties for one reason or the next, and nothing was ever even remotely this messed up.",
            "that's super shady. I mean who are they to monitor your friendships? You are an adult and even if you have poor decision making skills, it is still not their right to police your relationships. You need to check them.  ",
            "Usually in a situation like this you have one person leading the manipulations for whatever reason floated in their head. You might suspicion who it is, you may have no ideal, but it does say something about the rest of your group that they would go along with hurting you. Basically, these people don't have your back and at least one of them is actively out to hurt you, so just get out out the situation. Find better people to be friends with, and don't shut yourself out due to some asshats, the world is full of them and they aren't worth the time. ",
            "Don't fall for the sunk cost fallacy here. No amount of positive experiences could make up for that kind of deep betrayal. Tell them all to get fucked.",
            "Ghost them. Block their numbers, change your phone + email, delete Facebook et al.\n\nThese people are abusers and they will not react well to you standing up for yourself. ",
            "You have to come clean about a prank and the prank also needs to be something you would find amusing, for it to be a prank. This is bullying, not pranking.",
            "I'd ghost them. They're not your friends. You're their punching bag. ",
            ">One part of me tells me to cut these people out of my life but I had known them for so long that to do so would leave a big hole where the mostly positive experiences I've had with them would be.\n\nThis part of you is wrong.  These folks are not your friends, and you need to re-evaluate the experiences you've had with them.  They consider you an object of pity and scorn, a puppet whose strings are to be jerked for their entertainment, an object to be manipulated without its consent.  In doing so, for their own entertainment, they have harmed you and do not care that they have harmed you.  When people behave in this manner, none of your experiences with them can be genuine or good.\n\n>What do you guys think I should do?\n\nCut these jackasses off and find a friend.  I mean just one - it doesn't sound like you've ever had one.\n\nIf you think there's any chance that some of the relationships these people destroyed are not beyond hope - if the bridge is not totally burnt - you might consider reaching out to those people who cut you off, and notifying them that they were made unwitting participants in a game of manipulation.  In the bigger picture, your \"friends\" are a cancer on a community of people; that cancer needs to be cut out and burnt.",
            "You are friends with a bunch of toxic sociopaths.  Get rid of every last one of them.  Cut contact and never see them again.  If you see them in a supermarket and they say hi don’t acknowledge their existence.",
            "Everyone gave good advice , and here is mine, in this age never ever give access to your personal accounts if you don't want them to snoop or in case of a phone call for a prolonged period of time. Today your accounts are becoming your lifeline considering how much of your personal information is on them.",
            "OP I know this must be difficult but you need to cut them out. What they've done is so far beyond a harmless prank that I am at a complete loss for words. I would also suggest you take screenshots of them admitting to it and sending it to those friends they drove off. That might lead to you re-establishing contact with them. Seriously wtf? This makes me wonder what else they've done to sabotage your life without your knowledge...oh right! Also make sure to change all your passwords and switch to new emails so they lose access to your stuff please!",
            "You need to cut them out. They are selfish and untrustworthy. You're clearly capable of building new relationships. You will fill this hole with better people who have your best interest in mind.",
            "Cut them out. These are manipulative monsters, not friends.",
            "True friends don't do shit like this.  They support each other and they don't sabotage each other.\n\nI don't know if I'd cut them out of my life completely as a result (it'd really depend on what they did), but I'd definitely move them from the inner circle to the outer one.",
            "Cut them off. You don’t need this. ",
            "Since everyone has already told you to dump them, I'm going to remind you to change all your passwords as well.",
            "Cut em outta there. Friends don't do this to friends, and generally people don't do this to people. This is really bizarre invasive behavior that shows they don't care a single bit about your feelings. This sucks. Leave and don't look back. You are better than having to put up with this shit.",
            "This happened to my current boyfriend on several occasions while we were in high school. \n\nWe both had a crush on each other and were pushed apart. \n\nAlmost 10 years later were planning our wedding. \n\nAs cheesy as it is, what will Be will be. ",
            "True friends wouldn’t do that. That’s some crappy immature behavior.  You deserve better friends than that.",
            "Cut them off, but tread carefully. If this is how they treat you when you're their friend I'd hate to think of what they might do once you're not.",
            "You need new friends.  You're 18, I'm sure you'll be fine.  ",
            "Learn from this experience and be weary who you trust in the future :( I'm so sorry, man. ",
            "Do not keep making a mistake just because you’ve spent a long time making it. Don’t be fitness with jerks just because you’ve been friends with the jerks for years. ",
            "Fuck those greasy, fake, dickheads. Your friends should boost you up, make your life better, and add to your life not frustrate you by sabotaging your other friendships for fun. People have gotten the shit kicked out of them for much less than that.",
            "Accessing someone's devices without their consent is a violation of the CFAA and can result in criminal charges.\n\nYou know, just saying, if you swing that way.",
            "A super good friend of mine did something similar to me. When I cut her off because of my own safety/happyness, she still did the same things (chatting and flirting with people, offending me and other behind our backs, etc) with another dear friend of mine. This said friend actually cutted me off because that other friend wanted to make me look bad instead of herself.\n\nAfter talking, me and friend B are back to being close and the first one ended up being alone and without any friend as close as we were. It hurt, but it was for the best.\n\nGet rid of them, block them everywhere, make sure they don't know your social media passwords so that they cannot know anything else about you anymore and try to please move on.\n\nGreat people will come after them, don't worry. You should have never been hurt that way. I'm sorry this happened to you dear. Please find better people to live your life with and I promise you, if this means you'll be \"alone\" for some part of your journey, it will be for the best.\n\nGood luck!",
            "Do not hold onto friendships that aren't working out solely because of the length of the friendship. The quality of the relationship(s) should absolutely   outweigh the number of years or quantity of the friendship. \n\nI cut out one of my closest friends from high school for entirely different reasons. At first you feel that you might have a \"hole\" where that relationship was, but it goes away over time. As you mature and grow and gain new friends, acquaintances and relationships you'll begin to see the difference between people who stay for obligation and people who stay because they genuinely care about you.\n\nFriends do not sabotage. Friends don't lie.",
            "Sounds like you need new \"friends\". It's as simple as that. ",
            "Cut them out of your life. 18-19 year olds can be among the shittiest people on the planet. They think they know everything and they end up being total pieces of shit. They are not your friends, they are not decent people, fuck em",
            "Sorry to say, those aren't your friends.",
            "See, if their intent was solely to help you, and maybe like snooping and finding good stuff to say to the person your trying to see/be with, I would say tell them to fuck off. But it seems more malicious than that, it was fun for them. They also did not respect you as a person to make your own decisions, kinda alluding to they don’t think you know what you are doing. \nI’m sorry that you’re going through this, it sucks when friends aren’t nice. But I don’t think they respect you. \n\nYou mentioned that you’ve been trying to be a more open person, which I can imagine makes this even shittier bc like, you were trying to put yourself out there and they put you right back in their back pockets by doing that. Don’t let them. You deserve to meet people, fall in love on your own accord. Also, you deserve to end things on your own terms. They are robbing you of your experiences. Don’t let them make you a ‘sidekick’. You deserve to be validated and they aren’t doing that for you.\n\nAlthough cutting them out would be ideal, I think it would be hard bc you said your friends all intermingle. My advice would be to continue branching out, and try to confront them and let them know that’s a fucked up thing to do. If that doesn’t work, just keep your distance and continue on like normal w other people. If they ask be blunt ‘I care about u guys and all, but that was shitty and I can’t trust you not to do it again’. Seems like a big blowout wouldn’t work bc I don’t think they take you seriously. Just ghost the motherfuckers. Good luck. Continue putting yourself out there. Itll pay off.",
            "Time to get new friends. Don't worry about it none, people come and go in our lives its how we grow as individuals",
            "Change all your passwords and don't be friends with these people anymore. Block them on social media. ",
            "How do you even get friends like these in the first place, where do you find these losers?",
            "There is nothing, to me, that could make up for the abuse of having them manipulating your social life, as recreation.  You can have good times with lots of people.  It sounds like you have grown up, whereas it doesn't sound to me like they have.\n\nI'd suggest you just accept that you're going to have a big hole in your social life for a while, and go out and find people who aren't going to toy with you for their own pleasure.\n\nPersonally, I would be so livid I wouldn't talk to these people again.  They were playing games with your life, to the point where it set back healing that you had accomplished.  To me, there is little difference between that and, say, stepping on someone's broken foot just for the pleasure of watching them scream and fall over.  :(",
            "These people are not your friends. What kind of friends would manipulate and sabotage your relationships with people just for kicks? Do yourself a solid and cut ties with these idiots. They probably dont value your friendship like you do theirs. Try to get in contact with the new friends you made and explain your situation. You're only 19, plenty of time to make better friends through college or work. ",
            "It's not a prank to mess with someone's others relationship. It's outright malicious. Friends don't do that. \"Frenemies\" do. Confront your friends, tell them how you really feel. Anything other than complete apologies and assurance it will never happen again - if not - cut them out of your life. They are not friends...",
            "Have you already called all of them our? I'd cut out anyone who doesn't apologize immediately.\n\nFuck those people. They aren't your friends.",
            "We raised a generation of psychopaths. Jesus.",
            "Six billion people on the planet. Go make friends with people that you might not have grown up near, and who treat you like a human being.",
            "I just read the title - That shit is horrible, get away from them, they are not your friends",
            "these \"friends\" sound like psychopaths.\n\nTo do this to someone over a year is seriously fucked up.  If you stay their friend after this you are a fool.",
            "Walk away from those people forever. Change all your passwords for social media. Cut all contact with them asap. \n\nHigh edit: you could also confront them about it and express some of the thoughts you shared here, and try to really get across to them how fucked up it was to do that and how it affected you. I personally would not want those type of people in my life.",
            ">I wanted to be a more open person this year and I wanted these new relationships I made to work. \n\nThat's exactly why they did it. They're keeping you isolated so you only have them. ",
            "That's a terrible thing for them to have done to you. They are evil. \n\nI experienced something very similar but quite a bit more damaging to my life overall (mostly because it happened all at once and I was older than you so I had a career and mortgage to attack as well). \n\nThe other posters are right that you should cut them out of your life. If you're anything like me, you'll feel better about this when it's r/prorevenge material. ",
            "Hey /u/strfcker ... A lot of people are telling to to cut these people out of your life right off the bat, but I sense from your post that you'd like to maintain these friendships of your inner circle if possible.  In that case, you should first get everyone involved together and have a 'come to Jesus' talk and confront/talk to them first.  Explain how what they did was fucked up on so many levels and get their input and from there decide on the next course of action.  Depending on their reaction, cutting them out may be the best thing to do.  I'm sure some other people have advice on the best way to go about confronting them on their nefarious actions and only you know what they could do to redeem themselves if that's possible.  Just a thought ",
            "How cruel...kick them to the curb.",
            "The most delicious cake in the world that is frosted with poop is not delicious, it’s poop cake. \n\n\nThere are some things that effectively ruin a relationship no matter how wonderful everything else seems. Shattering trust and treating you like a child who doesn’t deserve the autonomy to make his own friendships are a big pile of poop frosting.",
            "Change all your passwords, put a login on all your devices, \nand cut them out of your life.\n\nThe things they've been doing are sadistic, and actually these people sound *dangerous*.",
            "You're at an age where you will likely make new friends that you know for most of your life (18-25).  Cut ties with these people. They're holding you back from other relationships for their own amusement. \n\nI've done it.  At 17 I cut out half my friends because I finally saw how they were using me.  My friends since them have been way better, and I never would have met them if I hadn't have cut those people out. ",
            "Call them enemies in disguise of friends>>Bloody creeps",
            "can you explain at all what happened??",
            "These people are not your friends.  They are enemies who pretend to be friends or frenemies.  You deserve real friends.",
            "Ever consider that the defensiveness and caution that you are actively trying to overcome may stem from the relationships you have with this group of people? \n\nThese \"friends\" seem pretty manipulative and malicious. Keep up your healthy goals and maybe consider sifting through your current relationships to explore where this pervasive distrust of others comes from.",
            "If they are controlling who you form relationships with, you are living as their slave basically. As someone said, it's an abusive relationship, wherein you are the victim. It's like you were locked in a room and they decided who entered and who didn't, but you were not aware of it. You were basically starring in your own Truman Show.\n\nYou've seen them for what they are and what they are capable of. You found the exit door hidden in the wall, get out of there man!",
            "Friends? Pranks? \n\n\nThis is a manipulation and degradation, if I ever saw one. \n\n\nWhat they were doing, was messing with your life. Who the hell are they to decide if your relationship is going to work?\n\n\nAdvice: if somebody treats you like a psychological experiment, he is not a friend. I'd tell them to fuck off, break contact and remove them from all my social media. I'd never speak with any of those shitheads again and considering how this topic pisses me off, there would be some serious pro-revenge topic opening in a due time. \n\n\nAll the best. Please take control of your life and don't stay with that bunch of abusive assholes. \n\n",
            "Lily? Ted, is that you?",
            "You don't need them. Cutting them off will suck because, like you said, you had so many positive experiences with them.\n\nBut you have to remember, those were \"positive\" experiences with people you didn't know at the time, would have no problem with hurting you like this, as if your feelings and personal relationships were just a game.",
            "Before you cut them out, please document everything just in case; especially the texts where this 'pranking' comes into light and also their reaction after you've dumped them. May come in handy one day.\n\nGood luck, OP!",
            "Doing something shitty, and then claiming it \"was just a joke, what's the matter with YOU, you  can't take a joke ??\"  is the essence of a bad manipulative \"friendship\".   ",
            "Confront them as to why they did that. I personally haven't sabotaged but some friends at times took some really bad decisions and started to hang out with people I felt were no good, I always took the approach of just say that I felt something wrong about them and just never hang out when they were there (I was right all the time it happened and nope it was not a super power but more like these people were EVIDENT douches) maybe they were trying to protect you.\nIf they were just being assholes you can tell them how you feel and to fix what they did, after that if you feel they still haven't matured you can definitely leave them. And don't be scared as when you trash toxic relationships you change for good and feel more confident. ",
            "What the fuck? I was expecting this to be about friends sabotaging romantic relationships which is messed up enough but they have the gal to try and control who else you're friends with? \n\n\nNu-uh that's some next level immature shit right there. Sorry but the length of time you know someone doesn't justify shitty behavior, and if they know you won't stand up for yourself they'll just keep doing crazy shit like this.\n\n\nJust ghost man, they don't even deserve a friendship breakup text.",
            "Lots of good advice here, I don't need to tell you to cut them off. I will however tell you to try to learn something from this. This may happen again. It happened to me when I was your age and it happened again 10 years later. Bullies can be of any age and I think they just refine their art of manipulation the older they get, if they just get away with it. Please, learn from this. There's really nothing wrong with trusting one's friends, but it's really dangerous to be naïve. I hope you give us an update. Take care!",
            "So many people offering advice and I can't make sense of what this post is about? What did they do in particular? Any details? ",
            "A lot of people are jumping right to cut them out of your life, but frankly I think this whole post is way too vague to give advice off of. I don’t understand at all how they could have possibly sabotaged your relationships with your new friends unless maybe you were talking shit to them about these new “friends” and they went out of their way to tell them?  Can you give any specific examples of how they managed to sabotage multiple relationships of yours? ",
            "[removed]",
            "Snooping can be hardly punished by laws. \n\nA husband snooped on his wife mail from a computer he bought. It ended by him risking prison, and avoiding it, because she snooped too on his phone. \n\nYou should do a fast search, find the article about this, and innocently post it in the group chat,  with a \"wow if you spy on someone else private message,  you can end in prison\". \n\nI bet they will freak out. \n\nThen dump them. ",
            "I don't mind you totally cutting them out but I also don't mind you keeping in touch. I think a big indicator should be how they react to you now knowing. Did they apologize and feel bad about it? Or is it just one big joke to them? \n\nIf you decide to keep them as friends to me a lot of changes need to make with the big one keeping your social media on lockdown. Although you might actually want to think about leaving it open just to see if they do something similar again. If they do then you can cut them out for good. \n\nSince your 18 I would imagine your going to head off to college/university. Regardless of what you decide with your friends use that opportunity to make new friends.\n\nGood luck!"
        ]
    },
    {
        "post_id": "3tbei1",
        "author": "sabin1dal",
        "title": "[Update] I just realized that [20F] have a twin brother that my mom never told me about.",
        "url": "https://www.reddit.com/r/relationships/comments/3tbei1/update_i_just_realized_that_20f_have_a_twin/",
        "score": 2559,
        "num_comments": 92,
        "created_utc": 1447867154.0,
        "selftext": "[First post](https://www.reddit.com/r/relationships/comments/3swbe5/i_just_realized_that_20f_have_a_twin_brother_that/).\n\nLots have happened in the past few days. I'd like to thank all of you who helped me and gave me different opinions, especially those of you who shared personal experiences. Quick summary: My mom confessed that I have a twin brother who she gave away for adoption shortly after we were born because she was alone and didn't have the means to take care of two kids.\n\nFirst about my mom. I talked to her at length about how I feel and told her everything that I felt. That I understood the situation she was in and how this was the most difficult decision of life, how it's easy to blame her for it but that she did what she thought was right, and how I really don't blame her for doing it or for not telling me, but I would have preferred if she had told me sooner. She asked if I would forgive her? I said even though there's nothing to forgive but yes. To be honest she's at ease now, more than she's ever been. She told me a few times that now she feels unburdened, which I'm happy for her. For all the problems that we had she always took care of me to the best of her abilities and I know nobody loves me in the world more than she does.\n\nAbout my brother, I decided to contact his parents, reach out and ask whether they have told him, what they think about this whole thing and how they want to go forward. I know we are 20 and I didn't have to contact them, but I thought reaching out to them was the best idea. I don't want to create a mess in my brother's life, in case he doesn't know. So I found his mom on Facebook and sent a message, mostly what /u/jpallan suggested in the previous thread. I explained who I am, that was just informed of the whole thing, that I'm interested in getting to know my brother, etc. I left my phone number too.\n\nShe called me a few hours later and asked how I was doing, she was really friendly and asked if we can meet to talk. We arranged a meeting for the next day (yesterday), in my town even though I was willing to go there but she insisted.\n\nSo we met at a café. I was very stressed and really didn't know how it was going to go. I couldn't have guessed. She was very friendly and nice. When we started talking she was just looking at me. She told me that I have my brother's eye and hair color, our eyes are the same color, my fingersnails look exactly like his, that I smile like him. Honestly it was getting a little strange. She had tear in her eyes and cried a few times. She told me about how she wanted to adopt both of us but my mom couldn't go through with it, how she had gotten attached to me for the few times that she had met be before my mom decided not to put me for adoption. She explained how she decided to adopt another girl instead for years but none of them felt right as she couldn't replace the feelings that she had for me. I was really surprised by all of it.\n\nSo my brother does know that he is adopted, but doesn't know about me. She said they planned to tell him on when he became 21 but she thinks he is ready to know. She asked me to give her a week or so and allow them to tell him everything and then we can meet. She had brought a USB drive full of pictures and videos from his childhood until now for me to see. We took a few pictures there for her to show him when they tell him about me. \n\nLast night my mom and I went through all the pictures and videos, my mom was crying all the time. She was very sad but she also had some happiness because in all those pictures and videos it seems like he is happy and has a very good family who love him very much. I really hope this helps her overcome her sadness and feelings of guilt and regret.\n\nSo that's the progress. I'm waiting for her to contact me. \n   \n**tl;dr**: I told my mom that I don't blame her for anything and she shouldn't feel guilty. I met with my brother's parents and it went well. He knows he is adopted but doesn't know about me. They wanted to tell him and hopefully we will have the opportunity to meet and get to know each other after that.",
        "permalink": "/r/relationships/comments/3tbei1/update_i_just_realized_that_20f_have_a_twin/",
        "comments": [
            "[deleted]",
            "Sounds like both you and your brother have loving mothers. ",
            "Everything seems to have turned out great. Your brother's mom seems to genuinely care about you too. It's good that you didn't bypass her and gave them the chance to tell him themselves.",
            "> I said even though there's nothing to forgive but yes. \n\nI'm really proud of you for coming around do quickly. Seriously, this update makes me feel like someone's been cutting onions around here. \n\nEverybody involved is being very brave. Proceed with caution, but I hope that in the end you end up with a whole new branch of the family! \n\nSending lots of hugs. ",
            "OP you better update us again!",
            "This is a great and movie-like update.  When I read the first one I had to jump to the end and make sure there wasn't something like, \"also, my brother is a Jedi.\"",
            "Dude. You GOT to have a video of the two of you meeting and showing on Reddit.  LOVE LOVE this update.  :) may you and your brother be friends for life and have TWO loving mothers.  ",
            "It sounds like she really cares for you as well. I truly hope you develop and great relationship with your brother and his mom. I am so glad your mom is unburdened too. Best of luck!",
            "just airing on the side of caution, and this may be a bit indelicate, but what are both you and your brother's economic backgrounds. you mentioned you had some struggles growing up, is your brother in an affluent family. \n\nim only asking because if he is, your mother may fall into the trap of thinking that he's had a better 'opportunity' and maybe you would've been better being adopted as well. im not saying that this will happen, but it may, especially with seeing all those pictures and videos of the way he grew up, she may begin to resent herself for keeping you from that same opportunity. \n\nmaybe keep an eye out for this and respond how you feel appropriate, should you need to.\n\ni just have this uneasy feeling that the focus of this event will be on this other family meeting 'the son that got away', so to speak. please make sure that your mother is a part of this every step of the way, that means not just keeping her apprised of the situation but a part of the situation itself.",
            "While I doubt it will happen you may want to be aware that as great as all this is going there's the chance that he might have resentment with your mother/his biological mother for having given him away and depriving him of his sister.",
            "I was adopted too.  I wish my biological family would try and reach me.  Mine was a closed adoption in California though so there isn't an easy way to look them or me up.",
            "Nice! One of the most \"feelgood\" posts I've read here.",
            "Omg this is like a life time movie!!!!!! Haha congratz dude. Hopefully y'all can build a great relationship and catch up on lost time. ",
            "Wonderful update. I hope it all goes well, I teared up reading about the adoptive mother's reaction to meeting you. ",
            "Probably one of the best updates I have ever read on here. Fantastic, OP. Be sure to let us know how meeting your brother goes.",
            "Keep in mind OP, your brother may be mad that your mom decided to keep you but gave him away. She's still not okay with the whole thing as she lied to you and told you they only wanted him. He may be mad that she A) kept him from growing up with his sister and B) that you were \"good enough to keep,\" while he was given away. I wish the best for you OP.",
            "That's awesome!",
            "I fucking shouldn't have read this thread. Now I gotta hide my eyes from my coworkers for a bit",
            "It's going to be much tougher on your brother I think when he finds out.  The question that immediately springs to mind is, why was it him and not you that was given away?  I think it might take some time to reconcile this, as well as his inevitably wanting to meet his bio mom.  Definitely give him time and space to process this after his adopted parents lay it on him.  He might need a few weeks or more to digest everything.  ",
            "Dammit who is cutting onions in here? I'm so happy for you and your mom op!",
            "What a happy update! Can't wait for the film adaptation :) :)",
            "You're a very kind and loving daughter.",
            "Honestly your story is too good to be true and I am so excited for you that you get to meet your brother!",
            "God, I can't even express how happy I am for you. Not only did you gain a brother, but it seems like you've gained a whole second family who care about you and seem ready to love you the way they love your son. I wish you and both of your families all the best moving forward. ",
            "OP what a fantastic story!! Please keep us updated. =)",
            "It sounds like you've gone about this perfectly, and that he has been raised by a great couple. I'll be keeping an eye out for your next post after you have met him, assuming he copes with the idea. It was great of his Mom to bring the photos and videos, I think that bodes really well.",
            "That's a pretty awesome outcome so far. Hopefully you get to meet your brother soon! ",
            "This is great, OP. I'm so happy for you!",
            "Meeting your own twin at age 20 must be goddamn trippy",
            "That's great!  As an adoptive mother myself, I know that I care about my daughter's family of origin and it's not a threat to my relationship with my daughter. \n\nI've also known adoptive families that are still a bit insecure and worried that the biological relatives will \"steal\" their kids.\n\nHowever, relatively few adoptive families I know now are like that.\n\nI'm delighted it worked out, and I think that you will enjoy getting to know your brother.",
            "Remind me! 7 days",
            "Well now I'm all teared up... best wishes for your new twin relationship!",
            "You'll finally get to see what your dick would look like if you had one!",
            "Please follow up with one more update when you meet your brother! ",
            "Reading this I am just thinking about the experience your mothers brother must have give though, to start to love two child like that and then say bye to one, she must have really cared for you. \n\nIt sounds like you are all going to be a, albeit slightly unconventional, family. I hope your mother can finally meet her birthson.",
            "*hugs OP super tight* Thank you so much for the update OP. Your brother's adopted mom seems so nice. I'm glad this turned out really well. Please keep us updated. <3",
            "Fingersnails!",
            "I really love happy updates like these.  I'd love to hear how it goes when you guys finally meet.",
            "Would you mind updating again after you meet with him? This is a story I really enjoy following. ",
            ":)",
            "I'm a father of 1.5yo fraternal twins, your post had me in tears.  I cant wait for the final update, don't leave us hanging OP!",
            "Please give us an update when you meet your brother? :) ",
            "Congrats to the OP, but one question I had.\n\nWhy would you tell your son he's got a sister on his 21st birthday. Cause that would've gotten me even drinker than I would have otherwise been. ",
            "shit....who's cutting onions in here.",
            "This could turn out to be a really good TV show/movie. Won't be surprised if producers are already PM-ing OP.",
            "You gave her her son's childhood back, one that she never experienced.  You are amazing.",
            "Aww, I love when things can come together like that. I hope everything goes well.",
            "How many adopted 20 year olds are reading this thinking \"What if it's me???\"",
            "I'm so happy for you ! This sounds like a great situation :) :) congrats !",
            "Great news OP! How is your mother doing? Will she be meeting your twin too?",
            "Waiting for update no.2\nGood job OP!",
            "Just...be prepared for it to not go well. He could be very resentful or dismissive. You are strangers and finding out that she kept you and gave him up is going to mess him up. There's no fun way to hear that. ",
            "Man that story is happy and sad at the same time...I don't know how to feel. Hope it turns out well for you. What you did is exactly what I would have suggested had I read the original post...so good on you...also, you're mature as hell. Seems you've been raised well ;)",
            "Update on meeting your brother please. <3 you are so wonderful. ",
            "You should watch the movie 'Twinsters' on Netflix!!! It's about long-lost twins too.  Good luck, and we'd love an update on what it's like to meet him!",
            "update",
            "Any more updates??",
            "This is great!  What a wonderful new adventure you'll have.  A new sibling without all the fighting over who gets to go first on the slide or who gets the bigger apple.",
            "I'm just bawling.  There are people who don't have mothers who really care about them and it sounds like you have two.  \n\nYou handled that really well.",
            "[deleted]",
            "Incest ;)",
            "OP you should randomly meet with him and surprise the shit out of him, only if the two of you look almost the same. Just to make him freak out, then explain everything.",
            "I got dared to browse this sub combined with r/incest and I'm gonna admit I did not expect this but good on you op."
        ]
    },
    {
        "post_id": "6py1en",
        "author": "gemagema",
        "title": "[UPDATE] I [19F] am being excluded from our gaming group. I decide to find a new group. Boyfriend [20M] is the one upset.",
        "url": "https://www.reddit.com/r/relationships/comments/6py1en/update_i_19f_am_being_excluded_from_our_gaming/",
        "score": 2559,
        "num_comments": 243,
        "created_utc": 1501181000.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/6p3gsf/i_19f_am_being_excluded_from_our_gaming_group_i/\n\nThank you everyone for all the advice! And thank you to those that also offered to play with me. I wasn't expecting my post to get so many replies. Unfortunately, I had some unrelated family business, so I couldn't respond to you all. However, I have read everything and have taken all your words into consideration. Some people have also asked me questions about how we can play so often, how long I've been with my boyfriend, etc., so I'll just give a brief background (skip to the next line if you don’t want to read it). \n\nFirst off, most of us are college students [18/20], either working part time or staying at home with our parents. As of right now, most of us are on summer break. We only have two older members in the group, which are R [25/M] and another guy [23/M]. The rest of us are or fall under 20. R is actually married and his wife makes good bank, so he has a ton of free time. \n\nSecond, about my boyfriend. Surprisingly we met through the gaming group, as he was the one who advertised it, which was how I found and joined the group. That was about 2 years ago, and about a couple of months after we met, we just clicked and started dating. My boyfriend has known R for about 3 years, so they're close friends. However, R did not join the group until 6 months ago, as my boyfriend invited him because he thought it'd be fun to have him there too. I did not know much of R, other than that he was my boyfriend's friend, until he joined the group.\n\n  ---   \nSo, after I posted my original post, I signed up for 2 different groups. The first one was an all-women’s group [16-20F]. They responded to me pretty quickly. They were very nice and polite, but explained that they only play once/twice a week. Unfortunately, that didn't cut it for me. The second group responded to me the next day, and I learned that they were more active but that they're also an all-men’s group [17-19M]. However, they were open to having me there. At first, I felt pretty sketched, but the oldest and most popular guy [19/M] there took me aside and explained to me that he does not tolerate any type of harassment and that he will definitely kick out any of the other guys if they were bothering me. Hearing that made me feel more comfortable and I played some games with them. I had so much fun! All the guys were really nice and friendly. No sexual remarks, no more screaming of profanity against women, etc.. It was nice being in a group of people who were happy to play with me.\n\nAfter I finished my games and left, my boyfriend called and asked if we could talk. When he came over, before I could even ask or speak myself, he told me he was really sorry and that he screwed up big time, and he understands how wrong he was. He said he didn't want me to go to a new group because he feared that I would leave him too for some new guy. Then he told me that he didn't realize how hurt I was from being excluded from the group because I had never complained or voiced against it, which was true. I never complained about the exclusions, or even R’s behavior before, because I knew it would just cause more conflict. I also didn't want my boyfriend to stop playing with his friends because of me. I explained this to him, and he said he was sorry for not defending and comforting me like he should have been in the first place. \n\nTo my surprise, he then showed me his text messages between him and R that happened a few months ago. Apparently, way before my exclusion, R had a few conversations with my boyfriend, telling him how much of a pain it was to play with me there. He wanted my boyfriend to kick me out. However, my boyfriend refused and told R that was not happening. Then, around the time when I decided to stop hanging out around R, that's when R sent a group text to everyone in the group explaining how he doesn't want to play with the group again, and he hopes everyone understands. Everyone, and to my shock, even my best friend, all agreed with him. Only my boyfriend protested, but R was really stubborn and he had the whole group to support him, so my boyfriend gave up. After showing me those texts, he told me next that he kicked R from their group earlier today. R was not allowed to play with them anymore, but my boyfriend said he'd still be willing my play with R one on one, but only like once a month. Surprisingly, R agreed, and that was that. My boyfriend said he understood if I didn't want to be with him anymore, but said that he truly does love me.\n\nHonestly, even after all that has happened, I'm not mad at my boyfriend. This is both of ours first relationship, and we’re still learning. He's always been kind to me and I’ve never had a problem with him before this situation occurred.  I feel happy that he realized his mistakes and did apologize without me asking. This is the first time he's ever come across a situation where he has no choice but to choose a side, so I don't blame him for trying to do anything to keep the group together. He told me he would also like me to come back to our old group, but he said it's completely fine if I stay with my new group. He knows it was wrong of him to ask me not to join a new group. I told him I don't think I'll ever come back to the old group and that I will definitely be sticking with my new group from now on. However, I will always make time for him and put him first. He accepted it without any protest, and we went back to our usual fun activities. \n\nI feel bad that my boyfriend may have lost a close friend since I never asked him to do any of that for me. Regardless, I am happy, and lately my boyfriend and I have been spending more time together now that R isn't around as much. I have also continued playing with my new group and it's been awesome. If you've made it this far, thanks for reading this long update! Sorry for the ramble and mistakes, my mind is all over the place right now and I wanted to explain as much as I could. Thank you guys once again!\n\n  ---   \n  **tl;dr**: Boyfriend apologized for everything and kicked R out of his gaming group. I will continue to play with my new group and boyfriend is ok with it now. Things are better.",
        "permalink": "/r/relationships/comments/6py1en/update_i_19f_am_being_excluded_from_our_gaming/",
        "comments": [
            ">  I don't like R. All he ever does is degrade and talk about are women who are \"back-stabbing bitches who you can never trust\"\n\nIt's sad, but some people are just like tha--\n\n> R is actually married and his wife makes good bank, so he has a ton of free time\n\nWait what\n\nDoes she stab him in the back with *money*?",
            ">  I told him I don't think I'll ever come back to the old group and that I will definitely be sticking with my new group from now on. \n\nI think this is a good choice, OP. And, aside from your boyfriend's initial reaction, you both handled this pretty well. Good luck with your new group and with your boyfriend :)",
            "Glad it worked out. I'm confused by the \"R texted the group\" bit though. R wasn't going to play with the group, the group agreed, then your boyfriend kicked him out. \n\nWhat did I read wrong?",
            "OP, I hope you are reconsidering your relationship with your \"best friend,\" who had you kicked from the group.",
            "I think you handled this situation fairly well and I think both you and your boyfriend learned a lot from it.  Sticking with the new group is a fantastic idea, and they sound like a lovely bunch!  Though I think I big take-away from this is learning when to tell someone that something is happening or that whatever is happening is making *you* feel uncomfortable.  When I was your age, I rarely spoke up when I should have because I didn't want to cause conflict; but sometimes not saying anything makes the situation worse.\n\nMy own two cents on this, I don't think it's appropriate for your boyfriend to still be playing with someone who was so aggressive especially to you.  A whole other issue, but your boyfriend is responsible for himself and his choices.  If R does become an issue again in the future, let boyfriend know.  You got this :)",
            "I just wanted so say kudos to you for standing by your decision to stop talking to R. Even after to pressure from your BF. I've definitely been in your shoes and the pressure to apologize to types like R from the friend circle are insane. Sadly it seems all to common in nerider circles.\n\nI still think it's shitty that he''s willing to hang out with R. The dude has clearly talked a lot of shit about you in front of and behind your back. It sucks he doesn't see any problem with spending time with someone like that.",
            ">R was not allowed to play with them anymore, but my boyfriend said he'd still be willing my play with R one on one, but only like once a month. \n\nI raised my eyebrow a little bit at this. If your BF can continue to maintain boundaries with R, that's great. But I think he might also benefit from reading up on geek social fallacies (just Google \"geek social fallacies\" and you should get some good results).  Good luck to both of you.",
            "You know, your boyfriend did screw up, but he did seem to make amends and handle it well afterwards so that does say something about his character. Hopefully this can be a lesson on communication and boundaries for the future.\n\nI'm also glad you found a new group and that you fit well with them. It looks like everything worked out!",
            "I don't think it's appropriate for your BF to still hangout with R. R was wildly rude towards you and had the whole group turn on you, including your BF before he came to his senses. R is 25 years old and should know by now his behavior is awful. I wouldn't be surprised if R was still looking to cause trouble between you and your BF just out of weird revenge. ",
            "so your boyfriend is going to remain friends with, and keep playing with, the misogynist man who led a campaign of subterfuge against you and tried to get you kicked out of your friend group.\n\nwow.",
            "Ok so the ending is kinda happy but there is some stuff buried here that should be making you uneasy. Your boyfriend says that he was upset at you doing something on your own because he was worried you'd leave him. This is a huge flag to be aware of.",
            "Be careful: your boyfriend got his shit together out of fear of losing you, not necessarily actually having his shit together.\n\nBut he's going down the right path.\n\nYou two are together because you enjoy each other's company. You are not a prize to be won or awarded. You are a human being with the agency of choice and with interests and hobbies.\n\nBest of luck!",
            "Yay OP! It's good that your boyfriend apologized and fixed things of his own accord. Your last post had me thinking he was sketchy, but you guys are young and people our age are still learning how to handle these situations. \n\nI like playing with guys honestly, and our group is incredibly inappropriate and idiotic... but not misogynistic, if you can believe that lol. I hope you enjoy your new group! There are definitely guys out there who aren't cool with making their friends uncomfortable, regardless of gender. :D <3",
            "Wow, I didn't expect your boyfriend to step up! Maybe you have a keeper after all, OP. This shows how important communication is.",
            "Reading this it sounds like you were struggling to find the right group of people to play esports or MMOs with, yes? It doesn't read as online table top gaming. \n\nI really want to say good on you learning early to stand up to an environment that you don't enjoy. \n\nI'm really sorry about your friends, or \"friends\". I hope this new group helps you build some healthy friendships. \n\nNot every couple plays well together. Your boyfriend seems stressed about the idea of you playing without him, and you playing often seems important to you. Yet, not enough to make sure you got to play. \n\nHonestly, the fact that you got left out so often, but they sited not wanting to play with you, for personality or skill reasons is shitty. I've found that most anyone unless they're utterly toxic or pants on head stupid gets better with time. Even the pants on head stupid gets better with time and the rest of the people become real friends or people you wind up enjoying time around. (Unlike your boyfriend's friend.) Im not saying you can always force friendship, but in gaming communities, keeping you away did you no help. \n\nYou should have been told or included. Not held in middle ground until you decided to leave on your own. \n\nIf you're not returning to your boyfriend's group, don't be shocked when his friend returns in a few weeks. If this happens, maybe consider if your boyfriend really supports you. ",
            "So he faked a load of text messages knowing that you wouldn't rejoin, and now the crisis is averted just wait I guarantee Roderick will be back in a couple weeks and he (and your BF) will have got what they wanted from the outset.",
            "I'm surprised nobody picked up on this yet:\n\n>He said he didn't want me to go to a new group because he **feared that I would leave him too for some new guy**.\n\nThat's what was behind the whole change of heart? Not the whole \"my girlfriend left the group because one of my friends is a raging sexist asshole with no boundaries\" thing, but the \"oh no, my girlfriend might find someone else to fuck!\" thing?",
            "How did you find a gaming group? I don't know where to look",
            "[removed]",
            "Glad to see a positive update :) ",
            "[deleted]",
            "It sounds like a happy ending! You could always invite your bf to join your group once in a while so he could make new friends as well :)",
            "My friends don't get to insult my wife. What games are you guys playing, BTW? I've done D&D via a few gaming apps and that stuff is pretty fun, or is it like Overwatch or something?",
            "> Then he told me that he didn't realize how hurt I was from being excluded from the group because I had never complained or voiced against it\n\nLike... does he have the emotional range of a teaspoon or what? How could you NOT guess that being excluded might hurt someone's feelings? Did he really think you were totally okay with being kicked out of the group in favor of Slimeball McGee? \n\nI'm glad y'all resolved this, but he needs some empathy lessons or something. I'm so not impressed by him on that one.",
            "Your boyfriend sounds aggressively non-confrontational.  From the folks over at /r/JustNoMIL, make sure he can stand up to his mother before you consider marrying that one!",
            "Oh that's a good outcome. I think your BF handled it pretty well as soon as you communicated with him. That he didn't understand how upset your were before is a legitimate possibility - it's good that he does now and acted accordingly. I wish you both all the best. ",
            "I'm happy to see a good update, OP!",
            "Your update made me really happy!\n",
            "Sounds like you and bf are growing together. You'll learn as a couple as long as you both listen to each other. Glad things worked out for the better",
            "That's some high level WoW drama!",
            "I'm really glad this worked out for you. To me, friends I make online are no different than friends I make irl, and I don't think one should have to tolerate abuse, online or not.  \n\nIn hindsight, things could have worked out a bit better with some communication, but I'm not one to talk. I'm a coward. Either way though, based on the fact that the group agreed with R, even your best friend, I think you made the right decision to join a new group.",
            "Nat 20 on diplomacy OP",
            "Invite boyfriend to new group",
            ">I feel bad that my boyfriend may have lost a close friend since I never asked him to do any of that for me. \n\nLet's be clear, he lost R as a friend because of R's actions, not because of yours.",
            "[deleted]",
            "That's definitely not how I expected this to go but I'm glad this ended well. ",
            "Glad it worked out for you, but damn for a gaming group conflict, this is some game of thrones shit ain't it?",
            "How do you just find a group? I always struggle to trust new people! :(",
            "[removed]",
            "Good for the two of you for talking it out. And please, in future, if something like that is bothering you, let your boyfriend know. I really understand not wanting to put him in a bad situation or wanting to be a \"complainer,\" but holding it in just makes it worse. \n\nAnd for what it's worth, I suspect R isn't that great a friend. Friends don't try to scuttle another person's relationship. I know we're seeing R through your eyes, but I suspect in time your boyfriend will spend less time with R. ",
            "As you get older you have to cut away toxic people. Part of getting older. Also it's good he's communicating and you're doing a bit more. You should work on this more, you're a partnership, you both should communicate feelings especially how badly you were feeling before. You'll get more used to having to rock the boat some to let him know your feelings as he isn't a mind reader (Tbh us guys generally are terrible at picking up hints) and your relationship will be that much stronger for it!",
            "You guys both sound really mature and reasonable in this situation and I'm rooting for this relationship big time - one suggestion though; is it possible to invite your boyfriend to play in your new group with you sometimes? Not all the time as it's good to have your own set of friends but on the odd occasion he could come along and meet the new guys and play too? It may also help to extinguish any possible insecurities he may have! Obviously this is entirely up to you both, I just thought it could maybe be a nice idea!",
            "[deleted]",
            "Kudos! You handled the situation awesomely well. You know, on a side note, your childhood friend, the one who originally objected and was ready to quit the group with you - he is a keeper and an awesome person. That is the kind of friend you trust and rely on. Do make sure you continue making an effort to maintain close friendships like these.",
            "You may have a 'keeper' there. ",
            "[removed]"
        ]
    },
    {
        "post_id": "33aypy",
        "author": "Nowwhat8989",
        "title": "UPDATE: I (22M) just walked in on my girlfriend (21F) of 7 years having sex with my roommate (22M).",
        "url": "https://www.reddit.com/r/relationships/comments/33aypy/update_i_22m_just_walked_in_on_my_girlfriend_21f/",
        "score": 2556,
        "num_comments": 425,
        "created_utc": 1429579361.0,
        "selftext": "[Original](http://www.reddit.com/r/relationships/comments/32m5lj/i_22m_just_walked_in_on_my_girlfriend_21f_of_7/)\n\nFirst, I want to thank everybody for the help and many kind words that were sent my way. Seriously, thank you.\n\nI'll start with what happened afterwards, and work my way up to today, and that's the only reason that I'm making an update only a week later.\n\nEmily (my best friend's sister), texted both of them informing them informing that I'd be coming by to get stuff (Emily would be going to my ex-SO's). I went with my best friend (Trevor) and Emily to get some stuff from my apartment, my roommate wasn't there, but he left me a note saying that he's sorry, and attempting to explain the situation. I threw it away (after reading it), grabbed some stuff and loaded it into my car. I drove back to their house while the two of them then went to my ex's apartment to grab my stuff.\n\nMy ex was there and at first, she wouldn't let them in. She yelled at them to go away through the door, and after about 15 minutes of them sitting there, she eventually opened up and let them in to collect my things. They grabbed my PS4, movies, cookware, clothes and some random other things. She cried the whole time and asked them if they would tell me that \"she's sorry\", \"it was a one time thing\", \"I would do anything to change it.\" They didn't say a word, although she was crying into an older hoodie of mine, so they left that there. I'm not too torn up about that.\n\nI told a few select friends what happened, and asked if they would watch the doors to my classroom when I had classes as I didn't want to cause a scene. Nothing on Wednesday, but she stood outside one of my teaching classes on Thursday. I went in through a different door, and thankfully she didn't see me.\n\nFriday is the day that really upsets me. As I said in the last post (in a reply), I'm an Education Major and I have my practicums this semester. Our Education building has two floors, and the 1st floor is a laboratory school (an elementary school that has a lot of Education students come in and do their practicums, or observations), while the 2nd floor has classrooms for Education students.\n\nMy practicum is with 3rd graders, and she stood OUTSIDE the door to my 3rd grade classroom waiting for me (we have name tags, and only have to show those to the desk to get in). She used to be an education major, but switched majors, therefore it wasn't too uncommon for her to be in there. I saw her and my heart immediately sank. I decided to just walk by her and ignore her. She saw me and started crying and trying to talk to me. I didn't say a word, but just walked into the classroom. My cooperating teacher asked her to leave, but all my students that were there had already seen it. They started bombarding me with questions, but I just stuck with, \"It's nothing important right now. We can talk about it later, but we need to focus on our learning right now.\" But honestly, it killed me inside. I explained the situation to my cooperating teacher, and asked her to watch out for if she came back again. She said that she would and would ask her to leave if she saw her again.\n\nI received a few text messages this weekend from her (and her roommate - that was extremely annoying), I got an insane amount of phone calls, and I got a ton of Facebook messages. Trevor and Emily also received quite a few as well. I worked all weekend, and threw myself into lesson plans and projects due. I also went and played a round of golf with some friends.\n\nToday is really why I'm updating. I got a text from my ex at around 7.15p. She told me that she was pregnant and that it was mine. I screenshotted the conversation. I'm trying to stay calm, but if she truly is pregnant (and the baby is mine), then that throws a whole wrench into everything.\n\nCan anybody give me some advice on what to do next? I'm trying to remain as calm as I can, but this is really big and I'm starting to freak out.\n\nThank you all!\n\nHere's the text conversation:\n\n*Her: I'm sorry for what I did. I'm sorry that I messed up our future, but I think that we just got a second chance. I know that this isn't what you wanted to hear, but I'm pregnant. Maybe this is why I made my mistake.*\n\n*Me: You can't use a pregnancy to explain cheating, it doesn't work like that. I want a pregnancy test. Not one from the store, but to actually go to the doctor and have them do that. If it turns out that you are pregnant, then I want a paternity test.*\n\n*Her: Fine. I'll call the doctor tomorrow and set up an appointment. But if I am pregnant, can we have a second chance?*\n\n*Me: No. All I want to know from you is when and where the appointment is.*\n\nShe seems to calm for this to this to just be a joke. She's been bat-shit crazy for almost the past week, and now she's extremely calm. I'm honestly extremely scared.\n\n**tl;dr: Ex-SO waits outside my classroom for me and says that she's pregnant. What do I do next?**",
        "permalink": "/r/relationships/comments/33aypy/update_i_22m_just_walked_in_on_my_girlfriend_21f/",
        "comments": [
            "It's pretty simple. \n\nText her and ask when the doctors appointment to confirm is. Offer to meet her at the office and you can both be there for the doctor to give a test. I stress. You will meet her at the office. Not drive her not ride with her. \n\nDo not engage in any other conversation. \n\nMy best guess is she's not pregnant. \n\nIf she is pregnant then you'll go to the appt and can figure out things afterwards. ",
            "Text your ex-roommate and tell him your ex-girlfriend could be pregnant and he could be the father.",
            "[deleted]",
            "[removed]",
            "'I'm pregnant!'\n\nOldest trick in the book.",
            "Tell her you want to go to the doctors with her or pictures of the ultra sounds as proof that she is pregnant. If she is and decides to keep it, be the best father you can but don't let her suck you back in.\n\nIf she is pregnant that doesn't make you obligated to be in a relationship with her. Also get a DNA test before signing the birth certificate ",
            "Look at what you know. Make each piece of information a bit of data. Then plot all of that data onto a graph where the horizontal line is time elapsed and the vertical line is extremeness level of her behavior, where the two lines meet is the moment you walked in on her and your roommate having sex (in what was most DEFINITELY not their first time). \n\nI am sure if you did this you would notice that overall she has been escalating her behavior: initially she locked your friends out for 15 minutes then lets them in, then she stands outside your class building, then she stands outside your classroom, etc. All the while you stay firm and consistent and do not acknowledge her or give her the relief that she wants (and just getting to talk to you for a second will relieve some pressure from her no doubt about it). Finally she tells you something that she knows you are going to have to respond too...\n\n**Do not trust her!**\n\nTell Trevor and Emily the new development and let them be your liaison. There are plenty of ways she can verify the pregnancy in an objective way that will likely put the proof to her lie when she refuses (say wont piss on the stick in front of Emily for example or wont get a blood test). If on the off chance she is telling the truth, then your next move should be to get a Prenatal DNA test performed to determine the paternity of the child. You honestly cannot say with any confidence the child is yours -- you were not the only one who was sleeping with her at the time of conception. And as I said above, it is very unlikely that you just so happened to walk in the one time that happened. \n\nShe is trying to manipulate you because she is in free-fall and you are not moving to catch her. She is trying to become the victim, first by elaborate displays of remorse and finally by likely inventing some story to try to get you to give in to her.\n\nKeep your wits about you like you have this whole time. Do not be reactionary about this news. I would suggest continuing to maintain no contact until the paternity test is performed (probably will never get that far as I said).\n\nAgain, I am sorry for your situation. Just keep putting one foot ahead of the other.",
            "Ask for pregnancy test to be done at a doctors office, don't trust any piss test, she might be just altering the results in a bid to hook you back in. If the doctor administered test comes out negative then you're in the clear and tell her to fuck off. If it comes out positive then consult with the doctor pertaining to when DNa testing for an unborn fetus can be done safely, while you wait for the dna testing, do not support or even remotely do anything that could be seen as you being a father figure, do not sign anything, and please consult a lawyer. After DNA testing is done, if the baby isn't yours then tell her to fuck off, if it's yours then continue consulting your lawyer to arrange for your child rights and to protect your finances and assets.",
            ">Her: Fine. I'll call the doctor tomorrow and set up an appointment. But if I am pregnant, can we have a second chance?\nMe: No. All I want to know from you is when and where the appointment is.\n\nI'm betting this will get her to drop the fake pregnancy, if you keep reaffirming a pregnancy will not bring you back.",
            "I'm curious what was in the note your former roommate left. Seriously, what excuse did he use?",
            "Ugh that's such bullshit.\n\nYou should respond with the coldest text you can.  I want proof, if it's mine I will raise it. But you will never be a part of my life other than an egg donor. \n\nI still think you are a better man than me.",
            "Does she have any proof? It sounds like she's doing whatever she can to get you to respond at this point. And yes, you'll have to, but only interact to get proof from her that she's pregnant. You'll have to figure things out from there depending on what happens with that. Make sure you get a paternity test too if she actually is. ",
            "Call me petty but I almost wish that she is pregnant and its the asshole roommates. ",
            ">If I'm pregnant could we have a second chance?  \n  \nIf?  \n  \nMeaning she does not know she is pregnant. So she is obviously lying.",
            "[deleted]",
            "Wait. What on earth could your room\nMate put on the letter to explain how he ducked you girl? ",
            "I'm a 43 year old old bag and you are handling this beautifully. \n\nWell done. And she IS NOT pregnant. ",
            "She wanted to know what you would do IFshe was pregnant. Reread her text messages. I believe she's trying to manipulate you with a very sick ruse. Be wary.",
            "My bullshit detector is going haywire. Buy two pregnancy tests. Have her take then in front of you. Then figure it out. ",
            "I went through something similar a while ago (university student, GF cheating, pregnancy claim). Left me a wreck for a long, long time.\n\nYou know what I'm seeing different than what I did? I'm seeing you mention friends, family. Good for you. Friends and family can make all the difference. Keep with your friends. Don't let it eat you.\n\nWhen in doubt, see a counselor or therapist. Take care of yourself. \n",
            "I would recommend that you bring Trevor and/or Emily with you to this meeting as a buffer. More than likely she's using this as a way to get you to show up and talk to her, and if it appears that she's just trying to convince you to get back together with her, have Trevor/Emily stay and leave the premises. \n\nI assume you trust them to make sure the doctor gives her a test and confirms her pregnancy. The odds of her being pregnant are SERIOUSLY SERIOUSLY low. I just would worry that this is her setting up an \"ambush\" for you to try and corner you into listening to her bullshit justifications for being a fucking terrible person.\n\nETA: Also, the fact that she is SUPER CALM should be evidence that this is a lie, not that this is real. If this was real, she would be equally emotional about it - I mean, put yourself in her shoes if you can. There's NO WAY that she'd be handling this calmly if it was true. Probably she just sat down and thought, \"how can I emotionally blackmail him into talking to me? What's the one thing he can't say no to?\" and then came up with this ploy.",
            "My money is on a \"miscarriage\" before she can go to the doctors appointment. This is an old trick, I don't believe she is pregnant at all.",
            ">  \"it was a one time thing\"\n\nWow... On the one day you happened to come home early, what are the odds! \n\n/s\n\nAs for advice, on the slim chance she isn't making this up (I know you seem to think otherwise but given everything else she's done since it doesn't seem that much of a stretch imo) I'd say you need to make it as abundantly clear as possible that a baby will never be grounds for reconciliation. Under the circumstances, unless she's particularly pro-life, it seems highly unlikely she'd want to be a single mother, and obviously it wouldn't be fair to the child to just be leverage to make up for her fuck ups.\n\nedit: format.",
            "She said she's pregnant, and then in the next message \"IF I am pregnant\"?  She's not pregnant.  \n\nAnd it wasn't a mistake.  A mistake is, like, losing track of time and not calling to say you'll be late.  Fucking someone else is being a shitty human being.",
            "Damn if she really is pregnant and its yours what are you going to do? I think youre handling this situation like a champ btw, not too many people can do the no contact and I applaud you. \n\nHopefully she's not just saying she's pregnant to get you to talk to her which is totally plausible since she's desperate. If its true it might not even be yours since she's cheated, w/e the case is I wish you best of luck! ",
            "DON'T go with her. STOP talking to her.\n\nHave a trusted friend go with her to the test instead of you.\n\nShe is using this as a ploy to get facetime with you. Don't fall for it.\n\nStay zero communication, and let someone else accompany her.\n\nYou can go later (separately) for paternity testing IF it comes back positive.\n\nI bet she'll flip her shit when she realizes this doesn't work.\n\nThe last thing she deserves right now is your support and company.",
            "The best piece of advice in this thread is NOT go with her to that appointment and to send one of your other best friends instead. You want to know why she was calm? Because you broke the no contact and are actually talking to her! You need to stop responding to her and let your friends take over again. Ask them to text her and set-up a  time for them to go get her tested.",
            "I would start by getting confirmation that she is pregnant. Start small and request a text photograph of a pregnancy test (others are saying it will take awhile, but I would still request this now). If she produces a photograph of what appears to be a test showing she is pregnant, I would ask her to meet you to take another test, and bring a female friend. Explain to your ex that you will not discuss anything and that you are simply there to observe the results. Tell her you will bring the test so you know it has not been tampered with. Do not break, do not discuss anything else.\n\nIf the test is positive, request a paternity test in writing. If it turns out she is pregnant with your child, it will be very rough, but you will need to discuss these things with her. Doubtful she is pregnant. Good luck. ",
            "You may also be able to shake her loose by telling her being pregnant has no affect on your relationship. If the kid is yours, you will be a father to it, but you will never get back together with her. Might save you some trouble. ",
            "D: sorry if i'm a bit nosey but what exactly did that note say ? and what was his \"explanation\"",
            "Get a paternity test.",
            "Yeah cause we've never heard stories of woman using the \"I'm pregnant\" statement to try and get her man back. The timing of this is awefully suspect. Next will come the other half of the story where she's lost the baby due to the stress of the breakup. Meanwhile you will have never seen proof of the pregnancy in the first place",
            "See, I'm going to buck the trend here and say DON'T get a paternity test. Don't cooperate with her at all. She cheated. She is a piece of shit. Let her deal with the consequences. That includes court ordered paternity tests and all that jazz if it comes to it. Fuck this noise. It's not your problem, it is hers. Don't even think about going to the doctor's office! Don't get sucked back in in any fashion! It's your roommate's problem now. Move on.",
            "I'm going to go a bit further than some here.  Get a lawyer.  If she IS preggo, you are going to need it.  \n\nPut all communications with her thru them.  Never talk to her in any capacity without another person there.  Record any and all conversations with her, and only meet her face to face in public locations with a witness present.\n\nJust putting it out there.",
            "probably not as important as some others' advice, but have you been go-karting? i went for the first time last sunday and it was amazing. need a distraction? go-karting. super fun.\n[edit]i mention this cause you mentioned throwing yourself into lesson plans, and also playing golf.[/edit]",
            "If she's stressed about the break up, I imagine she'd be too distracted to notice her period a couple days late. Or at the very least, she would know high stress throws off a period, and she'd wait a couple days before rushing to take a test. And if the period has already been late a few weeks, it's even more fucked up that her thought process is, \"Damn, I could be/am pregnant. I guess I'll just bang my bf's roommate on a couch for the first time.\"",
            "> She seems to calm for this to this to just be a joke. She's been bat-shit crazy for almost the past week, and now she's extremely calm. \n\n\nHer most telling point is how rehearsed she sounds and the big \"But if I'm pregnant, can we have a second chance?\" Yeah, she's calm because she practiced this and knows you can't ignore this, she's basically found the one guaranteed way of talking to you. If she's really crazy, she's been trying to get pregnant this whole time because you can't take a paternity test for a couple of months and thats a few months she has to 'win you back' via forced interaction. If she is pregnant, don't believe for a second that its yours, and don't interact with her at all until you can get a paternity test.\n\nIf she's only semi crazy she's probably looking up ways to fake an in-office pregnancy test. ",
            "I hate to sound like a broken record but your next move is pretty much what everyone else is saying it should be. \n\nAs others have said, I'm almost positive that she is not pregnant and she is just throwing this out there as an excuse to get you to talk to her. But in the meantime, meet her at the doctor's office. Don't talk about anything other than the pregnancy. No apologies, no reminiscing, no arguing. Engaging in any of those conversations is a very easy way to get manipulated back into the relationship.\n\nIf she is pregnant don't do anything until you know if the baby is yours. It may seem cruel, but you can't act like a father or sign your name on any documents that would imply you've assumed responsibility for the child. In some states simply signing the birth certificate makes you responsible for the child and thus, responsible for paying child support (if it ever comes to that) regardless of paternity. So it is very important that you keep your distance from her until you know the results of the paternity test. But, I seriously doubt it will get that far. \n\nI actually knew a girl who used the \"I'm pregnant\" excuse to get her ex (a good friend of mine) to stay. When he started pressing her for proof of the pregnancy she claimed she miscarried. He felt so guilty he stayed with her longer than he should have. So beware of this kind of manipulation as well. That is why it is so important for you to first and foremost find out if she is pregnant at all. This woman is obviously very manipulative and I wouldn't put it past her to claim she had a miscarriage when backed into a corner. \n\nGood luck. ",
            "The old pregnancy trick.... The fact that she specifically said \"if\" has me thinking its a ploy to \"win\" you back.  What I would do is drop all communication no doctor office visit.  Just say OK if you are pregnant when the baby is born I will seek a paternity test.  Drop it NC nothing.",
            "WHAT A FUCKING CUNT. \"We just got a second chance.\"\n\nFuck no. ",
            "Most conveniently timed pregnancy ever. Smells like a last ditch attempt to hold on to you. Once it's clear that she isn't pregnant I wouldn't speak to this girl again. There is no being friends after this. ",
            "Am I the only person wondering why you don't have her blocked on your phone and on facebook?  Why in God's name do you not have all of them blocked?\n\nWhy did you choose to engage her in conversation? ",
            "Does she know any pregnant people? If someone is messed up enough they could pee in a cup for her. The only way I could think of to solve this is to be in there when she gives a sample or ask a nurse to do it. Tell them it's for paternity reasons. I don't know how far she'd go to fake the pregnancy but I'd be paranoid after watching Gone Girl. Crazy people get ideas... ",
            "There was another story last week, with the chick using the pregnant story to get her ex over. When he did, she needed help with her math homework. smh",
            ">She told me that she was pregnant and that it was mine.\n\nAsk to join her for a doctor's appointment to get confirmation of this being true. If she is pregnant (I'm guessing she isn't), then demand a DNA test to prove paternity.\n\nIf it also ends up being yours, explain to her in very careful detail that a child isn't going to bring the two of you together again.\n\n>I know that this isn't what you wanted to hear, but I'm pregnant. Maybe this is why I made my mistake.\n\nI don't remember anything from medical school indicating that pregnancy made people cheat with their partner's roommates.",
            "Similar thing happened to my friend, caught his SO cheating, broke up with her, BAM! Hit him with an I'm pregnant, he came running back to do the right thing, and what do you know, turns out it was a false alarm. It's a hail Mary of a desperate fuck-up friend, don't fall for it. ",
            "My ex did this to me when she cheated on me.  Funnily enough when I asked fire proof she said she had a miscarriage.  Some women seem to use it as a weapon/excuse - all I think is thats a cruel game to play as shit like that ain't funny.",
            "First a pregnancy test to see if she really is pregnant. Then demand a paternity test with samples collected by a non bias third party at the first opportunity.  Then go from there.",
            "She's pulling the pregnant card to try to stay with you. I've experienced this twice. Neither of which were true.",
            "Omg this is insane! Please update us again!",
            "Let's say she is pregnant, could she truly get child support if she kept the baby? Seems kinda fucked up to hold a life ransom like that if she is but I know people have done that. Couldn't he get full custody by proving infidelity or at least not pay out? Hopefully everyone banking on it being a lie is true. Given by the language I'm guessing the same. ",
            "Have you learned anything more yet?",
            "If she is pregnant and the paternity test show it's yours, then offer her a second chance only if she aborts. Then go no contact after she aborts. Harsh? Yeah, probably. Unless you're pro life, which is cool too. Then you just have to figure that out. ",
            "Just thinking about your story makes me upset. How oh how can people be so ignorant?\n\n> But if I am pregnant, can we have a second chance?\n\nThat just screams fake, man. She's probably calm because she thinks she can still salvage it. \n\n> I'm pregnant. Maybe this is why I made my mistake.\n\nBruuuuuh. \nShe cheated because she got pregnant?\nWhy is she so bad at talking? Oy vey. ",
            "Don't believe a word she says until you see a baby nine months from now. If you do see one, get a paternity test before you do or agree to anything else.",
            "Tell her you'll happily share 50/50 custody between her and you and your future wife. ",
            "Yeah had girls do the pregnancy thing before, it's never been genuine. She'll likely try and use the possibility of an in and to get you to think of having to stay with her and then she'll tell you it's not but hopefully she's got you thinking about having to stay with her anyway so she can say things like \"it would have been nice wouldn't it, why don't we try for real?\" \n\nI wouldn't sweat it but as I recall it's difficult not to.",
            "Hang in there OP. My thoughts are that this pregnancy thing is a last ditch effort to keep you 2 together. If she is really pregnant then I pray it isn't yours.\n\nI say go with no contact at all even at the appointment. No \"hi, how are you?\". Nothing outside of talking to the doctor/nurse",
            "Damn, she took your hoodie fam.",
            "Watch her piss on a pregnancy test. Like...literally watch her. If it's positive spring for the amniotic genetic paternity test.\n\nI'm guessing it won't go that far tho. ",
            "I hate this girl and I don't even know her. ",
            "\"Can we have a second chance?\"\n\n...\"no\"\n\n\n\nOhhhhhhhh!!! SMACKDOWN ",
            "She's calm because she believes this is how she will get you back. She's definitely lying. It's too coincidental.",
            "I really think you should get a no contact protection order since she is so extremely unstable, and is not respecting your wishes to have no contact. Good luck, you're doing great. ",
            "She's lying bro this happened to a friend of mine and she faked it\nIt's just another excuse to stay with you",
            "My heart sank so hard reading all of this. I'm so sorry for you friend. That's all I can say.",
            "I may be a little late to this thread, but my ex girlfriend pulled off a similar thing. She told me that she was pregnant while we were still dating. It wasn't until later that I found out she was cheating and was going to use fake pregnancy to keep me around.\n\nYour ex is only using this to get a chance to talk to you and/or trying to manipulate you as much as she can while she still has a shot. Do not believe her for a second. Good job on taking this to a doctor, but don't let her claw her way back into your life. She lost that privilege when she decided ruin your relationship.",
            "Regarding her calm that has you worried - she's calm because she's successfully used the pregnancy claim to get you to talk to her. She thinks she's going to talk you into a second chance. Her calm has nothing to do with whether the pregnancy is real or not. ",
            "Any more updates?",
            "So how did this end up being?",
            "She's trying to manipulate you. As a girl, trust me. She totally is. There's no way she's really pregnant. Her texts to you are so twisty. Follow the top poster's advice (meet her at the appointment, stick to your plan of paternity test). I'm so sorry you're dealing with this but your life will be better getting a toxic person out of it.",
            "Even if it's true, you can't stay with her. You guys will figure out how to coparent separately. ",
            "This will be the meanest but best advice in the thread.\n\nWhat I would do if shes in fact pregnant as proven by a doctor. Act nice for a week or two, tell her these words:\n\n\"I want a family with you, but not right now. We need an abortion so we can finish school and get married before we start a family.\"\n\nThen take her to get the abortion, go in with her. Once its complete, leave her at the clinic to take a fucking bus. \n\n",
            "She may be lying about the pregnancy just to get you talking. Tread carefully",
            "I would tell her there is no ducking way she is getting a second chance. She can now be a single mother\n\npregnancy hormones do not make you fuck someone. Being a selfish bitch does.",
            "Tell her good luck with that. You know what the time frame is and you want a supervised paternity test and will sue for full custody because she is proven to be untrustworthy and doesn't need to have a child dependent upon her for anything. (((Hugs)))\n\nIt's probably a lie, but get that paternity test just in case. ",
            "Yeah, like everyone else here, I really doubt she is pregnant.  If she is, you will definately need a paternity test. If by some fluke she is pregnant and it's yours, offer to pay for half of the abortion.  Do not offer to get back together.",
            "Every break up I've ever been through, I thought about telling the guy I was pregnant just to keep him around. I was never crazy enough to do it, but the thought was there. You definitely need that proof. Hopefully she isn't, and you can just stay away. If she is, be the best dad you can be, but you just have to be civil with her to coparent. \n\nHonestly though she sounds crazy enough and like she has nothing else to use, so she might as well try this with you to see if you come back. Fingers crossed for you though! ",
            "Don't respond, it's most likely just a play for attention to get you talking to her and not a real pregnancy. If it's not real she'll pretend to have a miscarriage after a little while. If it is real, make her prove it's your child before taking any action.",
            "Whatever goes down, you are handling this like and absolute champ op. Seriously, good thing you want to be a teacher, because your actions are textbook perfect. I mean I hope she does go completely crazy on you and stuff,but as far as you go, well done so far. I have no doubt that in time this will all be completely behind you ",
            "Well, OP, I'm thinking that the calm you're getting from her is because the whole pregnancy deal didn't work as she had hoped. You pretty much called her bluff. This is all about getting a second chance with you. But you are having none of it, and rightfully so. You are doing the right thing, OP. I wouldn't be too worried at this point, at least not until she sees a doctor and gets positive proof that she's pregnant and then she gets positive proof that it's yours. Until then, it's just all talk to try and get you back.",
            "Just buy a pregnancy test. Take it with you. Meet with her. Make her take the test right in front of you. If it comes out negative, nope the hell out of there and never talk to her again. Tell her that.",
            "I'm not a doctor, but doctors have to keep this information confidential with their patients. So even if you go to the office with her and have her take the test, she could tell you anything and the doctor couldn't confirm or deny it. Not sure if she could take the test the doc gives her and show you though.\n\nWhat people usually suggest on here is that you buy a couple store-bought ones and have her use them in front of you. ",
            "Oh my god this is the most heart wrenching story I have ever read. You are an extremely strong person. As to the pregnancy it seems extremely fishy. I wish you the best of luck OP.",
            "It's bullshit.  Don't worry about it.  Years ago I had an ex pull the pregnancy card so I told her to meet me at my place after work and take another test in front of me.  When it was negative I kicked her ass out and called her mother to let her know what a fine, upstanding person her daughter was turning into.",
            "Idk bro but good luck fighting thru this. ",
            "That pregnancy test needs to happen NOW. Don't wait any amount of time. Also, I would bring Trevor and/or Emily with you to the doctor's appointment. That way you can keep the direct communication between you and your ex to a minimum. \n\nAlso, the way you've handled everything so far has been spot on. I've read some of your replies in the thread and it sounds like you know what to do even if it's true. Nothing requires you to renew your relationship with her.",
            "Ya, I'm gonna go ahead and agree with most of the other replies here and say she's probably not telling the truth. And if she IS pregnant, how can she already know definitively who the father is?",
            "Hey OP, if you think that she's likely to show up at your classroom again then make sure to let administration know - that's administration for the laboratory school *and* for the education school (if they're separate). She's stalking you and that's not a safe person to have around children so please make sure that everyone is informed who needs to look out for the safety of the children. It's great that your cooperating teacher is on your side and I think you handled the children's questions in exactly the right way under such difficult circumstances.",
            "The last ditch pregnancy scare lol. This is routine psycho ex stuff you have nothing to worry about. When the DR appt nears something will \"happen\" and she'll drop the act. ",
            "> \"it was a one time thing\"\n\nHAH! Sure...\n\nShe's probably been sleeping with him for a while. If she's selfish enough to do that, EVERYTHING that she is doing right now is damage control.\n\nMy best guess is that she wants to get you back, and then dump you, thereby changing the actual narrative of the breakup.",
            "This hits pretty close to home. Stay strong and don't give in to her bullshit, man. My heart goes out to you.",
            "She's not pregnant OP, good job calling her bluff.  Please update after test.  ",
            "That bitch ain't pregnant. ",
            "Oh dayum.\n\nBest bet, meet her AT the appointment, and try to not engage with her if she tries to talk to you in the waiting room (which is likely to happen if you're doctor is anything like mine, and is always late.)\n\nIf she isn't pregnant and this is a whole big lie, then you continue being awesome and disengaging from her.\n\nIf she is pregnant, it still may not be yours. Classic cheaters line \"It was just a one time thing\" is rarely the truth, so get ready for that paternity test and just continue to not communicate with her unless you have too.\n\nDON'T feel obligated to return to being her boyfriend if the baby is yours. DON'T feel like you have been backed into a corner and have to be a part of her life again. This is a crazy situation, but it sounds like you have a lot of support.\n",
            "holy shit I didn't see that coming. Paternity test is a smart choice. ",
            "It's painfully obvious she isn't pregnant. Go to the doctors office with her. (Meet her there) Insist to be in the room (she has the power to not allow it, but try anyway). If you don't actually hear the doctor say she is pregnant, have her pee on a stick in front of you, or with you outside the door so there is NO chance for trickery. Dollar store pregnancy tests are just as reliable as the expensive ones. \n\nIf she is pregnant (she isn't, I pretty much promise you) paternity can be established before she gives birth. I'm fuzzy on the details. Or you can just wait until after she gives birth.",
            "Follow suit with how you are going whether she is really pregnant or not. If she is pregnant like everyone else is saying paternity test it. If it is yours don't fret it will take some getting used to but you can raise a kid n not be with their mom trust me I've had my son full time for two years now and I'm mot with his mom. He's an amazing little man that I would give my life to make sure he was ok. If she's either a not pregnant or not pregnant with your kid kick that cheating ass hoe out of your life forever. Don't look back.  But remember being a dad is amazing trust me you can do this. Also if it is yours and she tries to tell you that you can never see the kid unless your with her fight it! She can't make that decision you sound like a great guy with a good head on his shoulders and a good career in the works! Stay string man for real you've got support from so many people it's crazy!!!",
            "I went through something similar with an ex.  She told me that she was pregnant when I tried to break up with her.  I offered to take here to a doctor, but she said she wasn't ready for that yet.  Next, I told her I was going to speak to her father and tell him what was going on and that I would marry her.  I never heard from her again.",
            "She might just be saying that she is pregnant to get you back. \n\nA friend of mine dated this girl for one month, after which they remained friends and had sex. When the guy told her that he was done, she went full out desperate. She send him two pictures of positive pregnancy tests that she had pulled FROM the Internet and told him the baby was his. \n\nI'm really sorry you're having to deal with this. Go with her to the doctor to confirm the pregnancy and get a paternity test when you can. \n\nGood luck!",
            "Make sure it's a doctor you trust.",
            "What are the chances she'll go out or went out and to try to get pregnant just so there is a pregnancy to show you. ",
            "Every time a baby is mentioned in the story the nut jobs show up in the comment section. She is not pregnant if she is demand paternity testing. If it's yours be a good dad but never get back together. Just because you cry and grovel doesn't mean you won't do it again.",
            "I've had the game pregnancy happen to me, it's a final grasp trying to keep you around. Make absolutely sure she is not pregnant, then never speak to this insane bitch again. ",
            ">Today is really why I'm updating. I got a text from my ex at around 7.15p. She told me that she was pregnant and that it was mine. \n\nTell her well, shes on her own.\n\nShes likely lying about the baby - either way you don't need her in your life so make sure you paternity test it.",
            "Oh my god dude I am so sorry to hear all of this. I really hope everything works out for you whether or not she's preggo. And just remember you deserve someone who's faithful to you. ",
            "Good luck dude...",
            "Take it one step at a time, do one thing today update and we'll help you along mate. This is what Internet strangers do for eachother ",
            "She is definitely lying. And frankly, if I were you... I would decide which doc to set up the appointment with and totally not believe that her doctor thing isn't set up.  ",
            "Good show, in handling the situation as you have and in screencapping the text. I expect it'll be very useful in the future. For now, I wouldn't concern yourself with her claim; there is nothing to show for it despite the words of a desperate, distraught girl.",
            "Just to lighten the mood, I would post the popcorn .gif, but I genuinely want you not to be the daddy.",
            "Do nothing. I had this exact thing happen to me with a cheating ex. If she's pregnant its by the other guy. Don't do anything. If she's pregnant you'll hear about it in 9 months. Trust me this is the last gasp of a desperate woman. There is no baby.\nIf you saw her she'd beg you to fuck her in hopes she actually gets pregnant. Big scam stay strong and have no fear. There is no spoon.",
            "Your response to her is pretty good but she is clearly trying to leverage this into a second chance...which makes it very suspicious. Stick to your guns. Tell her a paternity test is only going to get her child support, not another chance. Try to put it out of your mind as you can't control this. Just because you have a baby with someone doesn't mean you have to date them...",
            "This is a tad late, but I wouldn't go to the doctor with her.  I'd have Emily text her and tell her that once she provides a paternity test proving that you are the father you don't care if she is pregnant or not.\n\nI wouldn't participate in LaMaz classes or anything either.  For a lot of people watching the kid enter the world is a big thing, but I wouldn't want to share that moment with her.  I would hang out in the waiting room and see the kid alone.\n\nI would then file for joint custody and be the best father I could be.  I would structure visitation in such a way that I never had to see your ex.  Like pick the kid up at her parents or something.  \n\nIt is likely impossible, but I would figure a way to provide child support without giving her money.  Buy baby food, diapers, yada yada yada but NO CASH.\n\nI wish you nothing but the best.  Oh--marry Emily if possible.",
            "Girls are crazy ",
            "The most important thing is to not let this woman use this to get you back. If you get back together and get married she will cheat on you and she will leave you and force you to pay for her to sleep with other men while teaching your kid to hate you.\n\nIf she really is pregnant, and if the baby is even yours, there are two ways to handle this and depends on what you want to do in regards to the child.\n\n1. You get a lawyer and make sure she does not get child support. Treat this as if you were together and already had the child together and then found her cheating. Maybe even get custody.\n\n2. Tell her you want nothing to do with her or the child and both sign something saying she can not come after you for child support.",
            "You don't have to talk to her about anything until she shows you her first 10 week ultrasound.\n\nMy boyfriends ex tried the \"pregnancy\" stunt when he left her. She wasn't even pregnant but showed him an ultrasound. She faked it for 9 months and even told him to go see her and \"their\" newborn in hospital. Some people can be so pathetic and desperate.\n\nIf she does show you a scan make sure it has her name, the date and time. If it doesn't have those 3 things, its not real!!\n\nAnd definitely get a paternity test.",
            "We need another update! ",
            "Wow. She crazy. She REALLLLLY crazy",
            "[removed]",
            "Have either of them given any indication they have seen these threads on reddit?",
            "I know it was already said, but since you are under a tremendous amount of pressure I think adding more will help ease your mind. There is a better chance that the Rapture is predicted by some nutty pastor than your ex being pregnant. I have a friend who, for some reason, is attracted to unbalanced women...and Every. SINGLE. ONE. have pulled this shit when he dumped them. I remember the first time it happened, he didn't believe it and I was on the sidelines thinking \"Oh shit\". But he was right, and by now I truly realize what someone chemically imbalanced is willing to say to try and keep/talk to their ex. So chin up, she's not going to be pregnant. Honestly, I wouldn't even go to the office with her. Just make her go and give you full info rights(HIPAA waiver) then call the office and ask what the results were. You don't need to let this ploy give her any positive reinforcement. Keep strong sir, 7 years is a long ass time to be doing as well as you are, I respect that. ",
            "Wait and see. Hopefully it isn't yours. If it is, you need to talk about an abortion or raising a child with parents who are not friends with each other. Both are not ideal, but such is life.",
            "Oh shit. Well, don't get back with her.  You can still be in the baby's life without being a partner to her.  Get a DNA test, she's a ho, so you don't know for sure that it's yours.  Also get some beer, a nice IPA or something and try to feel good. She put you through some shit, you deserve a break.",
            "\"I'm sorry for what I did. I'm sorry that I messed up our future, but I think that we just got a second chance. I know that this isn't what you wanted to hear, but I'm pregnant. Maybe this is why I made my mistake.\"\n\nHahahaha, oh wow.\n\nAs others have said, she's likely lying through her teeth in a pathetic attempt to make you reengage. I've no advice really: here, as elsewhere, you're handling yourself with a great degree of poise, grace, and restraint. Just keep on doing what you're doing.\n\nAlso, on a related note, I believe she mentioned 3 of my 5 bingo lines from the other day. She should win some kind of cookie. Preferably one flavored with bad decisions and crippling regret.",
            "How is anyone sure that if this person who is desperate to talk to you isn't making this up that it is your baby and not your ex-roommate's?",
            "I'm sorry to hear about all this. The advice I've read so far sound pretty good. Don't drive with her. Meet her there, stay away from her as possible, don't let her trap you in a room by yourself, lock yourself in the bathroom if you have to and wait to hear the results. \n\nKeep your head up. I know you'll come out of this a better person. ",
            "That bitch is crazy. You didn't necessarily dodge the bullet, but it's at least only just grazed you at this stage. Grazed by the craze.",
            "1. Mutual confirmation of pregnancy\n2. Mutual confirmation of paternity\n3. If she is pregnant, and the baby is your's, make the right choice for the baby but don't take her lying, cheating ass back, all communication revolves around child and nothing else. \n4. If she is not pregnant (or is, and the baby isn't your's) throw a fucking party and never ever ever EVER speak to her again... ",
            "Don't have any contact with her. Don't even ask for a pregnancy test. Just don't acknowledge her. Paternity only matters for child support, and it's on her to chase you for that if she really is pregnant and it really is yours. Remember that you have to sign the birth certificate to be considered the father, otherwise she will have to chase you through court. But I think we're all betting good money that this is a whole bunch of her bullshit.",
            "I read both of your posts and of course I am so sorry you are going through this. You sound like a good person and I never understand why people do this sort of thing.\n\nI am 33 and have seen some shit. I would bet money your ex is not pregnant. Lots of girls in her situation either say that or that they will kill themselves to get attention or throw you off course.\n\nAsk for proof - if she proves she is pregnant next steps are up to you. Just know, if you do have a child with her you don't have to be with her. But I don't think that she's preggo. \n\nJust keep up what you are doing and stay focused. Obviously take that ring back. ",
            "The sudden pregnancy seems like a huge red flag. ",
            "Thats some scum of a girl you chose to love man!\n\nAsk for an abortion, if she has even basic human intelligence she'll have it \n\nOr let her enjoy the beautiful life of a single mother at 21.",
            "Jeremy Kyle could sort this out in seconds bro, as he always says, \"did she love you while she was riding the room mate ?\"",
            "The kid was just conceived, and is already being blamed for it's mother's mistakes? She shouldn't have kids.",
            "I had an ex tell me she was pregnant, even though she wasn't,  after we broke up. She even showed me ultrasounds with her last name on them, but it turns out her sister was pregnant and she was using her stuff to trick me, it went on for about 3 months a ruined my summer.\n\nSo my advice would be to really make sure you get solid evidence that she is pregnant. Hang in there man, either was its not the end of the world and you can get through this.",
            "I'm guessing she isn't pregnant and just doing this for attention. So I agree with the top poster.\n\nI'd like to add that you should talk to her at some point. I just am not a huge fan of loose ends. I think confronting her and you both coming to terms with the situation isn't the most healthy thing to do. You don't need to do it now or really anytime soon but you should tie  up things with her.\n\nI also suggest seeing a therapist. Maybe you don't need one but you should talk to someone to just go through things with you. While reddit is great I wouldn't use this place as support. Also friends are awesome but it's nice to talk to someone who is not involved with either of you.",
            "1.99% chance she's lying about being pregnant.\n2.tell her your willing to go with her and help pay for an abortion.\n3. If she refuses #2 its probably fake but tell her you won't sign a birth certificate without a paternity test, and if she won't abort it doesn't mean you'll get back with her.",
            "Did you have unprotected sex with her? Did you cum inside her?",
            "Don't be deliberately cruel to her.  You might regret it someday.  I don't know the details of your beliefs or relationships or anyone's explanations, but I will take it as a given that you have strong personal reasons for ending contact with her;  that this isn't just a punitive or otherwise ill-advised gesture on your part.  Explain that you're sorry that she's worried she might be pregnant, and that it comes at a bad time, but that you can make no guarantees to her about the future, you have lost faith in her, and that pregnancy cannot and will not regain that trust.  Make sure to communicate that you have heard the explanations, that they are not adequate, and that the relationship cannot and will not return to what it was.  Make sure she understands that you are deliberately avoiding and want no contact from her, and that you need to be left alone indefinitely.",
            "There is something called a condom... The only time you should not use one is when you are sure that the girl won't do such things and put OP in that situation.",
            "It all depends on what you want to do. If you want this child, do you want to get back with your ex? It seems unfair to raise a child since birth between two parents. Separated parents can be tough on the child. Mine separated at age 9 and both of them were mature enough to give me a normal childhood. I don't know what your ex would be like in that situation. You do. If you think this would be a not so appropriate environment for a child to grow up in. So the way I see it if she is pregnant and you don't want her back, then you shouldn't get involved, as harsh as that is. You should also tell her parents so they know what is happening in case it does do crazy (like it hasn't already).",
            "Dude, I know this might not be what you want to hear but if she actually is pregnant,  you need to try and make it work with her if it's yours.   I'll probably get downvoted all to hell for this but it's the truth.  If it's your baby then it's not about you anymore and your kid will deserve for you to give it a shot.  What she did was wrong and difficult to forgive, but you owe it to the kid to try and make it work.\n\nJesus you fucking children can't handle a different opinion.  "
        ]
    }
]