[
    {
        "post_id": "5sddh5",
        "author": "captaingazpacho",
        "title": "[UPDATE] I [29F] had a nightmare relationship with an older man [45M] in college. Now I'm worried what to do when I run into him again.",
        "url": "https://www.reddit.com/r/relationships/comments/5sddh5/update_i_29f_had_a_nightmare_relationship_with_an/",
        "score": 2553,
        "num_comments": 31,
        "created_utc": 1486374907.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/4x4iwk/i_29f_had_a_nightmare_relationship_with_an_older/\n\nWell, thanks for your feedback, guys. Wanted to give you an update.\n\nSo something I failed to mention in my last post is that my mom used to teach at my alma mater before she recently retired. She didn't know about my brief relationship with Kevin years ago. After writing my post, I decided to share with her everything that happened.\n\nMom immediately got this weird look on her face and said she knew exactly who I was talking about because she used to teach in my department. She said, \"I don't think Kevin will be a problem for you.\" When I asked why, she said, \"Trust me, you'll see. That guy is kind of a loser.\"\n\nSo I went to the event, and it was amazing. I took some of the advice here and brought a girlfriend so I would never be alone in case Kevin tried to pull something. I met a bunch of alumni and ran into a couple people who I lost touch with when I got sick. Everybody were thrilled to hear how well I'm doing, and my speech got an ovation when I was done.\n\nAnyway, Kevin showed up with his wife. I don't know how to say this without sounding mean, but he's gotten fat and is going bald. I was surprised at how old he looked until someone told me he's almost 50 now (which means he lied to me when we were dating and said he was younger than he really was). Also, I heard from old classmates that Kevin is **still** studying for his degree, plus working nights as a security guard now.\n\nKevin was the only person at the event who avoided me. Like, it was obvious. I thought he was going to avoid me all night until I accidentally found myself alone for 30 seconds, which is when he nervously approached me to congratulate me. I smiled, said thanks, and kept moving. He tried cracking a dumb joke to me later but I just ignored him, which seemed to frustrate him. Overall I just spent the night focused on the people around me and forgot he existed.\n\nInterestingly, he managed to repeatedly piss off a bunch of people (including his wife and one of the deans) throughout the night with stupid comments. It got so bad that people started a running joke about what an insensitive moron Kevin was.\n\nI'm so glad I went and didn't allow one jerk from my past to make me hide. I had a great time and was surprised at how unafraid I felt when I saw Kevin again. The memories from that time of my life were so traumatic but now he's just some jackass I once knew. I'm not sure now WTF I ever saw in him or why I was ever scared of him.\n\nOh, and by the way, I recently started a great new job that came with a big raise, which means I'll have my student loans paid off this year. Life is good. Thanks for your help, Reddit.\n  \n  ---   \n  **tl;dr: Ran into asshole ex and realized he can't hurt me. Had a fun time meeting people and ignoring him.**\n\nEDIT: Aw, the comments got locked fast. Two things I wanted to add:\n\n* an acquaintance recently told me that apparently Kevin and his now wife were in an open relationship for a long time (including while he and I were together), and that she closed the relationship again a few years ago because she got annoyed. I can only imagine the shenanigans. I feel better knowing he didn't cheat on her, even though he still cheated on **me**, and of course he didn't tell me about his wife at all. Whatever.\n\n* My favorite part of the evening: I blocked Kevin on Facebook years ago, so he's had NO updates whatsoever on my life including the fact that I go by my birth name now. In college, everybody called me by a nickname, but no one's used it now in years. So all night he kept calling me by this super old nickname. People kept looking at him like he was crazy and asking, \"Why are you calling her that?\", and Kevin got super frustrated because he realized everybody was in on some joke that he didn't understand. No one would clue him in, I guess.",
        "permalink": "/r/relationships/comments/5sddh5/update_i_29f_had_a_nightmare_relationship_with_an/",
        "comments": [
            "This is so great to read. Congrats on all your achievements, OP, and I'm glad the event went well! As for Kevin, well, lol. Justice was served, and you didn't have to do a thing.",
            "Oh, this update gives me life!\nI'm so happy to hear of your success, congratulations and well done.\nSo glad you are able to finally move on from this idiot. You are clearly two very different people.",
            "Proof that living well is the best revenge! I'm so glad that worked out for you, OP!",
            "The name and discription have me picturing Kevin from the office. ",
            "This is the best kind of r/justiceporn. Congrats on kicking cancer's ass, having a successful life, and rubbing it all in your nasty ex's face!",
            "A lot of young women are enticed into this kind of relationship, leave it, and look back and are amazed they ever dealt with these guys - I had an experience very similar to yours. I don't put up with 2% of the shit I put up when I was 20. The great thing about growing older is that context and experience mean so much; I love being able to set boundaries and stand up for myself without worrying so much about what it would do to other people.\n\nCongratulations on facing your fear, and not letting it stop you from living your life. You have grown as a person and realized your boogeyman was really just a jerk who got to you at a vulnerable time. That has to feel so liberating!",
            "This is great! You deserve it so much! Nice one.",
            "This update is amazing and makes me feel very happy for you. Well done OP",
            "That was great! You handled it so well! Nice to see he's still a huge loser. I still feel bad for his wife though since in your OP you mentioned that when you first met her you found out she was with him for 3 years which means he was having an affair with you ",
            "That's awesome! Congrats on all your success, it sounds very well-deserved!!",
            "[deleted]",
            "Woot! Go you! I'm so glad you got your night.",
            "Keep your power! Right on.\n\nThis guy will punish himself repeatedly, never fall for his shit if you see him around.",
            "So happy to hear, keep strong, girl!!",
            "Now these are the updates I love to hear. I'm so glad it all went great!",
            "Living well really is the best revenge! Great update!",
            "Good for you, Captain. It's amazing how middling the big conflicts of the past can look in the light of a fulfilling present. A bit like how your elementary school seemed so vast when you were a child, but when you go back as an adult you realize that it's kind of pokey and the water fountains are about 10 inches off the ground. Congrats on all you've accomplished, and on being able to put this tiny water fountain of a man squarely in the rear view.",
            "tl;dr: Ran into asshole ex and realized he can't hurt me. Had a fun time meeting people and ignoring him.\n\nGood for you OP. That guy sounds like a scumbag.",
            "I still wish you had told his wife - but otherwise, you are on the absolute right path and handled it really well."
        ]
    },
    {
        "post_id": "12npvf1",
        "author": "octopile",
        "title": "Update: Should I (28, F) go to my friend's (31, F) baby shower even though I feel like we're growing apart?",
        "url": "https://www.reddit.com/r/relationships/comments/12npvf1/update_should_i_28_f_go_to_my_friends_31_f_baby/",
        "score": 2550,
        "num_comments": 74,
        "created_utc": 1681607931.0,
        "selftext": "Original: Should I (28, F) go to my friend's (31, F) baby shower even though I feel like we're growing apart?   https://www.reddit.com/r/relationships/comments/12a2555/should_i_28_f_go_to_my_friends_31_f_baby_shower/\n\nI went to the shower. I bought her a gift from the registry that was reasonably priced ($40ish or more) and had it delivered directly to her house. I arrived to the party on time and the vibes were really off. The girls there didn’t greet me as they were still setting up a large balloon arch (I wasn’t early, they just seemed to be running behind). They asked me to help with the balloons and I did, but no one made any small talk towards me. It had the vibe of a room full of people who have been gossiping about you. It could also very well be that they were busy and tired from decorating. Sarah mostly ignored me the entire night. I stayed and chatted with other friends, ooo-d and aww-d at baby gifts and photos, and in no way made her time about me. I won the price is right game they put on (which they said they would give gift cards as prizes but never did). I didn’t mention the prize, my Christmas gift, or my recent birthday. I gave hugs, wrote a thoughtful note in her guest book, and after 2.5 hours excused myself to go to dinner with another group of friends to celebrate my birthday. I don’t regret going, but it is clear this friendship has mostly run its course. It was good closure. I wish her the best and am likely not going to give the relationship much energy moving forward. \n\nThank you all for your kind and thoughtful replies to my last post.\n\nTLDR: went to the shower and it went about how we all thought it would go, but it was nice to see friends.",
        "permalink": "/r/relationships/comments/12npvf1/update_should_i_28_f_go_to_my_friends_31_f_baby/",
        "comments": [
            "This sounds like how my friendship with my ex best friend died except I couldn't bring myself to attend her birthday party and face her group of friends who I knew she'd spoken about me too, I commend you for going and how you handled the situation.",
            "If nothing else, you have proven yourself to be a good person and a good friend. You can walk away from this situation with your head held high, knowing you acted with grace and generosity. No one can say you didn't try for Sarah. \n\nBut do not waste another second of energy on this friendship.",
            "This is very similar to what I'm going through at the moment. Sometimes friends come in to your life for a reason, a season or a lifetime, but it's always a difficult pill to swallow when you thought the person pulling away was a 'lifetime' friend. Well done for showing up with grace, and know that you did everything you could. You can start to grieve now and put your energy into relationships that reciprocate the same energy you give. X",
            "I think you did the right thing. You went out on good terms and with no regrets. It's sad, but sometimes friendships naturally end as we move into different stages of life. Maybe your friend (ex-friend sounds more like it) will regret how she treated you.  \n\nEither way, she can't ever be like \"She [you] didn't even come to my baby shower so what kind of friend was she really?\"",
            "Your are classy and I commend you. You ended things gracefully. I hope you had a fun birthday dinner",
            "I had a friend like that except we met over having babies and got close fast. It was a fun supportive five years but then she stopped answering my calls when my mom died. Some friendships run their course and its really hard. It was her, that was her M.O. I saw her do it to the friend before me, and move on to the next after me.",
            "OP this update comes off as very mature. Good job at adutling and being a good person.",
            "Going through a painful splitting apart of a friendship in my own life. It's never fun but I think you are doing the right thing. Like me I think you will probably feel a sense of relief having that stress out of your life. It makes you feel really insecure always second guessing your actions.",
            "It sounds like you handled yourself with grace and poise.",
            "You sound like a really good person OP. I’m proud of how you handled that & I hope your bday dinner was lovely.",
            "I've been to a few weddings where I walked out and knew that this was also a send off to our friendship in addition to the wedding itself.  \n\nI've found the same as you did, that its good closure.  I consider the gift (and associated cost) a parting gift.  Something to know I did one last nice thing before I likely would never see them again.  I actually prefer this to allowing the relationship to fizzle out and feeling like you never really marked a point in time when it ended.  You get to share a (hopefully) nice moment as a way to remember them in your life.",
            "This is probably the most mature, and adult way to close out a friendship that has, very obviously, run its course.\n\nThat vibe you had? About them likely gossiping about you before you came? I guarantee you your gut is 150% correct. Your ex-friend literally invited you there to get one last drop of blood out of the stone that was your friendship.\n\nPay them no further mind. You did great!",
            "You did the right thing. That was a very mature way to deal with it. Well done",
            "I feel like I am going through this exact same thing with a number of friends in my life. You did the right thing showing up, it’ll be easier to rekindle the friendship later on if you choose too, if not, you showed up and can move on without guilt.",
            "At least now you know! You’ll never have to wonder “what if I had tried” or anything.",
            "This hurts to read because I went through a similar process with a friend and it also ended in a baby shower. It wasn't a 6 year friendship though, so OP I can only imagine how much that hurt. I hope you had a great birthday and meet more compatible friends.",
            "I agree with everyone else. You stood the high grown and showed your quality as a person. You don't owe that friend anymore if you decide.",
            "You seem like a really kind and thoughtful person. Well done on being the person you want to be for yourself. I applaud you and I can say I know I'd want to be your friend. \n\nI hope you had a really awesome birthday.",
            "Sometimes group events feel more hostile than they really are when there's a tight group of people there and they don't make an effort to include everyone. It doesn't always mean they're assholes, it might just mean theyre bad at hosting events.\n\nIf you want to rekindle things, maybe meet for brunch or something 1 on 1 with your friend. That's really only if you want to though. I think it's also OK to just recognize you're not really friends anymore too.",
            "Sounds like she has lost an exceptional friend. Good luck to ypu and most importantly, happy bornday.",
            "Yeah your friendship appears to be over. \n\nProps to you though for going and flint the nice thing.\n\nJust move on with your life.",
            "You were lady like enough to go and even more  so with a bunch of baby snot fair weather friends.  Keep the friends now you have who celebrated your birthday.  Those are the ones who truly didn't just blow out your candle.  Happy Birthday!!!!",
            "Honestly, this update is a breath of fresh air. It’s just nice to read that OP did the courteous thing for her friend, followed through on what seems to have been an awkward event, bowed out respectfully at the appropriate time and moved on. No drama, even though she would have had the right to confront her pregnant friend, if not at the party, at some point. \n\nI always tell my kids that people come in and out of your life. Experiences, priorities, lifestyles all affect relationships and it’s just normal for friendships to run their course. It happens and isn’t necessarily anyone’s fault, although there are often hurt feelings. This one certainly seemed to be one sided for a while, which is a huge red flag. Best to just move on and not hold grudges. Good on you, OP. Hope you had a happy birthday!!",
            "I think you walked away being able to be proud of how you’ve handled the situation. You showed her kindness, effort and empathy to the very last moment while also being able to realize this was probably one of the last times you’ve seen her. I think you handled it wonderfully, no matter how painful dying friendships are.",
            "You chose to be the bigger person in the situation. But being the bigger person is highly overrated. When someone says to be the bigger person, they often mean ignore the problem, suppress your feelings, and offer kindness and empathy, whether they deserve it or not. Do this until the other person miraculously realizes they’ve been an AH, or you boil over with resentment and end the relationship.\r\n\nDon’t get me wrong. There are times when being the bigger person makes sense—with people who have demonstrated an inability to change, who you are somehow forced to spend time with i.e. family. Sometimes grinning and bearing is the only alternative to a bloody pile of carnage. But sometimes, we should choose carnage.\r\n\nBeing a good friend does not mean being the bigger person. True friendships are between people of roughly equal size. Both require love, effort, and attention. Both are willing to give and receive. Part of the reason you’re not getting what you need from your friend is that you’ve slowly taken on the role of being the bigger person. Ignoring slight after slight. Giving gifts and care packages and emotional support and never letting on that you need these things, too.\r\n\nAs I read your original post, I kept waiting for the part where you tell your friend how you feel. If you did, fair enough—kick her to the curb. But there are so many instances where you hold back instead of saying what’s on your mind. Namely: *Where’s my present? Where’s my invite? Where’s my “how are YOU doing”? Where is my m\\*\\*f\\*\\*ing gift card?!*\r\n\nAnd I get it, there was a pandemic and a move and she got pregnant. It’s never a good time to tell someone they’re being an AH. But unless it’s their literal wedding day or somebody died that week, it’s okay to tell them you’re upset. The sooner you tell them, the better.\r\n\nIf you haven’t, you need to sit your friend down and gently tell her all the ways she’s let you down over the past few years. Tell her that none of these things in and of themselves would amount to much, but all together they make you feel like she doesn’t value you as a friend. Altogether, they’ve convinced you that she doesn’t want you in her life.\n\n\rAll lasting relationships eventually reach the point where one person hurts the other—often without realizing it—and it’s up to someone to be the bigger person, not by repressing our feelings and acting as if everything is fine, but by being messy and vulnerable and honest.\n\n\rIf you haven’t told her yet, I can guarantee that your friend has no idea that you are carrying this (totally understandable) load of hurt and resentment. I can guarantee that she has not considered that each act of overlooking you adds weight to the pile. I can promise you that she is too busy processing the weight of her own actions—like moving in with her parents during COVID, or having a child—to consider how her inactions have affected you.\r\n\nAnd you might call that selfish—I certainly would. But I would also file it under ‘human’ and ‘forgivable’. I might even be so bold as to label it *an opportunity for mutual growth and understanding??*\r\n\nYou both should also recognize the new weight on your relationship—that your lives are moving in opposite directions. You’re both at an age where you are forced to make decisions that until now seemed happily hypothetical. Some of those decisions are societally sanctioned with parties, presents and balloon arches, while others (sadly) are not. But don’t let all this pomp and crepe paper fool you. Behind every huddle of happy mothers is a list of complaints and *what ifs?*\r\n\nI’m not trying to imply that all childfree people secretly want kids or that all mothers secretly regret having them. I’m saying that when we’ve taken a road and there’s no turning back, this can lead to understandable fear and panic, especially in a newly pregnant woman who once thought she’d be child-free.\r\n\nI can’t say for sure that this is what’s happening to you and your friend, but it happens. It happened to me.\r Right before the pandemic hit, my crazy acid-tripping, one-night stand having, artist friend got married to a conservative golf-playing, country club, card carrying family man. And I’ll admit, it was weird. It was hard for both of us at first to talk about our lives, which had once resembled one another. We had our rough patches—she shamed me for sleeping with someone during COVID, and I was an incompetent maid of honor who neglected to purchase matching robes that said “Bride Squad” on it.\r\n\nIt may be true that your pregnant, married friend who can’t drink or have sex with a new person theoretically ever again doesn’t want to hear about your wild nights. And you may decide you’re unable to feign enthusiasm about sleep training or breast feeding or that supposedly adorable thing her kid did. It would be fine for one or both of you to choose to spend time with the people who share common ground. But I think often our resistance to people whose lives are different from our own stems not from a lack of interest, but from fear.\r\n\nPeople with lives vastly different than our own present us with the opportunity to doubt our own decisions, covet what we’ve given up. And even if we don't, we still ask: Is she judging me for my choices? Does she even care to hear about my life, when she can’t possibly relate?\n\n\rThe good news is that a good friendship is based on more than shared circumstances. It’s based on the way they tell stories, the way they listen and offer support, their hot takes on the newest season of Love is Blind, a shared fondness for cat memes. You may drift apart—your friend is about to be consumed by motherhood and won’t emerge for a hot minute—but you can still come back to each other, if the friendship is worth it.\r\n\nEventually, my friend and I aired our grievances. We settled in to a new dynamic. We support each other even though we weren’t going through the same things. And a few months ago, it was I who helped her assemble the balloon arch for the “sprinkle” celebrating the arrival of her second child. I sh\\*t you not.\n\n\rAs the sprinkle attendees arrived, all of them wealthy, manicured wives and mothers, I, the only childless friend, who’d traveled by bus from New York City where I live happily with one roommate and a cat, braced myself as if I were landing on an alien planet. I could have let my fear of being seen as a freak, an object of curiosity and pity, take over. But instead I chose not to alienate myself. I liked my life and my decisions. I made them for a reason. I decided that they were just as afraid of me as I was of them. We were all happy with (and at times doubtful of) our lives.\n\n\rI’m not going to lie to you and say I had a swinging time at the sprinkle. Did I stand silent on the periphery of many conversations centered on babies? Yes. Did I listen to women complain about their incompetent, non-contributing husbands? Yes. Did I see within the group the same pull of doubt and desire between women who worked and those who didn’t? Yes. Did I learn something? Yes. Am I going to get married, move to the suburbs, and become a SAHM anytime in the near future? Absolutely not.\r\n\nThis is all to say that those women were probably not talking about you before you came into the room. If the vibe was off, it was probably because somebody dropped the f\\*king ball on the balloon arch. In the case of petty social crimes, it’s almost always safer, healthier, and more accurate to assume that people are not thinking about you. They just aren’t.\r\n\nLikewise, I think your friend’s crimes are crimes of omission—being too caught up in her own life to consider yours. And make no mistake, it is a crime, and she should be brought to justice. But I doubt she’s made a conscious decision to cut you out. And if she has, it might be out of fear or insecurity. I bet she’s ignorant of how close she is to losing you as a friend. And if she isn’t, maybe she thinks—after the awkward conversations, you not inviting her to your own birthday party—that you want her lost.\r\n\nOf course, I could be wrong. But I think there’s a reasonable doubt here. I say give her the benefit of the doubt by telling her how you feel. Allow her the opportunity to fix what is broken. Don’t assume she knows your feelings, especially if you’ve done a convincing job of pretending like they don't exist. She deserves to know the hurt she’s inflicted, before you disappear from her life. And you deserve to be seen and heard. You deserve a friend who will send all that generosity and love right back. You deserve to receive your gifts. Don’t be afraid to ask for them.\r\n\nTLDR: Tell your friend how you feel before giving up on the relationship. Claim your gifts! Also, I aspire to write an Ask Polly-style advice column one day, so I’m randomly responding to people on Reddit for practice. If you want advice, PM me!",
            "She sounds like one of those shallow creatures who is not comfortable around anyone who isn't a perfect reflection of her lifestyle choices. When she decides to have a child, her childfree friends are dropped. If she embraces a religion, all her current friends who don't embrace that religion will be dropped. When she leaves that religion and starts selling Amway, all her religious friends will be dropped. And so on.",
            "You were gracious - I bet most people would not have the magnanimity. Don’t sweat it anymore.",
            "Thank you for your post. You handled it well and with dignity. \n\nNow time to move on, with the door left open.",
            "Good on you for trying!",
            "Yeah she’s a user. She looks you up any time something comes up she can get a gift out of you for. I’ve had those friends best to cut them out and move on.",
            "Do you think that they were gossiping about you because they found your reddit post ?",
            "You seem like a really decent person. I can’t shake the feeling that there is something you’re not seeing or not telling us though. Why would her friends gossip about *you* in particular? Why do you even feel that? Maybe you’re being too sensitive, but if there’s a there there, then I wonder what it is.",
            "Its most likely that everything is in your head, I seriously doubt she holds any negative feelings towards you. It's a hard pill to swallow and it can hurt, but friendships naturally fade. Especially considering she recently got married and had a kid.",
            "According to your previous post, you made being \"childfree\" part of the identity of your friendship with her. And somehow you are surprised that you're being treated like a stranger now that she's pregnant.\n\nNot having kids is a life choice. It's a perfectly valid one, but it doesn't define you or other people. When you make it part of your identity, you're going to find yourself iced out at child-related events like this.",
            "If you don’t wanna go politely decline advising Yu have a prior engagement that clashes. One thing you can’t learn sooner in life is that you don’t have to draw negativity closer but be unavailable when it calls on you",
            "Good for you. I would have sent the gift and not gone. Hope you had a good birthday with your friends."
        ]
    },
    {
        "post_id": "dgbygb",
        "author": "normally__ish",
        "title": "UPDATE: My (28F) partner (33M) doesn't want to commit to showing up when he says he will.",
        "url": "https://www.reddit.com/r/relationships/comments/dgbygb/update_my_28f_partner_33m_doesnt_want_to_commit/",
        "score": 2553,
        "num_comments": 324,
        "created_utc": 1570781116.0,
        "selftext": "\\[UPDATE 10/17\\]\n\nY'ALL\n\nI did not think that many people were going to follow up on this. I didn't include a lot of info bc I didn't want him finding this, but I doubt he reads here sooo:\n\n1. The drinking—he doesn't drink everyday any more. In fact, he stopped drinking for two weeks straight and only had a couple of drinks when he was upset about something. I don't think he's drank since.\n2. The weed—he hasn't stopped smoking, but he has stopped smoking during the day. He'll usually smoke at night before we go to bed and that's kinda it.\n3. We had a conversation about him going to therapy—he's been in the past and had really bad experiences with it. He doesn't trust therapists, and as we all know with therapy, it only works if you want it it. I can't make him go if he doesn't want to. I don't necessarily like this outcome, but until it becomes hazardous to his health, I'm not going to push it.\n4. He didn't trick me into believing that I was the problem. I talked to my therapist, and she pointed out my responses as being emotionally manipulative.\n5. I've been single for most of my life; I don't have a problem being single. I don't need another person to validate me. I just happen to like this one.\n\nReddit, I'm fine. I've been in toxic relationships before that I should have bailed on way earlier. This isn't one of them. You know how I know? Because when we argue, he established the rule that we're on a team, and we're working out a solution together. We obviously don't always remember this, but we've stuck to it. There is no me against him or him against me, it's us against whatever is bringing us down. Also, he made the rule that we should hold hands when we argue or hug after taking a break. It's hard to be mad at someone you're in physical contact with.\n\nAlso, thanks to those of you who left well wishes. I don't think there's a right or wrong in this situation, but I think it's easier to pick at a stranger's flaws than it is to believe in their judgement.\n\ntl;dr: get off my back reddit\n\n\n-----\nPrevious post [here](https://www.reddit.com/r/relationships/comments/cxlxvd/my_28f_partner_33m_doesnt_want_to_commit_to/).\n\ntl;dr from last post: My partner won't commit to being on time, when confronted, said he'll now say \"maybe\" to showing up and never give a time.\n\nSO, after reading this and realizing that my partner was having a problem with drugs/drinking and calling multiple friends, I sat down with him after having a blowout fight and had a real conversation about boundaries. I asked him why he didn't want to commit to showing up, and he said he didn't think it was a big deal because he'd been doing it all his life to everyone. Even his close friends, who have confronted him about as well. He was just raised like that where it was never guaranteed that someone would show up, which seems a bit…weird to me.\n\nSome of the \"laziness\" around showing up had to do with his depression, which I totally get. There have been days where I couldn't even make it out of bed. It's not really a choice you have sometimes.\n\nHe realized that I was really upset about it (finally), and after I said that I need to feel like I can trust his word, he said he'd try. And it's been about a month, and it hasn't been exactly smooth, but he's stuck to his word—shown up when he said he would, communicated when/if he would be more than an hour late.\n\nAnother big thing is that I realized I was behaving in emotionally manipulative ways as well—guilting, shaming, stonewalling. It was in response to his flippancy, but it wasn't helpful for either of us. He's always been calm with me and very clear that he wants to work on our issues together. That's what counts to me.\n\ntl;dr It's not perfect, but we're committed to making it work. We're both growing. (:",
        "permalink": "/r/relationships/comments/dgbygb/update_my_28f_partner_33m_doesnt_want_to_commit/",
        "comments": [
            "So....he’s 33 but never realized that people are generally on time? Does he not have a job? Ever had a doctor or dentist appointment? Ever taken a plane? How does he manage to be on time for those things? \nI think you’re in for a painful relationship with this guy.",
            "Ok, so I've read both of your posts and I have to say that I've dated this type of dude before. The depression, flakiness, substance abuse, total disregard for your feelings/time, lack of empathy etc. I also struggle with anxiety and depression. You know what makes it worse? Dating a guy like this. I am usually a pretty level headed, rational person but with my ex, I was constantly anxious, crying, yelling and absolutely frustrated and it was because I was dating an emotionally cold and immature person. Like your boyfriend, he convinced me that his shitty behavior wasn't the problem, it was actually my \"dramatic/over sensitive/crazy\" reactions to said shitty behavior.  When we broke up, everything changed. I even noticed that my resting heart rate plummeted when we broke up due to my fitness tracker.\n\nI really don't think it sounds like you resolved anything. He's now going to *text* you when he knows he's going to be hours late to hang out with you? Yay. He's said that he's always behaved this way in the past because people in his life just deal with it. Is that really OK to you? What kind of future do you honestly see with someone like this? Reliability is basic necessity to anyone in a relationship.\n\nThis man is 33. He's not going to change. He's going to placate you for a few weeks and then go right back to his BS behavior because you keep putting up with it. Please know there are better partners for you other there that: care about your feelings, will be respectful of your time, won't abuse drugs to the point that they *fall asleep and leave you outside for 30 mins,* etc. I really think you should work on your self respect and self esteem. If you had a healthy relationship with yourself, you wouldn't put up with this.",
            "Were you guilting and shaming? Or did he just feel guilt and shame when you mention shameful things he has done, that he feels guilty about? Asking someone to respect your time is not the same as guilting them for failing to respect your time, even if it makes them feel guilty.",
            "I’m confused. Did I miss the part where you spoke to him about his substance abuse problem? What I read is that there was no resolution to any issue at all.",
            ">communicated when/if he would be more than an hour late\n\nWhoa, if this represents a significant improvement in your relationship, you've set the bar way too low.",
            "Wow, he conned you pretty good into thinking that your concern was you being manipulative.",
            "[removed]",
            "So he's not actually changing his behavior, just talking to you more about it, and you haven't approached dealing with the substance abuse problems or depression? I was in a similar spot when I was your age. I'd met this guy who love bombed me super early on in the relationship-- of course, I didn't know that's what it was at the time. Mildly concerning behaviors also began to peak out, but I was so overwhelmed by the \"good\" stuff that I let it go. Plus, he had an unconventional and somewhat abusive childhood (he would rarely talk about it) and I allowed that to be an excuse for his \"quirky\" behaviors. I ignored his weed abuse because it was \"just\" weed and a coping mechanism for that childhood that I couldn't begin to understand or relate to-- so who was I to want him to stop? I began to fret and worry about traveling to non-legal states because how else could we make sure he had what he needed?\n\nAnd then he pointed out unhealthy behaviors on my part, namely stonewalling. Which I'd never done in a relationship before, *ever*, but developed as a coping mechanism for his abuse. Literally anything I said to him was the \"wrong\" thing and he'd flip out and yell and intimidate. But because I did it-- I stonewalled!-- I felt culpable for the problems in our relationship and like I needed to work harder.\n\nLong, long story short, it didn't get better. It got worse and worse and worse and worse and then it took me six months to safely exit the relationship and avoid the burden of suicide threats. All in the relationship was only 1.5 years, but that was 1.5 years too many and I still am dealing with issues from that relationship today, two years after the relationship ended and nine months into the healthiest, best relationship of my life.\n\n\\--\n\nRelationships are very complicated creatures. It does take two to create them. But there is absolutely no reason to stay in a relationship that is as fraught as yours sounds, especially so early on. This is the honeymoon phase: he is on his very best behavior! As are you, and you've noted that you're not even on your best behavior. It doesn't sound like this is a healthy or very happy situation. Please don't fall prey to the trap of \"well I did something wrong too, so I owe it to the other person to keep trying/forgive them for what they did.\" You don't owe a person your time or effort. The first several months of your relationship should be a delightful getting to know one another-- not to say that there won't be problems, but if you have to work this hard this early, chances are it's only going to get far worse.\n\n&#x200B;\n\n&#x200B;\n\nETA-- The reason I mentioned that this happened to me when I was your age is that while I don't know you and don't know if this is true for you, I 100% was feeling anxiety about 30 approaching and not having found my life partner so I think I was especially vulnerable to putting up with abusive behaviors. So just putting it out there that being with the wrong person is far worse than being alone AND you're preventing yourself from finding a good partner. Anyway. Good luck; I wish you the best.",
            "OP, this doesn’t sound like that much of an improvement.  He’s still doing the same things, just texting you more about them.  \n\nHe still hasn’t addressed the underlying substance abuse or depression issues in a meaningful way.\n\nDo you think you deserve a partner this terrible?  I’m here to tell you that you don’t.",
            "At 28 you have so many options for dating.. It’s right in that sweet spot age-wise for dating. Please know there are sober, mature, loving men you could be dating who communicate without you mothering them. You could be working on bigger life goals with them rather than working on not lying and not doing drugs. Please consider this before you’re 30 with the same problems.",
            "Holy shit he's manage to turn you into the abusive one?? Girl run, he's way too old to be playing the \"oh yea I was just raised never being on time for anything\" card, this is real life for fucks sake, does he not have a job or anything?? I just got out of a horrible relationship, and every time we fought it was ALWAYS somehow my fault, something I was doing wrong, all the pressure fell on me to fix the relationship when he was abusing me. Also none of the substance abuse seemed to be discussed at all. This isn't an improvement and it's kinda scary that you think it is. Nothing has been fixed",
            "This is pretty grim to read. He texts when he’s going to be *more than an hour* late? And you live an hour apart. So he only considers it necessary to let you know he’s running late if he hasn’t actually left his home by the time he said he would be arriving at yours?\n\nThat’s... not great. The request you’re making is so reasonable- not even to actually BE on time, but just to keep you updated. And he doesn’t even consider you or your time worth that. And he has a substance abuse problem on top of that?\n\nThis reads so much like me when I was in a toxic relationship with a dysfunctional person, clinging to the tiniest shreds of improvement while ignoring the fact that the big things were still a total wreck. \n\nIt’s like getting excited that your partner is dusting for once when they also just set your house on fire.",
            "Yikes. It’s hardly been a month since your last post and he is 33.... this is him, he thinks it’s normal for people to be late and doesn’t want to change. You’re willing to let alcohol and drug abuse slide to keep the status quo. \n\nIn fact, it sounds as though he gaslit you into thinking you were a major part of this issue. \n\nHe is emotionally addicted to alcohol and weed, you aren’t holding him accountable, he has no reason to hold himself accountable. This is going to get worse. \n\nYou are not healthy enough for this relationship. Seriously. Get yourself into counseling and figure out why you’re afraid of being alone to the point that you’ll stay with someone who doesn’t respect your time, abuses substances, and doesn’t give a shit about hurting you.",
            "It sounds like you really want this relationship to work but there are a lot of red flags.\n\nYou both need individual counseling and couples counseling. Please do this before moving in together and getting married. And make sure your birth control is top priority. \n\nYou've listed a lot of problems in such a short time. Neither of you sound ready for a commitment. I can't imagine how this would end well but I wish you both the very best.",
            "I think you should be wary here. If the behavior doesn't improve to the point of communicating when he will be more than ten minutes late eventually, i wouldn't consider it good enough. I wouldn't put up with being made to wait 45 minutes without so much as a word, and I would NOT accept being told, \"oh but i was under an hour late so it's fine!\"\n\nThere are real, functional adults out there you could date instead. People who aren't projects, who already act respectful, who you don't have mother and fix. Keep that in mind as you monitor his \"progress.\"",
            "So he does drugs, is manipulative, stonewalls, guilts ... is clearly gas lighting you .... and you think he’s worth being with? 🤦🏻‍♀️ \n\nOne of my biggest regrets personally was wasting time on people. I found it hard very very hard to break up with someone while I still cared for them even though I knew it wasn’t going to work. All to avoid the pain, meanwhile creating more pain! 🤦🏻‍♀️🤷🏻‍♀️\n\nCut your losses. Love yourself more. Want to be happy.",
            "So, is it laziness? Is it depression? Is it the way he was raised? How about lack of respect, commitment issues, irresponsibility? We really don't know, do we, and neither, it seems, do you. Or him.\n\nThis is not the behavior of a person in an adult relationship. Or a loving partner. But we're all over the place trying to determine root cause. And until you do that, you may end of focusing on the wrong problem. \n\nNot only isn't it the behavior of someone in a relationship, normal adults just don't act that way. I'm not trying to rough the guy up, I'm suggesting something else is at play, reason or reasons that may reveal deeper problems. Laziness alone doesn't explain it. Depression may. But something leads me to believe the flag may be a deeper red than you may think.\n\nI'd be interested to know how the rest of your relationship is going. I mean, when he shows up. Is it a loving, adult, mutually respectful one? How do your conversations go? In other words, what else isn't right?\n\nI suggest you may be headed for trouble down the road if this isnt examined thoroughly and fixed. What you may be dealing with is a symptom of the real issue. And if there's one symptom, there generally will be others. Don't wait around for them to manifest. Examine your whole relationship, evaluate where you are, and especially where you are going. Do you like the direction you're headed overall? I bet not, because this level of disrespect for you has to have negative consequences throughout your relationship. You're headed for big trouble, I fear, if this isn't fixed. Best to find out now. Best of luck to you. Ol' Joe",
            "Ok, so, what about the drug/drinking problem? You mentioned it at the top of the post and didn't say anything else about it...",
            "I'm glad there seems to be some progress, but this is really far from a solution OP. As a person with plenty of substance abuse issues of various types weed can be the most tame, but only if his underlying mental health is in check. Smoking weed daily is manageable for a lot of people, but not if it's an escape mechanism for serious depression. Try to get him into therapy, it really can help.\n\nAdditionally, I hope you didn't learn about your \"emotionally manipulative\" way by him framing it that way for you. The way you reacted was not inappropriate or manipulative from what you've detailed, and you should be guilting and shaming him for completely disrespecting your time/relationship. This could very well be an offshoot of gaslighting, and manipulative people are brilliant and being able to convince you that you are the manipulative one. Tread lightly OP, good luck with everything.",
            "The fact that he says hes been doing this to everyone he knows his entire life is not an excuse. Do no accept this as an excuse. He is telling you that he openly is disrespectful to people and even when people close to him have not been okay with this behavior he disregards them and continues to display disrespectful behavior. He is trying to normalize it. However, it's not normal. Do not start tricking yourself into believing that your reactions to his disrespectful behavior is mental abuse. There are a lot of red flags here. I had similar issues with someone I dated. Yes, he had made small efforts but he always resorted back to the same behavior. You have every right to call out his behavior. Tell me, did you realize your reactions were manipulative or did he plant that idea in your head? I'd suggest you take a step back and really look at that. When you feel in your gut that someone isn't treating you right and then they normalize the behavior and try to make you feel like your reactions to that is wrong, that's a huge problem and it will never change. Only temporarily so. \n\nHowever, I realize there are many sides to this situation. So if you really feel that he is putting in an effort and that is enough for you, go with your gut. But don't ignore your gut here and try to convince yourself by accepting the excuses (depression, repetitive behavior, drug/alcohol abuse). Ultimately, he us responsible for himself. That doesnt mean you should be taking the brunt of his struggles through his poor commitment habits.",
            "Gain some confidence and self-respect and find a better partner.",
            "Why are you dating this loser?",
            "OP, I dated a guy like this... you can do better. MUCH better.",
            "it's time to cut bait, this guy is a dud.",
            "Others made good points - are you sure he didn't just gaslight you into thinking you were behaving wrongly? Did you talk to your therapist about it? Do they agree? And he needs therapy, as much as you. More frankly, if he's coping with drugs and drink.\n\nHow do you think he'll be if there was an emergency? Would he come help if you needed him, or would he be an hour late or asleep from weed? Can you put up with someone unreliable as your actual life partner? What about if you had kids?\n\nAsk yourself what you would tell your best friend or a family member if they came to you with this story.",
            "OP I just want to point something out that I know based on experience. You've realized his behavior is related to substance abuse issues. His responses to your recent discussion sound like excuses addicts use to justify their behavior when they are in denial about having a problem.\n\nAlso, your responses to his excuses/behavior:\n\n>I realized I was behaving in emotionally manipulative ways as  well—guilting, shaming, stonewalling. It was in response to his  flippancy, but it wasn't helpful for either of us.\n\nAre classic traits exhibited by a codependent person, which happens to people in relationships with addicts.\n\nI would recommend you look into not just boundaries, but also codependency and maybe Al Anon while you're at it. I'm not accusing you of anything, but I'm saying I do all these things in my relationship with my addict so it might be worth checking out.\n\nEDIT: \"did\" to \"do\" because I need to be honest with myself as well.",
            "This does not sound like any change at all honestly. It sounds like excuse after excuse. He texts you if he's going to be an hour late is not improvement. \n\nAlso why have you suddenly realized you may be doing emotionally manipulative things? It really sounds like he took the abusive approach of trying to convince you that you are the one being abusive. \n\nDo you really deserve to deal with a 33 year old child??",
            "100% your partners issues are not primarily depression related, they are substance abuse related. He's unreliable, will pass out when you are coming to meet him, etc. While I understand you want to give him the benefit of the doubt, don't allow him to excuse his poor behavior because of depression. He needs to get his drinking and smoking under control, and start acting like an adult.\n\n(Recovering addict here, can confirm)",
            "He only calls to let you know when he's gonna be more than a *hour* late? Depending on what the occasion is, I'd be expecting a heads up if someone's going to be even a few minutes late. Also, keep in mind that this is likely his best behavior at this point. And he'll start to slack off again soon. So if the best you can get is this... wow. And I'm a little upset for you that you're now feeling like you were being emotionally manipulative in reaction to his mistreatment of you.\n\nWe don't want to be guilting, shaming, or stonewalling our partners. But if he's constantly doing stuff that is disrespectful to you, no matter how many times you ask him to change the behaviour, that's a problem.\n\nEdited to add: Okay, I read your original post. It's time to move on from this relationship. You're 28 years old. Do you want children one day? If so, don't waste more time with this guy. Don't move in with this guy. Your life will be miserable. You don't share the same values. He has a drinking problem and smokes weed, you don't, *except sometimes with him*. He's influencing you to do things that are harmful to your body, that you wouldn't be doing if he wasn't around. He doesn't value your time. He is so disrespectful that you end up so anxious that you're yelling at him. That's not fair to him and it's your responsibility, but the problem is that who he is as a person, and the way he treats you, leads you to get so anxious and upset that you're going against your values and yelling at him. Couples fight, couples occasionally raise their voices, but getting involved with a guy who has substance abuse issues and depression, and who disrespects your time from the very start, and who also lives really far away... is that really the person you want to spend your life with? What about if you had a kid with this guy? You couldn't count on him to show up on time for kid stuff, appointments... you'd be run ragged picking up his slack. Don't do it to yourself.  \n\n\nAlso, if you move in with him and he can't show up on time for work, you'll end up financially supporting him because he'll lose his job. And with you to pick up the slack, he'll have the luxury of doing that without any major consequences. Because you'll be there to work twice as hard to pay all the bills.",
            "Cool thing about this relationship is you get to learn to be a mother in the process.",
            "> He's always been calm with me and very clear that he wants to work on our issues together. \n\nIn your last post you literally said that he told you were overreacting. This guy is messing you about.\n\nIs he on time for his job?",
            "God your standards are terrible",
            "How about not dating a loser",
            "I would still be very wary. I was in a relationship with someone who would do the same thing. Not show up on time, stand me up, and not communicate about any of it. If I brought it up, I was always overreacting. Things did start to get better after some time to the point where we got married. But, he never really changed. We’re divorced now and I’m so much happier. Don’t let yourself get used to shitty behavior. It just messes with your anxiety and makes you feel stuck. The lateness is also most likely a symptom of a much bigger problem. I believe people can change but it has to come from within them. Don’t let your life pass you by while you’re waiting outside dudes apartment for him to wake up. If he wants to be there, he will be there no matter what.",
            "My brother in law always says he is coming to things, but never actually makes it.  I’ve stopped cooking extra in anticipation of him coming.  It’s annoying as hell and he is now a meme to us when it comes to commitment.",
            "I wouldn't waste anymore time on this guy. You are young!! Imagine if you guys throw kids into the mix a few years down the line. All the responsibility will fall to you. Is that something you want? If you think you are bothered by his behavior now... It would be 100x's worse.  Someone who behaves like this absolutely 100% does not respect you.",
            "He has a problem with drugs and drinking and the thing you're worried about is him being on time? I think abusing substances would be my bigger concern in this scenario. \n\nHe doesn't need to be on time for things. He needs to be in drug treatment and therapy to determine why he's self-medicating. Him doing that would be my line in the sand, not whether he's on time.",
            "Ah, I get it. So no progress was made and in a few weeks or so, you'll be back to square one.",
            "I had an ex with ADHD who was never on time. I couldn't handle it and broke up with him. It really can be an incompatibility.",
            "Codependent No More by Melody Beattie.",
            "Honestly it sounds like he actually may have a problem with heroin.  I dated a girl for a while who behaves the same way.  Apparently she was nodding off while getting high unbeknownst to me.  And as another person wrote the behaviors triggered all sorts of anxiety.\n\nCut the cord and get your sanity back. Sometimes we can love someone who isn't healthy for us.",
            "you can  not fix  him.",
            "He's 33, in two years he'll be closer to 40 than 30. The fact that he smokes weed everyday and doesn't get help for his depression tells me it's only gonna get worse with him. He's gonna start slipping eventually and you'll get used to it like everyone else in his life. I've had partners who've cooked for me and taken care of me when I've been sick and they also were always on time, didn't use substances to the point where it gets problematic. He needs professional help. Keep that in mind for your both sakes. Stay safe and value yourself.",
            "I've been life long friends with someone who is exactly this person (or incredibly similar).\n\nThat person has never corrected their behavior because they don't think it's wrong. When there is a big conflict or crisis because of it, they will kinda be a bit better for a while and then revert to their former behavior. \n\nI'm glad that you want to work on this and recognize your part in the situation, but keep your boundary and make it clear. Often, that boundary gets agreed to and then slowly eroded.",
            "Your boyfriend is 33 and lives his life like he's 23. He just does drugs and drinks all the time and leaves you hanging on the reg. You can't fix him and if you think that this is an acceptable partner you should probably start going to therapy to figure out why.",
            "I know some adults with ADD with similar behavior. It that looks like it fits, it might be something he should look into. \n\nBUT he still has untreated depression that he's self medicating with booze and pot, and he \"thinks\" about therapy. I waited a year for someone who was \"thinking\" about therapy. He did it after we broke up. There's nothing to think about, he needs to just do it, or stop pretending that \"thinking\" about it means anything at all.",
            "This post is full of red flags. OP you deserve better.",
            "Stop making excuses. He's rude and self absorbed. He'll chip away at you forever. Get out now and find someone who actually gives a Sh,,",
            "Just do the same thing to him. Show up 2 hours late to everything and don't text or call",
            "Just wanted to share that I was in a similar (significantly lesser) situation with my then girlfriend when we started dating over thirteen years ago.\n\nI would hardly ever reply to her texts and never say where I was when she asked (I had a reputation among friends to never reply to messages). I thought it was normal. I treated everyone like that. But when she told me how much it hurt her, I made a conscious effort to change. I didn't change overnight, but I became mindful of how I was treating her...\n\nI call her my \"then girlfriend\" because we got married three months ago. So I wish you luck, patience, and lots of love. May you both grow into better people, together <3",
            "I had this problem with my first ever boyfriend. I started not to show too much interest in seeing him or being the one to make arrangements.. then I had him at my feet.. Took about 6 months and I didn't do it on purpose but it was too late and I split up with him. The last words he said to me where 'I'd marry your tomorrow' he's 37 now, single and probably still a bit the same. He's very successful and has a big house to himself.. But it does make you wonder.\n\nBasically he wouldn't commit incase something else better came along. Until I stopped trying. Then I was the best thing since sliced bread.",
            "About 25 years ago I realized several of my friends were the type who were always late, sometimes not showing up at all...I was working full time, plus night school to complete my Bachelors in Computer Science.\n\nI finally told the ones who were always late I couldn't do it any more.   I lost several close friends, never got them back, never replaced them with new ones.   I regret it sometimes, but I feel it is very disrespectful to whomever you are meeting to be late, not show up...\n\n&#x200B;\n\nTired of being disrespected...",
            "*Shoe's on the other foot now, isn't it!?*  \n\nSeriously, though, I deal with this aggravation daily with the ex. Don't judge. It's a major reason she is the ex. Never on time, usually late, and by at least an hour. Drove. Me. Up. The. Wall.  \"5 more minutes! \"\n\nBull ... shit",
            "My MIL was notoriously late to family events. So late that family gave MIL an earlier time (ex: be here at 3p so she would show up right on time at 5p). \n\nEvery now and then my wife and I would ask her for the time we need to be somewhere before confirming the time with somebody else. Her cousins would be pleasantly surprised when they discovered we had already done their chores to help their parents (wife's great aunt and uncle) set up for the family dinner because we were so early.",
            "I'm happy y'all are working it out, OP.\n\nI'll tell you this, your bf and I sound a lot alike. I started drinking at a young age and I do believe I drink more than I should even if I'm not getting blackout drunk when I do, I also smoke very day although the difference here is I ONLY smoke when I'm at home and have no plans for the rest of the evening. I know I get sleepy and lazy when I smoke so I don't do it when I've already made a commitment to do/be somewhere. The flaking on you thing is super inconsiderate, I understand if it only happened once in a blue moon when he isn't feeling well but it sounds like it happens a lot and it absolutely is shitty of him to do. My partner and i have the same issues with depressions and anxiety. My gf has anxiety and I had bouts of bad depression but we always communicate when we aren't feeling well and we've managed to find a way that works for us. It's great that he's now taking your feelings into considerstion, you all are still early on in the relationship so it may just take some time to find what works for y'alls relationship. As long as he's considerate of your feelings and shows that he wants to work at it, I think it's worth a try.",
            "Each day that pass this sub gets worse with the \"dump him\" circlejerk",
            "I'm happy for you OP. It sounds like you both have your own challenges with communication (we all do), and mental health issues can make that even harder. \n\nI think you should be proud of yourself for having addressed an issue that was bothering you, and reflecting on how your communication may have made it difficult for him to hear you. I'm also happy for you that he seems to have heard you and is showing real change. \n\nMoving forward, I think it'd be great if you both could access therapy or counselling or other resources for your individual mental health, which absolutely puts an added stressor on a relationship as you noted.",
            "One thing that may help, and idk your insurance situation, but consider couple's therapy. Or even just separate therapists but talk about your relationship issues there. And open communication always helps. My partner and I have gotten through rough stuff and we both have serious mental health issues, and we did it by just being honest with each other. Like \"hey, x is kind of an issue and it upsets me\" and then explaining why it's a problem. And then obviously, the other person listening and retaining the information. Actively working towards mutual goals will save your relationship if you really want to be with this man.",
            "Been with my significant other for 13 years now and based on your post, it really does seem like he is very much interested in working it out with you.\n\nThat shows a special type of commitment which is very rare nowadays. \n\nHe is clearly committed to you and the relationship and I urge you to continue working together on this and all issues.\n\nIn the end, it will make your relationship all the better and stronger.\n\nKeep at it, no one said relationships are easy but those who put in the time and the work are often rewarded in the end with a solid, loving, experienced partnership. \n\nBest of luck to you both!!",
            "When I first started dating my now-fiance, we had similar problems. He would say, \"I'll come over sometime in the early evening,\" (which in my mind is circa 6pm), and then would come over at 9pm. Or he would say, \"I'll be at yours in an hour,\" then 70 minutes later, I'd call him to find out where the hell he was and he'd say, \"Sorry, I'll just be 20 min,\" then would come through my door 40 min later. And wonder why I was so pissed. I also did a lot of stonewalling, because I simply didn't know what to say. \n\nAfter months and years of arguing the exact definition of \"a little while\" or whether \"I am walking to the car\" should refer to \"walking in the car\" or \"intending to walk towards the car\"...my partner was diagnosed with ADHD. And we got him medication. And OH MY GOD HE IS NOW ON TIME. When he says, \"I will be home about 6,\" he walks through the door no later than 6:05. It's a revelation. But aside from his diagnosis, he proved himself by making the effort. When we finally sat down and had the conversation of how much his behaviour hurt me, he made an effort. He tried. He started being better. \n\nI can't promise your relationship will go the way you want it to, but I don't believe your relationship is doomed. Best wishes for you both.",
            "Op, the fact that he's made you feel like you're getting what you want by him actually doing *nothing* is the worst part of all of this. He's not actually changing any behavior....he's just going to text you to tell you that he's doing the thing you've asked him not to do.\n\nI've been with guys like this too and it's so sad for me to see another person going through this. As others have said, this is really a a self esteem issue. We should all, male and female, expect our partners to, at the very least, respect us. That means respecting each other's feelings, boundaries, *time* and body. That should be the bare minimum of your expectations of your boyfriend. \n\nHe's *saying* he gets it and will change but respect and love are verbs. They're things you *do*. He's not demonstrating that he respects you, that he's accountable or reliable. You deserves better and I hope you realize that.",
            ">Another big thing is that I realized I was behaving in emotionally manipulative ways as well—guilting, shaming, stonewalling. \n\n\nCongratulations OP.... he did the proven abuser trick to turn the whole thing one you and your emotions caused by his behavior.\n\nIt's manipulative to guilt someone when there is nothing to guilt them on. \nSomeone wasting your valuable life time, because he just doesn't care or can't be bothered to be considerate and being called out on it is NOT being manipulated or unjustifiably shamed! Nor is understandable anger over this. \n\nThe fuck OP?  Your dude is not the victim here, but the one doing the abuse. Your complaints and feeling about his behavior are valid. And if he feels shame and guilt for being called out that's a good thing, he should. Blaming these feelings on you however is an abuser tactic.",
            "Sounds like hes not really committed to anything, being more than an hour late? Unless traffic or flat tyre or something happened that needed urgentcattention... it just sounds like he cant be arsed... effort works both ways and if hes not willing to make the effort, its not worth the aggrivation. In any job or social event/meeting etc its not acceptable to be that late, he needs to up his game...",
            "I understand that you really love this person. However, you'd be doing a total abandonment of self to not research emotional manipulation and addiction. Not to mention highly sensitive people and they're struggle with differentiating the suffering of others and their responsibility to it because they feel so deeply\n\nThe man is 33. He ABSOLUTELY knows this upsets you and up until you acted like you may bail did he get upset about it. Unless he has a cognitive disability, he understands just fine,he just doesn't care....until it negatively impacts him.\n\nAND if you choose to stay with him...you'll 100% regret allowing him in your space to drink and smoke weed all day on your dime because that is what will happen.\n\nAnd if you don't believe me, google the outcomes of emotional manipulators and the research they did regarding stages of change and their movement through them. We aren't all special and unique snowflakes and this type of behavior is one of the most predictable traits in the species",
            "Lots of good stuff in those posts. I read through them before attempting to post a responsible response. I have been in similar situations and finally came to the conclusion that someone else did. The person is not worth the effort, you will not change them, so it comes down to this: you have a really poor self image.\nIf you don't see that, you need to read through all the posts again. Or guess what? Maybe you are not worth the trouble too.",
            "Do or do not, there is no try",
            "There is still an underlying problem he needs to deal with. OP says he grew up that way, ok, why? Did he count on someone that let him down day after day? Something else happen growing up that he is having a hard time and therefore the depression and excessive weed smoking? What's causing or triggering the depression? He might do well to talk to a professional and figure these things out. People usually listen more to outside sources more than the people around them.",
            "There is no relationship exists if one of the partners does not commit nor sincere to travel together going to one direction, and that is a willingness and a readiness to reach your goal, to be married for better or for worst.  \n\nIf he's not sincere nor willing to strengthen your relationship, be wise to discuss this matter seriously with him whether to go on or to stop it.\n\nIf he can't help himself because he is drawn in his vices, what to expect?  Open your eyes, or else you'll drown together into the pit of a messy life.\n\nThere is still time for you and him.  Talk about it with your heart and mind.",
            "Updated in the above to respond to the general mass \\^",
            "Yikes. Sod the therapy - why even suggest that?\n\nHe's 33 and you've been dating for a few months. He's an arsewipe, and won't change. He's even got you thinking You're part of the problem and wasting your precious time. Has zero respect for you, clearly no desire to be with you - in the early stages of a relationship he should be trying to get all the time he can, not leaving you outside in the dark, or turning up late. \n\nHe's not invested in a relationship with you and definitely not into you, move along!",
            "Sounds like he was never taught properly.  Sorry you have to play mommy and hold his hand but at least he is trying.  \n\nI have an issue being late for things that came directly from my family, I am generally on time now but I hate sitting around too so I am either on time or 5 mins late.",
            "I am not his therapist and this is not a diagnosis, but he might want to meet with a therapist to discuss whether he has Inattentive ADHD.",
            "I gotta say, people might still say hes not worth it. But the fact that you both realized you could do better and are both trying to do better- good on you guys. So many times you see these updates and its \"well everyone...we broke up...\" \nIm glad you guys found common ground and better ways to communicate. Hopefully he will also address the isses causing his depression and you guys can continue to grow together. Thats what this is all about right?\nBest of luck",
            "Just out of curiosity, where is he from, originally?",
            "Hey OP. Doubt you'll see this but I noticed alot of people making arguments to try and get you to leave your SO, and to be fair some of them made some decent points. I just wanted to say I am so happy you guys are working on your individual issues and working on your relationship issues together, growing as a couple. It always makes me so happy to see a couple improving and getting stronger. I truly hope you guys continue to improve and things continue to get better. Dont let all the negativity get you down or sway you to abandon your relationship. Only you can come to that conclusion and make that decision. But until you do, good for you guys for staying strong together :) I hope everything works out for the best for both of you!",
            "[deleted]",
            "Sounds like the majority of comments are full of self-righteous judgement, and lacking empathy and perspective.  You are both being honest and committed to progress - that's the start right there. Relationships take work and as long as there is meaningful progress, I personally would keep moving forward.  Honest communication and willingness to change are the keys.",
            "What is stonewalling?"
        ]
    },
    {
        "post_id": "bhl2z6",
        "author": "grootius",
        "title": "My(27M) wife (25F) is very unhappy and asks me to get rid of or stop doing the things I love to make her happy but it's never enough.",
        "url": "https://www.reddit.com/r/relationships/comments/bhl2z6/my27m_wife_25f_is_very_unhappy_and_asks_me_to_get/",
        "score": 2551,
        "num_comments": 703,
        "created_utc": 1556276943.0,
        "selftext": "I have no friends or family so I created an account to ask for help. \n\nMy wife and I have been together for 5 years married for 4, she had a bad marriage before me and had a child. I had no problem stepping up to the plate to help her raise her child (the father wants nothing to do with my wife or his kid)\n\nTo the point, I had 2 friends that I've had since I was 16, they were both female and I had dated one of them for 4 years but we split up agreeing that we made better friends then an actual couple. Which never happens in real life apparently. Shes always been my go for advice and I made our friendship 100% transparent for my wife when we first met and never hid anything. Out of habit my friend and I still said we loved each other but more if a platonic love. We both loved our current partners and never wanted anything between each other. However after a few years this took a toll on my wife and she asked me to stop telling her that I loved her. So I explained this to my friend and she said she understood and would have no problem doing so. \n\nAnother month or so I still have 100% transparency with my wife as to make her feel comfortable. I got deployed and my friend had just had her baby and asked me if I wanted to facetime to see her. I said yes naturally happy for her and her husband. After a nice chat and meeting her new son. I got a call from my wife a few days later asking if I had talked to her kn facetime. I told her that I had and why, also telling her what we had discussed. My wife then didnt talk to me the rest of my deployment. When I got home I explained that I was sorry it hurt her feelings and wanted to make things better. She told me to never talk to her again. I tried to explain that its was just a friendship and that neither of us wanted a relationship. \n\nMy wife took it upon herself to call her and tell her that if she didnt stop talking to me forever that she would tell my friends husband that we were having an affair.\n\nShe did not tell me any of this. I quickly noticed she had blocked me on everything, including my number. I had no idea what happened so I confronted my wife and she told me that she was certain I was cheating on her and that my friend and I were having an affair. She then told me that she had called her and only asked her to not talk to me anymore. I was slightly upset but stood by her decision and held no grudge. \n\nI feel like this event led to the breakdown of everything. She started to have no trust in anything I did, constantly going through my phone, and she would constantly lock her phone, or lock herself in the bathroom talking to someone on the phone. \n\nShe started blaming her job for her unhappiness, I told her that I could pull extra hours at work if she wanted to quit to find a new one. She quickly quit her job and made no attempt to find work agajn.\n\nI was enlisted at the time. She said she hated that I was gone all the time so I offered to go reserves to be with her more. She said that would fix it. So I got a civilian job that paid decent but we had to move. \n\nThe job is stressful and I'm not very fond of being a civilian. She has now come to the conclusion that I need to get out of the military and quit my civilian job and we to move again and that's the only way she'll be happy. \n\nI feel like I've given up everything for her to be happy, I'm trying to show her the logic that there is no way for us to survive if neither of us work.\n\nI love my wife and dont want a divorce but I feel like she will never be happy and I'm not sure how to fix it. She blames everything on me and says that I'd be happier with someone else or says shes leaving again.\n\nI'm currently deployed again and the last week I was home she wouldn't talk to me or spend time with me and our daughter. She would lock herself in the bedroom all day. Then at night she would call me names and say I dont care about her and I never spend time with her. \n\nIm very confused because I'm not the best with emotions, I'm a logical man and I see no logical answer here.\n\nAny thoughts or advice would be great. Thank you!\n\nTL:DR My wife is unhappy and refuses to do anything about it. She blames all of these problems on me, yet refuses to even let me try. She is constantly going through my phone or asking me if I'm cheating. She keeps asking me to give up the things I love in an attempt to make her happy",
        "permalink": "/r/relationships/comments/bhl2z6/my27m_wife_25f_is_very_unhappy_and_asks_me_to_get/",
        "comments": [
            "There is no logic. She is abusive, i know this is hard to hear but you need to leave. A partner should not ask you to give up your work, your friends, and everything you enjoy so they can be happy. I am sorry you are in this situation.",
            "It sounds like your wife has major issues regarding her jealously. \n\nI’m currently with someone who works away from home, up to two months at the longest. Without the trust between us, then it would be a nightmare. \n\nYour wife is making totally unreasonable requests that are purely out of jealously and nothing to do on your part. Her threatening to try and break up another happy marriage on what is essentially a lie, it also very distressing and is drama that is not needed. She also can’t make any demands about what you do for a living. I’m assuming you have been deployed throughout the entire relationship, or knew you were going to be, so she should have learned to cope with this fact. \n\nI say that either your wife acknowledges that she has a problem and tries to make a valiant effort to change, goes to therapy etc or that you should start thinking about how the relationship has run its course. \n\nI’m sorry you’re in this position. I wish you the best.",
            "It sounds like she needs professional help and rather than figure out why she is unhappy or what she can do about it she projecting her insecurities and anxieties on to you and trying to solve them by making you solve them. I would encourage her to see a therapist or start up couples counseling together before doing anything else. The more you enable her to externalize her feelings or give in to her demands, it means she won't learn to self soothe and will continue to escalate her demands of you.",
            "She's only 25 and she had a bad marriage before you? I assume (and hope) you two were together for at least a year before marrying and generally divorces take about a year so even given that extremely tight timeline, she was 22-21 ish when she got married for the first time and had a child that young? This person to me is showing that she's looking to a husband to fix her problems in life, which go much, much deeper than feeling jealous of a long time friend. \n\nHonestly, she sounds really lost and confused. She needs either serious help or Hapless Sucker Husband III.",
            "Thank you all for your advice I greatly appreciate it, for my first time wanting to talk to someone it was a massive load off my mind!\n\nYou've all been amazing, thank you.",
            "Your wife is a manipulative abuser. This behavior is probably why her daughter's father wants nothing to do with her. People like your wife are toxic, will isolate you from everyone and everything you love, and it will never be enough.\n\nYOUR behavior is not the problem.\n\nYou literally can't give up enough to \"make\" a person like this trust you or not act like this, because THEY are the problem. The more you give up, the worse they get. The more you try to coax, coddle, cajole and apologize/beg your way back in to their good graces, the worst they get.",
            "> My wife then didnt talk to me the rest of my deployment.\n\nShe fuckin' what now? I can't imagine loving someone who does something so petty and nasty. I do feel like she knew how to manipulate you, because she got you to apologise when you did nothing wrong. Again, we're talking about you having a call because a close friend of yours had a baby - that should be celebration time!\n\nYou're okay, this isn't your fault, because it's an abusive relationship in which you're the victim. However, only you can take control of your situation and get out of there.",
            "Maybe her ex doesn’t communicate with her for a reason.... she is being unreasonable and you are being a pushover. If you leave now, you’ll be much happier two years from now.",
            "Your wife is controlling and manipulative and abusive.  Nothing you do will ever be enough.\n\nYou need a divorce attorney.  In the meantime, separate your finances as much as possible.  And ignore what she wants you to do with your career and personal life.  Stop making your decisions based on fear of your wife being upset or angry.  Follow what gives you joy.",
            ">My wife then didnt talk to me the rest of my deployment.\n\nyeah,thats it. You need to get out man. This is an endless sinkhole that will absorb you until there is nothing left.\n\n&#x200B;\n\nRUN.",
            ">My wife took it upon herself to call her and tell her that if she didn't stop talking to me forever that she would tell my friends husband that we were having an affair\n\nI almost stopped reading there. Wife or not, she doesn't get to tell you that you aren't allowed to have friends. That's a classic isolation technique, straight out of the abuser's handbook.\n\n>She started to have no trust in anything I did, constantly going through my phone, and she would constantly lock her phone, or lock herself in the bathroom talking to someone on the phone.\n\nHmm, almost sounds like she was cheating, and projecting her guilt onto you. Why did you not put a stop to that behavior, since she did it to you first? You should have demanded to see her phone and know exactly who she was talking to.\n\n>She quickly quit her job and made no attempt to find work again.\n\nThat was a huge mistake.\n\n>I'm currently deployed again and the last week I was home she wouldn't talk to me or spend time with me and our daughter. She would lock herself in the bedroom all day. Then at night she would call me names and say I don't care about her and I never spend time with her.\n\nMore manipulative behavior. I'm actually sad for you that \\*there's a child involved, and I'm sad for your daughter that she's going to grow up learning this kind of awful behavior from her mother, and thinking that this is what a normal relationship is like.\n\nYou need to divorce her, yesterday.\n\nE: clarification",
            "Telling your ex that you were with for 4 years you love them while being married to someone else is pretty weird if you ask me.",
            "[removed]",
            "Your wife lies to you about important things. This is a deal breaker by itself.\n\nYour wife is controlling and borderline abusive (in that she's started to isolate you, is unreasonably jealous and uses emotional abuse to get you to toe the line). She's also potentially cheating on you, between accusing you of cheating and acting very secretively.\n\nAsk yourself is this the life you want? This won't get better unless something changes and it sounds like she's completely checked out of the relationship. To the point where she's not even in the same room as you. Dude seriously at this point is this someone worthy of a relationship with you? She hasn't dealt with any of these issues except with lying, evading and controlling.\n\nRun. file for divorce and gtfo.",
            "Dear OP,\n\nYou’re inside a controlling / abusive relationship.\nI’ve been thru that myself, abandoning my own family, my close friends, my values... for her.\n\nLet me tell you, it’s never enough until she breaks you into pieces it will take you years to get back together. You are her toy... this is not love, this is something else.\n\nLeave, just leave... Go for therapy to get help in the process, and freaking get a lawyer asap! Those people turns into blood thirsty animals when confronted with divorce.\n\nTake care OP.",
            "Get a divorce. These deployment relationships are hard enough if the people get along and treat each other well. End this and chalk it up to youthful mistakes.\n\nYou may want to consider not getting remarried until after you are done being deployed or are no longer mobile",
            "\\> (the father wants nothing to do with my wife or his kid)\n\n&#x200B;\n\nThis is because your wife is insane.",
            "Honestly from what you say she sounds incredibly manipulative and controlling. \n\nYou should be able to have female friends without your wife getting upset - she should trust you and respect you to believe you when you say that the relationship with your friend is strictly platonic. \n\nAlso, the fact that she holds **communication** (with herself as well as with your *daughter*) as essentially ransom while you're deployed is next level wacko. Regardless of what happens, you should still be able to talk to your family, and her holding that over your head and taking it away is very manipulative.\n\nIf everything you're saying is true and you still want to be married to your wife, I really would recommend marriage counseling to focus on communication between you and her. \n\nI can't reiterate enough how problematic it is that she thinks it's okay to revoke communication with her and your daughter while you're deployed. That's a major issue that needs to be addressed. \n\nShe has made you change your job, change where you live, and has made you change who you're friends with. What's next? Where do you draw the line?",
            "Hi, I dunno what services there are for you in the forces, but it might be worth asking to talk to someone about domestic abuse. Your wife is doing things no partner should ever force them to do. Don't try to find logic in what makes her tick or do what she's doing because you will never find any. You should not be subjected to being name called, and nor should her daughter be subjected to her behaviour either, its going to be incredibly damaging to you both.\n\n&#x200B;\n\nYou should not need to give the things you love like hobbies or friends for a partner without good reason and her paranoia and self esteem issues are not your fault. You wont ever be good enough for her until you're isolated and trapped in your own home. Please do not let it get to that. Seek out a lawyer and therapy if you can.",
            "My SO has an ex-ish person whom he still talks to and clearly deeply cares for. I didn't handle this so well at first. My previous ex cheated on me repeatedly, another ex had a similar friend whom he later admitted to being in love with, so I've got some baggage there. My SO and I had some pretty heated discussions about it. Like you seem to be-- he was very understanding of my perspective and just calmly reasserted his and that I had nothing to be worried about. Initially I reacted in a way I'm not proud of but I then slept on it and resolved to lean towards trust. I trust him in a way I knew never to trust my ex. I even offered to befriend his friend myself. Because that's what healthy love is. She's important to him as a friend and I would never ask him to give up someone like that just because I feel uncomfortable jealousy. There have to be boundaries, sure, like the \"I love you\" thing is a definite no go you maybe should have figured out for yourself without being asked. But the way your girl is acting is not ok. It's abusive. I empathize with her. Anxiety, depression, jealousy, insecurity. She must feel it even more so when you're deployed. But none of that makes abuse ok. She withholds her love from you and that's a very clear manipulation tactic. Unless your SO seeks therapy I don't think there's anything else you can really do here.",
            "My wife used to do this. We met while I was working abroad. She complained endlessly that I earned an ex pat salary while she was a local. We moved to New York, she hated it. We moved to England, she hated it. We moved to Scotland, where I'm from. She hated it. So she moved to England and me and the kids celebrated. Tell her to fuck off, life is to short to sit on the end of someone else's leash",
            "Mil here. She doesn't sound stable to be a military spouse. She's making you cut ties with your friend who had a baby. She's not working. She even told you that you're not seeing her enough so to get a civilian job. She's toxic and abusive and you need to leave. If you're still interested in the military, re enlist as a full time career again, don't get stuck doing a desk job for some person who made you cut ties with a very important person in your life (your friend). I found it so selfish and immature that she refused to talk to you for the rest of your deployment because you face timed your friend's baby. Deployment is really hard and sometimes all you need is your spouse when it gets really rough out there.\n\nI also suggest finding some way to contact you friend as well to amend things and explain it was your wife's fault.\n\nA supervisor once taught me about projecting as well, it sounds like shes cheating if she's going through your phone. She didn't even talk to you for the rest of your deployment so she probably had a jody while you were gone and then started taking it out on you when you got back by searching your phone. Then to get rid of suspicion, makes you work a 9-5 job",
            "Wow.  That sounds incredibly demoralizing.  I think you're insightful to realize this a pattern, and she will keep doing this.  I think therapy is your only option.  It should be non-negotiable.  If she refuses, you may have to cut your losses and get out.",
            "While most users are stating that it’s a likely possibility your wife is cheating on you, I want to offer a different perspective.\n\nTo me, it sounds like your wife has depression and/or bipolar disorder. The lack of motivation/enthusiasm she has for her own life/loved ones (you,  your children) could definitely be attributed to that. The sudden resignation from her career is also a sign of depression/bipolar disorder. It’s not your fault at all, so please don’t blame yourself! This sounds like an underlying issue regarding her mental state, and she’s taking it out on you and shutting you out as a possible coping mechanism. A lot of the time, those with depression will push others away and subconsciously prevent their own happiness/well-being. \n\nAs far as trust/jealousy, that can be attributed to bipolar disorder as well. The highs, the lows, the impulsive behavior (her threatening your friend, blocking you, quitting her job) and the overall low self-esteem. I understand why she’s on edge regarding your friend that you previously had a LTR with. The sheer fact alone that you shared intimacy with that friend and had a serious relationship with her, would make a majority of partners concerned. Also, please don’t tell an ex you “love them”, IMO, that’s unnecessary and will of course make your partner uneasy, even if the friendship is strictly platonic.\n\nThis doesn’t by any means excuse her behavior towards you and your friend, it just offers a different possibility of why she may have acted out in these ways. If you’re wanting to mend your relationship, I would suggest having a discussion with your wife and bring up seeing a psychiatrist/psychologist to address her possible mental disorders. \n\nAlso, out of curiosity, do you know why her previous marriage failed? That could offer a *huge* explanation as well if she was cheated on or experienced a similar situation regarding her last partner having female friends that were, well, *more* than friends.\n\nGood luck OP, and regardless of anyone’s opinions, do what is best for **YOU**.",
            "Jesus, if I married someone and they still said they loved their ex-partner I'd react like this. I'd never trust them again, it sure seems like you were having an affair, even if it was just emotional. On the wife's side, poor woman.",
            "I think that if you don't want to be married to someone in the military who is friends with his ex-girlfriend, you don't marry someone who is in the military who is friends with his ex-girlfriend. \n\nYour wife knew what your deal was when she agreed to marry you. It's wrong of her to ask you to make major changes now. \n\nI agree with you that unless your wife makes significant personal changes that it's unlikely she will ever find happiness because she is blaming what is wrong in her life on everyone else. \n\nI'm married and I'm pro saving a marriage if it's at all possible, but for that to work both people have to be in agreement that they are going to try. You haven't shown us any examples of your wife working to save this relationship.\n\nPersonally I feel that you need to walk away now. You shouldn't have to live in a home with someone who is emotionally abusing you.",
            "[removed]",
            "Being best friends with an ex Does happen.\n\nI love my ex husband,  but we were miserable together. He is now remarried.  I have Thanksgiving at their house (that he and I bought together) almost every year.   \n\nHis wife has no issue with this. No, its not an open marriage.  She knows he loves her and that all we are is friends.\n\nWhat your wife is doing is abuse.  She is separating you from your friends.  That's usually the first step. It will only get worse.",
            "She has deeper seated issues that are not being tackled. Go see a marriage councillor as soon as you can. If she won't come with, go alone.",
            "Your wife is controlling and emotionally and mentally abusive. You need to leave. She is literally isolating you from everyone and everything you find important. Frankly, I would question whether her version of events of her previous marriage are entirely accurate.",
            "Your wife's reaction was a red flag but so is your behavior. I would not want to be in a relationship with a man who was regularly telling a former lover that he loved her. It doesn't matter if you mean it in a platonic way. It's just way too close and emotionally intimate for my taste. Yes, you stopped it to be considerate of her feelings but I don't think you two are compatible in the long run anyway. You need to find someone who is fine with you having close female friends.",
            "Brother, I am so very sorry.  There is no happy ending to this story.  Your wife is abusing you emotionally, breaking up your friendships, and continuously blames you for everything.  This is a deep personality issue that is really not solvable.  If you accede to her next request to change your job and move she will have a new request.  She does not need any thing specific like a certain salary or a certain lifestyle.  What she needs is power over other people, and to be sure she has that power she has to jerk the people around frequently.   \\*\\*You cannot help her.\\*\\*  It's time to leave,heal, and create the good life you deserve.",
            "Dude, you are in an abusive relationship. You need to get out as soon as possible.",
            "[removed]",
            "Bro you're letting her manipulate you and run your life. Get out and be your own person. A relationship is about trust and compromise I see neither",
            "***your wife is never going to be happy.*** we're not talking about her asking you to do a few more chores or spend a few less hours reading/watching tv/playing video games so you could have dedicated date or hangout times. those are reasonable requests from a frustrated partner. there is literally nothing you could do that would keep her happy. \n\nthis is not a YOU problem. your wife sounds like a person who is deeply unhappy with WHO and WHERE she is in life. this isn't healthy for either of you, and unfortunately the best thing for YOU in this situation is probably to leave. next time she threatens to leave, let her. go back active duty if that's what made you feel the most happy and successful in life. \n\ni am pretty sure there are resources out there to help you, friend. maybe talk to a trusted CO or fellow servicemember. you may feel like you're giving up on her--but you can't make someone this deeply unhappy be happy again. they have to do their own therapy, their own self-searching to find a way to be happy in life.\n\nyou deserve to be happy, or at least content with the life you're leading. you don't deserve to constantly be confused, to be guilt tripped for something you can't control. get out. free yourself.",
            "There are so many red flags here... she’s isolating you, has zero trust in you for no reason, and she’s manipulating you. I know you don’t want divorce but she literally tried to sabotage one of your best friend’s marriage in order to get you to not talk to her anymore. And she did this behind your back. This is not a healthy marriage.",
            "> My wife took it upon herself to call her and tell her that if she didnt stop talking to me forever that she would tell my friends husband that we were having an affair.\n\nThat's the point I would have been done. \n\nInsecurities and jealousies are perfectly normal and most people have them. There is nothing wrong with asking your partner to set reasonable boundaries, but to go behind your back and sabotage your longest friendship is incredibly selfish and just plain mean. I don't say this lightly but your wife sounds abusive and controlling.",
            "my mans. get out of there. you deserve better.",
            "She's an abusive person. You have sacrificed a lot for her. But she has a problem.",
            "She is abusing you and you need to leave. She doesn't care about your happiness and you matter just as much as her. Leave her asap. You will be better for it and happier for it.",
            " There's an old saying my grandma told me. \"Thieves lock their doors.\" I don't think about cheating because I don't cheat, but my friend who has always checks up on his girlfriends and reminds me to be aware. Not saying that's the case but please consider it. \n\n The other thing is she has learned she can get a lot of attention if she complains. That needs to change. There's a power imbalance and you need to calmly say no more often. You have the right to have a female friend. She married a man with a platonic female friend not a unicorn it happens. she'll cry and be a brat. It's very hard but. Don't feed into it and I really hope you guys work it out.",
            "Sounds like BPD. I’d give it a good internet search. Sounds like you need couples therapy.",
            "I think you already know you need to get divorced and just need to see someone else say it.\n\nGet divorced.",
            "My parents are like this. It affected me, I've had years of therapy to learn how to be healthy emotionally. My mom lies, manipulates, and does insane stuff to control my dad. I asked him to divorce her when I was younger, Im 38 now. This isn't just about you, you have a daughter. She is watching your relationship and will mirror that in her adult life. I did until I finally wanted something healthy and sought therapy. Read the book codependent no more by Melody Beattie",
            "Stop telling another woman you love her. She had a husband for that now. I see why your wife is mad. It's in her eyes a constant competition. And honestly, you dated this woman too. I think it's time to take a set back from being bff's with this woman to try and make your wife feel wanted.",
            "I know it's common for Reddit to come on here and say break up.. but god damn that's SO NEEDED here.\n\nShe's abusive and not in a way she'll ever really see the light. She's manipulative and is closing you off from the outside world so all you have is her.\n\nRun.\n\nFast.",
            "A lot of people are saying your wife is being unreasonable. Or abusive. Or must be cheating since she was worried you were.\n\nIn a different take, I don't see her as unreasonable. Is she reacting well? Is she being as mature as a person can be? No.\n\nBut her reactions aren't irrational or unreasonable.\n\nShe has problems with you being close friends with an ex-girlfriend who you continued to say \"I love you\" to after you were married.\n\nNormal.\n\nShe found out that she's really not okay with being a military wife, left at home while her husband is deployed, and has discovered that this makes her unhappy.\n\nNormal.\n\nWhat she IS doing is struggling to properly work through this, with you, in a constructive way. Which I suppose leaves that to you, if you want to save the relationship.\n\nFirst, recognise that any relationship with an ex is going to be a minefield with your current partner. Your wife shouldn't have to tell you that saying \"I love you\" to a former longterm girlfriend makes her uncomfortable. Have a brain.\n\nSecond, recognise that being a military wife is hard. Long distance relationships are hard. Relationships with people who travel a lot for work are hard. And relationships where your partner puts themselves in harm's way are hard.\n\nFinally, people don't always sufficiently anticipate the toll these things take on them. They might say \"this is fine\" at first, but it's not that easy.\n\nNone of this requires you to be 'the best with emotions'. This is all logical.\n\nSo when she tells you that your continuing relationship with her ex makes her uncomfortable, or that your continued involvement in the military is something that keeps her from finding happiness with you ... treat that as a statement of fact. Not an emotional reaction. These are normal things that you might find with any number of potential partners.\n\nThat all said, it sounds like she doesn't deal with these emotions constructively and instead expresses them in harmful ways. This is unhelpful, but not necessarily that abnormal. You're both young, and your wife appears to have entered her second marriage at 21 ... diving into commitment fast and then regretting it seems to be a pattern.\n\nWhile it feels like a tired answer, both you and your wife need therapy to get through this (either together or alone). Neither of you seem to be making an attempt to understand what makes each other tick, or trying to build a life that makes each other happy.\n\n(I know you say you are, but seriously dude. You had to be told that saying \"I love you\" to an ex was not okay? You managed to do this regularly for a few years without noticing that it made your wife uncomfortable? How many hints do you think you missed?)",
            "25 and already on the 4th year of her SECOND marriage, with a kid from the first? That's so strange where I come from.",
            "[removed]",
            "Oh sorry, that makes a lot of sense actually! Damn that makes a whole lot of sense!",
            "Oh, how I have been in your shoes with the friend.  I'm afraid to say that once this kind of thing happens, it's extremely hard to overcome.  Trust goes 2 ways and if one side can't keep up, the other falls apart as well.\n\nMy husband and I went through something similar over the past couple of years.  I have never and have no intention of ever cheating on him at any level in any form.  I'll forgo the very long story and keep only the relevant.  \n\nHe had never been jealous, until this one kid came around.  He was half my age, struggling with addiction and already in legal trouble.  We became quite close.  In spite of the age difference, we were good friends and had a good time together.  But there was also a parental component as well as a spiritual one.  \n\nFast forward, my husband decided he didn't really like it.  He waited months until he said so, letting it swirl in his head to all sorts of potential scenarios.  We went back & forth for a year.  I should have just cut the kid off and leave him to the world, but I just couldn't.  I backed off a bit, a bit more, a bit more...  I was also completely transparent.  We were never alone. At least my kids were around.  They enjoyed him.  He was basically a kid.  I let my husband see everything and he was never excluded.   But the fact is, he had already decided and I soon realized there was nothing that would change his outlook.  He never flat out accused me of cheating and said he didn't believe I had or would.  But it didn't matter.  He didn't trust me and he didn't make the effort to try.  \n\nMany months later, things are status quo.  We are going about our lives, out of sight out of mind.  But there is tension in our home and our marriage.  He showed me that he didn't trust me.  That he thought I was capable of things that go against who I am.  Nothing I have ever done in the past or the present would have given indication this was something I could do.  But that he saw me that way hurt me so bad.  I was acutely aware of everything I did, concerned that he would read something into it.  I felt like a grounded teenager.  Because he clearly didn't even know who I am put a wedge between us and made me lose trust in him.  I didn't trust him not to assume or spy or snoop.  I'm resentful towards him.  He took something good that I was trying to do (which he's seen me do plenty of times.  This is not the first broken person I've taken under my wing.) and turned it into something sinister.  \n\nI'll encourage you to consider how you feel about your wife now.  Will you forever resent her for what she's doing now?  Will you ever be comfortable believing that she trusts you, or will you constantly be looking over your shoulder wondering what she's thinking and what she's probably convincing herself?  Do you want to defend everything you do forever?  Because even if she never brings it up again, you might.",
            "I’m sure it’s been said everywhere else - but it doesn’t seem like this relationship is healthy or working out for either of you, OP. \n\nI was once the type of partner who was overly paranoid about my bf having female friends because of my insecurity. I wrongfully had a previous partner get rid of his female friends because of *me*. I forced him to conform to my ideas of happiness simply because I was scared of losing him and because I saw everyone as potential competition. Including his friends.\n\nAfter our break up, it was very clear that I was emotionally and mentally abusive. I couldn’t even begin to understand what he went through. But I know I am sorry for it and that I would never want anyone to go through that again. And I will never really know how he felt throughout the relationship since we were both very bad at communicating our own feelings and being open. \n\nMy best advice probably isn’t what you want. I would say you two need to certainly have a sit down conversation about your boundaries and about the fact that she simply doesn’t trust you. It seems like you’re her “possession”, not her husband and step-father to her child. You provide for your family while she doesn’t seem to want to reciprocate. \n\nIf she doesn’t want to compromise and work things out with you, maybe this isn’t a relationship to stay in. I understand that you’re married and you may even have a good relationship with her son, but in the end, if you two aren’t happy, trusting and able to communicate and compromise? It won’t work.",
            "Divorce her. \nYou will never be trusted and that is the foundation of any relationship.  \nDivorce her and move on. \nD I V O R C E H E R.",
            "This is disgusting. Leave her.",
            "She's cheating on you. I'm 99% sure. This is how people who are cheating act. She's on her phone constantly and started locking it all the time and being super paranoid about you cheating. Confront her on this calmly before it gets worse. Good luck",
            "She is unhappy because she doesnt want to be with you and instead of accepting that she puts the blame on you and figures that since she was happy with you once before, the problem must be that you are the one who isnt the same rather than she is the one who lost her feelings. \n\nI highly suggest you have a very honest chat with your wife and ask her if she's lost feelings for you and the like. \n\nI just ended a 2 year relationship, i was beyond jealous of everything, so angry and so unhappy, and it was because i couldnt accept that i needed to leave because the life we had together didnt make me happy anymore. And when you feel you are going against your own grain, it really fucks with your head. \n\nSTOP CHANGING FOR HER. You are the ONLY thing on this planet that lives for you, do not give that power to someone else, even a spouse. It is up to you to control your life and ensure you dont get run over by others. Having a wife doesnt mean losing your life as she becomes the only thing you can love. \n\nI have a bestfriend of 13 years who's the opposite sex, my ex was very jealous of him, but my best friend is the one who's still in my life, not my ex. Remember that. Connections are valuable in life, it's what humans live for.",
            "Part of this reminds me of my Dad. He has chronic depression and is also possibly bi-polar (he didn't get diagnosed with this before he and my mom split, but I found medication for bi-polar the one time I visited him). Everything was everyone else fault. He wasn't happy because my mom was overweight. If she tried to talk to him and tell him he needed help, he'd pull the silent treatment (record of not talking to her is at least 3 weeks). He'd act like a child if he didn't get his way (ex: I was playing a videogame and he had his dinner ready to eat and wanted to watch TV. I wanted to finish my game, and instead of just eating and watching me play, he sat there and complained, didn't eat, and then complained that he food was cold now when I was done. He actually threatened to not pay for college over me not getting off the TV right away. That was cool.). \n\nYour wife needs therapy at the least. Possibly medication. No healthy person constantly asks their SO to constantly drop things that they enjoy. \n\n>She started to have no trust in anything I did, constantly going >through my phone, and she would constantly lock her phone, or lock herself in the bathroom talking to someone on the phone. \n\nThis makes me think she's cheating and is projecting it on you. Like this is a huge red flag to me. She obviously has something she's hiding and thinks you do as well (hence the accusations of an affair).",
            "She has to be happy with herself to find any happiness at all.  You can't fix that, a change of scenery can't fix that and a job won't fix that.  She sounds depressed and sounds like she needs therapy.  Don't try to fix it because you can't.  Stop making sacrifices because it isn't helping her it just hurts you.  Making her happy sounds like it's beyond your control.",
            "She cheating on you dog",
            "It seems to me that she is probably cheating on you. She is definitely abusive mentally. But people who cheat typically do projection (always saying that you're cheating on me when in reality they are cheating on you.), has her phone locked down, locks you out when she's on the phone.",
            "Totally feels like she cheated on you and is guilty and is blaming other things than herself.",
            "This didn't scream \"I'm cheating on you\" to me but possibly some mental health concerns. Obligatory I'm not a doctor but a lot of what was described strikes me as being consistent with some BPD traits.",
            "Don't light yourself on fire to keep someone warm. Sorry bud, you seem very caring and dedicated. You can find someone who will love you and your friends. Your friends are an extension of you.",
            "\\> I feel like she will never be happy and I'm not sure how to fix it\n\nThis isn't your problem, it's hers. If she isn't happy, she needs to figure out why and what needs changing. You might help her (once she knows what she must do), but it's her problem, not yours. She might tell you that she knows exactly what \\_you\\_ need to do to make her happy, but if you don't believe she's doing the right thing, demand an outside opinion (therapist / professional help).\n\nIt took me 15 years to figure this out, I hope it won't take you that long.",
            "Believe me when I tell you spouse abuse goes both ways get out before it's to late",
            "It may have been said already, but if she’s not willing to go to therapy then there’s only one conversation that can happen. I wish you the best and thank you for your service to our country.",
            "I'm baffled you stayed with her this long.\n\nIf it was me, I'd leave without a doubt. She's crazy controlling and has done multiple things that cross the line for me. Just so you know, I say \"I love you\" to all my friends, male or female, including a few I've dated in the past. There's no way I'd stop doing that for anyone. \n\nIt's up to you if you want to be controlled. But know real love doesn't try to put a chain around your neck and make demands that you change yourself.",
            "Your wife is projecting. Checking your phone but locking hers? Forcing no contact between you and your friend BC you face timed her ( to see her baby!!) And then locking herself away and talking to someone else for hours at a time. Do you know what she is doing while your deployed? I hate to say it but alot of this adds up to your wife having an affair and twisting it to be your fault. This sounds like a horrible way to live. Your still in your 20's but this sounds like you're married for decades. Leave while you still can go, maybe even go for custody of the child because there is no way she isn't emotionally absuing that kid like this too",
            "You need to go, man. She's being abusive. By forcing you away from your friends and military family she's isolating you from any support. This is text book.",
            "Would she go to couples counseling? Would you go? Her issues with trust and her unhappiness are going to continue to take a toll on you and your marriage. You can’t keep giving into all her demands when none of it makes you happy. Both of you have to be happy to make your marriage successful. Even if you do t want to, you might find yourself resenting her. If she cannot trust you, how is this marriage going to work? You are not her wayward teenage son. You are her husband. Going through your phone to check on you is not okay. \n\nQuestion: have you adopted your daughter? Or is that not possible? I ask because if she won’t work on her issues, I’m somewhat worried she could hold access to her over your head.",
            "The fact that she went behind your back and threatened your friend shows she has some serious trust and insecurity issues. That’s not a healthy or stable behavior and should be taken seriously. If you have been 100% transparent, then your wife has no reason to accuse or threaten anyone. It sounds like she needs a lot of help from a professional, and you should look into possibly separating until she has a better handle on her emotions.",
            "Youre wife is 100%, no question using you. In more than one way to boot. You are bankrolling her. She has all day and every day to find something that makes her happy, but she hasnt. Instead she chooses to emotionally abuse you and neglect her child. \n\nI know you sai you dont want a divorce, but there isnt a easy way to fix this. Atleast without immediate and drastic professional intervention. Even then, there are no guarantees. Have you talked to her ex? was she always like this or is this new behaviour? Im inclined to beleive there is a reason he wants nothing to do with her.\n\nPlease consider that you have alot of worth and deserve far better than what she is giving you. Its time to put your foot down my guy. Its not too late to fix this but this is quickly becoming a sunk cost falacy type scenario.",
            "She sounds depressive. She needs therapy. But if she's not going to take steps to make things better, you need to figure out what steps you need to take for yourself and your daughter. I can you tell this can go on forever - and get much worse.",
            "Op....dude.....this is straight on mental abuse. You have to divorce her. Don't let the stereotypes stop you. Just divorce her. \n\nIf she doesn't love you, then there is no point in staying with her.",
            "Well don't take this too bad, it was just a book. I read in a book written about intensive research on couples communications expressions pulses muscular contractions etc while having heated disagreements. The conclusion of the studies we're that trust was the only factor that determined the success of a marriage. You are both human and cannot be held as slaves, all servanthood must be voluntary and also helps, but trust is the key. \n\nI think it's better you've got a relationship with an outside woman than even having guy friends. My fiance and I hate isolation and let each other talk to the opposite sex even with affection because honestly there are 7 billion people in the world and we can't avoid them all unless we raise socially handicapped depressed children. \n\nWe both feel our mortality at 30, and we're just going to trust each other while we enjoy life. Our only boundary is not to have a child with another person, and we take each other on the honor system. There's really no other way we can control each other without becoming tyrrants. \n\nHonestly from my experience, my dad spent his whole life trying to please my depressed mother without taking her to get medication and all she did was tell him he was stupid and wrong his whole life for everything he did and said. He told me one day how disappointed he was about life, and I told him it wasn't worth it for him to be married to her and not even for me to be born having to grow up in that environment and suffer from social retardation which I've never overcome. \n\nI really don't know how to get her to trust you after all you've done.\n\nSounds like she loves you enough to miss you at deployment. Not sure how military relationships work. I'm sure you'll come up with something creative to get her to trust you.",
            "[removed]",
            "I mean the making you leave the military, get a civilian job, etc is crazy.\nThe not working not my thing but some people enjoy being a stay at home mom.\nAs for the relationship with your \"friend\" would not be comfortable with my husband telling another woman that he was with for FOUR YEARS that he loves her. I don't care how platonically you ended it you were together for 4 years. The fact that that was even a thing that you thought was okay is so weird to me. She thinks you're cheating. She's completely convinced that you're cheating on her so she's cutting you off emotionally so that she can leave you. I can almost guarantee that she's looking for employment and maybe even her own place which might be why her phone is locked. I would have assumed that you were cheating too. There's more then just physical cheating there's emotional cheating too. She found the Skype call and I'm going to guess she found something else that leads her to believe you're cheating while you were deployed. Emails, texts, or if she doesn't have access to your Skype while you were deployed then someone is telling her that something happened on that Skype call and that's why she asked if you two Skyped. Someone is telling her you're cheating and someone told her that something happened on that Skype call. Maybe instead of coming to Reddit go to counseling. Because I've been with cheaters they generally don't see anything wrong with their behavior. And I've been with a man who's ex wife was still actively in love with him. His ex wife did everything she could to make me believe he was cheating on me with her while feigning innocence to him.  I.E. sending me messages between them out of context, or telling me they just got off a 2 hour phone call where he professed his love to her and when I checked his call logs there was a 2 hour phone call and I couldn't bring myself to believe anything he said about what happened on said phone call or anything about their relationship that he told me. It sucked. We went to counseling. We figured it out. But I'm telling you either she already thought you two were cheating, or someone told her you were doing something nefarious with your ex (maybe even your ex).",
            "I'm sorry to say, but this is not going to change. Your marriage is dead, and it's time to take back your happiness. She is manipulative and awful to you. Make a new account on something, let your friend know that your wife is a liar, and that you'll be divorcing her for her lies and manipulations. Its gonna be ok. Hugs.",
            "Divorce your abusive and awful wife.  Only option for happiness man. Don't be scared.  Go talk to a lawyer.",
            "Divorce her before she's with you long enough to get part of your retirement.",
            "Get a new wife not a new life.",
            "I see so many people going against your wife, so I’ll give a separate point of view. I too would be uncomfortable if my husband was telling another woman he loves her, especially if they had history together. When your wife expressed how she felt I feel like that was the time to stop talking to your ex, but you didn’t, until your wife intervened, which at this point her trust of you was probably broken. Yes you and the other woman may have been friends in the past but you are both married to other people now. Saying that, Once trust is broken in a relationship it’s very hard to gain it back. Sometimes no matter what you do after, it’s never good enough to the person because they simply cannot learn to trust again and that can in turn leave you hurt as well. But anyways, I just wanted to give you another point of view, whatever happens I hope it all goes well.",
            "[removed]",
            "I'm going to lead with my advice.. seek couple's counseling. I think individual counseling for your wife would also be beneficial (it sounds to me like a significant mental disorder may be in play), but the two of you need to see a professional, pronto. \n\nI'm a mil spouse and I can't imagine going silent on my partner while he's deployed. That kind of separation is hard enough on a relationship without escalating it with a petty cold shoulder. It's very concerning to me that she would do this to you, as it goes beyond the intense jealousy she is obviously feeling and shows blatant disregard for your mental well-being. \n\nYou need to set boundaries for your friendships yourself and DO NOT allow your wife to cut you off from people. That is abuser behavior and cannot be tolerated. If you and your best friend are ok with not using the \"L\" word for your wife's sake, that's up to you. But you can't allow her to control the existence of that relationship. It isn't healthy, and you'll regret it.",
            "It’s strange that you are so close with an ex FaceTiming and etc. Definitely odd and I would have an issue with that. Since you are allowing this friendship of yours to get in the way of your marriage, I say you just end the marriage since it’s clear where your priorities lie. No married man should be that close to a female friend let alone one he dated.",
            "[deleted]",
            "You don't marry someone you've been dating for a year! You don't know this person.\n\nBut, you now know that this person is a terrible, cheating, manipulative, controlling, liar.\n\nYou need to get access to her phone, get evidence of her cheating (because she is), and go to Jag, and get a divorce. And, you need to pursue getting full custody of your daughter, because the chances of your wife 'not' using your daughter as bait and a source of manipulation are 0.",
            "Get therapy. No one with any self esteem would tolerate this nonsense. You owe your old friend a big apology for your cowardice.",
            "Bro she is definitely cheating on you!",
            "You caved too much and she doesn't respect you is what it sounds like. Now she's just manipulating for her own benefit. As a vet if my spouse ghosted me while in deployment you're divorced. That's one of the most stressful times for a soldier/Mariner/etc.. she doesn't care for your feeling at all if she did that.",
            "She's cheating on you",
            "She is cheating on you.",
            "Hey OP, my first instinct is to tell you to leave her because she sounds like someone who will ALWAYS find something to fight about. She is manipulative and is emotionally abusive. She seems to be making you miserable a lot of the time, no relationship is perfect but if its more negatives than positives then it's time to exit for sure.\n\nYou should have a long talk with her, tell her how you feel, and insist on joint counselling,  if she refuses then you definitely should leave.\n\nBeing deployed you really don' need the enotional roller coaster she's putting you on and shouldn't have to worry about an unhappy home life. \n\nBe safe out there and good luck!",
            "In my opinion, you really need to have a long talk with your wife about her past marriage, because it's obvious a lot of things from her past is playing a role in your relationship now..",
            "If she believes you had an affair with your friend, she's never going to become okay with you being away.  This is all the same single issue.  It sucks that one mistake of bad boundaries with a friend/ex caused all this, but it's irreparable at this point.  If she feels she got enough proof that you're a cheater, and she can't stand you being away for that reason .... It's up to you man.  That's a difficult situation.\n   \nAt least lay out the fact that this is only even possibly on the table if she starts working.  You'll want her working regardless of what happens.",
            "She doesn't trust you because she is cheating and in turn projecting that mindset onto you.",
            "I feel that its hard for a women to believe a man isn't cheating when he has a women friend. Completely uncomfortable and its hard to believe anything they say. So I agree she went about it the wrong way. Its almost hard to trust that a spouse with a friend of the opposite sex that he once dated for 4 years, it's hard to believe is interested in them anymore.",
            "Can you ask her to go to counseling with you? She may need individual therapy too. Her issues need to be addressed. As far as your female friends, a safe and reasonable boundary is to treat them as you would a male friends, no more, no less- I love you’s was crossing the line. And remember, once you have dated a friend, especially for 4 years, they are no longer just a friend-they are an ex.",
            "I feel you OP my ex wife is like this. I let it go on for too long and it ruined everything i had built for myself. Leave as soon as possible man",
            "A quote I just read from an ask reddit thread: \"Don't set yourself on fire to keep someone warm.\"\n\nIt was wrong and manipulative of your wife to threaten your friend. It was wrong and manipulative of your wife to constantly accuse you of cheating while exhibiting suspicious behaviors herself.\n\nMarriage counseling is a thing, but that's your decision.\n\nI'm sorry you lost one of your best friends to an insecure, controlling, manipulate, abusive, and possibly cheating wife. I wish the best for you.",
            "Why is it always the army guy who cannot see what is right in front of his face, and somehow ends up with a woman like this?",
            "Did you read your statement outloud to yourself? How is this not obvious to you that this is abusive?!",
            "Oh what a mess your wife has issues and you can’t allow her to cut off your friends. First tell your wife to get a job then maybe she’d have some business of her own to worry about. Second tell your wife to get therapy. She’s probably cheating and her side piece is who she wants and now she’s just making your life hell. If she doesn’t do any of this in six months take your child and leave. You can do bad all by yourself, it’s no longer about her and what she wants. Don’t allow her to bring you down.",
            "Sorry, she sounds mentally ill.",
            "I have a few thoughts that will make this post a little disjointed. Apologies for that! \n\n- Ask yourself this: ‘what would I say to my friend if she confided in me that her husband was treating her the exact way my wife treats me?’ You might find it’s easier to accept truths when you take this perspective. \n- I’ve also noticed throughout this thread that you’ve mentioned she acknowledges her insecurities. Remember. acknowledging is half the battle, but doing something to change it is the other half. Don’t simply take ‘it’s okay, she knows she’s got these issues’ as enough. It isn’t an excuse for behaviour. \n- Something pretty confronting I heard quite recently (confronting because it made me question how I approach certain situations) “if the behaviour has been accepted, people will continue to behave that way” in other words, if you’ve accepted her controlling, manipulative, insecure and jealous behaviours she knows she can get away with it and will continue this behaviour. This means that same way, some how you have to help her see that the way she treats you is unacceptable. I can understand that this may be the hardest thing you’ll have to do if she constantly has a victim mindset, but your choices are to continue to accept behaviour in order to not ‘poke the beast’ or expect change and go with the flow whatever that may look like. \n- on victim mindsets, it sounds like she’s had some things happen to her in her life that are pretty crappy. Even if she has BPD, this is an illness so firmly based on environmental factors. She needs to work on herself the most in order to learn how to be happy. Her happiness as her husband is partially your responsibility but in large part, it falls on her and what she’s willing to do to seek help for the things that she might have experienced. But this part isn’t your responsibility, your responsibility is to work on you. \nI actually feel for her in a way. If she can recognise that she isn’t content right now and hasn’t been for a long time, she must be feeling as though she’ll never be content and in that way, she’s searching hard for something to make her happy. This may come out by way of cheating, asking you to move heaven and earth and sacrifice everything in between, even self-sabotage because she just simply doesn’t know how to be happy. Not excusing the behaviour because what you’ve described just isn’t okay (you know this by now) but if you love your wife and want to make it work the way you say you do, there are ways to work on it.",
            "Im sorry but i think theres nothing else here for you to do, you did everything to cater to hwr happyness and on the way you gave up yours and your whole life, your life is more important than anybody, they are a priority not the boss of the relationship, you tried to make her happy but whenever you do, is never it, i think she just doesnt want to be happy at all, even if you love her too much, im sorry but thats just too much of a toll on yourself. What about her daughter? Why shes only thinking about herself and not her baby? Thats selfish right there, specially asking you to give up your job and friends.",
            "Dude, you are being abused. She’s textbook abusing you. She’s isolated you. She’s making demands. Nothing is ever good enough. \n\nI am willing to bet money she is also cheating on you. That’s why she’s so worried about friendships with you. \n\nCall your friends or find a way to get in touch with them and apologize that you let her get in the way. \n\nDump her abusive ass like a hot potato.",
            "While you're doing everything, what does she do for her happiness?\n\nI would suggest to find a better partner, you have a lot to offer, find someone who can reciprocitate. You deserve that.",
            "Don't just have an argument ..have a plan. Approach this in a logical fashion, not with emotionally charged rage etc \n\nSit down with yourself and think about how you would leave her if you should need to. How would you redirect a salary to a private bank account she has no access to? Do you need to set up that account, how much time will it take your employer to do that? If you have a lease can you remove yourself from it?  Don't just storm off know where you're going. Planning an exit strategy is always better than flying blind. Does she have any access to your email or cellphone bill online? fix that. Change passwords on EVERYTHING.\n\n&#x200B;\n\nAfter that..now that you ( hopefully have a \"life boat\" plan ) now your ready to move onto the offensive and sit her down an tell her that your leaving unless she (a) unlocks her phone and gives it to you to inspect OR you you put a pin number on yours and say you will not let her examine your phone unless its reciprocal. (b) Tell her that you ARE going to have a friendly relationship with your old friend and that she has to call and repair the damage she caused (c) Tell her that the next time she tells you to leave, that you will.  If she refuses any of the above then put your exit plan into action.\n\n&#x200B;\n\nYou will have to pay alimony for 5 years but if you go past 10 years of marriage then you have to pay her for the lifetime so better to resolve this earlier rather than later.",
            "You probably don't want to hear this, but you are being abused. You honestly should leave her because behavior like that will not stop. If you don't want to do that, then sit her down and talk to her. The fact that she has made you excommunicate everyone but her in your life is completely abusive",
            "She is abusing you. Full stop.\n\nShe isolated you from your support system. She holds her wellbeing as hostage because you are a good person who wants the best for her.\n\nShe is taking advantage of that.\n\nShe is abusing you.\n\nLawyer up, and divorce her. Document everything. Give her no sign of this, because she will ramp up the abuse.\n\nPlease. Nothing you ever do will make her happy. She will forever move the goal posts, because in the end, abuse is about power and control. She has power over you, and she is in control of your life.\n\nThis will not change unless you take action to escape from her. Please. Please. For your sake, for your health, run.\n\nThis is the environment your child will grow up in. Nothing your child ever does will be enough, your kid will forever have to \"earn\" their mother's love.\n\nLawyer up, and run. Please.",
            "She's cheating on you and projecting, all while trying to control your life. She´s toxic, get a lawyer and a divorce or get ready to be treated like this for the rest of your life.",
            "PLEASE UNDERSTAND - THIS IS NOT YOUR FAULT. I have been through something very similar and you need to know that you have done nothing wrong. Your wife needs counselling and ongoing help to deal with something in her past that is causing her issues. You need to look after YOU, get some counselling yourself or find some support before her actions affect the rest of your life (speaking from direct experience).",
            "I’m sorry for your situation it’s hard to love someone who is abusive. Make no mistake she is abusing you. Do not give up your work to make someone else happy in the end you will resent her and it probably won’t work out anyway. You will have lost the thing that you love and I’m not talking about your wife. We all make compromises in relationships but there are times when you have to say “no this is something I will not compromise.” I know you love her but love yourself enough to see what you are really going through. Ask yourself is she really worth what you are going through? Use this time on your deployment to get some space from the situation, and to really think if this is something you want to continue to deal with for the rest of your life. If she will not acknowledge that she has fault and maybe needs therapy you will have your answer. You have survived deployment you will survive this and possibly the end of your marriage. You are strong don’t allow anyone to break you down or make you feel like you are less than.",
            "It's not you that needed to change.  Your wife's insecurity is the root of the issue and she refuses to take responsibility for her baggage.  The manipulation, abuse, and control issues all stem from that.  She needs to confront her issues and get help.\n\nNothing *you* do will ever be enough because *you* aren't the problem.",
            "She sounds like so much work. I'm exhausted just reading this. Ask yourself what you want out of a marriage and whether or not she is it. If she is, I highly suggest marriage counseling and personal counseling for you both individually. Theres some kind of issue on her part in this scenario that isnt just a basic self esteem issue. If shes not what you want out of a marriage and you dont think one or both of you would be willing to put in the work then I would leave and go beg for your friendships back.",
            "And it's not going to get better. She's unhappy and rather than change herself, she's fallen into the trap that believes if only everyone and things around her would change (her partner, her house, her wardrobe, the city she lives in, her car, etc were different) she would be happier. Yet wherever she goes, there she'll  be because she's blind to the fact that her happiness will only be found internally. \n\nBeing an army wife is hard but she chose it when she chose you. If military life suits you, don't leave it. Re-adjusting to civilian life if you don't truly want it for yourself will be a nightmare.\n\nYour wife needs therapy. I suggest getting started on BetterHelp. It's pretty affordable and super accessible as it's done via app. \n\nSecondly, I think giving up on your friendships to placate your wife's insecurity was a mistake. I would work on fixing that friendship if you can. Stop giving up parts of yourself for someone who seems to like no parts of you.\n\nLast point, giving you 'the silent treatment' for the rest of your deployment is abuse. Look it up if you don't believe me.",
            "Your wife is abusing you. Sorry, friend.",
            "My dear, this is not a loving, supportive relationship.\n\nI see from the comments that you are adamant on going to counseling. Please be cautious. When you go to counseling with someone who has a history of manipulation and being able to turn back on and off their \"good spouse\" side for their advantage, they will often use the vulnerabilities that are discovered in therapy as a way to control you and make you stay in the relationship. They also have a tendency to warp and manipulate issues and situations during counselling, so you may just leave there thinking that it was actually you doing all wrong!\n\nCounselling is normally for individuals who both care about each other enough to fix communication issues and conflicts... But it doesn't look like your wife is keen on listening, understanding, and compromising.\n\nI personally think you should bail, but whatever you do just... Be careful.",
            "Mine doesn’t ask but I feel your pain.  I wish I could offer some wisdom on this but if I had it I’d follow it myself.  Save to say after 18yrs it doesn’t work.",
            "I’d bet money your wife is cheating on you while you’re deployed.",
            "I agree with pretty much everyone here. I'm a female and I get being a bit wary of your SO's female friends. That's normal. But if you don't have trust you have nothing. She seems to have a giant self esteem issue. She either needs therapy or it's going to be divorce. You can't allow this behavior. It's one thing to be a bit jealous of someone and another thing to threaten to destroy her marriage so she stops talking with you. Thats so ridiculous and evil. Some people will have trust issues no matter who they are with. And sometimes you can't do anything but leave and let them push people away. This isn't a happy marriage. She is controlling and manipulating. It's not healthy for either of you. Sit her down tell her she can't act like this. It is not ok. She needs to apologize to your friend. And you guys need to get into therapy. If She can't do that and learn to trust you... You're probablu going to have to divorce. I know it's hard but you deserve better.",
            "Every person is ultimately responsible for their own happiness.  Life partners make reasonable compromises that both can live with.  Your wife is not a reasonable person.  You cannot \"heal\" her.  Ask yourself what it is that she does for your happiness, in return for everything you have done.  Going silent on your deployments is not ok.  Advise you to get therapy to figure out what it is that you want.",
            "Get out. This is abuse and toxic relationship at it's finest.",
            "Seems like you’ve already gotten the advice I’d give (she’s abusive and is gaslighting and isolating you), so I’ll just say I hope you find a healthy resolution, and get back a life you deserve. If you ever need someone to talk to feel free to hit me up. Good luck!",
            "I am sorry. Get out of this relationship.",
            "Military spouse here. Under no circumstance does a faithful loving spouse ignore their solider while on deployment. This is for sure a Jody situation and an unhealthy relationship. DO NOT give up the military if it’s something you love. You will regret that later. If she can’t support you then she doesn’t deserve to be a part of your life. Period.",
            "Think about it..... What would you tell your best friend if he/she would be in this situation?",
            "So, other people have said she sounds abusive, and I agree with a lot of what has been said. I'm sure there's more to your relationship than what you describe here, but it sounds like she's incredibly selfish and treats you like a doormat. \n\nWhen was the last time she gave up something for you? When was the last time she went out of the way to do something special just to make you happy? Does she ever tell you she appreciates what you do, or what you've given up to try to appease her? Does she ever encourage you to do more of the things that make you happy? Does she ask about your interests? \n\nIt just seems like you've put more effort into this relationship, and made just as many sacrifices for it, than you should need to. A relationship should be 50-50, but I'm not seeing how her efforts even come close to yours. Not to mention it doesn't seem like she considers your feelings at all.",
            "True love wants you to be happy, healthy, and whole. No one who loves you and respects you would treat you the way that your wife treats you. It really sounds like her insecurities are running her life. She only cares about her own happiness here and she’s willing to take things away from you to get it. \n\nI (24F) have several close male friends who are 100% platonic only. I would never date a man who had a problem with that. I would want my partner to have happy healthy friendships as well. Any normal and well adjusted person has their own friends and is able to maintain those relationships. To me, it would be more of a red flag if my partner didn’t have that, or if they were willing to throw away important friendships just because a partner was needy and insecure. \n\nHonesty and communication are the key to making this all work and it sounds like you’ve been nothing but transparent with your wife.  The problem here is her. I think you would be better without that negativity and toxicity in your life.",
            "Look, you haven't done anything wrong. Your wife is just abusive. I don't like throwing that word around much but she had no reason to distrust you in the first place.\nI used to freak out (kind of like your wife) to my ex about a girl friend he had who happened to be an ex of his. The main difference was that my ex did cheat on me with her, and when I confronted him he refused to acknowledge that sexting and flirting and sending nudes was cheating. And he accused me of being the asshole for invading his privacy. \nIt sounds like what you had with your friend was nowhere close to what my ex did with his friend, so your wife is overreacting and probably doing something herself and trying to make you seem like the bad guy just to cover her tracks.",
            "Your wife sounds depressed and needs professional help. Marriage counseling for both of you and therapy for her to deal with her major insecurities. Getting help will be integral to saving your marriage at this point, because neither of you are happy and nothing is going to change if things stay the way they are.\n\nYou have now sacrificed all your happiness for hers, and it was all for nothing because she still isn't happy. You need to take care of yourself too, OP. This is your only life and you can't just spend it miserable like this. You need to take some of that happiness back and she needs to learn to cope.\n\nIf she refuses to get help and work on herself, then it's time to divorce and part ways. At that point, you've both done all you can for each other and it's time you both take on a new path where you can be happy.",
            "Sounds like you’ve gotten helpful\nAdvice. I’ll just say you’re not alone with your ex as a best friend. My ex husband and I are best friends (just awful as spouses) and we still say I love you. My fiancé is totally okay with this and he understands that the ex and I are just friends. Your wife is insecure and also very clearly depressed (often those go together). I hope she gets help and you two can stay together, but you can’t fix her. That’s her job and hers alone. I know this because I spent many years doing the hard work to heal from depression and suicidal ideations. Best of luck to both of you.",
            "She's emotionally abusive. You need to give her the bottom line, get help and counseling both together and both individually or you leave.\n\n&#x200B;\n\nIt also sounds as if she may be the one having an affair, talking on the phone and hiding while doing so. People that cheat tend to project that same action on their partner as a way to justify why they are doing it.",
            "It's not a fair relationship. You should not have to give up things (or friends) every time you turn around to please your partner. Unless, those people or things are a serious detriment to you or your family, which it doesn't sound like any were, there was no reason for this. Tbh, it sounds like she wanted you to basically live for her and whatever made her happy. That's not how a relationship works. Sure, you try to make your partner happy, but there's a limit; you can't **be** someone else's happiness. I'm not sure if she has some mental issue or what is going on, but you shouldn't have to continue to live like this and she sounds abusive. \n\nShe needs to get help or you leave. It's that simple. And if she continually drags her feet or refuses, you leave. It may hurt, but sometimes, if someone isn't treating you right and you let them know once or multiple times (in my past case), then you just have to let go. Maybe they'll get help or maybe they won't, but that's up to them and you need to be free to live your life without all the stress or having someone calling you names when you're trying to please them. You've done more than a lot of partners would do. Also, just a tip, try to get better at emotions. I know it's hard, but it will do wonders with communication whether you stay with her or find someone else. Good luck! I hope things turn out well for you.",
            "You are The Giving Tree, OP. Google and read. I hope it wakes you up. Don't give up on being you. She's going to  destroy you, if she hasn't already. And I say that  because her level of happiness is higher on your radar than your own, which shouldn't be. You don't allow a partner to cut you down and prevent you from growing and enjoying relationships with other humans without consequence. The consequence should be that they lose  access to impede your life, otherwise you will be old and alone and do nothing all day but answer, \"yes, dear\", and hang your head in shame as everyone in earshot stares at your whipped ass. You're fighting an impenetrable wall with dodgeballs. You're choice is stay or go. You choose the life you want, not her, but make one thing clear, the life you want will not be the one you get if you stick around for any more of this bullshit.\n\nPS: There's a reason almost 500 people are here posting.\n\nPps oh I forgot, it's obvious she is cheating it makes it easier.\n\ntl;dr: stop being this b's yes man.",
            "Speaking from personal experience.\n\nGive up as much of yourself as you want, it's never going to be enough. She is the only one who can bring happiness in to her life.\n\nI have gone through your exact situation and people who complain about something but never attempt to fix the problem WILL ALWAYS BE UNHAPPY.\n\nYou will end up hating yourself and constantly feeling like a failure. \n\nIT IS NOT YOUR FAULT. At the end of the day you have to believe you gave 100% and be proud of that.",
            "I've been through something similar with my partner. All I can say is life is far from perfect.\nNo one really knows what they want and the best we can do is be there for one another.\nYour wife seems like she has a lot of insecurities and they may come from her own feelings. Maybe she wants to cheat. Maybe not. Maybe shes just trying to find a way to make things work.\nI mean look at it from her point of view for a second. You say I love you to your best friend who also happens to be an ex lover. Not even the most secure person could deal with something like that.\nBut the problem with this situation is that. Yes you stopped talking to your ex and stopped contacting her. But this is something you need to want as well otherwise its pointless.\nYou will grow resentful, like it seems you are.\nYou wife will feel this resentment. Even if you dont think you are.\nWhat it boils down to is how you feel. Because this is your life and only you can fix your life. You cant change your wife but you can try make her understand how you feel and maybe try understand how she feels no matter how irrational she is being.\nIf you cant do this then maybe you shouldn't be with her.\n\nGood luck and I hope life works out for you and your wife.",
            "She is probably also cheating.",
            "Been there,Done that. Kick her to the curb",
            "Coming from a similar experience, I’m guessing she is projecting her deeds on to you. There is a good possibility she was unfaithful and is now projecting her insecurities into you and your relationship. She is engaging in controlling and abusive behavior. I would give her an ultimatum. She either unlocks her phone then and there and allow you to search it or you walk. I know it’s not a healthy solution but I’ll bet good money she’s doing something she shouldn’t. I would also make it mandatory that she contact your friend, apologize to both your friend and her spouse.",
            "Well, we now know why the first husband RAN for the hills. I suggest you do the same. Youre in a highly abusive and volatile relationship. Goodluck OP",
            "You need to go and seek individual therapy as well as divorce.",
            "Been here and done exactly what you’re doing but only lasted 3 years.  Let’s just say I’ve been single for 2 years now and though it took some time to get use to I’m so happy now. I didn’t wait for the next time she tried to make me change my friends or something I loved but simply took her on a date and expressed my side. Afterwards I noticed she didn’t really care about my side AT ALL and only hers. That was my last straw because no matter how much I loved her, tried to mold myself into what she wanted, no matter how much I accepted her child as my own, she was simply too selfish and controlling.",
            "She’s 100% abusive and the sooner you realize that the sooner you can find true happiness with a supportive and loving partner.",
            "You are being abused. She has cut you off from your already small support network, made you quit your job(s) and uprooted you. \n\nThere is a reason why this woman was already a divorcee with at kid a 19-20.\n\nYou are being abused, get the hell out before it becomes physical.",
            "You have given it your all. I wish I could give you better advice, but honestly, this kinda sounds like a walk away situation. At the very least, sit her down and talk through all of this. I'm so sorry you have to deal with this.",
            "Take the lead and stand up for yourself or you will be very unhappy",
            "Besides the fact that it really sounds like she’s cheating, it also sounds to me like she has bi-polar disorder.  She may need to seek therapy.",
            "She has systematically isolated you from all support. She is abusing you. I wouldn't be surprised if she has a cluster-b personality disorder.\n\nYou are in for a rough ride, especially if you stay with her. Reconnect with your friends and family and take care of your own happiness. Her happiness is not your responsibility. Yours is.",
            "She probably cheated on you while you were deployed and is projecting this onto you. Best to sever ties with people who are unable to compromise or understand your point of view.",
            "She is a covert narcissist. Women like that are fun and create great adventure, but will ultimately destroy you and feast on your soul. Overt narcissists are more fun and will only destroy you.",
            "Your wife is completely in the wrong but constantly telling an ex you love them is also so not appropriate",
            "You need to leave, now. And get in touch with your friend, those are for life man and what she did was completely unacceptable. Only you get to decide the people in your life and nobody else. No matter what. I understand boundaries and trying to make your spouse comfortable but this crossed many lines by a longshot. You deserve better man): I wish you the best. I was in a very similar situation recently so feel free to PM me if needbe",
            "This sounds like mental abuse that you're receiving due to potential infidelity on her part since shes gaslighting you and being.cold without a path to heal.  I think it's best to announce a trial separation and you should go dark in communication as to show her what her life choices are demanding of you.",
            "Sounds like she is pretty abusive. \n\nRemember, before you are a husband you're a man with respect for yourself and dignity. Don't let anyone turn you away from that. \n\nI wish you all the best.",
            "Thank you for your service. But in reference to your situation, you need to end it while you still have a grasp on your sanity. Her extreme, unjustified jealousy will destroy you. It will ruin yours and your child's life. It will be hard and hurtful at first but end up being the best thing when you look back. Been there, done that; from all angles including military.",
            "Your wife is abusive and you need to seek help.",
            "I had a boyfriend just like her. She is being abusive and taking advantage of your \"whatever makes you happy\" state of mind. She needs a therapist and she is, probably (like, REALLY), cheating on you, and just assuming you are doing the same, blaming you for everything to excuse herself from being a toxic person. \nMaybe she knows she is doing wrong but can't face it, or face you. You need to take care of that child because she may use her at some point to attack you. I can really see blackmail coming.\nYou need to get out. It's hard, but you have to. For your own sake and mental health, and for hers. She can't deal with a relationship. She needs help. Medical help. And if she won't let you help her with that, you have nothing to do there.\nAny of those times where she says she will leave, follow the \"game\". Agree and ask her to leave. If she gets mad and just victimizes herself instead of leaving, or \"leaves\" sorrounded by a cloud of HUGE DRAMA (she will try to come back asap), you will know that she is just manipulating you to get what she wants: have you ALL to herself, until she doesn't anymore.\nYou need to convince her to get help, or run away. This is beyond unhealthy and won't get any better unless you start facing her, putting up some limits and stop agreeing with every shitty or nasty thing she does or wants.\nGrow some balls if you wanna help her of get out of there.",
            "Nobody can make another human being happy. It’s their decision to be happy, and if she is an unhappy person, she will find a reason after a reason to be unhappy, either with you, her job, where you guys live, etc etc. Unless she realizes the happiness is within her, nothing you would do or don’t do will help her. If you want to stick around, tell her firmly that you will do whatever makes you happy and she can choose to be  happy for you and with you. \nBe aware, it might take decades for her to change.",
            "\"My wife then did not talk to my the rest of my deployment\"\n\nDude. Dude. Dude. She's straight borderline or bipolar.\n\nI would be so upset if I was on deployment and my WIFE wouldnt talk to me because she was upset about something silly. You must have a heart of gold or just dont realize this is not how relationships are supposed to work. She's so freaken manipulative. Chances are she's cheating on you. Sorry bro, but things wont get better with her, just worse. I hope you get out of that relationship.\n\nAnd chances are the father isnt involved in that child's life because she pushed him out and he didnt want to deal with her bizarre behaviors.",
            "I’m sorry my comment is kinda late in the post game, and there’s plenty before mine. But if you see this I really hope you look into a book called “Why Does He Do That?” By Lundy Bancroft. The book is actually about abusive men, but the patterns of abusers are usually the same in a lot of ways so they can apply to your wife and that book can be a way (and was for me) to see into the heads of people you love and why they do those things to you. And how to get out. Because it sounds like she is in fact very abusive and you would probably be happier with some changes. I’m sorry to hear about your situation though!",
            "I didn't need more than the headline to spot this as an abusive relationship.",
            "She will never be happy you either have to deal with it or start anew",
            "Sounds like she’s cheating on you bro",
            "OP, first off, I'm just so sorry that you are in that situation and it's gotten to that level. You sound like a loving husband and that you know what it means to make compromises you don't like for the greater picture of a relationship and know that it takes work to make a marriage successful. However, based on the actions she has displayed, she is not respecting you and herself as well. Her own baggage should not be projected onto you and should be solved before ever beginning a relationship with you.\n\nI understand divorce is not the path you want to take, so I'll recommend sitting her down and explaining that you are no longer happy being in this relationship and that you don't know how much longer you can take it. Try to talk to her with why is she is unhappy. Suggest solutions such as having dedicated self time, meet with some old friends you haven't seen in a while for coffee and go without her, take small steps to build trust. Perhaps her love language is quality time and she simply wants your undivided attention for only 30 mins a day. Additionally, identify what are actions/behaviors she can do that will give you happiness in your relationship again.\n\nHope this helps 🙏",
            "She is depressed and manipulative. She probably hates herself and needs someone to constantly help her regulate her emotions. We are all responsible for maintaining our own happiness but many woman put too much pressure on their man to keep them lifted up. She has many demons to face. Dude, you are not the problem.",
            "This could all be boiled down to a few comments and observations. A bit of tough love incoming:\n\n1) Do not get involved with single mothers, except in the rarest of circumstances.\n\n2) Learn to have personal boundaries, and stick to them through rain and fire. It appears you have none.\n\n3) Stop trying to save your wife, or anyone. She has to save herself.\n\n4) You cannot be responsible for another person's happiness.\n\n5) Your wife is likely cheating on you.\n\nI learned all these lessons the hard way, when I was older than you are now. Best learn them now, and make plans to get out. This woman will kill you slowly if you stay. You've been warned.",
            "Your friends husband is okay with your friendship I assume? As someone who's been there, your wife sounds like she's extremely selfish and narcissistic. She needs counseling. My ex always said if we can't fix it between us, a counselor can't do it and he would never go. I might still be married if he did.\n\nAbove all, friends are forever - I (f) have my 2 closest friends who are male. We've been friends most of our lives. Relationships? Ya just never know!\n\nI wish you good luck ☺",
            "When my ex did this exact same behavior to the T it was because she was cheating on me so.",
            "That's a really bad relationship mate. She's isolating you from your friends, forcing you to move and give up everything for her, being needy beyond what is reasonable. It's abuse. It might stem from her first relationship but it's no excuse for her or a reason for you to try to wait or fix her. She needs therapy and the realization that she can't be the center of everything, and you need to leave and find someone that is comfortable with you and doesn't distrust you.\n\n Also, you should get back in touch with your friend. She had no right directly threatening her without even making some kind of arrangement with you, that is beyond compromise. She has no right demanding you provide everything for her. Find someone that makes you happy because with her? You're going to give away all your happiness for her, and that's not nessecary nor is it in any way healthy. \n\nIt's okay to be selfish and take some happiness back for yourself, get in a job that makes you happy, move back to where makes you happy, find someone that wants you to be happy.",
            "That sounds like she's become seriously mentally ill over time. She needs help asap. If she refuses to let someone help her, leave and take the kids with you.",
            "I'm sorry man. You've been trapped in an abusive relationship. Others have said it and probably more eloquently but you need to get a divorce and fast. If not then at the very least get into some couples therapy",
            "Your wife needs to take some responsibility for her own happiness. It is ineffective and unfair to keep placing all that blame on you. As you have seen, every time that you change one thing for her, she simply moves the goal posts to something else. I am certain that if you go through with this move she is demanding, she still will not be happy and will simply find something else to complain about once it's over. She's just fundamentally unhappy right now and she needs to stop looking outside for fulfillment and learn how to self-regulate and cope. Her moods, her emotions and her perspective are influenced first and foremost by her and if she's chronically unhappy then she needs to go to therapy, get a hobby or figure out something. But she can't just keep making you the scapegoat for all her feelings.\n\n> My wife then didnt talk to me the rest of my deployment.  \n\nYour wife's first reaction to conflict is to punish you instead of try to find a resolution. That is not how spouse's should interact with one another. The way to solve things like this is via communication and compromise, not by withholding affection. You are the one trying to talk, you are the one trying to compromise, you are the one trying to work things out. She lashes out and behaves harmfully when she gets upset, even over perceived wrongs that didn't actually happen. \n\n> My wife took it upon herself to call her and tell her that if she didnt stop talking to me forever that she would tell my friends husband that we were having an affair.\n\nYour wife went behind your back, ended a friendship you had with someone very near and dear to you. And not only that, but she threatened to ruin your good friend's (who was a new mother!) marriage, over something that wasn't even true. And then she told you a watered down version of the story so you wouldn't find out how far she had gone. \n\nIf your friend had refused, your wife could have literally destroyed your friend's entire marriage right after she had a baby. And based on what? A completely untrue and petty suspicion that she had. That is not normal behavior, that is serious. \n\nYour wife is acting in a manner that is controlling and emotionally abusive. If her behavior does not stop, you need to get out. This is harmful. \n\n> I feel like she will never be happy and I'm not sure how to fix it \n\nYou can't fix it because it's not your fault. You are just being used as her emotional punching bag. You take all the blame and make all the sacrifices while she continues to perceive that the entire world is out to get her. Healthy relationships involve give and take from both people involved, and in your relationship, you are doing all of the giving and she is doing all the taking. That is unbalanced and unhealthy. \n\nAnd yes, while ultimately she is responsible for starting to be a more giving, compromising and reasonable partner, it is well within your control to stop giving in to her every demand and start having some expectations of respectful treatment towards yourself as well. You deserve better than this.",
            "I think you need to talk to your wife. Ask for couples counseling or it may be over. Go back to the military if you need to. Shes made you give up your friends, job, sense of self and it's still not enough. \n\nI'm not going to say dump her. But these are major red flags. Maybe she has depression and needs a therapist. But these are signs of emotional abuse.",
            "I'm sorry but your wife is abusing you. Healthy relationships are based in trust and wanting what is best for the other person. \n\nYou will never do enough to make her happy, because the cause of her unhappiness is inside her. She's made her problems yours and it's not fair or right, because you can't actually control her emotions or insecurities. Only she can.\n\nYou can't fix this. It's not about you it's about her. The only thing you can do is take care of yourself. Which means getting away from your wife.",
            "Your wife is a shithole of a human being, not all that surprising she’s been married twice by age 21, I mean Jesus Christ. Just a train wreck of shitty decisions and abuse, no wonder the last guy got gone. You should do the same.\n\nYou don’t owe this woman or her kid anything. Speak to a divorce lawyer ASAP, you don’t want to be stuck with alimony while she continues to sit on her ass.",
            "I have one thing to ask. \n\nSo there is this wife and a kid.\n\nKid belongs to another guy.\n\nQ1) Do you have your kid too?\n\nIf not there is absolutely no sense being with this women especially the way she is.",
            "You seem to have come here to get support for a belief your wife has been really unreasonable. There are some things she's done that are wrong, sure, like how she handled your ex. But dude, a lot of people would not be OK with their partners being close friends with an ex, let alone saying \"I love you\" to them. You still sound annoyed that she even asked you to stop, even though you did it. Maybe it would be good to reflect on why you would still resent that she set this boundary.\n\nFor her requests for you to change things about your life - you don't have to say yes. There isn't a lot written here that indicates she is being controlling, just that she has unreasonable demands, the emotional source of which is unknown from this post. She has to take responsibility for whatever is causing her unhappiness, but you also have to be responsible for setting boundaries and making your wife feel safe and loved to the best of your ability, which might involve a lot of inner change. Have you checked out the love languages thing? It also sounds like you could both benefit from individual therapy if you can afford it.",
            "Dude, I know this isn’t what you want but you need a trial separation. And if you hate being a civilian and would rather be In the military go. I understand where your wife is coming from about not always having you around but she’s abusive. My SO is military and I knew that we we started dating. I understand they don’t always have time to talk and they can’t always be around but the time I can talk to them when they’re away is the best time of the week/ weeks. She’s got something going on with her please do not let this continue. Tell her she needs to get some professional help and maybe you two could then consider counseling but due to her abusive tendency’s I wouldn’t.",
            "Lots of great advice here. Just want to say that you deserve better. You're not being treated like you should.\n\nAlso, thank you for your service. 5 years seems like a long time but its really not.  Find the happiness you deserve.",
            "Sounds like she needs to see a therapist and psychiatrist. She's got some sort of mood disorder going on. Could be hormonal too. Either way she needs medical treatment before things escalate any more.",
            "This woman is “gaslighting” you... she is trying to control you and possibly even make you think you’re crazy. She has a serious personality disorder, and if you don’t leave her, you will completely lose yourself. She is unstable and most likely cheating on you. \n\nMake sure your child is safe and that you can have regular access and get out while you can! I was in a relationship like that for many years... I am smart, but due to having 2 daughters with him, I tried to make it work. It was NEVER going to work. My girls and I were poor, but so much happier away from him! I always allowed him access, but he was never regular with it, and as adults, both daughters have disowned him.\n\nPlease, save yourself! Allow yourself time to heal and be a good Dad. Your friends will be there for you. She is a sociopath!",
            "Honestly, it sounds like she has wanted out for a long time and is too selfish to pull the plug. So, instead she's doing everything in her power to make you the bad guy who breaks up the marriage by leaving.\n\nShe is terribly abusive and selfish. Anyone who truly loves someone else should want to make them happy (as you do for her). But she doesn't care how you feel or what you want or even what's in the best interests of your family. That is not something that will change.\n\nI'm sorry. It's hard to love someone who never puts your needs as even equal to you own. \n\nAnd I'm more sorry that previous commenters are probably right about the projection. I've been there, it's a real thing and it's so friggin shitty when you emotionally drain yourself for someone only to find out they were absolutely betraying you every time you blinked.\n\nGet out. You'll both be happier when you do.",
            "She's projecting. \n\nShe is having an affair. \n\nI can guarantee you that it started when she refused to talk to you for the rest of your deployment.\n\nThe only reason she is so paranoid and suspicious is because she knows what she is doing. This is why she is both locking and hiding her phone as well as going through your phone. She suspects that you must be having an affair, because, why not? She's done the same thing.",
            "Leave!! It's not worth it. Whatever you do, don't get her pregnant!! You'll be stuck to her forever!! Be strong, be brave. Put yourself first",
            "She is probably cheating and projecting it on you",
            "take her advice then.\n\nyou love her. then get rid of her and stop being with her.\n\nshe really does give the best advice doesn't she?",
            "Changing yourself for someone is never a good idea. If she wants you to be someone else, why is she with you in the first place? Best thing is that you remain strong and call her out on her bullshit.",
            "Okay points here:\n\n1. Good on you for taking care of a child that is not yours, and a woman should always consider this as a valid point toward a man when many of them actually do not do that.\n2. good on you for being completely clear about the friendship with the friends.  I understand where the wife is coming from (jealousy), but she needs to work on this and not you.\n3. Your wife is never going to be happy because she's an Abusive/Narcissistic type that uses manipulation.  She needs help. She either was previously in a relationship where she was cheated on and is reflecting that fear on you, or she is just overtly fearful of it for a reason. Low-self esteem.\n4. 4. I would not be surprised, if out of her own emotions and not yours, she herself does have an affair. Even if an emotional one online.\n5. If you do believe in trying to save your marriage, couple's therapy is there. But make no mistake, the majority of people that embark in this type of behavior in a marriage end with divorce. So I wish you the best of luck but consider, that this may end up resulting in a divorce between the both of you.\n\n&#x200B;\n\nIt is time for the both of you to go to couple's therapy. And for you to go to a therapist by yourself as well, so that you can get both perspectives.  In addition,  you may need to consider an exit strategy. The moment that the other partner, regardless of sex, controls your friendships, your work, and your life to the point where every decision is theirs, this is no bueno, and thus it is indicative of abuse.",
            "You're a fucking idiot there is no logic. The only logical thing to do is leave her",
            "Hey OP, I think maybe you should see a marrige counselor with your wife. I can see that you really love her, but your relationship is becoming both toxic and abusive. \nTry and convince your wife to go to counseling and if doesnt work I think you should maybe divorce her. Sorry if this isint good advice and i hope that everything gets better.",
            "dude, I'm sorry to say this but you should've dumped her the moment she started actively trying to get you away from a good, caring friend.\n\nthis relationship sounds downright abusive, and the fact that she was able to make you completely cut contact is honestly disgusting. (I'm disgusted at her, to be perfectly clear - I very much don't judge You for being subjected to this) \n\nshe doesn't deserve all the effort you're putting into this relationship, and believe me - it'll never be enough for her. I'd advice you to get the hell out of there and I'd say to try to take the kid with you but I do understand the lifestyle that would make you happy probably doesn't allow that. still, that sounds like a suuuper unsuitable parent. yikes!",
            "This is abuse and she is trying to isolate you. It's best you reach back out to your friends and family. Tell them what is happening and find some support getting out of there. Nothing will ever be good enough for her so you might as well stop trying and let her go.",
            "When you come back from your deployment id suggest having a real discussion with her ex to see what happened to their marriage from his view. With how shes acting it may have been she treated him the same way and thats part of the reason the marriage failed. If she was willing to threaten to ruin your friend's life with such a heinous lie there are probably other things she's done that are big red flags. You've sacrificed your friend your career for her, and she still wants you to keep sacrificing to make her happy? She will never be happy and you need to stop cannibalizing your goals for her. Also check your phone billal and either call or text the number she seems to be calling when shes alone to see who it is. \n\nIf she keeps saying its all you and your the one that needs to change but unwilling to admit to and change her own behavior you need to leave. Good luck and thanks for your service.",
            "Basically she's not happy. And you can never make her happy enough. If you think she's cheating get evidence. Take her to court in divorce her. If you're truly not happy leave the marriage. You gave up everything for her and she's not happy. Stop doing it. You need to focus on yourself.",
            "Take your daughter and get out. She clearly doesn't love you and is abusing you. If she locks herself in her room, calls you name and says you never spend time with her, doesn't speak to you, and goes through your phone; that is a definite sign of abuse. Your wife needs therapy and you need to divorce her.",
            "constantly saying you are cheating on her is a BIG red flag for cheating on you. Try to check her phone and maybe remember the patron/pincode. Also, she sounds like an r/nicegirls type.",
            "Dude, I am so sorry, but her acting like that and talking with people specifically away from you makes it sound like she met Jodie. I really hope I’m wrong",
            "This sounds like she is suffering from severe form of depression, the best choice would probably be to take her to the doctor, and talk to her about that. This is a pretty serious condition, and shouldn't be treated lightly.\n\nThe person who suffers from it likely won't be able to escape from it by themselves, simply because they don't have a will to do anything, or even a will to live, so she really needs your support.\n\nI suggest taking her to psychiatrist, and maybe to family psychologist, to talk about your issues.\n\nIf you don't really love her, and just got used to her, then maybe breaking up is an answer, but I don't think this is the best solution for the problem, especially since you have a child.",
            "I don't know if you will see this comment since this post is 12 days old as I post this comment, but out of curiosity how is the kid taking all of this? (Be aware I don't know how old the kid is so I don't even know if they can comprehend what is going on.)",
            "I've read some comments so far and some people jump to not too far fetched conclusions, but before you go that to that length step back an view things in a way that suits you the best, logicaly and obejctive. Ask yourself if you are happy with the overall situation, what bothers you and what you want to be changed so it is a good relashionship for you again. See if there are thing you can do to get these changes into motion talk to your wife and adivse her some professional help, she sounds from what you said like she has some for of mental illness like depressions, further try to get professional relashionship advice/help if you still desire to stay with her. You are not to blame in any form and should stand for your own rights to stay in contact with friends but right now may not be a good time to state that, at least if you didn't already decide to leave her and want to stay with her. If she get's more stable you may be able to talk about past things and you \"former\" friendship and maybe be able to get back into contact with her, which would benefit you, because humans are still in need of social contacts.\n\nEdit: I should cover the other side, too. This is not a relashionship that is healthy at the moment neither for you, her or your daughter, if things won't change and/or other things like cheating may come to light you should take your leave as soons as possible and try to get to daughter to live with you (reason for that is that i am quite positve that she is in an mentally unstable state).",
            "I'm no expert but I would try to take the kid (legal custody), tell her off, then leave her. If she comes back tell her off again, and slam the door in her face.",
            "To me the options are: get relationship counselling if you want to save things or get a divorce.\n\n&#x200B;\n\nI have to say that if someone interfered with a friendship like that, I would never forgive that.",
            "**Don't be afraid for divorce. She is actively making your life worse, not making it better at all. This isn't a relationship. 50% of marriages end in divorce. And it seems that this friend was really close to you, not worth it.**",
            "**And if it IS because of a mental disorder, you have no responsibility to be in a relationship with someone that's treating you badly. You don't need to give up your life for a bad person.**",
            "**Also, doesn't seem like counseling would fix anything. She's toxic, and is trying to get rid of all the things you love, and doesn't want to listen or even fix the problem.**\n\n&#x200B;\n\n**It seems like she actually WANTS to have things to yell at you about.**",
            "Your wife cares nothing about your happiness dude. It should be very clear to you that your wife is very troubled and you should divorce and move on",
            "Even though you don't want to divorce you should you're in a toxic relationship that will only get worse and it's not only damaging you it can hurt your daughter too",
            "im sorry im just seeing this but you kinda need to escape.....\n\nThis relationship is toxic and if she cant appriciate how your helping her out so much already and is super greedy and stuff you need to leave. She is being controlling and you need to rebel or leave. cannot stress out enough. get your friend back in touch aswell.",
            "your wife might've been cheating on you while you were deployed",
            "grootis, you need to leave your wife, she's a jealous person, who's probably cheated on you. Make amends with your friend and find someone better. She doesn't deserve you and you deserve better.",
            "She's cheating for sure."
        ]
    },
    {
        "post_id": "bd4bor",
        "author": "andromeda-rising",
        "title": "[UPDATE] My [F26] sister [F23] keeps posting personal details of our relationship on her public blog/twitter. She doesn’t seem to understand why I don’t like this, and I am at my wits end.",
        "url": "https://www.reddit.com/r/relationships/comments/bd4bor/update_my_f26_sister_f23_keeps_posting_personal/",
        "score": 2545,
        "num_comments": 50,
        "created_utc": 1555258325.0,
        "selftext": "Figured I'd give an update to this situation as it's almost been 2 years since the original post. Link below:\n\n[https://www.reddit.com/r/relationships/comments/6f7yz5/my\\_f26\\_sister\\_f23\\_keeps\\_posting\\_personal\\_details/](https://www.reddit.com/r/relationships/comments/6f7yz5/my_f26_sister_f23_keeps_posting_personal_details/)\n\n&#x200B;\n\nAfter reading through everyone's responses and taking time for myself to see how I really felt about the whole situation, I did as I said I was going to do, and blocked my sister on all forms of social media. I also cut her out of my life (albeit, temporarily). For about 8 months, I didn't speak to her, nor make any attempts at communicating with her.  That summer (so about 2 months after I had stopped contact with her), my sister moved away for school. My mother eventually got wind of the situation from my brother (who was 24 at the time and has never been particularly close with our younger sister) and asked me why I wasn't talking to my sister.\n\nInitially she was judgmental, but after explaining to her my sisters repeated behavior of posting personal details about me online (including my phone number and details about my sex life), my mother was furious and agreed that I had every right to cut her out of my life. At one point, my mother, during a phone conversation with my sister, called her out, calling my sister childish, petty, and vindictive and said that if she ever found out that she was posting any intimate details about ANY family members online like that again, she wouldn't hesitate to find a lawyer. She also threatened to kick my sister out of the house if she didn't stop her nonsense (while she was away at school, she did live at my mom's house during summer breaks/holidays).  I'm not sure if there was any actual legal repercussions my mom could have actually made against her, but it was enough to make my sister set her blog/twitter to private after my mom browbeat her into submission for being so shitty.  Due to this, my sister and my mom had a huge falling out as well, with my sister repeating the same old adage of how it was her \"personal\" blog/twitter so she could do whatever she wanted with it/on it.\n\nChristmas rolled around and me and sister still weren't talking, and while my mom had patched things up with her to a degree, it was an awkward holiday. Me and my brother both live independently. When we went over to visit for holiday stuff, were civil and polite towards our sister, but we never failed to notice her on her phone 24/7. We could only speculate what she was doing, but I was less bothered now that she had set her blogs to private. Regardless, during a dinner at one point, she was on her phone and my mom asked her to put her phone down so we could have \"family\" time. She responded along the lines of \"yeah, one minute\", and my brother made a jab about how she was probably too busy posting \"bullshit lies\" about us on the internet. I should mention that while my sister doesn't seem to care what I think/ask of her, she has always seemed to respond and care about what my brother thinks. She tried to fight him on his comment for a minute, but he shut her down, calling her \"a fucking child\" who just wants \"internet points\" and straight up said that if she was \" a decent fucking human being\" she would talk to us about her problems instead of cowering behind a screen.  She shut up after that and retreated to her room after dinner was done.\n\nAfter Christmas, I continued to have zero contact with her. I would hear about how she was doing in school via our mom from time to time, but still had her blocked on all social media. She came home for the summer to work, and that summer our Grandma (my deceased father's mother ) died. My sister ended up having a complete breakdown due to the culminating and unworked through grief surrounding our father (who had died 2 years previous) and now our Grandma. She started going to therapy and actually taking her medication.\n\nEventually, she reached out and apologized to me about her behavior the past few years. We had a sit down that fall, over some beers and talked about everything that had happened and her behavior. I told her while I accepted her apology, it would take some time for me to work through her how behavior had affected me and our relationship. I unblocked her on FB so we could make a group chat with our brother as a buffer. We now occasionally talk, but we still aren't as close as we used to be when we were younger. I actually went to lunch with her the last time she was in town and it felt...okay. So that's it, here we are.\n\n&#x200B;\n\n**TL;DR:**\n\nBlocked my sister on all forms of social media and cut contact, only participating in it during holiday events/funerals. Brother and mother supported my decision and made it clear to her they didn't stand for her behavior. Sister ended up going to therapy and actually taking her medication and later apologized. We occasionally talk now, but we aren't close anymore.",
        "permalink": "/r/relationships/comments/bd4bor/update_my_f26_sister_f23_keeps_posting_personal/",
        "comments": [
            "Ugh, I have a sister who would take pictures of me at events (like meeting an Instagram famous dog) off my personal Facebook page and would tweet them to celebrities that she regularly tweets at. It annoyed me so much. FWIW, I don't post on Facebook anymore nor talk to that sister anymore (due to other drama), but that shouldn't stop you from posting on Facebook.\n\nAnyways, my sister also has a blog for books she writes (that sadly nobody reads except her circle of book friends), and she talks a lot about her personal life and her relationships with her sisters. It drives me crazy, and I hate when you google search my name, you can find her blog where I'm talked about.",
            "Unfortunately these things take time. While I'm glad that you guys have opened the door to reconciliation, it sadly won't happen automatically. You both have to make the effort as well. I'm rooting for you!",
            "She might not like it, but you need to keep verifying that she is not breaking your boundaries for a long, long time.  Even if she has stopped, if she breaks down again, she could start up again.",
            "I am glad for you that you made some headway with her. It does take time. It sounds like her age + unresolved grief about your father + internet points got her doing some seriously damaging things. Good luck to you all. \n\nAlso, your mother is a BOSS.",
            "This reminds me of a story a while back about a mummy blogger who posts everything about her kid's life under her real name, being asked to stop by the kid (who I think was about 10 or 11?) because classmates could find it. If people absolutely MUST write about every detail of their life and relationships online then at least use a fake name because it's not fair on everyone else involved to have their dirty laundry aired out like that.",
            ">\tShe started going to therapy and actually taking her medication.\nEventually, she reached out and apologized to me about her behavior the past few years. We had a sit down that fall, over some beers\n\nAll due respect, but if she’s on medication for mental health, please try to encourage her sobriety from alcohol as well. Society seems to downplay how powerful of a drug alcohol is. I can’t tell you how much my depression and anxiety decreased a few months after I stopped drinking regularly. \n\nThis Naked Mind is a book that has a wonderful chapter on this.\n \nGlad to hear your family is all working through this, and my condolences on your losses of loved ones.",
            "I’m glad she saw how bad her behavior was. I use to have friends that acted just like her and defended their negativity and abuse with “it’s my personal blog!” and it would make me feel like I was constantly walking on eggshells.",
            "I recently started speaking to my older sister again, like yesterday. First time speaking to her and seeing her in over 2 years. Over different issues than yours, but if you have any advice for me that would be cool. It’s awkward and I almost don’t want to message her because of that. Still a lot of bad feelings towards her, but I’m trying. We use to be EXTREMELY close. She called me every single day on her lunch breaks. I’ve missed her dearly. I hate holding this grudge.",
            "I hope overtime you start to become a family again and we all make mistakes, I would have done the exact same thing and I think you handled it well, its a shame that it took deaths to sort issues out but im sure your dad and grandma would want you guys to patch things up and start to become a unit again, this may not happen it may do it will take time and it depends on the person, hopefully she will learn but you have your life to live so live it.",
            "You should buy her a diary/journal for Chrismas to write all her feelings in",
            "I feel kind of bad for your sister. As insufferable as she was, and as wrong as her behavior was, it sounds like your family doesn't have the best communication style and there's a reason she felt she couldn't talk to you guys. Does your brother always talk to her like that?   \n\n\nTo be clear, she was 100% wrong and you were well within your rights to cut off contact with her, I'm just curious about the family dynamics.",
            "I’m happy for you OP",
            "I’m glad you’ve started having a relationship again. What she did is obviously highly inappropriate, but I’d also guess all the need for outward sharing and validation means she had quite some issues to work through. I hope you can build on this new start and build a new relationship over time",
            "I always had my personal blog set to private when I was 13... 20 years ago? Yeah? Needed support due to trauma at home, but I kept real names out and it was password locked up tight.\n\nI would understand if my crappy parents didn't like me posting publically because it would shame them and it's not anyone else's business but I needed support somewhere.\n\nI lived in a small town, no public transit, not easy to get therapy without them knowing so blogging and forums was the only way for myself to survive it. I was lucky to have the outlet.\n\nBut publically yeah, I totally get it. Even from my point of view.",
            "You'll be sisters the rest of your life. Having a relationship is optional, and having a *close* relationship will, as you're perfectly aware, take time and effort on both your parts.\n\nI hope your sister is more aware of and sensitive to how risky it is posting personal info online, particularly after the last couple of years. Not even related to your personal preferences, the way public life is going these days, *everything ever posted* not just by but also *about* someone, whether true or not, can be dug up and used against them, and it isn't just politicians and celebrities who can be victims.\n\nIt sounds like she is maturing, though, and owning up to her responsibility. I hope in time you *do* become closer again, if that's what you want.\n\nGood luck to you both!",
            "Did she delete the posts about you?",
            "I'm glad the rest of your family are good people and take no shit from the sister. Props to brother for putting her ass in its place so eloquently, lol.",
            "I'm just wondering but when you told your mom she tweeted \"details about your sex life\" and you mom freaked out..were the tweets stuff like \n\n>Sis and her boyfriend are loudly fucking in the other room again"
        ]
    }
]