[
    {
        "post_id": "cpp3h9",
        "author": "hairsmellslikelilacs",
        "title": "[UPDATE]- My (32/F) boyfriend (33/M) forged a document.",
        "url": "https://www.reddit.com/r/relationships/comments/cpp3h9/update_my_32f_boyfriend_33m_forged_a_document/",
        "score": 2540,
        "num_comments": 84,
        "created_utc": 1565677095.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/3tu5il/my_29f_bf_30m_of_4_years_forged_a_document/\n\nSo when I left you all, I was supporting Jay as he picked up the pieces. It ended up that we were lucky that his transgression (forging a document) ended up being mostly covered up except that he was fired... He didn't end up with legal repercussions at least.\n\nJay ended up starting a new career teaching in our field. He's doing so well that he has been promoted recently to an associate professor position at a well respected college. Everyone loves him as a teacher.\n\nThere are so many more stories about this that I'm writing a memoir (but damn, I'm not a good writer!). Like the person that first reported him ended up being in love with me and I had to get a restraining order against him...\n\nIn sadder news, after supporting him for two years as he got his life together, I've fallen into depression and alcoholism. Apparently this happens sometimes to caretakers? I'm still keeping it together at work somehow, but could definitely be excelling if it wasn't for the drinking... I'm working on it and have just started going to AA, but it's definitely something that we need to work on in therapy more (which we both go to). \n\nI hope to provide you a super happy update where we both are crushing it in the near future, but for now, this is where we are at. \n\nOpen to suggestions from those that have been through related situations.\n\nTldr: my bf messed up a few years ago and I currently feel the consequences. I need to forgive him. Looking for good experiences related to this.",
        "permalink": "/r/relationships/comments/cpp3h9/update_my_32f_boyfriend_33m_forged_a_document/",
        "comments": [
            "Hey OP!\n\nI cared for my (now ex-) girlfriend for 18 months while she had significant mental health issues, and also turned to alcohol as a way of coping. It went badly for me, and I stopped drinking just after New Year.\n\nI can highly recommend the /r/stopdrinking subreddit (are you allowed to link subreddits on this subreddit?), as it provided me with a lot of support and comfort when I was struggling.\n\nTherapy is always useful, but have you seen a psychiatrist too? You and the psych may decide to try a medication such as an SSRI (which I've been prescribed), and they can really help! Also, is the type of therapy you're receiving the most suitable for your situation? I'm receiving trauma-focused CBT, but could have gone for EMDR, as I was diagnosed with PTSD after everything had settled. Might just be something to think about!\n\nBest of luck with everything ahead - I hope your partner is supporting you.",
            "Getting sober *is* crushing it. \n\nYou might like r/stopdrinking...",
            "OP, congrats to the both of you for surviving that mess! And I'm sorry that you're now suffering from the ashfall. I hope he'll support you as you did him. Either way, you've shown a strength of character that a lot don't have. I believe in you, OP. It might take a long while before you recover but I think you're in the right path. With your persevering nature, I believe you can overcome anything. Hugs from Asia!\n\nEDIT:\n\nSorry, but I forgot to mention. My SO did me a doozy that took a long while to forgive, too. Not like the professional misdemeanor in your case, but a huge blow in my trust for him nonetheless. \n\nI struggled and became an alcoholic for a while, until that ate into my work performance and wallet. But I came around especially because he never left my side, apologized properly, and atoned for his sin in his own ways. Not immediately, and certainly not consistently, but slowly into a positive trend, I got back to proper working condition and cut the alcoholism to the social kind. \n\nUnfortunately, the revived smoking habit wasn't so easy to overcome, and I'm struggling with it even now. \n\nMental fortitude helped a lot, for the both of us. We needed each other after what he did, and that's what in the end, helped us most. Had we both been hesitant in our decisions and flaky on our acts of forgiveness, I don't think we'd have endured. Still, OP, whenever I remember what he did, a little bit of resentment ebbs in. In those moments I remember to forgive him, to remember everything good that came after the fact. And there's a lot of good. \n\nSo yeah, it's very important to invest in happy little memories and to restrengthen the bond after such a clusterfuck. You know, so you can create *new* pathways to happiness after the perfect one you thought the both of you would have, is no longer possible.",
            ">Like the person that first reported him ended up being in love with me and I had to get a restraining order against him... \n\nWait, did the person who reported him do it because he thought it gave him a chance with you? I mean, nobody should condone dishonesty, but wow, what an asshole if that was the reason.",
            "Caretaker fatigue is a real struggle, I feel for you.",
            "Time for your BF to be there for you.",
            "You might want to look at codependency books. Codependency is common among caretakers as well. When we have to keep it all together because the person we love is falling apart, that can lead to an unhealthy relationship and burnout, fatigue, frustration, loss of self and ultimately major strain on the relationship. I'm not saying that you have an unhealthy relationship right now, but you might want to look into it just to check and make sure that it doesn't develop that way.",
            "Despite all those negatives,You sounded like an extremely positive person in your first post. Amply career oriented too. Hope you will find your way and fight the alcohol addiction. All the best.",
            "I’m sending good vibes your way, OP. With that said, how are you feeling about all of this? Do you feel like your life or relationship has been put on hold for the last three years because of this? You’ve been together 7 years, are you still planning a future together? Does it kind of feel like he’s been rewarded for his mistake and in some sense you’ve been punished? I’m not trying to attack you or be in your face, it just seems like there’s a lot of potential for resentment on your part. Outside of therapy, I don’t really have advice for you. Hopefully a therapist can help you work through the resentment.. Also, I struggle with alcohol too, so I understand how easy it is to turn to it when times are rough. I just want to say I’m proud of you for going to AA. Again, I’m wishing you the best. It sounds like you choose to support your boyfriend and be a loving girlfriend and now you’re suffering because of it",
            "/r/stopdrinking can help you. Good luck. I don’t think I would have stayed with him. More power to you.",
            "There's advice in here about to stop your alcohol, and it is entirely agreed.\n\nCan completely understand where it comes from, though, so don't think less of yourself for needing an escape.  Stress kills.  You're doing good, check stuff out if you want to make it better.",
            ">Like the person that first reported him ended up being in love with me and I had to get a restraining order against him...\n\n😑",
            "Associate professor in 3 years or less at a well respected school? Really? Not doubting the rest of your story just seems a bit of a stretch there.",
            "What do you mean by caretaker exactly? Your boyfriend was unemployed for 2 years?",
            "You need to also be a little kinder to yourself-you're allowed to feel depressed and upset because your feelings are valid. Check out some help to stop drinking, because you deserve the very best.",
            "Wow after reading your post I’m proud of you for everything you’ve done, helping him and admitting that you have a drinking problems. Your on the road to recovery by admitting you have a drinking problem and going to therapy. You needed a coping mechanism and unfortunately found it in a bottle. You will get through this an be a stronger and more amazing person that you already are. Sending you virtual hugs. Good luck and happy life.",
            "Minus the alcoholism, this story turned out better than I'd have hoped after reading the part one. Your partner is extremely fortunate to have had your support through that trying time, and the fact that he landed on his feet afterwards makes me more optimistic after having losing an important job 10 months ago and struggling to regather myself since.",
            "Join us on /r/stopdrinking. It is my daily affirmation and helps so much with keeping my problem under control.  Good luck to you.",
            "I’m so sorry to hear what you’re going through, but it sounds like you’re on top of your illness and making progress. Take each day at a time, and don’t expect perfection. \n\nI’m glad to hear things turned out okay(ish).",
            "Not an alcoholic but very well could have been. However, I crushed opiate addiction; ie: Dilaudid, Heroin, so I can relate to the addiction part. Good luck!",
            "I have an addictive personality. I know if I picked up drugs or alcohol it could quickly get out of hand. The thing that I have found that really helps with relieving the stress of being a care taker is riding my road bike. I can be physically tired and mentally drained. I get on my bike and ride out into the countryside and come back renewed. As long as I am riding I feel no need for a chemical to change my mood. In my informal survey of a local AA group I found a group of people who said exactly the same thing. It worked better then AA for me.",
            "I don't have any advice but wanted to offer you words of encouragement and care. Keep up the good fight.",
            "Hey, just wanted to say that quitting drinking is incredibly difficult, but absolutely doable. I just passed 2 years sober myself. You CAN do it, but you need to stick to it, recovery isn't a one time process, it's a lifelong process. Especially with drinking because it is a large part of culture and you will find yourself in situations where alcohol is around all the time. Go to AA (or CA, NA, CMA, etc), go to groups, find other people around you who are in recovery and build yourself a support network. Figure out what your triggers are, write them down and figure out ways to get yourself THROUGH those situations. Have people to call, find stuff to do in your idle time. Learn about thinking errors, this is a big part of recovery and STAYING sober. Also I second the suggestions to learn about codependency. It doesn't mean that you are just overly dependant on your boyfriend, it's much more involved than that, and is a really interesting topic to learn about.",
            "Coming from someone who spent a lot of time in the recovery community: despite what ppl at 12 step meetings tell you, there are a lot of ways other than the 12 steps to successfully stay sober. All the best 💜",
            "Your boyfriend Jay is a very lucky man that he wasn't charged with forgery.  That being said I am sorry that this took a toll on you and that you have depression and alcoholism.  In regards to your depression you might want to see a psychiatrist as well because medication can at least help you manage the depression.  I wish you luck in your life.  And good luck on the memoir as well!",
            "I feel like I know you just by these stories and my heart feels for you. I wish you all the best and the fact that you recognize you need and want to get better is everything you needed to get that started. Lots of love to your career, relationship and health.",
            "I recently read an article in the Atlantic called The Irrationality of Alcoholics Anonymous. I'm glad that you are making an effort to curb your drinking, and am glad you are in therapy, but consider all the resources and available help in order to figure out what is most effective for you.",
            "One - I'm glad that it worked out, even if it isn't all rainbows just yet. Two - dealing with alcoholism will be much easier when you find an addiction therapist. For majority of people AA meetings work only as an addition to proper therapy.",
            "Go visit the sub stopdrinking. And read.",
            "Wishing you the best in your path to recovery and I'm so sad (also creeped out?)  to hear that your BF's coworker had this major crush on you that required a restraining order. \n\nI'm sure in a few years you will be crushing it",
            "You can do this, queen!",
            "After opening the post and reading the original, I was like \"Oh boy it sounds like the update is gonna be a rough one\"\n\nYet, look how far you've come in three years. \n\nDeveloping an alcoholism problem is troubling, however. My dad had one for many years. Yet, you are even taking steps to attack that issue - professional help is the best thing you can do for yourself. My dad was able to successfully quit. He made a promise to me and my sister on the day before her wedding that we would never drink again, except to share a single beer with me on my 21st birthday. He went on to keep that promise for the rest of his life. If he can do it, I know you can kick the problem!\n\nI wish I had good advice for your other issues at hand (handling depression, forgiving your husband, etc) but I simply don't have enough experience with these issues. If you think these are really big problems in your life, I strongly recommend seeing professional help, in fact it's possible these issues are things you can talk about and address healthily in AA, so you might not even have to shell out for additional therapy. That help will likely be more valuable than anything you'll get on reddit.",
            "[deleted]",
            "Congratulations on sticking to your boyfriend through 'better or worse' - and I'm glad he is doing well. I'm sure you will also come through your depression and drinking and conquer these, as you have grit and determination on your side. I have known similar situations, but as you mentioned in your original post, people don't particularly like talking about them, but the one I'm thinking of turned out spectacularly well in the end. (Who said if something doesn't end happily, then it's not the end? Can't remember!)"
        ]
    },
    {
        "post_id": "eaguyy",
        "author": "cb0415",
        "title": "My (23f) bf (24m) is driving me crazy with how rude he is at night because he’s a light sleeper and I’m not",
        "url": "https://www.reddit.com/r/relationships/comments/eaguyy/my_23f_bf_24m_is_driving_me_crazy_with_how_rude/",
        "score": 2539,
        "num_comments": 469,
        "created_utc": 1576308650.0,
        "selftext": "My bf and I have been together over a year and living together about 6 months. He’s an EXTREMELY light sleeper. We never used to have problems but I’m now on medicine that causes me to have more insomnia so it’s harder for me to fall asleep. Lately, we’ve gotten into fights because he’s being absolutely unrealistic about any noise in general. I can’t clear my throat quietly, sneeze or even yawn without him grumbling, groaning, or yelling at me at how “loud” I’m being. When I say yawn, I don’t mean some exaggerated TV yawn, but literally the sound of me silently taking in and expelling air from my mouth 3-4x over the course of 2 hours sets him off. Sneezing is very rare and it’s also quiet but if I have to make any noise, I do it as silently as possible, but it’s not enough for him. When I was extremely sick with the cold, he made ME sleep on the couch because I was having a tough time sleeping without being able to actually blow my nose to breathe. But, when he caught it a week later, I gladly let him sleep in the bed and helped take care of him when he woke up in the night because he wasn’t feeling well. \n\nI’ve argued with him multiple times that it’s unfair for him to expect absolute silence and be mad over the AIR he hears from a YAWN but he just shuts me down and tells me to be quiet because I’ve disturbed him from being “right on the edge of sleep.” I understand that when you’re half asleep you’re particularly grumpy, we’ve all been there, but it winds me all the way up that I already constantly have to cater to the way he needs tons of space (meaning I have to sleep pencil straight all night or on the side not facing him if I want to move my legs at all) and then this sound thing. I’ve had previous bf’s who were heavy sleepers that snored, made lots of noise and honestly that bothered me less than constantly having to be alert to his needs. \n\nHe says that ear plugs don’t work and he only likes to hear the fan so white noise is out of the question. I don’t want to go downstairs because then I’ll just stay up and I don’t want to keep taking melatonin every night but I’m this close to not renewing our lease together next year if things don’t change. It also makes me feel like if we got married and had kids he’d just expect me to be up all the time dealing with the baby so he can sleep or complaining about his sleep or if one of us was to have a chronic sickness that we’d have to sleep in different bedrooms because of how selfish he is. What should I do? \n\nTL;DR: bf is being selfish and unrealistic about any noise, no matter how quiet, that disrupts him from sleeping\n\nEdit: for now, sleeping in separate bedrooms would not be an option since we live with 2 other roommates until we graduate from college in May so the only other spot is the couch which would be inconvenient for everyone involved. Also, I’m not the kind of person that wants to sleep separate from their partner if I can help it.\n\nEdit 2: WOW. This is my first post to have ever blown up. Thank you everybody for all your insightful responses! Truthfully, a lot of you are correct in the fact that his selfishness and gaslighting extends to many other parts of the relationship. There have been many times where we’ve almost broken up but he always wants us to work out so it doesn’t happen. Personally, I had life threatening blood clots in my lungs over the summer (hence the medicine I have to take to live which makes me an insomniac) that he was there for every step of the way. So it’s hard to end the relationship after going through something like that with someone you love and worrying that the next person wouldn’t get all the feelings that come with it. I’m going to talk to him again and see what compromises HE can bring to the table. If not, I think it’s time for a break.",
        "permalink": "/r/relationships/comments/eaguyy/my_23f_bf_24m_is_driving_me_crazy_with_how_rude/",
        "comments": [
            "[removed]",
            "Why isn't **he** the one on sleeping meds?",
            "He’s a bad partner. Not because it’s difficult to sleep with, because he completely refuses to compromise with you. What else does he completely refuse to compromise about? What is it like negotiating with him generally?\n\nWe move through the different stages of a relationship basically trying to find somebody that we can form a long-term relationship with. Each stage of the relationship from the initial attraction, through to putting IKEA furniture together, or putting up a tent in the rain, teaches us something about the compatibility of that partner. \n\nSo it’s not about your sleeping patterns, it’s about the broader compatibility within a relationship where he is not prepared to negotiate a compromise on something which affects both of you. \n\nYou’ve reached a point in the relationship where, unless he is prepared to change, you can go no further, because you simply don’t have a functional partnership with someone who’s not prepared to negotiate, compromise, or change. And if you can’t do this about something as straightforward as sleep, then you are quite right - you cannot have children with him. I can’t begin to imagine negotiating night feeds with someone like this.",
            "I’m a light sleeper and my partner snores really badly. Like so badly, that when we shared a hotel room with friends, they couldn’t sleep soundly and asked me how I deal with it.\n\nWhat we’ve agreed on, is that I can lightly shake him, ask him to turn over, or even turn him on his side myself if he’s not being responsive. It doesn’t affect his sleep quality and it stops the snoring long enough for me to fall asleep.\n\nHowever, I don’t get to yell at him for yawning, sneezing, or making noise. That’s absurd. And on the rare occasions he’s just too loud, I get up and move somewhere else. I don’t kick him out of bed.\n\nI think you either need to come to an agreement with your partner about what constitutes “too much noise”, what actions can be taken, etc. or get separate rooms. Right now he’s being too selfish and frankly dramatic over normal human noises. And in my opinion, unless there’s extreme circumstances the partner with the problem with noise should get up and move, not force their partner to sleep on the couch.\n\nEDIT: also I would think twice before having kids with this guy if you don’t want to be stuck doing more than your fair share of childcare. Doesn’t sound like he’d be fair there either.",
            "There are plenty of people in the comments suggesting separate bedrooms, which is fine if you want to stay together, but this guy 1) gets actively angry at you for doing literally anything on what I assume is a nightly basis, 2) kicks YOU out of bed when you’re sick and need sleep even more than usual and 3) appears to show no consideration for your feelings or willingness to compromise in any way. If you want to stay with this guy by all means get separate bedrooms, plenty of successful couples swear by it. However, you do not deserve to be talked to this way or treated this way, whether it’s about sleep or anything else. I would recommend thinking about if this is the only time he ignores your feelings, speaks rudely, or belittles you. It might be worth reconsidering the whole relationship.",
            "What has he tried to help his sleep?  Earplugs, black out curtains, abstaining from caffeine, staying on a strict sleep schedule etc?  \n\nIt sounds to me like the only effort he puts forth is telling you to modify your behavior.",
            "Definitely don't renew the lease.\n\nI'm sure that out there somewhere in the world is a woman who is able and happy to stay completely still and silent at all times so as not to disturb his majesty's sleep.\n\nBut this mythical woman is not you.\n\nI'm not saying he's necessarily a bad person.\n\nI'm just saying he's:\n\n- a really shitty boyfriend\n- not the right guy for you\n- not the right guy for 99.99% of women on the planet",
            "I can relate to him a bit, the tiniest noises at night drive me crazy, sometimes even my own breathing. However, that is MY problem, not my partner's, and if my partner is being too loud, I'm the one moving to the couch.",
            "DO NOT RENEW THE LEASE",
            "He’s extremely selfish and if he’s unwilling to take real actions to resolve this, he doesn’t really get to share a bed with his partner. He’s refusing to budge and holding you nearly hostage; sleeping pencil straight, don’t move your legs, don’t sneeze or breathe too loudly? But *earplugs are out of the question for him???!!?!!??*\n\nHe doesn’t get to dictate this, and he appear to believe he does, strongly. Partnerships are based on compromise and cooperation, and he’s showing you how selfish he can be. Why is your comfort worth less?? Even if sick, or on new meds?\nI think you may believe this lack of empathy is acceptable because it’s only when it comes to sleep...but this is a pretty big pattern. \n\nHe needs to research and invest in solutions for this, and you need to start living like a normal person in your own home. Look past the behaviors together and understand what the key motivator is; that’s your problem. The problem is, he believes he is entitled to his most ideal, perfect state of comfort, at your expense, with little care for your right to move or breathe freely.",
            "I wouldn't renew the lease. He sounds very unsympathetic.",
            "My partner is a light sleeper and would get agitated with my light snoring bc he needs absolute silence and darkness to sleep. We talked about it, decided there wasn't much we could do bc really it's just me breathing and he decided to get ear plugs. \n\nIn the middle of the night, I can understand how it can be annoying to not be able to sleep, but the way you describe him makes him sound like an adult baby.",
            "So it’s his problem, but he refuses to take any measures to help himself, and puts the blame on you for not coming up with a solution. At this point I’d be fed up and just keep repeating that he’s being a huge baby about it.\n\nAlso, what specifically does he want you do? Not yawn? I’m sure he understands how ridiculous that is",
            "Tell him to find a compromise or a new lease because this involves many areas of a relationship.",
            "You know I’m a light sleeper too with insomnia (double whammy!) and I can relate to your bf. In fact for 1.5 years I dated someone who snored like a gd freight ship. I can’t even tell you how loud it was! But you know what? Light sleeping was sort of my problem and I had to solve it. \n\nAfter years of effort, I’ve got a routine down that helps a ton: intenseass earplugs (took a couple years to find the ones that work for me), an eye mask, a weighted blanket, a friggen body pillow, lavender oil drops on the pillow sometimes, and some sleepy time tea/etc. routines to get into a sleepy place. My current bf is pretty considerate and tries v hard to be quiet, **but that’s really all I could ask of him.** The rest is up to me to figure out. **If I want to be in a relationship with a living, breathing, sometimes sick human, I need to learn strategies for how to deal with that.** \n\nYour bf effing needs to deal with it, too, bc right now he seems to have this sour mindset of “WELL IF I CANT SLEEP NO ONE CAN!” with the moaning and groaning. I’ve been there, it’s so petty and just makes everyone a monster. Maybe try telling him that? And suggest some strategies I’ve used/some websites that might help him? That’s really all you can do. If he keeps treating you like a jerk for yawning though? Then like........that’s not a good look for future issues that can come up in relationships. \n\nI’m too lazy to read a million other comments so sorry if this has already been said a ton—but then again, if it’s already been said a ton maybe that’s further evidence of how obvious it is that he really needs to acknowledge that light sleeping is his problem and he needs to deal with it and being rude to you is not a way to deal with it.",
            "I would have a sincere talk about fairness, like see if he's able to meet you in the middle or compromise when you're sick. If not, you may just be one of those couples that has separate rooms. I know tons of people who have been married for a very long time and have separate rooms cause one snores or something",
            "I'm a light sleeper too. It's my responsibility to take the necessary steps to be able to sleep. It's your boyfriend's too. Not yours. You are permitted to exist as a human, and he needs to do what he needs to sleep with another human doing human things in the room. It's incredibly selfish for him to be so demanding and unbending. You aren't doing anything that would require compromise on your part. \nAlso he should speak to a therapist, because a big part of why I am a light sleeper is my anxiety (my guard is always up). Therapy has helped me with techniques. I don't think that's necessarily your bf's issue, but therapy might uncover something and also help him be less of a giant dbag.",
            "Being a light sleeper is one thing (and wearing earplugs every night isn’t good for the ears), so separate beds may have to be the answer. My partner and I have to have separate bedrooms for this reason, but we snuggle etc before we go to bed and after waking up. \n\nHim being unpleasant about it is absolutely not acceptable though. Does he blame you for other things that are totally unreasonable? A separate conversation about how he treats you is essential. And how he’d share responsibility for any kids.",
            "Fiancé snores, my cat snores, I fart, kick the cat, and cuddle with the fiancé. we all make noises and at the end we all sleep. \n\nDon’t renew the lease!",
            "Yikes. He seems exhausting... I think you deserve better",
            "He sounds awful and this is bordering on emmotional abuse.",
            "I think your assessment that he would expect you to tend to your children at night is probably correct.",
            "Break up. He sounds like a fucking nightmare and life is too damn short.",
            "He is a bad partner who is inconsiderate, entitled, and ignorant. \nPlease dump him and stomp into the new year as loud as your heart desires.",
            "He needs a sex doll he can switch off at night and perhaps a live-in maid and a paid companion, because he is not at all ready to have a full live-in relationship with an actual human being.",
            "god what a big baby.\n\nDon't renew the lease, you deserve better than someone who only cares about himself.",
            "Well he sounds like a keeper! Find yourself a decent man.",
            "You're NTA, he is. He's selfish and rude. From experience, I can tell you that doesn't change. Get out whole you can.",
            "This guy is a selfish asshole. I bet if you start examining your life together you will notice this behavior pattern in other areas. If he is this selfish about sleep he's not ready to be in a relationship because he's not prepared to give and take. You need to move on.",
            "Dont waste your time with someone who wont compromise with you. He's a poor partner.",
            "Yes I sleep with a fan right by my head (pointed away from me in the winter) because I can’t deal with noises at night. Your bf needs to work on finding solutions for his issues rather than expecting you to make all the changes. Sleep is so important and affects quality of life so hopefully you can both get back to getting good quality sleep!",
            "I am the light sleeper here. I was worried about spending nights with my boyfriend when we started dating in college because he is heavy sleeper. Somehow I just got used to it after a while. I slept over 1-3 times a week for 3.5 years before we moved in together 6 months ago. I am still a light sleeper but those small things like yawning or something don’t wake me now usually, it just takes times but if he’s fixated on it being a problem then it won’t resolve. He’s gotta relax about it a little bit. Then again I’ve seen several stories about couples sleeping in different rooms and it makes their relationship better. \n\nThere have also been nights where I’m falling asleep and he can’t get comfortable which then wakes me up again and it’s frustrating but they don’t happen often. It’s about communication and compromise but if something really can’t change that’s a bigger convo for sure.\n\nWhen I still lived at home and during hs I was angry like him regarding my family being loud. \n\nFans help drown out some of those smaller noises.",
            "My ex-wife struggled with a similar issue.  She had problems sleeping at night(high anxiety) and any noise I would make (occasional snoring, breathing, moving, etc.) would trigger her.    \n\n\nShe was generally unhappy with her life and I believe this 'annoyance' was a symptom of that larger issue.  It sounds likes maybe this guy has some larger issues that he's projecting on you.",
            "My ex grumbled and made me fee guilty about my constant ‘tossing and turning’ in the night that kept him up. He insisted i control how I slept at night, like how does anyone do that? But I was stupid and wanting to please the man who was voluntarily unemployed and living off his parent’s money I started sleeping straight jacket style and being terrified of disturbing him. One of the best things about the break up was not having to feel guilty about something I couldn’t control. I guess what I’m saying is your bf is a selfish idiot and breaking up with him is probably the wisest option.",
            "I'm a light sleeper/insomniac. He should try sleep med because anyway it's not a way of living, for 20 years I lived with it until its started to affect my job during the day (I'm working in a daycare, you have to be on alert all the time). Its just get worse when you get older(I'm 30 years old) so he will need help with it later in in life. \n\nI try 3 time to get meds, the first(19) and second(23) time the doctors totally refused, saying I was too young for this, its has really bad side effect and create a addictive effect. But when I stared to not functioning normally at my job and could not take it anymore, the third doctor finally said yes 5 months ago! A new meds was out by then, no side effect, no addictive effect. BRO ITS CHANGE MY LIFE, finally I can get now 8 hours straight of sleep without waking up! Only one thing, I can not take it every day, only 3 to 4 time a week or 24h delays between or else my body get use to it and stop working. So I take it only if I work the next day. \n\nIts ridiculous that he is acting like this with you because HE doesn't sleep well. I feel so bad when I have insomnia because i toss around a lot and I dont want to wake up my partner. Because you know its really feel awful to have sleep deprivation so I dont want my partner have it too, just logic here. If you are a young couple and he is already acting like that, it's not going to be better it's going to worst. He need to make compromise, see a doctor's, try to found a solution because he is the one having this problem, not you.",
            "If you wanna stay together, you guys are gonna have to sleep in different rooms, sorry. Guy sounds like an asshole though, I think you can guess what I'd suggest instead.",
            "I’m a light sleeper. My boyfriend gets mad (more like “mad”) at ME if he finds out I haven’t tried to get him to stop snoring, and is upset if I sleep badly — I.e., he genuinely cares about my well-being. I’ve had partners like yours before, and that behavior was not isolated and was one of multiple red flags.",
            "I’m the light sleeper in my relationship. Sometimes my fiancé wakes me up at night and I can’t go back to sleep, so I go to the couch. Or I take a Benadryl so I sleep through the shuffling noises and movement when he gets into bed. He compromises by coming to bed earlier so the shuffling in the bed doesn’t wake me. He is considerate of my needs, and I also take ownership of myself when I know being a light sleeper is my problem and not his. I would sit down with him in the day time, in a calm environment, and talk about this one more time. He needs to take ownership of himself - be it through removing himself from the situation because he is the one with the problem, ear plugs, a noise machine, or medication. If he refuses all solutions except the one where you sleep like a silent pencil, ask yourself this - do I want to spend the rest of my life with a man who won’t compromise with me and who doesn’t care that I’m suffering, too?",
            "He seems extremely unreasonable and is likely incompatible with you due to his douchey behavior. Sorry you are having to deal with that. \n\nFor the short term though, maybe try a white noise app on your phone that has a fan sound setting. I'm a light sleeper and insomniac, and I have an app like that so I can have the fan sound to drown out other noises without having an actual fan blowing air in the room.",
            "Okay so everyone here is pretty right, so I'll be lame and bring up earplugs. I thought they didn't work for me either BUT I found silicone putty ones that are amazing at blocking out sound. I work 3rd shift so I needed something comfortable and that works really well since I live in a first-floor apartment and the neighbor above me is a new mom + stays home all day.\n\nBut aside from that tbh I don't think the earplugs I mentioned would help because he sounds like he doesn't want to even try.",
            "Tell him to stop being a little baby and wear earplugs",
            "I have PTSD and am triggered by a lot of going to sleep activities and used to react very much like him. He might need some therapy to work through building resentment over this issue.\n\n\nWe now largely sleep in separate bedrooms, which I understand you can't do but keep in mind for the future - it's really saved our relationship. \n\n\nMaybe develop rules - either the person who can't fall asleep goes to the couch, or the person who is sick always gets the bed, etc.",
            "So my understanding is that one person is caring (you) and the other person enjoys that care but doesn't return it (bf). At least in this way. Maybe he is wonderful outside of this. BUT sleep is so important for your health and even the relationship itself. \n\nYour bf should care about your quality of sleep the same way you care about his. This means he should be willing to compromise because clearly you have been, except it's less like compromise and more like letting bf get his way without him having any consideration of you. \n\nAnd making you sleep on the couch when you're sick... you deserve the bed when you need to rest and heal. \n\nI really hope you figure this out and maybe bf is going through something, but if you decide to end things that's okay too. Support all around as long as you do what's best for you! <3",
            "Run Forest, run as far away as possible from this type of attitude and lack of respect. Seriously.",
            "> Also, I’m not the kind of person that wants to sleep separate from their partner if I can help it.\n\nFirst, let me touch on this. I'd bet that pretty much every couple who sleeps separately thought the same thing at one time. I did too.\n\nBut when you find someone who is otherwise an absolutely perfect person for you, kind in every way, 100% compatible.. sleeping apart is nothing. My boyfriend is without a doubt \"my person\". I'm the light sleeper (I was never rude/angry to him). It was cutting horribly into my quality of life and I was miserable. I was getting up after a few hours of horrible sleep and moving to the guest bedroom every night.\n\nOnce we finally called it like it is and I started just going to bed directly in the other room, my sleep improved dramatically. We occasionally sleep in the same bed -- when I'm drunk and could sleep through a fire.. or when we get a hotel. But even then, we get double queens if we can help it. (It wasn't so much the sound for me as it was the heat of sharing a bed)\n\nALL OF THAT BEING SAID -\n\nYour boyfriend is acting like a jerk. This isn't about sleeping together or separately. This isn't about each person's sleep patterns. This is about how he is treating you for something that you cannot help.\n\nIt sounds like you don't have a lot of options as far as the sleeping situation goes. So I'd say, in this order, I would:\n\n1. Talk to boyfriend and tell him exactly what you laid out here. Tell him he needs to look into ear plugs, white noise, whatever. They have soft headbands you can sleep in that have bluetooth speakers in them, even. Tell him he needs to consider melatonin (take 1-2 hours before bed, it is not a sleeping pill) or other non-addictive sleep aids.\n\n2. If the above does not work, it sounds like you have no other choice but the couch. You can't kick him out of the home (would be nice), nor can you just leave the home if you have nowhere else to go, so there's not a lot of option left. I'd tell him that if he cannot handle sleeping with you and wants you to take the couch, that needs to come out of his rent. No way should you be paying equal share to not have a bedroom. If he refuses, then he needs to go to the couch. If he won't, make him miserable enough to do so.\n\nI have to echo what others are saying as well.\n\nIt is too little too late, but you really shouldn't be living with boyfriends after only 6 months as college students. I'll even go further with what I am sure might be an unpopular opinion around here, but couples living together in a bedroom with multiple other roommates is a recipe for disaster. You have nowhere to go in the home to escape when you need it, because your home is shared with two other people. That is crowded and miserable.",
            "I dated a guy exactly like this when I was about your age. He would hear me snore and start punching walls and swearing and I'd wake up so scared and confused. I ended up getting nasal strips, which still weren't good enough. And then I ended up getting my tonsils out which still wasn't good enough. \nHe never compromised on anything either. We broke up, which was my decision but of course he somehow had me feeling like I was dumped. \nIt was all emotional abuse tactics and just straight up immaturity.\n\nHe needs to grow up, OP, and be a respectful partner , make compromises or sleep on the damn couch. Or you just throw the whole boyfriend out. But his reactions are meant to guilt you for something you can't even control. He needs to chill or GTFO. \n\nIf he won't change, seriously consider ending things. Because that kind of behavior isn't going to stay in just one part of the relationship and eventually one of you will end things - it's better for it to be you who takes on that power and not have him trample on you in that way too.",
            "There is a thing called misophonia. My partner has it. It's sensitivity to sound. Often to specific sounds. So for him it's chewing, snoring etc. During the day we are good. At night... well, if I'm snoring unless he's absolutely shattered, no chance. Sometimes even slightly heavy breathing will wake him and then he just zones in on it. It's not something that he can help. \n\nHe can help not being an asshole about it. He used to go to couch or spare bed when he couldn't get to sleep. He tried initially to power through, but he would end up tossing and disturbing me. Now we have our bedroom set up in one room, and spare bed in room next door so he doesn't have to go across the house to get sleep, and so that we can still be near. I go over in the morning for snuggles if he ends up moving. \n\nHe has never ever done any accusations about me ruining his sleep- he knows it's his head that's messed up. I try and be sensitive and use nasal spray etc. I also don't guilt trip him or throw shit fits about him sleeping separate (his exes did). \n\nWe have tried ear plugs, even the Bose white noise which were decent but he would often only need them partway through the night and would then have to turn on his phone, start the app etc. Plus even those aren't super comfortable long term. \n\nYour boyfriend is being a childish and selfish. If he can't sleep he can go to the couch. I would tell him that he's being unreasonable and selfish. And that if he can't sort his shit out that you won't renew the lease with him.",
            "I have the same problem as your BF: can only sleep with fan noise, will wake up at the SLIGHTEST SOUND. Earplugs DO NOT WORK. I also suffer from insomnia, so If I DO manage to fall asleep and I get woken up, it's game over. My husband SNORES so trying to figure out how to make our relationahip work through my stupid sleep issues was a trying experience. There was alot of fighting and alot of nights with one of us on the couch. At several points, we even debated breaking up because we just weren't suitable. But I found sleeping headphones! And they work! I play a YouTube fan through the sleep headphones and it drowns out most noise. If I'm having a particularly sleepless night, I can put in earplugs under the headphones. I also started taking Unisom with Doxylamine instead of diphenhydramine. These two factors along with a regular bedtime helped me immensely.\n\nI hope you two find something that works for you. I know the struggle and feel for you",
            "I'm a light sleeper and felt this in my soul. It's sucks for both, maybe get a white noise machine or something, if everything fails I'd say it can break a relationship.",
            "Geta louder fan..my bedroom is a wind tunnel. Nobody hears anything.\n\nAlso for white noise a fan is a common option. Check the white noise app.",
            "Been there and done that, they just get worse as you try to cater more and more. I’d leave that alone as soon as you can.",
            "I’m a light sleeper, my partner is loud. She snores etc. i just go to the couch some nights and sleep there. Overtime I’ve learned to cope with the noise. I couldn’t imagine sending her to the sofa when she’s sick or snapping at her because she’s basically breathing.",
            "As someone else who is driven crazy by noises when trying to sleep, he is being absurd. Ear plugs work great for all but the most excessively loud noises, i.e. very loud snoring, etc. He could try noise cancelling headphones find some sort of white noise, fan noise, etc, he can tolerate. Otherwise, **he** needs to sleep by himself because he is the one with the unusual behavior.\n\n\n\nAs an aside and perhaps more importantly, the way he is treating you is completely unacceptable. Next time, you should absolutely ***refuse*** to leave the bed and he can sleep elsewhere. \n\n>  Also, I’m not the kind of person that wants to sleep separate from their partner if I can help it\n\nThis may be an incompatibility then, because unless he can learn to manage his issue, and yes, it is his issue, this is going to persist.",
            "How are things going in the rest of the relationship? If he is only disrespectful here then maybe he really does need his sleep and u are disturbing him. If there are other things then I’d leave him bc he will take advantage.",
            "ear plugs and eye mask for him,  and depending on your state,  Indica-dominant cannabis for you to combat the insomnia. Or try sleeping with something simple on like pink noise.",
            "He is a very selfish and bad partner who is not willing to work together with you to fix this problem. His only solution is kicking you out of the bed because even your breathing bothers him... wtf. This would be a total deal breaker for me. Either he goes to a sleep clinic to solve this problem or you would have a very miserable life next to him. He is the one with the problem, not you!",
            "I would dump that guy he's incredibly rude and selfish and you shouldn't be treated like that. He kicked you out of the bed when you were sick...that's some real asshole behaviour.",
            "This guy is a jerk. Why jump through hoops to justify or placate any of this behavior? Don’t renew the lease with him, and consider seeing other people.",
            "So what has he done to mitigate his sleep problems? You make it seem like he literally does nothing about his sleep needs other than demand that you change--is that right? Has he tried things and they didn't work? Like what is he doing on his end?\n\nI think the more pressing issue is that it sounds like he's pushing the burdens of his own condition on you, rather than acknowledging the efforts you've made and trying something on his end. Have you sat down and explained to him \"Look, I'm doing all I can, you have to figure something out for you to try if this isn't enough\"? Cause yeah, imagine what this is going to be like when there's a baby wailing almost 24/7 in your house and it's time for him to go to sleep. His condition alone isn't the issue; it's also his attitude that it's not on him to fix and that he can literally eject you from the bedroom when sick to accommodate his own comfort, that's an issue.",
            "My partner and I have this almost exact issue. He has insomnia and is a restless, loud sleeper. It drives me insane!\n\nHowever if he wakes me up and I cant go back to sleep I will go to the couch. I don't get angry towards him (on the outside anyways) and we try to find solutions together. \n\nSome nights this means he doesn't come to bed because he knows he will have a bad restless sleep and he doesnt want me to lose sleep over that too. Some nights it means I stay up late to soothe him to sleep. It's about compromise. \n\nThe fact your boyfriend is unwilling to do this shows he does not care about you as much as his own comfort. That is not really his fault but it doesnt mean you have to put up with it.",
            "I’m 39.  My wife and I sleep in separate rooms on weekdays, same room weekends.  It’s made us both happier.  You can also try a loud fan... or loud air purifier (the cheaper the louder) really helps drown out any noise.",
            "Sleep in different rooms unless he’s a pain in the ass about other shit. Then ditch him because he sounds mean and unaccommodating",
            "Do not renew the lease, and honestly, both of you should see a sleep clinic if you plan on staying together at all. He sounds exhausting",
            "So tell him all of this!\n\nLiterally tell him what you told us.",
            "Get him earplugs for Christmas.",
            "Yikes, I'm totally your partner :,-( What helps me: sound machine, valerian root, asking my partner to stay in another room if they are awake and wait for an hour and a half after I've fallen asleep to come to bed (if they dont go to sleep w me) because by that point I've reached a deep sleep and cant be as easily awaken. The no coughing is ridiculous... but it does annoy me when he taps his foot or bangs on the covers cos he is watching sports w headphones on, I've put a stop to that!",
            "I used to be a super light sleeper. And then I went through 4 years of college and living in college housing. I learned how to not be a light sleeper.",
            "So like. Sleep is really important. For you, for him; for everyone. I feel like the inability to sleep well together, and he isn’t meeting you in the middle anywhere; sounds like you should just throw out the whole man. If you want the relationship to work, be just as firm as he. Have that conversation, set the boundaries you’re comfortable with, and see where it goes from there: but you deserve good sleep too.",
            "It might be just me and the small number of relationships I’ve been in, but I’ve found the more a person annoys me, the less I’m actually that into him. Not that really loving someone excuses him from annoying me, but if I’m NOT that into him, the stupidest things about him make me crazy. \n\nI’m not suggesting you dump him, rather, I’m suggesting you ask him if he feels trapped in the relationship because of the lease. If so, work out a plan to either live separately and stay together, or maybe that realization will be enough for you to see he’s ina different place than you and you deserve someone who your very existence doesn’t annoy. \n\nAnd if he truly does love you, and this is the best he can do as a partner, and you prioritize sharing a sleep space, maybe he’s not the best match? I know plenty of couples who are light sleepers paired with snorers who sleep best with their partner next to them. I also know couples who both prioritize sleep time as sleep time and have separate rooms, but both have to feel that way. If one doesn’t, they just really aren’t a good match.",
            "My sister has an SO like yours. And she's a soon to be mother of three. One thing that sticks out is your SOs inability to compromise. You knew that already, so noone in this thread tells you something new by mentioning it. The only one who can make a compromise here is you - even though I would advise strongly against it I guess you want to keep your partner in your life.\nSo here is my sisters solution :\n\nNot many bedrooms, no monetary assets to change that.\nThis family made a mini room for the light sleeper, pretty Harry Potter like, with only one very comfy bed in, nothing else. Here he sleeps and is content with it. My pregnant sister on the other hand sleeps with the baby in one big bed, sometimes the 5yo joines them when she doesn't want to sleep alone. You can make a wild guess where the newborn is going to sleep...\nMy sister is \"allowed\" to bring the baby to him in the morning so that she can maybe sleep for one or two hours, depending on the mood of the light sleeper and the other kid. This is her life now. And it could soon be yours.",
            "Turn the fan on for noise!",
            "Truth time. Its not mainly about the sleep. I feel Hes either a Narcissist or just a jerk. Also if you really love someone , you find a way to work through this. I think the relationship is convenient for him but hes not that into you. Im sorry. Besides , do u wanna be stuck with someone who acts like this ? Seriously look up traits of a Narcissist or covert Narcissist. I bet he fits the bill. One trait is how he is handling this. I know from experience. Prayers.",
            "This is how my narcissistic mom is. I was whispering to my dad the other day and she woke up screaming at me for being too loud.\n\nHonestly, these are major red flags and you need to leave. That's why I think it's a brilliant idea to live with your SO before you get married or whatever so you can see how they really are.\n\nIf he is like this now, and y'all plan to have children, imagine how he is going to treat you when you wake up having to pee every 5 mins at night.\n\nThere is no compromising with someone THAT much of an asshole if he won't try to compromise first.",
            "The fuck are you letting him kick you out of your own bed--ever? If he's the one who has issues with noise then it's on him to be finding a solution. I'd be just flat out breaking up over this. He refuses to compromise, refuses to discuss any solutions and seems to blame you for all of the problems. This relationship doesn't have a happy future.\n\n\\> I’m not the kind of person that wants to sleep separate from their partner if I can help it. \n\nIf my partner were like yours, I'd be sleeping miles away from him.",
            "I’m guessing sleep is not the only thing he’s a jerk about. I would find a new partner if I were you",
            "He should exercise way more.  Will help his sleep.  That and weed.",
            "Id say get a white noise machine. I'm a light sleeper as well and my gf can snore VERY loudly at times. The white noise machine may bother him at first but after a few days he will get used to it. Alternatively you can use apps that do the same thing. Personally I use www.rainymood.com and my gf can snore all night long and I will stay asleep.",
            "I would break up with his ass in a heart beat.  If he overacts on this.  Imagine when something comes up that isnt as pety. Think longterm.\n\nIm getting married soon. I woukd never do that to my spouse.",
            "Personally, i would wait until he is asleep and then take 2 cooking pots and bang them together as loud as you can an inch from his head. Let him know these are the kind of noises it's ok for him to get angry about. A yawn or a sneeze is not. I bet he thinks twice before yelling at you again.",
            "These are the kind of things when thinking about, \"Hm, is this something I can handle for the rest of my life given the other positives my partner may bring in?\"\n\nIf the answer is no, there is no shame in it.\n\nBut if the answer is yes, I'm sure someone in the comments has a decent solution/compromise.",
            "I think if you’re both ok with it, you can sleep in different bedrooms? That should help with this issue and honestly there are many couples which do this because of similar issues",
            "From what you have presented here, you guys are not ready (and probably won't ever be ready) to be living in one location together with one bed.\n\nIt should be so much easier than this.",
            "I see in your edit that you’re not wild about the idea of separate bedrooms, and I can understand that. When a lot of people hear a couple is sleeping separately their first thought is “wow they’re having problems” or “they must not love each other anymore.” The general notion in society is that sharing a bed with your partner is supposed to feel wonderful and intimate and safe if things are going well. But that’s all just stigma. No one gets to tell you that your relationship is bad or failing because you don’t meet their expectations of what a relationship should be. \n\nMy dad and my stepmom had separate bedrooms for their whole relationship (about 10yrs, he’s passed away) and they were very happy with that arrangement. My stepmom went to bed pretty early. My dad was a night owl/insomniac who snored louder than anyone I’ve ever heard. Every night my stepmom would go to bed and my dad would go tuck her in and they’d cuddle and talk and then he would go back to watching tv or doing chores or eating dinner at 10pm like a weirdo. He usually had to be listening to something to fall asleep too, so them trying to sleep in the same bed really wouldn’t have worked out well. \n\nIf you’re really not happy, I don’t want to convince  you to stay. But if this is the only big problem, I would try sleeping separately (when you can) and see if that helps. It sounds like neither of you have been sleeping well for a while and I know I can be really irritable when that happens. Just remember that your relationship is YOUR relationship. It is not less successful or happy just because it’s not exactly the same as other successful happy relationships you see.",
            "Ahahaaaa I tend to be guilty of this (not yelling but grumbling). It sucks, but I really cannot sleep when my husband is awake. He'll snort his nose loudly, keep on turning, making all sorts of weird sounds. It pisses him off because he can't just be normal (according to him) in bed, he's feeling guilty for even the slightest movement, and it pisses me off because he's keeping me awake and that is not the best time of day to keep me from my physical needs. I'm not doing it on purpose, but the slightest sounds and movements wake me up and that's fine, but if they keep happening, I can't fall back asleep. The way you describe yourself sounds like an absolute nightmare for me to be in bed with.\n\nReally the only solution is to sleep in separate beds if either one of us has trouble Falling back asleep. (My husband is a light sleeper himself so fortunately he does understand why I keep waking up). So if one of us has a cold, the other one moves to another bedroom. And yes, I can imagine that if we have a child and I'll have to breastfeed at night, we'll be sleeping separately as well, to not ruin both our night's sleep. It does not however mean we love each other less, and when neither of us is stressed or has a cold, we can sleep together fine. It's ok to sleep separately if that's better for your health :)",
            "I am an extremely light sleeper, and I deal with it with wax ear plugs. It took me two weeks to get used to them, and now I sleep way better. \nCommunicate with your bf, and maybe suggest this solution. He might be irritable because he is tired but he can t expect you to tiptoe that much around him. This is not healthy in any relationship. \n\nAlso, he might want to go to a doctor, because there might be an underlying cause to this sleep problem (sleep apnea and so on).\n\nCommunication is the key, and if speaking about it does not work, maybe try writing, I find it easier to communicate about sensitive issues.",
            "He should give the white noise machine a try even if he thinks he won’t like it.  \n\nI am a light sleeper and my husband is a snorer and we got in so many arguments and spent so many nights sleeping separately.  I refused to try the white noise machine for years because I insisted it would be more annoying noise.  Anyway...we got a white noise machine finally and I sleep fine next to him now.",
            "My wife and I have a similar problem, we finally settled on using a loud fan in our room at night. (Literally bought a fan off Amazon that had bad reviews because it was so loud). The constant louder noise helped mask the smaller noises I made while she was trying to sleep. Good luck.",
            "Try moldable silicon ear plugs.  They work much much better than the usual little orange guys.\n\n(Also, he needs to get a frikkin grip)",
            "Stay up-to-date on your birth control methods because this is not a person you ever want to have kids with. You’re right. He will most likely leave all of the middle-of-night child rearing to you. And there’s a lot the first few years at least. \n\nHowever, on the off-chance that his light sleeping and your insomnia can be solved, you should both go to doctors about those issues. Sleep medicines can be prescribed so that you are taking safe amounts and not just guessing with melatonin. And he may need some, too, because “light sleeping” like that sounds like there’s an underlying medical issue.",
            "As someone who is also a light sleeper: get a Honeywell fan and have him turn it on high right next to him facing away. They are loud but smoothly loud so it's not distracting.\n\nBeing a light sleeper sucks, people who aren't light sleepers don't know how frustrating it is and how every little noise is like pins being jabbed into your skin. \n\nHe should try the fan though. And if you are sick he should sleep on the couch if he has difficulty sleeping.",
            "A fan is literally a white noise maker....that is literally the sound it produces.\n\nIt's not you that's the problem it's him. Maybe he should be taking the melatonin (which btw only helps you fall asleep not stay asleep so this might be part of the problem right there) so suggest to him if he's such a light sleeper that he finds a sleep aid that keeps him asleep(I'm a light sleeper as well but not this bad) maybe he needs a sleep study to show why he's such a light sleeper. Idk...but he's the problem NOT YOU.\n\nIde also talk to your doctor about maybe getting a different med. Having constant insomnia just really isn't ok, because the next day your body just has that much of a harder time dealing.",
            "I'm a light sleeper too and my ears ring very loudly in complete silence most if my family is this way so I like them use a fan. Go buy a big box fan set it in the room and he won't be able to hear anything but that and if he still complains then tell him to sleep on the couch or go get another place to live.",
            "I’m the light sleeper in my relationship. I use soundproof headphones and listen to soft music/white noise. This could be the solution his problem. \n\nHe should be actively trying to solve it instead of placing rules on your very normal and human behavior while trying to fall asleep.",
            "Yeah I’d probably dump him. Imagine having a baby with someone like that.",
            "My husband and I used to go through something similar to this. He's the light sleeper. I was adamant that we would not do separate beds. What ended up working is a fan constantly running at night for white noise.",
            "I don't have any substantial advice but he should keep trying with different brands of earplugs. I'm a very light sleeper and I use Mack's Ultra Soft Foam Earplugs. They work wonders. If he's going to keep acting this way - which, as I'm sure you know is an incredibly unreasonable way to act - then he should be troubleshooting on his end too.",
            "Time to sleep separately. There's no way around it. Sleep is too important. If you don't,  there won't be peace.",
            "Yeah this is bizarre behaviour, OP. Doesn't it seem like he wants to be mad at you? He's angry at you overnight for doing virtually anything sneezing, yawning, even rolling over. You're walking on eggshells.\n\nWhat's worse? He refuses to do anything to fix it for himself. Earplugs WOULD work, but he doesn't want to. White noise WOULD work, but he doesn't want to. Both of these ideas are reasonable solutions. He just wants you to be silent or not there at all. That is the only thing that will satisfy him, and that is not a reasonable solution.\n\nHe's trying to control your behaviour instead of dealing with a physiologic problem effectively. Is that the kind of life you want for yourself? What about any future children you may have?\n\nI'm very sorry for you.",
            "When you can’t fall asleep, minor sounds can be super annoying and seem like they’re what’s preventing you from sleeping when they’re not. So I feel where he’s coming from. \n\nBut. \n\nThat doesn’t excuse his rude behavior. He needs to not be a jerk. If he can’t fall asleep, that’s the real problem, not you making minor noises.",
            "He’s being (in your own words) selfish and unrealistic. This won’t change. The answer is easy:  stop sleeping with him.",
            "I don't know if anybody has said this already but like, just don't sleep in the same room? You can be in love with someone and be in a long-term, monogamous relationship, but you don't have to sleep in the same bed. Not all couples can sleep in the same bed, sometimes it doesn't work (like if one is a light sleeper and one isn't!). I don't know the size place you live in, but if you've got another room or space you can turn into a bedroom, just get your own room, or make him get his own. In my own relationships where we've lived together, I've always had separate bedrooms. We can still sleep in each other's room when we want, but when one of us is sick, or struggling to sleep, or stays up later, etc., we have our own space. It's really not that big of a deal, and this sounds like it might just be better to toss out whatever archaic ideas we all have about what cohabiting relationships look like and do something different that's also awesome and helpful :)",
            "I had a husband like that, once.  It gave me lasting insomnia that I'm only now getting over.  I was snoring, I know that's unpleasant - but he was worse.  Every time I drifted off he'd push or shove me roughly to get me to stop, and completely wake me up.  Then I'd lay for hours, afraid to fall asleep and start snoring again.  I couldn't relax in my own bed at all.\n\n I went and got a cpap.  So, I stopped snoring, but then he complained about the sound of the machine.  I moved into my studio and slept in the daybed there.  He complained that I left our bed, so I felt guilty all the time because I couldn't do sleep right.  He refused to do anything about it but complain and poke, until I dreaded night time.\n\nFinally got divorce for other reasons, but ultimately it was because he was a selfish person.  I don't miss him at all and I sleep a lot better.\n\nYour guy is being totally unreasonable, OP.  This won't end well because you can't control how you sleep.",
            "Earplugs or separate rooms. Also he sounds high maintenance. Please don't have a kid! He can't handle it.",
            "Has he tried your melatonin?",
            "Nice guy.  Can’t wait to see how he deals with a baby at night.",
            "I had a bf around your age who did the EXACT same thing. Honestly, it’s something much deeper than “light sleeper”, usually either extreme anxiety or depression. It took years for me to figure that out, but it didn’t get better and his demands for how quiet i should be just got out of control. I couldn’t even open drawers to get clothes in the mornings when i was changing for work (when i say morning, I’m talking 11am while he was still “trying to sleep”, as he was unemployed). He wasn’t a bad person, but i definitely started to resent him for it. Turns out it was depression changing him. \n\nYou have to put your foot down here. Set YOUR boundaries. We as girls often get gaslighted because we start doubting how reasonable we actually are when our partners criticise us. It’s easy to get sucked in, so i recommend physically writing down what you deem reasonable. Sneezing - unavoidable, therefore reasonable. Yawning - natural, therefore reasonable. Shuffling around or tossing/turning when you’re having a sleepless night - reasonable. Have you already compromised for him, or were you super stubborn (unlikely)? If you have tried to compromise, has HE tried to compromise to meet YOU halfway? Is HE being reasonable? Are YOUR needs being met? \nIf not, then practice putting your foot down. YOU have to be assertive about your needs, no one will do it for you. If you find him resisting coming to a compromise, ask him why. Tell him that you will absolutely not stop yawning as it is a natural human function. If he is so bothered by any sound you make, by the indication that you exist, then he needs to figure out if he can cohabitate with another human. You gotta set the rules. Let him know he has options - ear plugs are a lifesaver, i use them when my snoring ex slept over. The couch for HIM is another option when he can’t sleep, etc. There are a million options, he has no excuse to not try them.\n\nRemember, if he is not happy by your presence, and you being a human next to him is causing these reactions in him, it’s not at all about the noise itself and is a much deeper issue.\n\nGood luck!",
            "Me and wife always have slept separate and it has made our lives easier.",
            "Wait you are still in college with no kids?!?!? Ok girl u need to just tell him to grow up and be a man and deal with it or get out because my wife sleeps like she's having a ufc fight and now so does my daughter lol and they both want to be right on top of me. But we are a family you are in college when I was your age my tolerance for bull crap was real low when women would start to act crazy or show red flags that was it I was out and I'm glad I did too or I wouldn't have the woman I have now and my amazing baby girl. Look you dont have to deal with that give him the chance to talk about it say what can we do to fix this and if he acts petty or like a child then that's it break up. Find a new roommate sounds like you guys aren't used to each other yet but after six months you should be. Little boy needs to start acting like a man. If u want a woman in your bed sorry bro u gotta listen to their breathing is that so hard.",
            "Your BF is being a AH. There is no thing like light sleep. He is surely awake when u did your stuff. It just seems like controlling  behavior.",
            "Your BF is being a AH. There is no such thing like light sleep. He is surely awake when u did your stuff. It just seems like controlling  behavior.",
            "Oooof, this sounds like my husband on the rare occasion. Because I’m personally bias I would say NTA. But probably closer to NAH. \n\nHe is an extremely light sleeper and he can’t change that unfortunately. Are you doing anything bad? no. I think there needs to be a better understanding between y’all. \n\nI know, I too get frustrated when I get the exasperated groans for “swallowing too loud” I found my frustration comes from feeling persecuted over something I can’t control. When we were much younger one time I tried pushing him off the bed (the mattress was in the floor) because he kicked at me for moving too much (not hard but who does that) Not the finest moment of our relationship. Which proceeded to me crying for 30 minutes because “you kicked me” \n\nWe have gotten to a place where he can voice that X is bothering him in a nice way like “sweet heart X is really bothering me” and because he isn’t annoyed or expecting me to change I can be a lot more compassionate to actually how frustrating it must be for him to be such a light sleeper. So I will start to rub his back and he feels like I am showing him love and understanding.",
            "Tell him to take a benadryl like every other adult on this planet jfc.",
            "So what kind of miracle cure are you looking for if you claim he can't sleep on the couch and you're stuck with him until May in the same bed?\n\nEither make this big baby wear ear plugs or start turning on a fan at night for the white noise so he doesn't throw s  little drama queen temper tantrum every time you blink too loud.  I'd be SO done with this fool.",
            "Purely speaking of the sleeping thing - he can wear earplugs or bose sleeplugs.\n\n\nbut really the guy sounds like hot garbage",
            "Ear plugs.  I have been using them nightly for the last 8 years and they work.",
            "My husband was this way and we blessedly sleep in separate bedrooms but the biggest breakthrough I had with him was this: the light sleeping is his problem and his responsibility, not yours. He should not try to police you in any way until he has exhausted his options to improve his own sleep. \n\n\nHas he tried custom or high-end earplugs? Has he given white noise a fair try (a few nights to adjust and different types of sounds, not just playing it one night and giving up)?, sleep medication of his own? Does he practice good sleep hygiene? (feel free to Google this one.. then send him the link). \n\nMy guess is no. It is absolutely damaging to  sleep and all-around exhausting when you are always worried about waking someone up. He needs to accept responsibility for his own sleep and it starts tonight.",
            "There is a really good fan, white noise machine. Google best white noise machines. \n\nStart it on a low volume on nights 1-3, and slowly bump it up. He wouldn’t be able to head you yawn. Hell I can’t hear my girlfriend talking to me from right next to me. \n\nIf he’s unwilling to work on ways to help his light sleeping, you shouldn’t work on ways to be quieter. You guys need to try to talk about it during the day, and express your concerns. The thing is, your “on edge” to be as quiet as possible, is likely contributing to your insomnia and anxiety going to sleep.",
            "You should try a white noise in the room, there are lots of apps that you can use to provide them, something like rain or the ocean, \n\nJust convince him to try it for a week or a few days and see if it would work",
            "Oh my goddd\nThis is something weird I feel you sister. \nI mean for some time try sleeping in another room. \nOr honestly take your stand.",
            "My dad is like this. I grew up not being able to use the toilet at night. I couldn’t brush my teeth after he went to bed. I couldn’t open the fridge, get a glass of water, cough. He went to bed every night at 8, and I was a teenager so I would stay up til midnight or later.\n\nI still feel guilty using the toilet at night and ask my husband if he’s sure it’s ok when we are at his parents’ house.\n\nHe needs to see a sleep specialist or you need to leave for your own sanity. Please don’t make your kids live like this.",
            "My advice: don't renew the lease and leave him. He's putting a lot of stress on you and making you afraid to yawn, for fuck's sake.",
            "This is insane. You realize that this is not normal???\nSo what, you can't be sick? Like a normal human being you can't sneeze or blow your nose? While sick you're kiced out of YOUR bed?\nWhen he tells you to be quiet you need to stand up for yourself.  Sorry, but stop being a doormat.",
            "Wow he's very selfish. D\nYou need to dump his ass",
            "It's only going to get worse.",
            "I'm a super light sleeper who cant fall asleep without fan noise. Any tiny noise will also keep me up.\n\nI bought a white noise machine that has a fan setting that sounds close enough to the real thing. I put it on my nightstand and put it pretty loud so it drowns out all the other noises. Works pretty good :)\n\nAnd my GF falls asleep when her head hits the pillow. I'm super jealous buy I'd never be mad at her for yawning or some shit lol\n\nEdit: initially only read half your post. This dude's a douchebag fuck him",
            "Op if you can try 2 smaller beds in the same room see if some sleeping distance is enough to help. I am a notoriously light sleeper most nights and toss and turn all night long. Sometimes even a well placed cough will wake me up for the rest of the night. The only thing that worked for me and my partner was having 2 beds with separate blankets",
            "You've gotten tons of good advice, but one thing to keep in mind is that the dynamic here seems to be \"you're the problem, not me.\" Why is the onus entirely on you to be quiet/not disturb him? He's not even trying to find something that will work for him. He's putting it all on you. That's a dynamic that I'd be stunned won't apply to other areas of your life if you stay in this relationship.\n\nI'm not suggesting you dump him, but there needs to be some communication on this matter. If he wants to be with you, he can't be fussy about not using white noise (which is actually a great solution). Also, there are cheap white noise machines with fan sounds, ocean sounds, etc. It's not like the only noise possible is white noise. He also needs to understand that living with a partner isn't about them making adjustments to accommodate him. He has to make adjustments for you as well. Ideally, meeting in the middle is where you want to be. If he can't do this, then you're going to have a rough road ahead.",
            "This is why I swear by either moving in with your partner or sleeping at each other's house multiple times before you get married, because crap like this can happen. My ex was like this, i have issues staying asleep. I will sleep for 3 hours, wake up, stay awake for 2 or so hours and go back to sleep for another 3 hours. My ex hated me moving or sitting up. If I barely touched him he'd violently jerk away and yell at me to stop. Stop what? My toe barely touched your leg dude.. \nAnd yes, he will most definitely make you stay up with the baby and probably make you go to another room with the baby to sleep and complain about the noise the next morning. Please don't renew that lease. He needs to figure his issue out and learn to compromise with you.",
            "oh my god... he can suck it up and adjust to wearing earplugs. are they annoying? yes. do you eventually get used to them? yes. I’m a bad sleeper and they make a HUGE difference for me. earplugs plus some kind of white noise makes it so sometimes I don’t even notice my partner getting out of bed to go to the bathroom in the middle of the night. if he won’t compromise on this I don’t know how far you’re going to get in terms of making a life together.",
            "ProTip: 33db earplugs and sound machines.\n\nIf that doesn't work, get new boyfriend.",
            "I am a very light sleeper and I don't harrass my boyfriend like this when he makes noise and wakes me up. Yes, we argue about him snoozing 3 to 4 times in the morning on my day off, or about him unloading the dishwasher at 6 am. But I don't yell and when he is sick and sneezes or blows his nose I have extra patience and empathy. \n\nTo be honest it sounds like he is just being selfish. I'd have a serious discussion with him about what this is doing to you. Mention it is making you rethink your relationship/renewal of you lease. The impact this is having on you is large and that is to be expected when someone is just being plain mean to you about very normal things. Also, maybe personalised earplugs can help. You can get them fitted and it DOES help.",
            "Get two twin beds, push them together for sexy time, push them apart to sleep.",
            "My suggestion is to please don't resign the lease with him. You're more than welcome to continue dating him if you really wanted to, while at the same time not living with him. This particular problem you described would drive me nuts. You deserve to sleep in a bed that's yours too.",
            "I had a boyfriend were every single thing he did or every noise he made at night pissed me off and I was constantly angry with him for things he couldn't control and I felt unwilling to compromise. I eventually realized that it wasn't because he was loud but because I didn't actually want to be with him. Something about the quietness of nighttime brings up deep feelings and emotions that you often don't have in the business of day. It turned out we weren't compatible for many other reasons and I have had no issues with finding ways to help me sleep while my now husband snores next to me.",
            "Why are you even putting up with this selfish immature asshole? Seriously? It's so far all about him and how you accommodate his needs. Yet you couldn't get the bed when he was sick but when you were you were on the couch?\n\nYou deserve better than this headache imo.",
            "You’re both young, as is this relationship. Dating is about figuring out compatibility. He’s incompatible with you sharing a bed (or just an asshole) and you value sleeping together with your partner.\n\nSleep is a Big Deal. Your relationship might just already be over. He’s refusing to do anything on his end to make things work while you must share a bed so...what, just never sleep with your husband for decades because he’s a light sleeper and won’t work with you?\n\nI’m assuming you’ve discussed this when you’re both wide awake so it’s not just sleep grumpiness...but if you have and this is how he is, well, you ought to believe him.\n\nFor the record, I’ve been with my partner for seven years and we’re happier with separate bedrooms (shared one when first dating and couldn’t stand to be together for more than 9 days straight like that). But we also BOTH care about one another’s sleep and we have done so in less than 1,000 square feet with often different schedules.",
            "I had a similar problem when my boyfriend would wake up it usually woke me up (sometimes I am grumpy but not very often) I would ask what’s wrong or something and he would be very very mean. I knew it was only cause he was sleepy and it hurt me deeply cause I hardly ever did anything like that to him! \nWe sat down and had a convo about it and how we could both do better and now I ask him less questions but he knows to be less mean - usually by speaking in one word responses and kissing me when he does come back to bed. \n\nI think your boyfriends demands are very irrational and not accommodating\n\nIt probably contributes to your insomnia as well because you can’t get comfortable without the risk of waking him. \n\nI addition to talking to him about this you could also suggest that maybe he take melatonin too? I take a quarter of a 3mg and it knocks me out through the whole night or he could turn the fan up even higher to block out your noise \n\nI’m sorry you gotta sleep stick straight no way is that comfortable. You adjust however you want. Sleep sideways if it’ll help you fall asleep. You’re the one sufffring here. \nI would 100% bring up the sick thing. That is the rudest shit ever. “Aww you don’t feel good baby why don’t you get some good good sleep on the couch so I can get some rest from your sneezing?” \n\nLike what? EVRRYONE knows that the nonsick person either sleeps in the bed and takes care of them most likely getting sick themselves or they go sleep on the couch. You’re boyfriend is selfish\n\n\nTLDR: louder fall or have boyfriend take melatonin to fall asleep and stay asleep. Your boyfriend is selfish and inconsiderate",
            "His actions are telling a lot about him. Try talking some sense into him in whatever way you have learned that gets to him. If he doesn't correct himself or even tries to correct himself, you really need to leave him. Not because of sleep and all, because he his attitude towards you is completely wrong, like who make the ill person sleep on couch because of noise. Many people have partners that are light sleepers, none bear this kind of entitled behavior. And for gods sake, don't have children with him. It is gonna be hell.",
            "Life has its ups and downs. If he cannot adjust in life's changing circumstances,  he is not a safe bet for a life long partnership",
            "He needs a white noise machine or a fan. More importantly he needs to sleep alone. Its not working out. Don't try to force it.",
            "I’m a light sleeper with noisy neighbors so I bought a white noise machine to drown out everything...it really works! Maybe try that?",
            "The fact that he says ear plugs don't work and he can't listen to white noise aside from the fan and that you haven't indicated he has apologized to you for his behavior when he is fully awake during the day are all red flags to me. \n\nLike, yes, he is a very light sleeper. I am sure he has anxiety about sleep and feels frustrated when he is disturbed. He has real, valid feelings. But what about you?? \n\nYou are the one with insomnia! You ALSO have sleep problems which he is not respecting. Where is his sympathy? Neither of you are having an easy time sleeping. Where is his willingness to compromise? He is your partner and he should be concerned for your well being as well as his own. He should also feel embarrassed at how snippy he is when he is falling asleep and apologize! \n\nIt bothers me that he is not willing to try things that inconvenience him to work with you. \n\nI think that you should show him this post - or write a letter to him based on it - and read it aloud to him during the day when he can listen to you. If he is apologetic and reassuring and willing to try to compromise and work with you, great! If he is defensive, minimizing of your problems, mean, or rude - take that as your sign that he is not likely to be a great long-term partner and find somewhere new to live at the end of your lease.\n\nA long-term partner should have empathy, concern, gentleness, patience, and a heart open to compromise. They should want to solve problems with you. If he doesn't do those things, do you really want to be with him?",
            "I feel bad for your future toddlers who will be energetic at night because, well, they're kids, and your partner will make them develop an anxiety disorder around laughing or playing or making any noise. Imagine him kicking you out into the living room to feed your crying baby at night because he wants his sleep. \n\nIt's not him being a light sleeper that's the problem, it's him that's the problem. I've met people like him who get excessively annoyed and they're a nightmare to be around long term. \n\nI would reconsider your relationship with this person OP. All the best",
            "Man, little things like this can really mess up a relationship. \n\nMy boyfriend and I lowkey fought about something similar for like 2 years, and when you don't get good sleep, you just get super grumpy. It was nothing to this extreme though, he just insisted on listening to ASMR or stories while sleeping, and I can't sleep with noise. We found some headphones that he can sleep with and we no longer have a TV by our bed, so it's all good now. \n\nBut it kind of sounds like your guy isn't willing to compromise at all. I mean, I would suggest getting some good and comfortable ear plugs for him, and I really don't see why he's not willing to do that. Also, if you haven't, you should definitely have a conversation with him when none of you are tired or busy. Because I know just how frustrating it is to not be able to sleep well because of someone else. He needs to know that his sleeping habits are a serious problem and obviously you can't control the noises that your body naturally makes, so he's the one that has to do something about it.",
            "The only answer here is earplugs and white noise.  If he’s taken those “off the table,” he’s telling you he enjoys treating you poorly and thinks you are someone who deserves to be treated poorly.",
            "Sounds like ex bf to me.  Who the fuck complains about a yawn?  Personally I'm of the opinion that getting woken up is a personal problem; if you don't like it, learn to stay asleep.",
            "I had a boyfriend like this I rarely let him sleep over. One time he was sleeping over and my hopped up on the bed that night, which she had never done before. He got mad at me. I thought he was joking. He also has four cats of his own that are much more disruptive at night than mine.",
            "Is everything else ok in your relationship?\n\nI'm glad that you are looking at his current behaviour and considering what it would be like if you had kids. So many people don't do that. If he can't find a compromise for this, I cannot imagine what he would be like with the constant interruptions of kids.\n\nSometimes its hard to take that step to leave, but if, after clear communication and attempts to find a way to make this work, he isn't meeting you in the middle, you should consider leaving. You are so young still, don't waste time with someone who doesn't see you as an equal partner in the relationship. Especially if you want children, they are exhausting and are wedges in relationships, you need to be a strong team. Good luck.",
            "Ear plugs, tell him to get used to them.",
            "Have you tried a white noise machine? My husband is a loud snorer (deviated septum) and was waking me up throughout the night. This was especially a problem when I was pregnant because I became a light sleeper for the duration. Since the white noise machine, we both sleep better.\n\nThat said, it’s not okay that he’s being a jerk to you, idgaf how light a sleeper he is. Partnerships are about compromise.",
            "Low key I’m not nice when I sleep too. Tell him to get some ear plugs and get over himself",
            "This would be a deal breaker for me. My last boyfriend accused me of ruining his sleep because he's a light sleeper and I moved too much. He had a damn CPAP machine and snored and was 2x bigger than me and took up more than 1/2 of the bed. Like, no. If you want an invisible girlfriend then I'm not your girl.",
            "The meditation app Headspace has this music/noise you can play to help you sleep, it’s scary how well it works. It knocks you out. But maybe that or some sort of white noise or fan would help? Also, Maybe he’s not really a light sleeper, maybe he’s having sleeping issues too that need addressed.",
            "This isn’t going to change. You will end up taking care of the family if you two continue this. You two aren’t compatible because your boyfriend is lazy, selfish, and becomes abusive when you “disturb” him. And I’ll bet you’ll see this pattern of selfishness and abuse in other parts of the relationship. \n\nAlso 6 months into a relationship is too soon to move in together. Don’t renew the lease and ditch this sorry person.",
            "Just because you're tired doesn't mean you get to be an asshole. He's an asshole.",
            "Oh this is completely unfair, and quite frankly sad :( Relationships are about compromise, and it sounds like you are being forced to compromise over and over, and he isn't budging! You need to have a real talk about this (when he's not cranky and sleepy) and either come to some sort of resolution, or ultimately break up. I am in the same boat as you with insomnia at the moment due to meds and a chronic condition, and I am terrified of waking up my bf. If I can't sleep, he wakes up and strokes my hair, or reads to me, or puts something on TV, or does calming breathing exercises with me. That's what you deserve, not someone making you feel worse, when I imagine you feel bad enough not being able to sleep! Hope you sort it OP :(",
            "Sorry not reading all of this so commenting on title alone....buy him quality custom fit earplugs",
            "has he tried taking melatonin? even if he doesnt need it to fall asleep it would make his sleep deeper and he probably wouldnt notice the sounds as much",
            "I am an incredibly light sleeper and my boyfriend is VERY mobile in his sleep and our bed is a full-size that squeaks and transfers movement like crazy. Every time he moves, my whole body shakes and it wakes me up or stops me from falling asleep constantly. You know what I do? I wear earplugs, occasionally take sleeping pills, nap while he's out whenever I can, and suck it up. Trust me, it frustrates me some days and some days I want to be an ass about it but I control myself. We've lived together for over a year, I've lost a lot of sleep to it, but I don't think I've ever seriously gotten on his case about it. I know he can't help it and I know constantly ragging on him for it would just stress him out and ruin his sleep more too. Why would I do that to someone I love? Why would I decide his sleep is less important than mine? He's clearly not sleeping that well either (just like you) and I worry about that more than anything.\n\nYour boyfriend doesn't. Your boyfriend is making his issues into yours and he does not care about your well-being. This is a very big deal.",
            "I probably wouldn't resign a lease for a one bedroom.  Some people just need their own room, maybe not every night but someplace he can ho when people annoy him.  But you are probably right, he's not gonna be the person happily getting up for a baby,  but that's something you should discuss separately.",
            "Dude, why did you take care of him? Why do shit for him that he has no interest in doing for you? Why sacrifice yourself for some guy who’s unwilling to make any compromises whatsoever for you?\n\nHe’s not ready for a relationship or to live with someone.",
            "Try a loud box fan. I’ve slept with one since I was 10 and it blocks out so much noise",
            "Not gonna overreact like most on this sub but it sounds like he’s not being a good teammate",
            "He is being ridiculous. He doesn't want to try anything to make this easier? What a jerk. Please show him this thread. If he can't fall asleep without total silence he needs to see a doctor. That's not normal. Don't have a child with this man unless he gets his sleep straightened out. \n\nIf this was me, I'd have dumped him by now. He's so disrespectful.",
            "Just start sleeping with the TV on and tell him to go in another room if he doesn't like it",
            "This is ridiculous. A light sleeper, is he actually asleep? REM sleep?  I was coughing all night because of bronchitis and hubby never said anything. I left the bedroom because I did not want to disturb him.",
            "This is controlling and abusive behaviour. It's just atypical enough from what is usually portrayed as abuse that you don't realize that it's abuse. You're allowed to exist. He's making you feel like you've done something wrong and actually punishing you in different ways for it.\n\nYou have done nothing to deserve this behaviour and nothing justifies it or makes up for it. Nothing in a partner or relationship can justify the complete absence of compromise.\n\nYou can't have a relationship or partnership of any kind with someone who has such a complete disregard for your health and well being. Why would you even want to?\n\n\nPs: I'm a very light sleeper, a life long insomniac at a very extreme level. I can't use ear plugs anymore because my ears are damaged and I have never taken any of it out on anyone. Not a stranger and definitely not my significant other. \n\nIt's not just that you deserve better, it's that no one deserves to be treated like he has treated you.",
            "You will need to have two separate bedrooms. Also, this guy doesn't sound like the right match for you. He's kind of a jerk.\n\nBut if you have sleep issues, it really helps to have your own room. Cuddle up at night in your partner's bed and then move to your own bed for a night of (hopefully) peaceful sleep.",
            "Get him ear plugs and white noise machine for Christmas. This is his problem.",
            "It seems like it’s time for you to put him in the bin and get a new boyfriend.",
            "He doesn't want a solution, he wants to be pissy. I have similar sensory issues, I get where he's coming from, sometimes the irritation takes over you and you're just not yourself. But OP, you aren't being rude or unreasonable, you're literally just existing near him. He needs to look into his issues and find a way to cope, and if he's not willing, I hope your next boyfriend is kinder to you.",
            "I'm in the same boat as him, a highly sensitive sleeper, the only solution is separate beds. I've never looked back",
            "He is being so selfish and inconsiderate. I can’t believe he made you sleep on the couch when you were sick! I wouldn’t want to live like that either. He doesn’t sound like a good partner at all...",
            "That's just asshole behavior all the way around. I can't sleep unless I'm spooned up against my girl then I go back to my small corner of the bed, because in reality it's like 80-20.",
            "He will get progressively more abusive until it feels normal.  He’s already doing things you would never have thought you’d put up with.  It gets worse from here. \n\nTime to separate.",
            "What would he do if he lived in a city? I'm in a slightly urban suburb near a hospital and while the street is generally quiet from 11pm to 5 pm, the time around that is loud and we get the occasional ambulance. This isn't a \"you\" problem since you're just being human. This is a him problem, he needs to figure it out or at least suggest solutions.",
            "Hear me out. Talk with your boyfriend about how much this bothers you and how it is disrespectful that he is unwilling to compromise. I don’t think its fair to extrapolate too much from this. If you make him understand, then he will either choose to make it up to you or not. But right now, I don’t think he’s capable of realizing that this is so important to you that you are considering moving out. (This advice is giving OP’s boyfriend the benefit of the doubt based on trusting OP’s judgement to be with him. Of course it is always still possible that he sucks in general).",
            "he needs some earplugs if he's that sensitive to it. I've used those to sleep in noisy environments",
            "Yelling at you is inappropriate, especially for something like yawning. If you moving and breathing is too much noise, what about car traffic? Weather? Other people in your shared space? Does he yell at them too? Does he shout at the sky to shut up?\n\nHave a talk with him. Tell him flat out you're done being yelled at. It's his problem with sleep, not yours. He needs to medicate and wear ear plugs. He can get a vibrating watch alarm that he can wear to bed to wake him or the gentle light slowly turning on thing. Next time he starts yelling, just say \"sounds like a you problem\" and roll back over. You deserve comfortable sleep too. Prioritize yourself. Either he'll realize he has to stop being an unrealistic ass or he'll move out. Either way is a win for you. He can be the one sleeping on the couch.\n\nI started an anti depressant recently and it makes me have a harder time with sleep. I used to sleep like the dead, you could literally have a conversation with me and I would have no recollection. Now I wake up frequently but I would never dream of yelling at my husband for breathing. Or make him sleep on the couch when he was sick. You know why? Because it's a me problem. So I solved it myself by taking 25mg benadryl, wearing a sleep mask, and playing rain sounds on my phone. Your boyfriend is being a jerk. Time to be done coddling him.",
            "Girl he's being selfish, look I get it, I'm not as light of a sleeper but small sounds tend to really bother me so I can relate, but I come up with other solutions, like earplugs, ear buds to put music over other sounds. Move rooms if it's getting too much. Example: the girl who sits behind me in my math class chews really loudly. Not with her mouth open or anything, just really crunchy things right behind me. I don't ask her to stop eating, I put in earbuds. Not everyone is going to cater to his needs, so he needs to come up with his own solutions. He could take some sleep medication, wear earplugs, probably other things but I haven't researched it. You don't need to stop existing while he's sleeping cause he can't come up with solutions himself.",
            "You do realize that you guys don't have to live together.  You moved in at six months? Just move out.",
            "He might be a misophoniac.",
            "My two cents - I dated a man I thought I wanted to marry, and we were almost moving in together after six months. But our sleep together was TERRIBLE. He would involuntarily jerk in his sleep as he drifted off  - and I’m talking like major spasms where he would shake the whole bed and wake me up thinking that something was wrong. It was torture. I would get so angry with him but it wasn’t his fault. There was nothing he could do to make them stop, and no reason for me to be mad but I would get so tired and be woken up seven to ten times every night. It wasn’t the only reason we broke up, but a major one. \nEventually I started dating my partner now of six years. We sleep like BABIES together. There is the occasional frustration or someone is sick or what not, but we love going to sleep together and it’s a joy to share a bed with him. If you want to spend your whole life with someone, find this. After the other things fade from the shiny newness of a relationship, sleeping is of paramount importance to having a good life. Don’t compromise it for some dude who doesn’t care about your wellbeing.",
            "If you take 2 hours to fall asleep, have you considered hanging in the living room until hes asleep to wind down?",
            "This isnt okay. This would be a deal breaker for me. Luckily when i sleep over at my bfs he isnt like this at all and thank god cause i cant imagine how that is making you feel. Youre literally on edge with him 24/7 at night and thats not okay. He isnt the only one in the room so what does he expect??? You gotta put your foot down, tell him if it bothers him that much he can go sleep somewhere else or learn to put up with it. If he cant do either then break up with him. Its hard but dude thats no way to live is that something u really wanna be doing the rest of your life?? Being on edge and catering to him all the time. Noooo thank youuuu. Its okay to cater to him if he will cater torwards you when you need it but dude if he is going to act like that. Thats a huge nono.",
            "This is why some people sleep in separate beds",
            "I had an ex like this. Thank god I moved on. I realized after having a couple girlfriends after her that this isn't typical behaviour. He's a light sleeper and that sucks but him lashing out at you is totally uncalled for.\n\nI'm not saying break up with him but this kinda thing doesn't go away in my personal experience.",
            "Has he tried moldable silicon earplugs? I couldn't sleep with any other kind. I tried these and I sleep solid until my alarm goes off. Perfect for when I work nightshifts.",
            "You two aren't compatible. Not because of the sleeping situation but because of the way he's treating you. Why is it that YOU'RE the one who had to make all the changes and not him?",
            "You need to have a talk with him in the daytime, calmly, but firmly insisting that each of you listen to the other. He's a boyfriend, not a husband. You have to learn how to work out things like this or know there is no future for you as a couple. Don't use words like selfish or \"you always do this\". Just say \"we need to work out something we both can live with.\"",
            "Late to the party, but a lot of couples have issues sleeping together just because being in the same room let alone the same bed as someone else is bound to introduce noises and movements that keep the other awake.\n\nWhat works for me, is I have a portable air-con unit (the type with a pipe) that also has a fan-only mode.\n\nThe fan is louder than your typical rotary unit bit consistent enough that the white noise quickly becomes it's own baseline of silence.\n\nIt's loud enough to drown out any little noises, certainly enough to drown out yawning or throat clearing and we both sleep exponentially better with it.",
            "your boyfriend sounds childish, and these sound like problems that will compound and magnify over time.\n\nFrom what you've written, i'd say he needs to learn to put others before himself sometimes. until he can learn that you're gonna have problems.",
            "I also feel difficulty in sleeping with light sleeper.",
            "Well, his response to his sensory input is the problem. It has nothing to do with you. In my opinion he’s the one who needs to adjust. Especially when you’re just laying there awake. \n\nHis attitude towards this and how he blames you for him being awake crosses into the realm of narcissism. And other ‘3 year old child like’ behavior that should have been resolved by the age of 24. The main problem with this kind of behavior is that he won’t see it as a problem. So it’s like talking to an emotional kid that doesn’t have a sense in that it’s doing anything wrong. \n\nI’d say open up a discussion about this and if he’s not willing to change this behavior of us I’d recommend ending the relationship, because there will be more areas where this type of childish behavior will emerge forcing you to give in and have him cross your boundaries on the subject of that moment. And that is in the long psychologically very unhealthy for you.",
            "He's selfish and he's trying to blame all this on you. I'm sure this is nt the only aspect of your relationship where this comes out. I would have ended it already personally but if you do decide to stick it out and see if it can work I would highly advise moving out/not renewing your lease with him. Don't commit to putting up with this for another whole year when he's clearly showing no signs of changing or having the slightest consideration for you.",
            "I have similar issues that your boyfriend has. He needs to use ear plugs at the very least. If he's such a light sleeper, he'll hear his alarm even w/ ear plugs. I always do.",
            "Yea, you're not married, you're just shacked up, he ain't the one, move on.",
            "One of things I dislike is people really complaing about their issues and not even considering how to deal with them, much like your boyfriend. It doesn't sound like he is taking steps to help himself sleep better and is making up excuses whilst expecting you to do all the leg work in this situation. He needs to compromise and meet you half way at the very least. If not, I think it may be best to leave him. He sounds irrational, immature and ill-prepared to taking on his own sleeping issues. Shifting all the blame on you also is very shitty.",
            "I'm an extremely light sleeper too. I don't think I could share a room with someone because everything bothers me. You guys should not sleep together.",
            "He's having some serious problems and he needs professional help. There could be an issue or trauma from his past that is causing his extreme inability to feel safe and fall asleep with normal bedroom noises. Unfortunately he doesn't understand that he has a problem and is directing his frustration at you. Your best bet is to try to talk to him about his inability to fall asleep and why that might be. If he can only blame you, then he has another issue to deal with on top of the sleep issue.",
            "I'm an extremely light sleeper, and the tiniest noises wake me up immediately. So I can sympathize with him on that, it is extremely frustrating and soooo hard to fall asleep. HOWEVER, he's being an asshole. He does not need to react this way. If my partner is being too loud I will wake up and say \"hey, this noise is keeping me awake, can you be a bit quieter please?,\" not f\\*cking yell at him. Also, him having you sleep on the couch is ridiculous. He should've gone to the couch if he was having issues. He sounds like a child.",
            "I used to live with a girl like that. She wasn't rude about it because she realized that it was her idiosyncraticracy but I could tell she would get annoyed. She took to taking Tylenol Pm to sleep through the night. I obviously did not like that but she insisted it was the only way for her not to wake up 3 times a night, each time taking her an hour or more to fall back asleep.\n\n\nWe finally figured out that the root cause was likely childhood trauma, a combination of years of sexual and physical abuse. That she had PTSD and could never fully relax. \n\nI say this because I wonder if your boyfriend might have a trauma that keeps him from ever really sleeping too.",
            "My wife is the same an extremely light sleeper I have had discussions with her about not expecting absolute silence she isn't as bad as she used to be but I feel your pain.",
            "i used to have arguments because my other half was clicking away with a mouse for hours. once i was asleep it was fine haha",
            "Loool and he's doing NOTHING to resolve this issue. No sleep aid, no earplugs, nada. This is red flag for me honestly.",
            "I had a partner like this - blamed me for everything - it got so bad that the only thing that I did was slept in seperate bedrooms.\n\nIn the end he didn't do anything to fix the issue and I got a good nights sleep/stopped caring.\n\nDo you really want to be with someone like this? If he can't sleep it's not your issue.",
            "You aren't compatible. That's what dating is about. To find someone you are are in harmony with. And someone who isn't an asshole to you while you try to sleep.",
            "As a person with insomnia for half a decade I can tell you I get extra cranky when I can’t work out. Those days I can only get a couple hours sleep. The only remedy I found was to work out extremely hard and not eat close to sleeping time. That way I can actually get 4-5 hours of sleep instead of the usual 2 hours.",
            "Probably you are not compatible sleep wise.  It may or may not be a deal breaker for you.  But I do know once your sleep goes then everything else is shot - your mood, your health,etc.  If you or he is not sleeping well then it's not good.",
            "I’m sorry you are going through this. Fighting with your partner over sleep is a huge issue. My boyfriend loves staying up late, like 1 or 2 am. I’m asleep by 10. When we first moved in together he hid the fact that he stays up late and would go to bed when I did. Then slowly it was “no, I’m not tired yet I’m still watching tv”. \n\nLots of fights and crabby mornings brought us to him watching tv on the iPad so the tv light didn’t keep me up. Then the snoring started. I still didn’t sleep. In 2 and a half years we have only had 1 explosive fight and it was about the snoring and tv. I tried ear plugs, an eye mask, white noise, pillows over my ears. \n\nWe converted our finished basement into a 2nd living room with a pull out couch and he slept down there for a year. My sister finally moved out 2 months ago and he moved upstairs to the 2nd bedroom. \n\nThe Sleep Divorce was the best thing ever for our relationship. I probably love him more because I’m not resenting him for all the missed sleep. \n\nI really wish you good luck. You will figure out what works for your relationship or if you need to move on.",
            "Take a vacation away from him and crash elsewhere for a bit.",
            "Sleep in different rooms",
            "Don't let him fool you, he's not mad because he's sleep deprived. Your boyfriend is mad because he feels somewhat above you, he feels that you should toe the line with whatever order he dishes out. The slightest sign of not toeing the line would feel like a direct insult to him, That's why he goes from 0-10 real quick.\n\nPart of being above you means that he doesn't need to comprise here. It also means to him, that you're the problem. If you guys had a baby, that'd be considered your problem when it suited him. \n\nDon't resign the lease.",
            "I bought a white noise machine that makes 7 fan sounds on amazon for $20.",
            "Honestly, there seems to be an incompatibility issue. I understand he took care of you when you had blood clots, that says that he CAN be a good guy. However, it seems more often than not that he's not treating you with respect or empathy. \n\nI'd say a few good moments aren't worth every day arguments over nonsense",
            "Move out when the lease is up",
            "r/misophonia \n\nCould be part of the issue. Neither of your faults. Try to find the cause of the light-sleeping.",
            "Get him headphones or something, but he’s gotta compromise.",
            "I hate to break it to you, but you’re already up all night taking care of a baby.",
            "From personal experience as long as you go to bed with the intention of getting a min of 8hrs of sleep, melatonin works wonders. It will keep you asleep. Its also natural and completely healthy. \n\nThe downside for me however was I felt fatigued if I didn't reach the 8hr mark which is why I stopped taking it since I now average 4 1/2-5hrs of sleep at night due to work.",
            "Separate beds, don't know why people have such an issue with this. I suffer with insomnia and am a light sleeper so only way that has worked for me. Mainly on work nights.",
            "Why don't you just sleep on seperate beds? Get a twin size materess and set it up in another room. This way uf you want to sleep together you can, and nobody will be disturbed.",
            "Ear plugs work just fine. I know because I use them. The foamy are best for me. My ex could fall asleep in minutes but it takes me an hour or longer. Just when I was ready to go under she would begin light snoring. It would get louder as time went on. I could hear her fall off the deep end in her sleep, soooo relaxed, because then it would sound like me when I was drunk! I would just move to the other bedroom, no big deal. It’s not her fault. She can hear herself while sleeping and make herself stop. It was my problem to deal with. So off I would go. Next morning she would ask why I left the bed. At first I would tell her because of her snoring. She would get mad and I would tell her not too. It got to a point that I said stop asking me why when I wake up in another room. But she couldn’t. So I would just say I couldn’t sleep. She tried everything to try to stop, all the products on the shelf. She would feel so bad. But I didn’t care. I told her I don’t care and it’s MY problem not hers. Just like it’s his problem. He is being unreasonable and it may be showing his upcoming personality. It your not being totally noisy, like jumping into bed when he’s almost asleep, turning in lights, being loud with doors and such when he’s trying to sleep. There is a level of due respect of quietness when someone is trying to go to sleep, but to stop breathing, not yawn, or roll over is ridiculous.  Bad move in his part having you sleep on couch when you were sick also! He’s not treating you with respect and my guess is he will learn or become single. I tell you though, his actions sound like there might be a problem down the road. You’ve only been together a year..... where’s the love?",
            "> I don’t want to keep taking melatonin every night \n\nWait, you must not take it everynight. You must have nights without it. Or your body will get lazy and stops to produce it on its own. It's my pharmacist which warned me. For those melatonin less night, I took phytotherapy instead. \n\n> When I was extremely sick with the cold, he made ME sleep on the couch because I was having a tough time sleeping without being able to actually blow my nose to breathe.\n\nHuge red flag. It's the one who doesnt want to sleep with the other one which leave the bed. Otherwise it becomes a punishment.",
            "I'm a deep sleeper who snores really loudly and my girlfriend is the exact opposite. At first I was anxious to sleep near her because she'd always have to wake me up to tell me I'm snore and I'd never want her to have a lack of sleep. I care about my partner's sleep and health and she cares about mine because sometimes she wouldn't want to wake me up and would instead just suffer through it. I think the fact that he doesn't care about your sleep and your comfort is a HUGE red flag.\n\nThe way we solved this was by compromising, and we both being a bit more inconvienced but we solved this issue. I think that it's bad that he doesn't care about you, but I think it's even worst that he doesn't want to give any leeway to helping your situation out as well. Significant others are suppose to care about each other and compromise, not prioritize solely their own comfort. This is such a bad sign for the future, and you'll see it start to show in other aspects of your relationships. Especially, once things start inconviencing him, our true colors will be shown. Is that really a future you want? \n\nJust know that there are so many other people who are more compatiable and will understand and try to work on things as opposed to brushing them off when they don't suit their needs and not your own.",
            "Well he will get used to. ..",
            "If my boyfriend made me sleep on the couch when I was sick, I'd go to the pet store and buy a box of feeder crickets and let them loose in the bedroom.  Then I'd move out.\n\nJust sayin'.",
            "Try seeking couple therapy or counseling because you’re in need of it. It’s good to meet with counselor to talk about your feelings and workout a plan if you want this relationship to work. He’s being selfish and I know this isn’t fair -life isn’t meant to become fair so we try to work things out for the best. I hope all goes well with you. At least he’s not an abuser but does sound like a bully. He should take melatonin and dim off the lights. You can adjust your body to sleep in early to get needed rest. Really I’d say fuck that and let him groan and mumble as you yawn or cough. It’s natural, and farting too.",
            "Im a light sleeper, my bf is, my dad is, but we never done any of what you have mentioned. An earplugs should be what he opts for, rather than controlling the noise. I feel like this guy is so selfish",
            " Separate bedrooms is the only way, if you want to stay together. It is not worth the stress",
            "I can be very easily disturbed by various noises or physical sensations when I'm trying to fall asleep. Usually it's my own anxiety/frustration that gets my adrenaline going and snowballs to a point where I'm too keyed up to sleep. It can be something out of my control like my partner snoring because he has a cold, or something totally self contained like not being able to find that one position where my shoulder doesn't feel weird.\n\nI use various different general anxiety management techniques to deal with it. Counting, forcing myself to focus on trying to remember or create a story in my head (basically things that take my mind off my physical surroundings, kind of like reverse grounding techniques), reminding myself that losing an hour of sleep isn't really the end of the world because I can always sleep later, going to bed before my partner so that I'm already firmly asleep by the time he's in bed... If part of my trouble is being sick, I have a nighttime cold medicine that I swear by...\n\nMaybe when you talk to him about it again, you can see if he's considered any of those sorts of techniques.",
            "He obviously has misophonia. I have it too",
            "”He says that earplugs don’t work”. Yes they actually do in fact work great but he’s being unrealistic and unnecessary pissy about it all.",
            "You guys need separate rooms now",
            "Have you had this discussion in the light of day, rather than in the moment at night when he’s being kept up? Maybe there’s a chance he wouldn’t be so unreasonable when he’s not desperately trying to get to sleep that second.\n\nAnyway, this is ultimately a ‘him’ problem that he needs to solve, because you are already doing more than is reasonable with taking up a tiny part of the bed and keeping it down. He just expects even more rather than making any effort on his part - so enough of that. He’s afraid of oversleeping if he takes sleeping pills? Time to learn to take them early enough that he won’t oversleep. He’s convinced earplugs don’t work? Well, yelling at you to be quieter than regular breathing isn’t working so maybe time to give earplugs another go. Etc.",
            "This sounds exactly like my partner. We've been dating about 2 yrs and living together 5 mos.\n\nExcept any sudden movement like me turning to one side or other he gets all upset. No cuddling. Sometimes when he feels more relaxed we'll just barely touch legs. I was going through a bad spell amd now its better but it is really hurtful that he gets so upset. I think personally though our bed is really shitty/warped/too small so I think when we can afford it we will try to get a bigger bed that is more resistant to movement.\n\nAs for sound being the problem mostly for you, I would recommend the Earaser earplug brand",
            "Just an additional thought - can’t he wear noise blocking earbuds playing white noise from his phone? Won’t solve problems of him being woken by your movements, but could be good for times when you have to sleep together, like travelling.\n\nObviously he’ll need to sort his attitude out first though.",
            "I’m a light sleeper and I get cranky when I’m falling asleep. I don’t yell but I’ve definitely grumbled when my husband makes noise. I decided to get ear plugs and that helps a lot. We have a fan that sorta acts like a white noise machine. Also, I go to bed much earlier than him. So it’s quiet when I fall asleep and he doesn’t make enough noise to wake me up when he comes to bed. Still there are some nights where some noise will wake me up (him, our dog, etc.) or I’ll wake up from being too hot and then I can’t get back to sleep. In that instance, I move to the couch.",
            "Maybe you should live separately until you are married.How many boyfriends do you want to move in with .After just 6 months? You clearly didn't get to know each well enough or you could have started off doing sleepovers so that you know how he feels about the noise .That was you could have avoided this awkward situation",
            "Ok I’m going to play devil’s advocate here: I’m a light sleeper so I empathise with your boyfriend. Sleep is precious and being woken up by any sound is really awful. And it’s true: earplugs do not work. We need absolute silence to sleep peacefully. Cut him some slack. He’s not being selfish, he literally just can’t sleep. And when you can’t sleep, you get easily irritated, so it’s a vicious cycle. Honestly I wouldn’t be able to live with someone who doesn’t let me sleep. And I’m NOT saying you’re at fault, because you’re not. I’m saying that your medicine has made the two of you bad sleeping partners.",
            "I'm not going to advise you to break up with him or whatever people are suggesting here. As far as I know, you could be the loveliest couple in the world in matters not concerning sleep. But his words are as powerful as you allow them to be. Next time he complains, yell in his in ear \"NO!\" or tell him to fuck off.",
            "About 2/3rds of the commenters here will tell you to break up with him.  They basically write that same thing for any negative attribute mentioned in any post.  Listen to the others telling you to have a sincere talk with him about fairness and what is reasonable.  I agree with you that he's being unreasonable, but at the same time most people can be unreasonable about something.  If you give it a good shot having several heart to hearts with him about this subject and see no improvement, then consider leaving him.",
            "**This relationship is over.**\n\nThe ideal relationship is man and woman living separately no kids, no marriage. Each takes care of their own bills, chores and habits. They meet when they are both in the mood and at their best. No nagging, no argument, no compromises, no bullshit.",
            "Solution: white noise machine. $20 at target (or there’s good apps for free) I can’t sleep without it bc I’m a very light sleeper as well but once I fall asleep it blocks basically everything out",
            "You know, a king sized mattress of good quality will probably help quite a bit.  I'm willing to bet I'm a worse sleeper than your boyfriend and my wife is fine.\n\nHe should be getting a sleep study done.  I'm willing to bet his sleep could be improved.",
            "[deleted]"
        ]
    },
    {
        "post_id": "5lvfxs",
        "author": "throwaway930161",
        "title": "UPDATE - Me [52M] As a Single Dad found out my [16F] daughter goes to Narcotics Anonymous Meetings",
        "url": "https://www.reddit.com/r/relationships/comments/5lvfxs/update_me_52m_as_a_single_dad_found_out_my_16f/",
        "score": 2533,
        "num_comments": 93,
        "created_utc": 1483486839.0,
        "selftext": "\n\n\nOP: https://www.reddit.com/r/relationships/comments/5563d5/me_52m_as_a_single_dad_found_out_my_16f_daughter/\n\nHi everyone! \n\nI am incredibly thankful for everyone’s comments and suggestions. Since my first post, things took a bit of a turn from her progress, but today she is back to 30 days sober!We have not proceeded with rehab, but here’s what has happened since then. \n\n2 weeks after my first post, my daughter came home from her work and asked me if she could borrow the health savings card and pick up her medication the next day. I said no, I would get it for her myself as I usually do. She protested for a minute or so but I was firm. She left it at that. \n\nFor the rest of the night she was unusually quiet. She’s usually quite talkative with her grandparents who live with us, or myself and her sister. Not that night. This was slightly concerning, but I didn’t raise any questions. \n\nFast forward to around midnight, my daughter came to me and spilled A LOT of details about her drug past. It was a lot of information to take in at one time, and finally she got to the point that she relapsed and needed the health savings card to get detoxed. After my momentary shock passed, I told her that I loved her and that I would go with her to the detox center, and that she didn’t need to hide things from me. I didn’t tell her about how I found out she’s already in meetings, I figured that could be my little secret or it can emerge when the time is right. \n\nAfter that, she got detoxed and all was well for a while before she relapsed again. She was much more straight-forward about it that time, and since that detox, everything has been going smooth. She is back into counseling and takes a 4-day a week class for getting her high school diploma. Today she is 30 days sober and is celebrating her sobriety / birthday with some friends. \n\nI appreciate every single comment! Thank you everyone for their kind words and advice. I feel good about the approach I took, although I would go back and change some things, she is getting the help she needs and we have a more open line of communication. She is more lively, is getting back into her passions, and is much, much happier. I’m still feeling guilty that I didn’t pick up the signs of addiction soon enough, but she assured me she has forgiven me and that I don’t need to worry about it at all. \n\nHappy ending! Thank you everyone!\n\nTL;DR: 30 days sober today, and all is well after a few hiccups!",
        "permalink": "/r/relationships/comments/5lvfxs/update_me_52m_as_a_single_dad_found_out_my_16f/",
        "comments": [
            "Good for you, and especially good for her. You're both absolutely on the right track, and she will never forget how you supported her during this battle. \n\nIt may be a long journey, and you're not out of the woods yet, but no matter what, she knows you're in her corner. That is invaluable. ",
            "Hey, good for you and daughter, it's a struggle brotha, help her stay on top of it, good luck!",
            "Hey! Congratulations to her for 30 days sober. I remember reading your original post and wondering what had happen. She is very lucky to have support instead of other options. Thank you for being a wonderful father to her.",
            "It took me until my 27th birthday to get to where your daughter is at sixteen. You should be very proud. \n\n\nI will be 28 in eight days, and on Feb 2nd I will be sober for a year. I couldn't have done it without my dad's support. Your daughter is lucky to have you, and i thank you for being who she needs. ",
            "I'm happy that your daughter is sober, but honestly - after reading your last post I think you really need to pull the reigns in a little bit as a parent.  There's a big difference between being a helicopter parent and not knowing where your 16 yo kid is because they hopped on an airplane and traveled across the country without telling you - even worse that you are pretty much OK with that.   Jesus, I'd get grounded for weeks if I so much as broke my curfew (11pm) by 10 minutes when I was 16.  Kids that age need some structure and discipline.",
            "Good luck, my man. It's never over, but make sure you surround your daughter with good models for behavior a little closer to her own age and try to keep her away from friends that still use. She has to give them up of her own free will, but she really needs to. That's the easiest way to relapse.",
            "As someone who officially has 106 days clean, I can relate. There are a couple things that bug me a little. In NA, we use the word clean, sober usually refers to alcoholics. I also just read the first post and the friend should have never said anything about seeing the daughter in a meeting. \"What is said here, stays here. Here here\" there is a reason why the meeting is called  narcotics anonymous.\n\nI also agree with other posters who said addiction is for life. This is not something she is going to grow out of. She is always going to be an addict. Yes, she is going to relapse, but she will always be welcomed back with open arms. We won't ever judge her, because we are just like her. I have seen addicts with 10-20 years relapse and die from the disease, then I have seen addicts get it the first time and never go near drugs again. \n\nI, myself have relapsed 5 times in as many years. I was going to meetings in 2015-2016 with fentanyl patches in my mouth, pretending to be clean, while I was nodding out in meetings, blaming my Prozac as the cause. My husband would catch me in the act of using and stealing and either send me to detox, or make me detox at home by myself. Every time, I would go back to using within three days and be that much sneakier the next time. Right before I got clean this time, I was no longer just using my mom's used patches, I was taking them off her back. I finally put MYSELF in detox. It took me one failed suicide attempt, two inpatient stays, diagnosis of bipolar and ADHD, therapist and psychiatrist, medication and of course NA. I was also put on Naltrexone. (Opioid blocker basically. If I take opioids I would get sick.) I also have the support of my husband and family. Every doctor, including my endocrinologist knows of my addiction to pain medicine and knows not to give it to me. I had it written on my chart. If your daughter is serious about addiction, she needs to do her due diligence.\n\nI hope you understand that addiction doesn't ever just go away, which is why we call it a disease. Good luck with your daughter's future addiction trials. She is lucky that she has you helping you, I can see the love you feel for here. Just remember she is 16, not 25. Maybe try keeping a closer eye on her? A 16 year old should not be traveling across the world, especially if you don't know where she is, or when she is coming back. Kids, especially teenagers need discipline. ",
            "Congratulations to your daughter, and to you for being so supportive when she needed it.\n\nJust make sure you're looking after yourself, too, yeh? No one expects you to be SuperDad all the time, and don't be afraid to ask for help if it all gets too much :) You've handled this remarkably well though.",
            "Something I think hasn't been posted here, but be careful if she's gonna take any controlled substance prescriptions that were similar to what she was taking.  She could rebound.  She needs to be aware of this.  I've seen too many people fuck up their lives over prescription drugs.  ",
            "Do you mind me asking what it was that she was using? ",
            "Congrats to your daughter! \n\nDon't be so hard on yourself for not picking up on the signs sooner.. if my teen years were any indication, most kids are good at hiding that stuff and/or most parents don't pick up on it. My mom was pretty open minded and someone I could talk to about that sort of thing, but she still didn't know half of the things I did.\n\nOh, and one more thing from my teen years when I knew addicts in your daughter's position (trying to get clean, going to meetings, etc.): be wary of old friends. Especially at that age when it's not so obvious that they were/are addict friends, and even if they're in recovery together. I've seen old friends take out one too many addicts in my day, young and old.",
            "Man, i just want to celebrate with you. That is so awesome, i am just busting. As a dad of a daughter, i can kind of imagine. I would be overjoyed that my daughter told me that. Not that it had happened and that she had to experience and go through all that, (nonetheless, \"experientia docet\"), but SHE TOLD YOU, MAN! You all must have done something right along the way. Congratulations. Happy things are going in better direction. Btw 3/24/86 myself. ",
            "Just wanted to wish you my best.\n\nI know you came here for advice but honestly I think your daughter's story really puts a light on how the public sees issues of addiction because the narrative is wrong, this isn't some kind of moral or behavioral failing on her part, this is a medical problem with elements of will power and choice mixed into it.\n\nI really do wish you the best, and thank you for sharing.",
            "If she hasn't been, try to nudge her returning to NA. Don't need to indicate you know she was going before to do so. After a relapse it can feel almost wrong to back to NA, which I know is absurd. Maybe nudge her going and see if she's actually working the steps. Can't just go and not work the steps. If she determines NA isn't for her, encourage she try out other recovery programs like Smart Recovery. Be prepared for things to get much, much worse. It's amazing she's taking these steps at such a young age, but the unfortunate reality is it usually takes a much longer time and much greater consequences for someone to really and totally give themselves over to sobriety. Good luck to both of you.",
            "The pattern of being clean for a while and then relapsing is actually quite common for addicts of most types. If you see the time clean between relapses getting longer and the depth of the relapse getting less severe each time, then things are going as expected. Don't tell her that a relapse is no big deal, but don't treat it like the end of the world either. Her feeling it's safe to talk to you about relapsing is a HUGE positive in her recovery. It's ok, and probably even good to express disappointment, but try not to get angry about relapses. ",
            "The fact that your 16 year old daughter went into NA on her own accord is pretty astounding and a testament to either her own intelligence or the stellar way in which you raised her.  Keep on down this path my fellow reddit brother.",
            "I just read the first post -\n\n\"My bassist told me his son who’s been in and out of rehab for years has seen E at NA (narcotics anonymous) meetings everyday this week\"\n\nDoes your bassist or (especially!!) his son know what that \"A\" stands for?",
            "Ugh this update makes me so proud of you I have diabetes. \n\nYou're being wonderful with your daughter. Best of luck for both of you in the future. :)",
            "It may not mean much but I'm both happy and proud of both you and your daughter in how both of you handled the situation, kudos, and good luck!",
            "This is great news. There is obviously a great deal of mutual respect between you two, and that's not accidental. You're paying attention and you're doing an A-plus job of communicating and helping her without enabling or guilt-tripping her. It's very difficult to see the signs of drug use if you're not looking for them, and it's wayyyy easier to just deny that your own family could be in trouble that way. The fact that she took those initial steps to get clean at her age without your interference is a really really good thing; it means she wants this, and that is what will keep her sober.",
            "Having your support is probably the best thing",
            "Good luck to her with her continuing recovery.  ",
            "Wishing you and your daughter the best.",
            "This is the very beginning of her journey into recovery - never give up hope and keep being there for her how you have been!! ",
            "Congrats. Nothing like a Father/Daughter bond. I feel like I go to my Dad with any problem and he would have a logical answer to help me with anything. ",
            "Congratulations, and good luck in the future.\n\n> although I would go back and change some things\n\nNow is the time we can learn from you. What would you have done differently?",
            "This has literally made my throats close up, I have the worlds biggest soft spot for dads like you. \nI read your OP a little while back, so glad things turned out well for you all ",
            "You sound like a great pop.  Daughter will appreciate this hugely in the fullness of time!",
            "I am so glad that this is the update!! \n\nBest of luck to you both.",
            "Good for you. Stood your ground and good for her too. She got honest with you and that is huge. Y'all are off to a great start on the recovery road. Sober 3 years. It does work. ",
            "Hey there stranger, I want to let you know that if I'd had a parent - a mother *or* a father - who was half so willing to listen to me and to put what I needed above their own need for control and obedience then I would probably be a much happier adult.\n\nThanks for being a good parent, and a good example.",
            "I remember your original post! I'm so glad you updated us. You are a very good father, your girls are lucky to have you. I'm wondering, what is your approach regarding their mother? Does she know about the drugs?",
            "You are a great parent. It's hard for teens to be open with parents about such a serious life rocking thing, I'm so happy she knows she's loved and is comfortable with being honest with you.",
            "Aw, that's great I'm so glad things are going well for you guys, and you handled that really well! You sound like a very supportive farther, and wish you the best with your family!",
            "She sounds like a great kid, and you are being an awesome support!",
            "You're an awesome dad and I'm glad your daughter is getting the help she needs!\n\nDid you ever talk to your friend's son about compromising the privacy of the program? That really ticked me off and made me feel scared and sorry for anyone else he may have gossiped about.  ",
            "The person who blew her anonymity, and who exposed everything she's doing, when she's doing nothing but the right thing, is not someone you should want around her. \n\nYou're doing a good job, as someone who has struggled since I was about 18, I hope your daughter sticks with it. ",
            "Proud of her and you both!",
            "Sounds like you are doing an awesome job so far. As an addict myself, the first time I was in rehab I was 16, then again at 17 (for 6+ months) and then again at 24, the best thing my parents did for me was support me 1000% while sober but didn't put up with a DROP of BS when I wasn't or I was slipping back into those old behaviors. I'm talking no money, no house... Nothing. Best thing they ever did. I now have over a year sober and like some other commenters have said... Its not all sunshine and roses. She may wake up one day and have a \"F*** It\" attitude and however much time is gone. Its a constant daily battle some days. Just beware of the signs of slipping back into old behaviors so you can watch for them and do something about it then. A relapse does not start when you use again... It starts much, much sooner than that. ",
            "You've done good, dad.\n\nYou can't be perfect; trying is what you have.  \nShe's grown now, but that doesn't stop you.\n\nShe'll recline her craftmatic decades hence, and know love.",
            "You are an amazing father. No words can describe how much your support will help her on the road to recovery. \nKeep being a safe haven for her :) you two will be able to conquer this. \nShe is doing so well, and congratulations to the 30 days sober!",
            "Outstanding result dad. You have clearly raised your child to understand that, even if she makes mistakes, she can get help if she asks for it. Well done. ",
            "Glad to hear you and your family are doing good. You are a great Dad! Stay strong and family on!",
            "Don't get too discouraged if she replaces. She obviously wants to get and stay clean. That shit is hard.",
            "[deleted]",
            "The above submission has been **temporarily removed** for **one or more** of the following reasons from the rules (as seen in sidebar):\n\n* It is an update post.   Our subreddit only allows a single update to provide the community closure on the situation presented in your original post.  If you believe you will have more information to share with the community after a few more days or weeks, we advise you to hold off on updating the community until you can summarize everything into a single update as you will no longer be allowed to make additional updates.  Once you submit an update, your previous post will be locked, to prevent further discussion on the original post.   \n  Updates are not allowed on removed posts. Please read [this](https://www.reddit.com/r/relationships/wiki/index#wiki_why_was_my_post_locked_and.2For_removed.3F) to see why your post may have been removed.\n\nYou must make suitable edits to ensure that the submission confirms to **all the rules** listed in the sidebar, and in [wiki](/r/relationships/wiki/index#wiki_about_.2Fr.2Frelationships) (relevant for mobile users).  \n\n[Click here (once) to request re-approval](http://www.reddit.com/message/compose?to=%2Fr%2Frelationships&subject=Please+approve+my+submission&message=I+would+like+to+request+the+approval+of+my+submission+at:+%0A%0A+https://www.reddit.com/r/relationships/comments/5lvfxs/update_me_52m_as_a_single_dad_found_out_my_16f/+%0A%0A+---+%0A%0A+My+submission+was+pulled+for+*being+an+update+post+without+links+to+original+post*.+%0A%0A+I've+read+the+sidebar+and+made+all+suitable+corrections+to+comply+with+the+rules.+%0A%0A+/u/throwaway930161#btn) and then click send **once** only.    \n\nThe re-approval is manual, so send a **single request** only. Multiple requests do not mean faster approval, in fact they may clog the modqueue and result in re-approvals taking even more time.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationships) if you have any questions or concerns.*"
        ]
    },
    {
        "post_id": "3oxzfq",
        "author": "evilfil",
        "title": "[UPDATE] My FIL (50sM) took a swing at me (24F) while I was in labor",
        "url": "https://www.reddit.com/r/relationships/comments/3oxzfq/update_my_fil_50sm_took_a_swing_at_me_24f_while_i/",
        "score": 2527,
        "num_comments": 263,
        "created_utc": 1444964954.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/3otb0o/my_24f_fil_50sm_took_a_swing_at_me_while_i_was_in/)\n\nSorry I haven't been able to update sooner.\n\nMy husband actually approached me about this before I had a moment to talk to him. I've been a mess, to be honest. But you all are right, I know I have to cut my father in law out of my life, regardless of the cost. Thankfully, my husband had come to the same conclusion. We talked, and I cried, and he cried, and we agreed it would only hurt our daughter and our future other children to keep this man in our lives. \n\nWe contacted my MIL, and she is aware of our stance. We are officially no contact with my FIL, and if he shows up at the house, we will call the police and pursue prosecution. We're still considering filing a police report about what happened at the hospital.\n\nSome clarification, because I have stupid sleep deprived brain and have a hard time writing, and have been getting pretty serious hate mail over this bit of bad writing: No, husband and I would not have aborted a boy. My FIL accused us of that but that is not and would never have been the case. \n\nTL;DR: Husband came to conclusion separately from me- we're going no contact. Will prosecute FIL if he pursues.",
        "permalink": "/r/relationships/comments/3oxzfq/update_my_fil_50sm_took_a_swing_at_me_24f_while_i/",
        "comments": [
            "[deleted]",
            "[deleted]",
            "Ugh. Who would read your first post and think you *actually meant you would abort a male fetus*? Reading comprehension (and an understanding of context!) is important! \n\nI'm so sorry you had to go through this, but I think you're making the right decision for you, your husband, your baby, and futurelings. Your FIL is dangerous. My father is a lot like your FIL and going NC as a teen is the only thing that saved me from him. \n\nGood luck with your life, OP! ",
            "Guys reading the previous post OP got a ton of shit. Shes a victim of domestic abuse and so its harder for her to understand just how wrong this asshole is. But she did it and her husband did his job. Good job all around. ",
            "You are doing the right thing for you AND your daughter. Good luck.\n\nIt was clear in your first post that you had not aborted and that this was some delusion of your IL. If people are going to be gross and hateful, they should at least read the posts properly.",
            "I'm glad your husband came to this conclusion on his own.  I wish you guys all the best.  Enjoy your new baby.",
            "This was a good update! Congratulations on you and your husband in reaching a mutual decision and having a proactive plan put in place. Well done!",
            "Really proud of you OP. This isn't the easy course of action but it is the right one. I would encourage you to please go forward with the police report, having official documentation is really important, and also please consider getting an actual restraining/protection order.",
            "English is not my first language and I don't live in an anglophone country. Yet, by reading this :\n\n>Even to the point of telling him we didn't want to find out about the sex of the baby because if it was a boy I'd probably abort\n\nI would never have come to the conclusion that you'd abort a baby boy.\n\nIt was obvious that you were talking about your FIL telling this.\nSo, I'm sorry for the hate mails you got...",
            "I'm so glad to see this update (as glad as someone can be, considering the circumstances of your original post). I remember you worrying about depriving your child/husband and even though you may still feel some pangs of guilt about that, you can absolutely take comfort in knowing that you are doing the BEST thing possible for you, your family, and your young child. It's absolutely so unfair that you have to deal with this as well as a newborn - going no contact seems the best route IMO.\n\nIt takes guts, good on you OP! I hope your MIL maintains a relationship with you all with no real issues. Best of luck to you!",
            "I'm a fan of paper trails. Go ahead and file a police report. You don't have to follow through with charges but it *will* help if anything ever happens again.",
            "I'm so sorry this is all happening to you.\n\nPlease, feel free to PM me if you want to talk. I had a a very traumatic family event happen when my daughter was 3 months old, and would be happy to lend any aid I can. Even just to be someone to listen.\n\nBest wishes for your family.",
            ">We are still considering filing a police report about...\n\nDo. Now. Not to be an ass, seriously, but this isn't something you can just do whenever at your convenience. You do it when it happens. If you're still wanting to do it, get up from reading this post and go do it. \n\nIf this comes down to court, they will ask why you waited. By the time somebody actually asks that, they don't care what the answer is. They'll use it against you. \n\nWhile you're at it, get a restraining order. \n\nI can't believe that a grown-ass man would act like this. I'm happy for you, and your husband, and your daughter, that you have each other. Best wishes for the future, sincerely. ",
            "It's awful that it was neccessary for you to clarify that you would not abort a boy. Stay strong, you're doing the right thing here. ",
            "This is an awesome update and good on you and your hubby for coming to the same conclusion. Fuck that violent bastard. Just be ready in case he pulls some shit. ",
            "I think it was pretty clear regarding the abortion bit and it's ridiculous you were getting hate mail over that [assuming people didn't read what you said very carefully].\n\nGlad to hear you and your husband have come to a decision together! Pulling out of FIL's life doesn't mean you need to cut out MIL, as well which is important to remember.  You know what is best for you, your child, and your family. \n\nAs they say, Good Riddance to Bad Rubbish! :)",
            "Everyone in his community needs to know that he tried to hit a woman in labor. ",
            "You did the right thing OP, my father threatened to kill my SO while she was pregnant with our son, it was the last straw in a long line of abuse (towards me) we cut all contact and he has never met my son and he never will.\n\nI do not regret that decision one bit, ok maybe one thing, he poisoned my nan and aunts minds with some unknown (to me) info and they refuse to talk to me now, the worst bit is my nan is pretty ill ATM and it's hard to send her my love and thoughts. ",
            "Might you consider a restraining / protective order?  That would make prosecution easier if FIL persists.  Without it, attempts to charge him would almost certainly be met with \"Why didn't you get a protective order?\"",
            "Oh well thank goodness you both reached an understanding! Good luck to you both.",
            "Glad you and your husband are on the same page. This is not a person you need to have around you or your daughter. Now you can put this behind you and focus on what's really important: enjoying your family and getting to know that new little person you two made. Congratulations and all the best to you.",
            "Going no contact was really the only option in this situation and I'm glad that your husband was on board with it.  ",
            "Honestly, for the sake of your credibility and not to leave any doubt, you should have filed a police report immediately regardless of whether or not you intended to press charges or seek a restraining order.",
            "I can't believe you got hate mail over THAT! You should report them if possible.",
            "I'm glad y'all have a united front regarding this issue. Good luck!",
            "> Some clarification, because I have stupid sleep deprived brain and have a hard time writing, and have been getting pretty serious hate mail over this bit of bad writing: No, husband and I would not have aborted a boy. My FIL accused us of that but that is not and would never have been the case.\n\nPeople on the internet suck.  I'm so sorry.  Feel better!",
            "Good on you both. I would still file a report or a get a restraining order before you are past the period of time to do so. You never know. I'd want to have the incident documented in case something else were to happen and I needed further proof. ",
            "Get an intervention order. It's easy to do and it results in an instant arrest if he's at your house and you call police. Safety first. ",
            "Good lord lady, I'm so sorry to hear all this, nobody deserves anything like that. \n\nBut your FIL simply showing up is not criminal. You cannot prosecute, as you say. If you want to be able to do that, you need to lay the groundwork. You need a restraining order. I do not know what state you are in, but you should familiarize yourself with the requirements and see whether you can get one issued. Then, if he shows up, you have him on violating the restraining order.",
            "I would file a report so there's a trail for them to follow. ",
            "File the police report and get a restraining order.\n",
            "I would suggest filing a report with the police now while the matter is still fresh. You may thank yourself later if FIL's anger gets the better of him and he makes poor life choices in your general direction.",
            "two words: Restraining Order\n\nAnd make it the permanent kind.",
            "Congratulations!\n\nIn addition to filling the police report you should also file a restraining order for you and your daughter.",
            "You're doing great, and having a united front is going to make it easier in this hard time. Hang in there, and now you can spend your time and energy focussing on the new baby :)",
            "I think the solution you and your husband have come up with is very practical and grounded in common sense, especially if your FIL is aware of your decision and intends to respect your boundaries. \n\nIf you are unsure of your FIL's stance, I would highly reccomend that your husband find out as discreetly as possible what your FIL's mindset is. \n\nIf your husband gets wind that your FIL feels he does not have to respect your boundaries or states that he intends to disregard your wishes, it would probably be in your best interest to go ahead and file a police report that documents what took place in the hospital. \n\nPersonally, I would want to do things in such a way that future reconciliation is not totally out of the question. People *do* change, and not always for the worse! \n\nThe only reason I would not want to leave some opening for reconciling the situation in the future would be if I genuinely feared this person (your FIL) and saw no future in which he may begin to regret his actions, or if I believed him to be completely incapable of and/or uninterested in understanding why it is *beyond* wrong to behave threateningly towards a laboring mother. In that case, life is just too freaking short, and mucking it up with people who are such incredible douching assholes is just asking for misery and disaster.  \n\nI just read your first post, your FIL is a misogynist shitlord and there is no way in hell I would *ever* allow that sack of testosterone flavored shit anywhere near either me or my girl children. He will damage your daughter be subtly sending her the message that she is subhuman because she does not have a dick, and he will do this deliberately because he thinks it is the correct thing to do. \n\nKeep your little jewel away from this monstrous son of a bitch. ",
            "I just want to add that you and especially your husband should start therapy if you don't already go. This will be a great way to ensure that you keep your marriage on solid ground and help you both navigate the situation, since just having a kid is enough of a strain on a marriage!",
            "Definitely file a police report. I hope, if anything, this situation can help encourage your MIL to leave him She's clearly in an abusive relationship, and that's unacceptable. It's not your responsibility to get her out of that situation, you have enough on your own hands and it could put you in a bad position, but I do truly hope she leaves him and he's left with absolutely no one.",
            ">No, husband and I would not have aborted a boy. My FIL accused us of that but that is not and would never have been the case.\n\nAh, that makes sense and it's what another person suggested you meant. So, will this mean no contact with MIL or will you try and work that out so she can still visit.",
            "Restraining order. Calling the police when he shows up will do little other than remove him.",
            "You're right to go no contact. That's not even discussable.\n\nYou should have filed a police report. Do it. You will need all the proof on paper you can possibly get if he tries anything. Even after the report getting a restraining order would be a good idea. Get a legal consultation as well, to make sure you do this right.\n\nAre you going to keep any contact with MiL?",
            "That you didn't update sooner? You only posted the original 1 day ago.",
            "I would definitely file a police report. That way there's a basis and they'll take it seriously if he shows up at your house again and you want him gone. They'll see shit has gone down before and they will make sure to take action.",
            "Atta girl! I know it hurts but once the pain passes you will be so much happier without the toxic abuser in your lives. God on ya for taking that first step :)",
            "I wish there was a separate sub/thread where all the top stories could post their collection of hatemail (with usernames cut out, *fine*) and compete.",
            "Sounds like the apple fell very far from the tree.  You have a great husband and you're doing the right thing.",
            "[removed]",
            "Thank goodness! I was getting so distressed reading your comments in your first post, thinking you weren't going to do anything about this. You are making the right decision here!! \n\nYour safety, and that of your daughter and husband, is what's important here. So glad you're taking steps to protect your family :)",
            "You may want to file the police report now even if you don't want to pursue felony charges; it will make getting a restraining order or calling the police again much easier as there is a pattern of behavior.",
            "Way. to. go!! This is exactly what you guys need to do! Great man to put his wife and child first!",
            "Dear God, what an asshole! I feel bad for your husband for having to put up with that for so long. Even the biggest jerks and losers I know are usually respectful and kind when a baby is being born. \n\nThis guy is just sick, and needs to know that he can't treat you this way, and the best way to do that is by filing a report. ",
            "Your FIL and my FIL could very well have been twins separated at birth. Mine never took a swing at me, but I got one overt death threat and another thinly veiled one.  We are no contact with that asshole too. \n\nGlad to read your update. I was dismayed by the hateful comments from those who misread your earlier post. I got that every foul thing listed was words that came from your FIL's mouth. Maybe that's because I've listened to some pretty vile things spewing forth from my FIL's mouth hole.",
            "Well the cost is one less violent toxic person in your life. Congrats for standing up for yourself and your kid OP. But seriously, what is the downside here? \n\nFile the damn report already!!!!!",
            "This and the previous post raised some red flags for me and I tentatively am calling bullshit/troll.\n\nI worked in a hospital for several years but not the labor and delivery unit except for 1 shift. (I will preference by saying it was a big urban hospital, OP could be in a rural area with not a lot of security. If possible, would like a rural nurse/doctor to comment on this/my comments)\n\n1. No one can get to the L&D (Labor & Delivery) floor without checking in with the hospital receptionist. They won't even tell you want floor it is on. The receptionist will check the list given by the mother then call the floor and get confirmation that the guests can come up. Even the *father* can't go up without the mother's consent. Once confirmation is given, the guests are given a badge/wrist badge that allows them to enter the floor. The doors are locked, you need the badge to buzz you in. Once on the floor, the nurses will check the name against the list and ask the mother **again** if she wants the guest.\n\n2. NO ONE IS ALLOWED IN THE LABOR ROOM without the mother's consent. Regardless of who it is, mother's mom, the father, whatever.\n\n3. There is security on the maternity floor. (You'd be surprised how much drama occurs).\n\nFor the MIL and FIL to barge into a birthing room, not possible. \n\nIf there is an assault (the FIL swinging on a birthing mother), filing a police report is out of her hands. Security would have stepped in, detained him and called the police. If nothing else, the nurses wouldn't have just stood there waiting. **This is why my spidey senses is tingling**\n\nBecause of the rash of baby thefts, security protocols are in place in every hospital. This situation wouldn't occur but I am not a L&D nurse, so I'm not 100% sure but I find this story hard to believe.\n\nA birthing mother isn't left alone by nursing/doctor staff. A nurse/doctor isn't going to stand there letting someone yell or attack someone in active labor. Police or security would have been called. A physical altercation (son chokeholding father) would trigger police and a police report.\n\nI don't know OP's location, she may be in a rural area that doesn't have as much security or stringent L&D protocols so I can't say troll or bullshit with certainty but this story raises a lot of doubt to me..\n\n\nEDIT:I withdraw my bullshit/troll statement. Apparently there are a lot of hospitals that don't have strong maternal security protocols. I'm genuinely surprised.",
            "He'll realise the true consequences of his actions and words when he'll have limited/no contact twith his grand daughter. Good luck with the new baby.",
            "What a liberating decision. Cutting him out is the best plan of action. Now you get to enjoy your baby. Congratulations. ",
            "Damn, dude. You went through quite an ordeal. I'm proud for you. I know I don't know you and you don't know me but it sounds like you know exactly who you are and you refuse to be abused or disrespected. Your daughter is lucky she's getting such a strong mom. And your husband sounds pretty rad too. I wish you the best. And I hope for your family's sake the FIL gets some therapy and maybe one day is safe and sane enough to be allowed back into your family. ",
            "Congratulations for sticking by your guns, OP. You have a wonderful relationship with your husband and your daughter is going to grow up in a safe environment. An excellent update all around.",
            "Get a DVO.",
            "File a police report; you will want a paper trail as long as possible documenting his behavior if shit ever hits the fan. ",
            "So so happy to see this update, you are doing the right thing. I wish you and your adorable family all the best! If you ever need to talk do not hesitate to PM me :)",
            "File! I hope MIL will leave him!",
            "Thank you so much for realising what a toxic POS he was and cutting him out. I wish your family all the happiness you can imagine.",
            "I'm so happy that you both decided on that. I remember reading this the other night and hoping that you would come to a better conclusion. I wish you luck on your journey with you husband and child.",
            "I'm glad that you guys seem to be doing the right thing. Please create a paper trail just in case.",
            "Hell fucking yeah call the law. File the report for the paper trail alone to help you in case of further incidents. Otherwise, good on you, I hope everything goes well, and congratulations on adding another warrior princess to the world.",
            "Sue the hospital for letting the FIL in.\n\nThis is something they could have prevented, and were negligent in allowing them up.",
            "I read this and the last thread and holy shit, what a complete asshole. I'm relieved for you that your husband and mother in law are backing you up.\n\nSo many things wrong with about this guy .... being mad about not knowing during the first trimester (standard shit for high risk pregnancies, my co-worker is a cancer survivor and did the same thing at the office), to the abort the baby if it's a boy comment, to having the audacity to tell you how to have your baby. ",
            "[deleted]",
            "(((hugs)))\n\nI'm so sad that you had to go through this, but you and your husband have made the right decision.  \n\nI'm proud of you Momma Bear!  ",
            "will the MIL be staying in the picture.",
            "I'm glad you and your husband are on the same page. Have fun being a mom1",
            "Just a side note:\n\nBe careful with your SO.\n\nWatch for warning signs. Some guys grow up to be defenders of women, like Sir Patrick Stewart. Many of them grow up to be abusive just like their abusive fathers.\n\nIf he starts being controlling or possessive, if he starts throwing things, you be ready.\n\nIf he ever lays a hand in violence on you, you call the police, you make sure it is legally documented, get away from it, and do not make excuses.\n\nI'm sure he is probably more like a defender, but sometimes you can't tell. Some abusive guys will wait years before they bring out their crazy."
        ]
    },
    {
        "post_id": "q4q1jg",
        "author": "Complete_Mountain_78",
        "title": "How do I (25M) to support my newly paralyzed girlfriend (25f)?",
        "url": "https://www.reddit.com/r/relationships/comments/q4q1jg/how_do_i_25m_to_support_my_newly_paralyzed/",
        "score": 2533,
        "num_comments": 171,
        "created_utc": 1633801072.0,
        "selftext": "My girlfriend was recently in a car crash and the outcome is not good. \n\nThe doctors ran their tests and scans. The results of those scans, not good. Her spinal cord was damaged in the T10 and it is a grade a. Which means she is paralyzed from the waist area down with no function. \n\nThis is a huge life changing thing for her. Before, she was a model, we played golf and tennis, ran, hiked and traveled a lot. \n\nHow do I support her through this?\n\nTL;DR - My girlfriend was just paralyzed, how do I support her?",
        "permalink": "/r/relationships/comments/q4q1jg/how_do_i_25m_to_support_my_newly_paralyzed/",
        "comments": [
            "Hey, kid of a paralized dad here. My dad was in a road accident, too when he was 27yo and is paralized pretty much from his bellybutton downwards. The scars the Opa rations left and the obvious impact on his life really hit him hard back then.\n\nOne of the worst things he sais that happened in that time were that only his youngest brother came to visit regularly, he felt really alone. All his hobbies were shattered along with his back and only his younger brother came to care.\n\nHis girlfriend at this time came in once to tell him, that this is all too much for her to bear, so she left him.\n\nThe fist months he was incapable of doing anything alone and he hated it. He hated the pity he saw in people's eyes, and he hated what his life was now.\nSo he changed it.\n\nFor now all you can do for her is be there. When she has a good day, you can show her what wheelchair users are capable of. Aren Fotheringham is a good example for this, but even on the lesser extreme side of things, with just a few adjustments a wheelchair user can do just about everything anyone can. Just differently.\n\nWhen you get out of the hospital help her do the paperwork. Collect and bring papers whenever possible, so she doesn't have to be confronted with things she cannot overcome just yet like stairs or even elevators, when she is in a lying down wheelchair, as my dad had to be a few weeks after surgeries.\n\nWhen she gets fit enough to sit again make sure she gets a good wheelchair. Those are her legs. Don't save on that. If you need help on what to look out for regarding wheelchair fit dm me, I worked for a company that handbuild tailored wheelchairs, as does my dad.\n\nI can imagine getting back into tennis or golf could be either very good or very bad. You know your girlfriend better to know what type of person she is.\nBut as she obviously likes sports, try and find a sport she enjoys. Almost all sports are with a few rule adjustments possible to do from a wheelchair.\n\nAnd most importantly: Don't help her go through her day. Help her figuring out how to do so herself.\n\nI grew up with a wheelchair as a hobby. My dad taught me how to balance it on two wheels, how to get up curbs, how to ride escalators, how to go down stairs. As long as something is not out of reach, or to small for her wheelchair to fit, she can learn how to do everything her daily life might throw at her.\n\nFor most wheelchair users I know this is the most vital part. Getting your independence back, being able to live without someone's help, and seeing just how much they are still capable of doing.\n\nEdit: thank you guys for all the nice comments, dms and awards. I just woke up to see all the responses and it already made my day start out great!",
            "You're the guy that couldn't locate his girlfriend for two days. I remember your story. I'm so sorry to hear what you're going through, and, of course, your girlfriend. You're a wonderful man for staying by her side. I don't know what else to say to you, I don't have any advice, but all I can say is that I appreciate your unconditional love for your girlfriend.",
            "Let me start by saying I'm not paralyzed nor do I have a paralyzed family member.  But I did have a stroke 4 months ago and lost control of my right side. Much like your girlfriend, I had to lay there in the hospital wondering what my life going forward would be.  Many questions running through my mind like \"Can I ever do X activity again?\" \"What do I do about my business if I can't regain control of my body?\" \"What will I be able to do?\"\n\nFor the immediate term, having family & friends visit meant a lot to me when in the hospital. Being able to converse in a normal manner brought a sense of normalcy that I needed. Just being there and talking to her will mean a lot.  More than you will realize.  \n\nShe is going to need counseling. That is a given. There will be good days and bad days. If you are in this for the long haul, then you need to cheer the good days and handle the bad days. If possible, be there with the counselor so you can learn to be there and help her mentally.\n\nNow, when I was learning to walk again and use my arm again, nothing bugged the shit out of me more than people trying to do things for me. My mind set was to get better as much as a can and in order to do that I had to do as much as I could myself.  Yeah, at first it royally sucked not being able to even wipe my own ass.  I needed help. But I worked at it and worked at it until I could some of it.  Then, I got so I could wipe my own ass. Doesn't sound like much and people laugh, but as a personal milestone, it was HUGE.  Your girlfriend hopefully will have a similar mindset.  Keep that in mind always if she does. Don't do it for her. Let her do as much as she can and only then step in once she's done as much as she can.\n\nHer life isn't over. It's just different now.  I don't know if she had facial injuries or not. But if she modeled before, why not again the future?  More companies are being inclusive in their ads. Why can't she strive to be one?  Liked to hike before? Maybe now you bike. It's great exercise and there are great long distance bikes for paraplegics. Tennis and basketball are still in the table. Just different.  Skiing? Still on the table, just different.  Swimming, etc. There is practically no limit to what she can do. She just needs to set her mind to doing it.\n\nFinally, when I got out of the hospital, people treated me like I was fragile.  I had a fucking stroke, I'm not made of glass. If I stumbled, they would freak and act like they are going to do a diving catch.  It got so bad I yelled a few times.  I'm learning to walk again. Yeah, I'm going to stumble and if I don't learn to catch myself I won't improve. Your girlfriend is in a similar boat. She had a bad accident. She's paralyzed. She's not dead. She's not made of glass. Don't treat her like she is. She has to learn to 'walk' again in her new normal. She's going to fall. She needs to be able to pick herself back up again. Not you picking her up and putting her in her chair, but asking her if she needs any help first. Let her be independent and prove to herself that she can be independent.",
            "Obviously be there to support her and she should go through the grieving process. But this isn’t the end of her active years. Far from it. If you live in/near a larger city she can get in touch with the local adaptive centers. Skiing, biking, swimming, basketball, tennis, working out at the gym, etc are all still activities she can enjoy. Once she gets in the groove with a physical/occupational therapist, maybe you could learn a new sport together? \n\nAlso, I recently got to try out a couple of the adaptive mountain bikes and oooooohhhh buddy, it was a good time!!! One of my friends can get some massive air in his! Another of my friends goes on hikes on adaptive friendly trails.",
            "Survivor of a near-death experience here. Make sure she knows that trauma counseling is a must.",
            "I don’t have any advice but just want to say that I’m so sorry your girlfriend and you had to go through this. I remember seeing your earlier posts. I’m so sorry it’s been such a difficult time. Hoping for the best for you both. I think this is a good first step; seeking advice instead of leaving.",
            "My friend is paralyzed from the neck down. There is a lot of stuff she can do. It's surprising how inventive people can get. Your girlfriend still has a world of opportunities open to her, but it is gonna take a while to find those.\n\nIt's OK if she's depressed, it's OK if you're depressed. Being paralyzed still sucks.\n\nAlso, constipation and bladder infections are a major issue. My friend was once so constipated that it started giving her heart problems. Do not let it get to that point.",
            "Research it and know that there is a grieving process on both ends. You and her will be grieving your lives as you once knew them. That doesn't mean life is over. But mourning is entirely normal and valid. \n\nAlso think about ways to help her not feel left out, emotionally, mentally, physically. Make the effort to make sure things are accessible to her.",
            "im not paralyzed, so my experience is not as severe, but i did suddenly become physically disabled when i was 20. im 22 now, im still figuring stuff out. becoming chronically ill has seriously thrown my life off the path i was working really hard for. so im not paralyzed, but i can definitely empathize with your entire life changing and the things you loved becoming inaccessible.\n\nI really hate asking for help. When you ask for help for simple tasks because you’re disabled, especially if you were known as someone quite physically capable before, people always want to fucking pity you. It *sucks.* This is the rest of my life. I am only going to get worse as I age. I do not need to be reminded that my existence makes you feel bad or guilty. I’m human, I am me, I just need help. I’m sure many disabled people would agree that pity is at the very least frustrating. My advice to someone in your position is to just learn how to act around someone who’s physically disabled. Be available to readily help, but don’t turn it into like a symbolic act for adjusting to the new normal. Be thoughtful about the space around you. Try to notice simple things that are easy for you, but might be hard for her. When you do help, keep the mood casual. Don’t turn it into a chance to emotionally bond, or an overt display of love. In my case, someone helping is enough. It does not need to become a mini soap opera. \n\nYou know her best. When she needs that emotional support, when she needs to wallow, that’s different. I think that’s something only you can know how to do. Like others said, there is going to be a grieving process for both of you. But this is the rest of her life, and she’s still as much of a full human being as she was before the accident. She’s not a stray pet or a tragic story, she needs to be supported and loved but not pitied (unless, of course, she does want that!) \n\nAlso, you’re allowed to get frustrated. This is a big event for the both of you. Life is going to be very different than it was. Be transparent with how you feel, have open discussions with her, encourage her to speak with you about things that are difficult for her that aren’t so obvious. Open your doors to your friends, family, support groups etc. One good thing I have taken away from becoming disabled is how many people showed up for me. When people love you or empathize, they *want* to help. Not only will it make your life easier, but I think it can be a general bright spot in this journey. \n\nI wish you both the best.",
            "Don't try to support her through this if you aren't planning to be in it for the long haul.  If you need a gal with model looks, who can play golf and tennis and go running with you, hiking, and so on, then be honest with yourself about that.\n\nShe can still hope to travel, though, and you might find new enjoyments that you can share which you never did before.\n\nMy father dated a paraplegic woman for a few years, but then unexpectedly met the woman he later married (my stepmother).  And not being a terribly sensitive person where other people were concerned, he completely abandoned the first woman.  Don't be like my dad.",
            "Participate in her physical therapy as much as she allows. Go to her appointments with her, learn her exercises. If they give her a home exercise program (they will) learn how to use whatever equipment they give her and help her with them.",
            "If they give her physical therapy options to regain any function at all or just to maintain her legs although she can't feel them, do not skimp out on them!  Ya'll are young and at some point they're going to figure out how to regrow nerves, encourage her to stay in the best shape possible.",
            "Give it a solid year of not deciding how to support her, and just doing what needs to be done at a moments notice.\n\nDecide if you're in for the long haul.\n\nDecided if you know if she is when/if the situation was reversed.\n\nSit back.  No matter what, this will feel like a long haul.   Be there.  For her.  For you both.  For her family.  You'll know what to do.  One thing is, don't take a back seat, unless you were never yet in the front seat with her yet",
            "I really like the youtube channel Roll with Cole & Charisma--they're an interabled couple (boyfriend has a sci), and it showcases their journey and daily life. Also linking her up with support groups, and people who have similar injuries as her who are active and thriving can also be helpful. A lot of those activities that you mentioned can still be done but just through adapted means.",
            "Learn everything you can about emotional labor. Do what needs to be done before she has the chance to think about it. \n\nAlso, This kind of healing (emotionally and physically) is almost definitely above both of your pay grades. I’d consider you both seeing a therapist separately and as a couple to have a safe place to talk.",
            "i’m so sorry your girlfriend is going through this & you’re such a great man for reaching out on how to support her. \n\ni’m a nurse and i agree with all the replies, i hope others keep them coming. \n\ni just wanted to mention one thing - you said before this, your girlfriend was a model. \n\nyour girlfriend can still be a model, paralyzed or able bodied, wheelchair or not. ♥️",
            "She needs a good rehab program. Also look up support programs for women with disabilities, they have these all over.",
            "I have no experience with this, but I know hope is important, so it might be worth pointing out that in a decade or so, Neuralink might be  able to fix stuff like this (by making a spinal cord bypass). It doesn't help her in the short term, but in the long term I think it makes sense to hope (and even expect) that she won't be paralyzed for the rest of her life.",
            "I found it really helpful to connect with other young, disabled women, who were living their lives really well. Something about seeing it embodied in a person was a huge help for me to imagine my life, and also to feel like someone understood. I had a few friends who were disabled already, so that was a boon. I also got a lot out of watching YouTube videos from younger, disabled content creators like Jessica Kellgren-Fozard, Molly Burke, Hannah Witton, Jen from WheelsNoHeels etc. It was helpful to know I wasn't the only one who was constant the subject of other people's ableist microagressions.\n\nMost of all, let her know that you love her, support her, and see how the adjustment is hard. Let her know you aren't filling anywhere. Encourage her to consider disabled focused counselling, to come to terms with her disability emotionally, and perhaps process some of the trauma.",
            "She will probably Not be working or open to the idea of exploring what work looks like for a while. BUT when she is, social media has given way more opportunities to disabled models nowadays. It may be good for her to know that this job or hobby can still be done even if it looks different than she's used to",
            "This will seem random, but try watching the movie Penguin Bloom. It tells the story of a family's adjustment when the mother had an accident and broke her back and she did just about all the things you and your girlfriend did.",
            "I don't have an advice but this thread has been very insightful. I remember reading your past 2 posts and the outcome as you have mentioned is not good. I'm glad to see that you are trying your best to support her and personally i just think you raised the bar of romantic relationships! I hope both of you find new activities and keep being there for each other.",
            "I would start by learning how to care for paraplegics,  maybe ask people who do that for a living they will have gold insight. Also just listen to her, let her vent, cry,  and Express her emotions however they come out. Counseling would also be good for her, I know how it is to have everything taken away like that.",
            ":(\n\nI just went on your profile to double check if it was the same couple from before with the 2 days of no contact due to accident. I'm really sad and sorry to hear the news. I can't give any advise but I'm sending her lots of virtual hugs, and sending you positive vibes during this difficult time.",
            "Hey man,\n\nI'm not sure how much help this is, but I've some experience in the powered wheelchair industry that might help your girlfriend and you. Not sure where you're located but some insurance worldwide can help subsidize these wheelchairs which are really expensive.\n\nBut it seems like she \"used\" to enjoy a lot of outdoorsy activities. So one thing that you can maybe help with is to find a product that helps with that. (I got some sort of wakeup call when I heard it from my boss, \"when was the last time a person with paralyzed legs was in the woods?\" or similar). Some brands that I remember gave me a good impression are Zoomability, Invacare, Permobil and Sunrise Medical.\n\nSo to help her get back to the \"normal\" after grieving, maybe you can start with going to some Powered Wheelchair/medical fairs and find something that can help her in the future. Maybe right now she won't have the energy for it, but then you can start and make some research on your on and help her in the future :)\n\nAll the best!",
            "I just wanted to suggest some new hobbies for now while she's healing. There is a massive serotonin boost to creating something while sitting in one place, and seeing that item come to life right before your eyes makes you feel like youre accomplishing something. \n\nWhen I was about 30 I discovered the art of needle felting via this video: https://youtu.be/3u7X1AsSSZU[Making a Schnauzer plushie](https://youtu.be/3u7X1AsSSZU)\nI was immediately fascinated. I went out to Joanne's fabrics for wool roving and Walmart for a Clover 3-needle felting tool. This is an incredibly CHEAP hobby, you can buy an entire set of needles, huge selection of colorful wool, and some finger protectors for under $15 on etsy or Amazon. There is something SO meditative about the repetitive stabbing of the wool to form little shapes, and there's pretty much no mess to clean up after. No glue, no sewing. Just stabbing. \n\nThen, when my mom was in hospital for a bone marrow transplant, I was going  absolutely nuts with the waiting. So again, I got on youtube and found [a crochet tutorial to make a stuffed bunny](https://youtu.be/3WZw15ihw9U). Went to a nearby Walmart, bought two pretty yarns and a set of crochet hooks ($12) and learned to follow along with the video. It took much longer than needle felting but it was so much fun! I had no experience with crochet at all, youtube videos were good enough to learn with.\n\nHope this helps, you seem like such a good man.",
            "To reenforce what others have said. Being there is the most important. I have a child with challenges (not the same as your GF). But I always treat his issues as challenges , not tragedies.  That puts you in the placing of learning what you can do to support, not enable. Learn able Abel-ism and don't do that ! Right now take it one day at time. I always believe in having a 'plan b'...but to be honest, I'm hovering around 'plan z' at the moment. :)",
            "First & foremost, get a good lawyer in a BIG firm. Cost for all injury lawyers is 1/3 of settlement so don’t worry about cost. \nIf it was her car, her insurance should provide costs of medical. If she was a passenger, driver’s insurance should.\nIf you had a serious relationship, MARRY her. Your health insurance should cover her medical after a specific time.",
            "Follow @leataylor8 on Instagram.  She was a perfectly healthy and active 20-something until she had a bicycle accident a couple years ago, and is paralyzed from the armpits (I believe) down.  And she’s now a para-triathlete, just two years after the accident.  Her boyfriend who was with her at the time is still with her, he is her biggest supporter in her new life.  She has an incredible attitude about her accident, and is now chasing her dream of being an para-Olympian now.  I learned about her on the Traithlin Taren podcast, you and your GF should search and listen to the episode, I think it’ll give you both a lot of hope!",
            "Please look into Dr. Joe Dispenza. Hear his story and maybe give his teachings a try.",
            "Be honest with what you want here.",
            "Being real, you probably won't be there for the long haul- key words \"she was a model\". But I'm not judging. The important thing is to help her through her therapy and stay as long as you can, and don't act like she's a burden. I'm sure there's a lot of great traits she has other than physical that can keep you two going in the short run, and if the long run works out, even better. Right now is no time to think about her being 30, 35, 40, she needs your support both time, cheerfulness, and giving her hope for the future. You yourself probably don't know how things will turn out so I wouldn't consider any good comments even white lies.",
            "You love her? or looking for excuse to leave? Girls in chairs still model if you love her be there do research on her issues it helps",
            "She's not your wife therefore you're not obligated to support I bet if the roles were reserved she would even look at you at the same way you are now. I am telling you man go look for another partner because she might not fulfill your needs. That's my advice",
            "[removed]",
            "Not exactly the advice you expect but the two of you, watch the movie \"Penguin Bloom\" it's about a very simliar situation and you get to see how they get through it.",
            "Help her find support groups and reassure her that you care for her. Joni and Friends is a good resource.",
            "Help her recreate her life and herself",
            "Be her cheerleader and support her. Find some new activities that she can do. She will be active again. It will need some modifications in how she does it but it is possible. My one leg was going to be amputated from thigh down if the debridement of the gangrene didn’t work. My family was already working on finding me places to do my favorite activity that could support an amputee. Be there for her. Oh and I didn’t lose that leg but I was very very lucky.",
            "[removed]",
            "All of these suggestions are great. But I would add one thing. There are peptides that can regenerate the body a bit. I would look into bpc-157 with STRONG ir lasers at the spine. People will laugh at this, but you have no idea the changes and turn around people have had researching their own health when the docs say it’s hopeless \n\nI would look into all bovine products too, as beef organs can help heal, along with bone marrow, HGH is tremendous too. \n\nAll of these things, might make a good dent, you don’t know till you try. I say this as someone who has seen 15 doctors over ten years … they couldn’t help me and I did my own research, figured out my neurological disorder, ans am now healing.",
            "OMG I am SO SORRY!! That poor thing! So this is obvious but she needs you now more than ever. She needs to know your attraction to her won’t fade, and I mean REALLY know this in her bones. Think carefully about how to convey this but probably after she’s dealt with everything else. Oh I’m so sorry for her. 😭",
            "She can still be a model possibly, there is a push for more representation and diversity in modeling. Don't write it off yet",
            "Simple answer, don't do anything out of guilt. Whatever you do, do it out of a genuine love for the other person. Period. And if you honestly feel like you cannot carry on with it, be honest about it to your partner and to yourself. \n\nThis is one of those shitty life situations that has no clear answer. The only answer is about truth to yourself. And you need to meditate on that and feel super sure about your choices. And you NEVER ever have to feel guilty about your choices. Honesty at a personal level is the hardest thing to do. We are always colored by external factors. So you need to work extra hard at thinking this through for yourself. And no answer you come up with is going to be right or wrong in the public court of justice.",
            "I was mates with a guy who became paralysed from the chest down at 16. He was a nationally ranked wheelchair tennis player. It’s not going tk be easy. It’s going ti be an incredibly hard journey for her. But her life isn’t over. She can still play tennis. She can play golf. Also, this is going to be hard for you too. So reach out to a therapist for help and support for yourself (this will also help you be able to support her even better)",
            "Be there for her trough her grief and acceptance process. And as some has said, it doesn’t mean the end of an active life. There are both manual and power chairs that can be used for hikes and there are even championships in sports for wheelchair users. In my town we even manufactured powerchairs and I have friends participating in those sports that I have met trough my arthritis. Hope you two get a happy life and stay strong both of you. ❤️",
            "Work on getting her an aide to help with personal hygiene. Once she stabilizes, she if she can get a wheelchair that will allow her to go on hikes and runs. If she drives, see about getting an accessible vehicle so she has her independence. \nSee what insurance will cover. Any money that comes in from a lawsuit, work with a financial planner so the money will last as long as possible. \nBe a ray of hope and sunshine for her.",
            "You should also look into getting a therapist - caregiver burnout is real.",
            "The most important thing right now is to be there for her with unconditional love and support. She might lash out at you, she might withdraw, it might seem like she doesn't care about you because she is struggling emotionally with everything.  Love her anyways and be kind to her.",
            "Man, I'm so sorry. I remember both your posts when she disappeared and my heart goes out to both of you\n\nI'm disabled but not in a wheelchair so I'll leave that advice for others. But you and your gf can be stronger together, and she can learn, with your support, to navigate the world - and I see no reason at all why, when she's ready, she can't continue modelling. In fact, she could be a great role model. Just as you can be one for others.\n\nI will say: get her into trauma therapy, when she's able, to help her work through the accident and the sudden taking away of her mobility. Doing this asap will help stop any issues becoming deep seated and harder to pry out.\n\nI wish you both the very, very best of everything. Please, if you can, keep us updated on how you're both doing, and if we can help at all. As I said I can't share the same experience of being paralysed, but I've been through a major road accident, and I'm generally always up for chatting - about serious stuff or anything at all. Sometimes it helps to talk to a stranger, or just have someone to talk to about random stuff, so my dms are open to either of you, anytime for (mostly) amateur therapy, or a distraction for a bit.",
            "Wife of a C6-7 quad here. Know that you can still have a happy life full of love and laughter, and you can still do most of the things you used to do together, you just need to learn how to adapt — in terms of figuring out what tools you’ll need to help her, but also how to adapt mentally, both your expectations and your perspective. \nShe will need support, but I want to add that you need support too. Self-care is critical for you so you can be there for her. Every relationship is different but what works for me is trying to focus on being a partner, not a caregiver. Think about what goals you both want to achieve and work towards them together. It will help you both feel fulfilled.",
            "It sounds like you really love and care about her. Just try to be there for her as much as possible. It may cause you some strain and inconvenience, but just remember how hard this is on her and how much she will need your help. Just try to make her life and normal as it can be now, and ease the burdens of what she may need in life now. Best wishes to you both and you guys hang in there. We are all wishing the best for you.",
            "So sorry to hear this, it's going to be rough for a long time. \n\nDo your best to be there, maybe read up on paraplegia and look up support groups.",
            "I've been in a chair for 24 years I was in a car wreck that left me paralyzed from t 11 t 12 at the age of 23.\n\nFirst thing is don't treat her any different then you used to don't baby her. Some tasks may take her more time then it used to but encourage her to try to do everything for herself.  You can assist but let her try.  Try to understand frustration, anger, and depression  are going to be serious emotions for awhile. \n\nSecond encourage her to talk to her rec. therapist at the hospital their are probably groups in your area that do things.  After my injury I was playing wheelchair basketball regularly I have played softball and sled hockey.  Getting around others also in chairs will give her friends to discuss stuff that is going on with her body that they may have answers to.  All activities you mentioned you did together can still be done in a wheelchair.  It just may require dome form of adaptation tk be able to perform itI have a friend that plays 18 holes of golf 2 or 3 times a week.\n\nMake sure she stays on top of doing her pressure lifts every 15 to 20 minutes it will help her to avoid getting pressure sores.  \n\nThis is going to be a very life changing time and you honestly need to decide if you are in for the long haul  or if you can handle everything because your life and especially hers is going to change from going to the bathroom,  cleaning, bathing, getting to places and your sex life. \n\nIf you or her would like to talk or have specific questions please feel free to message me and I'll be more then happy to help anyway I can.",
            "Also want to add that she may struggle as you both adjust to your new life and may need reassurance around the concept that you are there only because you love her and want to be there, and not because of any sort of guilt. I wouldn’t talk about it unless she brings it up, but always confidently reassure her that you’re there because you want to be. Not for any other reason. Say it like you know it in your heart and don’t think twice. If she asks about this, tell her that you’d leave if you weren’t happy and in love. Remind her that everyone has challenges throughout life, and while hers are significant (don’t downplay it) you will tackle it together. You’re in it for the long haul, as her condition isn’t a reflection of value differences in the relationship or anything that affects how well you two work together. That reassurance was and is huge for me with my partner. I have an unpredictable and tricky chronic illness that’s forced us to make some pretty big changes to our lives and his confident reassurance and love makes a big difference…as I often used to feel like a burden, inconvenience, or just like I was baggage for someone to deal with. I would also worry that he would eventually some day stay with me out of guilt if he was ever unhappy. Like “you can’t break up with the sick person”. But we’ve worked through that. Like others have said, therapy is vital. Your girlfriend may never struggle with these feelings, but it isn’t uncommon and is something I haven’t seen brought up yet.",
            "Love   her.  Realize  that  this is a big  life  changing  event  for  her and she is  gonna  need some   time  to  adjust.  I  suggest   getting  her some  form  of counseling  because  this  is  bound  to  be  traumatic.   Try  not  to  be  overly  helpful  or  over  sympathetic because she  won't want  to    feel  like  she's an  invalid.  Encourage  her   to  try and  do  things   for  herself, but  don't  push .  She's still  the  same  person she  was  before  and  she  should  be  treated  as  such.",
            "Not sure if anyone else has mentioned this but before you take her anywhere in a wheelchair (even just down a hospital hallway) please get someone to push you around in one for a few hours. It will really help you gain some perspectives. Being in a chair can initially be terrifying, not to mention having to negotiate different routes and plan things much differently. Watch out for curbs, corners, walls and doors in a new way. Also helps to understand how the wider community behaves around a wheelchair user.",
            "OMG, I'M SO SORRY FOR HER & YOU.\n\nTo be honest,  I don't think anyone is going to have a truthful answer to this.\n\nThere is a lot unsaid in this post. understanding. \nThe only thing I can offer e best is to follow your heart. #1, be honest to yourself, that's the most important. #2, be totally honest with her. Understand she will push you away, but you have to break that down, with your love & understanding. \nThen have the conversation. I know scary right. But what other choice do you have.\n\nGood luck, & I wish you & gf, all th",
            "I remembered your post and wanted to see if she had regained feeling. I'm so sorry she didn't.",
            "Seeing all these wholesome comments make me feel like an ass because I think either a lot of you are lying or really nice people. Me personally… I would break up to be honest. Too much to deal with and so young (I’m 24 also). I always tell my gf even If I ever get to a disabled or vegetable state I don’t expect her to be with me. \nYou’re a good person though for wanting to be there 👍🏻 hope she remains strong",
            "Omg this thread is so wholesome... nothing changes when som3thing happens except a mental lapse of pressure... you love your love and she needs your love. Be there, be fair, and just stroke the poor girls hair and tell her you love her, got damn it couldve been so much different, I have no awards but please enjoy what time you spend together, it's unusual compared to ur \"normal\" time spent together but really, all it is is she has a cool chair now and she needs a bit more attention, nothing new ay aha.. \n\nBut seriously, you have to be her rock, you don't need to punch someone who looks at her, you don't need to learn anything new, just nourish what you already know is in her that she feels she has lost, when in all truth, she has only gained. \n\nYes a terrible accident \n\nBut also the greatest gift \n\nA second chance. \n\nNow, go watch squid game, stroke her hair for half an hour, run her a bath, Help her in and out, passionately, get her a drink, kindly. Talk to her humanly. \n\nI'm crying because I miss my girlfriend man\n\nJust love her dude.",
            "Just be there hour by hour and let her feel all the rollercoaster of stuff. The first few weeks aren’t the time to look long term. After that, be involved in her physical healing and don’t sugarcoat things. Be her soundboard when she needs and stay communicative",
            "News like this may offer some hope:\n\nhttps://www.reddit.com/r/science/comments/smns3m/scientists_make_paralyzed_mice_walk_again_by/\n\nhttps://www.newscientist.com/article/2297272-paralysed-mice-walk-again-after-gel-is-injected-into-spinal-cord/\n\nhttps://www.reddit.com/r/HumansBeingBros/comments/smvzw5/paralyzed_man_walks_again_after_a_team_of_swiss/",
            "Updates? I'm curious"
        ]
    }
]