[
    {
        "post_id": "4ilwx7",
        "author": "Momsfuneral",
        "title": "Update post:My (26/f) mom died a couple days ago. My boyfriend (31/m) is refusing to go to the funeral or let my daughter go with me because it's religious.",
        "url": "https://www.reddit.com/r/relationships/comments/4ilwx7/update_postmy_26f_mom_died_a_couple_days_ago_my/",
        "score": 2517,
        "num_comments": 337,
        "created_utc": 1462830194.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/4hw45v/my_26f_mom_died_a_couple_days_ago_my_boyfriend/\n\nThanks everyone that sent me condolences about my mom. It's been really hard these past several days but I've been hanging in there okay. \n\nI tried being reasonable to John about he wanted to handle things...I even told him like one poster here suggested that he didn't have to go to the service, but could wait in the lobby with my daughter while the service was on going, then she could spend time with my family after the service, but he again, shot it down. He would be able to hear the service and that was \"a violation of his beliefs and asking to compromise on those beliefs was unconscionable and unfair to our daughter\". \n\nI told him I had had it. This is the icing on a very large cake. I told John that as of this week, I wanted our bank account separated (he made us join accounts to make sure we split everything equally to be fair despite ME making more) and that I'd be staying with my brother after the funeral while we figured out what to do wether that was a total breakup or counseling. It was up to him. He said counseling was for \"the weak minded\" and that we were staying together despite my \"empty threats\" and there was no way in fuck he was letting me take his money. He became very loud and in my face during this conversation so I just let him throw his tantrum until he took my silence as agreement.  \n\nI took my daughter with me to the viewing with no problems. John and I barely spoke that day, which was fine by me. But it hit the fan the next day....when I got up in the morning to get myself ready and get my daughter ready, I discovered that he had the motherfucking gall to PARK HIS CAR DIRECTLY BEHIND MINE, blocking me into the driveway.  I had no way to get to the funeral in my own car. John ALWAYS drives to work, but for reasons I can only image were to get back at me, decided to take the metro, and took the baby carriage and bottles, and my pump with him. \n\nMy brother and I have our differences, granted, in fact we haven't talked much since my mom and I were estranged (we started talking again after she was sick), but he'll forever be a saint to me for what he did. I called him crying, and he and my sister in law arrived within 20 minutes. SIL calmed me down and helped me get my daughter ready, and they brought along spare bottles, a carrier, and a breast pump. Thanks to them I was able to go my mom's funeral in comfort, and my daughter was an angel during the service. They calmed me down and everything went perfectly, and even though I was a mess most of the day, having my daughter with me, and my SIL and even my brother with me to lean on gave me peace on the inside. \n\nI've made up my mind not to tolerate John's insane and controlling behavior anymore. He had a litany of excuses for doing what he did (he even tried to claim his car had problems) and I don't want to hear any of them. I never wanted to be a single mom...I always wanted to raise my baby within a family. But I've decided that going alone is so much better than doing it with this man, who thought nothing of trying to kick me while I was down. My brother's arranged for me to talk to a friend of his that specializes in family law this week, and we're taking it from there. \n\nI still feel so guilty for what happened with my mom...I miss her so much. I hope from here on out I can make her proud of me, despite my mistakes.\n\n   \n**tl;dr**: Boyfriend flew off the deep end and tried to block me into my driveway to stop me from going to my mom's funeral with my daughter. My brother and SIL came to the rescue. We're now seperated and I intend to move forward on my own. ",
        "permalink": "/r/relationships/comments/4ilwx7/update_postmy_26f_mom_died_a_couple_days_ago_my/",
        "comments": [
            "Please make sure you get the finances squared away so he doesn't end up keeping your money that's in your joint account.",
            "What a fucking jackass. I had a feeling when I read your first post that this would end in breakup, but I hadn't thought that he was so much of a jackass as to deny a baby food (bottle feeding where breastfeeding is not appropriate) and shelter (carriage to keep her out of the sun and wind). That's fucking criminal and you could use it against him in your custody case, especially of your brother and SIL are willing to testify that they had to bring you supplies.",
            "Wow. Maybe instead of separating accounts you can take your name off of it after withdrawing half and start a new account. So it won't be a while not her battle. Condolences on your loss ",
            "I am so sorry you are going through this right now and I'm so glad you have the support of a family behind you. Your daughter is far better off without someone like this as a role model for what she should look for in life and I'm glad you're getting out of this situation. \n\nI would call the bank and see what you can do about the joint account before he tries something like cleaning it out and putting it somewhere else as well. \n\nI'm so sorry and I wish you all the best",
            "I just read your first post and this post. First off. I'm sorry for the loss of your mother. Secondly. I am glad you are rid of that man. He's as toxic as they come. And thirdly, I'm glad you have a supporting family who came through for you. \n\nAnyways. Your ex sounds down right horrible. In your first post you said he called your mother a cunt and said she deserved it. I would have left he then and there, no one talks like that about family, not even if you have differences with said family, especially if they have passed away. Any amazing qualities he had were all a charade and he showed you his true self. I'm proud of the fact that you realized that even though your daughter may not know her father, she is going to be better off. Take care of yourself and your daughter OP. ",
            "When the courts are informed of his behavior, you are going to get everything you want.",
            "If there is a custody battle, make sure to tell the judge that you are concerned having your child live with a religious extremist....... Even though he is an atheist, that is exactly what he is. Plus, it will infuriate him. \n\nSorry about your mom. \n\n*hugs*",
            "Please do the fiances now. This guy will empty the accounts behind your back. Also double check your credit to make sure he hasn't opened any lines in your name or that you're not on the hook for any debts you don't know about.\n\nFor your next guy look into a person that doesn't belittle you or browbeat you into decisions that are unfair to you.",
            ">I always wanted to raise my baby within a family.\n\nYou have a family in your siblings. John is just dead weight.",
            "If he had car trouble why would he then take your baby carriage and bottles/pumps on the metro to work? Did he try to explain that part?\n\n",
            "For future reference, I wouldn't recommend mixing your finances and bank accounts with a boyfriend you've been with for 1.5 years. ",
            ">John ALWAYS drives to work, but for reasons I can only image were to get back at me, decided to take the metro, and took the baby carriage and bottles, and my pump with him.\n\nALL of his behavior is beyond awful, but HIJACKING A BREASTPUMP? \n\nWhat a loathsome toad.\n\nGet your more-than-half of the money in the joint account out now and honestly I'd be filing for an emergency custody order too...until the courts establish legal custody, he can take off with your child at any time and be perfectly within his rights to do so.",
            "There's a lot of good advice here and I'm sure you're going to take direction from the attorney.  So all I came on here to say was, your Mom is soooo proud of you right now.  Speaking as a mother myself, there is nothing more that she wants than to see you happy.  This road to separation will be hard, but you will get through it with love and support from your family and friends.  \n\nBe the woman you want your daughter to be.  Be strong, be brave, and most of all, be loving to those that deserve it.  She will grow up admiring you, so make sure you always bring your best.  The two of you deserve happiness.  You will find it with each other.  ",
            "Next time he tries to block in your car, have his car towed.\n\nSeparate your money immediately.  Move any valuables of yours into storage until things are settled.  Do without a tv (if it's yours) for a while, etc.  Just get your valuables--and anything with sentimental value--out of there so it doesn't \"go missing\" or \"accidentally\" gets broken.",
            "Lawyer up immediately and ask them how to handle your bank/assett situation and act quickly. I know this is the absolute worst emotional time to think about such things that are tedious and infuriating at the best of times but your husband has shown that he will bulldoze you if given the opportunity. He will take advantage of your emotional state without a second thought and without remorse. You probably can't get ahead of him but do your best to make sure you don't get run over by him.",
            "If he claimed he had car trouble I'd love to hear his excuse for taking the baby carriage and breast pump with him on the metro.",
            "Take screenshots of all the bank accounts and any other joint accounts, immediately.",
            "Better you be a single mom than deal with this asshole. He's just trying to control you, that's it. No sane person would keep their GF from her mom's funeral. ",
            "Keep a record of EVERYTHING. Screenshot texts. Save emails. If you can record conversations you have with him. My ex wasn't as bad as this, but we did go to court for my son. He, my ex, didn't even WANT to be a part of my sons life, he just wanted control, wanted to win. I won because I kept my cool, logged EVERYTHING, screenshot every text he ever sent me, and after many failed attempts at trying to peacefully talk (he would always scream and say he didn't want to hear what I had to say, start gaslighting me on EVERYTHING, tell me how worthless and horrible I was) I started doing most of our communication via email. That way it was easier to avoid a he said, she said. I had proof. \n\nGet a lawyer (I reread and see that you are doing that) and be proactive. Serve him papers first. That gives you the upper hand. My ex served me first and it was a uphill battle (until he was caught in lies thanks to my proof). NEVER post anything bad about your ex, or your situation on facebook. Ever. It will be used against you. No matter how much it sucks avoid talking bad about him (except to your closest friends) because that will also be used against you. I've no doubt your dude, if he is anything like mine was, will make this nasty and tell lies. You can win with your truth. \n\nMy lawyer told me, \"Meggasaurus, the difference between him and you is he has a case based on lies. You have a case based on truth. If you keep telling the truth eventually he is going to get caught in his lie.\" And he did.\n\nAlways be 100% honest with your lawyer, even if it makes you look bad. We all have weak moments of being a crappy person, especially when we reach our breaking point with crazy dudes. Let your lawyer know the time you freaked out at him. It probably isn't as bad as you think, but they need to know because your ex's lawyer will DEFFINITELY know about it and will play it up. Your lawyer doesn't need any surprises.\n\nI've no doubt you will be okay and have custody of your little one. I just wish someone had given me all of the advice I gave you. When everything went down it was terrifying. Stay calm. You have a better case. You got this. Don't give in when your ex taunts you. He will probably try harder once you get this ball rolling because he WANTS to make you look unstable, and he will try his hardest. Resist his crap. \n\nGood luck love. You got this.",
            "Even if there isn't a hell, John's shitty behavior is going to come back and bite him in the ass.\n\nI'm so sorry the person who was supposed to support you behaved like this. But you did good by getting out. I'm glad your brother's friend will help you, because it sounds like this asshole is going to fight you tooth and nail over everything. Good luck.",
            "He tried to use your MOTHERS FUNERAL as a bargaining chip in some petty squabble?? What the actual fuck. ",
            "If you haven't done so already, document all his shitty actions. The screaming, the refusal to go to counselling, and especially him taking your daughters bottles and pump.\n\nHe's a terrible person. You don't want your daughter growing up in a house with a man who will sink to such cruel and underhanded means to get his way.",
            "That's straight up abusive behavior.\n\nSo sorry that happened to you. Glad you are separated now. I also lost my mom recently, and it is very hard, my deepest condolences.",
            "> He said counseling was for \"the weak minded\" and that we were staying together despite my \"empty threats\" and there was no way in fuck he was letting me take his money. He became very loud and in my face during this conversation so I just let him throw his tantrum until he took my silence as agreement. \n>\n>I discovered that he had the motherfucking gall to PARK HIS CAR DIRECTLY BEHIND MINE, blocking me into the driveway. I had no way to get to the funeral in my own car. John ALWAYS drives to work, but for reasons I can only image were to get back at me, decided to take the metro, and took the baby carriage and bottles, and my pump with him. \n\nOh my god.  This guy is a total ass!",
            "We are proud of you for making the decision to stand on your own and take care of your baby girl. This guy was a fucking asshole to you when he should have been supporting you during your time of grief; when a death occurs it's not the time to take an obnoxiously religious or anti-religious stance. Good for you for ending things, you deserve better. ",
            "Some people are telling you to take half of the money out of the joint account, well I'm here to say not to take half.\n\nYou take the percentage out of the account that you earned compared to him. (ie. if you make 70% of the income you take out 70%)\n\nOnce you squared that away you take out half of the remaining amount because that amount is needed for your daughter. \n\nCall it a stupid tax if you want to. ",
            "Oh my god OP, you should've separated the accounts before telling him!  He has had plenty of time to drain the accounts by now.  And he sounds like a piece of work so that's probably exactly what he did.  \n\nOn the bright side, it's just money, and you are way better off poorer and out of this guy's life than in it.  Don't ever look back.",
            "Had a sinking suspicion he'd be unreasonable about this...\n\nMake as clean a break as you can manage, OP. I'm terribly sorry he turned out to be such a disappointment as a human. Take care of yourself and your daughter, and hug your brother and SIL for stepping up.",
            "This guy sounds like the very same \"religious nuts\" he tried so hard to keep your daughter from.  What a controlling cry-baby.  This guy is toxic. You made the right decision.",
            "AHHH!!  You so did the right thing. I never comment in the sub but read it often.  I followed your original post and I am SO  glad you made the right choice to leave that scumbag. Staying true to your own religious beliefs is one thing but this was beyond that. Well done OP, well done. \n\nI am sorry for your loss but atleast he didnt ruin the little part of time you had towards the end.",
            "I just wanted to add about the bank accounts. Get a new bank and let them know you are going through a rough break up. Find a woman to open your new accounts, and tell her you are worried for your safety because he has all of your personal information. My ex had a new girlfriend to pretend to be me on the phone and cancelled all of my cards that he knew the security words for and my debit cards which I couldn't put security words on (I'm glad that bank got bought out).\n\nSo, yeah, for a few years I told everyone with important information that my soon to be ex husband had done some shady stuff and was not allowed access to me or my information. \n\nAnd be sure to get your legal affairs in order, because you do not want him in charge of your daughter's money if you die in a terrible auto crash. ",
            "Your brother and SIL are good people, and I am really happy they were there for you.  I'm glad you're kicking BF to the curb.",
            "Be sure to save any and all texts or voicemails or anything that verifies his insane behavior. It will help you.",
            "Im so glad you left that scum. Even as an atheist, I am horrified by the way he treated you, probably your mother, and your daughter. I mean, my god, he is pushing his own ways on your daughter more than anything. I cant imagine what he would do if she ever decided she wanted to be religious or ANYTHING remotely of the sort. \n\nI would carefully consider if you think it is a good idea for your daughter to stay in contact with him. He is just so controlling and manipulative....he strikes me as someone who would use your child against you, and get her involved with the break up. I dont know if he would be a healthy person for her to be around. He tried to keep her from her family (her grandmothers FUNERAL. Let that sink in!!) for his own selfish, unjustified, prideful, stupid reasons.",
            "Talk to a lawyer. ASAP. Sorting out the finances piece could be more difficult than you anticipate, and a lawyer can help with that. John also sounds like he's potentially abusive, and you may need the lawyers help in obtaining things like restraining orders if John pushes things too far. And there are lots of red flags that point to him being abusive, so expect him to lash out at you in one form or another.",
            "Dude gives atheism a bad name.\n",
            "Was so happy to see this update - I read the original and thought you were rationalizing his toxic behavior too much. Best of luck :)",
            "This guy is abusive. He's controlling and angry. He's even abusive towards the child. He would be this way regardless of his religion or lack thereof. It's his way or the highway. I'm an atheist and I go to funerals, weddings, even the occasional church service if I am invited. It hasn't turned me into a non-atheist. People need to be tolerant of each other.",
            "Bloody hell - from your OP I thought he was an asshole, now I think he's a controlling abusive asshole. As if he gets to decide whether you break up with him! \n\nYou had every right to take your daughter to her grandma's funeral, however religious - it's about saying goodbye to the person, and that's what she will remember. To try and stop you both going like that is so shitty, and kudos to your brother and his wife for the rescue.\n\nI hope you're safely away from John. Enjoy your new beginning! Even though i can't imagine the pain you must be going through with the loss of your mum.",
            ">took the baby carriage and bottles, and my pump with him.\n\nWhat a psychopath.  This is terrifying stuff.  I know you two aren't married, but I'd be finding a lawyer ASAP to protect myself as much as possible.  Start saving all communications between you two in case you need a restraining order and for the inevitable custody disputes.  This man is unhinged.",
            "Had he ever have any violent action? Punching a wall, etc?\nI think everyone here is underestimating the risk that this man can have violent reactions in the future.",
            "Get your financials in order please.  He has already shown how unreasonable he is.  Don't allow him to fuck with your livelihood.\n\nI am so sorry you and your daughter has had to endure his assholery.",
            "I'm as atheist as they come and your child's father is a monster. This has nothing to do with his beliefs and everything to do with him trying to control you. Get out, be safe, *do not let yourself or your child be alone with him if at all possible.*",
            "You did the right thing. After reading OP and this update, I know your ex is a douche, grade A type. No religious belief should come first to support and care for the people we love. I bet I am not the first person without religious beliefs who has gone to church plenty of times, because it made my parents, gf, and loved ones happy. Well, at least your mother managed to make you see this person for who he really is and separate him from being a nocive influence in your daughter's development.\nGood bless and peace\n\nEdit: spelling",
            "Wow,  OP I am SO sorry you have to go through this. I lost my mom at a young age (younger than you) and it was absolutely devastating, but I had a wonderful boyfriend at the time support me through it.\n\nI don't think you'll see my comment, but if you do,  Please make sure you grab all of your important documents from wherever you guys lived, and try to get proof of the money that does belong to you. Maybe go to your bank in person and talk to them about the situation. I just went through a horrible breakup and managed to have so much stolen from me and will eventually have to go to court to claim what is rightfully mine. Grab ss card, birth certificate, things like that. My identity has basically been compromised as well during this crap. \n\nYou are a strong woman! It takes a lot to pack your bags and leave with your daughter from a place you used to call home. Kudos to your brother and SIl being there for you. Your (now ex) boyfriend sounds like a total douchebag. ",
            "What a low, scummy, completely asinine thing to do because he didn't get his way. The mental gymnastics he took to think any of this behavior was acceptable or deserved is completely min boggling.  \n\nOp you did the right thing. It is only too bad your child has such a failure as a father, that trying to prove a point and be controlling means more to him than her needs.\n\nWithdraw your money, get a lawyer, and get all if your important things from home (even if that means having the police there to supervise). \n\nYour brother is wonderful,  I am sorry that you both lost your mom. I know you have your regrets, but you got something some people never get, which is to reconnect with your mom and say your I love yous and goodbyes. Even though you feel like you didn't have enough, there will never be enough time when it comes to the people you love. Your mom got to have you and her grandchild and the people she loves around her, which is a wonderful and special gift. I am sending you hugs while you grieve. ",
            "You married Satan, what the fuck is wrong with that guy? \n\nIm disguted. Im so sorry for what you have gone throu, please protect yourself and your daughter from this evil human being. ",
            "Document everything! Especially his controlling behaviour on the day of the funeral!",
            "File for custody of your daughter ASAP. Right now there is no custody agreement. Log everything he says and does. ",
            "Sorry for loss, you need to start fighting for full custody of your child. Your ex is a psycho and I think a judge will agree once you tell them what he has done.",
            "What a piece of shit. He's really making it an easy decision, isn't he? Go clean out that bank account before he does. ",
            "There's only a few posts around here that get me fired up, but this was one of them.  You (and your daughter) are  going to be soooo much better off, not just today and tomorrow (those are likely to be difficult truth be told), but for all the years you didn't waste with this douchebag.  \n\nMake sure to reach out to your resources during this transition, the people who will support you and help you to stay clear in your course (including your brother, so glad he's coming through for you).  I'm wishing you well!",
            "OP, get your own money into a separate account ASAP so John doesn't try to fuck you financially. This is some scary controlling shit.",
            "Counseling and therapy are for people who have a problem and want advice from someone who went to school to learn how to give people advice. That's it. It's just a neutral party giving you another perspective on things. I have no idea why people think it makes you weak to consult an expert when you have a problem. \"Calling an electrician is for the weak!\" is a one-way ticket to disaster, so too with therapists.\n\nSorry your SO is a complete toadstool of a person. ",
            "Your boyfriend is a controlling abusive jerk. The only reason he did any of this was to control and hurt you.\n\nI'm sorry you're going to be raising your daughter alone, but it's better than raising her under his thumb.",
            "Just wow! What a complete asshole! You're definitely better off without him and so is your daughter. Too bad it isn't possible to change his title on the birth certificate from \"Father\" to \"Sperm Donor\". That really should be an option.",
            "Holy crap I'm so sorry this happened to you. \nLook, regarding your comment about how you wanted to raise your baby in a \"family\"... I knew several teen moms when I was in high school - both of them were kicked out of their families. One of them was in foster care, the other moved in with her boyfriend- and I swear to you, their children were some of the happiest babies I have ever seen. Family doesnt just mean a nuclear unit- You don't need someone like your ex. Sometimes families arent really families and love is conditional. A real family should love and support each other, without any conditions. A real family doesnt try to control or hurt another. Do you get what I'm trying to say?? I hope it makes sense. You'll be ok, OP. Good luck!! I wish you happiness",
            "I don't know your relationship with your mom but on that day, you were a fucking strong woman and mother, and I will guess that that is what your mom would have wanted. You stood up for yourself and you and your daughter will be better for it. Continue being the awesome woman and mother you are and no doubt your mom would be proud of that. Hugs to you",
            "Single parenting is better than rocky relationships between the parents under the same roof. You seem like a strong woman who only wants what's best for your daughter, I think this will turn out much better than yoy imagine now. Good luck with the lawyers and such. And hugs again for your loss ",
            "Why are people so fucking shitty?",
            ">We're now seperated and I intend to move forward on my own.\n\ngood for you.",
            "What shocks me most about this situation is how insensitive to your feelings your boyfriend was after your mom passed away. This is the time that he should be there for you the most. It just feels so cold to me. What is wrong with this man? Does he not have any empathy for the woman he is supposed to love?\nI am so sorry for your loss. I think you are making the right decision. Very brave of you. ",
            "thank christ.... any person who acts that way over your mothers death is a complete piece of shit. ",
            "What a creep.  Sorry for your loss but congrats on getting rid of this sack of shit",
            "I'm late to this but you're doing the right thing. I've no respect for religion but I'd respect my partner's wishes. You are way way way better off without that guy. ",
            "He's a real piece of shit. I hope you find some peace and happiness with your way ahead. ",
            "Stay away from him. He's spiteful.",
            "You are so strong and brave. I applaud you for what you are doing for your daughter and yourself.",
            "Oh, thank God--this is the update I was waiting for. I'm so glad you made the right decision to leave this prick. I didn't think he could piss me off more, but he managed to selfishly use your daughter's well being as a pawn to try and ruin your decision to go to the funeral. You and your daughter are *much* better off without that kind of negativity and control in your life. Wishing you a smooth transition and peace in your mother's passing <3",
            "Get the hell out of there.\nYour (hopefully ex) is human garbage.",
            "You are so strong. Your daughter will thank you one day.",
            "Wow, this guy is fucking nuts. Good job on deciding to get away, because that would be a poisonous environment for your daughter to grow up in. She would think it's okay for men to treat women like shit.",
            "What an asshole. Even if you don't agree with other people's beliefs there is something called tact and class which he has none. ",
            "But I've decided that going alone is so much better than doing it with this man, who thought nothing of trying to kick me while I was down.\n\nOp-this is the truest statement you have ever made.\n\nYou rock-and this alone shows that you are a fabulous mother.\n\nYour mom would be very proud of you.  Your daughter will grow up surrounded by love and good role models.\n\nGive your bro and SIL a hug from all of us.  Stay strong!",
            "First of all, of course condolences to you and your family. But holy shit hunny I am so glad you are moving forward on your own and I'm so sorry for the way you were treated by John.  I am pretty sure you feel betrayed by his lack of support as well.  At times like these, you already know that all BS should be put to the side I haven't even read these comments but I am positive that almost all of us here have been confronted with a funeral where we had to say to ourselves,  \"we're not of the same faith (or lack there of) but ya know what? its a funeral so I'm not bothered by it.  Ill go to show respect.\".\n\nIts actually not even something we have to remind ourselves of. We just go.  The fact that he is supposed to be your number one supporter, not just right now but in all aspects of your life together...shows his true character.  In a way, be thankful that you were able to see this from him now and not down the line when your daughter is old enough to witness and understand his manipulations. ",
            "> I always wanted to raise my baby within a family.\n\n\nYou are a family, together. Good luck.",
            "What a lunatic. That doesn't even have anything to do with atheism - he's actively persecuting religion. He's the lunatic fundamentalist and he has no clue... Aside from that he's a controlling fucktard with zero compassion or empathy so make sure you're on top of getting clear of him financially, because being able to finance a lawyer is going to be important.",
            "This guy is a huge POS, please leave this maniac. Who parks someone in so they can't drive to go to their own mother's funeral? All because he is athiest/agnostic? This dude sounds insanely stubborn. I am pissed off for you OP. Please, please leave this dude.",
            "I'm so sorry about your mom but I'm glad to hear this update.  Please keep this account and update us in a few months if you can remember!  This is one wild ride you're on.",
            "Wow.\n\nJust a huge big wow.\n\nJohn is a sociopath. Getting rid of him will be amazing. ",
            "He may take all your money from your joint account. You need a new account and to move your money yesterday.",
            "Um, I'm an atheist, and that refusing to go into a church thing is the biggest load of crap. And refusing to let your daughter go to church thing is just stupid. Your both the parents, he's not any more entitled to raise the kid than you are. \n\nAnd I'm a little confused as to why he's worried about where to take your baby, I mean, she's not going to start believing in god by osmosis when she's not even eating solids yet. (Or I assume because you said that you had a pump and bottles)\n\nAnd I'm very concerned that your husband cared more about making a point and stopping you from leaving than making sure that your daughter could eat. \n\nEDIT: Your husbands a dick. I forgot to include that.",
            "I'm so sorry.  How unimaginably horrible.  ",
            "I mean, being a single mom isn't easy but your child is INFINITELY better off without that jackass raising her.   ",
            "Wow what an asshole. I know it might get difficult while you adjust to not being with him anymore, so please keep these comments so you can go back and remind yourself...good riddance! I wish you and your little girl all the best OP.",
            "What an abusive shitheel.  I'm glad you're takimg steps to get away from him.",
            "What the fuck... how can someone be so spiteful, damn. I really feel for you.",
            "I think you're absolutely making the right decision. You will have some hard times ahead, but I believe it'll be much MUCH easier than staying with that man. He's the kind of man that starts out seeming ok but ends up being an abuser.",
            "He's disgusting.  That's insanely horrific behavior.  I cannot even fathom how some people can act the way they do.\n\nMake sure that man is as far away from you as humanly possible, and try your damndest to limit his contact with your daughter.",
            "Good for you.\n\n> But I've decided that going alone is so much better than doing it with this man\n\nBeing alone is easier by far than being with someone who keeps acting to make things harder.",
            "Please take your money out of the joint account immediately and get a lawyer so that you can apply for custody and child support. ",
            "My mom was terrified of being a single mom and din't leave my dad until I was 7 but she should have left much sooner. As much as  I hate my dad and growing up in a \"broken home\" I have never once, not under any alcohol induced or anger induced state, claimed that I would have been better had she not divorced him. For her sake mentally, I wish she had divorced him sooner when I was a baby instead of waiting.\n\nBest of luck. You'll be a great mom. He may tell you that you won't be able to do it alone, but don't listen to him. You can and will do it just like my mom did.",
            "This reminds me of the guy who tried to physically force his vegetarian girlfriend to eat chicken. Its a controlling possessive asshole, who probably just first mentioned he didn't want to go to the funeral as an off the cuff remark, but then your response indicated that you weren't overly concerned about his opinion (big issue for controlling possessive assholes) and fixated on it. Probably by the end of it he viewed you going to the funeral as the ultimate sign of disobedience and he had to stop that at any cost.",
            "This man stole your breast pump? He would rather your daughter go hungry than allow her to attend the funeral? That's honestly abusive. I'm glad you're getting out. He is an absolute piece of shit.",
            ">But I've decided that going alone is so much better than doing it with this man\n\nYes, this is it. It's hard to believe that this guy really did what he did. He is absolutely selfish, inconsiderate, and actually I somehow feel sorry for him being so helpless that he can't think of any way to take reasonable control over his actions. You are waaay ahead of him. He is no partner for you because he is no equal of you. Your daughter also is better off with you than him. Stay as strong and clear about who you are as you have just proven to be. All the best for you and your child. (Sorry for mistakes, i am no native speaker) ",
            "Holy shit...I mean if you wanna be an atheist ok, but what a motherfucking piece of shit!!\n\nTake it from someone who grew up with parents that went through a rough divorce....yes, having single parents can be tough, but the benefits of leaving this sorry excuse of a human being will FARRRRR outweigh the drawbacks, both for you and, more importantly, your daughter!\n\nMy sincere condolences for your loss. ",
            "I am so sorry for your loss OP. Your boyfriend sounded like a huge dick. Good thing you are leaving him.",
            "What the actual fuck is wrong with him? How fucking hard is it to compromise to make nice with family? I'm not Christian, and I'm not a big fan of Christian ceremonies (or doctrine), but I still go to funerals and weddings, and even baptisms to maintain a good relationship with my family and support them through important life events.\n\nGet your shit split and get out of there. You'll be so much better off.",
            "Fuck this asshole. Counseling is not for the weak minded, and honestly he seems like he needs it himself. ",
            "If this sub had an arsehole of the year award, John would be a strong contender. Sheesh.",
            "I see plenty of people advising in legal and financial things, and thats inportant, but whats also important is grieving. Make sure you find time to process that. And dont worry about being a single mom. As someone who grew up with one I can confirm that your kid will turn out fine.",
            "Who in the FUCK does that?? What a juvenile, controlling POS that guy is...your MOTHER'S FUNERAL??  Huge deal-breaker for I'd imagine just about anyone. ",
            "I am so sorry you are having to deal with this man's absolutely INSANE behavior while you should only be focusing on the devastating loss you've just experienced. ",
            "take out your share of the money, people here are advising half, take out the percentage you earn compared to his percentage i.e. 60/40\n\ndo this NOW\n\nyou have NO PROTECTION and NO RECOURSE if he goes and empties the bank account tomorrow, since you are both named to the account",
            "I am so so so so sorry for your loss. I lost my mother just after Christmas last year. We were estranged. It is a very long story. I had not spoken to her since June last year. I am so glad you were able to make it to her funeral. ",
            "Good for you. I'm happy you made a decision for yourself and your baby girl. I sincerely hope that it will all work in your favour and you two will be happy and healthy together!",
            "he tips his fedora ",
            "I just want to say: your mom would be so proud of you. Best of luck.",
            "He sounds like a legitimate psychopath. Congrats on getting out of it, I hope you can grieve the way you should x. ",
            "OMG.\n\nI know you've gotten hundreds of comments already, but holy shit.\n\nI just want to give you some empathy.\n\nMy mother was a Jehovah's Witness and that was the religion I was raised in. I hated it and as soon as I was old enough to escape I did. We had a very rocky relationship because I didn't believe the same things she did and that was hard for her. Things got better as I got older (moving across the country helped too) and eventually we got to a decent point. \n\nBecause of my history with religion, I made it a point to only date atheists and agnostics. When my mom first got sick a few years ago, I had been dating my husband for only a few months. She died almost exactly a year later, three weeks to the day after our wedding. I knew that she would want to have her the service held at their place of worship, so I arranged it, even though I hadn't stepped foot into one of those places in over a decade. \n\nMy husband and I are both extremely anti religion. And he's even more abrasive and aggressive about those feelings than I am. But he didn't act like an asshole. He sat with me and gave me the support I needed to get through that extremely difficult time.\n\nI said all that to say that you deserved so much more than you got. I'm so sorry for your loss. I hope you can summon the strength to separate from someone who is behaving in such a toxic manner to you.\n\nPS I would have mangled his face for taking all the baby stuff on top of the blocking you in. (I have an 11 month old daughter - I genuinely feel your pain on the shit he pulled with that too!)\n\nInternet Hugs",
            "Your partner is a psychopath, you're right for getting the hell out of there. Make you fall out with your mom in the first place then act the way he did... That is insane. Don't hesitate to tell people why the relationship ended if they ask. ",
            "Oh my, what an asshole of a 'husband'\n ",
            "What an abusive shithead. I'm glad you're getting out of there, and that you and your daughter are safe.",
            "I'm so sorry about the loss of your mother. It is so difficult to go through. Anyone in your life that tries to make a time like this about them and their needs is a selfish, self-centered narcissistic asshole and you are smart to remove him from your life. But, I think in some way by behaving like he did, he actually did you a favor: He showed you exactly what he's capable of and removed any doubt from your mind that you are doing the right thing. Best of luck to you moving forward and hugs.",
            "God, the atheists in this sub give the community such a bad wrap. It makes me so sad. We're not all like that, I promise! \nSorry about your mom, op.",
            "I know you're grieving and you regret the decisions you made in regards to your mom, but it sounds like she really loved you and I bet she would be happy to know that in the end you got away from someone she must've realized was bad news.  We all make mistakes, but not all of us learn from them.",
            "Don't worry. I know you wish you hadn't fought with her but neither she nor you knew what was coming and you were both happy in the end. \n\nAnd she would probably be pretty happy with you leaving your ex now and feeling that her funeral helped!",
            "I'm sorry for your loss and glad you've found some peace with your daughter and brother/SIL.\n\nI too was estranged from my father. I never made amends before he died. Had I known he was going to die, I would've reached out. However, I didn't. I can't change that and I accept it. And I also realise it wasn't time to reconnect. \n\nYour mom reached out to you and you reconnected, were able to reestablish your relationship and make peace with each other before she passed. ",
            "Please try to get full custody. I'm an atheist, but that's no excuse to be a controlling, manipulative dick-wad and his being an atheist has nothing to do with his horrible behavior. He's just a rotten person. Get a custody agreement written asap since I could see him resisting to give her back to you. I'm sorry about your mom :(  her death likely brought your relationship with your bf to light sooner than later saving you and daughter who knows how much time free from him, maybe even years. If you want to look for the good in the situation.",
            "I'm sorry to see you go through this. Your husband is an asshole. None of this is a \"violation of his beliefs.\" If he was a Jew or something I'd be more understanding that he didn't want to be in a church because it would be a legit conflict to his belief system, but an atheist believes religion is idle superstion, empty and powerless, not something to be feared or avoided.\n\nYou said it yourself, but this is about controlling you, not personal principle. He doesn't care about how you feel, it's all about making you do what he wants. \n\nCongrats on taking the steps you need to in order to move on. I'm sure in time you will find a supportive partner to raise your daughter with. ",
            "I'm sure you know this already but your ex-boyfriend is a really shitty atheist.  The whole point IMO of cultural atheism is to live free of oppression - and it sounds like all he did was oppress you.  \n\nHe sounds like a real off-kilter bastard and on behalf of sane atheists everywhere, apologies to what he put you through at a difficult time.  \n\n",
            "Wow what a piece of shit.",
            "You're man is a piece of shit. Good riddance. Religion or not don't ever disrespect someone to the extent they can't even say farewell properly to family. ",
            "> I've made up my mind not to tolerate John's insane and controlling behavior anymore. \n\nI am so glad to hear this. Don't back-slide on this decision. He basically tried to lock you into the house in order to control you.\n\nThis is beyond bad already. It will only get worse.",
            "I'm glad that you're separating from this guy OP. It will be hard, but you should remember that you do have family--in your Brother & Sister-in-Law. ",
            "fuck him, hes a piece of shit.\n\nget a new bank account at a different bank.\n\nstart putting the money into that account\n\nhire lawyer to figure out next move.  stay civil as possible, dont let emotion to bleed over onto your child.  try to discontinue arguing in front of her",
            "Getting rid of this douche ASAP still isn't quick enough. How can anyone be so insensitive, controlling, and downright manipulative during such an emotional time? He deserves to lose you OP. Talk about a piece of shit. ",
            "So what exactly caused the falling out with your brother? He obviously still cares about you so depending on the circumstances it might be beneficial for you both to rekindle you relationship as siblings.",
            "It was fairly evident from your last post that he was a very unreasonable person. Sucks you had to go through this now on top of your mom passing, but at least you can cut this toxic guy out of your life. ",
            "OP, on behalf of Atheists I just want to say \"Fuck this guy\"\n\nGood riddance.",
            "Y'know, I understand people not liking religion and religious people. I was raised religious, and there are certain practices that I can't quite understand, or even find flat out stupid. However, that's not an excuse to do this. Not at all. Religious people may be bad, sure, but atheists that do this are way worse IMO.",
            "Have you talked to him about getting counselling, his behaviour is irrational? Is it possible he was abused?\n\n"
        ]
    },
    {
        "post_id": "7ithzl",
        "author": "None",
        "title": "[UPDATE] Me [23F] with my friend [23F], she cheated on her boyfriend/my friend [25M] and doesn't want to come clean",
        "url": "https://www.reddit.com/r/relationships/comments/7ithzl/update_me_23f_with_my_friend_23f_she_cheated_on/",
        "score": 2514,
        "num_comments": 216,
        "created_utc": 1512906157.0,
        "selftext": "I decided to post an update even though the OP didn't get too much attention. Can be found [here](https://www.reddit.com/r/relationships/comments/6bfrr9/me_23f_with_my_friend_23f_she_cheated_on_her/).\n\nThe TL;DR of the OP is basically this: My friend Sarah cheated on her boyfriend James, who happens to be my friend, too. She didn't want to tell him because he'd likely end the relationship and they had a big trip planned. I didn't know if I should tell him (my gut told me yes, definitely) or stay out of it.\n\nAfter I posted here Sarah decided to tell James parts of the truth and told me to stay out of it. I decided not to do that since he deserved the whole truth. \n\nI wanted to tell him in person but he couldn't meet up because he was at a family gathering or something like it, I don't remember. He called and asked me what I wanted to meet up for and I told him the whole truth. That she cheated on him with her best friend, that she didn't tell him everything that happened, etc. I was worried she got to him somehow and that he wouldn't believe me, but he thankfully did. I still send him every text I had of her, which was probably incredibly helpful. \n\nWhile I was talking to him she sorta knew what was happening and drove over to his place immediately. When she got there he hung up and they talked. She tried to weasel her way out of it but since he had her texts that didn't work out too well. \n\nBefore she came over he told me this was the last straw, especially since she lied to him about it and made out with said friend once before. I don't know what she did or what she said, but he did a complete 180 and suddenly he was okay with it. \n\nI've only talked to him twice since then and he told me that it's not such a big deal and they'd get over it.\n\nThey've completely cut me out of their lives, when I asked him why he said he wanted to wait until his girlfriend and I had a talk and could get along again - which isn't happening, since I don't want to be friends with her anymore. \n\nIt sucks that I've lost my two best friends even though I wasn't even the one who fucked up, but at least I can sleep normally again. \n\nTL;DR: I told my friend, he wanted to break up with her, she talked him into staying and they've cut me out of their lives. ",
        "permalink": "/r/relationships/comments/7ithzl/update_me_23f_with_my_friend_23f_she_cheated_on/",
        "comments": [
            "[deleted]",
            "There's a saying in my language that a stupid friend is far more dangerous than an intelligent enemy.",
            "It is a good thing   they cut you out , you do not  need  them in your life. You should consider this outcome as a positive one.  ",
            "This happened to me once. I told my close friend that I had known since elementary school that his girlfriend was cheating on him with my other friends, cousin. \n\nI had all the proof (texts, screenshots, pictures, everything). I cried in front of him because I felt so bad doing this to him. I wanted him to get away. \n\nShe found out it was me, things got really bad (she tried to have me hit her with my car. She was crazy). \nHe ended up forgiving her (again, she cheated multiple times). He blocked me on everything. I was devastated.\n\n2 years later, I got a Facebook friend request from him. I accepted. He then messaged me on there and said, \"I'm sorry for how big of a douchebag I was when I was under the spell of a succubus.\" I was wary because I had heard this all before. He then told me all the changes he made and how he was moving hours away to get away from her. Starting over. \n\nHe has kept his word. He is happy and away from her and it's been years now. I have my friend back and it's the best feeling ever. He may live further away from me now but he's happy and that's all that matters. \n\nI honestly thought, at the time, we would never be friends again. This girl had him under her thumb and he believe everything she told him (like that a good guy friend just bought her a car because they were \"friends\". Yea, no. Her kitty bought that car bro).\n\nHe was in an abusive relationship. Your friend, is in an abusive relationship. Keep that in mind. There may be a day he comes back, maybe for help getting out, maybe to tell you he got away. Either way, while it hurts now, he is someone that is broken. Don't push him away if he tries comes back. \n\nThat succubus has a tight grip. They may wiggle free someday. ",
            "He'll believe how big of a deal this is once he catches an STD or she gets pregnant with another man's baby. \nYou've done all that you can/should. He will one day see her for what she is.\nAs for you, you can move in knowing you did the right thing. \nNow go find some new friends who aren't stupid",
            "This is what usually happens when you get in the middle of relationship drama - the two dramatic parties turn on you, assigning you the role of home wrecker.",
            "The outcome sucks, no matter which way it ended. You absolutely did do the right thing by telling him. When she cheats again and doesn’t change, he will have no illusions because he knows who he is dating: a cheater and a liar. And she doesn’t want to talk to you again because she knows you will call out her bullshit, so you are a liability to her ability to cheat.\n\nYou did good, girl. They can be disfunctional together. When it happens again, I bet you he will contact you and say you were right and try to restart the friendship, but you can cross that bridge when it happens.",
            "Jesus, they both have some personal issues to work through...poor James...I’m sorry you lost your friends, but you have kept your integrity and that’s all that matters. And be proud that you did the right thing, it shows that you’re a really good friend and worthy of many friendships to come :)",
            "Don't worry she'll do it again. And again. And again.\n\nPlus she's shown herself to be a selfish, manipulative liar. And that's not someone you want to be friends with. ",
            "I bet she told him you made all this up, that you’re in love with him and hate her. Or she’s super hot and he figures it’s worth it. Whatever. I’m sorry you lost them both. He may come back when she keeps cheating and lying. ",
            "More people need friends like you :)",
            "You chose to burn one out of two bridges. You chose to defend the one who was hurt, which is really the right thing to do ethically. He chose to burn a bridge that was perfectly fine in favor of allowing her to keep hurting him.\n\nYou did good. Be glad they cut you out of their lives, because this would not have been the last time he did something absolutely insanely stupid.",
            "She probably told an even bigger lie to get out of it. Like that you love 25M and you are trying to break them up so you can date him. Or maybe she said she was drunk and he took advantage of her. Who knows at this point what she can lie about without guilt.\n\n\nEven though you seem to have lost your friends you did the right thing. You have shown you are a decent human being by telling 25M about his gf cheating and have shown you are a true friend and a better person than most.\n\n\nI hope you find some great new friends to hang out with because from your actions you deserve to have great people around you.\n\n\n",
            "I was in a similar situation before. Don’t feel bad OP you did a good thing and it’s good you sleep better. Them getting out of your life is blessing having people like that is not good trust me. Knowing about her messing around obviously conflicts with your morality especially if you know the other party too. The plus side of having someone like the guy out of your life is also better because people like that really just set themselves up to get screwed over and their stress kind of does become your stress. I’m not saying all of this will happen but from my experience it most certainly does. Take this as a sign to be more selective of your friends it helps your mental state a lot more in the long run.",
            "It sucks that she is a cheating asshole and he is a dumb fuck but really you haven't lost anything worth having. You did the right thing. Walk away with your held held high and don't be there with a shoulder to cry on when she screws him over next time. You're a great friend and he doesn't deserve one. ",
            "You did the right thing. You gave him the necessary information and he had to make a choice. Unfortunately he chose he girlfriend over you. Out of your control at that point.  Certainly disappointing, but you have to know you did what you felt was the right thing. ",
            "Damn this guys is a doormat. ",
            "LOL yu did the right thing, sadly some people are stupid and blind.",
            "My sister had a friend who was cheated on. They broke up and my sister comforted by saying “the nicest piece of garbage in the can is still trash.” The couple got back together and cut my sister out. \n\n\nEmotions are complicated.",
            "You did all you can there’s nothing else to do.. I would’ve done the same if my best friend cheated on her boyfriend. It’s not right.. I’m sorry that you are going through that",
            "And this is why I advise people not to say anything if they’re too close to the situation. For one, the messenger almost always gets shot. And two, even when they believe you, they feel embarrassed about taking the cheater back that they slowly fade out. The only time this works is when the one being cheated on leaves. And that’s a 50-50 chance. ",
            "Don't worry she will slip up again like and he will feel like an idiot. ",
            "I mean I guess for some people cheating isn't as much of a deal breaker. Works out for you to get these toxic people out of your life though. ",
            "No good dead goes unpunished.  I'm sorry you are the one bearing the weight of this but if it is any consolation you have my respect. ",
            "Are you sure his name isn't Matt? It's pretty sad that you're more willing to stick up for him than he is. Makes you a great friend though.",
            "I found myself in a very similar situation many years ago.  What I found is that, for better or for worse, it never turns out well to get involved between two friends.  As you found out, there's a very big change that they make amends, and turn you into the bad guy.  You absolutely did the right thing morally, but just keep this in mind in the future.  Ultimately, everyone loses in this situation. ",
            "That's a crappy outcome. I'm proud of you OP. I hope you find some new friends who will appreciate your awesomeness!",
            "Been there before. Just know that you did the right thing. ",
            "You did the right thing. It's a shame that the old saying, no good deed goes unpunished, is so often true. I hope all my friends are like you.",
            "Look at it this way; After a few years when you meet your friend, you would not have to bow your head in shame knowing that you could have prevented a disaster from happening and didn't do anything.\n\nYou have a good heart and a clear conscience; now go and find some new friends to help you socialize and share secrets with.",
            "Eh, good riddance I say. You did the right thing.",
            "Complete b/s that you see people engaging in destructive behaviors, you say something, and then they have a problem with you, but that’s life.\n\nNever back away from doing what you think is right, you won’t like the person you see in the mirror later on for having not said anything.  There are good people in this world and you will find some of them to be friends with.",
            "You did the right thing. Unfortunately, sometimes the right thing just doesn't always seems like it at first. But think about if you were the person being cheated on; wouldn't you want to know? Wouldn't you want your friend to be looking out for you? Even if it didn't result in you ending the relationship, you would at least want to have that knowledge, right?\n\nThe result may have been less than ideal, but you couldn't have known that beforehand. And it doesn't change the fact that what you did was objectively the best option. You can only make the best decision based on the information you have, and that's what you did. Hopefully you can find yourself a better friend now, who won't put you in such a terrible and unfair position to begin with, as this one did.",
            "[deleted]",
            "Personally I don't really know if I would have gone that far. It's their relationship. A cheater is a cheater and it will come out eventually. Also, do you maybe have a thing for the guy? Maybe ask yourself what good it does and why you needed to tell him every detail. \n\nI value trust and honesty completely. But sometimes it's enough to just say, your gf told me some really personal things and I think you should talk. It sounds like you expected him to be really upset and break up with her. You shouldn't really place any expectations on the information because it's not your relationship. And you can't really expect them to be all buddy, buddy. People like to get angry at others when they make mistakes. She's going to get angry at you for talking to him. ",
            "Hey! You did the right thing. I’m sorry they both turned out to be phenomenally shitty. But now you have room for two new friends! ",
            "[removed]",
            "If they both know she cheated on him, and they're staying together, I can see the both of them being embarrassed about it in a way. Her because you know she did something wrong, and him because it makes him \"less manly\" or whatever to stick with a chick that cheated on him. Either way, I see that sort of embarrassment/shame being enough reason to stop talking to you. You didn't do anything wrong but sometimes people stop facing others when others know certain truths about them... It's not always easy to face up to that. \n\nNo real advice here. Life just sucks and it goes on :) Make new friends! ",
            "I know it is hard, but this is probably for the best. She is going to keep doing this because she knows she can now get away with it. Their relationship is just going to be come more and more toxic with time and you don't want to be in the middle of it. \n\nI would bet good money in a couple of years he is going to be calling back about how he left him for her best friend and how he should have broken things off.  ",
            "Let him know you'll be there for him when he hits rock bottom. Then let him/them live their lives. ",
            "I had this exact thing happen. Friend was cheating on his girlfriend while hanging out with me.  Not trying to be discreet at all. Hooking up with prostitutes and his ex girlfriend.  \n\nI was out for drinks with his gf one night and told her everything... I just couldn't sit there while she told me how in love with him she was and how great he was know that he was lying and cheating and she had no idea. She thanked me and later that night I got a text from the bf pissed that I told on him.   Then she and he cut both me off and dated for another year after that.\n\nNothing you can really do but know you did the right thing. At that point they've made their choices and you just have to walk away.\n\nIt's a bummer though. Sorry you have to go through it too.",
            "You did the right thinh",
            "You did the right thing, your friend is dumb",
            " Why it's best to not get involved with two people's conflicts. \n\nYou're probably better off really. ",
            "I agree your better off without friends like that... you just stay true to yourself and meet new likeminded people who will be true to you too.\n",
            "James is a sucker and weak in my book. ",
            "Wow they sound like shitty friends. Good riddance ",
            "WTF?? These are not called friends!! You deserve better friends than those two arrogant actors who pretended to be your friends.\n\nTips: If they try to approach you after what happen, don't accept their apologies and move on, because the likelihood of them committing the same mistake is higher than it previously was since the friendship won't be as strong as it previously was.",
            "Damn, I’m sure sorry. You deserve better friends. It sounds like you gave Sarah an opportunity to tell him and she refused. You did the right thing and you’re a true friend. Keep your chin up.",
            "You absolutely did the right thing.  For better or worse, he deserved to have all the information in order to make a decision about the future of his relationship with her.  \n\nIt's unfortunate that he's an idiot and that she's lying scum -that we all know is going to cheat on him again- but those aren't things you have control over.  He might still come around.\n\nYou're a good person and I wish you all the best.  ",
            "Dude you definitely did the right thing. Fuck em' both. If you're looking for new friends, my name is also Sarah and I'd be happy to act as a replacement. ",
            "He probably changed his mind about girl on girl sex and just thought it was hot. But if she cheated with a guy I'm sure he would have left her. ",
            "For what its worth, same thing happened to me. Our (me and SO) best friend cheated on his pregnant fiancée with my sister. We urged him to come clean, he refused. We told his fiancée and she didnt believe us. Friend wouldnt confess to her and they cut us out of their lives. Its crazy I dont understand people.",
            "You don’t need them in your lives. Find new friends man. You did the right thing, I’m sorry that it didn’t turn out the right way. ",
            "Get him a free tattoo for Christmas \"welcome\" it's what is wrote on doormat usually. \n\nYou did what you could. He prefers to be walked over, his choice. ",
            "The right to know is non-negotiable. The right to stay or go really depends on the couple and the situation. I know why you felt you had to tell. I don’t know why you were invested in the outcome. Did you have a secret crush on James? Were you jealous of the relationship? It seems you had an agenda you might not even be conscious of. ",
            "She cheated with a woman. Maybe James just doesn't care or doesn't really see it as cheating since it wasn't with a guy. I'm not saying that's right, just that it's a pretty common attitude.\n\n\nAnd if that's what they've decided, they probably think you'll keep beating a dead horse and not respect their decision and mind your own business, so they've cut you out. \n\n\nThe fact that *six months later* you're still hung up on this kind of proves that you wouldn't be able to respect that they're adults and can make their own decisions about their relationship.",
            "Be patient becuase he'll come around in time, after he's had time to fully process her cheating and what kind of person she is.  She'll throw attention at him right now to cover her cheating, but she'll soon tire of that and go back to her true self.  That's when he'll start realizing how foolish it is to ever forgive cheaters as they will just do it again.\n\nYou did the right thing and in time you wil hear from him with a thank you and an story of how he caught her again.",
            "Good for you. And he’ll come around, eventually, too. ",
            "Man, that really sucks, but you did the right thing and were being a good friend. Like you said, at least you conscience is clear. Sounds like this is a pattern of her being shitty and him glossing over it to keep the relationship together. It will end in heartbreak for him one day :/",
            "James is a doormat and Sarah is of very poor character. I'm sure this is a tough situation, but you did the right thing--and would you ever be able to see Sarah in the same light anyway? I think not. I'm sure James will come to regret his decision, and perhaps he'll reach out to you when that happens. And maybe you'll forgive him for so callously jettisoning you from his life. I wouldn't. ",
            "In the next few months, you'll probably see them break up again. She has a pattern of behavior and will go back to it when she feels she can get away with it.",
            "I remember in high school there were two separate instances in which I told the girl that their boyfriend was cheating on them. \n\nBOTH times I was made out to be the liar, their boyfriends talked badly about me, the girl would stay with the boyfriend, and then drop me as a friend. \n\nAfter experiencing this twice, I vowed to never tell a girl again if their boyfriend is cheating on them. However, now that I am older, it may depend. But it just causes so much drama and people are in denial when they're being cheated on. \n\nIn the end, both of those relationships didn't last (I guess the girls finally caught their boyfriends in the act cheating). ",
            "Good for you.  Leave this in the past and meet new friends",
            "It’s a shame you lost your friends but something else probably would have happened to make you grow apart. If James gets himself ok with this he’s lying to himself, not mature, and really wants to keep her, and those things mean he wouldn’t have been a good friend to you anyway.",
            "Youre lucky to have someone like her out of your life and he’ll just roll over like that, it seems like hes a pretty weak and empty person and no major loss there.  It sucks now but your lufe in the long run is probably improved.\n\nIf he learns his lesson and gets back in contact with you, dont let him in close again.  He can be in your life, but there is no reason to have his back ever again.",
            "Unfortunately you may never hear from him again. He may realize and apologize later, but that's up to you if you want to continue that friendship. You did the right thing. I was watching a friends families house and she had told me her bf might stop by to sleep, because he was at a bar nearby. Well he did and tried to hop in bed with me. I woke up promptly told him to fuck off and went to sleep in her sisters room with the door locked. Waited the next day until he left and slipped out. Told her immediately and they are still together 4 years later. I guess that was worth it over a 10 year friendship. I have no doubt in my mind that he cheats on her whenever he gets the chance. Supposedly according to her sister, she had tried to get in touch with me a year later, but I change my numbers often and I don't have a fb. It fucking sucks, but have some goddamn self respect and protect your friend. Idk what would have happened if I didn't wake up right away and immediately left. ",
            "Their problem, not yours.... if they continue along validating unhealthy behavior, they won’t last as a couple ",
            "This happened to me years ago.  She (the cheater) ended up leaving him for someone else.  ",
            "Your friend is an idiot. A moment will come when he realises this. I hope you’re still ready to be friends with him when he does because at that point he will probably need your friendship.\n\nBe proud. You did the right thing. The high road isn’t always easy. ",
            "Jesus Christ. This sounds awful. You did the right thing. This is not the type of couple/people you want to be friends with. He needs to learn some self respect and dignity. She needs to learn to be a better human being and have some morals. Trust me, you got the better end of the stick. They will most likely fall apart sometime down the road. Go find you some new friends. Some friends that aren't gonna cut you out for doing what's right. ",
            "this happened to me when i was in my early twenties. my (boy) friend ended up cutting me out of his life and stayed with his GF who was a cheater and punched him in the face lots. \n\ngood bye to our 20 year friendship.\n\nwe still dont talk. they both are fucked and not together anymore. (i think)\n\n*internet hug*",
            "You did the right thing and eventually you’ll look back on this as a helpful lesson in life about who we decide is good for us and who we want in our lives. I’ve cut out many people and happier for it. We don’t have to hate them or be rude we just don’t need them in our lives. ",
            "This happened to me at university. I lost one of my oldest friends from where I grew up, and my best friend who I lived with for the whole time I was at uni. I lost both of them- didnt get invited to their wedding even though they met because of me. I am facebook friends with them now 15 years later but it was never the same.\n\nStill - even knowing all of that I don't regret being honest ",
            "The moment you lie to someone, you take away that person's ability to see the world as it truly is.\nIt's easy to pretend such things are not on your table, and that you should stay out of it, but imagine if it was you.\n\nYou did the right thing.\n\nI've been in that situation, and I made the same call.",
            "You're a good friend OP. Always remember that. Don't just surround yourself with \"yes\" people which is apparently what your friend wants from her friends. Those are not real friends. ",
            "You definitely did the right thing. Here’s the twist. HES CHEATING. Only a cheater would be okay with being cheated on.",
            "This is about what I'd expect. If you know then it's about 80% certain that the person being cheated on either already knows or should know but is in denial. The usual outcome is it's the person who tells who gets blamed and dumped. ",
            "This whole thing sounds so hall-monitory to me.  \n\nYou definitely deserved what you got in this case, although you weren't given very good advice in the first thread.\n\nThis girl may be having an internal sexuality conflict, and you basically just yanked her out of the closet before she was ready to come out.  And for what?  I question your motives.\n\nOn top of it you have (had) two friends involved here, not just one.   Why on earth would you turn them against each other?  This is simply not your business.  Do you run to your parents/the authorities any time you sense someone/something has been wronged?\n\nYou got what you deserved, maybe next time you should keep your nose out in sensitive matters that don't involve you.",
            "This is what happens when you get involved in other people's shit. It's not your business. ",
            "It's possible to be morally opposed to something and not get involved if it has fuck all to do with you. \n\nI don't really have an opinion on whether or not OP should have shared the information, but it was told to her in confidence and her friend deserved better than to have information that only belonged to her shared with a third party.\n\nObviously what she did was wrong and as a friend OP had the obligation to steer her in the direction of telling the truth, but if all my friends turned around and blabbed information I shared with them in confidence because they didn't agree with it, I'd find new friends. That's what strong relationships are for - bouncing things off each other, accepting faults and being supportive. \n\nAgain I don't care one way or another about what OP did, but knowing how she acts, I wouldn't dare share information I was struggling with knowing she turns around and takes ownership of that info, feeling like she can share it at will. ",
            "Definitely proves that getting involved in other people’s relationships never ends well. ",
            "[removed]",
            "[removed]",
            "Shocking that people don't want to be friends with a snitch...",
            "[deleted]",
            "I don't see the big deal, to be honest. Most people cheat at some point and monogamy is on the decline, especially for this generation. I remember reading an article that said close to 70% of married women have had affairs, and I'm sure it's about the same for men, too."
        ]
    },
    {
        "post_id": "3t2ext",
        "author": "Iamjusttryingtohalp",
        "title": "My [27/M] girlfriend[25/F] has had the flu for several days. Yesterday she had some serious hygiene issues that I happily helped clean, and today she is so embarrassed that she won't even let me in her room.",
        "url": "https://www.reddit.com/r/relationships/comments/3t2ext/my_27m_girlfriend25f_has_had_the_flu_for_several/",
        "score": 2509,
        "num_comments": 216,
        "created_utc": 1447707141.0,
        "selftext": "We've been together 7 months, and are planning to move in together in January. Since last week she has had a pretty nasty bout with the flu, and yesterday it finally caused her to regurgitate and defecate on herself and her bed.\n\nI heard it occur, and heard her sobs afterwards, so I went in and carried her to her bath. I ran a warm bath and cleaned her up(I had seen her entire body at this point anyways), and left her wrapped in a blanket on the couch. I took her bedding to the laundromat and got all of that cleaned, and scrubbed her comforter and left it outside to dry. I thought nothing of it at all, you help those you care about when they need it.\n\nI work nights, so I left her that evening.  When I woke up today, I came over and found her locked in her room, upset that I saw her like that and did what I did. She says I saw her in a way she never wanted me to see, and she can't handle that.\n\nDid I overstep a boundary? I am sitting on the couch right now and can't really get her to talk to me, she just says she can't face me. I've always been of the mind that when people are sick you help them, and cleaning someone who had an accident isn't really a big thing to me. Was I supposed to just leave her in her fluids?\n\n   \n**tl;dr**: Girlfriend was sick, had hygiene issues, I cleaned, she is upset I saw her that way.\n\n\n**Edit:** About an hour ago she texted me to come to the door. We started talking through the door. She finally said that she was just afraid that I wouldn't see her as attractive(What a number of you guys said) and she was really embarrassed. I told her that is is just a natural part of being alive, and that I thought no less of her and she is still my Lynx(my nickname for her). I told her she needs to see the doctor, which she has agreed tomorrow, so after work I will take her. She opened the door hugged me, thanked me, said she loved me, then shut it and said she was going to bed. I am going to head back to my place and take a nap before I head to work.\n\nThanks everyone who responded, been a help.",
        "permalink": "/r/relationships/comments/3t2ext/my_27m_girlfriend25f_has_had_the_flu_for_several/",
        "comments": [
            ">Did I overstep a boundary?\n\nNo you did a kind mature thing. \n\n\nLook she's feeling shitty and on top of that probably embarrassed. She'll likely get over it when she feels better. Just keep doing what you're doing. \n\n\nTalk about it if she wants but I'd be very grateful if my partner did that for me. ",
            "You are an amazing SO.\n\nShe's just embarrassed. Let her cooldown a bit (because I get stubborn like this when I'm embarrassed.)\n\nWhen she's ready to talk, just say, \"I don't mind helping when you are sick. I care about you; and if our relationship has a future, this may not be the first time this happens. And I would hope you'd do the same for me.\"",
            "I can see why she's embarrassed, but you were a champ and did just what a loving boyfriend should do.  My bet is that she'll come around!",
            "[deleted]",
            "She's just embarrassed. I had to do the same thing as you for a girlfriend once. Pukin' and shittin'; it wasn't pretty. She was kind of weird after that for about a week, but she eventually got over it. To be honest, I think it brought us closer. She knew I wasn't disgusted by her, even when things are comin' out of both ends. Just give your girlfriend some time. ",
            "Ask her, \"[GF], if I were in your place, would you have helped me?\" When she inevitably says yes, say, \"Good, now you owe me one next time I get food poisoning and think I'm going to die.\"\n\nAlso, you're both lucky you care about each other so much. Tell her that too. ",
            "You did a great thing. She's probably just deathly embarrassed right now. Give her some time.",
            "I would be mortified if the same had happened to me and my absolute *worst* moment had been witnessed and handled by my SO (especially one I had known a relatively brief time), but I wanted to add my voice to the chorus of people who have said you did *everything* right, that you did a compassionate thing and you did it thoroughly and well. Your girlfriend is embarrassed, but I bet she's also grateful. She's a lucky woman.",
            "Your gf has seen a doctor right? The flu shouldn't really cause that to happen unless you mean like a stomach flu, but they usually only last a couple days. ",
            "You did not overstep a boundary. Give it some time. She's probably just embarrassed. Now, if after some time has passed she still won't talk to you or is acting super guarded or weird, then it might be time for a serious talk.\n\nYou sound like a solid guy. I hope she realizes how lucky she is to have a guy who would do all of that for her without a single complaint.",
            "you, sir, are the best. you did more for you gf than my husband did to me when i had a similar issue a few weeks after giving birth to our daughter. she is embarrassed (she shouldn't be but she is).\n\ntell her:\n>I thought nothing of it at all, you help those you care about when they need it.\n\nI hope she comes around.. if not don't sweat it. you did the right thing.",
            "You did the right thing and that was incredibly sweet of you. She's probably more embarrassed than anything. Give it some time and let her know that you care about her and that you think she's perfect even when she doesn't.",
            "This reminds me of a story. Maybe if you share it with your GF it'll make her feel better?\n\nMy close friend had been dating her SO for about 6 months when she got really sick with the flu. Like, terribly ill. She was laying in bed feeling sorry for herself when he crawled in to cuddle her. They were both naked, he was spooning her from behind, and unfortunately she ended up sneezing and *shitting all over his dick*.  \n\nYou know how he reacted? Exactly how you did :)\n\nShe was of course horrified and embarrassed, but when she later looks back on the story she says \"that's when I knew I was going to marry him.\" He handled it like a mature adult who put her health and needs above his own. \n\nHonestly, just give her some space. Act like nothing happened. She's just embarrassed, but I don't think you crossed any boundaries or did anything inappropriate. You're a good guy!",
            "It's so hard to be that vulnerable around someone for the first time. You did a wonderful job, and honestly, I think love shows the most when someone is really sick and helpless. Just reassure her. Tell her what you told us, then give her some time to absorb that. ",
            "You seriously win boyfriend of the year. She is very lucky to have you in her life :)",
            "You were very sweet.  I'm a woman who is kind of...sensitive about these things as well.  My SO recently had an incident where he made an offhanded comment, and I got really self-conscious.\n\nThen he told me stories about embarrassing hygiene moments in his life.  And then I felt more comfortable.  \n\nEven though I realize that everyone has these moments, there's still a part of me that thinks my SO has perfect hygiene because that's all I've ever seen.  Sometimes hearing stories helps to remind us that this happens to everyone and it is not a big deal.  ",
            "She's probably not in the best state of mind right now, because she's sick and miserable. When she's well, she may be more capable of dealing with the embarrassment in a way that isn't so debilitating. Does she still have a fever? I know when I get a really high fever I start to have paranoid hallucinations and dreams and I'm really awful to my wife when she tries to help me.",
            "I'd go for the mature response with a hint of humor just so she know's you are taking this seriously, but also that its not that big a deal \n\n*Baby...there are going to be times where both of us are literally and figuratively covered in shit.  It happens, that's life.  But you need to know that I'm here.  I'm all in.  No matter what happens, I will be by your side.  So please don't feel embarrassed by what happened.  Would pooping my pants help?  Cus I'll shit myself for the greater good.*\n",
            "You are a great boyfriend. A good person. I just read your update. I'm glad your girlfriend is on the mend and that you got answers. In the long run things like this can ultimately bring you closer because you have seen her at her worst. I hope you two continue to be loving and caring partners through whatever life may throw at you!",
            "You're amazing. That's love. \n\nI would just reassure her that you care about her and it's not going to change the way you feel or how attracted you are to her. ",
            "This exact situation happened to me, but my mother was the one to help. \n\nI am engaged to someone who has seen me at my worst and best, and have known me for  15 years.\n\nI would still be mortified about it because that's the type of person I am - but would he think twice about it? Not at all. \n\nJust embarrassed. Give her a little time. maybe bring some flowers. Or just say through the door that you hope she feels better, you'll be back later, and you both can act like it never happened if it makes her feel better - but you view her in the same way you always have.",
            "You sound like a wonderful bf, shes so lucky.  I hope she holds on to you and treats you well and you keep treating her well too 😊",
            "Just wait until she's giving birth and takes a shit on the table in front of everybody. Good times.",
            "My husband isn't even that sweet. He would have been gagging and swearing the whole time if it happened to me. And probably would end up not finishing and making me do it all by myself.\n\nYou did absolutely *nothing* wrong. She's just embarrassed that any of it even happened in the first place. She'll realize how lucky she is and come around eventually.",
            "She is really really embarrassed right now. You did a wonderful thing by taking care of her and it was incredibly sweet of you to not even think twice about helping. ",
            "You definitely did the right thing. You took care of the person you care about in a time of need. \n\nAs most are saying she is likely embarrassed. And hopefully she gets over it and realizes how awesome  you are for doing that. If she's so immature that she doesn't understand that, then you get to decide if you're okay with dating someone that has a mind frame of a 12 year old or not. \n\nHopefully she gets over it though. As there is really nothing to get over but herself. You did a good thing. Don't think otherwise for a second. \n\nAnd if she's can't understand that she should appreciate what you did for her then I question her intelligence. ",
            "Damn, you went above and beyond. \n\nYou get all the gold stars.\n\nSHe's probably just embarrassed and still feels like crap to begin with. Just give it a bit of time; she'll come around.",
            "How you handled, and took care of things was amazing. I know how your girlfriend feels. A few months ago, I was feeling terrible, and I was about to throw up on myself. My boyfriend, the awesome man he is, caught whatever I vomited and held my hair with the other hand. He gave me a cup of tea, had me sit on the bed while he cleaned everything up. When he came back he just comforted me. I was, and still am embarrassed. \n\nGive her time.\n",
            "When I had my daughter I was so sick I wasn't allowed to stand up. I had to shit into a bed pan and my husband cleaned it up and wiped my ass. He also, due to extenuating circumstances, had to hold a light while a dr put a catheter in me. \n\nI was a little embarrassed until he explained that he was HAPPY to get to help me when I was so sick and vulnerable. He said it made him feel closer to me and was so happy he could help me in any small way when I really needed it the most.",
            "OMG I can't tell you how happy it makes me to hear of such a kind, considerate person such as you!",
            "You did great.\n\n\nI wish I could find the thread where I saw SO's discussing the exact same situation you're in and saying how it ended up bringing them closer.",
            "You did an amazing thing. ",
            "You're an amazing fucking boyfriend!",
            "There was this one time that I was visiting my grandmother when she had a bad accident in her bathroom.  This was before she had to be moved into the nursing home, but was already wearing adult diapers at this point due to incontinence. \n\nShe was so mortified.  I could see it on her face. The embarrassment was palpable.  She looked right at me and ask how on earth could I have cleaned all that up. \n\nI looked right back and said, \"grandma, it's just poop.\" Then I went on about my business and pretended it didn't happen.\n\nI think that's the only thing you can really do.  Let it drop. Even trying to console her is just going to remind her of the embarrassment. So, when you take her to the doctor tomorrow, play it cool. Ask her if she's feeling better, but don't make a big deal out of anything.",
            "That's husband material right there.",
            "You are a golden bf. Glad to hear it was resolved!",
            "Had this happen to me once when I had food poisoning. Instead of having a boyfriend help me out, though, it was my mother who carried me to the bathtub and washed me. Mind you, I was a teenager at the time and it was awkward as fuck.\n\nBut anyways, here's the thing: my mom and I might not have gotten along much when she was alive, but this act of kindness is something I'll never forget. I even look at this memory with some fondness because of how selfless she was for helping me in such an abject state. Sure, I was embarassed by it (and still am), but it was such a kind and loving gesture. I know your situation is different since this is your girlfriend, but I'm sure with time, she'll realize what an absolutely amazing thing you did for her.\n\nShe's lucky to have you, OP.",
            "It's love when you've got it coming out of both ends and your SO helps take care of you regardless! You can even joke about it later on too!",
            "It is really good that she is going to see a doctor. Not saying this is it, BUT...\n\nWhen I went to a concert (outside all day) years ago, I ended up passing out and couldn't afford to buy water (it was $10 a bottle.) I went home with my skin feeling on fire at 12 AM. A few days later, I thought it was the flu since I only had it once before and it felt like I had it. \n\nTwo weeks later, it got so bad that I was crying, vomiting, and defecating simultaneously for at least an hour (never had this issue before with the flu.) Went to the doctor, it was a kidney infection. Again, not saying that is the case with her, but good on you guys for agreeing to go before it gets even worse",
            "When I was a young girl I was really sick like that and it felt terrible. My dad carried me to the shower and my mom refused to come into the room. The next day when my dad was at work she made me clean it up and then hose it off outside. My elder brother mocked me endlessly about it for many, many years and that makes me sad to think about. I was beyond mortified when it happened and it stuck with me for many years and made me ultra uncomfortable for sick/hygiene related issues.\n\nWhat you did was kind and loving. I'm so glad you were able to help her when she was so sick :)",
            "You are an awesome SO, truly. \nIt sounds like she's embarrassed, hopefully she'll get over it when she feels better and with some reassurance that that you love her and were happy to take care of her, and always will, and doubly that you still think of her as a sexy, beautiful woman. ",
            "You're a solid dude. Give this some time. She just needs to process it a bit. Time will fix this.",
            "You did exactly what you should have.  I would be uncomfortable if my wife had to do that for me and we've been together for 20 years.\n\nGive her a little time to feel better and then talk to her about how you feel.  That it wasn't cleaning up but making her feel better.  ",
            "You're a good partner, she just hadn't been through that before and was embarrassed. It'll pass, and she'll appreciate your kindness. ",
            "You did a great thing but what the hell does she have that she shit herself and \"regurgitated\"? That seems pretty serious. ",
            "So this might not be quite the same but I had a similar experience with my mom. Now my mom, as my mom has cleaned up my shit and vomit from when I was a child. She also did the same when I got my wisdom teeth out and before when I was a teenager and got period blood on my sheets. But the one time she had an awful bout of the flu and had uncontrollable diarrhea she felt super embarrassed. Its an intensely vulnerable experience to be loved and cared for that way. Some people are not used to ever needing that and it's hard to accept help. Maybe a letter or text could remove some of the awkwardness. Bodily functions are nothing to be ashamed of and remind her she would probably do the same for you. ",
            "My bf saw me very drunk one night. I threw up in the shower,  in the sink and in the toilet.  I then proceeded to poop like crazy in the toilet (probably making push sounds). He was by my side the entire time.  He made sure that I sleep on my side and even though he got very angry in the morning when I sobered up, I am so grateful that he took care of me. It was a very embarrassing  moment, but we are all humans. ",
            "Props to you. If I shit myself I would be mortified. You are a gentleman.",
            "You are awesome! Way to go for being selfless and supportive. ",
            "You probably ought to have sought emergency medical care. Perhaps hospitalization. This is really serious.  It is not so much about what you can handle as about when the ER is indicated. ",
            "You've done well. Next step is to make her feel super attractive. She's probably scared it changed how you look at her.",
            "My ex got angry with me when I was sick. You are the best, glad you sorted it out",
            "Your update was a lovely thing to read in and of itself and I hope nothing's more seriously wrong with her. *Hugs* for the both of you, you sound like great people :)",
            "When she is well again and some time has passed, she is going to remember how you saw her at her worst and you didn't even flinch.  You're a good boyfriend!  ",
            "You are a good person. ",
            "Somehow understandable...I would also be really uncomfortable if that happened to me...and I'm a guy. It just makes you vulnerable, not like \"honey, can you make me tea?\" vulnerable, but really really vulnerable. Now I've used that word 3 times ;) Hope she overcomes this. What you did was really chill. Some people would run away screaming or try to ignore the situation. You're a cool dude. Hope she realizes that.",
            "You're an amazing SO. I've seen posts on here about people who can't handle armpit hair. Hell I dated one guy who couldn't handle that I would fart on occasion Keep doing the good work, and be patient, she'll come around! ",
            "Wow you're such a good and mature boyfriend. Keeper.",
            "I've been married for 47 years. Each of us - at various times - have taken care of/cleaned the other during/after illness and hospital stays.\n\nWe each cleaned up after our children when they were ill too.\n\nNo one thinks anything of it in our house. \n\nIf you're sick, sometimes you need help and it is expected (and at times necessary) your spouse/partner would be there for you as a parent would be for a child.\n\nI think she might be embarrassed at this point. You were a good person to help her through a bad time - you did the right thing!\n\nTake care and I hope the gf feels better soon :)\n\n\n*Nana internet hug*",
            "I just want to say that I got totally choked up reading this, because of how respectful you are to her after all of that. I would be mortified as well, but god forbid if I'm ever in a situation like this, I will think of you and how much you weren't bothered and clearly still care for her. I hope everyone is lucky enough to have an SO like you someday! ",
            "You lost me at Lynx. ",
            "You're a good man. ",
            "I think it's sweet and shows you're a really good guy. She's lucky to be with someone like you. That said, I would DIE if my boyfriend did that, despite the fact that we've lived together for a year, have seen each other at our worst, and love each other unconditionally. I would certainly appreciate the help, but unless there was NO WAY I could take care of the situation myself I would not want my boyfriend to do that for me. ",
            "maybe not call it a \"serious hygiene issue\" - the girl had an accident while she was sick.\n\nI'm glad she has come around, you did all the right things in her time of need. If you had have gagged and run out of the door throwing up, different story. but you did a wonderful thing. She will understand.",
            "You were very sweet. You showed her selflessness. We ladies are told daily that we have to show our perfect side or else we are unlovable. She is just embarrassed and possibly afraid that her stuff grossed you out/scared you. It'll blow over as you continue to make it a no big deal kind of thing.\n\nEdit: just saw your update. Yyaayy",
            "I've been in her shoes before, twice, and it's definitely a hard thing to deal with.. She just needs to have a day or so alone. Just don't bring it up until she's ready.",
            "TMI, super personal story time. Feel free to tell your girlfriend this too if you want. I was working at a gas station awhile ago, the height of hygiene quality (/sarcasm) when I got gastrointeritis which was explained to me as \"food poisoning on steroids\". It was so bad that I needed to go to the hospital. While in the hospital I was put in a room that shared a bathroom with another room. Some jackass locked both doors and didn't unlock my side. Which meant I could not get to the bathroom quickly enough. I ended up vomiting and defecating on the floor. So not unlike your girlfriend.\n\nMy girlfriend at the time (I am female) helped get me cleaned up and taken care of, yelled at the nurses, and just made sure I was alright. I ended up marrying this woman. She's seen me at my absolute worst both physically and emotionally and she's never ever shied away from it. I know she'll always be there for me. (We've been together 11 years in total so far)\n\nYou are a fantastic, wonderful, caring boyfriend. While she might be embarrassed at times to think about it, she'll remember this in a positive light, I promise.",
            "I like the idea of slipping a note under her door. Remember she is probably really emotionally drained from being so sick, I can never really keep it together after a bout with the flu.\n\nJust a suggestion but your note could read:\n\nI love you and I'm sorry you are so sick. I'll be out here waiting for you. \nAlso- there is going to come a day when I shit myself and you're going to be there for me. I hope for both our sakes it's not taco-related.\n\n\n",
            "She's probably just embarrassed.  Nobody wants to be seen like that.  Give her some space, she'll get over it soon enough.",
            "[deleted]",
            "\\>girlfriend embarrassed about something private that happened to her  \n\\>posts about it on Reddit for thousands to see  \n\nBuddy... ",
            "nice job op.\n\nside note, am i the only one disturbed that he took shit covered laundry to the laundromat instead of washing it at home? other people use that equipment. if someone told you they had just put a shitty load in the washer just before you were about to, wouldnt you say \"what the fuck man i'm not using that machine anymore!\".\n\nor am i crazy for thinking this?",
            "Ugh you are godly OP. She's embarrassed (as anyone would be) but she will come around and I'm sure she knows you are a great partner to have.",
            "When I describe what true love is, what romance is, its exactly this. It's easy to love someone when they're done up and on their best day, it's when you still them at their most raw that makes it \"real love\".\n\nWhat you did was beyond wonderful and caring. While I can understand her horror, you did what is the definition of caring. ",
            "This made me Aww all over the place and that is one moment that may stick with you both as a defining moment of your love as silly as that sounds!",
            "Hon, husbands and wives have had to wipe each others asses.\n\nThe only way to be sure if you can be together is to ensure you've seen each other through the worst flu.\n\nIf she'd helped you (unless she's a bad girlfriend), she wouldn't have felt differently than you did.",
            "A few months after meeting my boyfriend (we weren't even official yet) I threw up all over him and his bed.  It was so bad that nearly the entire bed was covered and he had to throw the pillows away. I started crying because I was so embarrassed and said I could never see him again. He picked me up, put me in the shower, cleaned everything up, then cuddled with me. He has done a lot for me, but this still sticks out as one of the most meaningful things he's done for me. I don't think that you overstepped a boundary, but rather did something very nice. I'm sure that she will get over the embarrassment and be very grateful.",
            "Damn OP, you're a wonderful guy. Keep it up! Hope she's okay.",
            "Awe you're wonderful. I'm sure she only loves you more for it, this is just her way of dealing with it. Thanks for being a good person",
            "I've always taken care of partners when they got sick. Seen, heard and in some cases smelled some unfortunate events. But nothing really phases me and i tell them i couldn't care less",
            "Aw, your edit made me really happy to read. You're a wonderful guy. \n\nBut until I got to your edit, I was just going to reiterate what your SO pretty much said. I get migraines about once a month that are absolutely devastating, and reduce me to a helpless vomit monster. My fiancé takes care of me, and comforts me in many ways, but I just can't bring myself to let him wash out my puke bucket. He tries to reassure me that it's no big deal, but it just makes me feel so disgusting and guilty. =/ Nonetheless, I do appreciate how much he cares, but I appreciate that he's willing to respect my boundaries too.",
            "Your good man just let her do her and remind her occasionally that your a team now and sometimes that means carrying the other for a while. ",
            "It's a vulnerable circumstance. Especially in a first year relationship, and pretty young still.\n\nYou're really great about seeing a biological function of a human body + happening to someone I care about = nurture. It's not easy, or so clear to some people. There's an entire spectrum of potential responses, and yours was pretty damn perfect, but her stress in understandable too, until it became clear to her also.\n\nIt must've been scary for her, while she awaited to see which type you were.\n\nGlad you both worked through it. ",
            "You're the man. Every time she's being all weird about it, just be like \"IDGAF, i love you, the mess is cleaned up, you're hot, let's do it. \"",
            "Tell her that if you'd ever encounter similar situation you'll appreciate if she could help you the same way you did.",
            "You are a wonderful guy.\n\nShe will get over it, she's still not well and embarrassed.  Follow her lead - if she doesn't bring it up again, then you shouldn't either. ",
            "yeah.. you didnt over step anything... I dont mean to sound mean but she just needs to get over it and thank you. When she's better she can cook you a nice dinner as a huge thank you. She needed you and you were there :) ",
            "First of all, you're so awesome for taking care of her. There are plenty of people who would have left her to deal alone. There is so much love and acceptance in that action, wow -- basically, you must LOVE this girl something fierce.\n\nShe's just embarrassed. Give a day or two and she'll be filled with so much gratitude that you handled it and didn't run for the hills.\n\n\nSource: Married the guy who cleaned me up one awful embarrassing night. I feel lucky every day.",
            "That's like the ultimate act of love right there.",
            "I hope she realizes you are one in a million. That was very sweet of you. ",
            "My father always said that you can't know if you love someone until you've nursed them through the flu. Good on you, man. You really care about this person. Let her know that there will come a day when she can return the favor, and that this truly and completely is what love is all about. *high five*\n\nFun fact: That time came form me and my husband when we both got really sick in Hong Kong.We had a tiiiiiiiny guest house hotel room. Frosted glass bathroom. You fill in the rest. ",
            "She should marry you.",
            "Hey man. First of all, thank you for doing what you did. Don't feel that you are pushed away at her reaction. I believe the best way to approach this issue is reassurance, always. Let her know that you will be there for her. Don't feel angry that she may push u away. Be patient! :)",
            "How long have you been dating?  She just needs time to come to terms with you seeing her in a way that she probably envisioned not happening for a long time.\n\nYou handled everything like a champ and have nothing to worry about.  Just give her some time to realize that adult relationships often involve adult situations.  You can also reassure her that you care deeply for her and this is no big deal (for you) and does not change how you feel about her in any way.",
            "You sound like a very good boyfriend. Best of luck to you both",
            "In her place, I'd have felt so embarassed that I might've severed the relationship altogether.",
            "What did she expect you to do do?",
            "You are a GOOD man.",
            "I once threw up on my husband (boyfiend at the time, only dating a little over a year) giving him a BJ. Granted, I was pregnant and EVERYTHING made me throw up.... but he didn't get grossed out about it. He helped me to the bathroom, and sprayed all the puke off, cleaned himself off, then told me to stay under the water, and *he* dealt with the mess. I was truly mortified (still am) but he showed me his true colors that day. ",
            "I'm always the type of girl who would rather be left alone while I shit/puke my brains out, but man.. that's love. Yeah, I'd be super embarassed but I would kill to have that kind of love.",
            "Glad she's feeling better. I went to the Original Post and apparently I'm the only one that doesn't shit themselves when getting the flu lol. PHEW. ",
            "awwwwww <3 <3 <3 ",
            "Not quite the same, but reminds me of the time I sharted on my fiance's fancy couch. It was actually pretty funny and I didn't hesitate to tell my family (we love poo jokes). My sister even made up a little song/poem about it :D",
            "My girlfriend basically had to do the same thing for me six months ago when I got food poisoning right before her sister's wedding.  The fact that she was still into me after I'd shit my pants in front of her... shocks me to this day!  But it showed how much she cares for me and how much I can trust her. ",
            "Tell her \"Don't worry, play your cards right and someday you can poop yourself in front of me AND a room full of OBGYNs and nurses, then we can clean our children's poop together, and then we can grow old and poop ourselves together.\"  \n\nMarriage: It's awesome.  \n\nEdit: you handled it well, and she coped as best as she can.  Point is: you talked it through.  ",
            "If she ever goes through childbirth, I hope she's lucky enough to have a loving partner there with her, but... she's going to go through much more involved stuff.\n\nThat said, it's hard for her.  There it is.  That's part of who she is.  I hope both of you can work through it gradually for the time it takes and come out stronger.",
            "Poop your pants and then make a big deal about how you \"accidentally\" pooped your pants. That way she'll know it can happen to anyone.",
            "When she's feeling a bit better, gently point out that that is very, very small potatoes compared to the amount of bodily blecch and dysfunction that people will deal with together in an emotionally healthy forever relationship. If this weirds her out she should think about what elderly couples deal with. You did a very nice and normal thing. People shit and barf. It's a cruelty to leave them in their shit and barf. Hopefully she can be more at ease with being a mammal once she's over the cold. ",
            "I feel so badly for both of you!  \n\nNo, you didn't overstep!  I completely understand her humiliation, but please understand that you didn't do anything wrong here. You were wonderful and supportive.  \n\nHer issue is that she's going to have a hard time understanding that someone can see her like that, and still love her and be attracted to her. That can be hard for some people to wrap their heads around (male or female), because many people haven't got a lot of experience with mature, devoted partners who are ready for the realities of true partnership. ",
            "OMG, that was incredibly sweet. She is very embarrassed and may be from one of those families where your SO is never supposed to see you in an unhygenic state.  Give her some time to get over and talk it out.\n",
            "\"I understand what happened made you horribly uncomfortable. But what else could I have done?\"\n\nShe may take a while to process it. But you did the right thing, and she'll appreciate it eventually. ",
            "I mean, if you ever get married, have kids, or grow old together, this sort of thing will probably happen again. You might see her giving birth, or change her diapers if she ends up old and feeble or something. The sexy part of the relationship only lasts so long until you start farting in front of each other and stuff. She's probably just embarrassed about what happened, but maybe there's also an element of \"the honeymoon is over\" in there.",
            "Let her know there's nothing to be embarrassed about, shit happens. Tell her it's happened to you before and lets just pretend that it never happened and go get some pizza. She'll come around. ",
            "Just out of random curiosity...do you work in the medical field? You seem super casually nonchalant about dealing with poop and vomit. Any good loving partner will suck it up and do what needs to be done.. you just didn't seem to be phased by the situation at all. Either way, regardless, you are a great boyfriend and she will get over the embarrassment of it eventually. ",
            "You, my dear redditor, are an awesome boyfriend. She might not understand that right now, because she is quite understandably upset- but you are great. Please just keep being there for her- and keep riding it off as a \"whatever, we're all human\" thing and I'm sure she will start to understand that. On a side note, and I know this is silly , but I still can't pee in front of my husband after 14 years of being together and two child births. It's instilled in a Lott of women that those sorts of things are un-lady like and unattractive. Ridiculous- but common. ",
            "This makes no sense.\n\n1) If someone is vomiting and defecating uncontrollably you should take them to the hospital.\n\n2) If she didn't want you to help why wouldn't she ask you to leave and let her clean herself up? I wouldn't want anyone in there with me like that and I would ask them to leave.",
            "Very suspect",
            "Your gf needs to wise up to the fact that we are just squishy meatbags our bodies naturally do really gross things even at the best of times. Shit happens, and it's really no big deal.",
            "If she really feels that bad, shit yourself and have her clean you up. Boom. Problem solved. ",
            "I didn't check my math 100% and I may have skipped some steps in showing my work, but I'm pretty sure you're a lot closer to getting her to do anal now.",
            "fart on her to assert your dominance and show bodily functions especially ones you can't control are normal and ok",
            "She's immature. If she drags this out and doesn't come to terms with it; dump her. Dump her fast.",
            "[deleted]"
        ]
    },
    {
        "post_id": "cyeyj8",
        "author": "Throwaway09850953",
        "title": "[17 Female], My dad was about to beat up my mom, so I called the cops on him secretly, even though they had calmed down.",
        "url": "https://www.reddit.com/r/relationships/comments/cyeyj8/17_female_my_dad_was_about_to_beat_up_my_mom_so_i/",
        "score": 2496,
        "num_comments": 171,
        "created_utc": 1567368972.0,
        "selftext": "My dad was about to beat up my mom, throwing a few hits, it felt very very wrong to me so I (17F) scretly called the cops on him. He had done a few hits and my mom did scream a lot, and she went to a different side of the house. They did scream at eachother for a bit and she said she was going to stay at grandmas for the night, and I thought this would ahppen, but by the time this happened the cops had come.   \n\n\nMy mom and dad were both interviewed and they did realise she had facial marks, which my mom lied about and said nothing happened. They did not or my dad when they said nothing happpened, and they took in in for the night to keep my mom safe.  \n\n\n1) Should I feel guilty over this, I knew my mom was probably safe at the end as they did calm down, but there was a chance of a futher beating (unlikley)?  \n\n\n2)Is it likley that my parents think a neighbour called, as I think my dad will beat the crap out of me if he finds out, do neighbours call the cops on these things?  \n\n\n3) Will this be a wake up call for my dad, do people realise something is wrong once they get \"a night in a cell\" and try to change themselves?  \n\n\nTLDR : Dad beat mom, I called the cops, but they calmed down, should I feel bad?",
        "permalink": "/r/relationships/comments/cyeyj8/17_female_my_dad_was_about_to_beat_up_my_mom_so_i/",
        "comments": [
            "OP, if you haven’t yet, make sure you delete the record of that call from your phone:  take what steps you need to to protect yourself and keep yourself safe.  As other people here have already told you, no, this is not normal and not okay.  You did the right thing, even if your mother is in too deep to end the cycle of abuse when an opportunity was presented.",
            "If he already beat her then she wasn't \"safe\", you did the right thing. Just be careful next time it happens, make sure you're safe too if something escalates",
            " >I knew my mom was probably safe at the end\n\nShe's not safe as long as she's in an abusive relationship. You did the right thing.",
            "No, you should not feel bad. This is actually exactly what you should have done. If your parents haven't said anything or taken any anger out on you, it is very likely that they already assume a neighbor called the cops which yes, is very common especially if an argument or noises can be heard from the neighbors house.\n\nHowever, your safety is your priority so if you ever feel calling the cops will put you in danger, you should first secure yourself in a safe place (for example somewhat ironically, running to the neighbor's house and making the call there).\n\nAlso, At seventeen based on where you live and the laws there, you may be able to emancipate yourself and leave home before you turn eighteen. This may be worth pursuing if you feel you are under threat of violence.",
            "Never, ever feel bad about calling for help. Ever. \n\nThis is exactly what you should do. She wasn’t safe and neither were you. Thank you for being so brave.",
            "\\>>as I think my dad will beat the crap out of me if he finds out,\n\nHas your dad beat you before?   You should consider going to police station and explaining your past experiences and your fears.  If you aren't ready to file charges, you can tell them taht you just want to get advice.  One thing they can do is to put your home phone # and your cell # on the list of calls to respond urgently to if you ever need to call 911.  And they may have some good advice about keeping yourself safe.  \n\nIf you are really likely to get hit prepare an exit strategy.  Can you get out your window?  Is there a way to get out if dad blocks the door?   Can you tell when things are escalating?  If so, leave early on in the escalation, don't wait for him to start hitting.  Call the national domestic violence hotline and you will get a ton of good advice for this situation.  1-800-799-7233",
            "[removed]",
            "First off, I cannot recommend enough that if you have these questions you read Why Does He Do That? by Lundy Bancroft. It is considered *the* book to read if you have questions about abuse and need help. It's available for free online (just Google for the PDF) and I've never found a library without multiple copies.\n\nThat said-\n\n1) No, there is absolutely no reason to feel guilty about this. You did not do anything to cause anyone harm, you acted in the interest of preventing harm.\n\n2) Neighbors do call cops about this stuff all the time, or even random passerby. However if you're worried your dad will attack you if he thinks you're responsible, *take precautions*. First send yourself an email saying what you did and that you think your dad might retaliate if he finds out, if he does retaliate that will streamline the process of getting help or going to the police afterward a *lot*. Second, tell a friend what's up and make arrangements with their family to be able to stay the night (or two) on short notice (most half-decent parents will do so). Leave a couple change of clothes, a toothbrush, some toiletries, etc. \n\nIn other words, make sure that if your dad does attack you you have a way to both get out of the situation and then back up your side of the story later.\n\n3) No. Lundy Bancroft, the author of book mentioned above, is one of the foremost experts in the world in treating abusers so that they stop being abusers. With his decades of experience, he gives at most a 10% 'fix' rate for abusers who spend *years* in a specialized abuser program. His advice, and the advice of every psychologist I've ever met who deals with abuse, is to not expect abusers to change. Improvements are almost always conditional or temporary, changes in behavior are just replaced by other types of abusive behavior, and it is just in general healthiest to assume that abusers will never change and that you need to live your life without the expectation that they will get better. \n\nLastly, I would recommend calling a women's domestic violence shelter for advice. (You can find the numbers of local ones on google). You don't have to take any drastic legal actions or flee there or anything, nothing so serious as that. But those shelters have people who understand these situations very well and can give you good advice.  If you're looking for advice about your situation, the people you will talk to there are far better equipped to help you than Reddit is. \n\nGood luck. I wish you the best.",
            "You did the right thing. This isn’t normal and your dad made the decision to be a dangerous abusive person. He needs to face the consequences of that.",
            "CONGRATULATIONS.  You are a superstar human being.   You know better than us how hard this is.    Of course you did the right thing.  Imagine you didn't call the police, they calmed down, and next week while you were away he put her in the hospital.   You are wonderful  Bless you.",
            "\" My mom and dad were both interviewed and they did realise she had facial marks, which my mom lied about and said nothing happened. \"\n\nYour mom wasn't safe.  Your dad might have turned on you as well.  You were right in calling the cops on your dad.",
            "If he didn’t want to get in trouble, he would know better than to be an abusive asshole. Try and figure out a place to stay that is safe for you as well if your mom is unwilling to leave.",
            "[removed]",
            "1. No, it's good to have a police record of this for the next time, and there will be a next time. 2. Yes. I once called the police because I heard a loud bang and then my female neighbor screaming and crying while her husband yelled. 3. No. He's an abuser. They don't magically see the error of their ways, and they REALLY flip out when their secret (that they're abusive) gets out (I had an ex who was like this, the most psychotic he ever got was when he found out I'd told a close friend what was going on ... he forbid me to see her). He'll likely come home more angry and take it out on one or both of you. That is not your fault. That is HIS fault. He brought this on himself, no matter what bullshit he spews.\n\nThis is a shitty environment for you. I realize your mom is a victim but as the adult she should get you the hell out of there. That is unlikely. And you can't make her leave. Keep your head down, get through high school, and then get the hell out of there and don't look back. Or better yet tell a trusted adult (school counselor, family member you know you can trust) about what's going on. This is not a safe place for you to be right now. \n\nIf you can safely call the police on him the next time he does this again, do it. If it puts your safety at risk, do what you need to do to protect yourself. Your father is dangerous. He left marks on your mother's face. He is capable of worse.\n\nYou were really brave to call for help. Your mom was NOT safe. She won't be safe as long as she stays with him.",
            "Call the cops every fucking time. Sneak out the back and go to a neighbor's house.",
            "You are a hero. You shouldn't feel bad for it. You just wanted to protect your mom. It takes a lot of bravery to do something like that.",
            "You did the right thing !! I have personally lived thru this . Please talk to a therapist about this by experience it will affect your relationships in the future.",
            "Hey, I done the same thing when I was about 8-9, you did the right thing. Your dad was hitting your mum, that grounds for the police. Please don’t feel guilty or scared about getting help, be safe",
            "Coming for an abusive household you absolutely did the right thing. Someone with a temper like that can “calm down” for a second and be right back with their anger within minutes. Neighbors commonly call the police in situations like this especially if they hear it happening often. Unfortunately these like this aren’t typically red flags to get them to stop their behavior. It may be better for a week or so but people always go back to their ways. If anything is going to help your dad it’s mental health help. \n\nYou and your mom deserve better and should try to get into a woman’s shelter ASAP. I know how hard it is to get your mom to leave but I would start the conversation with her soon. Make sure other family members know the situation you are in just in case things go to court. \n\nPlease try to seek help with your mom and leave, I wish you the best of luck.",
            "Don’t feel guilty. It’s for the better. What your dad did is very wrong and could escalate to something more scarier, this is a wake up call for them to resolve their issues differently.",
            "1. No, don't feel bad about it.\n2. Yes, neighbors sometimes do call the cops when there's a loud argument. They are either very concerned or they don't like the noise but don't want to say so.\n3. Impossible to know if it's a wakeup call for your father. Maybe it's just inspire him not to yell.",
            "OP, a single “hit” is grounds to call the cops. That’s unacceptable and wrong. Is there a school guidance counselor you can see? I’m concerned for you. Not just your safety but I think you could benefit from an outside person who can help you see that none of this is normal or okay. It’s so easy for abuse to be normalized if you’re raised in a home where that occurs and you sound like a really good person who could use some help processing all that. Never feel guilty for standing up for your mom and what’s right. Unfortunately, it’s unlikely that your dad will change and I would be making plans to leave if your mom won’t leave too.",
            "Growing up around your dad and how he acts has made it seem normal to you. It's not. Whether your mom ever presses charges, what he does is against the law. It's against the law for him to beat you too. Not only is it against the law, it is just wrong. He is hurting you guys and teaching you that you deserve to be treated violently. Your mom is teaching you that too by covering it up. I know she probably feels in her head it is the best way to protect you, but unless she is working on getting you safe she is not doing her best to protect you. \n\nLots of parents spank their kids. Studies have shown it doesn't help kids learn because it just scares them out of doing something when they could get caught  But either way regular spanking without excessive force  is not meant to be abusive in general, even though it can be. Luckily it's becoming more a thing of the past. \n\nBeating someone is never ok. No one deserves that. Being beat can make someone feel they must have done something to deserve it, or be someone who deserves to be beat. That's just not true. The only reason people feel that way is because getting beaten up and mentally abused confuses our brains into believing that. Therapists can help with that. No one deserves more or less than other people, but sometimes we need to be taught that as adults because we were not taught that as kids. Your mom is definitely confused in that way, because she not only lets him abuse her but she lets him abuse you too it sounds like. That is nothing to do with you, it's to do with her confused abused brain. Most likely something happened to her growing up that taught her that this was normal which is why she ended up with your dad. \n\nA 17 year old girl should not have to fear her dad beating her up. You probably feel really old sometimes with this going on in your life, but you are a kid who should be loved and cared for and protected. I felt old at your age, but now I have a nephew and a little sister in law your age, and I would protect them with my life. They are so smart and competent, but to me, an adult who loves them, they are kids to be loved and protected. You deserve that too. \n\nIt's really admirable that you are concerned about your mom, and it's a good thing, because it means you are not like your dad. You have empathy and you care. But your mom is not your responsibility. You are hers. So you need to do the job she is not able to do, and take care of you. There's a lot of good advice here about who to reach out to for help. There are good people who will want to help. Your mom may not accept help, but things can be different for you. You do not have to live wondering if you were overreacting because your mom didn't get beat up that bad. A good man doesn't hit his wife. You felt it was wrong because it is. Listen to your gut, not what your dad has taught you. \n\nI know the world isn't black and white. You probably love your dad. He is probably ok sometimes. That doesn't change anything I've said. Whatever is wrong with him, he does not act like a good man, and he does not protect you, and someone needs to do that. Someday your mom may be ready to leave and you can be there for her, but right now she's like a person with an addiction, and you can't help someone like that until they want to be helped. So learn from this, and take good care of yourself, because you deserve it just like every other kid. I'm sorry you are going through this and have had to see such darkness so early in your life. I hope you can catch some breaks now and things will get better for you. Take care.",
            "You did the right thing. The neighbors do sometimes call police (screaming isn't normal). Keep calling next time and eventually your dad will (have to) stop. If your mom sinks too deep plan your leaving in the near future and find a therapist (even tho everything looks fine you got raised in abusive household, without proper therapy it will make you the target of social predators)\n\nThank you for being so brave!",
            "I can only imagine how difficult it was for you to make that call. Your parents who are supposed to love you and keep you safe, are contributing to an unsafe environment. Thank you for trying to protect your mom and for not making excuses for your dad. Sounds like everyone is in need of professional help for all of the trauma, but it's a long hard road. From personal experience, I'm not sure I'd expect the phone call to the police to be \"the wakeup\" call your dad needs. It may get better for a while but in most cases, this is a repeatable pattern with potential to escalate. Please seek safe housing for yourself, and your mom if she'll go, until he gets help. Best to you.",
            "Wait wait wait. My dad will probably beat the crap out of me if he finds out? for god sake you’re only a 17 year old girl and you said your dad is gonna beat the crap out of you because you called the cops. out of fear he would full on assault your mom and seriously hurt her. that piece of shit doesn’t belong anywhere close to you and your mom. I’m a grown ass man myself and I would NEVER put hands on my woman or kids. Never ever in my life. I’d sooner douse myself in gas and light myself on fucking fire. \n\nAnyway, *he needs to be removed.* neither you or your mom are safe and I can tell through a reddit post. Is he an alcoholic? Does he have something mentally wrong with him? If there’s anything that could cloud his judgement a slight beating (if there is such a fucking thing) could turn into assault causing bodily harm or even murder. \n\nYou are unsafe. your mom is especially unsafe. He needs to be removed or get serious help now. There is no waiting thinking “oh my dad would never do that”. Because you’d be fucking surprised what a person could do. Talk to your mom and get him removed. Your mom might not even be of any help seeing as she lied for him. Do something for fuck sake. Get away from him. Next thing will be you or your mom in the god damn hospital. Once Hands are laid the relationship needs to be cut. It’s that simple.",
            "Reference #2....yes. Neighbors call on domestics ALL the time. I’m a 911 dispatcher and I’d say 90% of domestic calls I receive come from a neighbor. \n\nYou 1,000% did the right thing. Hope you and your mom are ok!!",
            "> I think my dad will beat the crap out of me if he finds out\n\nUh...",
            "100% did the right thing.",
            "You just said he would beat you if he found out you contacted the police because you feared for her safety. Also, chances are this isn't enough to give him a wake up call. Abusers will always abuse, even if they take a few years break from abusing someone.",
            "I called the police when I was a teen and my step dad was beating on my mum. They took him in. Mum and I got away for a bit, then she went back. I moved in with my grandparents. Wasn’t till about a year later she finally came to her senses and got the hell out of there. \nYou did the right thing. I think you need to sit down and have a serious chat with your mum, not about the phone call, leave that out but about the situation. It’s not healthy for either of you. Is there anywhere you both can go?",
            "You should not feel guilty at all, you did the right thing. I am your age, and my parents are separated, but when I was younger and they were still together, I wish I had the guts to call the police when my father would get violent. \nThere is nothing wrong about trying to protect yourself or someone else. \nAs soon as someone raises a hand on someone else, they become an abuser. Even if he calmed down in the end, and I’m obviously in no place to talk about your family, but that is rather what my experience tells me, there is no guarantee a all that he won’t do it again. \nDomestic abuse is something to take very seriously, and you did the right thing. Please, please don’t worry about it. \nAlso, yes, neighbors do call cops on those situations. Not all of them, but they do - at least here in France they do. \nGood luck and please stay safe.",
            "It was the right thing to do, but it would be better if your mom would come to realize that what she is experiencing is not just a small fight, or your father realizing that he raised a hand and punched someone he vowed to love.  That your father have some issues that needs to be fixed,  not by your mom,  but an expert on that field.  Letting someone continue their unhealthy and toxic trait would make things harder and dangerous to your family. \n\nIt is not only your mother you should be worried about,  you should worry about yourself and helping your father get better as a person.",
            "No you should not. You did what was appropriate in that situation, safeguarding your mom.",
            "100% did the right thing regardless of the outcome!",
            "Do not tell ANYone you called. Delete it from the call logs. Play stupid. \n\nI'm going to be honest, and it sucks but I highly doubt I'd this will be the wake up call. If it's progressed this far then there has been a lot going on beforehand. \n\n\nYou did the right thing!\n\nYou protected your mother....and yourself. \n\nTalk to your mom and tell her how scared you are for her...and yourself.",
            "I went through something similar when I was growing up. The last time something like this happened was about 12 years ago and we called the cops as well. Dad was getting out of hand and I had to restrain him and tell my younger brother to call the police. Police show up and my mom says that he didnt hit her and I still remember looking at her confused and like wtf that Is a lie. They didnt do much and they left, but told my dad he couldn't stay there the night. I remember crying myself to sleep that night. In college I had to go to therapy for it because while this was the last time it happened, it certainly wasnt the first. My first memory as a 3 year old or so was watching my mom get hit by my dad and for the longest time I blamed myself for it.",
            "You did well. No need to feel guilty for taking action to keep mom safe. As suggested delete the call log from your phone and sleep well for being proactive. Hopefully, this will be a wake-up call and he will think twice in the future.",
            "This is the kind of thing people get murdered for. Op, even if it seems like your dad doesn't suspect it was you who called the cops on him, he definitely thinks of you as a possible suspect. Keep yourself safe,be on guard.",
            "Don't feel bad. When I was ten my mom's boyfriend beat the crap out of her I took my brother and ran to the neighbors. She didn't leave him. Another time they were telling and I called the cops they came and nothing happened.  A few months later I was was staying at my friend's house for New year's Eve and he killed her. I will always wonder if something different could have happened if I was there  You know what is happening isn't right.  Don't be ashamed of protecting your mom or your self.",
            "I think you did the right thing. Maybe he will think  before he strikes knowing  now that someone the neiggbors..lol called the cops. Dont tell him you did even if he ask.\nI grew up in a home like that  but the nearest  police help was 29 miles away. My father ended up getting killed due to his violence  in our family.  \nWe also lived in a town where a young man shot and killed his father for the same thing. Violence begets violence. Hoping  you will make it out safely when you are an adult. Ps dont tell ur mom either. She may in turn tell him.",
            "The most important thing right now is that you and your mom are safe. You mentioned your grandma on your mom’s side, would you be comfortable confiding in her? As a victim of abuse, it will be hard for your mom to help herself. I would suggest talking to your grandma so that she can help you decide on next steps. The most important things to remember are:\n\n1. This IS your business, don’t let anyone tell you otherwise. The top priority for any parent is to make sure that their children come first. If you and your mom aren’t in a safe living situation (which you’re not), then things need to change.\n\n2. You did the right thing by reporting your dad’s abusive behavior. He needs to get himself some help.\n\n3. You need to be safe. Make sure you reach out to a trusted family member or loved one, again, grandma might be a good choice.",
            "Give the music video for Time by Chase & Status a watch, you're definitely not in an easy spot.",
            "> Should I feel guilty over this, I knew my mom was probably safe at the end as they did calm down, but there was a chance of a futher beating (unlikley)?\n\nNo you shouldn't feel bad. You and your mum were not and are not safe. Your dad hit your mum - he is a criminal and dangerous.\n\n>Will this be a wake up call for my dad, do people realise something is wrong once they get \"a night in a cell\" and try to change themselves?\n\nSometimes yes. Sometimes no it just makes them even angrier and more abusive. It's really hard to say, but you shouldn't count on your dad being straightened out, you and your mum should leave.\n\n>Is it likley that my parents think a neighbour called, as I think my dad will beat the crap out of me if he finds out, do neighbours call the cops on these things?\n\nProbably. They have no way to know who called. Don't tell your mum or dad that you called. I suggest you delete your call history.",
            "Make no mistake, you made the right call.  Be safe",
            "I’m pretty sure that few neighbors would butt themselves into another household’s troubles but those few that would are usually pretty respectable since they had the balls to make sure that their neighbors are doing fine so your parents probably think a neighbor called.",
            "1- No guilt. Your mom was in danger.\n\n2-Neighbors do call on these things. Not all neighbors, but some. I call every time I hear the people across the street get into a yelling match at 3 am on a regular basis because it could escalate further and I refuse to do nothing and risk someone getting hurt or dead.\n\n3-If this is something that happens on a regular basis, then no he wont 'wake up' to his behavior because to an abuser, this is normal behavior. If this is a first time incident, it might help him realize what he did and get him working on rectifying the problem. Because I don't know your family history, I can't say for sure which it will be.",
            "Hey. Just came here to say, yes, we do call the cops on our neighbors. Mine have a 16 year old and the parents got drunk and crazy, and it made me so sick inside that I called the cops on them .\n\nYou did the right thing.",
            "Let them think t was a neighbour. Try and encourage your mother to leave him if it’s safe. Good job for identifying that his was wrong and taking steps to fix it. Too many kids grow up seeing it and accept it as normal",
            "> do neighbours call the cops on these things?\n\nYes. Not as often as it should happen. Too many people don't want to get involved, even when it sounds like someone is in a lot of danger.\n\n> Will this be a wake up call for my dad, do people realise something is wrong once they get \"a night in a cell\"\n\nThis can happen, but I can't possibly tell you how your dad will react. \n\nDo you have anyone local that you can speak with face-to-face about your situation? A school counselor or someone similar? It sounds like your home is unsafe, so you need outside help while you are still a minor.",
            "This is still violence even if he didn't actually hit her. If he threatened to hit her that's illegal. Screaming and yelling even if a punch is never thrown can still be abuse. It doesn't matter that he calmed down before the police got there. That doesn't erase the situation.",
            "Yes, neighbours definitely call 911 about this frequently. And make no mistake, you’re a victim here as well so do whatever it takes to protect yourself!",
            "You did the right thing. As the saying goes,\"An ounce of prevention is better than a pound of cure.\" I would have done the same thing.  And you should talk to your mom, her being beaten by your dad should stop, it's unacceptable. Should it still continue, you and your mom should leave him. You and your mom deserve better,and more. Goodluck",
            "1. Don't feel bad.\n\n2. He will blame whoever is easiest to take it out on.\n\n3. Sorry, but probably not because abusers don't just stop imo. Especially due to a warning.",
            "1. Don't feel guilty over this.  You did what you thought you had to, to keep you and your mother safe.\n\n2. Yes, neighbours absolutely call things like this in.  So play dumb and say you don't know who called.\n\n3. No.  It's highly, statistically unlikely that your father will get a wake up call.  He'll just be more careful to make sure he hits you and your mother where the police can't see.  \n\nOP, you should google domestic violence shelters and start talking to your mother about getting out of an unsafe environment.  Your father is a domestic abuser and not only is it incredibly unlikely he'll change, even if he says he will and things get a bit better for a little while the rate of recidivism for domestic abusers are very high.  You and your mother will be safer if you leave while your father is not home.",
            "You did the right thing OP <3 hope you (and your mom) can get to a better situation soon.",
            "I know you're still too young to be handling such matters but i believe that you could be your mother's heroine. Domestic violence is something no one deserves and no one should be okay with. \nYour mom is a victim and needs your help. She needs to feel security and love and most importantly be far from her abuser. This will be really hard but you can help her get over this. Google domestic violence and how to support and handle situations. You did the right thing by calling the cops. \n\nYour dad probably suffers from a trauma or some kind of psychological illness. He surely needs professional help. But your mom should first be empowered and feel safe.",
            "You did the right sweetie",
            "That's how most domestic abuse cases happen. The abuser gets violent and the receiver calls the cops screaming and crying and when the cops get there they are all loving again telling the cops it was nothing. This happens all the time so calling the police isnt bad it's actually good becuase the police know something is up",
            "You absolutely did the right thing! Domestic violence is NOT EVER OKAY. It is very likely they would believe a neighbor called in a disturbance, so I wouldn’t be worried about that. Please stay safe, I can’t promise that will be a wake up call for your dad because someone who abuses their family won’t stop just because the cops got involved once. If you and your mom need to get out, there are so many resources available and I encourage you to look up ones in your area.",
            "Do everything you can to get out of there at 18. Your mom can't be saved if she doesn't want to. Take care of you first. Like someone else had said, DV creates strange loyalties. What a great example she is setting for you on what's acceptable treatment from a partner.\nRemember to question your attraction to people . Your parents set the standard of \"acceptable behavior\", so it's very likely that you'll seek out abusers in the future as well. It took me way too long to realize that!!",
            "You did nothing wrong. Just be smart and remove any record from your phone (will your phone bill reflect this call?).\n\nYou mother is not safe there and neither are you. Can you move out and live elsewhere?\n\nI'm sorry your are not your parents' priority that's why you must consider yourself your top priority and do what's best for you.",
            "Along with what others have said of making sure you are safe (for example deleting records on your phone of this), honestly, nice job.\n\nIt takes guts to stand up to an abuser. And yeah, you might feel bad about it, but that's because the situation in your family is so distorted from what it should be that you can see it as \"not necessarily worth calling because it was unlikely she'd be beaten more and she was probably safe.\"\n\nI hope the best for you and your family I guess, but once things come to blows it is NEVER fine. Just... never. Abuse is abuse (physical or otherwise as well) and even if they may not know to be grateful for it, or may not know at all (maybe a good idea to not let them know), you've given if nothing else an opportunity for your mom to have a night's peace, and your dad to calm down and possibly reevaluate how he's been handling himself.\n\nTo answer #2 (IMO)- I'd say whether they ask or not, it's probably best to say a neighbor called. They can suspect all they want, but it's a suspicion and hopefully nothing else.\n\nTo #3 would be there's no promises in life, but you've given him a chance to do so. There's that.\n\nAs someone who had similar problems with their family growing up (they split when I was 11 and they're both far better individuals for it though it took time) it's just never okay, and it's never going to turn out okay being left alone like that. It has to change one way or another (hopefully by your dad coming to his senses) because otherwise it's miserable for everyone involved.",
            "1) NO, no guilt required. \n\n2) Absolutely neighbours call for help. \n\n3) Sorry, not likely. In most cases abuse escalates. The most dangerous time is during initial separation. \n\nYou did a brave thing and you are in a shitty place. You shouldn't have to carry this - parents are meant to protect and guide their kids, I'm really proud of you right now, dealing with that level of abuse is frightening. I hope you find a way to GTFO as soon as you can.",
            "Keep us updated and stay safe.",
            "This is abuse :( you did the right thing. I wouldn’t tell your parents it was you. I would seek help from a therapist to talk about your experiences. \nSending you love!",
            "Wow, you are an incredibly brave, self-possessed young person.  I'm impressed with your backbone, and your quick thinking, and I'm sorry you're in this horrible situation.\n\nAlthough calling the police and reporting the problem is always the right thing to do, it seldom stops an abuser.  But what it hopefully does is highlight for your mother that what she is going through is something the rest of the world would take seriously.\n\nI hope you can get in touch with someone from a domestic violence hotline who can give you more immediate and specific support.  They may be able to coach you on how to keep yourself safe in the situation, while hopefully getting your mom safe too.",
            "So this was most my childhood, doesn't make for feeling good and if your nearly 18 i'm guessing they've been in the relationship for at least 20 years, i'm not sure if this is a regular occurrence? If it's new has there been something that happened? More likely is your dad a drinker? If you dad has done this for 20 years, and your only asking these questions and calling cops for the first time now that this can't be something that happens regularly. \n\nIf this is a once off, welll choke it up as that. Yes neighbours generally call if they hear domestic abuse in the higher socioeconomic suburbs. \n\nIf this happens regularly if you cam talk with your mum see if she wants to leave, almost never do they want to leave and often calling the cops will make it worse and generally the wife will need to press charges and want to go to court and follow up the charges on the day which unless she's leaving she wont.\n\nIt really only stopped when I got big enough to take down the old man.",
            "1. Absolutely not. You did a brave thing. Hitting a family member (or others) is not acceptable, unless it’s self defense. \n\nHopefully this is a wake up call for the both of them.\n\nETA: if he hits you for calling, call them again! My dad hit me all the time when I was younger, to the point of leaving bruises, bc he’s a fucking toddler emotionally. I wish I had the foresight/balls to do anything about it but the 80s were different :/",
            "You did the right thing. But as others have said delete the phone call from your records.\n\nAs far as I know, the police cannot tell your parents who called them + it is likely that neighbors call for these types of things, so that could be the rational explanation your parents believe.\n\nDon’t tell them anything and play stupid. I really hope this won’t happen again to you or your mom, at least out of shame from your father because the “neighbors” know what is happening in your household :/ \n\nStay safe",
            "Never feel guilty for doing whats right. Protect yourself hun, dont tell anyone. Neighbors call all the time for domestic dispute things. Hide any and all evidence that youve called, and keep yourself safe. Sometimes unfortunately it isnt always the case for a wake up call to domestic abusers. Some stay that way forever. It might be a mental illness, or something different. Get out of that house as soon as you can though, for your own safety. There are plenty of support subs for abusive parents. Try r/raisedbynarcissists which is a really good support group.",
            "You did the right thing in the moment but if your dad is an abuser (and he is) things will eventually get worse.\n\nYou need to help your mom leave him. And possibly testify against him in court. Staying with an abuser sometimes leads to dead family members, and always leads to traumatized family members in need of years of therapy and usually medication.\n\nGet out now.",
            "Hey! I’m a clinical therapist and I work for an agency that specializes in physical abuse, sexual abuse, and domestic violence. Here’s my advice/answers.\n\n1. No, you shouldn’t feel guilty. If you ever feel you or someone else’s life is in danger, no matter the conclusion of the events, you have every right to call the police.\n\n2. Yes, that’s likely, but it depends. Erase the call form your phone. Just a heads up, most phone companies maintain records of calls made for x amount of time, so it’s still possible he could find out.\n\n3. Maybe. We often see a cycle in domestic violence, which includes the acute explosion (the violent event), honeymoon period, tension building, and then back to the acute explosion. If you’ve noticed this pattern, then my advice would be to seek out professional help.\n\nResources:\n\n1. 911 if there’s ever an emergency. If you feel like you should call but your unsure, just call.\n\n2. National Domestic Violence Hotline: 1-800-799-7233. They have a ton of great resources to offer.\n\n3. Local ACT shelters. Easily to google. They provide case management and therapy services to victims of domestic violence.",
            "not even you did good kid im sorry thats normal for you but thats not what love looks like. i feel sorry for your mom if you ever leave",
            "BY NO MEANS you should feel guilty. You did the right thing trying to protect your mom and avoid possible injuries for both of them.\nIt's always better to ask for help rather than waiting for something horrible that might happen. \n\nI would do the same for my mom. \nI now live abroad and she had to stay in our hometown with my father who has an alcohol issue. I'm so overwhelmingly worried every time I know he's drunk and she's there by herself with him.\n\nI'm proud of her though, there was a moment when she did actually call the cops and they came and let my father understand that one more time behaves like an asshole, they're nearby and they know what to do with him and where to take him.\n\nHe learned the lesson I suppose, so did my mom.\n\nIt's never wrong to ask for help! \n\nBest of luck, my dear. Take care.",
            "NTA. OP, another option is if you have another adult you feel safe with besides your parents, one who would take you in, you could ask that adult to go to court and file an emergency guardianship of a minor hearing (at least that’s what it’s called in my state) in family court (or whichever court is most appropriate at your state. The courthouse would know). With the father’s actions and your mother lying to the police about it, plus your fear of your father hitting you (has he done that in the past?), that may warrant an ex parte hearing and immediate order to place custody with the petitioner as temporary guardian (ex parte means with having the other parties of the matter there). \n\nPlease stay safe OP. Hopefully you’re turning 18 soon and can get out of there.",
            "Get out of that house! You are in danger .Your mom may not be able to leave but she is an adult. Find a safe place to live",
            "Just here to say you did the right thing. I didn’t call the cops when I was younger ( granted i was more like 8-11,\nSo much more terrified) and it ended with me seeing my mom dragged down the hallway by her hair.\nThat’s not something you unsee. \n\nYou did the right thing and you should be proud.",
            "Wow. What a heavy situation for you to deal with :( I'm so sorry you have to go through this.\n\nYou absolutely did the right thing. You are the strongest and bravest of that household. Please take the advice of these people. You keep yourself safe.  And remember; don't let this that you are going through, consume you. Stay safe.",
            "OP, I'm so sorry you had to go through this, I was in an almost identical situation a few years ago with my father. You 100% did the right thing. Please make sure you have an exit plan/ go bag ready if you feel you need to leave quickly. Also if you can do it without being caught, document every instance of abuse you can.  Right it down, record it, report it.",
            "You are a brave young woman and you absolutely did the right thing. I would be honored to have such a caring person, like yourself, as my daughter.  And  I hope your parents realize this, too.\n\nHindsight is always 20/20. When you called the cops you didn’t know how things would turn out - but that doesn’t matter. You were trying to protect your mother and yourself, as you should, especially since it appears that no one else will. I would call the cops every time the situation appears to be heading towards violence, even if no violence occurs. You should tell your parents this. Maybe, they will take a look at how this affects others.",
            "Don’t feel bad for calling the cops on your parents for anything you are worried about. \n\nI’ve called the cops on my mom and stepdad several times when they were drinking heavily at home and started arguments where my SD would punch holes in the walls, break doors off the hinges and it would sound like he could hit my mom. I have a 13 y/o sister who lives with them and I do it mostly for her safety and the fact that I would be in jail if I caught my SD hitting my mom.",
            ">2)Is it likley that my parents think a neighbour called, as I think my dad will beat the crap out of me if he finds out, do neighbours call the cops on these things?  \n>  \n>Should I feel guilty over this\n\nAre you serious ? \n\nNo! of course you should not feel guilty over this. You did the right thing, and even if its hard, its not okay how your dad is treating your mom and if you are afraid of getting beaten up by him then by no fucking means in hell he treated you the right way! Please stay strong even if this is hard and try to involve the cops, neighbours etc. Maybe get help from someone at your school or something. \n\nYou definetly have to take action, when not for your mom then for yourself. Your mom is in love not rational and trying to hold something together which shouldnt. Your dad is abusive. People who are abusive know exactly how they can treat someone maybe frighten someone to stay with him and on the long run it feels good that everyone calmed down and play happy family again but its not. On the long run its not. And your dad was not about to beat up your mom he hit her if she had bruises etc then he already was violent. Help your mom! and first and foremost help yourself! Please! \n\nDepends on your country but i am sure if you google you will find a lot of websites about domnestic violence where you can find help and advises! Please stay save!",
            "I am glad you called the cops. I was so thankful to my neighbours that called the police when I was being attacked. Keep yourself safe. Nobody needs to know it was you. I am glad you are looking out for your mum. It's never okay. See my post history and you can see my situation. Happy to talk if you need to",
            "Abusive people dont just have a moment of epiphany and change their actions. They are the way they are from a lifetime of issues and only long term intense therapy will have a chance at fixing them. Depending how bad they are and if they're sociopathic or not.",
            "You did the right thing.  Do the same EVERY time he hurts ANYONE.\n\nYour dad needs prison.",
            "OP; I was in a similar situation a few years ago. My dad was abusive, and my mom almost never took action against him. It wasn’t until *I* called the police on him one day that my mother got a wake up call and started taking protective measures against him.\n\nYou did the right thing. Now, you need to make sure you are safe and supported. Talk to your mom; try to get her to understand why you called, and how your dad’s abuse is not only affecting her. You’ll probably need evidence of some form, like “he has done x, y, and z to us and it’s wrong and unsafe, we can do A, B, and C to stop him from doing this again and here are resources where we can start.” Consider googling quick info on divorce laws, protective restraints, domestic violence shelters, welfare, etc., because those are things that can and will help you through this. Sometimes people in abusive situations need to know they have a “team” to help them out of it... I was that support for my mom, and you may need to provide some of that for yours. It’s not fair and you grow up quick, but you and your mom will be better off for it if that’s the case. \n\nI would love to hope this is a wake up call for your dad... but it’s probably not. Don’t get your hopes up. Men like this always blame “the system screwing them over” before their own action. \n\nAbove all else, keep yourself safe. If your mom can’t be convinced, go to another trusted adult at school or a friend’s parent or a family member. Have a safety net of a different place to crash and a way to get full meals.\n\nAnd talk about it. Tell your friends. DM me if you’d like. This is a lot to handle at 17 and I’m sorry it’s fallen to your shoulders. It does get better and I hope you find your way out.",
            "How are you doing now? I’m so proud of you for you making that call. I understand how hard it is to report abuse. I know you are scared. Please tell your teachers.  I’ll pray for you.  My heart breaks for you. Stay safe.",
            "OP can you and your mom stay somewhere else??",
            ">Will this be a wake up call for my dad, do people realise something is wrong once they get \"a night in a cell\" and try to change themselves? \n\nit can happen, but i wouldn't count on it.\n\nhas he done this before?\n\nprobably you should follow all advice to get the hell out.",
            "I’m a teacher \n\nDCF (department of children and families - your area might have a different name) needs to be informed immediately",
            "1. never feel sorry/guilty for doing some good. You did the right thing.\n2. when you think your dad will beat the crap out of you, place a camera somewhere, tell him what happend, take the beating, make a copy of the evidence and give it a friend of yours. tell your mom what happened (don' tell her about the copy) and see what happens then. When your mom supports you, go with her to the cops. if she dont... then you have a bad bad situation. Also, could be that your dad does nothing and realizes he is on the wrong path.\n3. depends on the background of the story and if this happen a lot. When eg. your mom cheated on him and he found that out his reaction would be... more \"understandable\" aka it was an effect. When he is under massive stress... maybe some therapy could help. But when he's always aggressive and also maybe an alcoholic, this whole situation could be way WAY worse in the future\n\nGood luck",
            "you are completely right for calling the cops, sometimes i wish i would of done the same thing as you in some situations.  \ndelete your call history! seriously!!!!!!",
            "If your mom has no intention of helping herself, you should move out. Do you have a family member you can be with or a friend? You can file a request to be emancipated and become a legal adult. It’s not a long process. You just have to have a place to live and a part time job.",
            "This will escalate in the future. Take solace that calling the police was the right thing. Hopefully you and your mom can get out of there before it escalates and becomes more dangerous.",
            "1) Should I feel guilty over this, I knew my mom was probably safe at the end as they did calm down, but there was a chance of a futher beating (unlikley)?\n\nis once not enough? I don't know about you, but for me the line for \"safe\" is where you're actually safe\n\n2)Is it likley that my parents think a neighbour called, as I think my dad will beat the crap out of me if he finds out, do neighbors call the cops on these things?\n\nneighbors call, but dad's going to take it out on everyone, and probably test you just to be sure\n\n3) Will this be a wake up call for my dad, do people realise something is wrong once they get \"a night in a cell\" and try to change themselves? \n\nnope. odds are this ends with someone permanently damaged or dead, your dad in jail for 5-20 years, and if your mom survives she'll take him back as soon as he's free. as soon as you're 18 you take whatever you can and go to a womans shelter and get a GED and get a job. they'll try to pull you back into this mess, and if you don't have something worth fighting for (YOU are worth fighting for) you'll end up back in their house giving them all of your money and you'll be stuck again\n\nyou're fighting back so you have a strong chance of breaking free, but you're the only one that's going to have a chance at getting out of the situation. you're going to have to make yourself want out every day, you're going to have to remind yourself why you want out, and you're going to have to keep working at getting out. your mom chose this life, and chose to put you in danger against your will. she'll keep choosing this because when everything is taken into account this is the life she wants and you can't change that. \n\nit's easy to live this kind of life forever. a lot of people get comfortable with it, or wont take the risk to leave. get out of it before your kids have to call the cops. good luck",
            "The fuck should you feel guilty for? Keep on calling the police every time he does something if he does it again. Ideally, try to record his attacks. Get this monster put away for good, behind bars for the rest of his miserable fucking life, which is what he 1000% deserves.\n\n&#x200B;\n\n\\> 3) Will this be a wake up call for my dad, do people realise something  is wrong once they get \"a night in a cell\" and try to change themselves? \n\nNO. Abusers virtually never improve. They frequently get worse. He isn't safe to live with. He never will be. Do what you can to move out the day you turn 18. He is a violent repeat offender and always will be.",
            "You should not feel bad. Your father is the only one that did something wrong. What you did is very, very good. It is princely unlikely that your mother would do it for herself (especially given the fact she lied to the police). You were looking out for her and it this happens again, please call again. Your mother might want up eventually but (speaking from experience of witnessing this from my parents and being at the receiving end with my ex), it won't be easy or fast.\n\nI'm surprised they didn't interview you.",
            "[deleted]",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "8vif0o",
        "author": "handsomehubby12",
        "title": "Me [27 F] with my Husband [28 M] married for 2 years. I got a call from his 'friend' that he has been cheating on me but things don't add up.",
        "url": "https://www.reddit.com/r/relationships/comments/8vif0o/me_27_f_with_my_husband_28_m_married_for_2_years/",
        "score": 2495,
        "num_comments": 257,
        "created_utc": 1530536298.0,
        "selftext": "My husband 'Sean' has always been a huge fitness and gym enthusiast. He is extremely good looking and always has multiple women flirting/hitting on him and this has always been a big insecurity of mine so maybe that's why I am so paranoid.\n\nRecently about 7 months ago a new couple 'Dylan and Flora' moved into our area. They are both 23 and out of college. Flora and my husband met while playing tennis as they both go to the same club and they get along great. I always thought she had a crush on him but as she is(was?) respectful, so I left it at that. Soon my husband invited her to the Gym he goes.\n\nNow, a week ago I get a call from Dylan saying that one of the guys in the Gym had seen my husband and Flora kissing just outside our apartment building. He also gave me three instances when Flora was out and asked whether I could account for my husband. I said I’d call him back so I could check my calendar. I’d been with him all three times. When I called back he said she had condoms in the glove-box of her car and she’d been checking out hotel sites. She’s also very secretive about her phone now. \n\nI went through his phone and social media as we are very open about these things and there was no sign of an affair although they had been texting quite a bit(about tennis etc.) and she has always been very complimentary but my husband has not responded/flirted back. It sounds like Flora is up to something but I pray to God it’s not with my husband. So why phone me? We have very loving relationship and he doesn't strike me as the type of guy who would cheat.\n\nEven worse, the guy called me again last night asking that I go on some sort of stake-out with him. She says she’s away with work next week and he’s sure it’s not true. He’s hoping to catch her at it. \n\nShould I go too and keep everything crossed it’s not my husband? Should I just confront my husband or just lay low and hope for the best. This is tearing me apart now and I have not been able to sleep since.\n\ntl;dr: Friend is concerned that his Gf is cheating with my husband but I am questioning the circumstances.\n\n\n\n\n\n",
        "permalink": "/r/relationships/comments/8vif0o/me_27_f_with_my_husband_28_m_married_for_2_years/",
        "comments": [
            "If you were with him on all the “times he cheated”, and nothing is on his phone, then I would just tell him what people said about him and listen. It doesn’t sound to me like he did anything.",
            "I see two possible scenarios here. \n\n1. Flora’s cheating, but from the sounds of it, not with your husband because you have zero reason to trust some dude over the man that you married. This means that whatever Flora’s up to is none of your business, and you should not get involved in the neighbor’s marriage by going on some bizarre stakeout. \n\n2. This dude’s unhinged with jealousy, and wants to spread his paranoia around by either convincing you that your husband’s cheating, or just drawing you into his irrational orbit by recruiting you into stalking his wife. \n\n\nEither way, you should tell your husband what’s been going on, and stop responding to Dylan.",
            "I bet she's cheating, but not with your husband. He probably assumes it's with your husband because they play tennis together.\n\nDon't go on the stake out. I'm worried he'll try to make a move on you as \"revenge\" on your husband and his wife.\n\nTell your husband everything. Don't accuse him of anything, but tell him what's going on. You two should distance yourselves from this drama-filled couple.",
            "It does sound like she might be cheating.  But no evidence that its with your husband.\nIs it possible that male neighbour has a thing for you? Trying to split you up, using unfaithful wife for sympathy and wanting you alone. Red flag",
            "I think this guy is trying to set you up for something. Stay well away and trust your husband. ",
            ">Even worse, the guy called me again last night asking that I go on some sort of stake-out with him\n\nReally wouldn't advise going on a stake out with a person you don't know very well.  It could turn weird, stay safe!",
            ">the guy called me again last night asking that I go on some sort of stake-out with him. \n\nOh, HELL NO.  This guy has already tried to poison your relationship with your husband and is now trying to get you to be alone with him.  Dylan's got a thing for you and will try to make a move on you (or worse) if you go out on his \"stake-out\" with him.  \n\nThis man is untrustworthy. I'd stop communicating with him.",
            "[deleted]",
            "Either she's cheating on her husband (with someone *not* your husband) or she's being completely normal and her husband is a jealous, paranoid jackass who is constantly accusing her of shit. \n\nOR she's trying to get away from him and her sketchiness is a result of trying to make an escape plan. I doubt that's the case, though. ",
            "I feel like the people in this sub use the word 'confront' way too often when what they really mean is approach and discuss. There is no need to be confrontational at all, especially in this situation.\n\nYou need to tell your husband that 'Dylan' has now called you on several occasions saying that he believes that he and Flora are having an affair. Tell your husband that someone told Dylan that they saw your husband kissing Flora, that Flora has condoms and has been checking hotels out, and that you have confirmed with your calendar that you know there is no way he is doing this but that you are telling him because you are being bothered by the calls and accusations when you are confident he would never do that.\n\nI say to phrase it this way because it sounds like you know your husband isn't cheating, there is no reason to approach it like he needs to defend himself, because he doesn't as he has done nothing wrong. \n\nDo not go on a stake out, talk to your husband. I think it would be best if he limited contact with Flora for the moment so her husband can move on to the next suspect. For all you know she is using your husband as a target for her husband to focus on while she is messing with other men.",
            "Chiming in here to say that maybe it's option C, you don't know this guy that well, are you sure he might not be abusive? Sowing seeds like infidelity to a close friend in order to separate his girlfriend from her friends? Infidelity is a great way to get both you, and your husband away from his girlfriend, additionally, he wants you to help him stalk her. Could it be that he's threatened that she's developing friendships outside of their relationship? Does she have any friends outside of you, and your husband? \n\nBe transparent about all of this with  your husband, don't tell him that you feel this is confirmation of infidelity, but rather, drama that's landed on both of your doorsteps, that is unless you really believe that these stories are valid, but given your experience of being with your husband on the days that this guy is saying he was cheating, it seems pretty doubtful your husband has strayed. ",
            "Even if you *did* think your husband was cheating, going on a stake out with an overwrought acquaintance would be a really bad idea.\n\nIn this case there's no reason for you to suspect anyway. I think you should talk to your husband openly (not confrontationaly) and let him know what is going on.",
            "This happened to me once. My boyfriend at the time “friend” contacted me and said he was cheating on me with multiple women. He asked to Skype with me and tell me everything. I went ahead and he told me things that purely didn’t make sense since I was with him those nights. The next thing I knew he was asking to be my boyfriend and watch me get naked on Skype. It seems that friend of yours has that coming to you. Don’t let it get that far. Just ask your hubby that that guy is suspicious of his girlfriend do you think she’s doing something behind his back? And see his reaction.  Trust your husband over that friend first.",
            "You are putting your marriage in mortal danger by continuing to entertain Dylan's suspicions.  He warned you, you did your due diligence checking your calendar and your husband's phone (sketchy, but I'll take your word for it that he wouldn't have minded).  You found no evidence.  The prudent thing to do is rely on your trust for your husband and drop it.  Staking him out (insanity), checking up on him, or continuing to let Dylan involve you in his paranoia is risking your marriage, and your husband's trust in you.  He would have to be a master deceiver for you to not have noticed anything yet, and for an examination of his private conversations to have turned up nothing.\n\nIn all likelihood, Dylan has been uncomfortable with his wife's friendship with your husband for a while now, and so it was the first place he went when he convinced himself she was cheating.  It doesn't really matter though, because this isn't your problem, it's his.  Tell Dylan to stop calling you and walk away from this mess, before you get caught up in the blast radius.",
            "Stop talking with Dylan and have a sit  down with your husband.  Tell about these calls and ask him about his friendship with Flora.   At very least, it sounds like he needs to dial back his communication with her and actively shut down her flirty behavior.",
            "I think this is a situation where you should talk to your husband asap. Do not under any circumstances go off alone with Dylan. It sounds a lot like he is setting you up for something.",
            "As a married man for two years today I would appreciate if my wife confronted me very nicely and explained everything in detail so that I can be the one to clear everything up. I think you need to explain all this to your husband just as you have here and he will make everything right. ",
            "Since the things Dylan is saying things don't add up (at least, that Flora is cheating with your husband), and you have no other reason to think your husband is cheating, t's time to tell your husband about this. Look, I know you're insecure, and you should get some help with that (like, therapy), but at the end of the day it's up to your husband to be faithful to you. Maybe Flora is planning on cheating with your husband and letting him know now will let him put up some boundaries with her, maybe she is planning on cheating with someone else and all of this is none of your or your husband's business (other than him maybe not wanting to spend time or befriend a person who cheats), maybe Dylan is insecure to the point of lunacy and nothing is going on there at all. I'm not saying you should give your husband blind trust, but the key to being secure is giving your partner the trust they deserve and accepting that if you partner decides to betray that trust, it's on them and not something that you can control. If your relationship with your husband is otherwise healthy and there are no other signs of cheating, and if he loves and respects you, then there's no need to worry about anything other than not letting your insecurity get in the way of loving him.",
            "I would not go with Dylan, who you don't know well, to do a stakeout of your husband. First, you don't know this guy and frankly it could be him trying to trap you somewhere. Or that he's irrationally jealous and those types can turn dangerous really fast. And I say that, because the dates he gives you don't add up. You know where your husband was in those times. You have access to his phone and you see he's not flirting and you see there doesn't seem to be anything there.\n\nYou need to stop talking to Flora's husband and go talk to your husband about this. Frankly, given the lack of evidence and some pretty strong evidence that Dylan is either lying or mistaken that his wife is cheating on him with your husband coupled with his trying to get you alone, I would treat Dylan as the greater red flag. Whether he's legit concerned about his wife or not, you do not know what he may or may not do and things like following and confronting people when one is not a licensed PI can turn ugly really, really fast.\n\nStop talking to Dylan, tell your husband what's been going on, ask him if there is anything going on but reassure him you don't see it. And that he should probably scale way back on his contact with the wife, because Dylan thinks they are having an affair. And you are worried about what Dylan might do if this gets out of hand.\n\nAnd whatever you do, do not agree to meet alone with Dylan or let him into your place or really have any further contact. Unless you're leaving something out, right now I think Dylan is the larger problem.",
            "Tell Dylan to get some photos on his stake out and prove his accusations.",
            "Communication is key. Talk to your husband.",
            "Tell your husband what's being said about him in a non confrontational way. Do not go on a steak out. Tell sketchy neighbor dude you are sorry his wife is sleeping around but you are pretty certain it's not with your guy. ",
            "So if Dylan thinks that Flora is cheating with your husband, telling you about it is:\n\n\n\n1) About showing you respect and consideration, and not leaving you in the dark about a cheating spouse.\n\n\n2) Getting another set of eyes on Dylan and Flora so that the truth can come out.\n\n\n\nIf someone told him his wife and your husband were kissing, he thinks they are cheating with each other.  If it were me I would tell Dylan that I wasn't comfortable going to a stake out with him. I would tell him the times he was concerned about do not match up - you were with your husband, and tell him that your husband is open with all social media, and that while Flora texts him there is nothing there that makes you think they are cheating.  I would ask him WHO saw your husband and Flora kissing as that might give you a better clue as to what is going on.\n\n\n\nI wouldn't go on the stake out.  I would ask Dylan to leave you out of it unless he was sure it was your husband, as you don't think it is with the addition that you would let him know if something changed.  Dylan is probably in the worst pain of his life right now, and the person that he trusted the most is being dishonest with him. \n\n\n\nTelling your husband?  I actually wouldn't yet.  You aren't staking him out. You don't think it was him. He *does* have a friendship with Flora though, and if he tells her, then he gives her the power to keep hiding things from Dylan.  This is a real possibility as you think Flora is up to something.   After you find out *who* the person that saw them kissing is, then bring it up with your husband.  If there is a *who* at the gym that is causing trouble in your marriage then your husband is going to have to make some changes with his gym/friendships.  If your husband's friendship with Flora is causing you trouble in your marriage (it is now) he is going to need to make some changes there too.  If there is truth to the kiss/cheating claim, I'm so sorry.  If there isn't, you two still have a lot of work to do because someone out there is willing to lie to mess with your relationship and you need to figure out who that person is and block them out.\n\n\n\nIf it isn't your husband, well, it isn't uncommon for a cheater to throw an innocent person under the buss to help hide and protect their affair partner.  Flora may have very well lead Dylan to believe she was with your husband when she wasn't.  I've been cheated on, and this was the tactic used to hide it from me.\n\n\n\nTrust but verify, then talk to your husband about what changes need to happen to get these people out of your marriage, if nothing is going on.",
            "What did your husband say when you had a conversation with him about it?",
            "> So why phone me?\n\nDylan doesn't have all the information. He's making what he thinks is a logical inference. It appears he might be off-base about your husband being involved with Flora (though he might be spot-on about Flora engaging in infidelity).\n\n> Even worse, the guy called me again last night asking that I go on some sort of stake-out with him. She says she’s away with work next week and he’s sure it’s not true. He’s hoping to catch her at it.\n\nI would wish Dylan the best of luck, tell him you're confident it's not your husband at this point, and let him know that if he has photographs of your husband or otherwise observes your husband on his stakeout, he can let you know then.",
            "Honestly, there’s a lot of good info here. But as someone who has been cheated on, as horrible as it is, it’s worse not taking the benefit of the doubt that your spouse is being open and honest with you. 7 years is a long time and if my lady went through my phone and had three examples of some guy being a liar I’d be pissed you didn’t believe me. I would question our relationship because you took the word of a stranger in a matter of moments instead of just asking me. There is no confronting until you have real evidence, that’s letting your fear guide your thought process not your logic, your trust for your partner should be paramount. Which begs the question do you? \n\nYou seem very nice and sweet but fuck this guy hitting you up. It’s super shady, if he’s so convinced his girl is cheating then that’s his business and he should break up with her not dragging you into his drama. He’s not being rational and I think you should listen to these people saying “talk to your man.”\n\nYou got this girl ✊🏼\n\n\nI wanted to add I’ve had issues of my own recently where I was concerned about cheating but they are momentary when you talk to your spouse and you walk talk yourself through your fears and worse case scenarios. Things sort of open or clear up. ",
            "We need an update to this ",
            "Tell this nut to leave you alone.  Your husband is accounted for, so this dude needs to look elsewhere",
            "Is he good at tennis? What about her?",
            "DO NOT go on this stakeout.   This guy sounds insane. \n\nHis wife may or may not be cheating on him.  He may or may not have noticed she likes your husband and he's trying to blow up his life. He may or may not be a psycho himself and trying to convince you that your husband's cheating so you and he can \"revenge cheat\". \n\nEither way you need to have a conversation and tell your husband what this guy said.  Either he is cheating, in which case who cares, or he needs to know that he's being cast as the \"villain\" in this guy's psycho drama reality show and needs to be on his guard against whatever nuttiness is happening in their marriage. ",
            "Approach your husband however you think it best, but there's no way in hell I would go on a \"stakeout\" alone with this Dylan dude. Yikes. ",
            "Don't go on the stakeout and don't confront your husband. Simply leave Dylan alone and if you feel that you have to text him back only text as if you don't believe what he's telling you in a way such as (It's not my husband, probably some guy that looks like him). \n\nLet him do all the footwork, if he provides concrete evidence of his own accord(if it's true, he will provide you concrete evidence as he'll want someone on his side unless in the rare case he is threatened...) then you can take things from there and decide what you want to do. That is what I suggest. \n\n(Also, don't confront someone when it's just the two of you alone. Make sure you're out in the open, people around...and don't be hostile or jump to conclusions etc.)",
            "I really feel that you should have brought this to your husband after the first phonecall.  Either you trust him or you don't.",
            "I would talk to my husband about it. I would tell him that clearly their relationship has issues and that you don't want either of you to get caught up in it. Let him know that you feel you two should distance yourselves from them. Tell this friend that you will not be going on \"stake outs\" with him but will instead be spending time with your husband. ",
            "It is possible that Dylan is jealous of the gym time Flora is spending with your husband and is trying to drag you down with him? Maybe he’s into you, if you know him at all? If it’s not adding up, just talk to your husband, but don’t accuse him of anything.",
            ">one of the guys in the Gym\n\nWhich guy?  If Gym Guy so readily notified Dylan, he'd tell you too.  I'm betting Dylan is making this up and won't give you a name or contact info if you ask.  None of what he's said matches up to reality.  Dylan is likely a nutjob.  Do not get into a vehicle with Dylan.",
            "It sounds to me like if Dylan really just wanted you to know the truth, and cared about the real truth, once you told him that you could account for your husband, he should have moved on. He sounds like he just wants to take a healthy couple down too. Maybe he's jealous of your healthy relationship.",
            "Perhaps it’s one or more of the following: \n\n1. Maybe Dylan is the jealous possessive type. \n\n2. Maybe Dylan has his own agenda. \n\n3. Maybe the guy who called Dylan has his own agenda. \n\n4. Maybe she is cheating on him but not with your husband. ",
            "To be fair, I would be at least a little suspicious about the claim that someone saw them kissing, but the fact that he asked you to account for specific times and you could is a point in your husband's favour. That said, saying \"we're in a loving relationship and he doesn't strike me as a cheater\" is a bit of a moment of putting your head in the sand. I'm not saying everyone cheats, but anyone can cheat, and a lot of people are very good at hiding cheating, and cheating can happen in an otherwise happy relationship sometimes. So him striking you as loving and not a cheater doesn't mean much. It does mean a little, though. I do think your husband cheating is the least likely scenario here, under Flora cheating with someone else, Flora not cheating and this guy being a suspicious bad boyfriend, and even under this guy trying to ruin your relationship specifically for some reason (Flora having a crush on your man, wanting to ruin your man's life for it, ect).\n\nPersonally, I'd confront your husband, but not from the angle you're thinking-- tell him how Dylan accused him of having an affair with Flora and how he's tried to convince you to take part in a cheating stake out. Tell him you want the pair of you to distance yourselves from these weirdos because you aren't comfortable with them right now. Tell him Flora is flirting and knowing that she might be cheating on Dylan makes you a bit uncomfortable with her, and the drama the both of them or just Dylan is stirring up is something you want to stay out of their lives because they're trying to drag you two into their relationship problems and that's not a worthwhile friend. And then consider his reaction and whether/how much he reduces contact in light of this before deciding whether your husband has behaved suspiciously.",
            "Umm this sounds bad. Not from your husband, from that dude. I wod tell your husband and drastically lower your contact with that dude.\n\nWhatever Flora is up too, is kinda not u our problem and that dude seems to want you to get in on his stalker trip. I would stay away. This has no good outcome for you. ",
            "Flora is probably cheating but maybe not with your husband.\n\nI wouldn't go to this stakeout with Dylan. I would probably talk to your husband, though. Tell him what Dylan told you.",
            "In these cases, talking is best. \n\nMaybe your husband is cheating. Maybe he isn't. Telling him that someone saw him kissing Flora will be very revealing, I bet. You know your husband and what his normal reactions are to guilt and difficult discussions. \n\nThe stakeout is a bad idea if only because, if your husband isn't cheating on you, then you're the one being shady and disloyal. If he finds out, the trust on his side will be severely damaged, as it should be. \n\nDylan may have read the texts between your husband and Flora, concluded they are cheating, and invented that story to bait you into helping. Or he's being honest, but the guy who told him mistakenly IDed your husband, Flora or both. There's just not enough information to think the worst yet, as I know you realize, so that merits a chat rather than going full PI or divorce mode.\n\nGood luck!",
            "It's possible that the times he is telling you about that his wife was with your husband are because of his heightened paranoia. The affair could still be true, but he is now viewing every time she leaves the house as her being with him and he just doesn't know about the times that she really is. As far as seeing nothing in his phone, it is possible he just deletes his end of the conversation out of the text chain. I am not saying he is cheating, but I wouldn't use this as your basis for it being impossible. I would bring this all up to your husband and gauge his reaction. If you go all crazy and go on this stake out, you might damage your relationship for no reason.",
            "It sounds like Flora's partner also noticed her crush on your husband, and is assuming since he believes she's cheating then it must be with your husband.\n\nDo not agree to go on the stake out. You're putting yourself in a vulnerable position with a man who's angry at his partner and who may try to pressure you into \"revenge sex\". If he wants to stalk his partner, he can do that on his own.\n\nYou should sit down with your husband and tell him what's going on. Don't confront him, just be open to how he reacts when you tell him what's going on and go from there.",
            "Trust your gut (and trust your husband) then cut both Dylan and Flora out, they are a heap of drama that poses a danger to your happiness. They just aren't worth the headache.",
            "I would be extraordinarily hurt if my husband went on a 'stakeout' to catch me maybe doing something wrong instead of just talking to me. ",
            "In my opinion, your husbands probably innocent. You mentioned you noticed Flora had a bit of a crush on your husband and maybe Dylan noticed it too. If you’ve found no evidence on your husbands side showing he’s cheating, odds are he isn’t. Flora may be cheating, but she’s probably a flirt with a lot of men, not just your husband.\n\nI’d tell your husband what Dylan has said, but that you don’t believe it’s true. Be open, and honest. Odds are, he will stop talking to Flora — I would. ",
            "Your question is \"should you go with Dylan\" on the stake out?  If your husband is the trustworthy guy you say he is and you stake him out and it's not him and he finds out he will be furious with you.  If Dylan proves it's your husband he will tell you and then it will be your husband who will have to talk.",
            "Please just tell your husband like you told strangers on reddit. He deserves your trust. Hasn't he earned it? Haven't you earned his? He trusts you to tell him things like this. This isn't something to test him with. Just tell him what the guy said and what he wants from you. Make a plan together to deal with it together. At this point, you have absolutely no reason not to trust your husband. You even looked for evidence and didn't find any. \n\nDon't risk complicating your marriage for a couple of insecure kids.",
            "I would be upfront and honest to your husband about what’s been going on, and definitely tell him about the stake out Dylan is planning. I don’t get the feeling that all will end well if you and he are out spying on her, and it may make you look guilty of cheating too. Sounds to me like your husband is most likely innocent, other than being very attractive and probably some innocent flirting, and that Dylan is trying to make you believe your husband is guilty so y’all can be in this spying game and possibly “I got cheated on” situation together. ",
            "Dont go on a stakeout. If hes not cheating and he found out you went to such lengths to catch him, it would be devastating to your relationship. Youre both adults. You can either confront him or look into it on your own without Dylan. ",
            "\"I'm sorry you think your wife cheated on you, but she's not doing it with my husband. Have a good day!\"\n\n<Beep, beep, beep, beep, be->\n\nAll you need to say.",
            "Talk to your husband, openly, lovingly. Dylan has an agenda, it’s not yours. Tell your husband about the phone calls and about the stake out stuff. I feel for you, it sounds very intense. Be clear, that the scenario sounds crazy and made you feel insecure. Time out away from them is what I’d suggest. ",
            "All signs point to the obvious fact that your husband isn't cheating on you. You also know going on a stake out with \"some guy\" is a horrible idea. My  question is why are you posting all this stuff to begin with? Are you leaving something out? Why are you questioning his loyalty when everything you've posted says he's a good guy and it's not him? Just wondering ",
            "When someone introduces doubt and insecurity anything can look suspicious. You owe your husband first loyalty not this girls partner. You need to tell him about the weird call and quite honestly that might be the solution to having her slow down on texting and talking to your husband too much. ",
            "Do not even think of going on a stake out, that is crazy",
            "This is a little out of right field, but he could be doing this to try to make you vulnerable so he can get with YOU. For some reason that popped in my head. ",
            "If you trust him, talk to him and tell him everything.  You will most likely learn the truth from his reaction.  My guess is that this is a case of mistaken identity. It is possible that Flora is using your husband as an alibi when meeting other men.  \n\nAlso Dylan might need your couch for a bit.  And a divorce lawyer.",
            "I think Flora's Husband is hitting on you. I wouldnt get in a car.alone with him. Tje next.thing yku know, you are being accused of cheating.  On another note, how well do you know this couple? The friends I have are ones I have had for years. ",
            "Don't go anywhere alone with this guy. His story does not add up, his excuse to get you alone is flimsy, and it's a classic cheater move to tell tales about how terrible their marriage is which makes the cheating ok. \n\nMy money is he wants an affair with you and is incredibly clumsily trying to manipulate you into it. \n\nThat's the good scenario, the bad one is he's trying to get you in a position where if he does something you end up feeling like you can't tell or he's got \"she asked for it and now regrets it\" deniability.\n\nEither way, don't give him the opportunity. ",
            "I would tell your husband everything that has happened, say that it's weird and you would prefer he not hang out with her anymore.",
            "Not sure if anyone has already asked, but I'd love to see an update when you've talked to your husband! Good luck with the situation and I'd advise like most people here, to just openly talk to your husband and give him the benefit of the doubt. Don't keep this to yourself.",
            "[deleted]",
            "I would raise the “one of our neighbors said you were seen kissing the girl” thing.\n\nThen follow up with a “I’m no longer comfortable with how close you two are / how much time you spend together”.  Because, you clearly aren’t (nor should be, but that’s my opinion)",
            "The problem here is that you are insecure. You don't trust your husband, and you added fuel to Dylan's paranoia fire by engaging with him in multiple conversations. Now you are on reddit asking if you should go on a stakeout.\n\nYou have to fix the insecurity. That doesn't mean you have to turn a blind eye to any signs of infidelity, but so far you have no reason for concern. Dylan's \"proof\" turned out to be garbage, but instead of telling him to go away, you are now considering continuing down this investigative path.",
            "I hope the woman I marry trusts me more than a random neighbor. ",
            "Don’t team up with this guy!! If you’re uncomfortable with his friendship with flora, tell him, and ask him to stop hanging out with her so much. I think it would be a good idea for both of you to back off from the friendship anyway just in case Dylan is unstable. ",
            "Sounds like Flora is cheating, but probably not with your husband?",
            "If you believe in your husband, tell him what's going on.  If you were with him the times the other guy said his wife was out, then she's probably cheating, just not with your husband.",
            ">he doesn't strike me as the type of guy who would cheat\n\nIs this really all you know about the commitment to monogamy your husband has made to you? What have you two promised each other? What have you talked about? What has he said about feeling attraction to people outside your relationship? How's your sex life? Are Dylan's fears bringing up a different issue for you?\n\nIt seems pretty unlikely Flora's affair partner is your husband given what you know about Dylan's suspected times. It's also possible Dylan is making this up entirely, for mental health reasons or just as a jealous and possessive person. I would offer emotional support to Dylan, but not go along with his \"stake out\" and encourage him to approach his issue from a different angle.",
            "Yeah this sounds like a whole lotta ‘not your problem’. Tell him he can stalk his partner by himself if he feels the need. Or hire a PI or something. Just stop bothering you cause you clearly aren’t involved.",
            "They could be helping husband make it look like she is cheating?",
            "I don’t know Dylan, but it sounds possible that he suspects Flora of having an affair and is paranoid about your husband’s friendship with her (as you mentioned, he’s very attractive). It sounds like your husband isn’t having an affair with her. The invitation to go on a stake out is suspicious, although he could just be seeking someone to go through a potentially unfaithful spouse with. I’d trust your husband and tell him what’s up.",
            "It's possible that Flora is cheating with multiple people. Kissing OP's husband and going out on dates with some other dude.",
            "Just lay low for now. Let dylan take on the drama of finding out what is going on. Win win either way. Worst case, it is your husband she is cheating with, and you avoid the drama of catching them in the act, dylan get to bear that.\n\nmiddle case is you dodged the bullet of being the akward random person there when the stakeout busts her with some random person not your husband\n\nBest case is there is no cheating, Dylan is nuts, and you just did the right thing by ignoring the drama.",
            "This sounds like a bad movie plot. \n\nIf I were your husband, I’d want to know about this dynamic\n\nIf you were this woman and your husband was calling up people and planning stakeouts, would you find this attractive?\n\nI’d probably cheat on him. Too much drama. Tell your husband what’s being shared in a way that keeps you on the same team - 2 sane attractive people that people want to spend time with some of which are cool and some not so much. \n",
            "If you’re seriously concerned about your husband than you should ask him! It looks like all of the information you have is pointing to him standing by you, asking him and maybe telling him to be wary of this chick who may have different intentions than he does seems like the right move in my opinion. ",
            "If you don't think your husband is involved, you should definitely let your husband know the friend is saying this. Things could get real bad real fast.",
            "It sounds like Flora may be a cheater, but not with your husband. You should probably just be upfront and ask him. There's no need to be accusatory, secretive, or go out on \"stake-outs\". Just tell him that Dylan called and had some concerns about Flora. \n\nMaybe he has some more insight than you do. It's also perfectly possible that Dylan is trying to strike up drama or is just jealous of Flora. In which case, it would probably be better if Flora knew anyway. ",
            "If you have no signs via various communication you snooped on (I mean that neutrally), I don't think there's much for you to worry about. Or at least, there's no reason for you to involve yourself in a stakeout or go out of your way to check in on your husband. \n\nFrom the sound of it, it seems like Flora *may* be cheating, and Dylan, not knowing who it is with, has picked your husband as the most likely culprit. It makes sense from his perspective given that your husband is good looking and he and Flora have regular means of meeting up, plus they communicate often. My guess that the stakeout is partly so Dylan can make a move on you. Cheat with each other because *obviously* both of your SOs are cheating!\n\nI've been in your husbands shoes three times. My now-ex from a few years ago had a best friend that told her I was cheating when I wasn't (friend actually liked me). With another ex, her shitty friends would constantly make remarks that I was flirting with other women. Then a few months ago, the former BF of a lady friend told my girlfriend me and another woman were being inappropriate (which was hilariously ridiculous for stupid reasons). \n\nYou've checked his social media. Nothing. You've checked his phone. Nothing. You've checked your calendar for three specific \"suspicious\" nights, but nothing, because you two were literally together. You currently have no proof and no actual reason to doubt your husband, except for the ramblings of a man in desperation due to his likely cheating SO. \n\nAs for what you should do now: Obviously, you don't hang out with Dylan one on one. I can see why you wouldn't want to tell your husband, since doing so would tip him off if he was actually cheating, but if you trust and believe in him, then I think you need to show it. I would want to know if some dude was trying to break up my relationship, which is what Dylan is doing. ",
            "Just talk to your husband and be straight up about it. Who cares what the other girl does, but if it is bothering you that much don't hold back. That'll become toxic and even if it isn't true you may convince yourself it is. ",
            "Dylan could be trying to set you up to do some pretty nasty things to you and “get back” at your husband since he thinks he’s the one Flora is cheating with. Don’t go. Talk to your husband.",
            "Ignore your “friend”. \nDo not have any further discussion with him about it. If he calls it goes to voicemail, post the first text where you tell him you’ve discussed it with your husband and he needs to talk to his wife, texts go unanswered \n\nTell your husband the story and to please be careful with his personal safety. \n\nIt sounds like your husband has a better friendship with Flora so leave it up to him if he wants to tell her what her husband is doing. His current insane behavior and possible volatility needs to be taken into account when making that decision. \n\nEdit: to reiterate what another poster said you need to work on your insecurities. Your husband chose and loves you for a lot of reasons. I’m sure he generally makes great decisions. What makes you think him deciding and committing to being your partner is a bad one? ",
            "You don't have to go on the stakeout, you just have to be with your husband when the stakeout's supposed to be.\n\nLet him know what you know: You were with husband all those times he mentioned, phone doesn't look suspicious, she might be cheating but you don't think it's with husband, and you'll be with husband during stakeout.",
            "Sounds like she's cheating but not with OP's husband.",
            "If your husband isn’t involved, tell your husband what’s going on... then remove yourself and him from the situation.\n\nTell him to cut contact with her as even if he’s not involved... the other guy is probably telling everyone your husband is fucking his wife.  And ruining his marriage.\n\nIf you don’t want a shit ton of rumors.... you need to tell him so he can cut her out of his life.",
            "Let the guy do the stakeout and see what he says. Make plans with your husband for that night. See what happens from there. After that talk to your husband about it. Doesn’t sound like he’s guilty and she could be cheating with someone else or the guy is lying. Not sure why he’d lie but it’s possible.",
            "let him go himself and get photos/video",
            "It sounds like Flora is definitely cheating, but if your husband is accounted for all those times, I would honestly just mention this whole scenario to your husband and see what he says. His reaction should tell you if he’s guilty or not anyway.",
            "You haven't told your husband yet?? This is getting far too deep in events with this neighbor you really don't know that well. Tell your partner. \n\nIf I was your partner and my hands were clean, I'd be very upset you haven't gone to me yet. Do not go out on a secret ops mission fueled by anger and jealously with a stranger behind your SO's back. It's ludicrous.",
            "Sounds like he's probably cheating, get out of there asap!!! You deserve better!!!",
            "Whatever you do, don't go on the stake-out. It'll likely create problems where there quite possibly were none, if your husband finds out.\n\nBut you say it's tearing you up, so yeah have a conversation with him. I just wouldn't accuse him because that could create unnecessary problems between you if he's innocent.",
            "If you cant sleep with this, just talk to him or confront him. If he is lying, probably something escapes.\nSorry about my english, i dont speak very well. ",
            "Give your husband the benefit of the doubt, especially if he hasn’t given you any reason not to trust him. Just be open and talk to him about the phone call and see what he says.",
            "It really doesn't sound like your husband is cheating. It sounds like Flora is cheating, but I doubt it's with your husband. Sit down and talk to him about it, tell him what you were told. See where it goes from there. ",
            "Dylan is trying to get with you, and using his wife as subterfuge for spending time with you. Hence the invite to a “stake-out”. ",
            "So what did you decide to do OP?",
            "She's cheating, just not with your husband.\n\nIf you checked and you were with him all 3 times, it's obvious that some cheating is happening, but your husband has nothing to do with it.",
            "Use the info you have. Invite you husband  out while this “stake out” is going on. Validates your trust and he is not involved, protects you from jealous stalker. Flora has to speak for her own actions.",
            "If you are reading any texts on your husbands phone (if yr married, your phone and privacy are your spouses, you share a life and your body you better share phone conversations too) from any female that is \"flirting\" or anything making you uncomfortable....you need to speak up and tell her she is out of line. \nAs for her husband, why would you be alone in a car at night with a man you barely know? Maybe he just wants to get in your pants (willing or not) and this is his way of doing it  by fabricating this story? Be careful please. Go on a stakeout sure, but on your own in your own car with doors locked. \nEdit: spelling",
            "Just talk to your husband and tell him what this guy has been saying, you’re just going to make your self worry and anxious unnecessarily if you don’t speak up! ",
            "Sean sounds like a great dude to me",
            "Tell him that he can go on his stake out without you. Ask him to take pictures and send them your way. If he's not willing to send pictures, he'll likely realize that it's not your husband and not your issue OR he's being hella sketchy ",
            "She sounds like she’s cheating, but not with your husband. He was with you on all the alleged occasions plus he has no incriminating evidence on his phone (also, kudos for having an open phone relationship with your husband! We are like that too and it’s very comforting). If he had deleted his text message history with flora, then it may be a little more suspicious...\n\nI say talk to him about the accusations and make sure he knows that you trust him and don’t believe it’s true. See what he has to say, then ask him for advice on what to do moving forward.",
            "Nooooo bad idea. Don’t go, it sounds like a terrible idea. Let him ruin the trust in his marriage by himself . It sounds like his wife may be cheating and he’s assuming the man is your husband because he lives in close proximity, he’s attractive, and they’re friends.",
            "Hi, \n\nI think your action should depend on your personality. You are saying that you cannot fall asleep, since you know that your husband may be cheating, so I believe you should make it clear for yourself, be sure for 100&#37; and it will not bother you anymore. You can be wrong or you can be right. I understand you don’t want to start this ”investigation” because it doesn’t feels right, but for yourself I would do it…\n\nHope you will get good news and good luck!\n\nElisa",
            "If she’s known to be seen working out with him it’s very possible she brought one of her other men this time and the guy that saw them kissed just assumed it was your husband. ",
            "Speak to your husband in a direct but no accusatory way. Do not go on some stakeout.",
            "Someone told Dylan your husband and Flora were kissing. You need to find out if that is true. ",
            "WATCH OUT. \nThere's no reason to not trust your husband. You checked twice and both results were negative.    \n\n Flora is up to something maybe. But Dylan seems to want to split you and then go out with you.     \n\nThink about the probability of \"he cheated on you so if you cheat is not wrong\".   \n\nIgnore that guy and trust you man. He did nothing to betray your trust. \n\nEdit: formatting",
            "if I've read this correctly:\n\n* He says *someone* saw them kissing\n* You were with him when the BF says he thinks his GF was cheating\n* You found no evidence of cheating\n* The BF says he found condoms in his GF's car\n* The BF called you up to go on a 'steakout'\n\nI'd 'confront' your Husband and by that I mean tell him whats been said to you - this could go one of two ways\n\nA) He is upset you felt the need to even check those 3 times\n\nor\n\nB) He dismisses it as there wasn't anything going on\n\n\nmy odd gut feeling is that you ***shouldn't*** go on that stakeout as i think he may want to try coerce you into cheating & he's tried to implant that you've been cheated on",
            "The guy calling you has paranoia and wants to drop his luggage on you.Here are my suggestions:\n1. He knows that his wife(Flora) is cheating but doesn't know who she is cheating with. And he really wishes that your hubby was involved so that he could have a sweet revenge.\n2. He literary wants to be with you and he is playing the Flora card to set you up straight.",
            "He could be. It's always a possibility. ",
            "As long as you don't have a strong feeling \\*yourself\\* that he's cheating... Unless ofcourse someone close to you that you fully trust who had said that. I would rather confront him on... ask him directly... don't go around his back being suspicous and checking him out / staking out...\n\nActually, I wouldn't have checked his phone either. But of course, since you have already agreed with each other that that's okay, then that would be okay I guess...",
            "I read through some comments and I really hope OP sees mine. My vote at the moment is don't trust your husband or the other guy. Don't go on the stake out but don't confront your husband. I learned a long time ago that if a man is cheating he will cover his tracks. Or he wants to be caught. \n Either he is or he isn't cheating.\n Do your own investigating. Look at the phone records and make sure there is deleted messages. Check his app history and make sure he isn't using another app yo message her (like kik or whatsapp). Follow him a few times or show up to where he says he is at. If your husband is cheating the best thing to do is catch him. He obviously isn't going to admit to it if he really is and you have no proof. \n\nBut I don't like how the neighbor invited you to a stake out. \nDo your own.",
            "Some people here are being far too indulgent. If it got to the point where you had to go through his phone and still couldn’t find any hint of cheating, then you’ve let your suspicion go too far. This is the kind of distrust that ruins relationships. Dylan is being probably being cheated on, just not with your husband. ",
            "If you want the paranoia route: hire a PI to tail the other wife. Photos and all that fun. It will answer multiple questions all at once.",
            "All I hear is, you don't go to the gym with your husband and you don't play tennis with him leaving the door open to sit fillers. "
        ]
    }
]