[
    {
        "post_id": "fvczfk",
        "author": "DoctorDog22",
        "title": "My dad (71m) died yesterday and I'm (27m) scared of the future",
        "url": "https://www.reddit.com/r/relationships/comments/fvczfk/my_dad_71m_died_yesterday_and_im_27m_scared_of/",
        "score": 2494,
        "num_comments": 86,
        "created_utc": 1586089367.0,
        "selftext": "\nTL;DR my dad died and I'm scared my family won't get along \n\n\nI'm sorry if I begin ramble typing this is like one of my first posts on any sub reddit and I am just overwhelmed. So yesterday after my dad comes home he eats what my mom made for him. Eggs and spam. \n\nTo be clear, he has a pre existing medical history of high blood pressure and gout. First found out when he was admitted to the hospital in 2015 when he fell ill and we basically had to force him to go to the hospital bc he didn't wanna go. He was put on medication since, with changes to them maybe a year or so ago.\n\nSo back to when after he ate. My half sister heard a thud around 740 ish and told me to check bc she thought maybe my parents are arguing. I go down and see my dad on the kitchen floor w my mom behind him a few feet away and I hear him snoring. I ask my mom a question get worried run back upstairs and knock on my sisters door. She calls my other sister and also tells me to stop wasting time call 911. I was scared and frantic I wish I called 911 or saw him when he came in so I could maybe have called sooner...\n\nThey get frantic too and we all start yelling at each other and I try to maintain order also as I'm talking to 911 person. At some point in all of this my brother in law yells for help and I help him turn my dad onto his side bc he said he could choke on his saliva. My dad stops snoring and we start panicking. The ems tells us how to perform cpr but my sisters keep yelling and so I try to get them working together. They finally start working on it one is doing compression and the other giving him air and sometimes rotating. Fire dept and ambulance gets here and they start doing the same thing but also have defibrillators and honestly I'm just in shock still. It was maybe 8:03pm when they came or so i dont remember it's all a blur I checked my phone for time stamp but I called twice so I forgot when original call was placed. \n\nThey called it at 8:50pm and I just begin to lose it. My aunt comes and my sister is trying to call my dads work to let his bosses know...\n\nWe talk about how we want my dads arrangements and agree on cremation bc we dont have the money for anything else but also my sister wants the remains. \n\nHonestly. I wrote this post bc I'm scared for the future. My mom is bipolar schizophrenic and my sisters and bro in law dont get along w her because of a whole history that would keep you here forever if I tried to type it. My dad was a big shit talker but he still chose us and tried his best to provide regardless of his fallacies. He had my mom's back too saying he wouldn't kick her out or place her in a mental home.\n\nMy sisters kinda want that (I think) but I'm scared to talk about it. My mom is ok sometimes but also acts up bc of her mental illness sometimes and my dad and I were her constants regardless of what happened. My mom is old and still wants to benefit from some social security services that my dad had but my sisters (and i) think we should get a majority control of his account bc theres a lot of renovations to be done bc he ignored upkeep of the house for a number of years (example, the roof) my mom is not very sad about the ordeal bc she had a long history of mental abuse from my dad and I understand but we for some reason stayed together. Idk how to move forward except for one moment at a time and I'm still waiting for funeral home to come pick up his body (its 8:13 am now, been waiting since night before) and I have been crying but also I can't sleep and I'm sorry if this doesn't meet guidelines I just need to vent even tho I told a few friends I'm still in disbelief. I'm sorry to write so much I just can't help it. Idk how this will work moving forward. I believe it can though. But it's hard to stay positive",
        "permalink": "/r/relationships/comments/fvczfk/my_dad_71m_died_yesterday_and_im_27m_scared_of/",
        "comments": [
            "People react to grief and loss very differently. You are going to see a lot of emotions being worked through and buried problems being brought up, and you will absolutely see a lot of anger. \n\nThe ‘snoring’ was agonal breathing, it often happens after heart failure. **He was not taking a breath**, his lungs were only reacting to his brain firing all shots before giving up. He was likely dead before he was moved to his side, long before the CPR. \n\nDo not blame yourself. You couldn’t have called 911 before it happened, and that would have been the only way to save him from cardiac arrest. You did not waste time. You did not cause it to happen. You reacted, and you gave good directions on CPR to your siblings. You did everything right. \n\nYour family will either splinter apart, or come together. Some members might use his death as a way to cut the final tie to your mother. You can still have a relationship with all of these people separately, you do not have to choose sides. Do not take on the responsibility of keeping everyone together. Take on the responsibility of healing yourself. You need to look into therapy because you were there when it happened and trust me, it effects you. Even if you feel numb now, you will need to talk this out. You cannot control how others react, you can’t control who supports who, you need to make sure you are okay before you try to help anyone else.",
            "If your parents were married, your mom will get control of the Social Security money. That's not something to argue over, it's just a fact. \n\nIf your mom has untreated mental illness, you can try to get her help. If she refuses you might be able to get her put on a psychiatric hold, but I'm not sure there is any way to force her to comply with taking her meds in the long run.\n\nConcentrate on the things that you can control: your behavior and your reactions to other people. You will cry eventually. Grief takes its own time and is different for everyone. There is no right or wrong way to grieve as long as you are not hurting anyone in the process. \n\nGoing second by second is probably the best thing and you're doing it. I'm so sorry for what you're going through. It must be so traumatic. Be kind to yourself.",
            "Get some counseling. Even remote counseling if you are in quarantine. \n\nYour family sounds toxic and disfunctional.\n\nIf your mom is has untreated or unmanaged mental illness a home is probably the best place.  It seems like your family likes to ignore problems rather than address them.\n\nNobody will be able to place her there against her will unless you do a long drawn out process. These homes are not nightmares. Lots of them are nice and most people in them would die if left to their own devices.",
            "You don’t *have* to keep it all together and stay positive. If you need a minute to break and cry, do it. Feel your feelings, what you described is traumatic.",
            "So sorry for your loss. First thing you need is grief counselling.",
            "I’m sorry for your loss OP. There’s so much going on with your family aside of your father’s passing that it’s going to be a hard one to get through. I seriously recommend you get some therapy to aid you in this trying time and to help you decide what do you want for your family. Schizophrenia can be quite difficult to manage, so professional help is 100% needed on that front but I also understand not wanting to send your mom to a mental health facility as some of them are sterile and abusive places. \n\nTake a breath and don’t let your sisters steamroll you with their plans, decide what YOU think is best and put that on the table. That might align with them or not. Lastly, cry as much as you need. When going through grief the only thing that helped me was not holding back my tears. It’s not the same if you repress your sadness until later.",
            "I'm a nurse in a cardiac cath lab (the area that opens up the blocked arteries that cause heart attacks). I wanted to respond to your statement saying that you wish you had done things in a different order. I think it's important for you to know that with the way you described the events, it's unlikely that doing things differently on your end would have made a difference. Sure, in an ideal world everyone that collapses like that would have an immediate call to 911, CPR, etc, but when this type of thing happens outside of the hospital, survival rates are very low even if all of that is done. He likely had a severe blockage in an artery or some other serious pathology, and without being already in a hospital at that moment ... Let's just say it's a bad situation. The snoring was probably not snoring, but agonal breathing, meaning he was already very close to death at that point. Please don't carry guilt over the way things unfolded.\n\nBefore I was a nurse, I worked as an EMT, and I know what it feels like to watch someone die outside the hospital and overanalyze everything you did, wondering if you could have saved them somehow. I'm so sorry you went through this with your father. I just hope you can move forward knowing that it was not your fault in any way.",
            "I'm very sorry about your loss.  As an older man in my 60's, I've been through this with parents and other close relatives and friends.  So I can appreciate the pain and state of mind you're in right now.\n\nYou're worry about too many things too fast.  You need to realize that your thoughts and grief are going to be overwhelming to start as you're in shock right now.  It may remain that way for a while getting better every day, but not overnight.  \n\nDon't worry about any decisions right now, other than your father's final arrangements.  Everything else can wait a bit until things calm down a little.",
            "I’m so sorry for your loss op xx grief is a strange time, be kind to yourself and your family and yourself x it’s painful but it gets better x lots of love and nest wishes from me in England ❤️",
            "Wow, I just had such a flashback to 3 years ago when my dad died. Different familial weirdness but my head being literally everywhere and the recent trauma (I watched my dad die too, I also told my brother it was time to let go since my brother had the life termination rights, I did it as a way to share/take responsibility with him but we still haven't actually talked to each other about it). \n\nSo the best advice I can give is small lists and timelines of when to deal with different shit if you cannot shut off your brain. Try not to work ahead because the quiet moments are just as important as feeling useful. \n\nWeek 1: sort out arrangements, is there an obit? Who can write it/handle it? Who needs to be told. Who do you want to tell or make sure you get to talk/grieve with? How can you celebrate your relationship with him in a way that gives just you or you and your family members the different types of closure they need? \n\nWeek 2: spend deliberate time together being kind to each other. Tell stories, watch movies, play games. Laugh and cry authentically. \n\nWeek 3: start to have the hard conversations. Some of it will have come up organically last week. Why does your mom think she needs dad's benefits, what kinds of homes or living situations are on the table. Can the benefits be split so mom would be more comfy but you have resources for the house. Are you ok being moms sole grounding piece? Understanding the \"why\" allows for creative problem solving and making sure peoples needs are being met not what they want. And if you haven't found separate counseling for your mother and yourself before now this is the week. Make SURE you have someone to talk to who is supportive and in your corner period, not family, a stranger to give you good advice and be kind to you. \n\nWeek 4: move forward trusting that even if you hate the decisions you made later, you did the best you could with what you had. Be kind to yourself and be honest about what you can reasonably do.",
            "First thing...BREATHE! You have been through a huge ordeal.  Second,  this is a lot of stuff to process before his body has even been picked up. So slow down.  All of what you are describing takes time.  It takes time to get financials after a death figured out, and it takes time for courts to go through things also.  \nDeath sucks.  This will be a process that you will learn from, but right now, you are in shock and need to slow it down.  Take a walk, do a meditation, things will start to feel ok eventually but it will be messy for awhile.  You're welcome to message me if you need to talk.",
            "So sorry for your loss, hope things work out for you and your family. Be strong.",
            "I’m so sorry about your dad. Give yourself a break. You lost your dad barely 12 hours ago. So take a minute and grieve. You will get through this. Make a list. Do some Internet research. Watch YouTube. Listen to some music. It’s eventually going to be better. Give yourself some breathing room.",
            "i am so sorry about your father\n\nplease do not blame yourself for the CPR. CPR is a last ditch resort when someone is presumed to be close to death. it rarely works in the real world. you did your best for your father- please dont blame yourself or your family for how you performed CPR. you loved him, and he knew that. I hope this provides you with some comfort on such a truly awful occasion. again, im so sorry for your loss, but im glad you were with him for his last day- sharing conversation, time, a meal, and love.",
            "Everyone will act differently in moments of grief, but I recommend you to familiarise yourself with the five stages of grief. Don't focus now on \"life after\" or what's going to happen with your family. Allow yourself to go through the five stages in your own pace. The rest can wait.\n\nSorry for your loss.",
            "I'm really sorry for what you're going through. My partner lost his dad last year (similar ages to you, 25 and 73). I'm not going to lie, the next twelve months are going to be so incredibly tough, but please make sure you take time for yourself to grieve and process what has happened away from difficult family members. Make sure you reach out to your friends and ask for their support too.",
            "My family used to be very family orientated when I was very young. Then things fell apart. Lots of lunacy went on. My only advice is be ok for you. Only for you. Figure out what you need and try to do what’s in your interests. If you had asked me 30 years ago I would have had a different answer but here we are. Just be ok, be well.",
            "First of all, I am SO sorry for your loss! I cannot imagine how traumatic it must feel to witness a close family member pass away right before your eyes. Not to mention, have other family members screaming in your face and causing a ruckus. Just know that you did EVERYTHING you could to help the situation and there was nothing more you could have done! Your dad was seriously ill and his fate was sealed as soon as his heart stopped. \n\nAs others have said, his \"snoring\" sounds were not him snoring as in being asleep. It is known as agonal breathing or \"the death rattle\", which means the person is pretty much gone already. I just feel so bad that you have to be stuck in a house with all of this chaos right now! I would suggest seeking online counseling or maybe consider spending time with a close friend during quarantine? You should try to distance yourself from them right now so you can start the healing process. If you need to chat, I am here for you!",
            "My dad died suddenly last year this month, feels like yesterday  \n\n\nI had a similar experience with compressions and 911\nIt was a bit traumatizing to say the least .\n\nIf you just wanna talk you can dm me",
            "I'm so sorry... I hope the best for you... It will work out",
            "My heart is with you ❤",
            "My dad passed almost a year ago. I'm very sorry for what you're going through.",
            "Definitely get counseling. My mom (68F) died back in January. She lived with us (myself, wife, 3 kids) for the past 5 years because she couldn't/wouldn't take care of herself.\n\nI was lucky enough to already be going to therapy for the past couple years.  She helped me a lot working through it.\n\nNow I'm dealing with the estate side of things. The way my brother/sister in law (they live on the opposite side of the country) are acting, they have to be convinced I'm hiding money. \n\nBeing able to work through her death and now the estate side of things with a therapist has been amazing.",
            "I'm so very sorry for your loss.   It's a scary time, I cannot imagine how much scarier it must be to lose your dad, during this pandemic.   😢 My dad is my rock, and just the thought of what you are going through had me in tears.",
            "Contact a social worker. They're free and work with people who have money issues all the time. They can help or refer people to somewhere that can get help.\n\nIt's not about staying positive, it's about just trudging through and getting done what you need to.\n\nI'm sorry for your loss. And I'm sorry you have to deal with so much. Look for help where you can get it. I'd try to get a referral for a therapist as soon as possible, maybe contact your health insurance to get some names in your area that they cover. (And a lot of providers do cover them) You need a person to be able to vent to at least once a week. They'll be doing phone sessions now, or maybe facetime.\n\nSleep. Try and sleep.",
            "You are going to be ok.\n\nYour family may fight. Shit is going to be really hard for you for a while. You might find out your family reacts to grief in ways that make you angry or heartbroken.\n\nYou are still going to be ok.\n\nThis is horrible and my heart goes out to you. It’s incredibly unfair that you have to deal with this in the socially restricted environment we are in right now. \n\nYou are going to be ok.\n\nFamilies suck sometimes and you’ve got the shortest end of the shittiest stick because you are worrying about being responsible for your mom’s mental health in addition to her grief. Take care of yourself. You can’t help her if you burn yourself out. *It is ok to not take responsibility for this.* This is above your pay grade. This is not something you have the knowledge to deal with.\n\n\n*You are going to be ok.*",
            "You've gone through a shock and a loss. My heart goes out to you. Sending you much compassion. Take everything one tiny step at a time. You don't have to deal with every single part of this at once. Be gentle and don't try to. One step at a time. Remember to breathe.",
            "I just wanted to comment and say I am so sorry for your loss. I hope he rests peacefully. Look after yourself.",
            "I have no words of wisdom for you\n I wish I did. I am just so sorry you are going through this and my heart truly breaks for you. Something about your post just moved me - you sound like a really kind person ewww ho has a lot of fear and a lot of love for your family. I am just so sorry and I hope you can find some sense of peace",
            "I don’t have any grand words of advice but I just wanted to offer my condolences. I lost my father 3/21 too and I know what you are going through. Hang in there and do your best to look for the helpers.",
            "Hi OP. First off, I'm sorry for your loss. No matter how good or bad of a person he was, he was a consistent person in your life and losing him, especially in a time of uncertainty like this has to be difficult. \n\nI don't know if you're religious, but here's something practical you can use from the mouth of Jesus. \"Therefore do not worry about tomorrow, for tomorrow will worry about itself. Each day has enough trouble of its own.\"\n\nEach of the days you have that follow are going to be difficult. If you can't fathom getting through the week, you shouldn't worry about it. You can't tell the future. Focus on the day ahead, and if that's too much, take it moment by moment. If you can't make it through the moment, close your eyes, breathe, and count to ten. At the end, you're still there, hanging on. \n\nYou will make it. Don't worry about the future. What happens, happens. Make the plans you need to and make sure to grieve properly for what has already happened, but you will make it through.",
            "Don't make any big decisions yet. Give yourself time to grieve, and tell your sisters you need the time. Before you tell the bank he has died, draw everything out of his current account if you can. You'll all need the money, and his estate will get frozen. Sorry for your loss and it is especially hard during this lockdown period.",
            "So, so sorry for your loss. Sending healing, but also look at grief therapy for your whole family but especially you.",
            "I am sorry to hear about your dad and know it is hard to stay positive under such circumstances. But, we need to stay strong in life and go ahead. \n\nIf you think that calling 911 was your mistake, then you are wrong. Birth and death are pre-written by the almighty. Staying cool and strong for the future will bring happiness in your life...  Take care buddy.",
            "Hi OP. My dad died a few weeks ago and there was some serious family drama that has only gotten worse. If you need to talk, please feel free to PM me.",
            "My dad died 6 weeks ago and it left massive parts of my life in a dire state of uncertainty. I don’t have much advice other than I’m so sorry for your loss. It’s pain that can debilitate someone.",
            "Sorry about your pops bro",
            "Im sorry for your loss my friend. When I lost my father to a boating accident I could tell you I was in a very similar state of mind. To be completely honest, it took several days to finally register he was actually gone and not coming back. As for your reaction I can say with 100% confidence you reacted appropriately and admirably. He had pre existing conditions, and at that age your body is fighting just to keep the lights on let alone everything else that comes with well... Life.\n\nAll I can say man is hold your family close and please try and understand that people truly do say things out of pure emotions, especially when it comes to loss. Try not to hold onto what is said and forgive as much as you possibly can. I know from first hand experience that by holding onto all that anger and sorrow you'll only be holding yourself back, not anyone else.\n\nSorry for the short post, I just feel like in times like these the simpler the better. Feel free to pm if you need someone to talk to :).",
            "May God bless you and your family, pray for guidance and keep humble if your siblings determine to send your mom to a better place where she can be helped then don't fight it. Find your place and stay focused on your future, if still in college move to a dorm away from drama always checking on your mom and help with anything she may need.",
            "I'm very sorry for your loss..",
            "I'm so sorry for your loss. *big hugs*",
            "Wow I'm so sorry. My dad passed similarly right before Christmas. He had high blood pressure and wasnt taking his meds. I wasnt there but hearing you description of the events is exactly how I'd pictured the chain of events going. My step mom arguing with him before (that actually happened) and then yelling again when my poor sister is calling 911 and my other sister trying to resuscitate him. We found out later he was dead before he hit the ground. A blood clot traveled from his leg to his brain stem. \n\nMy point is I totally understand where you're coming from; my family is incredibly dysfunctional. I would say cut any ties that arent serving you. Family or not some people are toxic. I dont speak to my mom or my step mom or anyone else in the family that doesnt add to my life. You are the only one who's going to have 100% your best interests at heart. I think you know what to do deep down but feel guilty about it. Dont! This is your life and for all we know we only get one so please make the best of it and do what's best for yourself. It'll hurt like hell at first but its necessary. And if you need someone to talk/vent to dont hesitate to pm me! \n\nSending you some much needed love and hugs your way 💜💜💜",
            "Listening to Muse Survival JS Bach Hector Berlioz Requiem and Mahler 2nd symphony and Gorecki 3rd symphony will give and help you understand who humans find emotional depth and development \n\nThere are people that will truly help you and be there for you those that dont abuse you and give you great advice put confidence in yourself comfort yourself and ignore and remove negative thoughts smile The wonders of life are everlasting we just need to appreciate everything in life\n\nAnd watch Dr Rockso on You Tube if you are feeling low",
            "I'm so sorry for your loss. This is going to be really tough on everyone. I hope on the other side you remember who your dad is and was, and not the drama around his death.\n\n Get a therapist asap (if you can) there super helpful with managing all of the stuff that comes along with grief.\n\n Lastly, there isn't a wrong way to grieve, and if you end up laying in bed for 6 days because you can't see through how tough it is. It doesn't mean you failed. Again op I'm so sorry for your loss.",
            "You did a good job trying to save your dad so I hope any guilt feelings you have about that fade soon. In times of crisis people can experience “time dilation” and “time contraction” so even if you feel that his care was delayed or you should have done xyz sooner I bet that wouldn’t have made a difference. You did everything you could.\n\nGood luck with the rest of the decisions you are making. I know you’ll make good ones for sure.",
            "Condolences to you and your family.",
            "I know it might not be easy but please go see a therapist.  My mom died suddenly when I was 12 and it really messed me up to which I got PTSD from it.  I (29F) finally got around to seeing mental health when I was 23/24 and I'm still in therapy.  I'm so sorry you went through that and nothing anyone says can make the pain go away but it does get easier to manage.  Some days will be worse than others but you need to grieve and remember it's not your fault.  My heart goes out to your family.",
            "You have to keep living on for him and keeping him alive through the memories you shared with people.",
            "Your story sounds aweful. What I will say is that your dad's money should go to caring for your mother first. She is going to have larger than average medical bills on top of her cost of living.  And those need to be paid before you think of renovating a house. You can control the money if she has mental illness that you think would compromise her ability to make financial decisions *unless his will gives her financial controll*. But she comes first before investments. his will is concrete. If it says she gets it then she gets it.",
            "Just breathe. It is all very overwhelming right now, so block out everything that doesn’t have to be done immediately, and as those things get done, then you can add one thing at a time that needs to be decided. \n\nBut during all of it, remember to take breaks, for your wellbeing. It’s ok to feel however you feel. Your feelings are real and valid, and it’s ok if they don’t make sense. You’re going through something incredibly difficult, so go easy on yourself. \n\nMaybe make a list of the most important things that need to be done, and delegate those that you can. \n\nAs for your mother, I think the most important thing is that she’s somewhere that she remains safe and stable. Whether she will need to be in a home or not does not have to be decided right away, unless there is nowhere suitable she could stay that will ensure she isn’t a danger to herself or others. \n\nLean on other people as much as you can. I know it’s difficult right now with the pandemic, but there will still be people who can help in situations like this, and it will help you to engage with them. \n\nI’m very sorry for your loss. ❤️",
            "self-care is uber important right now; I think the grief will arrive in waves. did for me anyway, in a some what similar situation. I'm sorry for what you're going through; maybe try organize a casserole schedule from friends and neighbours?",
            "Im not sure if its relevant to your situation but i lost my dad when i was 17. He has history of cancer and just passed away from a sudden heart attack. Prior to this ive lost my mother 3 years back due to cancer, so its basically me and my two brothers against the world. Its goona be tough. Heck its gonna be tough for a long time. My dad paased away 4years back and we’re still pretty messed up in our own ways. Best advice i could give you isjust to be there for your family, and do not for the love of god neglect your own feelings. I did that and im dealing with the aftermath now. Its hard, its tough, but im sure youll get over it eventually. All the best to you OP",
            "We all go eventually. My Mum passed from cancer a couple of years ago. Then I was diagnosed with stage 3 cancer... Did all the chemo and luckily squeaked through with only nerve damage. Now my dad's suddenly got cancer too, but they keep moving the surgery because hospitals are totally fecked right now. Sister is a hospital worker (surgeon) and I'm just waiting for her to get this bloody virus.\nOne thing keeping me sane is what my mum always said: live in the moment. I got the notes from Charlie Parker's \"now's the time\" tattooed on my arm where they used to hook in the chemo. When I get overwhelmed I look at it and just breath deeply and slowly and remind myself that all I need to do is be in this moment and do my best in this moment."
        ]
    },
    {
        "post_id": "1c0d1xm",
        "author": "ThrowRA-brokenwoman",
        "title": "(Update)- I (37f) want to divorce my husband (40m). But everyone keeps telling me I will die alone if I do so. What is the best course of action?",
        "url": "https://www.reddit.com/r/relationships/comments/1c0d1xm/update_i_37f_want_to_divorce_my_husband_40m_but/",
        "score": 2486,
        "num_comments": 324,
        "created_utc": 1712723763.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/s/JYg2PTNn9L\n\nHello everyone, just wanted to give a quick update. Recently I had my lasik operation done on my eyes. So I wasn’t available to answer all the PMs and comments. I wasn't allowed screentime for 48-72hrs. But thanks to all of you who opened my eyes. I was having some doubts. In my mind I was doing the right thing. But people were telling me I should reconsider. So it created a doubt whether I'm doing the right thing or not. But the comments from people has cleared it. So where are we? That's the discussion I had with my stbx. \n\nMy stbx came to see me during my operation. I never asked him but he still came. He took me home after my operation. Since I wasn’t allowed to do put pressure or dust in eyes it made majority of the chores very difficult to do. But he did all my chores, starting from dusting, cooking and laundry. He was with me reminding me to take my eye drops. It felt good. For once I thought I got my husband back. But I thought about this a lot. He never did anything like this unless I ask him to. He never did my portion of the chores even when I was sick with a flu. He is only doing this to be on my good side. I don’t want someone who only acts nice only to gain something. Plus the messages he shared with his AP stil haunts me. It's been imprinted in my brain. I don't thinl doing 2 days worth of chores will make me forget the humiliation me and my kids went through because of him.\n\nSo I sat him down, it easier to talk to him wearing glasses. I told him I'm still going through with the divorce. I am not going to take his kids away from him. He is still their dad. I can never live under the same roof. Even if I take his advice and go to counselling together I would still never be able to let go of the fact that he cheated. Our kids don't deserve parents who resent the other. It's better we part our ways and continue as a coparent. I did suggest counselling as a family so that we can be the best coparent. But as far as being married that's out of the question. He can resent me all he wants but he still has to be there for the kids. He agreed. Although I can see the sadness in his eyes. He said sorry for everything that he has done. He opened up about his affair. That he just thought it would be great. Because we got so stuck in our mundane lives that the affair was an escape. But he didn’t realize what he was losing. He blocked his affair partner and ended his relationship with her. He acknowledges that not only he destroyed his marriage, but also ruined her career. He also stooped so low in his kid's eyes. He also said he will never date again. I told him to not make promises he knows he cannot keep. \n\nAnother problem we are facing now is our kids. My oldest son knows what's happening. Apparently the ruomors has reached his school. The teacher taught my middle child. So she also knows. My son is not talking to his dad. He even refused to eat the meal he cooked and has been living on peanut butter and jelly sandwich. My other kids followed his lead. He refuses to talk to my stbx and it hurts him. I even caught him crying 1-2 times. I can understand what my kids are going through. I don't want them to hate their dad. He is a crappy husband but a great dad. I don't know what to do with them. If you have suggestions please let me know. Also I cannot reply to all the comments because I'm only allowed 30 mins of screentime every 2 hours. But I will read the comments once I'm fully recovered. \n\nTldr: had lasik surgery. Had \"the talk\" with my stbx. We are still getting divorce. Kids still hate him.",
        "permalink": "/r/relationships/comments/1c0d1xm/update_i_37f_want_to_divorce_my_husband_40m_but/",
        "comments": [
            "I'd get them to see a psychologist asap. The anger and resentment are normal, and it's up to him to do the work to get their forgiveness. But they need a safe space in the meantime where to process it all and cope with the changes that are coming; they have been exposed to grown up issues beyond their emotional understanding and a psychologist can help them through it.\n\nCongratulations for making the right choice for you and your kids in the long term, it's not easy but future you will be so grateful of your strength now.",
            "Let the kids have their feelings. They’re old enough to understand that level of betrayal. He didn’t just do it to you. He did it to the kids too. I just can’t get over the teacher part and I’m a stranger! I can only imagine how your kiddos feel. Definitely do family therapy and let the therapist help them work through their feelings, and find their way back to their dad if that’s what they choose. Good on you for looking after yourself and kids. You’re a strong woman and good mom!",
            "He made a decision that destroyed his family. That doesn't make him a great dad. Your kids are not stupid. They know he put sex with their teacher before their welfare. You should not pressure them to forgive him. That is their choice and they only thing they have control over. He humiliated them too. Imagine having to go to school every day and hear the whispers that their dad screwed the teacher.",
            "He might have been a good dad at one point but a great parent doesn't prioritize their libido over the well-being of their children. When you are a parent and choose to have an affair, not only are you saying you don't care about the harm to your spouse, you are also saying you don't care about how it will affect your children. Destroying the stability of your child's home over an affair is not something that a parent prioritizing their children would do, doing so with a teacher that taught your children is even worse. Your children will probably have some resentment, that's natural. I would second others here and suggest counseling to help the children work through their complicated feelings about this.",
            "Unfortunately he isn't the great father you hope he is. Part of cheating, part of choosing to destroy his life in the way he did, would very inevitably result in the kids being hurt. That's part of what cheating does, ripples outwards. Your kids are feeling the full impact of his direct choice to hurt them. That's the reality. \n\nAnd that will take time. Emotionally they have a lot to deal with and individual therapy/counselling may be worthwhile. Especially for your son who is clearly taking this very hard and is being forced to face the reality loving people doesn't stop them hurting you. \n\nYour ex husband chose to hurt everyone in his life for 'excitement' or whatever. These are the ramifications of his choices. They may choose to hate him in the end for that.",
            "He is not the great father figure you thought he is. He did not think how would his children be affected after using one of their teacher to live an exciting opportunity! A good parent always would put their children first in their every selfish desire.",
            "Good on you for sticking to it!\n\nDon’t forget, a great dad would not cheat on their children’s mother! He is reaping what he sowed.\n\nGet your kids into therapy if you think that will help. Let a professional help them work through the trauma.\n\nIf your kids hate him then so be it, *he* caused this.",
            "It's only been 4 days. Your kids will recover later on. Right now, they've heard and are embarrassed of the reality that their father cheated on their mother...and with one of their teachers too. \n\nIt's going to take time (again, the whole thing imploded the last month so it'll still take time to recover) for things to start being okay.\n\nAfter you feel better, start getting into therapy for the whole family. \n\nI have a good friend, she was a single mother of 3 at 37. If she's around your circle of friends, they'd probably think she can't get a good man. But nope, she's met her husband at 39 and married him at 40. \n\nThe point being, it's always possible to meet the right partner for you later on in life, even if you still have children. So the people trying to get you to stay are false.",
            "Good on you not buying his 2 days of chores. You don't have to stand by someone who hurt you in the worst way because they managed to scrape together some crumbs of kindness afterward.\n\nI'd be worried about the impact on your kids. The fact that he chose a teacher of all people. This could not *just* impact your kids relationship with their dad. I'd worry It could impact the kids in other ways. Like socially or educationally. His actions have permeated the kids world at home AND at school. It's bad enough that the kids have to deal with this at home in private, but if word gets around at school they have to deal with it in public too. Which sucks. What if this impacts how they feel about school or teachers? What if some mean kid teases them about it at school?  \n\nI'm so mad on yours and your kids' behalf ! What a mess he's made !\n\nI really feel sad about the advice you received from others too btw, about how all men cheat so you may as well stay, or that it will be so hard to find another man as a single mother at 37, or that it's your responsibility to suck up all the pain and mess he has caused for your kid's sake. Heck No to all of that. Youre not an old maid, it's 2024, and your worth as a person is infinitely more than that advice implies. It's true dating as a single mother is no picnic but that doesn't mean that staying with someone who's treated you like this is preferable. These people seem to think that being single is the worst thing that can happen to a woman. I guarantee that it's not. If you were to stay and internalize and absorb the impact of his actions and pretend like everything's fine - that would be worse.",
            "I'm sorry, but \"great dads\" don't cheat on their kids' mother with their kids' *teacher*. That is so fucked up. He may have been a great dad in the past, but he isn't anymore and he's likely destroyed his relationship with his kids.",
            ">I even caught him crying 1-2 times. I can understand what my kids are going through. I don't want them to hate their dad. He is a crappy husband but a great dad. I don't know what to do with them. If you have suggestions please let me know. \n\nDon't tell your kids how to feel about their dad, or to not hate him, or that he's a good dad. They are entitled to be upset, to be mad, to cry, to want distance from them. They have had less time to adjust to the news, and they are not only sad, but also scared about how their life is going to change. \n\nYou need to be the parent here and give space for their feelings, and reassure them that you're there for them. \n\nTell them whatever they are feeling is ok. Don't try to keep them from \"punishing\" their dad, this is one of the few ways they have agency in the situation. \n\nAsk them how they are feeling, ask them what they are worried about. Let them talk. Don't argue with what they say or how they feel. Reassure them that while changes are going to happen, you will let them know what's going on.",
            "He deserves the coldness from his children. He caused it and those are the consequences of acting recklessly, I’m just sorry that your kids are experiencing things at school",
            "It's so crazy to me how people blow up their entire lives for nothing. Wishing healing for all of you. I think you're making the right decision for you in terms of the divorce. I hope you all get some counseling to help you all individually and collectively through this.",
            "Who cares about APs career? That be woman knew what she was doing. \n\nAbout your children. Let them be angry. They have every right to be angry. He cheated on their mother and humiliated all of them. The other children and parents will keep talking about it for a long time.\n\nBut they need therapy. Not only because of their father, but also because of the humiliating they will face because of him.\n\nHim saying he didn’t know what he was losing is a lie. He wanted an escape. He got that. But he knew that cheating would destroy you and his marriage. He knew what he was doing.",
            "How is he a great father? By fkn one of his kid’s teacher and destroying his family? Y’all be really needing to know and understand definitions",
            "He isn't a great father. He not only cheated on you but your kids as well. He deserves every ounce of hate he's getting from them.",
            "Oh no, if it isn't the consequences of my own actions. \n\nLol, hope your POS stbx enjoys no longer having a family for the rest of his life. He deserves all the pain and misery that comes with it. \n\nGood for you OP for standing up for yourself!",
            "#Good For YOU 👏 \n\nNot to sound condescending; but I'm proud of you for standing up for yourself and setting the example to your kids that this kind of behavior between a couple is not to be done or tolerated. \n\nThat's Huge! **WELL DONE** 🥰\n\nSo, now the kids...\n\nThe kids have the right to their feelings; but they are going to have to navigate them with the help of a 3rd party (counselor) because there's some complexity in this situation which extends beyond \"typical\" divorce because everyone outside the home knows about the affair so this will be something they feel they are dealing with full time from all directions. \n\nThey have the right to be angry with their father. Not only did he cheat on their mom; but his cheating is widely known which makes the matter even worse because there is no hiding it or keeping it in the family, and as such the kids could be hearing things at school.\n\nYour eldest son may benefit from some kind of sport or other physical activity to help him channel his anger.\n\nMine got into weightlifting and body building when he was dealing with our messy divorce and it did help to give him a physical outlet for all that rage. My younger child got into running and used her rage to propell her to the finish line which was helpful.\n\nIf the kids have interests try and help them to feel grounded in those outlets to help them with their emotions. Art, music, gaming, sports, writing, whatever they like to do- indulge them in that because its all a form of self care and that's important. \n\nCounseling will be paramount for the elder and middle child right now; but especially the elder because he will set the tone for the youngers as the oldest. He's also more aware of what's happening by way of gossip and in being old enough to understand mature relationships and what cheating actually is.\n\n**DON'T** push the kids to be good or nice to their father- that just invalidates their feelings and can cause friction between you and them, and make them feel bad or wrong for feeling the way they do. They have the right to those emotions. They can decide what they want their relationship with their father to look like in time. Give them that time.\n\n**DON'T** force the kids to spend time with their father if they don't want to. This is a continuation of what I just said above. The kids will decide what they want and don't want. If dad invites them, agree that the activity sounds fun and let them decide. If the elder child is influencing (even indirectly/not purposely) the younger children to not ingage with their dad through his example then make plans to do something with the eldest yourself and your husband do something with the younger 2 or one (whoever wants to go) while the eldest decides what he wants and needs in terms of a relationship with his father.\n\n**DON'T** try to be the kids counselor. You can listen to how they feel, validate their feelings, let them know that you have the adult of things and they don't need to protect you or punish him for hurting you; but they have a right to feel how they do about him because of what he's done and how what he's done has affected their lives.\n\n**DON'T** talk badly about their father or try to exonerated his name. You are a blank canvas. They will paint you with their perceptions and you will say that you understand why they feel that way and that it's ok to have those feelings. If you're lucky the kids will tell you the complexity of their feelings because he's not all good or all bad- there are good times/bad times and good things and bad things throughout your familial history and its ok to laugh and remember good times, to  cry through the hurt and frustration, and to be angry about the situation. All of those things are valid. The painting is not black and white even if it may seem that way for a little while as they work through processing all of this stuff.\n\n**Get the Kids in to Counseling ASAP** (eldest especially; middle child too) you can't \"fix this\" for them. You're too close to the situation and you have to work on your own feelings surrounding what's happened.\n\n**Get YOURSELF into Counseling ASAP** you're going to have to navigate the cheating, the divorce, the impact of public knowledge of the cheating on you and the kids, your kids relationships with their father and the eldest may develop some anger issues that might need managing too so you're gonna need a lot of tools in your belt to help yourself and them to deal with this.\n\n**Counseling for You and the X** this is an excellent idea; but make sure you have an individual counselor for you too.\n\n**Family Counseling** yes; but not unless that oldest child has someone of his own to speak to and has put some time into doing that first. Trying to work as a group when one person is unwilling or incapable of doing so won't work well for anyone involved, and could actually cause more harm then good in the long run. \n\n#Thank You\n\nFor heading our advice and updating us with how things are going.\n\nMy heart goes out to your eldest child! Please focus on him (not your Xhusband) because its obvious that he is hurting very deeply right now.",
            "Fucking run, in 6 months you'll wish you did it years ago.",
            "Clearly he is not a great father. Great fathers prioritize their family, they don't risk their families happiness to \"get a break from the mundane\"\n\nYour husband is a terrible father",
            "So relieved you’re going ahead with the divorce and not forcing yourself to stay and be as miserable as hell because everyone else is telling you that’s the best thing to do. That way lays heartache and resentment for you. You mention seeing messages between him and AP so I’m assuming that’s how you found out. You can’t unsee those.\n\nI’m just so cross with the whole “I thought it would be great because life was mundane” crap. Work on your marriage, get couples counselling. Ahole. The teacher ruined her own career by the way. No one forced her to have an affair.\n\nThe children need therapy. They’re naturally angry with their Dad and this is an outcome he should have foreseen when he decided to have an affair. He’s going to have to suck it up for now. He’s not actually a great Dad, a great Dad wouldn’t cheat on their mother leading to the break up of the family home.",
            "I'm not a fan of the \"he is a crappy husband but a good dad\" comments common in situations like this.\n\nNo good dad screws his kids teacher because that directly hurts the kids. Any reasonable adult knows this.\n\nIf that were my dad I don't think I'd ever talk to him again. I would be so humiliated.",
            ">Although I can see the sadness in his eyes. He said sorry for everything that he has done. He opened up about his affair. That **he just thought it would be great. Because we got so stuck in our mundane lives that the affair was an escape.** But he didn’t realize what he was losing. \n\nNeat, so it's kinda your fault that he cheated, then? Instead of trying to put in any effort to fix what HE ADMITS was a two-person issue, he put in a whole bunch of *extra effort* to start an on-the-side relationship with a third person when he knew good and damn well that it was a bad idea, because it would hurt YOU, and this person was DIRECTLY CONNECTED TO HIS KIDS? \n\nThis isn't just \"I can fix this with two days of chores,\" to borrow your analogy. This is, \"Wow, it's tough for us to keep this place clean, and my wife is overwhelmed, and I'm bummed out because she's not fun. I *could* pitch in to take on a few more things around here OOOORRRRRR I COULD THROW A RAGING KEGGER IN HEEEEEEERE!!! THAT'LL LIVEN THINGS UP FOR ***ME!!!***\" [Kicks over lamp, slams an open bar through the back door, installs DJ station in kid's bedroom] \"JUST PARK THE LIMO IN THE LIVING ROOM, IT'S COOL, OUR MARRIAGE HAS GOTTEN BORING, THEY'LL DEAL WITH IT, THEY CAN ALL DEAL WITH IT, IT'S COOL.\" [air horn] \"WE'RE IN A RUT.\"\n\nHe's seriously trying to make this your fault, sis. And now that he's suffering some consequences, he's finally like, \"Oh nooo, the consequences of my own actions, how could I have possibly foreseen this?!\" He's not sorry. He's just hungover.",
            "I say, don’t fear being alone and you deserve a good partner. From what you have shared, he doesn’t give you what you need",
            "Let your kids feel how they feel, encourage but don't force a relationship with their dad. \n\nThings will probably get better with time, but this isn't your problem to fix - it's stbx's. And he may well have to put that work in with your kids for the rest of his life.",
            "Don't believe that bullshit. \"Dying Alone\" only happens if you live a life of solitude and eschew relationships with anyone. Friends count. Extended family counts. Godchildren, niblings and coworkers count. You're only \"alone\" if you wish to be. You're allowed to live free of a man you do not love anymore.",
            "Great dads don’t gamble their children’s stability. Let your kids process this in their way with support. ",
            "> He is a crappy husband but a great dad.\n\nGreat Dads don't end up balls deep in their kids teacher. He is both a horrible husband and a piss poor father.",
            "> Our kids don't deserve parents who resent the other. It's better we part our ways and continue as a coparent.\n\nAs someone who grew up with parents who stayed married \"for the kids' sake\" I can confirm that that idea often does not work out as people want it to.",
            "How can you say he's a great father when your children are suffering due to his actions. \n\nUpdateme!",
            "Reading this for the first time, the thing that strikes me is all the idiots giving you shit advice in your original post. Wtf are those people?",
            "Id rather die alone and happy than in miserable company - so I guess that's your answer.",
            "I don't normally comment on these types of subreddits but this hit home. I come from a family where the parents stayed together \"for the sake of the kids\" (i'm an only child but that's besides the point). My mom caught my dad cheating multiple times and stayed with him because she thought it would be better for me growing up with both parents. It wasn't. I grew up resenting my dad for demanding cleanliness and cooked meals and a presentable home and watching my mom do everything while she excused his behavior. I also remember my mom telling me when i was around 15 about my dad's cheating (casually, during a conversation where i was complaining about him in general). I was so angry and i started encouraging my mom to divorce him from that point on. Good on you for divorcing, it's going to set an excellent example for your kids (they'll definitely keep this in mind, kids are crazy observant).\n\nAbout your kids hating him, it'll get better. My parents ended up divorcing when i was in my early 20s and it was a nightmare and i resented my dad and downright hated him for a while because of a lot of things he did and said. We were no contact for around a year and he was desperate for a while after to get back in my good graces. I went to therapy, worked on my resentment towards him and now we're fine. He's not an award winning father by any stretch, he's actually quite lousy and always has been. We're not close but our relationship is somewhat functional and i know i can count on his help whenever i need it.\n\nAll this to say that your kids will grow and learn how to process all of this. It's a shock and it's upsetting. It's also a very public conflict with rumors running around their schools and they're probably getting all kinds of comments. Go to therapy, family and individual, and help create a dynamic where your kids can speak openly about their feelings and resentment while also getting your side of things. This kind of communication should be a two way street. That's how me and my mom fixed our relationship post-divorce and now we're best friends (she wasn't without faults of her own, lots of resentment there too). Be patient and open and have faith that your kids will eventually process their father's transgressions and learn how to cope in a healthy way. Stay strong, it'll get better for everyone.",
            "Get your kids into therapy. They may never fully reconcile with their dad, and you can't force that. You can make sure they have a safe place to work out their emotions and hopefully manage their pain in a way that doesn't adversely affect their future relationships. I think family therapy for you and the kids would be good. After a few sessions, ask the therapist about when/if your ex can join in. I might be wrong, but I think having him attend right away is a bad idea.",
            "He's not a great dad if he fucked the kids teacher.  He had to have known that would cause problems.",
            "Is dying alone really the worst possible fate? \n\nWhen you’re on your deathbed, do you think you’ll look back and be glad you spent so many years with someone you wanted to divorce or will you be grateful you have yourself peace and happiness? \n\nJust because he can be kind, that doesn’t mean you have to stay married just for the sake of being married.",
            "We all die alone. Listen to the testimony of those who have died and come back. Focus on being at peace...not just when you die, but throughout your life between now and then.",
            "As a child of divorced parents who's mother did the same with my fathers brother I say your ex did cheat on his family. That's how it felt to me then and now. He cheated because his life was mundane in his opinion. That includes his kids. He probably forever destroyed his relationship with his kids.",
            "It was the advice of \"all men cheat\" that had me flabbergasted. Exqueeze me?!? There are LOADS of dudes who would never do that!\n\nAnyway. Those questions, my dear, are best left to the therapist. You're their mom. Be their mom. Don't try to be their therapist.",
            "ya know at the start i was reading going this doens't seem that bad, until i saw the part that said \"he cheated\", in terms of the kids, it isn't your job to make them like their father, they will or they won't, best not to lie to them, and to not trash talk the other parent, but when the other parent did something this bad they also understand what happened and are upset at him for it.  i think the best course for the kids is just make sure they have a place they can talk things over about it so they can work though what happened, with either a theripist or you, and to if they want to speak to their father let them, but if they don't want to speak to him best not to force it either.",
            "He’s not a great husband or a great Dad. He cheated on his family, he broke his kids heart and he did all of this with someone they knew. Sorry to say it but he’s a horrible father who now has marred his own children’s reputation because he couldn’t keep it in his pants",
            "He isn't a great dad. He gave up his family when he had an affair, but he specifically chose someone *close to his kids* to do it with. That is not a great father. That is a shallow facsimile of a father, just like he was actually as a great facsimile of a husband during those two days. \n\nIt isn't up to you to help him rebuild a relationship ship with his kids. These are the consequences of his actions, and they may be permanent. He will likely never have the same closeness he once had with them. Your job is to help your kids through the pain of what he has done, for their sake. \n\nGet them into counseling and get you into counseling. You can go to a few joint sessions with your ex.if you want to in order to learn to coparent bur you need your own safe space to work through what's happened and likely the neglect and treat.ent he ha sout you through that you might not even be aware of fully yet...people like this don't become that way over night. I doubt he will get his own help, and likely, his offer of therapy was only marriage counseling to try and manipulate you into not ending the relationship and the lifestyle he's accustomed to. So don't expect him to get anything hut worse over time...this is where the mask comes off, and he becomes a stranger. \n\nYou and your kids will be fine. You are entering an exciting new time in your life full of possibility. You didn't compromise yourself to get there, either. You are going to find that that works in your favor. Work through the pain in a healthy way, with help, and your next relationship will be better and stronger for it. \n\nMy ex cheated, lied constantly, and was physical at times. I stayed because I didn't trust him with custody until our kids were older. Once I left him I was scared, but life really started. I am now remarried to a loving husband and also have a wonderful long-term boyfriend, and both men treat me like gold, and I have true passion in my life. I have amazing friends and a new hobby that helps pay the bills. I have found myself in ways I never could under the weight of the misery of that relationship and everything I had to take on that my ex wouldn't. My kids are happier and freer. My ex is still a part of their life, but with boundaries that I am able to control under the law (he gave me full custody without a fight). \n\nLife starts after divorce for many people when their partners cheat.",
            "Your husband cheated on the kids too. He can’t be that great of a dad if he’s willing to destroy their world just to get his dick wet.",
            "He deserve their hate; with any luck, they dont even see him as their father",
            "All you can do is say he was a great dad to you and be there don’t force a relationship if they don’t want it",
            "im just here trying to figure out why you keep saying starbucks",
            "Your kids deserve to know the truth. Your husband needs to deal with the consequences of his actions and destroying your family unit.",
            "Give the kids time to process and just be there for them.  Their Dad needs to earn their trust back as he destroyed that too.",
            "Lots of people find love at your age. But even if not, you will have your friends and any other family you're close with. And I'd still rather die alone than with someone I resent",
            "If the kids are willing, write out a few things in the form of a letter to their dad.\nInclude something along the lines of:\n\n* How they feel at the moment of writing\n* What this whole situation means to them\n* What they want to happen in the short and long term in regards to him, visitation, coparenting.\n* If they forgive him now, or when they might forgive him in the future.\n\n\nYour stbx needs to understand that it will take time (probably many years) to mend the damage he's done to their trust.\n\n\nAsk your stbx to write them all a letter, outlining his understanding of the mistakes he's made and a proper apology for the hurt he's caused.\n\nChances are they'll throw it in the bin, but it's a start of the effort he'll need to put in to rebuild their relationships.\n\n\nSome might think it's dumb, but I say write, because it can be easier to convey thoughts and feelings without getting caught up with emotion during a difficult conversation.",
            "I am so sorry for everything. This is a really upsetting and difficult thing to handle. As far as the kids go, if you can manage it, individual counseling and family counseling needs to happen.  Also, time.  Your husband needs to apologize to to the kids for breaking up the family.",
            ">I told him to not make promises he knows he cannot keep. \n\nSounds advice. And that's something he should work on in therapy. People who go from one extreme to another need to find balance. \n\n>He is a crappy husband but a great dad. I don't know what to do with them. If you have suggestions please let me know.\n\nThey may need some therapy - individual - themselves.",
            "Get him out of the house and move on my dear. I’m sorry this is happening but stay the course. You are doing the right thing 💘",
            "Would you consider moving your kids to a different school? This kind of rumor can really damage a child’s self-esteem. It can cause bullying and other traumatic situation among peers. Going to a new school would be a fresh start, and it’s less likely anyone will know about their father’s sordid history.",
            "I just have to say you I think are doing the right thing all around and I applaud you for looking past your hurt, not giving into being petty and still wanting your kids to have a good relationship with their dad. \n\nI bet it will just take some time and patience and they might start to forgive him if he just keeps himself open and is apologetic. Ultimately, it will be up to them though. It sounds like you're doing your part already. Hoping the best for your family.",
            "You did the right thing. You should, however, get yourself and your kids booked in with a therapist if you can. These kinds of major betrayals can be hard on a person, and it doesn't seem like the boys are handling it in the best way. What will happen if the divorce ends with joint custody, for example?\n\nThings are probably a bit raw right now for group therapy with your ex involved, so don't push that idea too hard with the kids yet. Let them work through things a bit first with a therapist/counsellor if you can, as forcing them into family therapy with the guy who betrayed them (because he did betray them as well here, not just you) is probably not going to be productive.\n\nI wish all of you the best going forward. Well, aside from your ex. I don't wish him harm, but i have my opinions on cheaters.",
            "I don't think it's your place to fix the kids' relationship with their dad. I am not suggesting you need to do anything in particular but I noticed you called him a \"terrible partner but a great dad\". He's not a great dad. Great dads don't break apart their families for selfish reasons.\n\nThis might hurt to hear but your husband ruined your children's chance at having a normal family forever. It is perfectly reasonable that their feelings will match this energy and no amount of psychology or counseling is likely to erase that. You can't expect them to repair the relationship with their father just like you can't be expected to stay married to him. \n\nYour husband didn't just cheat on you, he cheated on all of you. Give your children space and don't try and force them into doing things you wouldn't ask of yourself",
            "He was a great dad, not anymore. His son no doubt is going to be constantly bullied for the rest of his high school career",
            "literally say you rather die alone 😭",
            "Don't fall for stbx's crocodile tears. If he didn't want his kids hating him he shouldn't have cheated. I agree with the folks saying it's a good idea to bring in a shrink, a good one will help the kids move through their feelings and get to a healthier place, just don't expect them to forgive their dad any time soon or ever.",
            "I'm just reading this for the first time. I'm so sorry this happened to you. He not only cheated on you, but his choice to chest with his child's teacher has ruined his kids' lives. They have a right to be angry. Not only did he destroy his marriage to you. But now your children will be teased, probably bullied, and the target of gossip and rumors for an unknown amount of time. You should respect and support their choice not to talk to him bc this is just as much affects them as it affects you . I'm disgusted that not only did he cheat,  but of all the people in the world he could have cheated with, he chose to cheat  with his children's teacher. The children need and deserve individual counseling without him bc it affects all of them differently.",
            "Give the kids some time to heal. Don't force them to move on quickly. They are victims too.",
            "You already have some pretty great advice regarding your kids, just one thing that has more to do with your previous post. You said the thing that got you the most was what your mother said to you about wondering if she should have stayed with your father. You should talk to your mom if you haven't already and make sure she knows that her divorce never took your father away from you. Your father did that. He made choices that hurt you and your mother and that's not on her anymore than it is on you. You are not taking your kids away from their father. Everything that's happening is the result of his actions. They're not upset with him because you're getting a divorce, they're upset because his actions hurt them too. I think you guys would benefit from family counseling, but I really want you and your mother to realize you're not to blame for the actions of the men you were married to. If anything, your mother and you have set an example, that this is *not* something that's tolerable and your children will know in the future it's not okay for someone to treat them this way either.",
            "A good dad doesn't cheat on their child's mother, and it was it even some stranger he met. It was their teacher!!😭",
            "So, I am sorry, but he is not a good dad. A good dad would not have cheated, especially not with a teacher at his child's school. It is really that simple and easy.\r  \n\r  \nHe is feeling guilty because he is, and selfish. He failed to be a reliable adult, father, and husband.\r  \n\r  \nAs for being alone after divorcing a cheater...woman!....don't tempt me with a good time!",
            "I understand where you are coming from, but don't defend your husband too much before the kids start therapy. They have a right to see you upset, and it's healthy to see that he is paying the price for his horrible decisions. He broke your family and your kids have every right to be upset, don't try to sugarcoat it and act like your husband didn't directly impact the kids too. He's NOT really that great of a dad because of what he did.",
            "I'm not a psychologist, but you might be dealing with a bit of imposter syndrome as well.  Certain trauma we experience can sit idle for years while we slowly create doubts about ourselves and our self-worth.  Stand your ground and don't give him the option to hurt you again.  The kids can still have a meaningful relationship with their Dad if that's what you guys decide.  Don't hide this from the kids.  They need to know that downfalls happen in relationships.  What they'll remember the most is how you reacted and grew from the experience.  Then if it happens to them, they'll know what to do.  And you WILL find someone who will treat you better.  You just need to remind yourself that your feelings matter.  There's no excuse for him doing that and there's no way he DIDN'T know how important that issue is to you.  He just didn't care.  40 is a challenging age for married people.  People that age begin to think they're getting old and undesirable, so they get excited when someone flirts.  What he should have done with those feelings was talk to YOU about them.   He chose...poorly.",
            "As a child of divorce, your children are entitled to their anger. They're losing a lot of normalcy and stability due to your stbx. He betrayed the family and security of it. Your responsibility in this is not to feed that anger and, if you can't provide one, to help  them find an objective 3rd party to work through their feelings. I will say, please don't do this through the school. It's just going to make that more a part of this traumatic experience. I second all of the calls for therapy, but it doesn't have to be formal therapy. I didn't want a therapist when I was a child going through this, and I relied on friends and relatives to help me make sense of it all until I was grown up. Make time to listen to your kids (I know yoube got a lot on your plate) and help them figure out what they need (if it is to be furious with your stbx, then so be it). He is responsible for repairing that relationship, you're both responsible for helping them move forward.",
            "I mean, you say he’s a great dad…. But admittedly he’s been a pretty shitty dad. When you cheat on your spouse you are also cheating on your whole family- your kids included. \nAnd with someone that your kid trusted. There will be rumors about this for years. That’s not something you can get over. \n\nYour husband needs to realize that he didn’t just hurt his marriage in this, he hurt his whole family. He uprooted their lives and obliterated them. All because he wanted to have kinky sex with his child’s teacher. \n\nMaybe they’ll forgive, maybe they won’t. He has to know that there’s a chance they won’t want him in their life. Especially as they get older and understand more",
            "Daughter of a cheater here: don’t force the relashionship. It will just hurt them more. \n\nCheaters are rarely great fathers.",
            "First of all, stop lying to them - he is NOT a great dad, because he destroyed their family, and great dads don’t do that. Kindly start taking care of them, and not him. “Yes, your father destroyed our family, but he really loves you” is a cognitive dissonance they should not be forced to endure.",
            "Let the kids grieve. Forcing them to placate their dad will only worsen things. Tell stbx that the kids will need time and the best way to heal his relationship is to be there for them while giving them space, allowing them to come to him. That doesn't mean allowing blatant disrespect of his role as Father, he is still an authority in their lives. But let them be mad. It's valid. Therapy for you all sounds like an extremely smart move",
            "Great dads don’t cheat on their wives.  When they cheat, the change the trajectory of their entire family.  How embarrassing must it be for your children.",
            "Let them feel what they feel if you interfere it will.hurt you in the end do not push for a relationship with thier father if they don't want one. Huge mistake my cousin made. Now her kids are no contact with both parents and probably won't be in their lives anymore",
            "Take him with you when you die.",
            "> he is a crappy husband but a great dad.\n\nEh, cheating on your mom with your teacher doesn't really push the \"great dad\" resume to the top of the pile.",
            "she ruined her own career for spreading her legs for a students parent. that’s her own fault. he ruined his life by making that decision.",
            ">He’s a crappy husband but a great dad.\n\nA good dad wouldn’t throw his children’s family, personal, and educational lives into turmoil by having an affair miss, you need to take off the rose colored glasses, stop soft touching this POS and flush. \n\nYour kids are so incredibly screwed socially when the reality of the situation spreads through the meaner students. Then they’ll come home to a world turned upside down. No way their teachers will treat them the same either.\n\nYou need to be on THEIR side and advocating for THEM, not doing his job as a parent for him after he betrayed you. Even now you’re trying to make him happy, get some goddamn self respect.\n\nGreat dad my fucking ass.",
            "Hi, I'm the daughter of divorced parents.\n\nPlease stop interfering in your children's relationship with their father.  I know you're their mother and that's meant everything has come back to you, but that's over now.  That's between the man you're divorcing and his children.  Your decision to leave your stbx is yours, and your kids now have to figure out how to deal with coming from a broken home.\n\nMany of us do and work out fine.\n\nI myself no longer speak to my father, and the fact that he cheated on my mother is definitely part of that.  But it's not the only reason.  He and I are not compatible humans.  It's sad, but that's how life works out sometimes.",
            "My mom is going through this now. My siblings are struggling so badly with it and I’ve convinced her to get them into therapy. They begged me to talk to her because mental health has never been something serious in my family and she eventually agreed. Your kids are struggling to cope and need help and guidance on how to deal with these emotions in a healthy manner. Go to therapy as a family and individually.",
            "He betrayed them, too. You can help them navigate their feelings so they're not actively resentful and negative. But you can not force them to forgive him. They're kids but they're full humans, too. They decide if and when to forgive him. ",
            "Individual counseling. I can tell by the way u talk that you have been gaslit and are susceptible to his narcissism, and I am afraid he will manipulate you ‘for the better of the kids.’ I don’t think you’ve seen his worst yet, so your mental awareness needs to be fortified with counseling. It is not your job to clean up his mess and make this better for him. Their relationship with him or lack of is their business. Let them have agency. Just support and love your kids. Get them counselors. Don’t jump into family counseling. They need space to heal on their own like you do.",
            "“Great Dads” don’t ruin their children’s family by sleeping with their teachers.  He is not a great Dad and insisting he is invalidates your kids feelings. “Oh he hurt you in a very avoidable way because he’s selfish, he can still be wonderful even if he hurts you deeply because the pain you’re feeling isn’t that bad!”\n\nHe’s a shit dad and denying that isn’t going to make your kids want him around. Him admitting he’s a shitty ass father and deciding to do better might",
            "Your ex didn’t just ruin your marriage he has impacted your children’s school life with his affair. Get the kids in therapy if you can do you can minimise the impact it will have on them academically. \n\nHe is trash for cheating and even worse for cheating with your children’s teacher. I hope she got fired and will struggle to find a new job.",
            "you just got to leave him man\n\nalso the kids should be the ones to choose if they even want shared custody, but\n\n  \nyour ex is  at fault, i dont feel bad for him and neither should you",
            ">He is a crappy husband but a great dad. \n\nYour husband slept with his child’s teacher. Good dads don’t tear their families apart, or put their children in humiliating positions.",
            "If it's fragile, let it break.\n\nYou can't force your kids to forgive their father they will only resent him more and will resent you too for shielding the consequences of his actions. They have the right to be angry. You can't change that. Time will come and it's up to them whether they want to forgive him or be civil at least. But you can never force it. \n\nIf your stbx is a \"great dad\" he wouldn't have cum inside that teacher. You can never shield them from the reality of the situation because it has happened. All you can do IS DEAL WITH IT.",
            "\"he is a crappy husband but a great dad\"\n\nHe committed the same life ruining act against his children as he did against you, how do people still justify this statement?",
            "Get them to a therapist ASAP. What they’re dealing with is too big for just you. \n\nSTBX is not a great dad. A great dad would never have done this to his kids. A great dad would have immediately realized how horrendous the blowback would be and not done something so selfish. Your dad was also terrible. He abandoned you to spite your mother for not tolerating his betrayal and disrespect. You didn’t have a father because he *chose* not to be one.",
            "Poor kids. Do they know you know? Get those kiddos some therapy and maybe talk to a therapist too to see how to talk about this to them.",
            "Why don’t you both start with couple counseling and individual counseling. That start will help you navigate and be prepared what is to come. As people, we do make mistakes. The problems in your marriage didn’t start with the cheating. Good luck.",
            "Crappy spouses are not good parents. When you hurt the mother of your children, you hurt your family, which includes the kids. \n\nStart with acknowledging that your kids are hurting because of what your husband did. If you tell your kids not to be mad at their dad because he hurt you, you are invalidating your kids feelings. \n\nTherapy can be very beneficial.",
            "Good dads don’t jeopardize their children’s families and schooling because they’re bored. He’s not a good dad. He betrayed them and their wellbeing too, S much as did yours. The difference is their relationship with him won’t end.",
            "He’s not a great dad, though. A great dad would never have cheated on their mother with their fucking school teacher.",
            "He isn’t a great dad.. of all the women he could have cheated with it was your child’s teacher… were they so stupid to believe it would not get out and it being your kids teacher it would affect them… \n\nYou are showing your kids how you won’t accept being mistreated and how you should treat your spouse… \n\nHe should be crawling on his knees begging his kids for forgiveness and for embarrassing them all over school and town… \n\nHe should have thought of his kids before messing up their life… they don’t owe him anything..",
            "He’s not a great dad. He cheated on you but he betrayed the whole family. Give your kids time, don’t push them. If they don’t want to see their dad right now then that’s part of the consequences your stbx has to deal with.",
            "Good for you and your freedom as for the kiddos therapy would be good and maybe family therapy with just you and your kids would be good. God speed for your healing journey both eyes and dick removal.",
            "Strongly recommend divorcing some of the people who gave you the listed \"advice\" too. It's up to you to judge who was giving voice to things you might not have considered, but still support your call and those who really hold values like that single moms are lesser partners or that a person should stay married to someone they despise so the kids can benefit from this \"A+ quality parenting\" he's shown so far. I don't remember the other bullets, but sincerely believing in any of them is disqualifying for both romantic and social relationships",
            "I'm of the opinion that if anyone is a bad spouse that automatically makes them a bad parent.\n\nA good parent treats the other parent with kindness, love and respect. Your husband did none of those things therefore he IS a bad parent. He ruined the chance for your kids to grow up in a happy nuclear family with both their parents. Not to mention if tbe rumors already reached your kids there's no telling what they'll have to deal with from their peers.\n\nPlease get your kids into therapy and don't try pressuring them to interact with the stbx.",
            "Counseling, counseling, counseling.\nIf someone had set me up with counseling when I was a kid, my life would be so much different than it is today. \nCounseling as an adult is great, but why wait for them to grow up when they can go now and hopefully have a better outcome in their adult life?",
            "Couple notes from me , my opinion only \nBut this is from the heart \n\n1. About the chores. If you are having these thoughts ask him directly “I know you are doing this all for a reason, because it hasn’t been normal in the past. Is this the way you plan to treat me for the rest of my life if I treat you in the best way possible as well?” Be proactive !!\n\n2. You can move on from all of this just like your family could together, including the kids. I’m not saying sweep It under the rug, by any means at all. Cheating is sinful. everyone knows what happened and accountability is huge. It’s a lesson for his sons if anything, especially if he truly regrets it deeply. They will see and hear that and learn from his experience id hope.",
            "If he’s a crappy husband he’s also a crappy dad. Good luck OP. I wish you and your kids the best.",
            "Here’s the problem- all their friends know their dad slept with their teacher. They are embarrassed & possibly being teased on top of feeling disappointed, disgusted & disillusioned with him.     \nOnly he can get their love back & that is going to take time & effort in his part. How to regain trust & respect- not an easy task.      \nBut this isn’t your problem. He caused it, he can fix it",
            "Good fathers don’t f@ck their kids teacher",
            "Sit the kids down & tell them they have every right to be disappointed with their father BUT you do not want them to hate their father. \n\nGive each of the kids a journal, it could help organize their thoughts, express themselves at anytime & could help release some stress.  When you are feeling better, go the support groups for divorcees & check if there’s a support group for children of divorce, could give you an idea on what to do next and help everyone process what they are going thru. Enroll the family in a boxing or kickboxing class and on the weekends, go to a park, have a picnic & walk around, both activities are a healthy way to spend time together, build up family moments  & it’s a healthy way for the kids to channel their anger.",
            "Dad just has to suffer, that's the consequence of his affair with his child's teacher \n\nYour children need counseling ASAP, but \"dad\" has to earn the respect of kids that he lost because he was a selfish 🥒.\n\n\nI was in your shoes, he cheated, and I made him leave. Cheating is the absolute deal breaker for me in a relationship, because the trust is destroyed, the respect is gone, and as you, whenever I laid eyes on him I just wanted to puke; he physically repulsed me.\n\nThe damage with his children was bad; because of his squeeze he got emotionally and verbally abusive with them and was neglectful to their well-being.\n\nIt took years to bridge their relationships and it still was not healed when he took his life, 20+ years after his cheating, which added more pain for them. My children still suffer and my grandchildren are bereft of their grandfather.",
            "I suggest getting to a good support sub like r/supportforbetrayed.   A lot of what you’re dealing with here has been faced by people there.  \n\nI’m very glad that he’s prepared to remain a good coparent. And that you’re considering family therapy to help with the separation.  The kids will need the opportunity to work through this too.  \n\nAnyway, give that sub a try.",
            "It's not about dying alone. You'll find someone, of course. But you've both ruined your family. You are complicit in that. Carrying on with the mentality that it is all his fault and allowing that idea to infect your kids' wellbeing isn't healthy for anyone. \n\nYou think you're gonna find a new man and everything will be okay? You're too old to be believing in fairytales.",
            "Be prepared to get the kids to a different school district, too. Kids can be brutal, and I could see some kids being bullies  about the situation.",
            "HIS SON’S TEACHER?! I BEG YOUR FINEST PARDON??!!!!!!",
            "What's up with women getting cheated on and wanting to be so graceful with their cheating ex ? Is this some karma farming ?",
            "Yeah, my father cheated on my mother when I was young and I stopped allowing him into my life past that point. I was what, 8? I knew exactly the severity of what he had done and was allowed to make that decision for myself. Didn't help him much that I... testified? Or gave a statement? about his negligent parenting that contributed to my mum getting full custody.\n\nLet the kids decide what they want to do. Yours sound morally strong.",
            "A man who devastates and defrauds the mother of his children is not a good father.\n\nSorry, not sorry.",
            "Dude was fucking his kids teacher. He permanently ruined all your kids reputation at school. He fucked up their home life AND their school life. He is not a good dad. He is selfish asshole.",
            "Dying alone is better than dying lonely",
            "He's not a good dad if he slept with their teacher",
            "He is not a great dad. A great dad doesn’t destroy their children’s life to have sex with their teacher. Not only are their parents getting a divorce because he did nothing to improve his mundane life, but now they are open to a new type of bullying. Get them to a therapist but they are allowed to feel their feelings. Dad made a choice. He chose sex with a random person over his wife and children, that’s a lot for the kids to deal with.",
            "No he is not a good dad he’s terrible and selfish. He chose to cheat with his child’s teacher without caring how it would affect you or them. Also DO NOT force your children to forgive him, they are entitled to their feelings and have every right to hate or resent him forever if that’s what they choose",
            "get  half of his assets,  sue him for 50 c change he forget about , let him rot in prison as he goes bankrupt couse he cant work now. he will die in poverty , you die alone.. fifty fifty..",
            "Just from the title, dying alone is preferable to dying unhappy.",
            "He’s not a great dad.",
            "I experienced very similar circumstances as a child. My parents had been married for 17 years when one of them cheated. My brother & I were about 9 & 13 at the time. It was tough as hell in the beginning when they were still trying to keep the marriage together. There was a coldness in the house bc of their lack of speaking to one another and the resentment and anger. When they did speak it was typically to fight one another. It’s was sad, lonely time. Within a couple months they told us they were getting divorced. We were both very upset and scared about all the changes. My brother stayed with my Dad & my mom & I moved out. As hard and as sad as all of that and the adjustments that came with was I realized that it was better than going back to them staying married just for us. A lot of people told my mom it was a mistake to leave and in just 9 years or so I’d be 18 & she could leave then My mom responded with I love my kids immensely and I owe them a happy childhood but I do not owe them my life. Both parents remained in each child’s lives and they coparented as best as anyone good. They attended our school & extracurriculars together and for the first couple years they still did thanksgiving & Xmas together. As time moved on so did they and I’m so glad they did.  It meant we were raised parents who were happy and trying hard to live their best lives. They both went on to have successful careers and successful second marriages.  Divorce is certainly hard on kids but a loveless, anger filled household would’ve been so much worse.  Give yourself & your kids some time to adjust and I’m certain they & you will be happier. Good luck on your new beginning.",
            "He’s not a great dad; he cheated on you. Allow your kids to process their feelings, they’re part of your family as much as you are.\n\nSorry for the shitty stbx and best of luck.",
            "Guys (and women) are like the city bus. When this one leaves, another will come along in about 10 minutes.",
            "If he was a great dad he wouldn’t have cheated and he def wouldn’t have cheated with their teacher. Now the whole school knows. He’s a crappy husband AND a crappy father.",
            "Betrayals are so very hard to overcome.  Co-parenting sounds like a hard enough task- so I couldn’t imagine trying to go back to a real marriage type relationship afterwards.\n\nYou’re absolutely doing the right thing for not only you but your children as well.",
            "For god sake move and start iver with the kids",
            "I would have this teacher fired…. What kind of person sleeps with their students parent??? \n\nMy ex husband no longer has a relationship with our son due to his extra marital issues. We have been divorced since 2012, but this man has done everything possible  to embarrass himself and us. My kid is embarrassed, there is no fixing it. The damage is done. We are NC and are in therapy. \n\nI would say if the kids don’t want to see him right now, it might be better to not make them. They need time to heal from this betrayal too. He didn’t just betray you. He betrayed the entire family and your ex husband needs to understand that. \n\nThat’s the thing that pisses me off the most about cheaters they always think it’s about them. They never give a fuck about anybody else, and how this is going to affect them. Let the motherfucker cry because that’s what he needs to do right now..",
            "Don’t get in the middle of their relationship with their father. He betrayed them and he needs to do the repair work, even when his kids are reflecting the contempt he showed them, their mother and their family unit.\n\nHe needs to be patient while they get counseling and take the lead of the child or counselor.\n\nIf you fix their relationship, it won’t actually be fixed. My stepmom did that shit for my dad and I despise him extra hard for that cowardly, spinelessly, hiding from the consequences of screwing over his kid. I also trusted her less bc she was basically insisting that no matter how mad I felt, he was my still dad so I couldn’t show him that or I would hurt him. \nShe still prioritized his feelings over mine after he hurt me, be wary of wading into that murky territory.",
            "I have a cousin going through this just now. Her husband cheated on her and it never occurred to him that their teenaged children would understand what he did and hold him responsible although she freely admits that she's at least partially to blame because they never addressed issues in their marriage and she is working hard to get the teens help that they need.\n\nHe is now stuck in a crummy apartment and the kids will not see him. His family despises him. Her family despises him. And for some reason this highly intelligent and highly educated man never considered that would happen.\n\nAs for dying alone? Only if you choose to. My cousin has found many similar stories and has been told many times to call for a date once things settle out and she gets her life back together.",
            "If you know you want a divorce, like really know, get one. Plain and simple.",
            "I am so sorry you are going through this. One big thing, please, please, don't force your children to be a part of dads life. He broke his promise to them as well, as to you.  They deserve to have their feelings validated and honored in this. He certainly could have cared less about any of his families feelings. His shouldn't be considered now with the consequences. \nAs far as being alone forever- being alone is far better than staying with a venomous leach who could care less about you and is only concernedwith themselves. However, with billions of people on this planet, there are more people to meet and spend actual quality time with.",
            "that makes sense. the overwhelming response to the other thread was \"divorce him, he deserves it, he's doing this to the kids, not you.\" in a sense, yes, that's all true. it's still happening to the kids, so it doesn't really matter who caused this to happen to them. what matters is whether you wish to do this to them or if you can try to fix it. \n\ni also don't think your kids should know about why this happened at their ages. that's wrong in my view.",
            "My question is what caused this??? Because this doesn't just happen. Some people are at the end of the rope and can't take it. They do this because they can't ask for a divorce or sex. There is always reasons behind something.",
            "DIE ALONE!! Better than living with a cheater?",
            "I am so sorry for you and what you’re going through but I am even more sorry for your kids.  When they are that young they see parents as these beacons of stability.  For your husband to have done what he did undermines all of that and is a betrayal of them on a huge level.  As adults we know parents are people and flawed but kids learn that slowly and your kids learned it fast,  make sure they know you love them and get them into therapy so they can learn to cope with these emotions.  I am so sorry for what you’re going through but also proud of you for going through with the divorce.  Staying would hurt you all, leaving him gives you and your kids a chance to heal and a chance for him to work on actually being a good and present father.",
            "Counseling as a family and individual,  each child has their own session's ",
            "I’m so glad you weren’t swayed by him stepping up for two measly days and doing everything. Bc at very surface level it seems sweet but when you think about it you realise he was more than capable of doing that the whole time and chose not to help out when needed. He thinks he’s doing a great thing but is just showing truly how deep is shittiness runs",
            "Off topic but: Thats the first time I've seen someone other than my mom describe their ex as a crappy husband but a great dad. Its interesting to see it from someone else!",
            "You can definitely do therapy for your children but you have to understand if the relationship is broken between them. My father was lying cheater and I haven’t spoken to him in 11 years. Sometimes children can cut off a parent and you can’t stop them from hating him for what he did. He embarrassed them, hurt you, hurt them and ruined their family. Some people never let that go",
            "You can’t force your kids. He not only cheated on you, you have a family , he cheated on his whole family .",
            "Everyone’s talking about your soon to be ex-husband and what kind of parent he is, but let’s talk about you. From what I’m seeing, you seem like a great mom. Not only are you thinking about your kids first and foremost,  but you are saying things like, “I still want my kids to have a dad and don’t want them to hate him”, “I want them to be better than both of us” and “I wish I could shield them from everything”. You seem like a rockstar mom and getting a divorce or being a single mom won’t change that. You’re kids are lucky to have a mom like you.",
            "My ex abandoned me when I had a kidney transplant (he refused to even be tested, that was a clue ) my brother donated. Always Always play the long game. Do not criticise the ex or blame the new person. (It's very hard) likely that relationship isn't going to be as perfect as the ex hopes anyway. Your ex is forever.  You will be grandparents together. Your kids will need you. My son asked me why Dad left when we seem to really like each other. The simple reason is i had a kidney transplant and he felt like that was my problem, and he met a woman at work (his intern, whom he was fired for dating) and he was early forties crazy (I'm going jet skiing and camping! I knew him 20 years, he's a couch potato and did each if those things once)\nAnd I was too busy trying not to die to deal with him. I spent exactly one year hating his guts. Then i let it go. My son needed to feel ok to love his Dad. Thankfully he is a great Dad. We recently attended my sons wedding and he said\"its like we aren't friends anymore \"  so I guess he thought we were lol yes, I see all the things I once loved about him..but I dug a hole and buried the past to we could move on. Ps. I suggested a name for our son in 1995 and he \"hated\" it and told me stop asking..21 years later his wife had a baby and not only is it that same name (first and middle) but I heard him tell someone he thought of it lol I still have not pointed that out (he's a cute kid and it's an awesome name) but I have that under my hat if I need it :) good luck!",
            "The kids are entitled to their feelings... just like you.\n\nThey are trying to process what has happened and note.. they dont have a say (unlike you) in your relationship, but it still effects them. \nYour STBX affair partner was teaching at their school.. so this effects them EVERYDAY.\n\nFor me this doesn't make him a great dad. but an absolute AH. He shat where his kids learned. He truly didn't think about his kids, and not even his affair partner... as he destroyed all of their worlds. \n\nand he did it cause he felt he was stuck and bored in a routine.\n\nHe sounds like the most immature selfish person I've heard on Reddit for a long time... and not a great father\n\nwhat did your Ex expect... them to do... says its okay to cheat with a teacher from school?\nLet them tell their dad he is a AH... he deserves it.",
            "Well done. Now hold your head high. You did nothing wrong, it was your husband. He is not only a bad husband but also a bad father. He broke your home with his deep betrayal. Do you want someone like him to be a role model for your children of how relationships work? Do you want your children to think cheating is ok? No right. Its up to him to fix his relations with the children. You are not your husband's mother. You are your children's mother, they need you as much as you need them. Be with them.",
            "Idk why so many people \"stay together for the kids \"\n\nI've been to homes where the parents are clearly in that situation.  They aren't as sly as they think. There is always tension in the air, and everyone is walking on eggshells.\n\nI'd always hate going to my friends house because you could tell the parents just hated each other",
            "I've read the other post. The reasons they gave to you to stay are shitty specially about men always cheat. People who wants to cheat will cheat regardless of gender. You can't make them not cheat cuz if they want to they would. You could be the perfect partner they'll still cheat if they wanted to. ",
            "Let them hate him, be cold to him, OP. Let them feel the emotions, process the betrayal and hurt. Don't take the responsibility of mending their relationship with your ex. \nHe has to fix the mess. \n\nMy late grandpa cheated on my grandma, she stayed. Which inevitably impacted my mother's formative years. Decades later, my mum divorced my dad (for abuse). \nFor the longest time, she pushed us (the kids) to maintain our relationship with our pops. I remember feeling extremely angry about it. \n\nShe had the same reasoning, \"he's your dad/you shouldn’t deprive yourselves etc.\" \nThat did little to quell my rage lmao. I was the same age as your oldest. \n\nThe only reason I have a civil relationship with my old man after almost 12+ years is cause I regard him as an acquaintance. \n\nTldr, get them a therapist but don't push them to mend the relationship.",
            "Damn the whole school knows Jesus Christ ",
            "You are strong woman and such a good mother. To find the strength and grace to want to have a positive co parenting relationship with your ex and put your kids first. We all know thats what we should do but so many get caught up in the fight and pettiness and forget to make sure their kids are ok",
            "\"That he just thought it would be great. Because we got so stuck in our mundane lives that the affair was an escape.\".\n\nEuuuugggghhhh god....I have heard this type of couple in every Reddit post and it's getting exhausted. One of the many factors to this is just desperation.\n\nDivorce is good. But if you want your kids to forgive your STBX, is you need to reconcile, which is IMPOSSIBLE! Your children followed you to the end. It is what it is.",
            "We all die alone in the end we just like to imagine being surrounded by family friends and loved ones but it is a journey you must take on your own. Don't let fear make you complacent.",
            "OP im sorry you all are going through this but please don’t push you kids to forgive their father. I hope you see that what he did affected them as well because everyone knows it also means that your kids friends and peers know and they may be embarrassed and probably having to deal with the rumors as well. Your kids need counseling so that they can deal with this in a healthy way and learn to come to terms with all of this because now they are having to deal with an adult situation as kids. Your husband and that teacher dug their own graves here and your kids are mad and they have that right to be. Your husband lost the great dad award when he betrayed not only you but them as well so please stop with the “hes a great dad” talk because he’s really not and had he really been that great of a dad then he would have thought about the fallout of his actions.",
            "I wish I had left after affair #1.  I stayed for almost another decade, he continued to cheat.  After we split, one of his (former) friends reached out to me.  We became friends, then realized there was something there.   This was at 47-48 years old.   Open your heart again and let a new, faithful love in.  Not all men cheat, just a$$holes do.",
            "I hope that everything goes well for you and your kids",
            "I have a feeling that he will change, and they will end up reconciling.\nHe seems like he's truly remorseful",
            "My wife was in a similar situation as you are.  It wasn't cheating it was mental abuse, she left her ex when she  was was 34.  She did this even though she loved her children very much, but the situation was untenable.  She told me recently, at that time she never expected to meet anyone who wanted to marry her. I met my wife seven years ago when she was  35 years old.  It took me over a year to finally ask her out as we are both very shy.  When she told me about her three kids, I wasn't scared away, more excited to meet them.  We got married last year when 2 of the kids came to visit \"her kids live with their dad and the middle son and had school. \"  This year her oldest is staying the summer with us and the other two for a month or so and we couldn't be happier.   You just never know what the future brings, you are doing what is best for your health, which is the right thing.",
            "A good dad doesn't do what your husband did. He didn't just cheat on you. He sabotaged the entire family unit. Your kids deserve to feel what they feel. If he takes that coldness and endures it there is a chance they might warm to it. If he bails, then he confirms what he told the family through his deeds. That he isn't worth having.",
            "I just wanted to ask about the ages because in the last post, you said that you were together for 20 years. Birthdays can he difficult to calculate, but did you guys start dating when you were 17 and he was 20? Just a question, there is a big possibility that you guys could have started dating after your 18th.",
            "Your kids will take their cue from you.... your behavior with your Starbucks (I thought that's what stbx meant for the most part of this post) will dictate how they behave.",
            "Just curious when you said no screen time for 48-72 hours, that means, you couldn't call anyone since that would require turning on your smart phone or does that mean, no web surfing, social media, Reddit, etc?",
            "> but he still has to be there for the kids.\n\nWrong.",
            "What a horrible situation. You all need to put time between now and when it’s feel better. Strap in and i know it’s cliche but hit the mf gym",
            "Gosh, that's a lot that happened in 2 days!",
            "Hey, from a guy who is dating a mom of 2, let me tell you that it will be very hard for you to find a partner for a long time. \n\nMost men do not want to be with a mom, and definitely not a mom of 3. Most guys will want to be with you to use you. \n\nYou will also have to be very careful about the people you put around your children.\n\nAs I had a step dad I don’t mind dating moms, but usually with only one kid. But the woman have to be an amazing woman like my partner. She kind, caring, easy going, loyal, and there is no BS in our relationship, also we share a lot in common. \n\nAnd even with all that, for a while I wondered if it was worth it to take on the two kids and have to deal with ex husband.\n\nFor her I believe it is worth it, and the kids and I get along with them fine. Most men do not want to deal with another’s man children.\n\nBut it will be really hard for you to find a good guy. There is a really high chance, you will be single until your kids are all out of the house. And be in and out of short relationships (flings).",
            "I think the reason why you mum is wrong and you are right is your husband could always win you back. Just because you want a divorce now doesn't mean you know for a fact you won't want to be with him in 20 years time.\n\nYour mum is treating it like the divorce CAUSED your dad to abandon you. But that isn't true. Your dad chose to do that. After the divorce he could have stuck around, put extra effort for decades and your mum could have learnt to forgive him etc. The fact that his chose to simply abandon his kids is evidence she did the right thing because he was a shitty person.\n\nYou divorcing him is asserting those boundaries as he's done a shitty thing. It seems your kids would be behind it.\n\nThe balls now in his court to win his kids affection back and yours, it's not up to you to worry about that stuff. Even with extreme conservative Christianity that is against divorce there is a verse that says its acceptably with infidelity. It's so so normal to want a divorce after cheating and it's so hard to repair that trust.\n\nAll the negatives listed in your OP only are bad if he decides to continue his shittiness and leave. (although divorce is likely to be really expensive so that is one real negative)"
        ]
    },
    {
        "post_id": "3hakl2",
        "author": "mybfuckedmymum",
        "title": "[Update] [24F] My BF [25M] of 3 years cheated on me with my mum [52F]",
        "url": "https://www.reddit.com/r/relationships/comments/3hakl2/update_24f_my_bf_25m_of_3_years_cheated_on_me/",
        "score": 2481,
        "num_comments": 257,
        "created_utc": 1439799788.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/3h37bz/24f_my_bf_25m_of_3_years_cheated_on_me_with_my/)\n\n\n**tl;dr -** found texts that suggested my bf had sex with my own mum, i dont know what to do now.\n\n---------------------------------------------------------------------------\n\nSo after having some time to think about the situation, I decided that if my mum and my BF were sympathetic about their actions, I could forgive them and move on with them in my life.\n\nJust kidding :)\n\nFirst of all I want to thank all of you for your extremely kind and reinforcing replies. I read every single one of them and (although some were... interesting) I never expected to receive such amazing support and encouragement from strangers all over the world. I also received dozens of PMs, with some even offering me a place to stay or simply someone to rant to. I can't thank you all enough, you made me see that I will be okay after all of this is said and done, and for that, /r/relationships, you have my eternal gratitude. (Also thanks to the guy that asked if I was interested in a threesome, appreciate it). \n\nA fair bit has happened since I put up my post a couple of days ago, but I'll try to keep it as brief as I can. After 3-4 hours of reading your replies, I decided that I'd drive home and grab some essential items before my BF got home from work, and stay a few nights at our local motel. A few of you suggested that the texts I saw may have not been from my mother, but I'm 99% sure that the pictures I saw in the texts were of her (plus I was far too scared to face my BF or mum to double check). \n\nBy the time I got home it was getting fairly late so I tried to grab what I could before my BF arrived. Unfortunately, as I was looking for my laptop I heard his car pull into our driveway. At this point I practically just grabbed what I could and tried to get the hell out of there - I really did not want to see him ever again. I got down the stairs and he opened the door. I'm not really sure what happened, I just started bawling my eyes and screaming, harder than I had been all day, and booked it for the door. He stopped me as I was trying to get past, but I told him to leave me alone and that I'd be back later that night. He did, surprisingly, and I got in my car and drove off.\n\nI mentioned in some comments in my last post that I was sort of friends with the lady who owned our local motel. I was good friends with her sister when we went to high school, and I was sure that after I explained myself she could get me a room to spend a few nights in. I pulled over and rung her up, and whilst trying to convey to her what happened I just started crying hysterically. She went above and beyond what I ever expected anyone would. She offered me a room in her own house for free, and told me I could take as long as I needed. Since then I've basically gone between sleeping and crying, and only left my room to eat and go to the toilet. I am in extreme gratitude to her though, the support I've received in general over the past 2 days has been staggering. \n\nI turned off my phone last night but I know my BF was blowing it up. I didn't look at any messages or missed calls, but I saw that the notifications were there when I went to turn it off. He'll have no idea that I'm here though, so I guess it's nice to know that I can take a little while to recover without him finding me. \n\nI didn't mention this earlier, but my BF was the only one on our lease. I'm currently unemployed whilst he has a fairly well-paying job, so hopefully that'll make everything a little easier. As for my mum, I'm pretty much done with her. I plan to move across the country to find a job interstate once I've gotten all of my stuff, and basically never talk to either of them again.\n\nAs I said, I still need to get all of my belongings from my BF's place, which is going to be tricky without seeing him. I'm not sure how to go about that and I guess I'm looking for suggestions.\n\nAs for me, I'm doing okay. Right now I still can't believe any of this is happening. Sleep is my only source of comfort right now as it allows me to forget all of this is going on, but when I'm awake I can't shake the feeling of dread and constant sickness. But, again, all of you gave me the strength to know that this will get better, it just can't come soon enough.\n\nAgain, thank you all so much for your words of encouragement. Hopefully I can get my stuff with no troubles or dramas, and update you all when I begin my new life (without my mum and my ex).\n\nLove you all <3\n\n**tl;dr -** Staying at friends house, need help on how I should get my shit back from my ex.\n\n",
        "permalink": "/r/relationships/comments/3hakl2/update_24f_my_bf_25m_of_3_years_cheated_on_me/",
        "comments": [
            "It sounds like you've made solid decisions - well done OP! If this is how you act during crazy times like these, you've got little to worry about.\n\nIf you can, simply ask a friend to be in contact with him. Get them to agree a time when he won't be there, she can arrive early see him out, and give you the green light to come collect.\n\nEdit: You did good OP. Proud of you!",
            "They don't know they've been caught yet?",
            "[deleted]",
            "[deleted]",
            "Rock on, OP. Do your best to gather more support around you - in addition to your motel-owning friend, see if you can get in contact with more people, preferably people with connections to your future city/state. A support system is especially important now, in the face of this event as well as a major, life-changing move.",
            "I feel I need to be a rational voice here but at some point you need to confront your ex bf and your mom. \n\nYou need to confirm what you saw is actually what happened and make it clear that you are gone. \n\nWhen you go to get your stuff I would definitely have an officer there. ",
            "Well done, OP. It's awesome you have a good place to stay.\n\nDo you know (or does your friend know) any big guys who can go with you to get your stuff? Not so much to help you gather everything, but to be there just in case the exBF were to show up? I really think it's better if you have people with you; given the situation, I'm sure you'll have plenty of volunteers.\n\nKeep your chin up and know things will be okay for you going forward. ",
            "Stay safe, OP. ",
            "Are you positive it's your mom yet? I would cut her out unless I make sure with 100% certainty it's her. ",
            "I admire your strength through this. I'm really sorry to hear that this happened, though. Remember that you are worth way more than to be treated this way, and things will get better. ",
            "I F(26) him M(25). We were engaged I broke off the engagement after he physically assaulted me in August of 2014, found out around Christmas of 2014 that my mom cheated on my dad with him. My mom refuses to apologize, they are still together. \nUntil my mom apologizes and  stops choosing men over her children, I will not be speaking to her or bring my child around her. ",
            "OP you're a strong girl. You can do this!",
            "I hope you manage to get some closure after all this, and are able to relax and put both of these scumbags behind you. Much love!",
            "I don't have the time to look through all the comments and see if anyone's mentioned this, but if it makes you feel better, you could call the police and explain the situation to them and have one or two escort you to your BF's place so you can gather the rest of your belongings without having to go alone or ask someone else to go with you. :)",
            "This may get buried but I've gots to try.\n\n\nI'm not sure if anyone else has mentioned this yet but try to post your situation (focusing mainly on you couch surfing right now) in r/almosthomeless and they may be able to give some good advice and resource to help you get back on your feet!\n\n\nGood luck!",
            "This could be a long shot but have you tried contacting your Dad? \n\nI've heard countless stories about children who grew up hating their Dads for abandoning their family when it was the mother keeping the Dad from the family all along. \n\nAgain, it's a long shot and may very well not apply at all, but I didn't see it mentioned here so figured it was worth a shot.\n\nGood luck OP, stay strong. ",
            "All the best for your future - and please do not get back to your parents either. They are truly sick people, your BF and your mother.",
            "Deep breaths. Keep taking care of yourself. Your life is only going to improve.",
            "Call the non-emergency police line and have an escort help you pick up your stuff. They do this sort of thing all the time, so I'm told. I wish you all the best.",
            "make friends with some big burly guys,\n\nhave them go get your stuff for you :)\n\n",
            "Godspeed OP!",
            "Stay strong, you can do this.",
            "Good job OP. Don't wallow for those 2 for too long. They don't deserve your tears. Get up, start looking for a job and move on. You will be fine. ",
            "What is your mom saying about all this ? ",
            "That's massively fucked up, but it seems you're handling it about as well as anyone could be expected to.",
            "I can't even begin to even type out what I'm feeling. I'm so sorry. I feel such disgust and horror for what your boyfriend and mother did. I can't even begin to imagine what you're going through.  Stay strong and don't waver with your decisions. Make sure you take care of yourself and eat properly. ",
            "Your mom directly altered the course of your life so much by doing this. I really hope you do well so you can make her regret the decision she made for the rest of her life. What a terrible person. ",
            "RemindMe! 2 weeks \"what happened\"",
            "What a kind lady to offer you a room in her home. As for getting your things, you can request a police escort while you gather your things. I don't think you even need to claim abuse or anything, just that you'd like someone there while you gather your things. I'm so sorry this happened. You'll be okay.",
            "Local law enforcement are available for this kind of situation.  Just call them up and have an officer meet you at your old place to get your things.  They are not going to stay for hours, but if in 20 minutes you can get most of your things out of there, they should be willing to wait around.",
            "Wine and ice cream. Trust me.",
            "OP, can you give us an update?",
            "I've never understood people's decisions to not seek closure - \"go full NC!\" \"Don't even talk to X person again!\" \"just leave and don't say a word!\"\n\nI guess it's almost a coping mechanism or a way of running from a possible persuasion from the 'cheater'\n\nIn a situation like this, I would 100% need to give both of these people a piece of my mind. It would be the only way I could move forth, I guess it works the opposite way for others.",
            "Good for you OP.\n\nIf you have keys to your ex's house, I'd just wait until he's at work and go get it (assuming you have a car).\n\nIf you don't have a car, maybe ask a friend who does and do the same.\n\nIf you haven't got keys for whatever reason, you're pretty much stuck going over there when he's home. If that's what you have to do, I would get a few friends to come with you and deal with him (explain what's happening and tell him to get out of the way and not speak) so that you can get your stuff in relative peace.\n\nBest of luck with your move!",
            "Wow, I wish there was some way I could help you out other than just telling you you did the right thing.",
            "You will survive this, OP. I know it is hard to hear that now, when you feel small and hurt, but you will power through. There is hope, it always gets better after a while. You will be able to breathe again and to connect with people. These wounds will not hurt forever. Maybe you can't believe it right now, but we do, and I hope this gives you some strength!",
            "I just read the original post and this one for the first time. I sincerely hope you're doing well and that you can eventually overcome whatever sadness is still within you. Do try hard to let it pass over/through you and know that it can only make you stronger. Few people have ever gone through such an ordeal so you are already stronger than 99% of people in the world!\n\nLike you said it's extra special seeing the support you've had here!",
            "I still think your bf's a fucking hustler",
            "Hey OP, [here's a similar situation](https://www.reddit.com/r/relationships/comments/3h6wpg/my_mother_66f_and_father_67m_want_back_into_my/) (WTF) where the OP rebuilt her life much better than originally by moving and going NC with scumbag ex and mom.",
            ">I didn't mention this earlier, but my BF was the only one on our lease.\n\nBINGO!  When you decide to move out, ring up your local police, don't call 911, and ask for someone to escort/assist you while you move your items out of the apartment.  You don't know how he will react when he learns everything and better to be safe than sorry.  Since you are not on the lease you have ZERO obligation to anything that goes on there.",
            "Thank you for this update.  I've been thinking about you.  Sounds like you have come up with a good plan.  I wish you the best.",
            "Unless this seems like something believable for your mom to do, keep in mind that it's certainly possible your boyfriend hired/found someone that looks roughly like your mother to act out his MILF fantasies. I'm saying this assuming there were no clear face pics because you talked about the evidence like you were \"mostly\" sure it was her.\n\nEven if you're 90% sure you should definitely confront her in the near future just in case the teeny tiny chance she's innocent is actually the case. I'm assuming you really valued your relationship with her.",
            "I'm so happy you managed to get down to the motel! Good luck with everything, please feel free to update us whenever. I hope everything goes alright, you don't need these toxic people in your life!",
            "Good people will always prevail! \nGo on an adventure and find yourself. You will find whatever you are looking for whether it is love, stability, wealth, or a new life. ",
            "> As I said, I still need to get all of my belongings from my BF's place, which is going to be tricky without seeing him. I'm not sure how to go about that and I guess I'm looking for suggestions.\n\nYou will have to communicate with him at some point, but you do not have to meet him if you don't feel like it. You do not owe him that or anything.\n\nIf he has any kind of decency something along the lines of \"I saw the texts between you and my mother. I do not want to see you, please tell me when you'll be out of the apartment and for how long so I can pick up my things.\" will work.\n\nIf he starts trying to argue or demand to be there when you go to pick up your things you're gonna have to send a friend.",
            "This may be a bit extreme but if you don't feel safe going back there by yourself to get your stuff you can ask for a police escort. Basically they'll meet you there and make sure that your ex won't bother you while you get your things. \n\nI've had to do this once and I know that if the two police officers weren't there to occupy my ex I would have lost my resolve and caved in. I was able to go in and quickly gather my things without having to worry about where my ex was and what he was planning. \n\nHowever you decide to go about this I wish you the best. ",
            "Get a police escort for collecting your stuff?",
            "I don't know why everyone is telling you to leave without talking to both of them, one of them being your single mom. Whatever happened, she is still your mother. Being an adult and dealing with the situation also means you have to pick up the courage and confront the two most important people in your life, until a few days ago. You owe it to yourself. Otherwise it just looks like you're fleeing and I don't know why there are such few people on this thread who don't see it. \n\nTell your mother what you've found out and what you've decided to do. It's not taking her permission, it's informing her that you've taken a decision and she's the one who has caused the pain. You can ignore doing the same for your boyfriend if you want, but at least leave a note. Do the right thing! All the best, OP! It's a good life and the road definitely doesn't end here! :)",
            "So...you found texts on a phone, assumed who they were from, never confronted anyone involved, and ignored all attempts at follow-up communication...?\n\n",
            "I'm so sorry about this. PM me if you need anything!",
            "If you don't have any family attachments and don't want them always finding you and popping up in your life later on, you might consider changing your name...it'll be a good way to close that chapter and hopefully stop them from causing you any trouble in your new life.",
            "I wish you, from the bottom of my heart, that you won't loose the strength you posses right now.  \n\nI don't know you but I truly want you to be happy.  \nI know exactly how betrayal feels and I can imagine what you're going through right now. \nAnd I want to fucking punch these two in the face for being awful human beings.  \nPeople like these are the reason why I'm having trust issues and trouble living my life.  \nI hope you're not going to end like this. Be strong. You don't need them in your life to be happy.\n\nPlease don't forget to keep us updated. I want to know that you're doing alright.",
            "I think it might be a good idea to talk to one of your mom or your ex. Moving across the country without any closure might cause some problems down the road.",
            "I'm so, so glad you made it out. Don't let either of them talk or suck you back in. Keep us posted and again, if you need a shoulder, I'm here!",
            "First of all, I'm sorry this happened to you, seems like an awful behaviour from your closest... ;(\n\nYou probably will anyway but try to confront your mum in person about this when you're calmer. And be prepared for unexpected reactions and answers...\n\nMake sure that in the future you remember and pay the support back that this lady in the motel has given you, maybe not directly to her, seems like an amazing random act of kindness :)",
            "to get your stuff back make sure you get a police escort to his house, let the police know your situation and usually they'll help you out!",
            "Okay hold up... before you do all this, maybe you should actually tell him what you saw on his phone then break up with him; because from his perspective he's probably wondering \"What the fuck is going on with mybfuckedmymum?\"",
            "Make sure to thank the Motel owner when you finally pick up and leave. She really did help you out and a simple thank you goes a long way.",
            "You are so fucking strong. You probably won't even read this, but in case you do just know you are doing the right thing.\n\nBoth of them can fuck right off. You have a chance to create a new life, do whatever you want. Start over. I recently went through a breakup after being 5 years together, and I can't even imagine how hard this is for you.\n\nYou are going to be a stronger, better person once you get through this. Life is hard, and you can do hard things. \n\nYou're a badass!",
            "You haven't confirmed anything with your mom?  I know that you saw messages from\"Mom\" but are you sure that the messages came from your mom's number?   Your BF is a cheater regardless but you should really have words with your mom.  For now take time to collect yourself and figure out your next move.",
            "I said this last time, are you sure it was your mum? Plenty of people RP by changing contact info during conversations as part of characters. Your ex is still a pile of shit for the cheating/texts but it's eminently possible your mom had nothing to do with this.",
            "OP, you have absolutely no idea what is going on. The chance that he's cheating on you with your mom is ridiculously low. It could easily be a contact with the same name or who looks similar in pictures. For all you know its a running joke between them (an inappropriate joke nonetheless).\n\nYou need information to figure out what is going on. Talk with your mom first. She's family, and you don't want to cut her out of your life and discover 20 years later that you completely misunderstood everything. That would ruin the rest of your mom's life, and deeply damage your life, over nothing at all.\n\nNo one else knows what is going on in your head. They all probably think you've gone crazy. \n\nSuck up the emotions, stop speculating, and get real information. That is your best way forward. You owe that to yourself, and to everyone else. Seriously, you're trashing all three of your lives and you don't even know what's going on. Your worst-case scenario is not that your suspicions are true (that would be horrible nonetheless); your worst-case scenario is that you misread everything but run off, and leave everyone you cared about for no reason at all.",
            "~~What country are you in? You say Mum, but you then say Motel? I'm so confused.~~\n\nEdit: Found the answer. Best of luck with your future.",
            "Just to chime in. Don't think you are alone in this.\n\nI know someone whose mom was trying to hump my friend's  husband. Apparently, creepy, horny moms exist. \n\nObviously these are NOT really 'mothers', they are creatures who just happened to birth human beings who have no business rearing them. \n\nI wish you the best, honey. <3 Chin up, and with \"family\" like that who needs enemies? That always helps me through things. ",
            "You are performing admirably in this incredibly shitty situation.   \n\nGood luck in your move!  A clean slate sound like exactly what you need right now.   ",
            "If he doesn't get physical with you go get your stuff while he is there and show him what a mistake he made.besides you need closure you can't just move to the other side of the world and avoid them forever I tried this before it does not work and is a very lonely feeling.sit down talk It out with them even if you still hate there guts you have to get the. You have to get the courage to face them they done you wrong not the other way around you shouldn't be ashamed at all or be hiding from anyone or anything ok ",
            "[deleted]",
            "You can go to the local police and ask for escort to get your things - tell them you're afraid as your ex tried to forcibly stop you from  leaving the last time you went for your things. \n\nAll the best of luck to you!",
            "i'd just like to offer one voice as the devil's advocate:\n\nyou are about to totally re-write your life story, and exclude two people who are extremely important to you from it.  that is an extreme step to take.  i'm not certain it's the wrong one, but understand that it is extreme.  \n\ni get it -- the breached your trust in a horrible way.  but it was -- perhaps -- just a mistake, and if it were only sex and not love you might want to consider trying to make amends.  \n\nit's hard for me to say that, i know, since none of this is your fault.  my only concern is that you might regret your decision much later if you completely remove your mother from your life.",
            ">(Also thanks to the guy that asked if I was interested in a threesome, appreciate it). \n\nYou miss 100% of the shots you don't take.",
            "Is all of the stuff you have there super important,  or could you abandon it (I'm thinking you got what is important and maybe just have some clothes left) and just start all over somewhere new? If that's not possible, is there a friend you could have collect your things for you so you don't have to face tyour bf? Is there any family you can lean on and tell about what your mom has done? I'm all for you not having to see either of these cunts again, but it feels like you're keeping a secret for them that you shouldn't be burdened with and they should be rightfully shamed for.",
            "You need to forgive, but that doesn't mean you forget or restore trust.  The forgiveness is not for them, it is for you.  ",
            "That motherfucker!",
            "Hell yeaaaaaa!!!",
            "Fake.",
            "So how was the threesome? ",
            "I can't help but notice you didn't answer the guy about wanting the threesome.  ",
            "I'm just curious as to what you and your mom look like at this point. ",
            "is your mom hot?",
            "Get a job. ",
            "Didn't she move across US and had a kid like...few years ago. \n\nThis is some time-skipping shit right here!"
        ]
    },
    {
        "post_id": "125gun1",
        "author": "throwRAghostshy",
        "title": "I (15M) broke my arm playing football. Mum (38F) is upset I asked my friends to get my other Mum (40F) who's a surgeon. (38F) left and is staying with friends.",
        "url": "https://www.reddit.com/r/relationships/comments/125gun1/i_15m_broke_my_arm_playing_football_mum_38f_is/",
        "score": 2480,
        "num_comments": 142,
        "created_utc": 1680076619.0,
        "selftext": "I have same sex parents. I call them both mum but for the purpose of this, I'll call them by their names. \n\nOn Saturday I was hanging out with some friends. We decided to go to the footy field behind my house and kick the ball around. I took a bad fall and I broke my arm. I told my one of my mates to run and get Cindy (suregon mom). Both Cindy and Jasmine came out and took me to the hospital Cindy works at. I ended up getting my arm seen too. And yeah that's how it happened. \n \nCome Monday, the two of them started fighting. Jaz is upset that I asked my friends to get Cindy. Apparently my friends ignored her and went right to Cindy when they came to tell her. And it's just spiralled into this much bigger thing. And it got very ugly with a bunch of stuff I am not privy too until then.\n\nI don't understand because I've never favoured one over the other. Jaz and I do plenty of shit together as she doesn't work as much as Cindy. So we often do a lot of stuff together. But the argument got so bad with Cindy last night that she left and is staying with friends. Unsure of what to do.  \n\n*TL;DR* Mum got upset over an injury and left after a fight.",
        "permalink": "/r/relationships/comments/125gun1/i_15m_broke_my_arm_playing_football_mum_38f_is/",
        "comments": [
            "I doubt your injury and request for Cindy had a ton to do with it. It's far more likely other things were going on and this became the breaking point. Let them work it out and try not to worry too much. Relationships are complex and sometimes there's just a lot going on.",
            "As others have said, this doesn't really have to do with you. I'll add, *good* parents don't involve their kids in their martial issues, which is why this seems so sudden and you aren't getting a lot of information about the situation. Their relationship is not your relationship with either of them, and they're trying to keep it that way. I think they should still talk to you about it, for the exact reason you made this post: you feel like it's your fault or that you had a part in this when you didn't. It's important for parents to talk to their kids when they're having big issues for the kid doesn't internalize it or think they were a factor. Try to have a talk to your moms and say how you're feeling",
            "This isn't your fault or really anything to do with you. It's something they have to sort out for themselves. \n\nIt makes logical sense that the parent with medical expertise is the one your friends went to. There's no favouritism here. \n\nDon't beat yourself up; just focus on healing. You are a neutral person in their disagreement. Really, they should be focused on your wellbeing  above anything else.",
            "There is nothing you can do.  This is not about you at all, and you need to remember that.  This is about them, their relationship, and things that have been going on between them for a long time. I know its hard because from your perspective it looks like cause -> effect, but part of the job of parents is  keeping their childrens' lives as comfortable as possible, and that frequently means (or should mean) that they hide their interpersonal strife from you.  \n\nThink of this like an iceberg: there is a little bit poking out from the water that you only just noticed because you sailed close enough to see it but the larger mass of ice has been under the surface for a long time.  I'm sorry that this is happening, it must be really hard for everyone. Separations are really painful for everyone. Sometimes people need a break to figure out what what the right thing to do is, but nothing about it is easy or good.",
            "You are not responsible for your parents relationship issues. You didn’t cause it, you’re not the root of it, and anything that’s happening is not your fault. \n\nAdults often forget that kids and teens are really observant and are very very aware of what’s happening around them. Let them know what you’re worried about, and talk to them. They probably have no idea that you’re feeling this way.",
            "My wife is a pediatric ER doc, and I would expect my kid to go looking for her in such a situation because that just makes sense. If Jaz was a baker and you needed help making a cake, you wouldn't go to Cindy. \n\nThere's definitely some other issues boiling under the surface between them. That sucks, but you shouldn't feel at all like your injury kicked this all off.",
            "It really has nothing to do with you. It sounds like there was a lot of resentment and this situation gave her the push to pull it all out. \n\nAs much as you love them, this is not your relationship so let them work it out.",
            "My dad is an oncologist, he, like Cindy probably does, works long, long hours.   It's part of the gig.   \n\nMy mom often complained about this, mostly out of concern about his well-being and lack of time with us.   It never got ugly, but I could see how hurt my mom was whenever my dad had to cancel on us for the millionth time because of an emergency at his practice or hospital.\n\nBeing around other doctors and surgeons, this was also common.   It's a demanding field that eats a lot of time, resulting in one parent taking the brunt of the work raising kids and keeping a home, which can result in resentment that builds up over time. \n\nLike others have pointed, this wasn't about you or what happened, it probably was just the stroke that broke the camels back.",
            "There is really and truly nothing for you to do here. You did nothing wrong. Your friends should probably have told Jasmine instead of charging ahead to find Cindy, but they were worried about you. This is pretty clearly between her and Cindy, and they'll need to resolve it together. \n\nI hope she comes back with an apology for you, because asking an injured teenager to manage an adult's feelings is a bit unreasonable. Either way, I hope this blows over quickly.",
            "You did absolutely nothing wrong.  Part of growing up is differentiating your parents beyond \"Mom\".  You learn they are also \"wife\" or \"sister\" or \"surgeon\".  (Not in your case, sometimes you realize they have bad roles as well like \"alcoholic\" or \"abuser\".)\n\nYou recognized Cindy as surgeon which is reasonable. The fight between them however involves their roles as wives, which is between them.  Sometimes partners just need some time apart.  \n\nI'd just focus on recovering from your injury while they work out their issue between themselves.",
            "sounds like they got their own issues to work out and you can't really do much, you didn't do anything wrong",
            "Surgeon mom has more experience, insight, and reactivity to a broken arm that non-surgeon mom.  I don't see a problem here.  In an emergency, you contact one person - not the committee.",
            "My goodness!  The things we do to our children. This isn’t on you, mate.  It’s Mum Drama. Get better soon.",
            "Never think that this is your fault. As a kid its not up to you to fix this either. Just focus on being yourself, keep doing what you're doing and things will sort themselves out.",
            "Them fighting was coming if you did or didn't get hurt. Low key resentment will eventually bubble over, and all hell will break loose. Talk to them individually, get a better understanding, and don't choose side, no matter what.",
            "It's definitely not just about you. As you mentioned, a bunch of stuff came up that you didn't know about in their fight, and this just tipped the scales. I'm sure your friends acting kind of like asshats to her while her kid was hurt didn't help. I think the most you can do is call her and apologize for your friend's behavior, that you told them to ask Cindy because in the moment you thought she'd know exactly what to do. It won't solve the overall problem, but might make her feel a little better about that specific situation.",
            "Yeah something else is going on in the relationship that has nothing to do with you. My husband is better at video games. If the kids went straight to him for help I don't freak. I'm better at medical stuff so they come to me foe that, my husband doesn't freak out. Something else is going on.",
            "You do nothing. What is going on between your moms has nothing to do with you. I know you feel like it is your fault, and you want to fix it, but it is not. Your parents are having issues and the injury just brought it to a head.",
            "This wasn't about you, love it's something between them that they need to figure out. You didn't do anything wrong. Sorry your parents are fighting though that sucks.",
            "I am a parent in a same-sex family, although my daughter is only 3.  \n\nYou did nothing wrong by asking for Cindy, you asked for the parent you thought would be best in that situation. \n\nSame-sex parents can have their own insecurities around their role as a parent.  Depending on where you live, same-sex marriage likely wasn’t legal when you were born and even now it is very uncommon for both parents to have rights as parents immediately on birth.  Medical care is one of the situations where that becomes very relevant and may have reminded your mums of the different ways they experience parenthood.  However, for your mum to move out suggests this isn’t just about that insecurity surfacing.  We can’t say why this became such a big deal but it isn’t because of you.  \n\nTell your mums you love them both but beyond that, this is something they need to work through themselves.",
            "\nAny reasonable person would get Cindy. \n\nSomething happened that you don’t know about. You shouldn’t - parents shouldn’t rely on their teenagers to meet their emotional needs or solve their problems.  But you’re getting older.  It’s time to recognize that your Mums *have* needs and wants and desires and hopes that aren’t about you.  They have every right to have them met - by other adults of course, not you. \n\nYour parents need to work their own stuff out.  Don’t get involved.  But also don’t paint one in your mind as being in the wrong because you just don’t know.",
            "This isn't about you, Dear One. \n\nIt's about parental insecurity. It may be further about how they each handle things in a crisis and how the other person in their marriage feels about it. \n\n\nYou didn't do *anything* wrong. \n\nIf you feel the need to take action and clear the air, call Jasmine and tell her your truths, whatever they are: (you love her, are missing her being at home and are concerned that she is mad at you.) \n\nRemember that it's normal to have disagreements even in healthy relationships, but one of your parents moving out temporarily certainly doesn't feel good.\n\n\nThis is between two partners; it truly has nothing to do with you.\nIt's appropriate to share your feelings respectfully with your parents. You're entitled to have them, just like they are.\n\n\nMay you experience abundant healing for your arm. Here's hoping this will be a small bump in the road for your parents. Wishing you three every happiness.",
            "I wouldn’t ask my dad how to file my taxes and I wouldn’t ask my mom how to stain some wood. You went to the parent better qualified to help you given the situation, that’s completely normal and id even argue healthy behavior since it shows you don’t just play favoritism. Whatever they got going on, it’s not about you.",
            "OP I'm sorry about your arm but the issue your mom's are having has nothing to do with you.  They shouldn't have ever let you think it did.",
            "In all likelihood, there's WAY more going on between them than this situation.\n\nDo not blame yourself.",
            "Yet understand that this has nothing to do with you and Cindy (and Jaz) probably dealing with her own issues right now.  It’s not your fault.",
            "I find this a bit strange since logically it made sense that you asked the surgeon for medical advice since that's within her realm of specialty. I don't think it has to do with you but more to do with things between them",
            "You didn’t do anything wrong, and it’s not your job to fix or mediate your parents’ marital problems. You should not be made to feel as if you did anything wrong, and frankly it’s a bad look that Jasmine left right after this happened and allowed you to feel like you precipitated things.\n\nPlease confide in each of your parents that you’re feeling like you did something wrong and give them the opportunity to make things right (which might not look like Jasmine coming home and everything going back to the way it was, but should look like them reassuring you that it’s them, not you).\n\nYou and your friends are kids. You asking for your surgeon parent should not be misconstrued as a slight against your parent who isn’t a surgeon no matter how tactlessly your friends could have carried that out.\n\nYOU should be the victim here and your parents should be the ones asking how to make things okay because you are the child who broke his arm! You should be receiving special attention. Not either of them!",
            "This is not about you.  Your injury was simply a trigger for what was going on with jaz.  Sorry you are experiencing this.",
            "I mean, if I broke my arm, I'd definitely call the parent who would know what to do with it.",
            "This sounds like an insecurity, self doubt, inferiority issue that Jaz has and this request you made was the final thing that made her react this way. I learnt that many times when people over react like this, it’s not about us . They’ve got stuff going on.\n\nIf you feel like speaking to her to explain you asked for cindy because she’s a surgeon and they as parents to you to use logic- and this was a logical move instead of a preference of a parent, maybe try that.",
            "Sorry but your moms are being bad moms for fighting within earshot of you. It's only logical to go for the health professional when an accident happens. Nothing about this should be your issue.",
            "Is one of them your birth mother?  Could that play into their response?\n\nParents fighting is always tough on kids, regardless of age.",
            "You don't do anything. It's not about you. It may seem like your mom is upset you hurt yourself and asked for surgeon my mom but she's not. That started an argument between them that doesn't have anything to do with what started the argument. \n\nYou didn't do anything wrong and they should have made that clear. You didn't cause this fight and you can't fix it.",
            "Is one of them your biological? Because my same sex couple cousins have had this same argument about their son and that was the root one one’s jealousy.\n\nThey’re now in process of divorce. All of their arguments stemmed from the child’s needs and someone feeling like their toes were getting stopped on. In most opposite sex relationships, the man defers to the mom when kids are sick and dad steps in when needed. (Traditionally)\n\nThis is no fault of yours, it’s just a dynamic of many TOXIC same sex relationships. Most same sex relationships that are healthy, parents do not fight over such trivial things. \n\nYou going for the doctor mom makes logical sense. But someone in this situation is only thinking with their emotions and there is a root cause that’s likely about you but not about anything you did or your fault.\n\nEdit: Again, this didn’t same sex specific, because a straight couple may have the same issue, especially when a parent has adopted their partner’s biological child. It’s just a potential root cause. \n\nIf this continues to affect you, suggest family therapy. It’s so nasty for kids to have to go through this and really selfish.",
            "Is one of them the birth Mother?",
            "A 38 year old who throws a tantrum over attention is the problem, not you, not your broken arm and may not have anything to do with Cindy. \n\nHope you’re not in any pain and you heal up quickly! \n\nBest of luck",
            "It might have been a snap decision to make the joke.",
            "Mum number 1 sounds like a child I'm sorry to say. It's not about her, it was about you",
            "This truly had nothing to do with it and it's mega selfish of your mom to leave without making it clear to you that the issue was not you. She has to know that this had made you feel ashamed or guilty, which you shouldn't feel.\n\nYou made the right chose. You picked the right person for the job. ANYONE would have done the same thing. This is an issue between your parents that they need to work out. Talk to your other mom about how you're feeling. I'm sure they will reassure you that this isn't your fault or your responsibility. I'm sorry your mom is being so immature :(",
            "This just shows how petty and stupid parents can be, regardless of their gender. Same sex parents can be as good or as bad as any \"conventional\" couple. I don't know if this should be a good or a bad thing.\n\nI would also think they have other relationship problems and what happened just ignited the whole wood pile.\n\nYou did the smart thing, the logical thing. So don't beat yourself over it. This is 100% not you. They need to solve their issues like adult parents should do and not make their son feel like he did something wrong and caused this.",
            "Your moms are acting like kids. They should grow up and focus on your healing process, not at the bickering between each other.",
            "Not your problem. Stay out of it. They are adults. If they wanna be catty, they'll do it with or without your input. If there are deeper issues, they'll remain with or without your input. Does it suck? Sure. Life lesson here? Serenity Prayer.\n\n\"Dear Lord,\nGrant me the serenity to accept the things I cannot change; the courage to change the things that I can; and the wisdom to know the difference.\nAmen.\"\n\n(Take out the word \"Lord\" if you're a non-believer, and there is still truth in the words).",
            "There is something else going on between them, this is not your fault at all. Maybe Jaz is feeling insecure about something and it all came up when this happened, but that’s not your fault. You asked your friend to get the mom who made the most sense in your mind, that’s not a bad thing. I’m sorry that they are using you as the focus of the argument, but please know that you did not cause this. It could have, and likely would have, come up another way if you hadn’t broken your arm.\n\nParents have this really fun thing where they stuck their kids into their arguments and it leaves the kids feeling like it was their fault. It was not your fault. This is a chance for you to state your needs to your parents, at least if you feel comfortable speaking to them about this.\n\nI’m going to suggest talking to them separately if you choose to, they won’t have the chance to bring up the argument in the moment or blame each other rather than owning up to their part and focus on how it’s affecting you. It’s clearly hurting you and that’s what matters here, they need to push aside their shit for a moment and focus.\n\nTell them, separately, that this situation is bothering you. That it feels like it’s your fault, or like they are placing you in the middle, and it’s just not fair to you. If they have an issue that needs to be worked out they need to do that, they need to face whatever it is together and not act like it was caused by you. Remind them that you all love each other and it’s important to be able to communicate in healthy ways. It might be nice to also tell Cindy that you asked for Jaz because it’s part of her job, not because you see Cindy as less capable of helping you or taking care of you. That’s a separate thing though and if she’s feeling insecure about that then she needs to communicate, not argue with her wife while putting you in the middle.\n\nI really hope this works out and that you have a relationship where you can speak to your moms openly. It’s hard, I remember so many arguments between my parents where I was put in the middle and it took me a long time to realize it was never really about me, it was them taking their issues out on each other and using me as an excuse to fight. I remember one night in my early 20s where my mom was trying to shit talk about my dad to me and I just kinda was beyond done. We didn’t have a relationship where these things could be talked about, so it was basically years of pent of emotions coming out at once. It helped me gain more clarity, but it also wasn’t productive since it came out when my mom was already in a mood towards my dad and she just took it as me wanting to vent about him. It was about both of them and how much that shit hurt growing up, but all she heard was what she wanted.\n\nI’m really sorry this is happening, I hope you take it to heart that this isn’t your fault. They have work to do and as the adults, they shouldn’t be letting their own issues affect you like this.",
            "This has nothing to do with you. It’s about their relationship. You sent scared kids for the most logical parent. Scared kids got the most logical parent. \n\nThe other parent can feel their feelings, but it’s not your responsibility to fix them. \n\nI’m going to say this again because I can’t stress it enough: it’s not your responsibility to fix how your mother feels about this. She needs to work it out with her partner and a therapist and _YOU_ stay out of it. If she tries guilting you about it, just grey rock until you can leave, or tell her she’s responsible for her own feelings and it sounds like she needs to talk to a therapist about them, not you.",
            "Wow, I’m so sorry you’re going through this especially when this is absolutely not your fault. \nIf anything, Jaz should be incredibly grateful to be married to a doctor that knows exactly what to do in this kind of situation and have immediate access to other surgeons that can fix you. Sure, situations arise where one parent gets their feelings hurt if their child chooses one over the other, but this is not that situation. You did the right thing and if I were in your position I would’ve done the same.",
            "Which one actually carried you and birthed you? Just curious",
            "She was looking for an excuse to leave and you have her one. Thus has nothing to do with you but their relationship and used this as an excuse to get out of it.",
            "[removed]",
            "Not your fault. You didn't cause this. They have problems that you can't fix.",
            "Sounds like your moms gotta figure their shit out bud.  This isnt on ya.",
            "This is their problem, not yours. I am sorry you got stuck in the middle of their childish argument.",
            "This had absolutely nothing to do with you or your injury. Something is going on with them, and this was just a situation that uncovered whatever had been going on between them behind the scenes. You can't fix this. There is nothing you can say or do that will make it better because you're not the actual cause of the fight",
            "As a mom, my heart kinds of breaks for you. This isn't your fault. Your moms' fight is about a lot of things and it's really not just about this incident. You don't need to do or fix anything, they need to work it out. They both love you.",
            "Talk to your moms and left them know what's on your mind. Something is going on between them and you can ask about it. This wasn't about your broken arm or the fact that you asked for the Mom who has a medical background. That totally makes sense and you've done nothing wrong and neither have your friends. Taking to them will help clear up and misunderstandings you have.",
            "Jaz doesn’t feel respected because Cindy had like pro experience. I would try to validate jaz and make her feel valued.",
            "This is *not* your fault, and it’s not your responsibility to fix it *in any way*. It makes total sense that when you’re injured your mind would jump to the parent who is a doctor, and it obviously has nothing to do with preferring her in general or loving her more or anything.\n\nThere are clearly deeper issues going on in their relationship, and it’s not on you to sort that out. Just keep communicating with them about your feelings and needs, and don’t try to take sides or fix anything. It’s upsetting to see your parents fighting like this, but only they can fix whatever is going on between them. If either of them DOES try to blame you, turn you against the other one, put you in the middle of the fight somehow, etc, tell them straight up that it’s inappropriate and they should not be pulling you into this. Hopefully they won’t pull anything like that.",
            "You definitely did absolutely nothing wrong. As many have said, they'd go to the parents who can fix the problem first, *but* this isn't about that, and I'd like to add to the choir. My dad says a lot if you're ferociously arguing about dinner, it's probably not about dinner. This seems like that is true in this case and Jaz has a lot of nerve shifting the blame on her 15yo kid.",
            "If anything you’re a straw on a much bigger pile of hay.",
            "This is not your fault. I know you might not fully understand that now but trust me this is not your fault.\n\nThey probably have a power dynamic or something other issue whether real or perceived that has been going on for awhile now that they worked not to show you. In the heat of the moment one of them probably said something they can't take back and it is escalating. This happens in relationships sometimes. It has nothing to do with you. This was going to happen eventually. It is unfortunately coming up as part of an incident you were involved with. But it is not your fault.",
            "Welly dude...welcome to insecurity....this has not much to do with you.",
            "You have no reason to believe you are not loved and cared for. The people who love and care for you also have a relationship with each other. Sometimes we don't always argue about the \"actual thing\" that's going on. Sometimes it just takes some extra stress in a moment for things to \"boil over.\" Do not worry about their relationship and take care of your arm. ❤💪",
            "It’s not about you and their fight isn’t your fault, or your business. Tell them they are making you worried and uncomfortable and ask them to be respectful of that.",
            "agree with the other top comments, this is entirely not your fault and it's worth bringing up the fact that you are blaming yourself.\n\nI dropped in to say, god I am so sorry you're experiencing this right now, this absolutely sucks.",
            "If Jaz was a CPA and you were doing your taxes you might have asked your friends to get her. I agree with others, this has very little to do with you. You might apologize to Jaz but I don’t think you did anything wrong.",
            "Honestly there's not much you can do here. Whatever it is they're going through you didn't cause, clearly something was going on way before this accident; you just happen to burst whatever bubble that was already culminating in their relationship. I really want to stress that you did nothing wrong, and anyone in your shoes would've done the same. Don't beat yourself up over complex adult problems because they're not for you too solve or skulk over.\n\nFocus on healing quickly and hopefully the adults in your life will fix whatever issues they're having.",
            "OP, this has nothing to do with you.  It was not your fault that one of your parents used this to act out with the other one.  \n\nI hope Jaz doesn’t try to put this on you.",
            "Your a good kid!  This isn’t about you.  Just make sure you tell them both that you love them equally and it hurt your feelings that they got in a fight over YOUR injury and they both should be focused on helping you.",
            "Sounds like fun having two moms 😀",
            "Quick question: Are you adopted? Or did one of your moms carry you? If so, which one? \n\nIf it was Cindy, I would bet my house that part of what upset Jaz is that by asking for only Cindy in the moment reinforced a lot of insecurities she has about being the non-gestational parent.  I mean, clearly there's some insecurity issues going on for Jaz between her and Cindy related to their relationships with you, but I wonder if it's what I outlined specifically.",
            "She somehow made something related to your well-being, instead related to her. It seems that she hasn’t developed emotional maturity, as she’s worried more about favouritism instead of getting you helped by the most capable person ASAP. Just because someone is an adult, doesn’t mean they’re actions are justified.",
            "I'm sorry you got caught in the middle of this. I see that you are a sweet kid who cares about the feelings of your parents. Don't let this occupy your mind too much...it really doesn't seem to be about you.",
            "The way your post begins...\n\nReddit has corrupted my mind.",
            "Info: if you broke both your arms, which mom would you call?",
            "This has nothing to do with you. You're just caught in the crossfire of a broken relationship",
            "Not your issue. Nice to be reminded that women arts like this in same sex relationships too. You asked for the expert. Completely logical. Jaz seems completely emotional.\n\nTell her she’s a silly old moo fracturing your family over a fracture.",
            "It’s not about you. It’s natural that people to seek help from a medical professional first. If someone on an airplane got sick, the flight attendants with making announcement asking if there was a doctor on the plane.",
            "Just seeing this weeks later and wanted to check in and see how it’s going. I’m sorry you got run over by some adult garbage. It sounds like Jaz Mom feels a little insecure because other mom is a surgeon and can fix things she can’t. To be sure, this isn’t about you, it’s about Jaz Mom needing some support and maybe a counselor to go over her thought processes with. I hope your arm is healing!"
        ]
    },
    {
        "post_id": "5t8vg5",
        "author": "youngconfusedthrow",
        "title": "[Update] I [27F] may have fallen in love with another woman [26F], and I don't know what to think of it.",
        "url": "https://www.reddit.com/r/relationships/comments/5t8vg5/update_i_27f_may_have_fallen_in_love_with_another/",
        "score": 2485,
        "num_comments": 60,
        "created_utc": 1486750264.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/5s74h4/i_27f_may_have_fallen_in_love_with_another_woman/\n\nSo my initial post didn't really get that much attention, but I thought I'd post an update for those who cared!\n\nThe same day I made that post, Margot came over to hang out. I don't really know how it happened but I ended up just spilling everything like word vomit and telling her the truth. At first she was taken off guard and really didn't have much to say, but we talked it out and she admitted that she still had feelings for me, too.\n\nSo, long story short, we are now dating, and I'm still trying to come to terms with my sexuality. Margot wants to take me to queer nights at this bar and I've been reading a lot of material online. No one in our friend group is surprised at all, but I'm going to wait before I tell my parents.\n\nTLDR; Margot and I are together now and I'm working on learning more about myself. Thanks for the advice!",
        "permalink": "/r/relationships/comments/5t8vg5/update_i_27f_may_have_fallen_in_love_with_another/",
        "comments": [
            "Don't overthink it. Sexuality is a spectrum not a hard either or. Some people view their sexuality as a defining feature of who they are while others can be matter of fact about it. You are not inherently different than you were before you told her.",
            "Margot has experience, you're only starting to understand your sexuality, and I suspect she has your well being at heart, so she can probably help you more than you know right now. Good luck and all the best xxx. P.S. As a father, I have a daughter (29), and if she approached me in this context, as long as she's happy, nothing would change, except I'll be super defensive over her because of what it unfortunately brings with it, she will always be my girl, the same girl I've always known and loved. Sexuality has no relevance whatsoever for a dad. (But that's me)",
            "OP this is a common thing among bisexual/lesbian women :) you aren't alone. take it slow and figure things out. don't be afraid to step outside your comfort zone. ",
            "If it helps, nothing really changed.\n\nDo not overthink about the 'label'. You dating another 'woman' doesn't change who you are. You've fell in love with a person you've connected with. Once you have this mindset, you won't even see her as the 'another woman', rather you will see her as your lover :)\n\nProps for following your heart!",
            "I have no useful comment but to say YAY I'm so happy for you! ",
            ">No one in my friend group is surprised at all\n\nThat's how you know your friends care about you. :D",
            "I work with a couple that have a similar story to yours. 'A' is a lesbian, while 'E' was (by her own proclamation) completely straight. When E met A, however, she had such strong feelings for her that she started pursuing a relationship. A was reluctant at first but eventually she let down her guard and they started dating. It's been about 2 years and they are the cutest couple I know. Their adoration for one another is almost fairytale like. E said when she met A she just knew. Even though she had never been attracted to a girl before, she said she got butterflies when they met and crushed hard on her. And, (so far) happily ever after!! :)",
            "Awesome! Your original was very sweet and it seemed you two had some genuine feelings for each other. Good luck enjoying your new relationship, don't worry too much about the labelling :)",
            "YAY, congrats! It sounds awesome. I missed your story the first time round but it's lovely, if only because it's pretty much the story of me and my girlfriend and we've been disgustingly happy ever since figuring out what we were to eachother. \n\nEcho'ing the 'don't worry about the labels' thing, btw. I tend to just tell people I'm dating a woman and sometimes that my ex-partner is a man, and let them deal with the labeling. I'm her first female partner and she pretty much does the same. If anyone needs a term I say bisexual, but mostly I don't worry about it, and people seem to follow that lead. \n\nGood luck!\n\n",
            "I have a few LBGT friends and Ive been on the receiving end of affection before. I'm straight. I know I am, but I'm comfortable enough with it that I'd be OK if I wasn't. It took years of being close friends with a number of LGBT to get that comfortable with who I am, and actual introspection to know I'm straight. But I remember an episode of Torchwood. One of the characters who was straight fell in love with a gay character. He came out to his family as being in love with the guy, but insisting he's straight. He doesn't like men, just him. Just the one man. He's still straight. Just the one soul that calls to you stronger than all preconceived notion of sexuality. Then I finally understood how my ex could claim to be lesbian yet have been with me for years. Sometimes it's not about gender or sexuality, it's about love. I don't expect it to ever happen, and I'd still be straight, but if I fell in love with a man, then that wouldn't have to change who I am.",
            "Taken by surprise, caught off guard ;)",
            "Congratulations on confronting your feelings and opening up to Margot. She sounds very understanding and supportive. That's great! I wish you the best!",
            "I'm so glad that you have so much love for Margot. \nBut I very strongly disagree with the porn comments and suggestions towards sex in any manner. Had you been asking about a man, nobody would have suggested that you do a quick search on a porn site, so that you can please your new lover. \nYou do not have to do anything with each other sexually at all if you are uncomfortable. Focus on the love side of things, and feeling comfortable around each other won't ever be a problem. Best of luck :)",
            "Good luck on your journey - my daughter took some twists and turns figuring out her sexuality - but she's been with her partner for over 3 years and is happy and so much more comfortable with herself and it's awesome.",
            "Congratulations! That happened with me, too. I ended up dating a woman and it was the best relationship of my life. It ended, unfortunately, but love is love.",
            "Also if people who were your friends resent you for your decision it wouldn't be a bad idea to cut them out of your life like I had to years ago. All my so-called \"friends\" thought it was weird and vanished a year or so later after I came out as bisexual and started dating a guy. Don't let them get to you.",
            "Yay! I'm happy to see this update. Sexuality isn't cut and dry, just take it slow and go with the flow! ",
            "Congratulations!!! I'm so happy for you!",
            "This makes me so happy. :) Like everyone else said, don't stress it, just explore yourself & be happy (& proud!).",
            "Yay, a happy ending! Happy for you Reddit stranger. ",
            "If your both happy that's what matters most. I wish you two the best!",
            "This sounds lovely and I hope you guys have tons of fun dating!",
            "[removed]"
        ]
    }
]