[
    {
        "post_id": "3u9c5i",
        "author": "candlethrowaway1",
        "title": "Me [24F] with my SO [27M] of 1 year, he destroyed a sentimental item of mine and sees nothing wrong with it because of the circumstances.",
        "url": "https://www.reddit.com/r/relationships/comments/3u9c5i/me_24f_with_my_so_27m_of_1_year_he_destroyed_a/",
        "score": 2457,
        "num_comments": 256,
        "created_utc": 1448482702.0,
        "selftext": "Didn't mean for this to get so long but it seems it has. Thank you in advance for reading. \n\nMe - 24 female  \nSO - 27 male (let's call him Eugene)  \nMy sister - female (deceased 2 years, let's call her Carrie)\n\n**Background about my sister**: Two years ago, my sister was killed in a car accident. She was riding with a friend to the mall (the friend's parent was driving), and teenage boy plowed through a red light while texting on his phone and hit the car my sister, Carrie, was in. Carrie was killed instantly and her friend, June, was in a coma for 3 weeks before her parents took her off life support. When Carrie passed I was devastated and angry and just not in a good place. \n\nCarrie and I had been extremely close. Despite a 7 year age gap between us, we enjoyed a lot of the same shows, we went to concerts together, we volunteered together, and I took it upon myself to guide Carrie like any big sister would do. Our parents were extremely busy with work most days and Carrie and I would often cook together and do crafts when we weren't too busy with school work. Carrie wanted to be a NICU nurse when she grew up and I helped her find a volunteer position at a local hospital to help get her gain some experience being around patients. In short, Carrie was my sister and best friend and when she passed, I was a mess.\n\nThe last craft Carrie and I made together was a set of candles. We bought the wax at a local craft store and we both made each other a candle and decorated the jar it was in. That was the day before she was killed. At her funeral, Carrie was buried with the candle I made her. The candle Carrie made me sits on my desk next to my favorite picture of her and I together at the beach. Or it did, until last week.\n\n\n**Background about my boyfriend:** I met my boyfriend about a year and half ago (about 6 months after Carrie passed). I wasn't looking for a relationship; I was still grieving my sister's death. But Eugene came along and it was love at first site. He was extremely supportive, let me cry on him when I needed to, didn't push me into getting over grieving or anything. He was extremely gentleman about everything and very, very patient. After six months of seeing each other pretty regularly, we made it official. \n\nEugene came into my life at a very low point and he has always been very respectful of sentiments I keep from my sister. Never asking me to take them down, always giving me space when I needed to cry. Eugene, along with most, if not all, of my friends and family know about Carrie's candle. There was a point after she died where I would take the candle with me everywhere out of fear that someone might light it, or steal it, or who knows what. The point is, that candle was and still is a very important part of my life and something that my sister made for me and me alone. \n\nWhen Eugene and I moved in together about 4 months ago, I packed away most of the reminders of my sister and put out the candle and picture on my desk. I felt that this was a huge step because when I'd lived just by myself I had pictures everywhere and a few knick-knacks laying around from my sister. I wanted to make Eugene and I's home our home with just a small part of my sister there. Eugene understood and was very supportive!\n\n**The Issue:** Last week, we had a massive winter storm that knocked out power. We didn't have power for 3+ days. The power was knocked out at Eugene and I's house while I was at work (which did not lose power). Eugene texted me that he was going to light some candles and try and get a generator so we could have some for of power or at least be able to charge our phones/use lights/etc. \n\nNow, we have probably 30+ candles in our house. I am a huge fan of sales and when Bath & Body Works has a candle sale, I like to stock up and get a range of scents. We have candles scattered all over our house. In the room where my desk is, there are no candles aside from the one Carrie made me. None at all and there never has been. This room is also downstairs, where Eugene doesn't spend a lot of time (his desk is upstairs). \n\nWhen I arrived home from work last week, I noticed a bunch of candles burning in our living room (safely! always monitored and not near anything that could ignite). One of these candles was the candle that Carrie had made me. I burst into tears and when Eugene heard me crying he came out from the bedroom (where he was lighting more candles) and ask what was wrong.\n\nI was a wreck and couldn't get any words out. When he tried to calm me down, I shoved past him and locked myself in the room where my desk was and just cried. I don't know how he could be so stupid. He knew and I thought he understood how sentimental the candle was and how much I cherished having a candle that my now deceased sister had spent time making with me just a day before she was killed. \n\nI haven't been able to speak to Eugene since it happened (Tuesday of last week). He has tried to explain why he did it, because he needed candles to be able to see but I just can't wrap my head around it. He hadn't gotten into the large candle stash I have *upstairs right by the living room where Carrie's candle was* but went downstairs, out of the way to grab the most sentimental, cherished item I have. \n\nThe candle was burning most of the day while I was at work and is now melted and pretty much gone. I do still have the jar it was in but I can't look at it without bursting into tears. \n\nReddit, what do I do? Eugene says it was an accident but I just don't believe that. He said he was getting around to lighting the candle surplus we have upstairs but just hadn't gotten there yet (after being home ~6 hours alone with no power). I am heartbroken and feel like this is a major slap in the face. I feel disrespected. I feel like he disrespected my sister. I just don't know what to do. I don't feel like I can forgive him for this. Can or should I try to work past this? \n\n\n\n   \n**tl;dr**: Boyfriend burned a candle my deceased sister made for me because we were without power. We have a surplus of candles that he completely ignored. Can/should I forgive him for this? If so, how?",
        "permalink": "/r/relationships/comments/3u9c5i/me_24f_with_my_so_27m_of_1_year_he_destroyed_a/",
        "comments": [
            "This may be the wrong idea and it may not help but as a sentimental crafter I have a thought.\n\nFirst, I am so sorry about the candle. From what you've said about your boyfriend I think he just wasn't thinking. It might not even have occurred to him to remember that candles are *consumable* and the wax would melt completely away.\n\nOkay, on to the next step. Maybe a stupid idea.\n\nIt's so so clear that you're still grieving over the loss of your sister. You still have the jar. On her birthday, or the anniversary of her death if that feels right, make a new candle in the jar. Pick her favorite color or something. When you make the candle, pour in all of your love for her along with the wax. Focus on that love when you're pouring. Think of the \"new\" candle as containing all of that love. Think of it now as something you made together... she made the vessel, you made the love.\n\nJust a thought. Maybe cheesy and stupid. But maybe not?",
            "Has he apologized sincerely or just blown it off? The magnitude of his remorse should be your guide in how to take this. If he was just an absent-minded dolt, yeah a mistake. But a more deliberate action would have him showing little to no remorse. ",
            "His response to this will tell you if this is something worth working through. Contrite and feels bad? Absolutely. Blowing it off as no big deal? Absolutely not.",
            "This may be an off-base theory, but, you met this guy 6mo after Carrie's death while you were still grieving and he was \"extremely\" supportive etc.\n\nIs it possible he had some sort of savior complex where he came in to help a grieving woman past her sorrows, then when 2 years later you still kept the candle on your desk, he was upset you hadn't moved past it as he saw fit?\n\nLike if he moved in solely because you were sad and grieving and thus a project for him, then felt like the candle meant he hadn't finished yet, he lights it? Which he thinks will force you to fully move past the event (hah, fat chance).\n\nIt just makes no sense why he goes downstairs, out of his way, to get and light Carrie's candle. A power outage is not a freak-out emergency. I have been in many. It goes out, you glare at your now-dark computer screen, wait to see if it comes back on quickly. If it doesn't and it happens at night or grows dark, you go get some candles and flashlights. Nothing makes you panic during a power outage. There is no reason to forget the sentimental candle's value. If anything, they're pretty boring. There were more candles on the main level for him to light.\n\nI dunno my suggestion about his motives and treating you as a 'project' might be wrong. Just tossing an idea out. But I don't see how this was an accident. He had no reason to go downstairs then move Carrie's candle UPstairs. None. He wasn't even using it to light the room it was in. That was intentional.",
            "[deleted]",
            "How could he not remember that this was Carrie's candle?  The answer is - he couldn't have if he actually had real sympathy and understanding about your grief.  If he honestly did forget, what does that tell you about how deep his care goes?  \n\nEven if that had been the one and only candle in the house, if I were him, I would have sat in the dark or gone out to get candles anywhere else before I lit that candle.  ",
            "(((hugs)))\n\nI'm so sorry for your loss.\n\nEugene - well, he may say the right words when you are around - but when it comes to something that is important to you - that he KNOWS is important to you - the inconvenience of  having to walk upstairs outweighs your feelings.\n\nNot matter what he SAYS - this is what his actions ARE.\n\nYour last gift from your deceased sister is not as important to him as the inconvenience of walking up a flight of stairs.\n\nI'm a 52 yr old happily married woman. This would be a deal breaker for me.  This shows a profound lack of respect for your feelings, a huge sense of entitlement and selfishness.\n\nHe is showing you his real self with his actions.  And trying to downplay what he did is part of that \"Oh, it was just an accident.  I didn't realize that the only candle on your desk was important to you.  I didn't think that the the gift your sister made for you the day before she died would be THAT important. \"\n\nNot a keeper. you WILL find someone who would never consider this an option.",
            " > we have probably 30+ candles in our house. We have candles scattered all over our house. \n\nHe had LOTS of available candles. \n\n > In the room where my desk is, there are no candles aside from the one Carrie made me. None at all and there never has been. This room is also downstairs, where Eugene doesn't spend a lot of time (his desk is upstairs).\n\nHe went out of his way to get Carrie's candle. \n\n > From the living room to my desk room, there are probably 7-9 candles out, in plain view that he would have had to pass, three of which were lit when I walked in\n\nWent further out of his way\n\n > the candle was in a jar that was decorated with paint, glitter, and stickers so it is not anywhere close to a store bought candle.\n\nIt is fucking obvious that Carrie's candle is different from the rest, and yet he still has the nerve to say it was an accident? \n\n\n\n**There is no fucking way this was an accident.** \n\n\n\nI can't believe someone would do that, I just can't. It's so bizarre. It's incredibly hurtful. No one would blame you for breaking up with him. \n\n\n > Can or should I try to work past this?\n\nIf I were you, I wouldn't. He just doesn't sound trustworthy AT ALL. His reasons suck and it's obvious that he had to go through a lot just to get the candle. I feel like he may be hiding some resentment, too. ",
            "Could he not have used his goddamned cell phone to see??",
            "I would say this is an accident, except he clearly grabbed a 'bunch of candles' and Carrie's candle as well. He knew it had significance to you. Yeesh... I don't know, this is a weird one.",
            "If you and I hated each other, but lived together .. I still wouldn't have lit your candle. I wouldn't do something like this to somebody I dislike, let alone somebody I am dating. I don't see how it could be an accident. It just seems cruel.",
            "You have had a lot of good advice and I just wanted to add, if you do break up with him over this (and I wouldn't blame you) make sure you put what is left of the candle somewhere really safe first. If he did it on purpose I wouldn't be surprised if he smashed the jar or did something to totally destroy it if you told him it was over. \n\nBe careful, the fact he hasn't even apologised should be ringing some serious alarm bells. He should be absolutely mortified and even if he is just refusing to apologise for a genuine accident out of defensiveness despite seeing how devastated you were, that's unacceptable too.",
            ">Eugene says it was an accident but I just don't believe that. He said he was getting around to lighting the candle surplus we have upstairs but just hadn't gotten there yet\n\nLook if this guy *actually* gave a damn about you and your feelings, he would be in tears himself over how badly he hurt you, he would be \"Oh my god I am so sorry, that was the stupidest thing I've ever done, I can never make it up to you, I am sorry\" not \"what, it was an accident, no biggie.\"  \n\nIf he did it on purpose he is a manipulative psycho, if he did it on accident he is being an insensitive jerk, and either way I would not let him off the hook for this at all.    ",
            "Ok, so to recap what you stated above:\n\n- Eugene and everyone you are close to knows about the candle and what it means to you.\n- You had it displayed on your desk along with a special photo in a prominent spot (as a small memorial of sorts).\n- The twin of this candle (the one you made) is buried with your sister.\n- *The candle is so precious to you that at one point you took it everywhere with you!!!*\n- You have a ton of candles sitting out around your house that were readily available for our bf to use when the power went out, including a large stash of candles in the room next to where Carries candle was displayed.\n- Your boyfriend met you while you were grieving and has been an active part of your grieving process and knows the changes that you have been going through (putting other items that reminded you of Carrie away and placing the photo & candle on your desk in your new home together).\n\nFirst of all, I do not think you are overeacting in any way. Do not let anyone tell you it was only a candle. When we lose people we love very dearly (and you lost your sister!) small items of theirs that seem insignificant become cherished mementos of the lives they lived and the people they were. I had a friend once who lost a childhood friend to suicide and the only thing he had to remind him of this friend was a cheap dollar store keychain and it was PRECIOUS to him. So having that candle be burned to a nub of melted wax is a loss and you should not apologize for grieving it or having it affect you.\n\nThis cannot have been a stupid mistake. I think it was intentional. Eugene was freaking feet away from a big stash of candles AND you have a bunch of them sitting out all over your home. It was a power blackout not the apocalypse. What, did he damage his legs so badly that he could not walk a few feet farther to where you keep your stash of candles?\n\nI would definitely break up with someone over this. Even if it was somehow a mistake I would break up with them over their sheer stupidity to be honest. If someone was that dumb to destroy a memento of such value to me over nothing then I would not want to have them in my life because they cannot be trusted with larger issues.\n\nYou said that you met Eugene six months after your sister died. Has he ever lost someone close to him? A friend or family member he really loved? If so, even though he has been supportive, he might not *truly* understand what you are going through. You only moved in together 4 months ago which is a big step forward. I am wondering if he felt that \"accidently\"  destroying the candle would be a way of \"helping\" you move forward in some way. You said that he has been incredibly understanding throughout your grieving process so early on in your relationship. Do you think that maybe he has become a bit bitter about investing so much energy into helping you through a difficult time? Maybe now that you live together he wants you to be fully past your sisters death and your own grief?\n\nI think you need to sit him down when you are both in a neutral mood and have time to talk and try to get him to be completely honest with you about his intentions regarding that candle. It obviously means a lot to you for completely valid reasons. If I were your bf and I truly accidently damaged your candle in some way (say by accidently knocking it off your desk while cleaning) I would be beside myself with guilt and be extremely apologetic. In the end, if he sticks to his story of it being accidental or not thinking it was a big deal you should still feel perfectly valid in dumping him if you so choose. I would not really trust my significant other the same way if this happened to me. I know it is something seemingly small, but it is meaningful.\n\nAnd by the way, for someone who lost their sister only two years ago it sounds like you are coping with it as well as can be expected. You are going through a normal grieving process and that is ok. You packing up your other mementos when you moved in with Eugene was a big step and that should be noted. Do not apologize for your grief. It is truly horrendous to lose someone you love. \n\n*HUGS*\n",
            "I would absolutely end a relationship with someone over this. He must be a complete emotional idiot to think that this candle should be treated like any other. Also, I like how he tried to walk it back from \"I needed candles and there was one,\" to \"it was an accident.\" How fucking stupid he must be to think that this would be acceptable. Seriously, end it and don't look back. ",
            "It seems clear that he did it on purpose.\n\nThe only reasons someone would do this on purpose are evil.\n\nPeople say \"I can't beleive he would do that\" as a figure of speech but... it is beleivable. Some people give in to their worst urges. ",
            "Even if lighting the candle was an 'accident', keeping it lit wasn't. Ok, say he actually was in your room downstairs for whatever reason, he needed the light to see, panicked a little at the blackout and absolutely had to find light NOW, and went for the nearest candle. It still sounds insane, because unless you keep matches or a lighter right next to the candle he would have had to stumble around for a while with the light of, say, his cellphone to find them which negates the idea of 'go for the nearest candle!!', but ok. Maybe he's terrified of the dark and wasn't thinking straight. But then he kept it lit even after he found the other candles!!! Coming home to an apologetic SO and a slightly damaged candle miiiight be an unfortunate accident. What happened wasn't.\n\nSeriously OP, you're not overreacting, and I don't think you should forgive him. It's hard to see how this could in any way be an accident. Best case scenario, his basic empathy skills are non-existent, worst case scenario, /u/yetikins is right and he has some fucked-up savior complex. Either way, you don't need that in your life!",
            "This feels so deliberate. It would be one thing if he was apologizing profusely but he's just making half assed excuses. Even if it was a completely innocent accident (which seems improbable), it's really horrible that he's blowing this off. Most people in a relationship would be devastated and groveling if they accidentally did this to their partner.\n\nI suggest reading the thread in this sub from around Halloween where OP's cousin ruined OP's late mother's wedding dress while using it as part of a costume. If you have trouble finding it, I can PM you the link. The pitchforks were totally out against that cousin in that thread and I think it might be helpful for you to read. IMO, what your boyfriend pulled was at least as stupid as that (cousin apparently thought the fake blood would wash out) and people were in support of OP throwing her cousin out with nowhere to go. Your boyfriend did not do this by accident and even in the best case scenario, he's not even sorry.",
            "glad to see all the info about saving the candle awesome!, let talk about the guy for a second. im a very forgetful guy my self i'll admit it, but if you had told me all of this history about the candle....i mean there is not any way you should forget that candle as a boy friend or SO or whatever. it pissed me off reading this. \"I forgot babe.\" he woud have got a slap to he face an i would have walked out. if you can't trust him with something that simple and yet so important to you, what does that say about his future actions and being responsible for them. there should be heavy repercussions, stay with you parents till the new candle is done. Show him how unacceptable this was.",
            "I think there are two possibilities:\n\nA) He has some deep deep antipathy towards you and wanted to hurt you and took this as his chance to do so.  This would be psychopathic in light of everything you wrote about him, and--the comment section of Reddit notwithstanding--psychopathy is extremely rare.\n\nB) He made a thoughtless mistake.  It was dark and he found a candle and lit it and he didn't think about the importance of this particular candle.\n\nIf you have any suspicion it's A--you are in terrible danger and must leave.  If it's B then you will serve yourself best by forgiving him.  The candle was a physical symbol of the love you bear your sister, but only that--a symbol.  I can certainly understand how important it was to you, but the reality of what the symbol represented is alive and well and unharmed.\n\nAs to how to forgive: this is one of the great philosophical questions of our time.  I don't know what will work for you.  But I suspect if you decide TO forgive, you will find a way to forgive.",
            "First off he gave you two different stories about why he did it. Let's say he DID need it to find the other candles, couldn't he have blown out your sisters candle after he found the other ones??? And that's the worst case scenario or if it had been an honest accident. But it wasn't. In today's world everybody has cellphones, tablets. He walked a the way down the Stairs in the pitch black dark. Passing all these other candles and picked up a jar with glitter and whatever else and took the candle out of there. Bullshit, he deliberately destroyed one of the only things you had left of your sister. Get your stuff beforehand and dump the motherfucker",
            "Oh, OP. As soon as I got to the first line of The Issue, I knew what had happened.  \n\nI don't really have any advice for you; I'm both devastated and livid for you. Maybe it's irrelevant, but what time does your SO get home from work? It seems odd that he would light a candle to see during the day, assuming you have windows. Even if it was pitch black, it's again odd that he would stumble down the stairs in the dark to seek out that lone candle on that whole downstairs floor. Something isn't right here.",
            "This would be a deal breaker for me--not just that he burned the candle, but his handling of the situation after the fact.  Anyone worth being with would have been stricken at what they had just done (if it was truly an accident) and would have apologized from the bottom of their heart and would have made up for it with their actions as much as they could have.  The fact that not only did he not offer an apology or a way to make reparations, but even tried to defend what happened--No.  Just no.  You are completely justified in ending the relationship over this.  I don't think I could forgive him (or even want to forgive him) either.",
            "OK, I've read through your post a couple of times now, and read most of the comments. Here's what it comes down to, OP. You know Eugene and the whole situation and your history together, his personality etc much better than any of us random Reddit commenters. The one question that you ultimately need to ask yourself is:\n\n**Do YOU believe that what he did was an accident or mistake or do you think it was intentional?**\n \nIf \"Yes\" then, no matter how stupid, thoughtless and inexplicable his actions were (ie, it was during daylight! There were plenty of other candles right there! He realised how important this one item was! etc etc) then I think you can work towards forgiving him and moving on through this together. However, only if you feel he fully realises how badly he screwed up, how much he hurt and upset you and is incredibly grovelingly apologetic and remorseful and doesn't have a pattern of behaving this foolishly and insensitively to you (which it sounds like he doesn't). In this case, what you would be forgiving is him making a stupid mistake. A really bad mistake, absolutely, and one that hurt you terribly, but a mistake, and not a deliberate action. \n\nIf \"No\", if you think that he's making up excuses and that he *deliberately* and intentionally chose to light Carrie's candle, knowing full well what he was doing, how precious it was to you, and that there were plenty of other candles available, then to me at least, that is the end of the line. That kind of callous cruelty is an unforgivable deal-breaker, you cannot and should not try to forgive or work through this and that's then end of your relationship. If you think he did this deliberately, you don't need to waste time wondering *why*. Maybe it was a misguided attempt to help you get over her, maybe it was pent up frustration or resentment that you didn't \"get over\" her death as quickly as he thought you should have. Whatever, no reason is good enough and it doesn't matter. \n\nGood luck OP, and please keep us updated.",
            "Is it possible he thought only the jar and not the candle itself was sentimental?  Still inconsiderate, but maybe less so?",
            "As someone who lost a sibling three years ago, Eugene and I would have to take a good damn quality break over this. I'm sorry, but looooord have mercy he was out of line and part of me thinks he did it on purpose. Is he trying to make it up to you in anyway? FUDGE! He owes you so much on this! Hugs and love if you want them, OP. I'm really sorry that you've experienced this problem.",
            "No advice beyond what's already been said, but I wanted to send love and comfort. I'm very close to my sister too, and I can't imagine how you must feel. Big, heart-felt hugs.",
            "Hi there! \nI lost my mom 8 months ago, and everything that she gave me is extremely near and dear to me. My mom was my best friend. That being said, I too have a few items that I just cherish with every fiber of my being. I also have a boyfriend who has all of the best intentions in mind.. But sometimes when someone (using significant others as an example here) wants to do something.. They don't always think about how important the thing is to the person who is grieving, because they aren't experiencing the grieving period themselves. It sounds kind of silly, and although you told him the importance of the candle to you, and you thought he knew how important the candle was to you, he doesn't fully understand it because he isn't experiencing the heart ache that you are. It's kind of like taking a walk in someone else's shoes.. You can't judge, or be mean to someone for doing something silly without knowing what they are experiencing in life, so it's kind of the same concept. \nI think your boyfriend, (if he's anything like mine) was most likely nervous that the power was completely out, and just spaced the true importance of the candle because something bigger was on his mind, and he can't truly understand the importance of the object.  \nI really like the idea that someone else said about refilling the candle. I think that's an awesome idea :) also always know that your friend/sister is with you at all times. She is the cool hand on your forehead when you're not feeling well, your breath in the cold air, and your laughter. She would want you to be happy, and another thing to always remember when you're upset is, is that she is in a MUCH better place, and pain free. I hope you feel better, OP. ",
            "He needs to make a genuine and heartfelt apology to you, without any excuses.\n\nIf he does that, this is definitely something you can work through.\n\nIf he keeps on making excuses and ignoring how badly his actions hurt you, then I'd say it is reasonable grounds for a break-up. ",
            "These kinds of posts are so sad. The others I read about seem to only ever have been deliberate destruction of mementos from deceased siblings, it's such a horrible thing to do to someone. Take care of yourself. ",
            "I'm so sorry for all that you've been through. \n\nI suspect that this was a genuine error and that he just forgot that it was her candle and that because you were so upset, he had a hard time explaining it to you.\n\nThe other possibility is that he actively remembered it was her candle, remembered how important it was to you but didn't care and lit it anyway. If this is what happened I can see why you couldn't forgive and move past it because that would be an awful thing to do.\n\nHowever if it was genuinely an accident I would try to let it go. It's sad that this accident happened, but accidents do happen and I think if I were in your position I would try to find it in my heart to forgive him. ",
            "I think he was sick of being so patient about Carrie and of having her shadow over his life and so he passive aggressively took this opportunity to destroy your candle. I can't see how he didn't know exactly what he was doing.",
            "I have no words.  I'm almost in tears just reading your post.  Internet hugs!\n\nI couldn't stay with someone who did this to me.  There's no way it wasn't intentional.  He knew what that candle meant to you AND used it in lieu of others more readily available.  I don't know what his intentions were but fuck him.  And anyone with half a soul would be mortified to tears at accidentally burning your sister's memento.  That he isn't tells me he's evil.  Like, seriously evil.",
            "[deleted]",
            "Op, you said Carrie's candle was on your desk originally... why was it in the living room when you got home? Was SO in the living room when you got home? Maybe I'm overanalyzing, but it feels like he moved it there so it would be the first thing you'd see, especially when you consider there were other candles in the vicinity that he chose to not light. ",
            "This is tough - either he completely forgot or did it on purpose. I just don't see how him forgetting is possible, but then again I'm a dude who keeps a box of mementos and has a few framed collages of trips I've taken.\n\nIf he did forget, you're going to either break up with him or accept that he is foolish enough to make such a mistake and may make similar mistakes in the future. Depending on your own emotional level, that may be a long term deal breaker. ",
            "By your own account, Eugene was extremely supportive and gave you plenty of room to grieve. He makes one mistake and reddit decides he's a psychopath with long-held resentment for your sister, that he did this on purpose and secretly hates you.\n\nOh well. Hopefully when you dump him for his one transgression in eighteen months he'll realize it's better for him.",
            "I'm very sorry for your loss and admire the way you have coped, because 2 years is not enough for grieving for a sibling. Other comments expressed so much more and I don't want to repeat their thoughts, because so many of them were just perfect and still resonate with me.\n\nI just wanted to add something to the issue of your boyfriend and his actions. Did he ever ask you why you don't light the candle before? Did he ever try to convince you you should? Because if the answer is yes, then I don't think you can trust him. If there was anything malicious in him intentionally lighting the candle, you should not be with him for your own good.",
            "I am the queen of sentimentality. I met my husband 6 weeks after my dad died (and I also was not in a relationship mindset) and he was very patient with me through my grieving process. When I lost an earring that my dad gave me, he helped me turn the house upside down to find it. Even though I was sure it was in the house, he didn't get upset with me as I cried because I didn't know where it was (my BIL eventually found it). If he ever broke an earring and then acted like it was no big deal, I'm not sure what I'd do or how I'd react, but I know it would be a huge fucking deal. \n\nIt was a dick move. And if I had to guess, I'd say that Eugene never lost anyone he was really close to, and he never lost anyone young in a tragedy. Right now he should be promising to do anything to make this up to you (even though he can't), and acknowledge the pain he caused you.\n\nI like the idea of remaking the candle. Maybe you can make on every year and burn it for her.\n\nAs for how you work it out with him... you gotta know that he gets it, I think. This was a special gift from your sister and not just some lump of wax for him to burn. If he really can't understand why this caused you so much pain then he can't really be sorry for causing it. Only you can decide if you can spend your time with a person like that.\n\nI'm so sorry, but do remember that even if you never got this candle, she still loved you very much, and no amount of stupid clueless boyfriend-acts will take that away.",
            "I'm going to take a different approach here and say it was an accident. You have to remember that to him it's just another candle, he probably saw it, lit it and didn't think twice about it. The real problem is he has made no attempt to apologise or try to make up for his actions after realising what he had done. Instead he just tried to defend himself. He either doesn't care or thinks the pain you're feeling should be less because he didn't intend to inflict it. Honestly unless he can make a full and frank apology I don't see how you can move past this. And maybe you can't even if he does apologise. ",
            "You have every right to be mad. I would be solo upset with him if I were you ",
            "What do you think your sister would want you to do? Break up with him over a candle? When the power was out? She gave you the candle to use. If you really wanted to keep it forever you should have put it in glass or a display case. ",
            "There is no way this was an accident. It sounds like he's resentful of how much attention your sister's memory gets (yes, Im saying he is JEALOUS of a DEAD GIRL) fro you and wanted to \"punish\" you for it in a way you couldn't \"rightfully\" blame him for. Frankly, this is fucking bullshit and you need to leave him. \n\n...And this may be petty, but if I were OP I'd be sure to find a similar \"consumable\" sentimental item that belongs to BF and \"use\" (AKA destroy) it in a similar fashion. When he inevitably flips a lid, use the same justifications and excuses he did. What goes around comes around, fucker.",
            "The guy is either /that much/ of a complete idiot (unlikely) or did it deliberately (likely, given the history). Whatever his motive, his actions are a huge betrayal of you and the memory of your sister. Are you happy being in a relationship with someone who did this?\n",
            "I think it is forgivable if it was an accident - if so, then obviously he a bit dense in general and this couldn't be the only stupid thing he's done. \n\n\nIt will be hard to forget, but you should forgive. \n\n\nIf it was an accident = forgive\n\n\nIf he lit it knowing it was a special candle then that is pretty disrespectful... ",
            "[deleted]",
            "Op over reacted. Forgive and move on.",
            "A lot of people are blaming him and saying he is insensitive. But for me i think you need to take a look from another perspective.Yes he burned the candle, yes it was sentimental but ask yourself would Carrie still want you to be in an unhappy and in mourning for her after all these years? maybe this is a sign that you should stop living for the past and live for here and now. I don;t think people should be sad remembering their loved ones but instead remember all the good and keep the person in memory by living for here and now. At least for me that's now i rememeber my grandpa.",
            "ITT: people that really fucking like candles.",
            "Are you sure he was home alone all day? If he had 'company' over, she could have lighted the candle because she didn't know any better (and he may not have noticed). I admit this option is way out there, just thought I'd mention another possibility.",
            "[removed]"
        ]
    },
    {
        "post_id": "4c1d7w",
        "author": "lvr2016",
        "title": "My [35F] and my daughter [11F] are having a problem with her teacher [50??F]",
        "url": "https://www.reddit.com/r/relationships/comments/4c1d7w/my_35f_and_my_daughter_11f_are_having_a_problem/",
        "score": 2455,
        "num_comments": 612,
        "created_utc": 1459002902.0,
        "selftext": "I've lurked on reddit a lot, but this is my first post!\n\n\nI'm having an annoying problem with my daughter's teacher, Mrs. Jones. Mrs. Jones told the students to write a report and do a presentation on their family ancestry and culture. Our family is from various Eastern European countries. However, we are Ashkenazi Jews, so we aren't the same as other people from Eastern Europe. Our ancestors spoke Yiddish first, and Polish/Russian/etc second, and had different customs. My daughter knows this, so she decided to write about Ashkenazi culture. For her poster, instead of drawing pictures of the countries we came from, she drew Eastern Europe with a Jewish star over it.\n\n\nAfter she turned it in, I got a message from her teacher that she would have to redo it! Apparently, the assignment was done incorrectly since it didn't focus on the particular countries in general. The assignment didn't say they needed to pick a country, it said they needed to write about their family's culture. I tried to explain to the teacher that doing a report on Poland or Russia didn't make sense since we weren't really Polish or Russian and didn't follow any customs, but she kept insisting that the report had to focus on the countries. She said that my daughter could do her report on Israel instead, if she wanted to focus on her Jewish heritage. That doesn't make sense either, since we can't trace our ancestry to Israel and don't follow any Israeli customs.\n\n\nI know this sounds like it's not that big of a deal, but I'm really annoyed at this teacher for being so stubborn. Sure, she could absolutely insist that my daughter write about Russia, Poland, and Romania in general, but the assignment was supposed to be about your own culture, not someone else's, so the assignment would be pointless.\n\n\nI'm trying to write a message to the teacher to explain clearly why my daughter's presentation fulfilled the assignment and should be accepted and graded fairly. I don't want to come off too strong, but I need her to understand why insisting on writing about these countries so generally isn't necessarily appropriate for ethnic minorities. \n\n\n**tl;dr**: My daughter's teacher insists that her project on our family culture was done incorrectly.",
        "permalink": "/r/relationships/comments/4c1d7w/my_35f_and_my_daughter_11f_are_having_a_problem/",
        "comments": [
            "Dear teacher,\n\nI would like to clarify what has already happened with my daughter's project, and what still needs to happen in order to ensure she meets the learning objectives. I hope we can work together on this to make sure she does the necessary work.\n\nMy daughter and I both understood the goal of this assignment to be to research and learn about her family's culture. [Reference the exact wording on the assignment.] Is this correct? \n\nOur family's culture is not tied to our country of origin. Although this is somewhat unique among those of us of European descent, our family's cultural identity is Jewish. The Jewish identity is not only a religion, and culturally distinct from any individual country, even Israel. I know this can be confusing for people not already familiar with it. I'd be happy to discuss it further with you and answer any questions you may have. This is why my daughter turned in an assignment showing her research on this cultural group, and not a country. As far as the assignment was communicated with me, I believe my daughter's work fulfills the basic requirement.\n\nMy daughter has told me that you have asked her to redo this assignment and research a specific country. Is that correct? Again, she and I understood that the assignment was about culture. [Reference the original wording?] Did you clarify this in person in class?\n\nIt looks to me like we have a misunderstanding related to the specific requirements of this assignment: culture or country. Of course, if the assignment handout said country, or you told the class in person that they had to research a country, my daughter and I misunderstood and she needs to redo the assignment. But if the assignment was to research her family's culture, than I respectfully assure you she has done exactly that and ask that you grade her work accordingly. It is both fair and necessary for her to redo the assignment if she misunderstood, but it is not fair for her to do more work because her family's culture is not tied to her country of origin.\n\nOr I wonder if it's possible that the assignment said culture, but maybe you have a learning outcome or curriculum requirement regarding researching countries that the class has to fulfill? In this case, I understand the need for her to meet that requirement. But as she completed the project as assigned, I don't believe it is fair to ask her to repeat her work. Is there a smaller supplementary assignment she might complete to fulfill the same objective?\n\nI hope you understand that I am not seeking special accommodations for my daughter. I'm looking to see if there is a misunderstanding at play that we can resolve without adding extra work to your plate or hers. Ultimately, she needs to fulfill the same educational objective as her peers.\n\nPlease let me know your thoughts on the subject.\n\nThanks,\n\nEtc.",
            "I think you're making the right decision here. I remember when I was in 4th grade I was assigned something similar and, since I was black, I couldn't point to any specific country as my nation of origin. Because of that my teacher tried to force me to identify one as if somehow I was just joking about not knowing which country my slave ancestors were stolen from.\nIt's not only a little insulting to try to cookie-cut a person, even less a child, into specific mold just to meet a nonessential learning/assignment benchmark, but it's also alienating. I remember other kids talking and getting excited about where their families came from while I had to confront the reality, at 11 years old, that I'd never know that kind of information or get excited about my ancestral language. \nLater confrontations revealed that my 4th grade teacher was more than a little racist, but it took my mom standing up for me publicly, for me to take pride in the mystery and struggle of my lineage. I'll always love her for that to be honest. I don't let people give me shit about the color of my skin TODAY because of the resolve my mother showed in that parent teacher meeting.\nSo I mean, I hope that helps?",
            "Why is everyone downvoting the OP? This is a perfectly legit reason to be annoyed with the teacher. The teacher should let the student turn in the assignment as is, and sharpen up her instructions for next year. Things like this are a learning experience for the teacher - it's not the student's fault. \n\nI would politely email the teacher (maybe CC the principal?) and say that the instructions weren't clear, your daughter put a lot of work into the assignment, and if she could turn it in as she had already done it. You can reference your Jewish ancestry and point out that like many other ethnic minorities, your people come from various countries (and Israel is not one of them).",
            "Honestly, it sounds like the teacher gave unclear instructions and this situation is complicated by the Jewish diaspora.  If your daughter were to write about Israel, she'd have to write the country pre-diaspora, not as it exists now.  If you want to keep fighting this, just go above the teacher's head.  \n\nIf you really want to be a pain in the ass about it, redo the assignment and haul out ever shit thing Russia or Poland did to the Jewish people.  Point out how they weren't allowed to consider themselves real citizens the countries of and how they were othered and discriminated against for thousands of years.  ",
            "The assignment didn't say they had to write about a country specifically, it said to write about their culture. That was the point of the assignment. So anyone who is Italian could write about Italy and Italian culture, and anyone who is Irish could write about Ireland and Irish culture, but my daughter isn't allowed to write about her culture. I don't think that is fair.",
            "This assignment seems destined for problematic situations if students have to justify how they identify themselves.  \n\nWhat if you are African American?  How do you choose a country in Africa when you may not have any way of tracing your heritage there?  What if you are adopted?  Do you choose your birth parents or your adoptive parents?\n\nThe problem isn't with the assignment but with her insistence that a student makes a choice that she deems appropriate.",
            "I feel like this thread is a great example of redditors being clueless about minority issues. The teacher wrote a rubric that was unclear in the case of minorities, and because of that, your daughter is being asked to do extra work. That is most definitely unfair but unfortunately, it's going to be up to you to decide how hard you're willing to fight and what compromises will make life easier for your daughter. I'd perhaps start out by suggesting a compromise where your daughter writes a second report and your teacher has to apologize for not considering the case where somebody's culture is not the dominant culture of their country.",
            "I work in a school. Unfortunately, the school system is fucked up, and there are a lot of very specific things that the teachers need to teach. If the teachers were told that they needed to assign an assignment about \"a country,\" then she might have just been worried about the pressure from higher up. Did the assignment specifically say \"country\"? You could have just picked Russia, and done the same thing.\n\n\nWhat is the principal like? Can you go to them? Some might be so worried about backlash for being culturally insensitive that they will support you to the teacher. Do you live in an area with almost no Jews? \n\n\nGranted, a lot of people are just idiots. My principal told an 8th grader to ask me why Hitler killed the Jews, because it is \"my history\" and thus, I am a reliable source and the Internet is not. I was in my 20s. I live in NYC. All my grandparents were born in NYC. But I'm jewish, therefore a reliable source about Hitler.",
            "I would certainly appeal this. I'm an Ashkenazi Jew. My family lived in Ukraine and Russia back when they were the USSR. I speak Russian fluently. But I've never been there, I don't identify as Russian. I identify as Jewish. Had I been born there, I would have held a *Jewish* passport, not a Russian one. I would not have had the same opportunities Russian citizens had. Jewish segregation in Europe was so prevalent that Shakespeare addressed it in The Merchant of Venice. Both of these points might help with the teacher. Jewish does not automatically mean Israeli, and how could it in a 68 year old country?\n\nThe teacher decided that a culture meant a country, which is completely inappropriate for a marginalized culture.",
            "[deleted]",
            "I'm a teacher, and I started out in social studies. Honestly, her presentation would have been a great addition to everyone else's because it would have demonstrated the difference between a state and a nation, which is something that most state standards address (usually in the context of WWI and the leadup, but it can be taught anytime it's relevant).\n\nYou can have your daughter redo the assignment, but the lesson there will be, \"Sometimes the people in charge are unreasonable and wrong, but we all have to eat shit sometimes.\" That's probably a lesson better taught to a high schooler, who's about to embark on the world of college professors and employers. \n\nI would write her an email that's nice, but very clear about why the assignment was done this way and a request that she not have to redo it (or, if she does, that she get some kind of credit for the original one in some form). If the teacher doesn't budge, take the emails to the administration. \n\nYou're in the right here. I detest the helicopter crap that pervades schools, but this is NOT an example of that. This is a legitimate issue. \n",
            "When you talk to her your only points need to be the following: \n\n1. The assignment did not say you had to pick a country, it said to talk about family culture, and have a copy of the assignment attached to whatever you give her so everyone can see it doesn't say country and clearly says culture; \n\n2. your culture is _____, which is what daughter did the report on. (You do not need to talk about why you didn't do it on Israel, or explain your culture in anyway or explain why culture is not necessarily correlated with a modern country - Edit: Because this discussion is distracting and unnecessary); \n\n3. You followed the instructions, and therefore, unless teacher can tell you why the project needs to be redone for some (legitimate) reason besides the fact that it wasn't done about a country, daughter will not redo the assignment, and you will do what you need to do to make sure your daughter's grade is not affected by the fact that it wasn't done about a country. (I don't think you need to say/threaten that you will go to the principal, or whomever, but make it clear  that you're not going to go away. She has no basis for failing your kid and no basis for making her redo the assignment.  Unless the report gets graded on the merits of the report, you should continue to complain...and in my mind, teacher better be able to tell you exactly why points were taken off if points get taken off. and If teacher can't, then continue to complaint. )\n\nYou're not being unreasonable. Teacher is plainly wrong.  Maybe teacher does have pressure from someone higher up telling her that the students need to do a report on a country - but if she then gave an assignment that didn't require students to do a report on a country, then she messed up and needs to confront that.",
            "i'm really aghast at all of the comments telling the OP to just roll over and accept this. her daughter did what she was supposed to do as per the assignment. it is the teacher's fault for failing to outline her expectations properly. the daughter did the work as instructed, and now is being penalized because of the teacher's mistake, and expected to do twice the work of other students. furthermore, the assignment as the teacher is requesting is impossible for her daughter to fulfill, and it's culturally insensitive.\n\nit's the teacher's responsibility to provide proper guidance and instructions to her students as to her expectations. if the OP rolls over on this, all she's teaching her daughter is to never stand up for herself and accept whatever people in power tell her, even if it's unfair.",
            "5th grade teacher here.  Your daughter's teacher is a moron and gives education a bad name.  Go to the administration with your concerns.  I am glad you tried to explain this to the teacher before going to administration (parents please be this considerate before doing the same), but this teacher is so caught up in her students doing what she wants, she's killing their desire to learn and discover.  It sounds like you 100% fulfilled the spirit of the assignment, which to her credit didn't sound like a bad one.  Please do not make your daughter redo the assignment.  This is a great learning experience for her as far as sometimes you have to do what is right not what you are told to do.  If it means she takes a zero explain that you are proud of her for doing the assignment and you made your ancestors proud.  ",
            "I agree with you, it is disrespectful of minorities. I would bring it up with the principal in a way that makes it clear that it's not just your daughter that you are worried about,  but other minority cultures who have complex histories. I'm absolutely positive that the school will not want to be seen as culturally insensitive",
            "It sounds like this teacher is not very considerate towards cultures that technically do not have a country. The Jewish people have been pushed out of multiple countries, and therefore do not \"technically\" have a country. Now some do count Israel as their home country, but it is not always true. As a teacher myself, I would be more concerned on whether or not the child's report is historically accurate. Yes some teacher's check off boxes, but in MY classroom, I follow the curriculum but the way I deliver it is my choice. \n\nWhat if you family culture is American? How are you suppose to pick a country for that? I'm Irish, Scottish, and German descent, but my family left those countries in the 1600s. I am technically American. The wording of the assignment is horrible from what you've stated, and I would dispute the grade with the principal if the teacher refuses to accept the grade. Also check to see if there is a rubric that the teacher handed your child, if it is not in the rubric, then she technically cannot be counted off. ",
            "I get why you're frustrated. This teacher honestly sounds unintelligent, socially unaware, or just unkind. When I taught history, I assigned a similar project. Students were supposed to research their family trees and reach out to older relatives if possible. My school was very diverse. I had first generation immigrants whose parents didn't speak English. I had black students whose ancestors included slaves. I had adopted students, foreign exchange students, children of divorce etc. While valuable, these types of assignments are fraught with pitfalls. I made it clear from the beginning that I would be very flexible about students' family situations and final projects. I checked in with everyone and helped when I could. Grades were based on quality of research and presentation, not the strict following of directions. The teacher's suggestion about Israel seems particularly uninformed.\n\nI guess you have three options - comply, escalate, or ignore. To comply, you can change the title of the poster and add a map of Poland. You can escalate by contacting a principal. Or you can just state your frustration and walk away. A poor mark in 5th grade probably won't do any damage, though it is unfair to your daughter. ",
            "I've had a teacher pull something like this on me before. I was asked to talk about my family and our heritage. I'm Black, our history and heritage has been to lost to time and many other factors, so when my teacher asked us to do the same exact project, I too caught hell because shit, I don't know what country my family came from, but they were nomadic and traveled through Africa and eventually (read: thru slavery) made their way to the United States where again, they managed to escape an venture through the US and ended up with Native Americans and bam. I made my project about my family's culture and everything like that - I was ordered to do it again, because she said \"Do your project on American culture\" ??????? Isn't that what History is about? But yeah, I lost out because my parents had the \"Adults are always right\" mentality and made me follow everything to a tee, and I still got a C on the project. I say stay firm with the belief, tell her EXACTLY word for word that your daughter and yourself are part of a culture that has no country to call home, but is just as interesting as any culture in the world.",
            "I think you missed that my daughter has already finished the assignment. I don't think she should have to do extra work just because the teacher made up new rules about the assignment after the fact. The assignment doesn't say to research a country, it says to research your family's culture. That was the point of the assignment. If the teacher wanted them to research any country, she should have set that as the assignment. ",
            "OP, I'm an Ashkenazi Jew too.  If this happened to my kid, I'd be seething.  \n\nStand up for your kid.  Let her know that even though the world is unkind and occasionally unjust, you'll always be on her side.  It'll strengthen your relationship with her, and that matters more than the stupid assignment. \n\nI would go to the teacher with a good website on Ashkenazi history, or a good book, and explain the situation.  If she doesn't get it, the same thing in a louder voice to the principal, with hints of how antisemitic this will look to the media.  Ask if a Native American student would be allowed to write about their culture instead of white American culture.  Ask if a Black student would be allowed to write about the slaves instead of the slaveholders.  \n\nIf all that fails, see if your daughter wants to redo the assignment or fail, and tell her that you'll support her either way.  In the end, it is her decision.  ",
            "This isn't a hill to die on--this is fucking Masada! And now it's time for you to hold the fort!\n\nWe're Jews. Not Poles, not Russians, not Romanians--Jews! And for a damn good reason: because they said so! We never rejected these cultures, they rejected us. Denied us, citizenship, stuck us in ghettos, attacked our heritage and often killed us. \n\nMs Jones needs to change her position on this immediately, and you ought to make clear that if she won't, there will be hell to pay. Do not back down, give in or give up. She wants a report on your ancestry--give her a re-enactment. Let's see if she can handle it.",
            "I'm a teacher ... Ask to see the written assignment topic; verbalizing is not enough. She needs to have WRITTEN \"country,\" for her stance to be 100% ... Also, these days we teachers must post lesson plans online ... Are hers on the school website?\n\nIf you really want to get her on her toes, ask for her to clarify what CURRICULUM STANDARDS are being taught via this project. \n\nShe is being obtuse. Clearly, not all Jews are from Israel ... It makes me concerned about how smart this teacher is. \n\nThis will likely result in a meeting with the dept head or vice principal. Ask to audio-record the meeting; this makes school admin nervous, and is good for you. ",
            "Clearly the teacher does not understand the difference between culture and country. She also probably didn't fully think through the complexities involved for some people. Furthermore her comment to write about Israel, generally highlights her lack of cultural sensitivity. \n\nFortunately you're not going off the deep end about it, she is lucky. Many people would be extremely offended and insulted the teacher is dismissing and failing to recognize their cultural background after being specifically asked to write a report about it. \n\nYou should most definitely loop the principal in. The teacher is treading dangerously on racial, religious areas. A more excited parent could claim discrimination. \n\nYour daughter should not be punished because her teacher does not understand the nuances between geographic country and cultures nor should she be punished the teacher does not understand the history of changing borders and displaced people.",
            "People here are being quite rude. I am Jewish too and I understand the issue I think. However sadly school is often a bureaucratic nightmare. To make it Jewish as possible and follow the silly country specification, perhaps your daughter could write on whichever country your grandmother came from? (To keep it nice and matrilineal?) and then write about specific Jewish customs of that country? Because while there is ashkenazi culture, I know that my Russian bubbi does things quite different from my Hungarian bubbi so there are country specific things. ",
            "At best, she's trying to cover up her own mistake. At worst she's trying to erase your culture. Either way you should go to the principal, and if nothing comes of it, the school board.",
            "This teacher sounds culturally insensitive and just plain dumb. Even if your daughter had misread the assignment (which she didn't), I *still* think that a decent teacher would demonstrate a bit of flexibility and understanding about it. \n\nI'd request a meeting with the principal. I don't think you're going to get any further with someone this dense. ",
            "It sounds like Mrs. Jones needs to be reminded that the nation state is a modern invention that not only excluded certain nations/cultures, but had extremely deleterious effects on some of them, as it did for the Jews. I recognize that it's only an elementary school assignment, but her insistence on linking the students' national heritage to a nation state (i.e., a \"country\") is actually teaching students some very bad lessons about the nature of national heritage. Particularly the suggestion that your daughter  do her project on Israel if she wants to focus on her Jewish heritage, which just reinforces the idea that ethnicity is linked to a political state.",
            "Reply by email, ccing the principal,  that,  \"I'm sure you aren't trying to be antisemitic but my daughter's religion is her culture and heritage.\" That should end it. ",
            "Hey. Former teacher here. Seems like the teacher is coming from a place of ignorance. I know it can be a pain, but speaking in person seems like the best option here. I'd also request a third party (department head, grade level chair, assistant principal, someone) to be present. \n\nBottom line. Jewish history and culture is complex and it doesn't seem like this teacher cares. Which I find disrespectful on her part. ",
            "The teacher is conflating the nationality (of a nation-state) with culture/ethnicity which isn't bound by political borders. Explain that your heritage isn't Israeli and that your ethnic roots are from a minority culture in various Eastern European countries. This teacher is splitting hairs for the sake of \"the rules\" or for easy grading. If the teacher doesn't change her mind, explain all of this to the principal. ",
            "Ask for the marking rubric and outcomes that the teacher is trying to get the students to achieve by doing the assignment?",
            "Does that teacher have any concept at all of European history? You should ask her to bring up a map of Europe 100 years ago and point out where \"Poland\" and Ukraine\" are.",
            "OP, did her teacher send an assignment sheet home to your daughter? Like an outline of the assignment? \n\nIf so, reread it. Then once you find out there is no specific \"Write about a country\" line, and instruction to \"write about your culture\", then I'd march my ass into the principals office. \n\nI'm white, and I haven't faced any discrimination due to my heritage. That said, if someone told me to write about my heritage, and then said \"Oh I'm sorry, you can't write about France, they're too broad a subject. You have to redo the assignment\" I'd be pissed off. \n\nAlso, your daughter is 11. She shouldn't have to redo an assignment because her teacher is vague about it and decides after the fact that she didn't meet her requirements that weren't there before. \n\nEdit: Words",
            "In my experience, a project of this type/scale would have been supported by in-school library research on the child's chosen country or culture. Was this not the case? Why did the teacher or research librarian not identify that the child was doing the project wrong?\n\nAlso, a rubric would have been distributed that showed exactly what points were being awarded and for what, so if the child turned in an assignment that met the rubric's requirements, I'd say you have to go above to the assistant principal or principal. However, if it did not satisfy the rubric, she should do it again and possibly be awarded extra credit for the previous assignment. Additionally, I would take this opportunity to make sure the teacher understands how both the ambiguity and some families' cultural heritage should warrant a re-examination of this project, should it be assigned again in future years.\n",
            "Just tell the teacher \"No, she won't be redoing it.\"   Even if she gives her a zero, so what, she's 11.  If she tries to hurt your daughter with a zero or a bad grade, then go above her to the principal. This is ridiculous. An unclear set of instructions and an incorrect assumption that her ancestors are from \"a country\" shouldn't be used to punish a child.",
            "I am Jewish. My grandfather was born in Cologne. Considering that the Germans murdered a large proportion of his family, there's no way in hell any of us would identify as German. He never set foot in Israeli, so we sure as hell aren't Israeli either. \n\nWe are Jews, and now Americans, and that is all. Whatever you do, do not back down. Do not teach your child that she has to compromise her heritage for the bullshit expectations of others. ",
            "This exact assignment tripped me up at about the same time.  Instead of contacting my parents, my teacher shamed me in front of the class about how I was too dumb to understand the instructions.  My mom came to school to tell the teacher to her face, in front of my classmates, all about the Pale and the horrible anti-Semitism and which concentration camps my family was taken to when.\n\nI didn't know it, but when I came home in tears to work on the same project over, my mom went straight to the principal, and when the principal sided with the teacher mom decided to teach them a bit of history.\n\nObviously this is just one way to go.  Honestly, I'd refuse to redo it and accept the zero.  Escalate if you feel comfortable.  If you're the only Jews in your community like my family was, there isn't much else to be done.  It got to the point in high school where we had to threaten to sue to get me back into school after I was up for expulsion for getting in a screaming match with a teacher who claimed Jewish was a race and refused to understand why this was so upsetting.  The administration said my expulsion was for gross insubordination and leaving school property, but when faced with a civil rights case they backed off.  I switched schools soon after.\n\nObviously I hope your family has more support and find a more...peaceful resolution.  I applaud you for standing up for your daughter and your real heritage.",
            "Your daughter's teacher is out of line. What of the Gypsy/Roma of Eastern Europe? The early First Nations of North America? Shit, what of the descendants of black North American slaves who don't know which African country they're from? Maybe make a poster of the US with a chain symbol? The teacher should have specified *country* instead of *culture/ancestry* if that is what she wanted. I think you might need to go above her head.",
            "What does your daughter want to do about it? Another comment said you have three options: comply, escalate, and ignore. It does sound like the teacher is being incredibly shortsighted, but I would think an 11 year old should have some say in what happens with her assignment and with her teacher. Whichever option you choose together, use it as a teachable moment (ie, why you chose to die on that hill so to speak, or not, and how to make these decisions in the future)",
            "Ask the teacher to see what standard is being covered. I'm not sure what class it is for, but the way the directions were set up could have something to do with standard mastery. For example, if the standard is, \"I can identify my familial country of origin,\" then she the teacher might suggest she hasn't mastered the content. ",
            "The teacher seems either very stubborn or very uneducated about cultural history, I would talk to the principal and refuse to redo the assignment. Obviously there's no reason to make a federal case out of it, but I would rather my kid take a bad score on one assignment than be taught things in school that are clearly wrong. Just my two cents.",
            "What does your daughter want you to do? When my daughter was 11 she would have hated for me to get involved in school drama. Is it a possibility that the assignment was marked on particular points about a country that weren't included in your daughters assignment, which would make it impossible to mark ( a national costume, flag, pictures of food etc ). I am positive that if you escalate this matter you will get a satisfactory outcome, because no school will want to come across as anti-Semitic or repressive of any culture. However you may draw attention to your daughter and yourself in a way that will cause the teacher and school to look upon you unfavourably in the future. I don't live in the US but in NZ and my experience is that if it is a state school that your daughter attends they do not cater to the individual. ",
            "Sounds like your daughters teacher is a you know what. I would set up a meeting with the principal ",
            "Fourth grade teacher here. \n\nAsk to see the rubric that the teacher will be using to evaluate the project - if it says country, maybe ask if she can switch it to \"region.\" \n\nI'm sorry this is happening. School shouldn't be so stressful for eleven year olds.  ",
            "Lazy teacher. You're within your rights to complain - she is discriminating against your daughter for not having an easier-to-mark family history. I'd be straight down there demanding an apology and a real grade. I'm not one to complain about PC stuff usually, but this is her personal family history. How dare she, and over a poster too? It's a poster!!",
            "Add in a few details about what country your ancestors came from.  Keep the focus on Jewish history - there were ghettos and pogroms in those countries.  You don't have to write about mainstream/Christian culture , but adding a few details about specific country ______ might be enough to make the project conform to the standards. and get the teacher to back off.  \n\nAlso, don't be afraid to go to the principal.   Ask what the teacher would expect a Native American child to do - would they have to write a glowing report about the US government forcing their ancestors onto reservations?\n\n",
            "I'm a Ukrainian/Polish Ashkenazi Jew and if I had to write that assignment I'd approach it exactly the same way. My grandparents only ever spoke bitterly (if at all) about the countries where they were born, as did my mom who grew up in the Ukraine, and my dad doesn't know a damn thing about Poland. I once asked him if he knew where my grandmother was from in Poland and he said \"I don't know, probably a shtetl.\" \n\nI'd just be blunt and say that her relatives were historically persecuted and explicitly excluded from Russian and Polish culture. That would be a heavy topic for a child, but she'd learn a lot from researching it and the teacher would learn a thing or two as well. \n\nWriting about Israel would be difficult because no one in your family has lived there or speaks Hebrew. You could have her write in one line like, \"My culture is Jewish, and Israel is a Jewish state\" and then leave everything exactly the same, except anywhere that says \"Jewish people\" change to \"Jewish people in Israel and in other places.\"",
            "Your teacher designed a project based on the curriculum expectations that she cover a country. Your interpretation was hat it wasn't clear. You are in the right. Explain to the teacher that your daughter did it right and that the instructions weren't clear. Could she please mark it as though it got her criteria. If not, I'd go to the principal and point out that it's not fair and the instructions weren't clear. It's not a big deal unless you make it one. ",
            "The Jews have been outsiders in every country they've lived in. Your daughter's teacher needs to acknowledge that the culture of the shtetl has always been distinct from the culture of the country, and to deny this is racist.",
            "Fellow Ashkenazi Jew checking in. This is not a small thing, I totally understand why you and your daughter are upset. Do not let this go.\n\nThis teacher sounds like she is uninformed about the Jewish diaspora and the extent to which Judaism, unlike other religions is an ethnicity and culture and not just a religion. She asked the students to do a project about their family history and culture, that is what your daughter did! If she had done a report on Poland and Russia, that would in no way have reflected her family roots. In fact, it would have been a report on nations that were for centuries very hostile and oppressive of her culture and ethnicity! This would be like asking an African American or a Native American to do a report on their ancestry but then insisting it must be only about \"white\" culture. \n\nI'll give the teacher the benefit of the doubt that she's just uniformed (which is reasonable, as this is something very specific that many non-Jews may not understand) and not actually deliberately anti-Semitic or racist. You need to take this further and talk to the principal and explain your concerns.",
            "As someone who has studied \"Eastern\" European history quite extensively, I know exactly the issue you're facing and it stems from the teacher's ignorance of the subject.  More so than that, it shows her unwillingness to accept that such a thing is possible, which is quite sad given the changes that the region/Poland/Russia/Lithuania/etc have gone through in the past 600 or so years.  \n\nBest way to handle this, in my mind, is to go above the teacher's head.  Not sure if it's possible but a meeting between yourself and the teacher and/or principle should work itself out.  If you think you're articulate enough to explain your reasoning (I have no reason to doubt it... just saying; it can be a tough subject to explain) then by all means do this.  History is on your side :)\n\n\"Culture\" is far different than \"nationality\", *especially* when it refers to Jewish life throughout history. \n\nOn the other hand, you could just write the same story from a Russian or Polish perspective, and I doubt the teacher would know or care.  It comes down to principle though I suppose, but maybe that's the easiest solution. ",
            "I remember doing this assignment when I was in school and thinking about how problematic it was at the time—I can't believe they're still doing it! What about kids who were adopted by families of a different background? African-Americans? Anyone whose family history was complicated by war, genocide, or colonialism? I would go to the principal over this, because there is some ignorance that needs to be corrected. If the teacher's response to you was honestly suggesting that your daughter do a report on Israel, there's a huge lack of understanding of Jewish history there, and it concerns me that an educator would think that way. Plus, the school should be motivated to make things right with you, since religion is a protected class.",
            "I think you need to talk to her and explain who you are and give her a quick rundown of your cultural background yourself. I'm a teacher, and in school, one of the things they stressed the most is cultural sensitivity. Trying to assign a culture to your daughter because she (the teacher) doesn't understand Jewish history is absurd. (Fucking Israel? Really?) \n\nIf I were you, I'd have my kid redo the project. Then I'd make it about the treatment of Jews in one of those countries. You want a project on the Ukraine? All right, the disenfranchisement of Jews in the Ukraine, coming up. \n\nPlus, if that's not what she intended, what would she do if she had a black student? I'm assuming you're American. A black kid damned sure wouldn't write about a West African country. It's a dumb assignment if she wanted a country's history, she's just too stubborn to admit it. \n",
            "I'm half Ashkenazi and half Sephardic and I experienced a similar kind of difficulty when faced with these kinds of assignments. So many of my classmates could trace their heritage back to one specific region or culture and my family had been a lot more scattered and not limited geographically. As a Jewish mutt essentially I agree with you that writing about Ashkenazi or Sephardic customs makes sense. Maybe your daughter could speak briefly about the various places your family has lived (for example I always mentioned how my family had fleed to Turkey during the Spanish Inquisition, but that didn't mean I would then write about Turkey as if I was a person with Turkish customs or heritage). Maybe this is an opportunity for your daughter's teacher to learn a little more about people's cultural backgrounds and realize they aren't limited to geography. It must be alienating for other students as well, I would assume, whose families are from more various backgrounds. ",
            "I'm not really familiar with being on the parent side or being on the teacher side of this kind of situation, but is there a way you can talk to the teacher and reach a compromise on the assignment? Like others have said the teacher may not be trying to be stubborn about it but is being pressured to fit to some standard. Maybe you can ask if there is a way for your daughter to restructure or reword some parts of her report to fit the format required instead of having her redo the whole thing. Maybe you can even ask to see the rubric the teacher is using for grading, or ask for more specific details about the criteria the assignment will be graded on so that you can better tailor the report to it",
            ".",
            "The teacher is just perpetuating the same idea that \"Jewish\" is simply a singular religious view which is probably why she wants an essay about Israel. She's severely misinformed, and OP, you're totally correct. Being Ashkenazi is just as valid as being Polish or Russian, it's another part of you and your daughter's lineage that's spanned generations. Definitely meet with the principal and teacher and be ready to school 'em. This is super dumb on her part lol. ",
            "How the hell would this assignment work for African-American students, many of whom have no idea where in Africa their ancestors came from (unless they had genetic testing)?",
            "You could always just pick a country in East Africa and do the report on that, because if you go back far enough, that's where we're all from.",
            "Lady, you take this up as high as you can. Don't stop fighting it. There has to be a Jewish association that you can reach out to. I want to read about you and your fight in the papers. Your child didn't miss the point of the assignment, the teacher is ignorant and doesn't understand. \n\nTell the teacher that her wording indicates that she may not understand specific circumstances that don't allow her assignment to be fulfilled. Tell her you nred some time to secure the appropriate support groups available to aid families like yours in these situitions and that you'll be setting up a meeting with her and the principal before any next steps are taken. Thanks in advance for her patience. ",
            "Talk to the principal. Subtle bigotry is still bigotry. ",
            "So I have learned more about Jewish history from this thread than I did in school. I feel really bad about this. It is a failing on my part, but also the result of growing up and being educated in a predominantly white culture that didn't tend to concern itself with the history of the oppressed. If the teacher is the kind who doesn't really care whether the kids learn about the world around them or how to think, just that they can pass a test or find a place on a map, then you should contact the principal on principle. \n\nBut maybe she's like me:  largely ignorant about the history, but willing to be humble and learn. I hope she can see it as a teaching opportunity; I think the best teachers learn from their students. Good luck, man. ",
            "Hey OP, you might get higher quality advice from /r/parenting - I suspect a lot of the commenters here don't have any experience with the school system. As evidence look at the downvoted comments. A lot of them are thoughtful comments from teachers. Very useful!",
            "[deleted]",
            "Universal design for learning calls for various methods of instruction and different paths to get to the completed product. She did the assignment but did it differently than the other students. Sounds like Mrs. Jones isn't allowing student success on the basis that your daughter didn't do it the way she saw herself doing it  ",
            "Did you contact the principal about this issue and file a complaint? Explain the situation, the instuructions, your culture, and how hard she worked. Make sure to emphasize how this is insulting to your culture since she is being asked to report on a culture that is not her own, despite already doing a project on a culture that is hers. REALLY emphasize this... like use words like discriminating against her culture and minimalizing the importance of her culture. Maybe even ask how the superintendent, school board, and the state would think about your daughter being dismissed of her own culture... or even maybe the media given there's a big importance of culture lately and respecting one another's culture.\n\nThen see how fast it's not only ok your daughter did the presentation, but how fast the teacher apologizes.\n\nA proper teacher would understand culture sometimes is not consistent with one certain area. A proper teacher would respect your daughter's culture. A proper teacher would write clear instructions. A proper teacher would not belittle your culture and dismiss it just because it does not fit her mold of what a culture is.\n\nBring out the mama bear in you and set this straight. Your daughter should not have to re-do her project just because her culture is different from others.",
            "This is kind of a stupid assignment to begin with. If you are American, in my experience most Americans don't even know where they are from. Or they list a whole hodgepodge of countries. Being \"from\" over a handful of countries isn't a culture. Your culture is American at this point. You're not one-eighth Irish, one-sixteenth German, one-quarter Turkish, and seven other different things. You are American. That is your culture.  ",
            "This entire issue with this teacher has me doubting her own educational background. There is so much historical and geographical ignorance in her response that it hurts my head...if it's in the U.S. this also hurts my irrational sense of national pride. ",
            "OP, this comment is probably coming too late to be applicable to your current situation, but in the future, I'd (politely) ask the teacher to show you the wording in the lesson plan for this particular assignment. Phrase it like you're just trying to understand how/where the miscommunication happened. That way instead of you being caught in a 'child-said/teacher-said' thing, the teacher will have the chance to either provide proof of their representation of the assignment, or they'll be forced to acknowledge that the assignment could have been interpreted exactly the way your daughter interpreted it.",
            "For me I would push 2 things.\n\n1) I would find a way to \"technically\" get as close to the specific instructions as possible. So for example, would it be ok for her to do a map...a more detailed one where she could put the star on more than one country/nation? So as to try and follow what was requested.\n\n2) Have her do the BEST DAMN report ever on Ashkenazi Jews, and if necessary take a lower grade...you can teach her to both stand up (respectfully) for herself and teach her that sometimes you accept the consequence for what you do...when it is 100% worth it on moral reasons for example. ",
            "My family is from Eastern Europe and I'd like to read the paper to learn about a different culture, personally!\n\nThe teacher could have learned something from your child's paper  herself, had she an ounce of curiosity.",
            "Take it above her head. She wasn't clear and she's not being cooperative. The point of school is to teach, not bog children down with unnecessary details. ",
            "It may be that the teacher is using this assignment to fulfill a specific Learning Outcome (set by the district or state) that is required at your daughter's grade level wherein students study another country in depth. If that's the case, the teacher may not be able to accept the project even if she wants to. She has likely already tried to make it more interesting for the kids by making it about their own family, but the thing they have to complete is the country part. She may even be trying to keep an older favorite assignment in the new curriculum, which is why the phrasing of it is weird (she might not like the new curriculum). \n",
            "I'd go straight to the principal with this and let them know that the teacher is being intolerant.",
            "Tell her this behavior is anti-Semitic. It is, since it's wildly insensitive to Jewish history, and if she's got any smarts then pointing it out to her ought to light a fire under her ass. If it doesn't, tell her boss. Not coming off too strong is great, but so is ensuring respectful treatment of minorities from authority figures.",
            "Ask to have a one to one meeting with the teacher or like a Skype meeting with your daughter present. Have a copy of the rubric or assignment. Maybe start off by having your daughter explain from her point of view what the assignment is. Ask the teacher what the goal of the assignment is, and please keep an open mind on this and leave some wiggle room if it's to fulfill state standards as others have suggested. It is possible the family customs was meant to be a bridge to engage students to the work as a personal, relevant connection rather than the main focus of the assignment. Possibly ask for the specific standards the assignment is meant to fulfill. Be prepared to listen, be respectful, and do not place your daughter in a position where she has to deal with negative fallout from this. Go through the rubric one by one to see where there was a miscommunication and ensure daughter understands where she needs to improve the assignment. If what the teacher is asking isn't backed up by the rubric, then I would consider asking the department chair or principal to weigh in as that is a sign of less than thorough planning on the teacher's part. Above all be respectful and do not go full helicopter parent on this.",
            "Hey OP I think it's great you're standing up for your daughter in this. I can't tell you how many times growing I'd have to hear \"Judaism isn't an ethnicity, it's your religion. Did you mean Isreali? I'm just going to write Isreali.\" for these types of assignments. Much like you and your daughter I have no ethnic ties to Isreal and I'm actually half Jewish through my father (but my mom is in her words \"just white\" so I don't really have any other specific ethnicity to point to), so telling me it's my religion just shows a looot of ignorance. It still makes me angry to think about to be honest. I've had to have so many ridiculous fights with people who clearly don't know much about Judaism at all, and yet somehow feel qualified to disagree with me about my own heritage. And it's the worst when it's in front of your class. So I don't think you're overreacting or making a big deal at all. I would keep doing what you're doing and I wouldn't make your daughter redo the assignment. What would the teacher have done if she'd been Romani? Or Native American? Would the teacher have told her to write about the United States? If the teacher is going to give personal culture based assignments she should have been prepared to be at least a little flexible, and she clearly wasn't. If you want to try talking some sense into her I think what you've said in your post about sums it up, but if she won't budge I'd take it the principal, emphasizing that she's treating your daughter differently because she's jewish and its making both of you uncomfortable.",
            "Is this a new teacher? \n\nIt's possible that the teacher intended this to be a project researching a specific country (I remember doing a \"country\" report on Ireland in the 6th grade - sounds about the same time frame).\n\nTo make this report more \"interesting,\" the teacher wanted the students to do a report on something from their ancestry. \n\nThe problem arose when a student did a report on something that wasn't a country but WAS about their ancestry. \n\nSolution? The teacher accepts the project and amends the instructions for future classes. The teacher may have not had this issue come up before - it's a first for her, but your daughter shouldn't be \"punished\" or told her ancestry is \"wrong\" for not being from one specific country. \n\n(I've been teaching for <5 yrs, and I've had to adjust my instructions multiple times for future classes, but I wouldn't trash a student's assignment due to a misunderstanding. I would if they were trying to get away with doing the bare minimum (and therefore haven't completed the project enough to pass), but it shouldn't be done due to miscommunication.)",
            "I think you're totally justified in being annoyed here, especially since this bitch is digging her heels in so hard instead of realizing she's wrong. You say she's in her 50s, so she's obviously not a rookie here & I wonder how many other kids have had to deal with something similar. I can't imagine your daughter is her first Jewish student ever. CC the principal on any & all further communication with the teacher, by the way.\n\nAlso, I'm not a mom so take this with a grain of salt, but your daughter should NOT redo the assignment. Since she obviously put a lot of time & thought into something personal, I would let her take the L on this one and turn it into a teachable moment about standing up for herself and her principles even at the risk of personal consequences. She's only in grade school; the college admissions people won't be like \"tut tut, what about this zero on your 5th grade history report?\"",
            "I am Austrian, German, Irish, English, and Scottish. My last name sounds Irish. So in that assignment I chose Ireland. I'm a fucking American, everything else is just for fun. The teacher is trying to have students learn about cultures around the world, which is good. ",
            "Just pick a country to focus on and ask the teacher if there will be any further assignments where culture will be the focus and not country. It sounds like the assignment was designed to get students to research a particular country because by and large it allows people to also explore culture. \n\nI kind of think you just want to be correct and show the teacher she is incorrect and  really it is just one school assignment that needs to be graded, just go with the flow and if this makes you think your daughter is not getting the education or teaching you think she needs re-consider the school for next year.",
            "Do whatever is best for your child, and her education.",
            "Do you have the exact words the teacher used about the assignment?  Were her instructions written or spoken?",
            "I empathize with your frustration;  however, I think the most important lesson is that your daughter learned more about her culture. Even if she has to redo her school work, I think it a learning opportunity.",
            "I'd object to doing the assignment all together. My mother was adopted. I would be unable to do this assignment. How alienating. I'd have problem with this in general, lots of people don't know where they came from and most people didn't come from just one place. ",
            "Maybe write back to the teacher that she should reword her assignment to be worded with \"COUNTRY\" instead of \"CULTURE,\" because the two aren't mutually exclusive, and that she shouldn't punish her students for her own errors and dissonance. ",
            "Besides the advice already listed, if the school/teacher insist on your daughter redo it, help her focus specifically on Ashkenazi culture in each culture, and contextualize it within the frame of the overall culture. Have her focus on questions like \"Is there any difference between Russian and Polish Ashkenazi Jews, and why?\" \n\nThis teacher really is being unreasonable in my opinion, but if she has to redo it, then have her touch on the overall majority culture, but contextualize what her ancestors would have lived like and their culture within that country.",
            "I would be feeling pretty insulted, so I don't blame you for being upset. I agree with the suggestion to write an email and cc the principal. This is really ignorant of the teacher.\n\nEDIT: We're Mennonite, and that comes with a lot of culture from a lot of places, so I get the feeling.",
            "Explain it calmly and politely, similar to how you did it hear. Send it via email, and CC the school's principal or superintendent. This is a potentially offensive situation (you being offended) and they should fear a PR disaster -- or at least truly offending you. The teacher might not fully understand, or could just be a fool. Her boss shouldn't be.",
            "Ashkenazi here as well.  Sounds like you have Galician ancestry (hope I spelled that right.  Maybe you could do a report on Galicia?\n\nIt is definitely not to early to be talking about pogroms, the holomdor, and the holocaust... my mom is a holocaust survivor and started explaining that stuff to me when I was 5.\n\nedit: maybe she could do a report, not you",
            "If the teacher wanted it to be about what countries you trace your heritage to, those should have been the instructions. They weren't - the assignment was to write about cultural heritage. Well, some people's cultural heritages are complicated. The teacher's instructions should have been more clear.",
            "Talk to the teacher and try to clarify the situation of the Ashkenazi Jews and their history. If that doesn't work, talk to the principal.",
            "Make sure you CC the principal. Or perhaps just write to the principal. \n\nMany teachers are ignorant especially at that grade level. It's understandable with a case like yours too, who would know that on a normal basis? I had to look that up myself. \n\nAnyways, I'd contact the principal and her. It's not a matter of going over her head for a grade but merely getting her to accept that your daughter's project fits the criteria.",
            "What a stupid assignment in the first place - I take it you are American, and the level of diaspora in America is so great that it would be impossible for the majority of people to accurately trace their ancestry. She should have just randomly assigned countries to students to do reports on or something.",
            "I hope someone cross-posts this to r/history",
            "The teacher should have communicated more clearly what she wanted out of the assignment, but there are ways to make the assignment actually fit the parameters without arguing your way out of it... Writing about the Jewish culture of Russia in particular seems like it would be a specific enough research topic for the teacher to be satisfied.\n\nI don't think she should have to entirely redo it at this level just for approaching the question wrong. I've done this on countless papers in college and only ever got \"good research and argument, but that wasn't actually the question asked. C-\" because they can't deny that I put in the required work. There might be something in your kid's assignment you're not telling us (like, did she meet a word requirement at all or did she just draw a big star on the map instead?)",
            "This recommendation says to use exact wording from the assignment and then towards the end of the letter states LV2016 is unsure of the assignment \"(Of course, if the assignment handout said country . . .\").   This might come across as snarky as you are stating you know what the assignment is, but then asking questions as if the teacher didn't explain the assignment well.  Paired with this comment \"I know this can be confusing for people not already familiar with it. \"  That sentence can be interpreted as attitude or calling the teacher an idiot.  My recommendation, before you write the teacher or principal a letter is to get a copy of both the assignment and your daughter's work and review both.  Additionally, maybe ask a friend (without giving them all the details as to cloud their judgement) to also look at the assignment and work and see if they think it meets the requirements.  If your daughter's work does in fact meet the requirements of the assignment, then I would speak to the teacher/principal. Always be careful of wording in e-mails as they can be interpreted in ways you didn't intend. An in-person meeting might be best. One last comment, if you do feel your daughter's work meets the requirements, highlight specific paragraphs in the documents to show the requirements have been met. ",
            "Could an option be to \"ask for a second opinion\"?  Could you ask that a second teacher review both the task as it was worded and the project itself?",
            "Had this problem when I picked to talk about a past Prusian relative that I look almost exactly like. Teacher didn't want to accept it because Prusia hadn't been a country for quite some time by then. But then we had that astronaut return from space and officially not have a country to return to....my paper got accepted.",
            "Updates, OP?",
            "Maybe, instead of redoing the whole thing, she can keep the Eastern Europe drawing with the star over it, and then perhaps on a margin on the side or bottom, choose a few countries to draw the represent some specific countries you can trace your lineage to. \n\nThat way, the overall message of her heritage is that her culture isn't defined by geopolitical borders, that your traditions of Judaism are their own thing that happened to exist in this particular region of the world, and that it transcends borders. However, having a few specific countries at the bottom can help give people of an idea of the larger contexts in which your ancestors found themselves in. \n\nPerhaps you can also add a few sentences throughout the report that acknowledges the common customs of a few of these places, but to highlight the distinctions between the national customs and the customs of your ancestors. For example:\n\n\"While the people of this country ate X or worshiped in X way during X political conflict, my ancestors living here made and followed their own customs which gives us our identity. While their neighbors may have done X or Y, my ancestors did Z.\"\n\nThat way, again, you are showing that you understand what the people of this country were doing and are using fact-inserting to highlight your specific ancestry. \n\nLife is about compromise. If the teacher is still being weirdly insistent, I'd ask for a meeting so you guys can get your points across in person. It's possible she needs to teach specific things and that has to be reflected in the work of the student. It's possible she doesn't understand your perspective. It's possible she's a bitch. A meeting might help clear up which one it is!",
            "I think the best thing to remember is that summer break is soon.\n\nThough frustrating, stupid, and a waste of your time, it might be more productive if you use this assignment as a potential chance to teach/learn with your daughter about your heritage. \n\nI know this is not ideal, but it might be more fruitful than arguing with a teacher. I say this both as an education specialist now and as a child whose family was once in frequent disagreements with the district. \n\nIf you set up a series of meetings or let it get deep under your skin, you might get out of a project, but you will likely spoil the relationship you have with people who have direct power over your daughter for ~35 hours a week. This can be stressful for your child or worse depending on the professionalism of the teacher (which seems low.) Similarly, in your daughter's experience, it could link \"family heritage\" to \"unpleasant anger.\"\n\nYour frustration is just and the teacher is stubborn (at best), but taking the high road might be best for your daughter. On the other hand, I regularly thank my mother decades later for yelling at my 4th grade teacher on my behalf, so it goes both ways.",
            "What's the exact wording on the project? Kids are usually sent home with a sheet of paper that says what the assignment is. ",
            "It's probably not the individual teacher's fault at this stage, and there's probably not much she can do. Individual teachers don't have an enormous amount of leeway around assessment generally, and she may be just trying to tell you what she is required to do to make this work.  \n\nThe criteria she has to mark on aren't generally going to be her choice, they're given to us when the syllabus are set, and while we have discretion on the design of assessment (provided it's approved), the criteria have to be consistent. It's often a matter of jumping through the hoops to tick those boxes at times. \n\nIf anything is her fault it's that she or someone else at the school designed an assessment that assumes a culture is tied to a specific country, and now that it's out to everyone she likely can't change it. She probably didn't even design it. If it's a grade wide subject then usually the HoDs are responsible for that, and the assessment was likely designed last time the syllabus was set in this subject, which could be years ago. \n\nYou can go over her head to a HoD (Head of Department - whoever at the school runs that particular subject), or over their head to the principal. But the reality might be that the core part of this assignment as decided by the syllabus was to write about a country, and whoever designed the assessment included the culture aspect as a way to engage the kids in the topic in a more personal way. If that's the case then she's going to have to write about a country to get the marks she deserves, because otherwise the teacher won't be able to tick the boxes on the assessment criteria that say she has done so.  \n\nI do however think it's appropriate to raise with someone higher up. Whoever is in charge of this subject should be made aware of this problem so they can fix it on this piece in the future, because that can certainly be done. \n\neta: after reading through these comments I'm so curious to see the task sheet for this piece. ",
            "Is there any way you could post a picture of the actual rubric or assignment sheet?",
            "I think it's time for a parent-teacher conference. Bring in some literature about your culture for the teacher and discuss the issues you have with her in person. If the two of you can't come to an understanding, then take it to the principal. ",
            "I think there is a possibility the teacher has some kind of \"clue\" to the assignment. That at the end of all presentations she can summarize by talking about nationality or national identities or something else. And maybe that's why she's being stubborn? ",
            "I would rewrite the report to fulfill the silly requirements, but be sure to include something by an expert that explains why this is actually not part of your heritage. With lots of citations, if possible.",
            "That teacher is a moron. ",
            "Your daughter's grades at 11 don't matter for college. Just let her get an F on this assignment. It's just a letter.",
            "Or you can let it go and teach your daughter a valuable lesson that sometimes authority is wrong but if you keep butting heads, they can make your life hell .. so you choose your battles wisely & move on. This really seems like a minor issue that shouldn't be escalated.",
            "Just get her to redo the assignment. She is 11 is it really worth going to war with the school over this? \n\nSometimes giving in and learning that the world isnt fair is really the best option. ",
            "If she won't back down your daughter can just add some maps of the various countries your family comes from and some statistics about how many Jewish people live in them. She can also add Jews in those countries speak X as a second language, eat Y (same info you have), have such and such customs (with the same info you have).\n\nI would try mentioning that it may be a good time to teach about nomadic people like Kurds, Jews, Roma, Mien, etc. I wonder what she would think about my family ancestry assignment. I'm black. I'd pick America. Ha.",
            "[deleted]",
            "Think about this from the teacher's point of view. She is probably trying to teach the class about different countries and their culture. She is trying to do this in an interactive way by making kids ask their elders about it instead of reading it in a book.\n\nYou messed up her assignment by talking about a Jewish culture instead.\n\nIt's like if she asked someone to describe NYC and the student describes it like China because they live in Chinatown. \n\nYes, she didn't explain the assignment well because she didn't expect this issue.\n\nYou complain about your daughter having to write about a culture that isn't hers. But most kids are doing that. Unless your daughter goes to an \"English as a Second Language\" school most of her classmates aren't 1st or 2nd generation immigrants.\n\nThey are writing about cultures that they and their parents have never experienced. They don't even know where their family is from, they just know the countries.\n\nThis is a school assignment. Suck it up and just do it.",
            "I've found with my daughters high school, any problems by teachers and head of years get brushed off quite easily.  The best thing is too take the issue higher, the head master or failing that the board of governors.",
            "It seems like the basis of the assignment is really doing a report on a country and the teacher is trying to personalize it for the students by having them do their own family's country of origin. ",
            ">Our family is from various Eastern European countries.\n\nSo pick one and focus on it, for the sake of the project. Your family has to be from some place - I'm a mix of a couple things, but when I go down my ancestry, I know where my family members physically lived. Pick a place your ancestors physically lived and do it that way, which will make your teacher shut up and is technically part of your daughter's heritage. ",
            "Tell her teacher to write you a report on the current affairs of a country like Czechoslovakia first"
        ]
    },
    {
        "post_id": "57q657",
        "author": "homeschooledcrush",
        "title": "UPDATE: I [19, M] was homeschooled, and think I am falling for my first real friend [20, M] at college.",
        "url": "https://www.reddit.com/r/relationships/comments/57q657/update_i_19_m_was_homeschooled_and_think_i_am/",
        "score": 2458,
        "num_comments": 42,
        "created_utc": 1476596522.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/53u1pj/i_19_m_was_homeschooled_and_think_i_am_falling/\n\nThank you all for your help and support with my first post. I had never had those types of conversations before. You all really helped me understand my feelings towards Gerad more clearly. \n\nI talked to Gerad the next day about my feelings. I told him first that I was confused about my sexuality. He was of course very awesome about this. His warmness with that helped me come out and admit my feelings for him. I told him that I had never had these kind of feelings for someone before, girl or guy, and that I was scared since he is my first major friend; I didn't want to hurt what we had. \n\nI know many people suggested that I not tell him the whole thing, but I saw a chance to get it all off of my chest, and I had to take it. He handled it well, and it didn't seem to have come as a surprise to him. He said that he didn't think it would be good for us at that point in our relationship, which did not feel great to hear, but was also a bit of a relief. He did hug me super close and tight. That was perfect. \n\nWe did not talk about again until last Tuesday. Our school break has been the past week. I couldn't go home because of a hurricane and flooding, so I went with Gerad to him family's home. I am surprised my parents would let me stay at a friend's place over break, but they are busy with some flooding. I got to meet his family and friends, and we spent a lot of time alone together. He took me dancing Tuesday because I made him promise to get me out of my comfort zone. I had never been dancing before. He was extra flirty with me during the night, and we were very close all night. When we got back to his house he made a move and tried to sleep with me. This really freaked me out. \n\nI let him know that I had an amazing night, the best night of my life, but that I am totally not ready to have sex with anyone. Just the dancing and the kisses on the cheek we shared that night were the most intimate things I had ever done. He was really sorry for coming on so strong. I was worried that I ruined the night for him, but he assured me he still had a great night. We stayed up pretty late talking. He asked me to be his boyfriend, and let me know that we can go as slow as I need to. So, we are together now. I kissed him very quickly today, and it was the best thing ever. \n\nAlso, everyone suggested that I look into therapy and I have had two appointments with a counselor at school. She is really helpful. Thank you for insisting on that. I think she will help me through some of my issues. \n\nI have not talked about this with my parents yet, and I don't plan to anytime soon. They will be cruel. I don't need that stress right now. \n\nTL/DR: I told my friend how I felt. We are dating now, which is wonderful. I am seeing a counselor at school. \n\n\n\n  \n  ",
        "permalink": "/r/relationships/comments/57q657/update_i_19_m_was_homeschooled_and_think_i_am/",
        "comments": [
            "I'm 33/f and have been through a lot in life so please listen to me. You need more of a support system. NEED. You are very, very vulnerable. And it seems that you are likely to make Gerad your everything and form a mammoth emotional attachment to him. I'm very afraid if things don't work out with Gerad, if your heart gets broken, that you will be very wounded.\n\nDo NOT throw everything into a whirlwind of Gerad. You need to really work hard at making friends, platonic friends. Ones who are good people, know you well, you can trust. Keep going to your counselor, that's a really good idea. But don't just go to a few sessions. Really build up a relationship of trust with her. Reach out to other adults and resources at your school. You need to make connections and have a caring group around you. Don't make Gerad your everything.",
            "[removed]",
            "I'm happy you're happy. \n\nThings I recommend: take a sex ed class. \"Human sexuality\" is a class that's on almost every college campus. It should include basic biology but also talk about queer (as in not 100% hetero) relationships, Kinsey scale, consent, and a lot of other topics that probably weren't discussed in your home. Maybe check \"rate my professor.\" Find the best one. \n\nJoin a student organization (or multiple). I would first recommend one related to your major. Get really involved with it, become an officer. It will be the best thing you can do for your professional future. Secondly, I would suggest an org that you're passionate about, like a cause or a hobby/game.\n\nExplore campus life outside of your classes and your relationship. Go to events hosted on campus, and if you live in a city, look online for interesting things happening (and attend)! This time in your life is crucial for developing your sense of self. Enjoy/rejoice in your new relationship, but do not let it be your only outlet.\n\nNo one person can be the \"only\" for a partner. It's a huge drain and tanks relationships. Continue developing friendships outside your boyfriend. \n\nI think you have a fantastic future ahead. Embrace everything! \n\n\n ",
            "I'm glad things have worked out for you.\n\nYou have however acknowledged your lack of experience and general naivety when it comes to knowing yourself and what you want, let alone how to have a relationship with someone. Your first ever friend turning into your boyfriend? That's honestly something that can turn very bad very easily. You're vulnerable, naive, inexperienced and young. You don't know who you are yet or what you want. Don't let your Gerad become your world. Make more friends, get yourself some therapy (So you can learn more about yourself) and try new things. \n\nDon't lose yourself before you even find yourself.\n\nBest of luck.",
            "This update made me very happy. I may or may not have squeed. I wish you all the best! It sounds like you and Gerad are adorable together. \n\nIn many ways, Gerad has more power in your relationship. This power is due to Gerad's experience and his upbringing, and him having such a big role in your life. This is not to say that Gerad is in any way a bad person or would take advantage of you or deliberately hurt you, or that things are going to go wrong for some other reason. I am trying to say that it is a good idea to take a few precautions - think of it like carrying an umbrella in your bag even if it's sunny.\n\nHave a detailed conversation about sexual and romantic boundaries and expectations - yours, and Gerad's too. Catch up on sex ed, even if you don't intend to have sex soon. Make yourself busy and build a life - make friends, get a hobby, or take up a project. Take care of yourself, and enjoy :)",
            "I just read through your original post and I am so happy for you!\n\nI skimmed the comments on that post and didn't see anything about this, so I wanted to bring it up myself at least briefly. You mentioned that because of how you were raised you were taught to believe that as a man, having feelings toward another man is wrong. I wanted to let you know there's absolutely nothing wrong with that. I'm a Christian too, and bisexual, and despite what you may hear people in the church saying, God's love is unconditional and he loves and accepts every part of you no matter who you fall in love with. I've found with Christians I personally know that they let fear and misunderstanding lead them towards homophobic and hateful actions, but you shouldn't let their words affect your own beliefs. How can they advocate intolerance while preaching that their God loves all people no matter what? It's hypocritical, and doesn't make sense. But I wanted to offer this bit of encouragement to you: your feelings aren't wrong and you are loved.\n\nI'm very glad things are working out for you. I wish you nothing but happiness for the future!!",
            "<3 <3 <3 \n\nThis is so cute and heart warming!\n\nBe sure to keep pursing counselling. It is so easy to be tempted to stop at times when you're having a good time but you really have to work though a lot of issues and I'm glad you're pursuing it.\n\nThe shame associated with how you were raised must be so awful. I can't imagine feeling that way. I am bisexual and was fortunate to be raised by people that would not shame me for that.\n\nAlthough it will be hard, I would definitely go the route of not telling your parents about your sexuality until you are no longer dependant on them financially.",
            "I'm so glad this turned out so well for you! Best of luck with you two! ",
            "I'm so happy for you. \nBest wishes for your future. ",
            "Don't talk to your family about it until you no longer need their financial support",
            "Congratulations! I'm happy for you, he sounds like a great guy.\n\nJust have fun and try not to overthink things, okay?",
            "OP, I'm a bisexual guy who was homeschooled, and raised in a very religious environment; I told my parents some things about my sexuality that resulted in them kicking me out on my 17th birthday.\n\nIt was really painful, and cut down on a lot of my life opportunities, but in retrospect I'm glad that I *did* make the break.\n\nAs others have said, it'd be wise for you to wait to tell them until you are independent (finished with college, say),  **but you have to tell them.** When you do, remember that it isn't a question, and it isn't something that is wrong with you that you should be ashamed of. If they are cruel or hateful, be willing to distance yourself from them until they decide whether your relationship with them is more important than their views on homosexuality.\n\nI and my parents made up a couple of years ago, and they've learned to accept more than I ever would have thought. My sister is trans, and they have ultimately been supportive of her. People can change.",
            "Wow, dang, this is like the sweetest thing ever. \n\nI'm a lesbian, and I have to say, of the many things good and bad I've done in my life, I'm really clear that I'm not going against God in any way by being a lesbian. This is how I'm made. And love is good. So having a loving partner is good.\n\nPlease keep seeing the counselor as you process this. You're very likely to have more emotional crap surface as the months go by.",
            "Aw man this is the cutest update ever.\n\nGood luck!",
            "So happy for you OP. Way to be brave about handling something new to you! \n\nAs others have said, for your own health and that of your relationship with Gerard, go out and make your own new friends and find your own hobbies. \n\nGood luck and congrats!",
            "Too sweet. Best of luck to you both."
        ]
    },
    {
        "post_id": "2wl2rp",
        "author": "intoon",
        "title": "UPDATE Me [32M/F] with my Husband[32 M] My weight loss is causing issues.",
        "url": "https://www.reddit.com/r/relationships/comments/2wl2rp/update_me_32mf_with_my_husband32_m_my_weight_loss/",
        "score": 2450,
        "num_comments": 155,
        "created_utc": 1424464623.0,
        "selftext": "Hi, guys! It's been a few months, so I figured I would update you ll on whats been going on. [Original Post.](http://www.reddit.com/r/relationships/comments/2msvbc/me_31f_with_my_husband_32m_my_weight_loss_is/)\n\nAfter posting, I had another talk with my husband. I was very clear that working out was to benefit my health and be a better Mother. I told him how I felt frustrated and tempted quit since my weight loss through diet only had stalled, and how much I really wanted to get into shape. \n\nHe really listened, and not only supported me working out, but decided to drop the sugary drinks and excessive fruits and potatoes and go full keto with me! This has made my dinner preparations so much easier! \n\nSince his switch to Keto, he's lost 30 lbs, sleeps better, works harder, doesn't get frustrated with the kids as easily, and our sex life is better now than it ever has been. It used to be that before, he rarely wanted to go out and do activities with the kids and I, now he gets so excited to go and participates so much more!\n\nChanging our diets seems to have jump started other projects in our lives as well. On New Years Day, we rounded up everything we haven't used in awhile and donated about half, and put half away for a garage sale in the summer. We made a 2 year plan to live ultra frugally while saving for our forever home.  I've picked up a few extra nights of business during the week since the price of gas has dropped. The extra income helps so much. I hope it stays down awhile while we are saving! (Wishful thinking!)\n\nI've been going to the gym after we put the kids to bed a few nights a week, and I feel amazing! I've had a bad back for years, but weight training is changing that! I love to feel my heart pounding and blood flowing while doing my cardio. Then I go home and my sweet quiet introvert husband has had an hour or so to himself and feels re-charged and misses me. Not only that, but i hadn't realized how much I had been ignoring my own needs. Those couple of hours alone each week do more than get my body back into shape, I feel such relief mentally to have just a little time to myself. My own music, my own workouts, my alone and get healthy time. The amount of energy I am feeling these days is amazing, my house is always clean, my clients are raving about my services, my 5 year old told me the other day how much fun Mommy is now that I'm not tired all the time.\n\n I've hit 70lbs down, and I'm this/close to breaking 200 lbs for the first time in over a decade. I feel like with my husband's support, nothing can stop us! I've never felt so motivated to reach a goal in all my life. I still went to the gym this week even though I rolled my ankle, AND it was -9* outside.  You can't stop this train! **CHOO-CHOO MOTHERFUCKERS!**\n\nWe are looking forward to Spring and all the outdoor activities we will be doing with our kiddos.\n\nI really appreciate all the great advice and support this subreddit gave to me. Thank you all so much! \n\n\n\n   \n**tl;dr**: Talked with husband and got through to him! He joined me in my quest to get healthy so now we are unstoppable and in this together! (*Cue themes song to 1980's \"Mannequin\" ) ",
        "permalink": "/r/relationships/comments/2wl2rp/update_me_32mf_with_my_husband32_m_my_weight_loss/",
        "comments": [
            "It's so refreshing to see updates like this on r/relationships.  So happy for you and your husband!!",
            "**ALL ABOARD THE /u/intoon HYPETRAIN!**",
            "[deleted]",
            "I fucking LOVE this update!",
            "Yay, so proud of you both!  It's true that if one partner makes a big change like that and the other doesn't want to change, it can break up a marriage - my husband has personal-trained many ladies who got in shape and switched to healthy foods while their husbands stuck to junk food and couch-sitting... 2/3 of those couples divorced.  Your husband is AWESOME for joining you and you are AWESOME for keeping it up.",
            "> CHOO-CHOO MOTHERFUCKERS!\n\ngreatest line ever.",
            "Mega grats. :) ",
            "Best post ever! :D was great reading such a nice end of story here. Was having not such a great day and this made it 10 times better! Should be on \\GetMotivated. Lots of luck with your ride! CHOO CHOOO!! :D",
            "Wonderful update!! Congrats!",
            "What an amazing update. \n\nGood luck to you two!",
            "I'm very happy for you and your husband!",
            "Great job. I am glad to see some positive in here. ",
            "Spring is going to be freakin' fantastic for you. When you get to go out and just do without the misery of the cold.\n\nRock on. Great story. All the best of luck to you and yours.",
            "This update is phenomenal. So many posts in the last thread about there being major problems for one reason or another, and it sounds like you guys are doing better than ever. \n\nReddit can be so cynical.",
            "[deleted]",
            "I am so happy for you!!! It's great to get positive updates, and it sounds like you and your husband are in a great place. Keep on keeping on! :)",
            "Man, you rock so hard. I've been being such a lazy ass since the weather got so cold, I've barely been able to make myself leave the house to go to the gym. Your update gave me an extra boost of inspiration.\n\nWeight loss is SO hard. You've made so much progress, it's amazing. And it's great to hear how good you're feeling too!\n\nKeep rocking on with your bad self.",
            "This is like a bad commercial for the keto diet.",
            "Fuck yeah!!! you rock!",
            "This absolutely exuberant update brought happy tears to my eyes. Good on you internet stranger, enjoy the fuck outta your happy life! ",
            "Get it gurrrrrl",
            "Was expecting some bad news. Really happy to hear this. Good luck guys! ",
            "Wow, amazing update!! Good for you! So glad it worked out! ",
            "Good for you and your husband, keep up the good work!",
            "This is such an awesome update! Good luck, you are a badass!!!!!!!!",
            "[deleted]",
            "LOLed so hard at \"CHOO CHOO, MOTHERFUCKERS!\"\n\nNice work! Both of you!",
            "This is so amazing. Congratulations on your progress and on successful communication! Please join us over at /r/xxfitness if you haven't yet!",
            "Sweet update.  \n\n(Ha, see what I did there)  \n\nJust kidding, keep kicking ass and taking names.  ",
            "Be careful with rolled ankles, better to let them rest a few days vs really effing up your ankle and not being able to do anything for a while.",
            "Awesome job! Keep it up OP!",
            "This is so much wonderful in one post!  Keep on truckin! You got a momentum now and it will only get easier and easier even though it already seems like you are way into it. This was motivating for me too!",
            "Sshhh....don't give out the keto-cheat-code",
            "Wow so inspiring! Enjoy and sustain the momentum!",
            "Went from [F] to [M/F], and was was so confused from the sudden change.",
            "I really should get healthy...",
            "Good God, that's some stick-with-it! Congratulations! \n\nTake care of that ankle though. The last thing you need is to exacerbate a little injury and cause a bigger, longer-lasting one that will stop you from working out. \n\nHoly cow, though, amazing progress. I'm going to think of you for a while when I need to get motivated to work out and remind myself that if a working mom can do it, I can, too. ",
            "I got chills at choo-choo!",
            "holy shit, 70 lb in 3 months!!  amazing!",
            "Awesome update! FREIGHT TRAIN!",
            "REALLY amazing work and super proud of you. Good on you for getting your butt going and getting out there in this cold weather. \n\nBe mindful not to push yourself too hard if you've rolled an ankle. Be extra careful not to sustain more injury and put yourself back. Take care and good luck OP!",
            "Go you! ",
            "So awesome to hear this! Hope all this momentum continues for you both!",
            "this is the cutest thing ever. i am so happy for you guys <3",
            "Awesome!!!! Congrats!! Always nice to hear amazing stories!!",
            "this made my day!!! keep it up! ",
            "This is so motivating!!! Thank you and congratulations!",
            "Turned out *much* better than I expected. The first post had me pissed at your husband. It was just pitiful. But the turnaround was much better.\nPlease please please get your kids into active lifestyles and make sure they keep that going. Everybody deserves the chance to enjoy the only body we have in this life. Please make sure they grow up with no regrets of their physical activity. You will be known as parents who beat their own situations to live the way we were intended to live, and passing that on to them. And then they can pass on the same knowledge. ",
            "Choo Choo motha fucker!!!",
            "congratulations!! I'd also say check out /r/ynab for an awesome personal finance tool if you aren't already using it!\n\nketo and ynab are my two life hacks!",
            "Keep it up!!!  You sound amazingly happy and I'm so glad your hubby got onboard!\n\nI've been there. Lost about 150lbs and fell in love with hot yoga. Husband had a hard time recognizing me. I had changed and he needed to catch up. We had other things going on but individual counseling helped us both. \n\nYou go girl!  When you hit your goal weight it will take awhile before you get used to being the healthy person and not the fat one.  I still panic about trying on stuff and worry that people will stare at me but not anymore. Now stuff is too big and they're checking me out not mocking me. ",
            "YOUR STORY IS INSPIRING!!! keep doing you!",
            "I am so happy for you! Getting healthy isn't easy, especially without the support of your partner. It's awesome that you two are accomplishing so many good things and I wish you the best of luck for the future!",
            "Get it girl! Wishing you decades of good health and high energy and love! ",
            "[deleted]",
            "Your husband sounds like a totally different man from the first post to this one. I assume you're getting more cuddle time when you're home from the gym",
            "Have neither of you ever thought of moderation? Not being no negative but you don't need to completely give up cards to benefit from a doet/lifestyle change... Before trying keto/any other extreme diet please try using myfitnesspal ",
            "A positive /r/relationships story!\n\nI'm so glad, not just for you and your family, but for me too!",
            "My wife and I have also recently joined forces on the Keto diet so I guess I'll see you over at /r/Keto and /r/ketorecipes ",
            "[deleted]",
            "Damn i'm so funny, but my keyboard is so fucking bad.\nThe joke was something about \"half male, half female?..\"and \"about freefiddy\". what can i say? joke was funny  ¯\\_(ツ)_/¯",
            "go guys! hit the gym, no need to lawyer up!",
            "> my sweet quiet introvert husband has had an hour or so to himself and feels re-charged and misses me\n\nWe all know why.",
            "So happy for you!  You will be in Onederland before you know it.  It really seems to me that people on keto, who have large amounts to lose, stick with their plans so well.  Now you are,both healthier and know how cook together.   Makes for such a better life, including sex life. ",
            "So! Many!! Exclamation points!!!  Oh my Gosh, guys!!!!",
            "Awesome! I'm happy for you. But you should be aware that this story can be triggering for people who have condishuns that prevent weight loss. Please be considerate. ",
            "I was so looking forward to this being some kind of drama filled saga about a sex change he didn't know about..... Well maybe fix the title and call it good and I'll keep hunting for that great white buffalo...."
        ]
    },
    {
        "post_id": "3p1d1o",
        "author": "piercedpussyfight",
        "title": "My [26F] husband [30M] of 1 year is upset because I don't want to color my hair blue or get a genital piercing",
        "url": "https://www.reddit.com/r/relationships/comments/3p1d1o/my_26f_husband_30m_of_1_year_is_upset_because_i/",
        "score": 2437,
        "num_comments": 382,
        "created_utc": 1445028817.0,
        "selftext": "**I updated, in case anyone is interested: https://www.reddit.com/r/relationships/comments/3p6ron/update_me_26f_with_my_husband_30m_of_1_year_is/**\n\n**edit: I started to try to reply to everyone, but I honestly didn't expect to get so many replies. I'm sorry I can't respond to each of you individually. I'm numb right now. I just texted my husband and told him that I'm going to visit my parents for the weekend. I've got important papers, some clothes, and important belongings in my car, and I'm shutting my phone off while I'm with my parents. Thank you all for giving me some perspective on this situation. I'll update once I've had a chance to figure out whatever the fuck it is that I'm feeling right now.** \n\nHello Reddit. Longtime lurker here, and now it's my turn to post about my conundrum and get outside opinions. I'm really at a loss at to what I need to do. This is really, really long, so apologies in advance. \n\nMy husband and I have been together four years, married for one. Before we met I went to cosmetology school and I loved to express my style by coloring my hair bright colors, wearing dramatic makeup, and stretching my lobes. I enjoyed those things for a few years, and then I outgrew them. I still appreciate such things on others, but my personal style is more conservative now. I've always dressed somewhat modestly, because I don't like showing a lot of skin in public, so it's not like I used to wear daisy Dukes and now I wear burlap sacks. But my hair color is much more \"natural\" these days, my makeup is classic instead of dramatic, and I let my lobes close up. My workplace is quite conservative, so my red lipstick and heels is already pushing the envelope a bit. \n\nMy husband has always known that I used to look edgier than I do now, but I've never dressed like that since we've been together. He's said in the past that he wishes I still had blue hair or stretched lobes, but its always been understood that I no longer want to do those things, and that I would most certainly be fired if I came into work with blue hair. Or at least I thought that was understood. \n\nI came home two weeks ago to find him looking at some pictures that one of my old friends had posted and tagged me in on FB, and I was in several of the pictures, blue hair and all. He started saying how hot it was, and how he wished I looked like that. He said it would be more exciting and that he had always had a kink for girls with edgier style. Ok, I can work with that! I bought some colored clip ins and surprised him a few nights later. I went all out: colored hair, black thigh highs, cute little panties with skulls on them, and a tight baby doll tee that he's always liked. At first I thought he was really into it, but after we had sex he said that he thought the \"trial run\" had gone well, and now I should commit to an edgier style. I explained that I didn't want to dress like I used to, that I enjoyed doing it in the privacy of our home, but I wasn't going to wear fishnets and combat boots to the grocery store. He got quiet and asked why I wouldn't do this for him. I said that I wasn't trying to hurt his feelings, and that I was more than happy to dress up for him for sex or a date. I just am not going to bleach and color my hair or stretch my lobes again. \n\nHe stayed quiet for the rest of the night, and refused to discuss it with me any further. He ended up getting up and sleeping on the couch, and had already left when I got up for work. That evening he came home after work and said that he'd done some thinking, and he'd thought of a compromise. He wants me to to get my clit pierced, because that way I'll be \"edgy\" but it won't be hard to cover like stretched lobes or bright hair. I considered it while I fixed supper, and later than night I said that I would probably be ok with getting my nipples pierced, but that I wasn't comfortable with a genital piercing. I've never been intimate with another person, and the idea of someone else seeing and touching my vulva/clit is very uncomfortable for me. I don't think it would bother me as much if it was my breasts, and if nipple piercings would make me husband happy, I would be willing to try. He blew up and said that I was boring and plain, and why couldn't I just give him what he wanted? He said that he had always hoped that I would regain my old style, but that he was becoming disappointed because I still hadn't after four years. He went on and on about how boring I am and how a wife who wanted to keep her husband satisfied would agree to a clit piercing if that's what he wanted. He said that he wants to use me and make me cry and see my makeup run down my face. He said that regular anal and PIV isn't enough anymore, and that my blowjobs are terrible because I don't want to deepthroat him or be facefucked. He kept going and going, shouting at me and turning bright red. I started crying because I was hurt and humiliated, and he told me to shut up. Then he left for two days and wouldn't answer his phone. When he came back he started giving me the silent treatment and sleeping in the guest room. \n\nHe seems to think that I was a different person back in those days. I wasn't. I wasn't promiscuous or \"easy\". For pete's sake, I was a virgin when we started dating! And I'm not withholding or cold sexually. I'm willing to try almost anything once. We have anal sex once or twice a week, PIV six or seven times a week, and he gets a few blowjobs a week. We've tried light bondage, spanking, and role play. The only things we've tried that I don't like is face fucking and facials. Both feel very degrading and humiliating. I'm not sure if it's just the act itself, or if it's the way my husband treats me during and after these acts, but I don't enjoy them. He got very upset when I told him this, but he hasn't asked about doing those acts in a few months, with the exception of mentioning it during his rant about clit piercings. He wasn't willing to try cuddling afterwards, or talking to me affectionately during, he just quit mentioning it altogether. \n\nIt's been days since the piercing discussion, and he hadn't mentioned sex once. He's barely speaking to me. He's been leaving his computer on with pictures and videos of heavily pierced and tattooed porn stars getting facefucked or roughly anally penetrated, but he won't speak to me. I don't know what to do. Do I leave? Should I ask him to leave? It seems so silly to leave him over something as insignificant as a clit piercing, but he really hurt me when he yelled and called me boring. \n\nTL;DR: Husband wants me to dress edgier, and when I said I didn't want to dress like that all the time, he suggested I get my clit pierced. I said no because I'm not comfortable with it. He called me boring and said that he wants to use my body and make me cry. Now he's giving me the cold shoulder and sleeps in another room. ",
        "permalink": "/r/relationships/comments/3p1d1o/my_26f_husband_30m_of_1_year_is_upset_because_i/",
        "comments": [
            "Your husband is getting regular anal and oral sex, and bitches about you being too boring???? \n\nHe's a spoiled little shit.",
            "Leave, your husband had started to get abusive, and unless he himself seek help himself and sincerely apologies he wont stop. He sounds like he only cares about himself. For the 4 yrs, has he always been selfish? Does he always get his way? Or did you always backed down and cater to him?",
            "Jesus. Why are you with this guy? You're not his Barbie doll. ",
            "Your husband does not respect you. He sees you as a sex object for his use.\n\nWhy are you with him? What's good about him?\n\nEDIT: Also just for reference, it's a clitoral hood piercing he's probably referring to... not a clit piercing. A semantic, but the difference is important, as piercing your clitoris can lead to nerve damage.",
            "He courted you because you were inexperienced, and because he thought you would be easy to control.  He picked you *because* others haven't pursued you, and he thinks he can use that to make you do what he wants.\n\nIf you have another argument, he's going to say something to the effect of 'no one else ever wanted you' - which is bull, by the way.\n\nHe's abusive.  He *wants* you to get fired - because then you'll be even more dependent on him, and he can force you into being his submissive crying wife.\n\nBut he did you a favor: he told you exactly what he wants:  he wants to hurt you because it turns him on.  He wants ownership of your body - that's what the piercing is about.  He will push at your boundaries until you cross every line for him.\n\nNow you have to escape.  This man is not a partner.  (And giving oral sex in a relationship where HE gets oral sex isn't a 'favor,' by the way, it's bare minimum)\n\nDo not let this man make you think that he's doing you a favor, he's not.  He hunted you because he thought he sensed weakness, and he thought he could turn you into what he wants: a submissive, helpless sex toy.\n\nProve him wrong.  Get yourself away from him!",
            "[deleted]",
            "You are not leaving him because of \"something insignificant as a clit piercing\" . You are leaving him because he is a horrible, pathetic excuse of a human being and a partner. \n\nIts not even his kinks and sexual acts that he demands of you, thats fucked up as well that he demands them, but what the fuck is up with him waiting for you to be edgy again when you clearly weren't that person from the time you two started dating? \nDid that asshole really date you in hopes that you go back to your previous style even after you told him it was a phase and you are over it?\n\nLose the entitled piece of trash and find someone who will genuinely love you for the person you are now.\n\n",
            "He basically told you in so many words that he's been waiting four years for you to turn back into the sex toy he's always wanted, and he's angry that you have failed to do so. He feels justified in screaming at you and insulting you because you don't want to allow a stranger to physically alter your genitals for his gratification. He's eager to use you for his every sexual impulse, regardless of how you feel about it, as long as you say yes. That you may feel humiliated, degraded, or physically uncomfortable does not deter him. It actually seems to excite him. \n\nThis is more than enough to conclude that he does not care about you as a human being at all. He may not even see you as a real person. The best thing you can do for yourself is get away and stay away. Four years in an abusive relationship is plenty long for some truly horrific abuses to start feeling \"normal\" to you. You've lost perspective on how terrible this is, and understandably so. It's a million times worse than being alone, he's teaching you that you don't deserve better. You do. Please don't resign yourself to this. ",
            "I started reading this thinking I'd suggest you try getting some fun wigs for the occasional wild night out (or nights in), but geez... he's really not interested in an actual compromise, and he displays a creepy level of ownership/entitlement over your body. \n\nI would tell him that you tried to meet him halfway, and he can either come to you or get the heck out.",
            "What an ass. This is divorce territory.",
            "So your husband kinda sees you as a breathing, internally heated Real Doll?\n\nMaybe you should have a real good think if this is a marriage you'd like to stay in.",
            "> It seems so silly to leave him over something as insignificant as a clit piercing\n\nYou don't leave because of this argument, you leave because he wants to force you into a BDSM relationship that you don't want. Just how far is he going to go to humiliate you? I'd be really concerned. ",
            "Jesus Christ, you married one of the most disgusting people I've ever heard about. You aren't a person to him at all. Just something to be used and hung up wet. Do not let him treat you this way! Please please make him leave and find someone who will see you as a person and treat you well.",
            "Hey op, no ones recommended this book yet and I feel it's really important reading for you: \n\n**Why Does He Do That?: Inside the Minds of Angry and Controlling Men by Lundy Bancroft**\n\nPlease pick it up and give it a read at your mothers. It opened my eyes after a similar relationship and really made things clear to me.\n\nedit: also thinking about this again and what I learned about my ex from reading that book, entitlement is like a core cause or driving force in abusive men  like this. He feels entitled to your body, to use it however he wants, and to dictate how it looks. He feels he is allowed to expect this of you but *also* feels entitled to not have to do the same for you (oral sex, probably lots of other things you didn't mention.)\n\nI can speak from experience, if you got the piercing, it would not end there. I made the mistake of doing something like that for my ex thinking \"if I just do this one thing - he will be happy\". But it isn't about the one thing, it's about control and making you do what he wants. My ex kept harassing me to do more and more things afterward, change clothes, hair, he never let up once. Doing what he wanted didn't pacify him, it wasn't compromise, it empowered him to feel more and more entitled. Asking for the clit piercing was his way to get his foot in the door, to get you to give in. There is no universe where he would stop at that one request.",
            "Jesus Christ, your husband is a fucking dick. Any man that would talk to his wife like that is not a man worth staying with. No respect at all for you. Please don't put up with this for the rest of your life, you deserve better.",
            "Nah, this isn't an insignificant issue at all. It's indicative of his views towards you - he doesn't respect you, your decisions, or your autonomy. He essentially views you as a hunk of flesh who he should be able to control.",
            "I'm sorry, my brain shorted out at the part where you offered to jam sharp objects in your nipples *and that still wasn't good enough for him.*  I don't like to call for divorce at the drop of a hat, but his attitude is so absolutely fucked up that I'd strongly consider it.\n\nI'm glad to hear you are getting some space and taking care of yourself.  Please do not give an inch to this entitled, emotionally abusive dickwad.",
            "There's a relationship model that would work for him, if this is his real priority in life: He could pay your way in the short term and set up a generous trust fund for you in the event of death or divorce. He could keep you in Manic Panic, studded leather, and fancy silk stockings till the day you die and wine and dine you so you never have to take a job again, and don't have to worry about putting food on the table as long as you meet his aesthetic standards. He could pay for your piano lessons or your riding pony or embroidery supplies and your vacations in the country to keep you from getting bored and antsy. You could concern yourself with home decorating and throwing dinner parties.\n\nBut you know what? Doesn't sound like he provides like a Victorian husband. So you don't need to try and be a Victorian wife.\n\nThis:\n\n> He's been leaving his computer on with pictures and videos of heavily pierced and tattooed porn stars getting facefucked or roughly anally penetrated, but he won't speak to me. \n\nIs one of the most ridiculous things I've read on this sub. It's basically the opposite of healthy communication and a huge insult to you. Consider couples therapy, but truly his mentality is unlikely to really change. He is living in a fantasy world where your job and your sensibilities don't matter, only what makes his dick hard does.",
            "Sounds like he wants to do certain things because they degrade and humiliate you and it turns him on, and you don't want to do them because they degrade and humiliate you and that makes you uncomfortable. So in response he's trying to emotionally manipulate you because he wants to 'use' you like your some sort of sex object, and he won't stop til he gets his way. \n\nAnd you married this guy? I think it's time to stand up for yourself and tell him that his behavior is disgusting and if he doesn't change you'll divorce him and he'll be free to find the edgy pornstar of his dreams... And you'll be free to find someone who respects both you and women as a whole. ",
            "LEAVE. LEAVE RIGHT NOW.\n\nHe doesn't respect you. He doesn't respect who you are, or what you want. You deserve SO much better. I know he's been trying to demean you and belittle you by calling you his 'plain jane' but honestly there are a million guys out there who would be lucky to be with you, and who will treat you how you deserve.",
            "Holy crap.  I'd be seriously considering leaving.  That's really shitty treatment on his part.  Try marriage counselling, but I get the feeling he'd laugh at that suggestion.",
            "He has shown that his \"turn ons\" are more important than you will ever be to him. He has no respect for you as a person and expects you to be his sex play-toy. He doesn't care about you. Don't put up with being treated like trash. You deserve better. End this farce of a marriage now while you are still young. Do you really want to raise a family with a man who treats you this way? (that is assuming you want kids someday. if not... he's still a major asshole) \n\nI am really sorry that he turned out to be a fucked up person. You really do deserve to be with someone who cares about your feelings and respects the decisions you make about your own body. If he loved you then he wouldn't be so obsessed with controlling you. \n\n***Cut financial ties with him, arrange a place to stay and then divorce him. Make sure you have a plan before you talk to him about divorce. He doesn't respect you so there is no way to know how he might react when you tell him you are leaving. He thinks of you as his property, after all.",
            "OP this is about control and has been from day one. That's why someone who needs sex ten times a week *after four years* was willing to wait for a virgin. He wanted to own you, you're a possession and now he can't dress his dolly up how he wants. \n\nWe all know what happens when a child stops liking their toy. They break it. Don't let him do that, it's staring you in the face, it's time to **go**. \n\nAnd for fuck sake, don't buy his \"I'll change\" bullshit that's next in line. He won't. They never do.",
            "In his head, you're not his partner as a whole person, rather, it's all about how you look (which sounds like a cool look, btw, but usually doesn't age well) and what he can do with your body (that gives him pleasure while being degrading to you).  \n\nWhat a sad, abusive, one-dimensional view of a life partner.  \n\nIt's not supposed to be like that!   \n\n\n\n",
            "Dump his sorry ass. None of this is insignificant. You deserve to be with someone who loves you, who respects you, and who won't abuse and degrade you.",
            "He sounds mentally ill. Does he have a mental health or addiction history? Any family history? \n\nPlease understand this: what he is doing IS NOT NORMAL OR OK. it's wildly inappropriate and bizarre. ",
            "Run. ",
            "*He has no fucking right to make these demands of you or to treat you like this.*\n\nHe sounds like a sadist, one who barely views you as a person. He gets off on degrading you, perhaps *moreso* because he knows you don't enjoy it.\n\nYou've been together four years, and in that time, this is how far things have escalated. This\n\n>He's been leaving his computer on with pictures and videos of heavily pierced and tattooed porn stars getting facefucked or roughly anally penetrated\n\nis the behaviour of a sociopath. Screaming red-faced because your spouse refuses to colour their hair, pierce their genitals when you demand it is inexcusable. I'm not sure if you realize just how far from a healthy *partnership* your relationship really is. The way he treats you is grotesque.\n\nI honestly think the only reason his abuse hasn't already manifested in straight-up beatings is that you've been mostly sexually compliant up to this point.\n\nDon't let this go any further than it already has. It has been getting worse for years, and there's no reason to believe that trend won't continue indefinitely.",
            "Run, run run run run run fast and far away, he sounds dangerously removed from reality. ",
            "***LEAVE THIS MAN***",
            "Tell him to get a Real Doll that he can have customized as he likes because that's what he wants - a toy he can fuck, not a partner.",
            "This guy sucks.",
            "Your husband does not respect you and he does not think of you as a human being with your own wants and desires. He sees you as his sex toy, not his partner. He even said he wants to use and abuse you. This is not a man you should be in a relationship with.",
            "> It's been days since the piercing discussion, and he hadn't mentioned sex once. He's barely speaking to me. He's been leaving his computer on with pictures and videos of heavily pierced and tattooed porn stars getting facefucked or roughly anally penetrated, but he won't speak to me.\n\nWtf!!! This is a man who cannot separate the real world from the porn world. He is so obsessed with his fetishes that he was allowed them to encroach on his sanity. He's not right in the head. \n\nDon't accept anything other than a total, unreserved apology and commitment to change. ",
            "Never stay with someone who degrades you, makes fun of you, or makes you feel less than. Don't stay with someone who wants to control your body, the way you dress, or how you act. You have a right to be uncomfortable with certain sex acts, it's normal.  No real adult should throw a tantrum when they don't get their way sexually. You know this is abuse. Everyone here is very upset you're being treated sooo incredibly bad. We care, and we're worried. I want you to realize that you don't have to settle for an abuser who makes you feel bad about your looks. You think you can't find anyone else, but girl, you are GOOD ENOUGH ALREADY. You aren't a plain Jane JUST because you don't want to completely stick out anymore. That's just another way he can degrade you in hopes it bothers you enough to change your looks for his own gain.  I'm so sorry this is happening. ",
            "I...my only priority in deciding what to say here is that don't want to say or do *anything* that might be interpreted as encouragement to stay in that horror show of a marriage one single second longer.  \n\nI've eaten a *lot* of shit in relationships and made a lot of choices that didn't reflect any love for myself.  But I don't think that even in my sickest times, I'd last ten minutes in that marriage after that conversation.  \n\nI hope you decide you've had enough *very* soon, and I hope you don't ever look back or even pause on the doorstep.",
            "it makes me soooo sad that so many women on this subreddit say \"i dont want to leave him over this one small thing\" and yet theyre being abused. no one should ever dictate how you dress or make you get a genital piercing or shout at you for not enjoying being hurt and humiliated. i saw your update but im kind of just commenting for the benefit of the community here, never ever ever feel obliged to change yourself, especially things that are damaging like hair bleach, or put up with sex that makes you feel humiliated and degraded, or let yourself be screamed and shouted at. anyone who treats you like that isnt worth staying with. dont stay with someone who takes away your autonomy. you should be allowed to say no to any sex act. you should be allowed to say no to having a stranger put a hole in your most intimate body part. you should be allowed to be yourself.",
            "Hi there. Good chance you won't see this, and that's okay, because I will probably just say things that other prom said, but I want you to know that you are worth caring for before your husband and that your safety and security and sense of self-worth and dignity are more important than any kink or fetish your husband has.\n\nYou shouldn't have to put up with being humiliated, harassed and judged by any person, much less someone who should love you and care for more than anything or anyone else. If you don't want to do or be something, then that's on the other person to be okay with or to hit the road. How you dress is up to you, and if your husband or your mother or your dog walker don't like it, they can build a bridge and get over it, because there aren't shit they can do about it. Do not think for a second that you are being unreasonable in this.\n\nHis hopes on you becoming more emo/goth/alt/whatever are not based on reality, and when he was brought to that reality, he should've said \"okay\" and worked on himself so that wasn't an issue. You are not supposed to kill yourself for his pleasure. Additionally, sex is not the be-all and end-all. You don't want to be face-fucked? Cool. Ask him if he wants you to ram him with a 18-inch spiked strap-on. I betcha he doesn't.\n\nIn the end, you should be with someone who makes you happy, not just somebody who's available. He's not the last guy on earth, you can do better and you will. I hope you find that someone soon :)",
            "run far away from this abusive man-child piece of shit. find someone who doesn't hate women.",
            "This is insane. I've never understood men who act this way. I've seen it a few times in the past; but, I just don't get it. It isn't his body. Has he got multiple genital piercings because you'd want it? Doubtful. Does he give up his ass when you want to get kinky? Doubtful. Maybe you'd like to see him service another man. Wonder if he'd do that because you think he's boring.\n\nI seriously hope your time away gives you the proper perspective on this. He's not only making unreasonable demands, he's acting like a petulant brat when he doesn't get his way. That it makes him angry is concerning.",
            "\"He said it would be more exciting and that he had always had a kink for girls with edgier style. Ok, I can work with that! I bought some colored clip ins and surprised him a few nights later. I went all out: colored hair, black thigh highs, cute little panties with skulls on them, and a tight baby doll tee that he's always liked.\"\n\nThis would have been an acceptable compromise for a man who respects his wife, and should have been the end of the issue.",
            "I know this may seem like a common reaction in /r/relationships, I have never given this advice before, but in this case I sense strongly that he does not respect you as a person, and I think you shouldn't subject yourself to any person like that. He does not respect your feelings or wishes, and he is acting like a selfish brat. My jaw dropped when I read your post, I would have gotten so angry if it were me. Has he always acted this way or given hints to his real self? If you truly think this is not like him, then I suggest seeking third-party professional help (i.e. marriage counselling). If he rejects this suggestion harshly, I would personally take it as a red flag.\n\nIt also jumped out at me that you were a virgin before you met him. I'm sorry if this is too forward, but I'm assuming that you didn't have much dating experience before him? The last thing I want to do is offend you or anyone else, but I feel like he may have taken advantage of your (possible) inexperience, as I've seen many times before, and has skewed your views on healthy relationships. The way you dress is truly only your choice, and if he pressures you to do uncomfortable things / things that could make you lose your job, then he married someone in his head. ",
            "All I keep reading is \"edgy\". You married a 4chan mod. ",
            ">It seems so silly to leave him over something as insignificant as a clit piercing\n\nI don't consider this insignificant.  I would be like you demanding he drill a hole through his dick even if he didn't want to, just to make you happy.\n\nHe clearly has a very specific fantasy, but it's not something you ever agreed to fulfill for him.  So either he has to get it elsewhere, be satisfied with the crazy amount of sex he's already getting, or you have to break up with him.\n\nHopefully this is a fantasy that can stay a fantasy, otherwise it sounds like a fundamental sexual incompatibility.",
            "No real advice that you haven't already gotten, just wanted to chime in that your husband is a real piece of shit. This is very much the most upsetting thread here I've seen here in a while. How someone can do this to their own wife befuddles me. ",
            "RUN. It's very apparent all he sees you as is an object, not as a person he loves or cares about. I agree 100% with what is posted below. You don't need this. \n\nI was you, once. and it backfired, horribly. I became a shell of the person I am, and it took me almost 10 years to recover fully. There are others out there who will like you, and actually LOVE you for who you are, not what you used to be or for some fantasy he wants you to become. ",
            ">if nipple piercings would make me husband happy, I would be willing to try. He blew up and said that I was boring and plain\n\nJesus, if that's boring and plain, what the hell are me and my wife?",
            "He wants a woman with a lot less self respect. You know, an adolescent who is still in a rebellious phase. He wants to be the daddy. It just gets weirder from there.\n\nYou should leave. Him leaving for two days would have been enough, let alone the porn etc. That's a whole new level of strange and abusive.",
            "Holy cow what a baby! I can't imagine ever acting this way towards my wife.",
            "This is horrible, manipulative, abusive behavior. You need to get out. He is trying to control you and then punishing you for not obeying him. What's worse, he sees nothing wrong with this behavior, because he doesn't respect you and feels entitled. It's only going to get worse.",
            "I can't believe what I'm reading. This breaks my heart, but I don't know how you can continue to be with someone who is so clearly mental. He sounds completely creepy like he wanted you to become his sex slave or something. Wow. I know divorce is a strong word, but that situation does not seem like it could ever become healthy. ",
            "PLEASE GET FAR AWAY IMMEDIATELY",
            "Well, according to my ex wife I am the most controlling person in the universe.   \n\nSo you can take it from me when I tell you he is being a whiny little bitch.  I mean... he complained about blowjobs?  I mean... unless you were doing some weird shit with your teeth that just doesn't compute.  Like... who does that?\n\nNow I know you're looking at it as \"Oh, a clit piercing is insignificant\" but he is looking at you as a plaything.  A toy to dress up and abuse.  He doesn't respect your body or your individuality.  \n\nThere is sex addict therapy and various other therapies.  He'd have to want those and want to change.  He doesn't want that, or if he does then it is certainly not apparent.  \n\nSo like... you could try talking to him, maybe see about a compromise, you wearing a wig and maybe one of those little clittoral vaccum things, but gonna go ahead and say that the sexual relationship isn't healthy and certainly not contributing to your emotional well being and if you're trying to continue the relationship because of some sort of codependence or loyalty that I don't think compromise on this front is going to be the right thing to do.  \n\nAlso, you could try getting him to indulge you in your fantasies, where he dresses up as a unicorn and you peg him or some weird shit, but uh... gonna go out on a limb and say he won't indulge in that.  ",
            "Wow, I am so, so, sorry that you're in this position.  \n  \nIn my mind, this guy's committed two major sins:  \n  \n1) Entitlement over your body.  He thinks his thoughts about what you wear and how you do your hair should trump your own thoughts on the matter.  He uses manipulative language to try to make you change your appearance.  \n  \n2) He wants rough kinky sex, but does not take any of the steps necessary to safely have rough kinky sex. IE, MARRYING SOMEONE INTO THE SAME THING, using safewords, aftercare, etc.  \n  \nBoth of these things are extremely abusive, and have nothing to do with hair or piercings.  \n  \nIt sounds to me like he assumed alt appearance meant kink, an idea that's pretty common in porn. And now that you're still failing to live up to his porn-created ideas, he's using verbal abuse and manipulation to try to shape you into his fetish.\n  \nPlease get yourself away from him, and stay safe. :/",
            "Oh dear. He wants a his own girl with the dragon tattoo that is also a sex slave. Poor thing.\nI dunno if this is something you're going to be able to reconcile because if a husband truly loved his with he wouldn't emotionally manipulate her into changing who she is as a person. \nGood luck, o.p.",
            "You deserve better, I hope you know that. ",
            "It's time to go to therapy or leave this man child. It sounds like he doesn't care about you or appreciate you. Look at the facts. He. Just. Left. for two days without saying anything. That's a terrible husband. ",
            "OP, you are not an equal partner in your marriage.  From this post and from your comments, your husband sounds like an entitled cunt.  In fact, his extreme reaction to your compromise (which by the way you had every right to say \"um no\" with no compromise at all, because it's YOUR BODY NOT HIS) suggests that you have been tolerating shit like this for a long time.  Which doesn't surprise me, because you say he is the only man you've been with, basically because nobody else was interested.  All of this tells me that you might be prone to abuse.  No self-respecting person should tolerate this.  There has to be a real consequence for this behavior or it will happen again.  I would suggest divorce, because he sounds like more trouble than he's worth, but I don't have all the info.  Maybe there's something redeeming there.  If so, settle for no less than a sincere committment to marriage counseling.  ",
            "I'm sorry you are married to an asshole. It's your choice whether you want to be married to an asshole anymore. Personally, I know what I would choose...",
            "Read your edit: THANK GOD. You need to get away from this guy who only wants you to be an edgy fuck doll.",
            "God your husband is acting like a child that isnt getting the toy he wants.\n\nYour husband is entitled to his preferences, but that's all they are- preferences. Your body is yours alone and he doesn't own it. You are uncomfortable with genital piercings (and trust me, I don't blame you) and he had NO RIGHT to yell at you like that. Plus the passive-aggressive bullshit of leaving that shit up on the computer. Marriage counseling is probably a smart idea, but it sounds like you are the settler in this relationship by far.",
            "Holy fuck you give this man the moon and he wants the sun TOO?   Fuck besides this guy treating you like utter shit, a sex doll for his pleasing, he is basically saying nothing you ever do will be good enough.   He is always going to one up you with something more radical than this.   It seems like it's about him controlling, dominating, and even humiliating you as a way to get off.    In no way have you mentioned life outside of sex and it seems like he just doesn't think of you as a life partner, but a live sex toy.\n\n\nFucking end it ... Such disgusting behaviour towards you.",
            "*  said that he'd done some thinking, and he'd thought of a compromise\n\nWhat is disappointing is, this man brings this compromise to you without having a conversation between his initial disappointment and his proposition. To me that is an issue, since you two are married. What's also disconcerting is his presumption that this was a trial run - what else is he making assumptions about that become expectations for him? Perhaps he will wake up, being 30, but some of his ignorance here is uncannily on par with the idiocy of a teenager. Kinks are one thing, but this guy has some communication issues that he needs to address. IMO it's an issue because he doesn't acknowledge your discomfort and immediately goes into an attack about you being plain, which is unnecessary and dismissive. It's manipulative, as is the rest of his aggression, and he either needs to cut it out or find a different relationship.\n\n* He said that he had always hoped that I would regain my old style\n\n*For four years he did not communicate this reservation!* What does he expect? This is very unreasonable, to expect you to catch up and give in. It is inconsiderate. He needs to wake up, or he will likely end up alone. He *yells at you till you cry and then tells you to shut up*. **That is abusive**, that is beyond just a lack of consideration. Has he regularly been devoid of empathy like this? Or is this your anniversary gift? An abusive asshat who gets violent like a child because he can't talk about his wants. If these things matter this much, he needs to have a conversation about them *before* marriage. Being a wife is not an unconditional contract to submission. There are people who have healthy relationships centered around domination and submission, but it involves communication, trust, and respect. These are essential and your husband is showing none of them.\n\n* He wasn't willing to try cuddling afterwards, or talking to me affectionately during\n\nThis is sad. You do a lot for him, you are very willing and this man has no idea how lucky he is. But he doesn't not show any appreciation for you, if he does not do these things. I do things for my partner, things she likes that you probably do not as much, sometimes I get too into it but sometimes I'm also more concerned than I need to be. Why I say it is sad is, he is getting his sexual wants here, to an extent, but it sounds like you get little to nothing in return. I can understand his expectations building off of that, *but his history of negligence in no way means that he has a right to it*. I think he expects you to be submissive because - if only marginally - he may be manipulative and get away with it, so he's upset when you make a stand for yourself. **The problem here is that the man doesn't just get off on power, he has an issue with not having it.** To empathize with you and make a compromise on his end, is implicitly submissive. There's nothing wrong with that, but he has personal issues and retaliates aggressively in response to you wanting a more equal relationship.\n\n* He's been leaving his computer on with pictures and videos... but he won't speak to me.\n\nMore covert-aggression! It's not covert in the sense that you can see it, it's covert in the sense that he's attempting to gnaw at you in subtle ways. Some might use the term passive-aggressive - but there is nothing passive about this! It is quite intentional, and it is meant to draw some kind of reaction out of you. This is an unhealthy choice of behavior on his part - unhealthy for him to continue the habit of being like this, wrong to the relationship, and abhorringly negligent of your feelings as well. If he doesn't shape up, I would plan on leaving him. This man is 30 and will have difficulty in changing. He will likely use everything he can in order to justify he wants. But if these things mean that much to him, he needs to do a better job of getting those on the table instead of simply assuming he will be able to eventually have his way. There is nothing wrong with wanting to facefuck someone, as long as they're willing to take part, but there is everything wrong with an abusive and manipulative relationship*. This man needs to make a fucking U-turn on his behaviors, and if he can not commit to that I would absolutely encourage you to move on and get him out of your life.",
            "This guy sounds **awful**. He doesn't respect you. He wants you to do things you don't, and his compromise is to do things you don't want to do. He responds like a child who can't have his toys, and is being passive-aggressive with the porn. If he's always been selfish, he's not going to get any better.\n\nEven if you agreed to the piercing because, hey, maybe you liked the idea, it wouldn't be enough. This guy feels entitled, and he doesn't care about you as a person. He wants a fuck doll, not a wife.\n\n> It seems so silly to leave him over something as insignificant as a clit piercing, but he really hurt me when he yelled and called me boring.\n\nYou're not leaving him over a piercing. You're leaving him because he doesn't respect you, period. He's not going to either. I see other redditors saying stuff like you're young, you'll find someone. Like, fuck that. Young, old, hot, not, who gives a fuck. You don't deserve the shit he's selling, so you should leave. Who cares what your prospects are, being alone is better than being with that piece of shit.",
            "Let him continue to be upset. His problem.",
            "This guy thinks he owns you and is entitled to whatever he wants. He doesn't view your life or your body as your own but rather has decided that you are just a sex object to please him however he sees fit. This is not a life anyone deserves. \n\nRun.",
            "I think most of these comments are headed in the right direction, that being create a little space, go stay with your parents or anything, and really think about what's going on. I'm sorry you're dealing with this, it sounds like a nightmare. ",
            "I would rather die alone than live with someone like that. Fuck this guy. ",
            "Abort mission! Abort!",
            "Ew, NO. This is seriously fucked up. You're not a doll that he gets to dress up however he likes. Throwing a tantrum and yelling at you for being \"boring\" because you don't want to get your clit pierced? What in the actual fuck.\n\nI know it's already been said, but this is REALLY not a healthy relationship. He *admitted* he wants to degrade you! I hope you're seriously considering leaving him for good, and not just a weekend.",
            "It's harder when you've only been with one person that way, and even harder once you're married.  Forget that yeah, his demands are pretty ridiculous.... Think about how he's acting like a kid over this...passive aggressive, storming out, silent treatment... do you guys have kids? Do you want to?  Is this how he's going to behave as an example?  What if you were to for one second act the way he is?  What if you asked him if you could stick a dildo up his ass during sex because its something you'd like? <--i have no idea, but the point is is g e willing to reciprocate the extreme - Ness he's expecting? You sound like you have a level head and are the only thinking clearly and he is having a temper tantrum. ",
            "You seem like a very reasonable, caring and attentive person. Willing to just get pierced, anywhere on your body, just for someone else, is considerate beyond what I can comprehend.\n\nHe seems like a controlling, chauvinistic, sadistic asshole and you would do better without him. It's amazing how long people can hide their true selves, but eventually the veneer cracks and crumbles.",
            "You would not be leaving him over a piercing. You would be leaving him because of the bigger picture. He is abusive. He has criticized the way you look as well as the efforts you have made to please him. And personally, I'm not okay with someone saying you need to do something in order for them to be happy/happier. That's manipulation. ",
            "He doesn't get to decide what makes you comfortable. Doing something that makes you uncomfortable in order to please someone isn't going to help things.\n\nHe's viewing you as an object. He told you he wants to use your body and make you cry. Forget that. You're worthy of someone who loves you and makes you feel respected. \n\nDon't be afraid to let go of this relationship and find one that fulfills you. Don't go down with this ship just because you're afraid another ship isn't coming. Set your own course and start swimming, you don't have to rely on ships, you're strong!",
            "It sounds like you are doing the right thing, heading to your parents, but I wanted to add something else if you need more reasons why what is happening is bad.\n\nI only know a tiny bit about true BDSM relationships, and I have never personally participated in anything like that, but I do know that couples that participate in that kind of thing are actually super respectful and careful to make sure that both parties are actually ok with what is happening. Think \"safe words.\" There is nothing wrong about two consenting adults participating in some humiliation or whatever makes them happy, but this is obviously not where he is heading.  Even a little bit.\n\nIf you look up how to start getting into bondage etc in a healthy relationship, you will see a very VERY sharp contrast with what is happening in your relationship.\n\nYou are going to be OK. Internet hugs.",
            "He's got issues, this is not healthy/normal in the slightest. You went out of your way and came up with ideas and he reacts like that?! It's probably for the better that you got out for now and I agree with the people who said that you should either get divorced or get him help, in case you still care enough about him after that episode.",
            "Shit like this makes me wonder how im single. I dont even kniw what to say. It sounds like you married a controlling man child.",
            "Wow... I am so so sorry that you have to deal with this. It's not something you can push under the rug. He is completely disrespectful and so selfish. I think the part that would hurt me most is the whole porn thing. Like he's saying \"this is what I like... And it's not you\". That's so hurtful and manipulative. \n\nI've been with my bf for 4 years and all of his exs have been \"edgier\". They have had colored hair and listen to the music he likes and they went to \"shows\" together. And I do none of those things... And I always asked him why he liked me so much because I'm nothing like the girls he used to date. And he always said that clothes and music and hair didn't matter. He loved that I was different. And that wasn't \"plain\" like I thought. He says he loves me for my personality and although he does sometimes wish we had more in common he wouldn't change me for the world. And it made all of my insecurities disappear....you need someone to love you exactly the way you are. You deserve that. I really hope that you find the courage in yourself to leave him and find someone better. I wish you the best. ",
            "You could make a better man than this out of pipecleaners. Get away as quickly and safely as you can. Men like this almost never change - for the better, anyway.",
            "When you realize what an ass hole he is and leave him. Be all \"All I really wanted was to see you cry.\" Then walk out. \n\n\nUuuugh, what a sick, seriously. ",
            "Wow what a piece of shit. He wants to degrade you and humiliate you. Just wanted to chime in and add that you need to leave him PERMANENTLY. ",
            "People treat sex workers better than this. Dump his ass.",
            "WHAT THE ACTUAL FUCKERY IS THIS?\n\nOk Op I'mma give you a list of what a healthy marriage/relationship should be.\n\n1.  Mutual consent \n\n2.  Focusing on the pleasure of each other and not just one person's pleasure which kinda ties into the first thing.\n\n3.  Respecting boundaries.  If you say no, no means no and your partner should accept that or fucking leave.\n\n4.  Caring about each other and supporting each other's decisions as long as it isn't harmful to anyone.\n\n5.  Treating each other as  a human being.\n\nWhat does he do?\n\nHe only cares about himself.  He doesn't care about what you want.  He couldn't give a fuck about your boundaries.  He wants you to please him only. He doesn't fucking respect you.  He doesn't fucking support you.  You are literally his doll in his eyes.  He thinks it's okay to guilt trip you into changing yourself and your looks even though he knows it'll make you extremely uncomfortable.  He's not boyfriend material, he's not husband material, he's acting like a spoiled creepy brat.  Find someone who will love you for you not love you only for something you could be.  That's fucking ridiculous and will never lead to anything good.  You have a voice and you are a human.  You are not someone's plaything and you are not someone to be degraded.  You have one life, do you wanna be tied to a complete jerk and be absolutely miserable or temporarily single and happy?\n",
            "That is one massive red flag over his head, the things he has been saying and what he wants.... Apparently he has been trying to groom you into a sex doll and is frustrated that you haven't obediently agreed to everything. Just wow that none of this came up before you got married. I'd usually say to work on it with him but really....just run. ",
            "> how a wife who wanted to keep her husband satisfied would agree to a clit piercing \n\nhow.. a wife who wanted to keep her husband satisfied...\n\ni'm sorry i didnt know it was one of our womanly duties to KEEP a husband satisfied.\n\nwhat the frickfrack is his problem. I am seeing a huge lack of respect. He should not want you to change how you look. omg. you offered a great compromise when you didnt even have to. \n\nHe thinks you are boring.  that youe Bjs are terrible... he told you to shut up when you were crying at his verbal abuse and then left for two god damn days?\n\n.. i think it might be time to deeply consider leaving... ",
            "in any kind of D/s relationship, aftercare is super important! If he refuses to give you even a little aftercare, he's an asshole. get the fuck out and find someone who is willing to have an even playing field with you outside the bedroom. (or inside as well, if that's what you think you need)\n\nenjoy your weekend with your parents and hopefully things will get better in the near future for you.",
            "Someone who wants you to change who you are is probably not someone you want to be with. What he's asking is completely unreasonable. You tried to compromise and he wasn't having. Maybe try counseling if you guys are up for it. ",
            "Your husband is an abuser and does not respect you. He sees you as an object. You already know this. You probably know what you need to do.",
            "Sounds like he wants you to be a teenage girl ",
            "My thoughts are with you, I saw your edit at the top there and I hope you gather your strength and leave him, you deserve so much better than this.",
            "I know you've had a million comments. I know you're out now, and taking some time apart. I just want to chime in, and give you some reinforcement:\n\nPlease, please get away from this man, and don't look back. He is showing you who he is: *believe what he is showing you.* He is showing you that he absolutely and completely does not respect you as a person, in any way. \n\nSo, I tend to be \"alternative\" looking too. I have sleeve tattoos, among others. I used to have all sorts of crazy-ass hair, and wear six-inch platform boots, and fishnets, and all sorts of hot-shit punked up outfits. However, I've toned it down quite a lot as I get older. (I'm 33 now; it's just a little too young for me now, so I've adapted my style.)\n\nI know my partner finds a lot of my old clothes hot, just from comments he's made here and there. But you know what? I can barely get him to give me an opinion on what I should do with my hair. \n\nYou know why? Because the answer is always, \"it's your hair. What do you like?\" I have to practically beg him for an honest opinion, which I do because I value what he thinks. \n\nBut he acts like that because he respects the shit out of me. He shows me that every day, in a million ways. He encourages the things I want to do for myself, like my ideas for future tattoo work; but he *never* pushes things on me that I don't want, ever. He respects my body, my mind, and my self. He treats me like an equal in all ways. \n\nThis is what love looks like. What your partner is doing, this unbelievably toxic blend of aggressive and passive-aggressive control, and unspeakably shitty statements and manipulative behaviour? That's abusive, and it will only get worse. *It WILL only get worse.* \n\nSomeday, you will look back on this and be so fucking glad you go out. You will have a partner you feel so incredibly safe with, who meets you on a level of true equals, and who would never in a million years fathom treating you the way this man is. \n\nThe sooner you get out, the sooner you can begin working towards the process of finding that. Good luck. But please, whatever you do, *do not go back to him,* no matter what he says or how much he apologizes. He will not change with you.",
            "I know I am coming to this late, but I just wanted to say:  you are an amazing, amazing wife.  I don't have to know you to know this.  I read the part about you going to this effort to play into his \"kink\" as far as some clip-ins, fishnets, etc., and saw this for what it was - an amazingly loving gesture.  It is all the more tragic when contrasted against the way your husband completely overlooks and is unmoved by how much you love him and how much you were willing to accommodate him.  We all should be so lucky to love and be loved to the extent that you loved him.\n\nOf course, as the story progressed, it became more disturbing.  I apologize because this is someone you have been with for some time in a serious relationship and love very much, but it was horrifying to read how much love you put into him and the callous verbal and emotional abuse you received in turn.\n\nMy concern in reading this story and one of the top comments of yours is your feeling like no one else would ever be interested.  When this is combined with the \"plain Jane\" comments, I get this feeling of his subtly undermining your self-esteem over time.  How little insight or depth of emotion he has, how little concern for you except in what you can do for him.\n\nYour situation makes me think about how much an asshole gains in life simply by not having a filter or enough social awareness to care how he treats others except to the extent it is self-serving, and how someone who may already be prone to insecurity may be willing to accommodate such a personality and mistake his pursuit for concern.\n\nThere is a girl I know who recently ended her first long-term relationship, she made a comment one day about having to come to terms with the fact that someone she cared about just didn't care about her in return.  Today she talked about how she will be alone because she is \"crazy\" and no one will want to be with her.  And yet, she is among the most amazing and kindest people I have ever met!  Just deeply insecure, made worse by the horrible relationship she found herself in.  \n\nI want to be cautious not to project too much, but I want to assure you that someone will be interested.  You are too loving of a person for that to not be the case.  Just be cautious, because there is a likelihood that the level of attention paid to you by these kinds of personalities as your husband will often push a button deep inside your brain that many others will not, a level of attention that feels like love but can be unhealthy if not kept in check.  Please be careful, and I hope I am not overly assumptive or condescending in these statements.",
            "Leave the fucker. There's \"friendly compromises\" and there's this.\n\nIf he gets off of you wearing edgy clothes, then you could perhaps do it for him sometimes, for a treat. That's \"a friendly compromise\" sort of, and you're completely entitled to ask something similar of him. Getting a genital-piercing is definitely not a \"friendly compromise\" and NOBODY has a say in that other than you. ",
            "Honey, I'm so sorry this guy ever found you. What he's doing to you is wrong on every level, and you don't deserve it. He doesn't deserve you. None of what he's doing is acceptable, and from the sounds of it, there were probably red flags early on that you might not have known to pick up on. That's still not your fault, it never was and never will be. You were looking for an honest relationship, and he abused that. That's on him. Over time he groomed you to accept his shit behavior, because he knew you weren't as experienced as someone a bit closer to his own age is more likely to be, and he thought he could get away with it. As much as it hurts to think about, it doesn't surprise me at all to hear this guy snarfed you up the way he did. This is unfortunately what predators like him do. Judging from his behavior, he's probably done this before.  \n\nSince he's cruel enough to give you the silent treatment, this is your way out. The guy he pretended to be when he found you doesn't exist, and he never has. I'm sorry. Usually guys like this don't start out terrible right out of the gate. They slam your boundaries and wear them down bit by bit, and before you know it, you're in a really unsafe situation. That's what happened here. Your feelings for him were real, and what you thought you had with him was real to you. Grieve those things, because even though this guy has been treating you so terribly, they're still losses in a sense. You've got a long road ahead of you in terms of healing from this, but it's doable. Talk with the people at www.thehotline.org, and www.rainn.org. Both are very helpful, and they've both got chat options in addition to the phone lines. \n\nLastly, keep us updated and stay safe. You deserve so much better than this. I've got your back, and I'm rooting for you! ",
            "Please divorce this child.",
            "You are just 3 holes to him, that's it. Show some self-respect and leave this whiny asshole. You can do better.\n\nEdit: Oh, and tell him to visit a golf course. Maybe he can find some new holes there.",
            "Get out of the relationship. It will only get worse.",
            "Wow, and I felt awful for asking my wife to try highlights. Please leave this clown shoe. Don't waste your 20s in this relationship. I didn't get married until I turned 30 and that seems to be the norm as of late, so you will definitely find someone a lot better. ",
            "100% abusive behaviour. Run as fast as you can, please. ",
            "okay, this might or might not be relevant, but just in case you like the wilder parts of the sex you have with him and are afraid you won't get that with a nicer guy:*\n\nmy person:\n\n* has a thing for me in stockings/tights\n\n* play-chokes me\n\n* slaps me around\n\n* tosses me around\n\n* bites hard enough to leave bruises.\n\n* dirty-talks in a way that would be super fucked-up if it was serious.\n\nmy person also:\n\n* cuddles and says sweet things during/after sex.\n\n* gives me head pretty much whenever.\n\n* is considerate and thoughtful in daily life.\n\n* cares about looking attractive to me, not just about what i'm wearing.\n\n* tries pretty much all of my sex ideas.\n\nmy partner *does not*:\n\n* throw a bitch fit when i go bare-legged in the summer.\n\n* scream when i don't want to do some sexual thing.\n\n* actually want to hurt me.\n\n* do passive-aggressive shit like leaving up porn of sex-things i don't like.\n\nof course there are things you like about your relationship with your husband. he's a fucked up nasty man, but he's not fucked up and nasty 24/7. and he's the person you learned about sex with, so it sounds like you probably have good associations with that. but you can find someone who has your husband's exciting qualities and isn't a nasty lysol-douche.\n\nand if you wouldn't really be into those sex things if your husband doesn't ask for them, you can also find a nice dude who has that in common with you.\n\n*which is a dynamic i've seen play out with friends trying to leave bad relationships\n\nedit: formatting",
            "Your body, your choice. Simple as that. If he can't see that it's time to get out. ",
            "What a horrible human being. ",
            "good luck",
            "Holy cow,  this is horrible.  Firstly,  I'm so sorry you're having to deal with this,  nobody deserves to be treated like that.  I know there have been a lot of other comments,  so I'll keep this short.  It's scary that he's this focused on degrading and controlling you,  and is willing to be so manipulative about it.  If you decide to leave him,  it would not be over an insignificant issue,  but over his refusal to respect you,  your agency and your limits.  That's totally unacceptable,  and I just cannot imagine trying to live with him and feel like you're never able to please him going forward.  It's your marriage, so if you decide you want to work it out far be it from me to criticize your choice,  but just please know that his behavior speaks to a very real lack of respect,  and you deserve better.  I hope somehow you find a way through this! ",
            "What a piece of shit.\n\nFind a real man.",
            "Your husband is abusive, it's absolutely terrible that he's emotionally blackmailing you. \n\n\"You should do this because you love me and I'm your husband\"\n\nIf my boyfriend did this to me then I would show him the door, it's not like you used to do these things, so I don't know why all of a sudden he is being that way.\n\nHe wants to use you to fulfill his sexual needs, he doesn't care about you as a person or his wife by the sounds of it.\n\nI don't even know you but you deserve alot better than this. \n\nAnyone deserves better than this.\n",
            "\". He said that he wants to use me and make me cry and see my makeup run down my face. He said that regular anal and PIV isn't enough anymore, and that my blowjobs are terrible because I don't want to deepthroat him or be facefucked. He kept going and going, shouting at me and turning bright red. I started crying because I was hurt and humiliated, and he told me to shut up.\"\n\nI'm sorry, but this is where I could no longer pick my jaw up off of the floor. \n\nThis man.. does not love you. He only sees you as a body to be used, degraded and thrown away. When he can't get his way, he throws a childish tantrum, gaslighting you to hell and back.  \n\nYou are not his toy. \n\nLet me say this again, you are NOT his toy. He has some sick power trip going and this is not okay! Please, leave and get help!",
            "As a guy i am out ragged someone who act this way to their partner. It is wrong what he did and the way he treats sex. Sex isnt some hardcore fuck fest where someone gets used, but something both parties enjoy.\n\nThe fact he is blowing up shows he has a warped idea about it and has some fetish issues that drive him. You need to lay down the law, either you go see a councillor and seek help or this ends. You dont want a pattern to evolve as it will get worse. Its not even like he acts like a child but that he has emotional maturity with sex of someone who shouldnt be having it.  Even for yourself talking to a professional would be good to learn how to deal with this type of person and stronger about yourself.\n\nI hope it gets better for you. ",
            "Oh my gosh. Please, this isn't healthy. Get away from him until he seriously grows up or has a life altering event. He sounds so creepy. He treats you like a blow up doll. If it were me I wouldn't go back. I'm so sorry. ",
            "... Wow he really wants have his cake and eat it too.  God forbid there be one thing you can't do.  Even then you are willing to dress up in the bedroom anyway.  Selfish much?  Anyway have a real conversation about this and his behavior.",
            "Your husband was getting more sex (and a whole lot more variety) in a week than I ever got in a month. If he can't accept you the way you are maybe it's time to move on. ",
            "You would not be leaving over a clit piercing. You'd be leaving because he is an abusive piece of shit. \nHe has no right to control how you look or what to do with your body.  Dump him and leave ",
            "He's got a problem with porn he has to deal with. (now that it's negatively affected personal life/marriage)",
            "There is a very large number of men who would be so happy to have a woman  who is willing to dress up for them in bed, do anal a few times a week, and piv almost every day.",
            "First of all, you should NOT get you clit pierced, it's literally a bundle of nerves that can be seriously damaged by a piercing. If you were interested in genital piercings there are other safer options. But since you aren't even interested I won't berate you. \n\nSecondly, what a petty dickwad. Leave him. Leaving up porn? The silent treatment? Complain about your sex life even though you clearly went to great lengths for compromise? No. No fucking way.",
            "> it seems silly to leave him over something as insignificant as a clit piercing.\n\n... And not liking how you look, and wanting you to change who you are, and thinking your boring, and not caring if you'll be able to go to work if you do as he says, and not doing the things that you want too try during sex or that will make you happy, and treating you like a sex object, and making you cry, and not caring about how you feel... Should I go on?\n\nAlso, is he \"edgy\"? Something tells me no.",
            "Yes, you leave. You get your things in order quickly and quietly, and then you get some friends or family to come help you gtfo. ",
            "Sounds like your hubby might have a porn problem... How much does he watch? Does he realize it is not reality? Anal twice a week and he's bitching??? I have sex with my wife like twice a month.... He's way out of line and out of touch on this one. ",
            "You would be leaving him cos he's an abusive shitbag, not over the piercing issue.  \nI would be scared how worse he could get!",
            "Your 6th paragraph horrified me.  The whole thing, outlined in graphic detail a man who wants you to be a walking, talking fetish that he can use and play with, not to mention, in his own words abuse.\n\nYou are a person, your physical appearance is only some of what makes you who you are, I'm frightened and angry for you. My sister was in a similar situation, she found out her (now ex) boyfriend was sending sexual messages to other girls on facebook and on Christmas eve last year after several fights she found out it had been going on again and she asked him \"when is this going to stop?\" And without missing a beat he responded \"it's not going to stop until you lose weight.\"\n\nYou do not change to please ANYONE other than yourself, because if you do it was done for all the wrong reasons.\n\nEdit: a word",
            "Wtf? Ow. No, maybe he should get a dick piercing. ",
            "Omg this guy sounds like he has a weird 50 shades of grey fetish and is using you to live it out. ",
            "Sounds like he watches too much porn. ",
            "Tell him you'll get the piercings,  \n\nBut first he has to get a 'Prince Albert' ",
            "Lawyer up and leave this man. These kind of demands scream immaturity and are borderline psychotic. Especially the passive aggressive use of porn. I would advise you that you will be happier outside this marriage. ",
            "Look, I don't know how to say this but I'll give it my best shot. He doesn't deserve you, to put it in frank terms. You sound like an awesome woman and I bet you can find someone who loves you and doesn't think about you as his property. Hes a down right fuckhead for treating you like that and he was lucky to have a women like you in his life, and then he actd the way he did.  when you leave he'll never get another like it because he doesn't deserve one. You deserve more though, more than him. Find a guy that you love and that loves you. ",
            "I was once in a long term relationship with someone who desperately wanted me to get a genital piercing. I had almost no self confidence at the time, but I *really* didn't want to do it. I'd gotten a piercing on the upper part of my ear once, and the damn thing never healed properly, so I wasn't really thrilled about the idea of going through a similar situation in a much more sensitive area. \n\nHe said a lot of really horrible things to me and made sure I knew how much he loved porn with genital piercings. Somehow, I never gave in. \n\nThat relationship didn't last forever. I am very happy that I didn't make an alteration to my body that I didn't want. That would have been with me forever, and I'd probably be regretting it every time I went to the bathroom, took a shower, put in a tampon, etc.\n\nThe only reason you should ever get a tattoo, piercing, or other body modification is because *you* want it. It's permanent. You're the one who has to deal with the bad parts, like itching and potential infections, etc. \n\nIf you still want to stay with this guy (and I don't recommend it, based on the lack of respect he's shown you) I would recommend looking into non-permanent jewelry you can wear in your genital area. Such things definitely exist! ",
            "Oh my god, you poor girl. I'm so sorry to hear this. I'm afraid he just sees you as a sex object for his pleasure and not a person. To actually say all that, for him to believe all that.....God, you deserve better. You're a person not a hood ornament for his dick. ",
            "Your husband's abusive. Him leaving for days reminded me starkly of my dad who would flip out and do the same.",
            "Leave him. Sorry, would write more, but very tired. Good luck! Stay safe! Be careful! He comes across like he might be a bit unstable, and a court order alone won't protect you. Keep that in mind should you choose to separate and divorce.",
            "First off, if you're an adult that wants to be taken seriously, putting bright random colors in your hair is not the answer. \n\nSecondly, your husband sounds awful. ",
            "I usually get annoyed with this sub, and how everyone's reaction to every situation is \"BREAK UP!\", but dear god, dump this ass.  \n\nThere will be plenty of men who like who you actually are and not who you once were.",
            "That is not how a husband behaves. He is a spoiled child, and abusive. For your sanity and safety leave him. ",
            "Basis of personal freedom: If you're not okay with it, then it's not okay (for you). Your husband does not accept you for you. He refused to compromise when you tried to, and he doesn't try to understand that you've chosen to be and present yourself as a professional. \n\n> I'm willing to try almost anything once.\n\nThat's incredibly big of you to try things outside your comfort zone. However, when you say no, then that's it. He seems like a giant man-child who's letting his fantasies intrude into his real life.\n\nDo yourself a favor: get out now while the getting's good. You're already a professional with a career in front of you. You can make it on your own, go meet new people and make new friends who will value you for yourself. I assure you it'll be more fun than hanging around this idiot.",
            "Let him know you've always been interested in men with Prince Alberts. ",
            "What an asshole! OP, let him have his tantrum. He'll get over it. He didn't discuss this fetish before y'all got married??",
            "[deleted]",
            "Did all of this come right out of the blue? I'm having trouble imagining such randomly abusive behaviour in a person with whom you had previously had a healthy and respectful relationship only.",
            "He sounds like a porn addict.  What he's doing is cruel.",
            "Mother fucker gets laid 7+ times a week with usually 2-3 times being anal And blowjobs and the ass is complaining it's not enough? Jesus Christ. I'm siting here in once a month if I'm lucky land and I could only dream of what he has",
            "You got married to a immature ass-hat. \nRed flags all over your post. He has zero respect for you, New careful if he starts trying to cut friends and family contact from you.",
            "He was furious and left for 2 days without contact and then moved to the spare room. I think there is a good chance he had sex with someone. If you do reconcile (which I think would be a mistake long term) don't have unprotected sex with him until you've both been tested for STDS.",
            "I really don't wann to know what or who he did in this two days he was gone. ",
            "Please, OP, give us some update when you've reached your parents'. \n\nI really hope things are going to get better soon for you, but for Pete's sake, don't let this sorry, shameful, pathetic excuse of a husband back into your life. \n\nThat guy is a total disgrace, and, as someone being in the D/s lifestyle, I can faithfully assert that guy's mentality and behavior are everything a healthy D/s relationship **DOES NOT** represent.\n\n**I'm not the kind to preach divorce, but he totally deserves one. As well as a high-five. In the head. With a cricket bat.**\n\nGet the hell away from this asshole, rebuild yourself, take care of yourself, pamper yourself. \n\nYou are a beautiful person inside and out, and you definitely, *definitely,* **definitely** deserve someone who will treat you with love and respect.",
            "Get out of there now before kids or something gives you any reason to consider staying. You deserve better. ",
            "Jesus christ could he respect you any less? You deserve better than that, you're a person with feelings and emotions, not a hunk of meat with a hole in it. Seriously, fuck wasting your time on him. ",
            "Pornography has warped him.",
            "He sounds immature!  Doesn't mean that he's hopeless.  However if your hairstyle, looking edgier, getting piercings continues to be a big issue then he may view you more as an object of his affection more than as a person.  If that's the case for then more issues will come up.  I'd talk to him, make it clear that he needs to try harder to respect you as a person.",
            "Run. I was in a similar situation, and I can honestly say I've done things to make my ex-husband happy, things I wasn't comfortable with. He made me feel like utter shit when I would say no, and my ass stayed with him cause I thought he will get over it, that he'll change. I was with him for almost 8 years, and woke up one day not recognizing the person I've become. It took another year after we separated and a lot of fighting the urge to go back to finally say I am done and have not communicated with him since. It caused me a lot of stress and trauma that I wouldn't want anybody, not even my worse enemy, to go through. Don't be like me. He doesn't respect you and if you stay, it will get worse. You deserve someone who will respect you and make you comfortable in your own skin. ",
            "Even if, IF, you agreed to his kinks it sounds like he would be the most selfish asshole partner on the planet. Respect and caring is still a huge part of those types of sexual relationships if they are healthy. You think a guy can just facefuck his wife if she doesn't like it? No. Either she enjoys it as well or he is an abusive asshole. And! Even if she does enjoy it the guy would be totally fine with stopping or not doing it at all of his WIFE said no!\n\nI would file for divorce ASAP and just totally go no contact. What kind of a tool believes he has the right to demand all this from his wife after not really putting it all out there early on in the relationship. And even then, to demand...\n\nYou are sexually incompatible. You are emotionally incompatible. Move on.",
            "Obviously you've gotten all the advice you need but it kind of concerns me that you say you are uncomfortable with anyone else seeing or touching your vaginal area. Have you ever been to the gyno? Clearly that's different, but I sincerely hope you are taking care of your health. ",
            "I am so sorry you were treated like this. A man that truly loves you will not say or do any of the above. There are arguments, disagreements, etc, but what he said to you is beyond that.  You mention being willing to try anything he wants, but what about your needs? Based upon what you've said here, your marriage is all about him.  You are young and will find someone else.  Good luck to you. ",
            "Wow.  Reading that just got worse and worse. You are allowing him to violate the sanctity of your body and treat you as a sexual object.  You have no say at all, you are his doll so he sees no reason to value your opinion.\n\n Notice how your needs and desires are never a consideration for him?  No one with respect for you as a person would assume that you should pierce yourself for them \"because it would make them happy\". I think that's a very abnormal thing to ask of a SO.. You even compromised and he still blew up at you?! There are so many things wrong here, all I can say is thank god you found out sooner rather than later.",
            "the stuff he sees happening in porn has a very negative psychological impact when it's not 100% accepted from the other party. he does not realize that porn =/= real life and that his wife is not an object. ",
            "your husband is an idiot. GTFO.",
            "Run far, run fast. He has made it abundantly clear that he has no interest in being your partner - he wants you to be his plaything and toy, a thing he owns. He clearly has no respect for you, your needs, your desires, or even your own personhood. It's only going to get worse. I'm really sorry you're in this situation, because it sounds like you are more than accommodating for his desires and wants. ",
            "Sorry to hear what you've been going through. I know you have many responses, and you won't have time to get back to them all.\n\nYour husband has certain expectations of you, and whether or not they are reasonable (most people agree, they aren't), he still hasn't treated you with respect by asking and communicating in a loving way with you. There has been no mature attempt at compromise on his behalf, only on yours. He has acted like a child in a huff and stalked off and slept on the lounge in an attempt to emotionally blackmail you into doing what he wants. Going on his past actions, if he fails to manipulate you, he will eventually give up on you altogether.\n\nI'm so sorry he is being like that. It sounds like he was a spoiled child (only child maybe?) who always got his way. He hasn't grown past it. He doesn't respect you as a person, and it sounds like his primary fantasy life is involved with porn which he is now trying to live out in you. \n\nYou deserve better, and I hope he either realises it and changes, or that you find better. Leaving someone is very difficult, and I don't envy your time ahead, but stay strong. You are an equal partner in this marriage, and deserve an equal say, respect, and to be heard. If you don't get those things, then he isn't even willing to work on the marriage, and when one gives up, its over.\n\nMy thoughts are with you, hope it works out.",
            "Saw your update. I can't imagine everything you must be feeling and sorting through. Only tiny bit of wisdom I have: The way you feel about all of this right now, all the pain, probably isn't how you will feel about this mess a week from now or a year from now.\n\nKnow that a creepy internet strangers wishes you well. ",
            "Sounds like going home to your parents for a bit is an excellent idea. You've come to know some important things about your \"husband\" while you're both still young; that's a good thing. Now you can plan a happy future for yourself.\n\nI have all kinds of things to say about that man you married, but I see much of Reddit has said it already. ",
            "dump him, he's a loser",
            "I think your husband has had his view of relationships shaped by unrealistic expectations.  Specifically, I'd be curious to know how much porn he watches.  I'm guessing he watches a lot.  His view is unhealthy and it seems that he doesn't value you as an individual; he seems to value the utility that you can provide him with.  That is far more perverse than anything that can be done in bed.  Consider getting some space and trying to evaluate your relationship from a bit of emotional distance.  Don't do anything rash, but definitely take the time to be completely honest with yourself about what your relationship truly is.  Good luck.",
            "Your husband is an idiot and a douchebag, and you deserve someone who respects you.\n\nHow the fuck can someone who \"loves\" someone else be so heartless?",
            "Your husband is a childish little shit. From what I've read, your whole marriage and life together revolves around him and his wants and needs. Where do *you* come in? Frankly, it's as if he doesn't even view you as a person. \nI'm much like you; I used to dress in an edgier style and have since grown up and developed a more modest and conservative style. Its called growing up. Very rarely do we land in jobs that let us retain the style we liked as teenagers/young adults. I'm lucky I work in a place that doesn't care about my pink hair. \nMy husband is awesome, but my long term relationship before him was controlling and abusive. He wanted me to be *his* picture of the perfect girlfriend and didn't give two shits about how I felt. I played into it too long and lost a lot of me that, five years later, I'm still trying to get back. Eventually he became emotionally, mentally, and at times, physically abusive. \nDon't let this happen to you. You are your own person and your partner in life should love and respect you for all that makes you uniquely you. \nYou have done nothing wrong and have gone out of your way to make your husband happy, but people like him will *never* be happy because what they want, what they have designed and built hp in their minds, doesn't exist. He wants a sex doll, not a person, not a partner, not someone to share a life with. You are better than that and deserve better than that. \n\n",
            "Is this really the first you've noticed of this kind of behavior?\n\nThis is a pretty big jump, from being kinda selfish to asking you to pierce your clit and say you're boring for not being facefucked.\n\nThere are all kinds of kinks in the world, including everything he's talked about.\n\nThe problem is, you don't demand kinks on other people. You work them out with yourself, talk, experiment after communicating, test the water, explore, talk, compromise (meaning both parties, not one of the two compromising and the other getting everything they want).\n\nHe seems to have suddenly fallen into some kind of an extreme porn trap, and become obsessed. There seems to be a lot going on beneath the surface.",
            "I'm not gonna tell u what to do. In my opinion based on what u have written...u r a great woman, I wish I was that lucky and u should do what makes u feel right",
            "This sounds like more than \"just\" a kink for him, maybe this was his \"dirty secret\"/fetish that he just opened up to you and then he felt humiliated and rejected.. HOWEVER! His reaction seems super immature and he sort of sounds like a spoiled brat not getting what he wants, and you probably can't fix that. What you can do is tell him what you told us: \"I want to make you happy, and try to work around MY limits to make YOU happy.\" And then as an example, ask him what other piercings  (that you wouldn't mind getting) would turn him on instead of a  clit piercing, what sort of sex things you could both be happy about. In a way, you might need to 'force' him to compromise to ensure that his fetish is fulfilled, and that you are still happy and satisfied as well! ",
            "Goddamnit /r/relationships.  \n\nGet divorced is your advice every. Single. Time.\n\nTell him it's not up to him, and to drop it. Make it clear that you're uncomfortable with this and you want him to let it go, it's not going to happen. He will",
            "Some people don't have this kind of behaviour in them, some do and the people that do you really don't want to be around when it comes out.\n\nIf the reasons why you are outweigh why you shouldn't be, great but spoiler: they can't. ",
            "[removed]",
            "LOL you think this is little?",
            "[deleted]",
            "I think you guys need some couples therapy. I don't know if /r/relationships really has the caliber of advice necessary to unravel this ",
            "This sounds like something I could imagine where I live in Oregon. ",
            "[deleted]",
            "Split up in my opinion, because you guys don't know how to love each other.\n\n\n\nIf you want to love each other instead, then put each other first. \n\n\n\n\nShouldn't marry someone you wouldn't want to change your clothing for. Shouldn't marry someone you want to change the clothing of. \n\n\n\n",
            "Maybe try couples counseling?",
            "I personally think you'd be silly to leave over this. Honestly. \nI think that he was wrong for going off on you. But I think that you needed to talk to him. Try to understand what's going on. Most people don't just go off like that without a reason. Just my two cents."
        ]
    }
]