[
    {
        "post_id": "4ec1py",
        "author": "worriedneighbor5",
        "title": "My [28/f] fiancé [31/m] ex girlfriend [30s] moved in across the street. She's trying to make her presence known by doing weird things and we're both sick of it.",
        "url": "https://www.reddit.com/r/relationships/comments/4ec1py/my_28f_fiancé_31m_ex_girlfriend_30s_moved_in/",
        "score": 2423,
        "num_comments": 437,
        "created_utc": 1460399482.0,
        "selftext": "So, I’m not sure if this is cause for concern or I’m paranoid so maybe all of you can figure this out for me…\n \n \nBackstory:\n \nMy fiancé, James, and I have been together for 3 years- planning a wedding for October 2016. A few months before we met, James brought a brand new home in a newer subdivision. We recently refinanced it and added my name.\n \nBefore me, James dated a woman, Britt, for about 7 months (she’s never been to this current house). From what he’s told me, they broke up when he decided they weren’t as compatible. The breakup was rough- to the point where he and neighbors called the police when she wouldn’t leave his front yard and was screaming at 10 pm at night. This is all from what he and his sister have told me. I don’t have a reason to not believe them. I’ve only had a few run-ins with Britt. These have been at restaurants or just coincidences out in public. We never spoke up until now.\n \nThe problem:\n \nBritt has bought a house in the same subdivision that we live in. We even share a cul-de-sac. The only reason we found out about this is from a flyer we got welcoming her to the neighborhood (our subdivision is very “community” oriented). James insists he’s never told her where he lives and hasn’t spoken to her since the night he called the police.  We both brushed it off as a coincidence but lately it’s becoming very weird.\n \nHere’s why:\n \n-I work for a company that allows me to work from home 3 out of the 5 days. Our home is a ranch and my office window faces the street. I’m not sure what Britt does for a living but she does not work during the day. From about noon until 3, she spends her time walking up and down our street. When she passes our house, she doesn’t take her eyes off of it. It’s almost like she can see me in the office. She’ll even stop in front of our house and stretch there for about 5 minutes. Every day anyone is at home. It makes me uncomfortable to the point where I have all of our blinds closed during the day. I understand the need for exercise but she walks for 3 hours just going up and down our street.\n \n-Another issue is when either James or I are outside with the dog, she’ll let her dog outside and it will come sprinting to our yard. This causes her to come and get her dog. Every time she says “I’m sorry, were still working on training.” James and I are always polite. Normally, I would be ok with this but James has pointed out that any other time she lets her dog out and we’re not outside, she’ll immediately correct him before he runs off. She never corrects him when we’re outside.\n \n-We’ve been getting “ding dong ditched” a lot since she’s moved in. Something that’s NEVER happened in the 4 years that James owned the house. The doorbell will ring around dinner time (between 6 and 8) and by the time anyone gets to the door, no one will be there. It’s gotten to the point where our Doberman has picked up the routine and waits by the front door, pacing.  \n \n-The last issue, which I believe might be illegal, is that our mail seems to go missing for a while and then pop back up. What I mean is, Britt will knock on our door and say that she received our mail and is just returning it. This has NEVER happened with the previous owners in her house. We don’t have a new mail carrier either. It seems to happen once a week and she’ll always bring it on a Friday night. Based on the date on the envelopes, we can tell she’s been holding it all week. This has pushed James over the edge because she had our water bill which resulted in us being 2 days late on the payment (James is neurotic when it comes to paying bills). Every time I have to convince him not to go over and yell at her because we haven’t actually caught her taking it out of our mailbox as much as I try to monitor it. She usually gets two days-worth of mail because those are the days I’m not working from home, the other days I get it right away.\n \nI’m not sure what to do at this point.  I don’t want to piss her off by confronting her but how can I get her to stop? She’s making us nervous and I feel uncomfortable in my own yard most of the time because I know she is watching.\n \nAny advice? I know this sounds strange but I’m not sure if I can legally do anything about it. I don’t have anything against her; it’s just becoming an annoyance.\n\n\n\n   \n**tl;dr**: My fiancés ex girlfriend recently moved in across the street. Weird things have been happening- being ding dog ditched, having our mail taken, etc. We're not sure what to do or how to approach the situation. ",
        "permalink": "/r/relationships/comments/4ec1py/my_28f_fiancé_31m_ex_girlfriend_30s_moved_in/",
        "comments": [
            "SECURITY CAMERAS catch her stealing your mail. That's a federal offense- and based on their past very likely enough for him to get a restraining order and get her kicked out of her house. Do it. ",
            "Document everything; times, locations, actions. \n\nFor the letters, get some sort of secure mailbox that can't be opened without a key. \n\nAnd for the love of god keep an eye on your dog when you take it for a walk, especially if it tried to eat something off the ground. Who knows what sort of crazy is going on inside her head. ",
            "I would not confront her directly or say anything to her. If I were going to confront her I would do so with the police, and evidence. About the mail, I WOULD CALL THE POST OFFICE, and ask to speak with the mailman of your area, or ask if it's possible that all of the sudden he/she is delivering it to the wrong place. You could also just say, \"we believe a neighbor is taking our mail, but are unsure,\" can you pay extra close attention to the mail you deliver to our house and her's and make sure there is no mistake, so we can find out if this is true or not?\" \n\nYou should also hang out right inside your doorway one night and wait for the doorbell to ring. I think it would be worth it to see the look and panic on her face (if it's her).\n\nIn all seriousness though, I would call the police and tell them everything you've said here. I would make it clear that you aren't positive, but ever since she has moved in weird things have been happening, and she has been acting strangely. At the very least, this would allow them to have some sort of idea already what is going on, and what you suspect, just in case anything further happens. Definitely try to get camera installed...I'm sure whoever installs them would understand and try to be discreet/make it look like he/she is fixing something else.\n\nI guess I would confront her about the dog, and tell her she needs to keep her mangy mutt off of your property or you are going to call the authorities (i'm assuming you have leash laws).",
            "**Security cameras**, a locking mailbox that you can stick mail into but need a key to get it out of. Also tell her, in no uncertain terms, that if her dog keeps getting into your yard then you will call animal control and have them come out and talk to her every single time it happens. ",
            "Hah, you should buy a \"For Sale By Owner\" sign and put it in your front yard just to watch the inevitable freak out she has over it.",
            "Install security cameras all around your house immediately. Call animal control on her for having her dog loose. Document document document. I guarantee you she will escalate this further if you don't stop it now. She's crazy and obsessed. ",
            "Even if James never told her where his house was should could have found out through public records.\n\nI suggest some kind of security camera. The police might not do anything about the doorbell ringing but the postal service might be very interested that she's taking your mail. ",
            "/r/legaladvice \n\nI'm not an attorney or an expert by any means, but if I was in your shoes I\"d be looking into talking to attorneys or talking to police and trying to get a restraining order.  At this point, I feel like having an officer stop by and asking her if she's messing with you guys/touching your mail might be enough.\n\nAlso, you can get relatively cheap camera systems online.  I would put some cameras around the outside of your house.  Stealing mail is a really bad thing, she might end up getting some sort of personal info from it.",
            "I'm not sure why you think cameras are a bad idea. They are easy to install. You could even just put one in a window if you don't want to install outside.\n\nYou could also try putting a fake letter in the mailbox and see if she ends up with it.",
            "CCTV cameras. Apart from the stretching, the rest should be reported to the police as harassment. If you are in the US, isn't stealing people's mail is a federal office?",
            "I'd say it's time to call the non-emergency police line for your neighborhood, talk to someone there, and make a report about her behavior.  First, because the mail thing **is** illegal if she's taking it out of your box, and second, because you need to get ahead of this thing before she goes full-on crazy stalker lady.  Just for fun, and to make her insane, could you buy one of those mailboxes that locks and just has a slot for the mailman to drop your stuff?  There is no way that her moving in there and all the weird things suddenly happening are not connected.  I know they're minor things now, but they could easily get worse.  \n",
            "Firstly, you're not being paranoid. I'm willing to bet that your fiancé's ex moving to your neighbourhood was no coincidence, given how she reacted to their break-up. Her behaviour is seriously alarming and I'm convinced this \"annoyance\" will escalate into something more serious if you don't act now.\n\nSo yeah, definitely invest in security cameras for the doorbell/post stealing issues and if you can, take pictures of her while she's stood outside your house. Any evidence you can gather of her crazy behaviour will help when you take it to the police.",
            "It is not hard to find out if someone bought a house and where it is. I'm sure she just did that to find you guys.\n\nYou should report her dog being loose to animal control and the police. That's not ok.\n\nYou should call the post office and let them know you think this person is tampering with your mail. I'm not sure what they can do, but talk to them. If you have proof via cameras, they should know how to deal with it, because it is a crime. In the meantime, make as many bills as possible delivered electronically so you aren't dependent on the mail.  \n\nYou should install cameras like others are saying. Depending on what you see, you may want to show the police. \n\nYou should consider putting up a fence, if your dog is out and hers gets out, you can just ignore it and leave your dog in the fenced area.\n\nI'd talk to the police anyway. See what they need in terms of \"evidence\" of stalking and what your options are. \n\nShe's clearly nuts. A visit from the police might help. ",
            "It seems to take some time for you to realize your fiance's ex is full on stalking him, and has been for years. Please also realize that it's incredibly, incredibly easy to install cameras so that Brit can't see them (example: hidden cameras in regular objects, camera looking from your window to the mailbox, obscured place that has a good look there - James can easily distract her for minutes while you place it if you're unsure as to where she is/whether she's watching.)\n\nThis is all serious stuff (especially the mail - please understand it's not a minor offense or inconvenience, it's a very serious crime that needs to be reported!). If Brit wants to escalate, she'll escalate. Doesn't matter if you do something to \"cause\" it or not. Hey, she escalated to moving next to you, didn't she? You didn't do anything to cause that one, did ya.",
            "If the dog has picked up on the doorbell pattern then what's the harm in waiting by the door one night ready to open it as soon as you hear someone approaching? What's she going to say when you literally catch her in the act? Have cameras already installed before this happens. I mean ready to open the door before her finger leaves the button. If she's that fast she should be trying to leave as soon as the door opens. If you catch her just once maybe it will stop. The reason why the cameras are important here are so you can then leave a screen shot of herself in her mailbox telling her to stay off of your property or you will get the police involved. \n\nWhat about having sprinklers installed right at the edge of your property so if she feels like standing in your yard/drive and stretching for ten minutes go flip the switch and gently hose the bitch down. If she still stands there or continually comes back continue turning them on.  You aren't out there engaging her - it could be a timer. She doesn't know that. Hopefully the cameras catch her trespassing too in addition to the mail theft and harassment. \n\nAfter documenting all of these things get a restraining order, go after her for mail theft. Use the courts to make this nuisance disappear before she escalates.\n\nYes most people say don't engage with crazy- but how long do you want to live this way? Where your dog has anxiety over this idiot ringing the bell and coming into his safe space. Where your evenings are filled with stress and constantly interrupted. Where you can't look out the window without seeing her marching up and down your street or creeping in your yard/driveway. You can't even be in your yard in YOUR house without her stopping by with your mail or letting her dog loose on you \"by accident\". \n\nDo something or get used to living like this. If you uproot yourselves to get away she will too. ",
            "Security cameras. Lockable mailbox. ASAP. Or get all mail from the post office. Yikes, this is scary!",
            "Former mail carrier here. So illegal! Call the postal inspectors (you can look up online or call your local PO and they will give you the number.) They will send inspectors out (you won't know when and they usually watched like a P.I., so she won't be aware either) and watch to see who's taking the mail. It's a federal expense, up to 5 years In jail and a fine. It's a felony, big NO NO. They don't take mail theft as a joke. ",
            "Do you know your neighbors well? I swear, when i was growing up, we had a man in our neighborhood who was pretty much ALWAYS watching if you gave him the hint of something strange going on. Even if you don't have a snoopy neighbor. You should ask if your neighbors have been getting the wrong mail or your mail at all. Or next time you see your mail person, ask them about it.",
            "My ex used to steal my mail\n I got a security mailbox.  The mail goes in but you can't get it without using a key.  It actually hold a week or more worth of mail so it's great when you're gone for a few days.",
            "Set up security cameras DISCRETELY:  you want to catch Crazy Ex in the act of stealing your mail and **have her arrested.**\n\nTo that end, don't set up a P.O. box or a locked mailbox just yet:  to repeat, you want her **arrested, and ideally, cooling her heels in jail for awhile.**\n\nYou want irrefutable proof of the mail stealing AND the harassment (doorbell ringing) so you want DISCRETE surveillance right now.\n\nAnd yeah, talk to the post office and the police.  Document everything.  Maybe talk to a lawyer about how best to cover your backside if she starts making accusations against either of you???",
            "This reads like a scene from Desperate Housewives.",
            "Mail stealing is a federal crime.\n\nPost outside cameras, to cover the house pacing, with 5 minute stretching, for 3 hours on so many days, to cover the dog running over, her ringing the doorbell, and especially the mail stealing. You realize she is opening the mail, right?\n\nOnce you have video, go to the police.",
            "Get an outdoor security camera and set it up to monitor and record your front door, or wherever your mailbox is. If it is Britt taking your mail, call the police. Mail theft is illegal. Also, begin documenting Britt's strange behavior. Everything you listed is 100% cause for concern, at the very least, and taking steps to increase your home security would definitely be in order. ",
            "Besides the cameras, I would start doing monthly credit checks. She can ruin your credit really easily with a few credit card applications. I bet she already has your private info. Next get the USPS Inspectors involved. They will install a camera too. Also make a police report now, explaining the situation. Log everything and record anything you can. Once you start rejecting her, she might go into vindictive bitch mode. You will need every piece of information to protect you and you other half. \nI also recommend in indoor cameras. She maybe breaking into your place and you don't even know it. ",
            "As a police officer the best advice is to get a security camera system, sentry 369 has the best products on the market.  Collect proof and file a report with the police, then continue to do that every month until all that stuff ends!",
            "Keep a very close eye on your dog!  It sounds like you have a bunny boiler on your hands, and poisoning dogs in their own yards is an unfortunately common thing when it comes to psycho neighbours.  Make sure there isn't anything suspicious that he could eat in the yard when you let him out! ",
            "Put a tent/cover/sheet up over the front of your home/doorway like you're having it bug bombed, use the cover to install security cameras. Hell, you might even be able to get a sympathetic pest control company to help with cover for a small fee. Play it off, take your time hiding the cameras well, and catch her. (The idea only came up because our old neighbors had their place fumed and commented that it wasn't as expensive as it looked - and I get the sinking feeling that she is watching you guys far more often than you realize, and that you can't rely on just sneaking out there and getting them installed when she \"isn't looking.\" This could solve your problem if there's someone in your area willing to throw cover over part of your home for a few hours for a reduced fee and you're willing to do it.) Or maybe you could even put something large in the way to obstruct her view for a few hours. A moving truck, to throw her off? :P",
            "I know people have already suggested security cameras (which is great) but I'd also recommend motion sensing lights. That might help knock out the ding dong ditch crap at least.\nDocument everything!",
            "Yep, a camera.\n\nGot $200? Go buy a Ring video doorbell. Anytime someone rings the door or even walks by, you get a notification on your iPhone or Samsung.",
            "What about Ring, the video doorbell? You can see 24/7 who is at your door and what they're doing.",
            "Get a locking mailbox asap, also maybe put cameras inside the house pointing out the windows so she doesn't see you installing them?",
            "You can get this cool doorbell that will take a picture and send it you any time someone rings the doorbell. I would get one of those.\n\nAlso, consider getting a locking mailbox or a camera for the mailbox. Your letter carrier, however, may be able to help you prove that they put the mail in the mailbox. What she is doing is a federal crime.",
            ">The last issue, which I believe might be illegal, is that our mail seems to go missing for a while and then pop back up.\n\nThis is your trump card. Go to the post office and say that you believe your mail is being stolen out of your mailbox. They do **not** fuck around with that. And you're very right that it's extremely illegal",
            "1.  Security cameras.  Gather evidence\n\n2.  Report to USPS and police\n\n3.  Restraining order",
            "She's not just trying to \"make her presence known.\" She's stalking you. Both of you. Not okay. \n\nWould your work let you switch the days you are home one week? Maybe try staying home a different day than usual and getting a video of her stealing your mail on your phone. Or just get a cheap surveillance camera and set it up in the corner of one window. There's gotta be a way you can hide it from her. Could you put one inside a bird feeder or something? I don't know how they work, just trying to suggest something new. You need some evidence quick. ",
            "Time to set up some surveillance cameras and documenting incidents. Once you get enough stuff go start a file with your local police department.",
            "This can all be solved with a security camera. Just make sure it's not too visible. If you catch her stealing your mail, she's toast. That's a federal crime. She's being pretty brazen about it, coming right up to you every Friday and giving you mail that's been missing for a week. ",
            "You mentioned that your neighborhood is very community-minded. Is there some sort of central committee or something? If there's some sort of higher-up in the neighborhood, I'd go to them. Maybe you could get the crazy bitch kicked out of the neighborhood before you have to go to the cops.",
            "To prove she's taking mail from your box without using cameras you could have some kind of UV glow substance that you can smear inside your mail box. When she hands your mail back if it has the glowing UV stuff then it came from inside your mail box.\nDiscuss with the mail police type(there must be some postal authority you can contact, or just the police) people you're doing this so they can act if it comes off as proof.\n\nedit: searching for 'Invisible Thief Trap Grease' should bring up the stuff",
            "Holy psycho! Probably no coincidence she found that house on your street. Homeownership is public record in many counties/townships. Have the cameras installed high enough that they can't be hit with a 2x4 (personal experience of mine). \n\nThere's so much great advice here, document the loose dog with animal control & they might issue a citation. Look into filing a report with your local police to document the harassment. If you can't catch her messing with your mail, you might be able to catch her ding-dong-ditching (seriously? wtf is her deal). If you have that on video, you could get the courts to issue a trespass against her & if she violates it she'll go straight to jail. Your poor dog must be going crazy. \n\nBe careful, OP! ",
            ">These have been at restaurants or just coincidences out in public.\n\ntrust me, these were not coincidences. \n\nYou need to start gather evidence to get a restraining order (or worse). Her behavior will escalate if you don't.  Don't confront her--this will just fuel her fire. Remember, what she wants is to interact with you and anything you do/say to her she'll find ways to blame you for or use against you. \n\nCameras are a good first step.",
            "Put a camera on the mailbox and catch her red handed.  Pretty sure stealing mail is illegal.\n\n",
            "Have security escalated, install security cameras in front and backyard and anywhere around your house. Cut off any social interaction between your family and her, ignore her existence and move on with your life. If the nuisance continued or escalated it would finally lead to a unavoidable confrontation (which may involve of the police) which also means hopefully will lead to an end, otherwise she'll lose interest doing these sooner or later without getting any response from you two.",
            "I bet she has been stalking your fiancé for years. All those coincidental meetings were probably just the times she let you know she was there. How long was the house she lives in listed for sale? Have other houses in your cul-de-sac been sold since you moved in? You need to consider the possibility that she has been watching you both closely for years. You've already gotten great advice but I think you're underestimating just how obsessed and dangerous this woman is. I would take steps yesterday to document and protect yourselves. ",
            "This is a crazy person I'd LOVE to read an update on, op. ",
            "I know you're already scared and don't want to scare you further, but I just read this book called the \"gift of fear\" (highly recommend it) and one thing he keeps talking about is that people need a reason to be violent. There's always a justification, something that makes them feel like they have no other way to handle the situation. Because of this, you want to hold back your arsenal until you mean it. \n\nIf you call the police, they'll come to her door and talk to her and leave. So what does that show her? The police won't do anything except talk to her. If you go to court and get a restraining order, you leave with a flimsy piece of paper. These things won't do anything to actually stop her, but they may incite her. \"All I did was move into a nice house and walk my dog everyday. THEY sent the police after me. THEY dragged my name through the mud in court. THEY'LL pay for what they did\". You get the picture? \n\nIf you ignore her, she may move on. She walks outside? Let her. The dog gets out? Walk back inside. The doorbell rings? Keep eating dinner. If you take this approach though, you need to stick it out as long as it takes. If you stop answering after one doorbell, she'll ring twice. She'll ring later. She'll come in the middle of the night. If she leaves you 20 voicemails, and you answer on the 21st to tell her off, you teach her it takes 21 calls to get a response. Keep that in mind every time she reaches out!! She wants your attention and she wants it bad. ANY ATTENTION WILL DO. If you go and yell at her, you're doing exactly what she wants. \n\nSo my advice? Don't escalate unless something meaningful can happen. I like the advice to film her stealing mail; this may actually put her in jail. Anything else that will not take her away from you (speaking with the homeowners association, getting a restraining order, asking the police to talk to her) and will very likely result in a woman who's not just obsessed, but now also wronged. DONT GIVE HER A REASON TO HURT YOU. \n\nLock your doors. Lock your windows. Put up cameras. And honestly, I'm terrified for you, if you can, MOVE. ",
            "Security cameras, and in the mean time set up all of your bills to be paperless. Many bills you can schedule to pay online, they'll take the money right out of your account, or your bank can send a check to the company on your behalf on a specific day, repeating every month.\n\nYou could consider getting a fence for your yard? To keep her dog out maybe?\n\nYou could also try calling your post office and explaining the mail theft situation. You could ask if you could get a mailbox with a key that you can give to your mail carrier. If not, just get a box with a padlock and a hole big enough to slide mail into. Mail goes in, but not out.\n\nAnd if you find any dead rats put them under her porch.\n\nAnd if she invites you over for dinner some time, take a shit in the top part of her toilet.\n\nThat should fix some problems.",
            "I would say get in contact with your mail carrier, ask about the mix ups, and let him or her know you have a feeling someone is tampering with your mail, and ask them to document the pieces of mail they deliver, and compare it to what pieces get \"returned\" to you.",
            "Install security cameras. Now. Whether she sees you install them or not doesn't matter, it needs to be done asap. ",
            "this story is fxcking terrifying",
            "Locking mailbox and security cameras are a good idea. If she asks, just be honest about the recent ding dong door ditching and the disappearing mail issues. Don't imply she did it, you're \"just being safe.\" \n\nIf you want, you can ask the police to patrol your area when she's up to shenanigans. See how she reacts to a slap on the hand from the police. ",
            "1. Security cam, like everyone else has suggested.\n\n2. USPIS, they will fuck her up if she's tampering with your mail.",
            "You are not being paranoid.  This girl is bat poop crazy.",
            "There are mailboxes now that have locks on them.  The mail carrier can put the mail into the slot, but the top of them is locked, so you need a key to unlock them and open them to get the mail.  Seeing the lock might get the point across to her, in a subtle way.\n\nOn the bright side, if she doesn't work, she might be foreclosed on shortly.  Also, real estate is public record, so going to your county's website will easily tell you whose name is on the deed.  It won't necessarily tell you who paid for the house, but the information might be telling.\n\nI don't want to scare you, but if she was able to find your fiancé so easily, then your wedding is an equal target.  Undoubtedly, she knows when and where you are getting married.  You might want to take caution and action against that.",
            "This is some fatal attraction level shit. File a police report and call your HOA (if you have one), maybe install a camera outside in a gnome and beware. Tampering with mail is actually a federal crime, so if you catch her, that gives you some ammunition. ",
            "Want me to send you a bunch of post cards that say, \"I see what you're doing, Britt.\". Joking! Don't share identifying information with anyone on Reddit, guys!",
            "Honestly, IMO you are being way too nice to the point of being baited. It is situations like this you need to be prepared and not wait until after the fact, or something worse happens.\n\nYour GUT feeling is 100% right. Something is odd, and i do not think its coincidental.\n\nYou do not need to explain why you are installing a camera, who is she to be upset with it. Why do you care what she even thinks. She has subtly implanted herself in your life, and i assure you things escalate from small opportunities. \n\nNIP it in the bud now, install cameras yesterday, where you feel like you can see the most of your property and let the rest speak for itself. I really really hope you do this.\n\n\n",
            "Get a locking mailbox. If she has stolen your mail then she might have the ability info to shut off your utilities and cancel services. Be proactive about this.\n\nYou can also ask for your mail to be held at the post office for pick up, which is a nuisance.\n\nThis sounds a bit unbalanced. Does your fiance have a mutual friend who is sympathetic and who could check up on other weird things in her life?",
            "Set up security cameras, and have them set to record. They have some really good ones out there that don't cost a lot of money. I suggest having one set to watch the front door, front of the house/mailbox, sides, and back of the house. Don't tell her you're installing them, and then turn the evidence over to the police for mail theft and harassment if it is her. It'll also come in handy if the house ever gets broken into. \n\nI'd also look into getting a new mailbox. They have some decorative ones that have a mail slot on the front, and a key is required to open the back. It's to stop mail thieves. You'll probably have to go to the post office to pick up any packages you receive, but you won't have to worry about people stealing your mail. \n\nOther than that, continue to ignore her. She's knows what she's doing, and she's trying to get under both of your skins so she can get rid of you and win him back. In her mind, you're probably living in her house. If things don't get better soon, go down to the local police station and ask what else you need to do. ",
            "Holy shit. Psycho Susie has moved next door. Get cameras up. Costco has some that have come with a small monitor that you can carry around the house to watch who is in front or where ever you have positioned your cameras. File a complaint with the post office. It is a federal offense to steal mail",
            "Cameras cameras cameras. Everywhere. Document everything. If you catch her going into your mailbox even once, that's a federal crime. Seriously. Huge deal. \n\nMy  advice? Go nuclear. Life is too short to deal with a psycho stalker ex",
            "I'd set up a spy camera (one of those ones that don't actually look like a camera) and focus it on the letterbox and/or front door. Preferably set it up in a location where she can't see you installing/accessing it (possibly your study window?). That way you'll have undeniable evidence of what's going on.",
            "As long as you sit back and try to disappear, she will get more aggressive. You will find yourself changing your lifestyle and routine, closing your curtains, etc. Just to \"not upset her.\"\n\nWe were told to not upset the crazy neighbor. It made her bolder, until she was in my backyard, screaming she was going to shoot us. \n\nThis will not go away. Get the security cameras and be proactive. ",
            "Security cameras, security cameras, security cameras!\nA little bit of film on this lady and you'll have her in jail SO fast.",
            "Buy a lockable post box (after you bust her for stealing your mail). I would think this all would have to be grounds for a restraining order in most places.",
            "You should probably call the police and see what your options are.  Sometimes when a person is being harassed, the police will get an officer to call that person and warn them to stay away/stop their behavior, and sometimes that's enough.",
            "Send yourself a nice flounder or sea bass in a box marked \"Time Sensitive\" so it's irresistible for her not to keep a long time.\n\nIf she opens mail at all, try sending yourself a glitter bomb.",
            "Get Viviant home security system with a door bell camera. catch her on camera being crazy, show husband and cops.",
            "OP, maybe you feel you're being silly or paranoid, but you're not. This is all super creepy behavior. Like, kinda scary. Read other weird neighbor stories on this subreddit, sadly I've seen several update with how the neighbor escalated to a scary degree. \n\nFirst things first - cameras. Catch her in the act. Do this yesterday. \n\nSecondly, Wait for her by the door when you know she's going to ring it, and open the door. Then say \"I know it's been you doing this. We've had cameras installed. You need to stop or we're calling the cops\". Even if you don't have the cameras installed, this should let her know she's no longer going to get away with this. \n\nThirdly, Call the post office and let them know your neighbor keeps claiming she's getting your mail. Ask that the mail be delivered to your door, not your mailbox. She's clearly stealing it and they do not take that lightly. Catch her with the cameras if you can, then charge her. It's creepy and illegal. \n\nFourthly, restraining order. She shouldn't be near you or your family. \n\nNo more waiting OP. Crazy people can go from \"crazy but manageable\" to \"crazy all around terrifying\" very quickly. ",
            "Assuming that you are in the U.S. you should start by reporting suspected mail theft to the U.S.P.S. The U.S.P.S. has a place on their website to report suspected mail theft. Mail theft is a federal crime and does not go to your local law enforcement but to one of the federal organizations because it falls under the federal penal code. Now if you are not in the U.S. check with whatever your mail service is and see what the legal code is as mail theft is generally treated fairly seriously due to its involvement in other crimes like identity theft. \n\nI am a forensics student and the topic popped up in one of my books. However a quick google search will pop up with the specific federal penal code.\n\nEdit to add info",
            "please do the cameras and lawyer route. if she moved in there because she knew where her ex lived intentionally, thats fucking psychotic. who gets a HOUSE as a means to interact with someone you dated for 7 months. im just saying that if this is the lengths she will go through to get his attention then i am definitely expecting escalation. \n\npoint blank, if this is causing you undue stress then its harassment. find the harasser with cameras and take it to the cops.  ",
            "Buy a xiaoyi camera,its 30 bucks works at night and has motion notification plus all day recording on SD card and footage is accessible from internet anytime you want",
            "Ok,  you have heard of security cameras? They are pretty cheap these days and will give you proof as to what is happening to your mail and also with the doorbell. \nWithout that proof you are only driving yourself mad. ",
            "GO TO /r/legaladvice",
            "P!ease update I really want to know what happens and if you catch her!\n",
            "Put up security cameras that will catch her if she steals the mail or signs the doorbell.\n\nCan you disable your doorbell or put it on silent temporarily\n\nWhen her dogs runs over just laugh and say \"he's a slow learner huh.\"\n\n",
            "Put a secret camera focused on your mailbox and record her stealing the mail.  That is a federal crime.",
            "has your fiance talked to her at all about this? he could say \"don't speak to us anymore, it's really awkward that you moved in across the street and i don't want anything to do with you from now on. keep your dog away from us, too.\"\n\nyou don't *have* to be polite to someone who's not respecting your boundaries! \n\ni know you don't want to risk her getting violent, but I'd try telling her once. then, if she escalates, call the cops. I'd also look at your HOA contract and see if it says anything about neighbour disputes. ",
            "I think you can file a mail theft complaint...I just googled mail theft and there was a link for that. ",
            "Like others have said, get cameras all over your property and floodlights if your HOA allows it. Also, get a locked mailbox and report your mail missing. Take any evidence to the police and file a report.",
            "cameras above your doors, most especially one in the front aimed to get the whole porch including the mail box. catch her taking the mail out and BOOM, felony on her ass!",
            "Everyone else has made some really good points. Also document the previous and subsequent incidents of her returning your mail, of the ringing doorbell and so forth. If you need to get a restraining order against her, this will help.",
            "What does your fiance think of the situation? That's a pretty big deal. It's completely inappropriate and uncomfortable and you don't want to live the rest of your life like that. Although you are both definitely affected by this, I feel like your fiance should come up with some ideas and take action, since he knows her and the reason it's happening is because of him (& her).",
            "If you don't want her to know you have cameras, I suggest checking out some trail cameras used by hunters to track animals. \n\nThe reason I suggest this is they do not need a power source, and you can maybe camouflage them with something else (yard display, seasons decorations etc).\n\nYou could let them do their thing until something happens and then check them.\n\nThis is a crazy situation but I think catching her in the act would give you way more leverage than having her stop the behaviour. \n\nGood luck and post an update if anything happens!",
            "Get a damn camera and catch her ass.",
            "Please find a way to install them discreetly. \n\nWait for her to leave her house if you must. \n\nYou're going to want to catch her in the act so that you can have her removed from your presence.  \n\nThis woman sounds dangerous and I'm concerned for your safety and would suggest you move if moving wasn't so difficult. Unfortunately it is, so you do need to get some evidence. \n\nThe past record of having to call the cops to remove her from his premise paired with security footage and just how bizarre it is that she moved in across from you two will be more than enough proof.  They will take this situation very, very seriously. So should you. ",
            "Put up cameras \n",
            "perhaps installing security cameras would be best. look for great deals and do a lot of research. mine alerts me the minute something happens such as a dust flies by. it's annoying but i feel better knowing that it works. sounds like this is a psycho that has nothing better to do. once you have evidence that she is trespassing you can always file a restraining order. hope this helps",
            "RemindMe! 4 days\n\n\n\nDon't forget to update this pleassee",
            "get a camera ffs",
            "Update home security (cameras, better or new locks), get stalker kit start making records of incidents. ",
            "Get a security camera sign. It is cheaper. When she asks, just say it is a hidden camera.",
            "This sounds like a plot for a movie, install security cameras, let people know in the community, don't wait for anything. She's definitely doing something if you're starting to notice things this unusual. ",
            "Just to add what is beng said, if you get security cameras installed ask whoever is installing them the best quality settings so the footage is actually worthwhile and does not fill your computer. A lot of people with CCTV get screwed by the low quality footage they get and I'd hate for you to be one of them. \n\nTo get a nice cone of vision on the front, get one camera looking down to the door and another facing the mail box. Get one for the back door JIC and maybe use a go pro as added security. ",
            "I would put up security cameras for the doorbell and mailbox. With the mail, you can also get a P.O. box.",
            "You're worried about making her mad and having her behavior get worse, but it's going to get worse anyway. She didn't plan this out to NOT get worse. If I was you I'd move the dog in with your parents for a while so she can't do anything to it. Then record her stealing the mail because she can get jail time and huge huge huge fines for that. You REALLY need cameras. Maybe you can trick her into being somewhere else while they are installed. I'm sure she won't steal the mail knowing she's being watched. Put a camera inside the house looking out the window even.",
            "Put a sign on your mailbox: To whomever is stealing our mail, you will be reported to police and charged with a federal offence.",
            "Please do an update on this, this woman is insane!",
            "You know damn well what's going on. Security cameras aimed at the mailbox and at her house and the route in between. Federal offense ",
            "Do what everyone else on here says to do, but get a personal mailbox at an actual facility.",
            "I'm definitely going to need an update on this later on down the line. ",
            "Salivating over getting an update to this one day. Please OP. \n\nRemindMe! one week \"find out what happened with crazy ex stalker\"",
            "You're already getting some great ideas; I'm going to talk just about the mail. \n\nI would start by putting a note in your own mailbox, taping it to the inside, that says something like, \"BRITT. If you steal our mail one more time we're calling the cops. Surely you understand that tampering with someone's mail is a FEDERAL OFFENSE.\"\n\nThe I'd flag down the mailperson one day and explain that the resident of [Britt's address] has been taking your mail, and would he or she mind coming to the door with the mail instead on the days you're home? I know you said Britt is only taking the mail on days you're not there, but if she sees the note AND she sees the mailperson hand delivering mail to your door 3 days a week, she'll realize you've started telling people what she's doing, and hopefully that might shame her into realizing what a criminal she's being. \n\nGranted, she might already be too crazy for this to have an effect, and maybe your house is waaaaay too far down a long driveway for the mailperson to do this, but it's worth a shot before actually involving the authorities.",
            "Can you set up your important mail/mail with sensitive information to be handled electronically? I know bank statements can be mailed instead of sent on paper. At our apartment, we have an account on the internet where we receive/pay for our utility bill. You might be able to do that same.",
            "Sign up for paperless billing so she doesn't have the opportunity to steal utility bills and you can monitor your accounts/pay your bills online. ",
            "Security cameras, and get a mailbox with a drop slot for mail and a lock on the front if you don't have a community mailbox. ",
            "There are mailboxes that are locked where you have to have a key to get the mail I would buy one of those. Also buy security camera's and when she let's her dog run over ignore her and just walk away.",
            "Put up cameras ",
            "On mobile so haven't read all the replies - apologies if this is a duplicate.  \n\nGet one of those front door peephole cameras, or a doorbell one that connects to your wifi and has a built in camera.  Ive seen ones that have a continuous monitoring feature.  If you have a window that faces the front yard, put a camera in one of the corners so it's not too intrusive.  Check out Nestcam (formerly dropcam) for a window cam and you can watch remotely.  ",
            "You need to install some surveillance cameras in front of your door/mailbox.",
            "Consider just unplugging/turning off your doorbell for a bit.  There are ways to go without using it for a couple weeks or so, and it'll through her off and discourage her from trying to continue with that method.  ",
            "Restraining order, and as others have said, cameras.\n",
            "This is full on level ten crazy. Holy crap,  this crazy ex gf moves in across the street, something is not right with her. Get cameras, and start recording dates and times of every event that happens. Prove patterns, get footage and get the police involved. This is like the start to a bad horror movie. With a crazy ex-gf serial killer.",
            "Please make sure you update us!",
            "These are a lot of coincidences...",
            "Do US houses generally not have letterboxes?",
            "Who the heck walks around the same cul-de-sac for three hours straight several days a week?  That is odd and creepy by itself, add everything else you mentioned and she is for sure acting out.  She sounds like a little kid who will do anything for attention.",
            "the part of the stalking you are watching is just the tip of the iceberg...  I bet its a fulltime occupation for her! Wish you all the best of luck. Hope you and your fiancé can at least have a good laugh about it when its over. ",
            "I cannot vote security camera enough! If you want her to know, put it outside it plain view [I wouldn't be surprised if she was constantly watching the place. that will *hopefully* deter her from continuing her actions vs. having her go even more extreme. The other option, which I personally think might be better, is to start out with the camera inside facing out the window much more discretely [or perhaps even hidden in a garden ornament or something]. This means you can get it all set up without her knowing and you have a MUCH better shot of catching her in the act [make sure it records]. Once you have solid evidence, you can take the matter further an decide where you both want to go from there [I.E. if she is taking your mail, I believe that is illegal! Although it might just be illegal if she's actually opening it?]. Until you catch her in the act, maybe just keep your head down and avoid coming in to contact with her as best as possible. As this seems to happen like clockwork every week, you hopefully shouldn't have to be restricting yourself for very long. Your only other [and more expensive option] is to move but that seems totally unjust! You shouldn't have to run away from your home/community because she doesn't seem to be able to stay away! Very creepy indeed!",
            "I felt like I was on NoSleep for most of the story! Wow, I can't believe she'd go that far. This woman is obviously crazy. Maybe you could go for a game camera, I've used one to catch neighbors letting our horse out of his fence. They just take pictures when they sense movement and they're cheap.",
            "How are you not worried out of your mind about this?! She obviously has issues and these things never end pretty. She will just get bolder and bolder if you continue to let this happen. She might even feel empowered you haven't done anything and feel that this is silent approval what she is doing is OK.\n\nCall an emergency police line and talk to them. At the very least you need to get this on record so later when the shit really hits the fan you have some past evidence she was doing weird stuff before.\n\nAlso, get a security camera. They are super cheap and easy to set up these days just using wireless internet or blue tooth. \n",
            "So far all the symptoms of the crazy are pretty easy to fix-- security camera at front door, locking mailbox, and get your bills by email. \n\nThe cause of the crazy will of course be more difficult. I guess keep as much of a record as you can, and report if things escalate.",
            "Definitely get some security cameras to install. My family has a doorbell my dad got from Home Depot and it's connected to his phone and has a camera. Now when somebody rings the doorbell it rings to his phone and it records a video of who's there and the videos are saved. It would only help with the ding dong ditching but at least it's a start.  ",
            "How is no one else in the cul de sac seeing this????",
            "Move. If you can't do that, set up cameras. Because if you have her stealing mail, that's big big trouble for her. If a camera catches her doing the doorbell thing, time for a restraining order. don't be nice to her anymore.",
            "Take a day off work when you would normally not be home, leave at the same time you usually would then stake out your place or go round the back of possible. \n\nYou can go in and sit with your phone or camera and catch her stealing your mail. \n\nLess expensive than buying cameras but I would be getting cameras anyway. \n\nYou have a community, ask other neighbours if anyone else's mail went to Britts. Not accusatory, just like btw some of our mail has been going to Britts house, anyone else? Brush it off like postmen, right? \n\nPhone take away to her house. Sign her up for mailing lists. Be a nuisance right back ",
            "Op your fiance is being stalked by a woman he dates for 7 months. This is serious. Like othera have suggested record everything, get a locked mail box, and set up wire less cameras.  This is some fetal attraction level of crazy.",
            "Would it be that hard to just set up a camera that looks at the door and the mailbox? One that records when it detects motion? I have this set up in my apartment and it notifies my phone when there is movement (and I can see the feed as well).",
            "Talk to the mail carrier about your concern. They will make a special effort to make sure that she DOES NOT get your mail. Tampering with mail is very serious.\n\nIf you are feeling more ambitious get an outdoor security system with cameras which is a few hundred dollars, may even help with the sale of the house in the future. \n\nKeep an eye on any suspicious activity and document it. If the issue persists and you have the means get a restraining order / contact the police.",
            "TP her house.",
            "Whenever she tries to interact with you or your partner, like when shes at your door. You should interact with her not your partner. She'd get annoyed that she can't get to your partner. Probably ",
            "The mail thing isn't just illegal. If you're from the US it's a federal crime. Add in the ding-dong-ditching and and exercising in front of your house, you may even be able to add a harassment charge and get a restraining order. Get some cameras if you can afford it. ",
            "Did you ever catch her??",
            "Just move. ",
            "When a woman gets it in her head that this kind of behaviour is normal or acceptable, it'll just keep on coming. In saying that, you're in a catch22. Leave your blinds up during the day, go out and talk to her when she's exercising for 3 hours and make subtle references to other places she could potentially go, lie about places you have gone even. You also need to accept that this could be an over active imagination on your behalf because you're already uncomfortable at your space being invaded. You won't get away from her unless you sell or she sells. :/. ",
            "get a shotgun and birdshot. Shoot into the air and that should take care of the problem. BTW check local ordinances about shootin in your hood !!!"
        ]
    },
    {
        "post_id": "2uitl0",
        "author": "IKilledATeddy",
        "title": "[Update] Me [27 M] with my Wife [26F] I washed her childhood stuffed animal and destroyed it",
        "url": "https://www.reddit.com/r/relationships/comments/2uitl0/update_me_27_m_with_my_wife_26f_i_washed_her/",
        "score": 2425,
        "num_comments": 182,
        "created_utc": 1422890447.0,
        "selftext": "Original [here](http://www.reddit.com/r/relationships/comments/2sml0e/me_27_m_with_my_wife_26f_i_washed_her_childhood/)\n\nTEDDY LIVES!!!\n\n\nTeddy is patched up and he's clean! Seriously, thank you everyone that offered to help out. The fact that so many anonymous people on the internet were that invested in helping out my pregnant wife was amazing. She got him back over the weekend from her family friend and he looks great! \n\nWe also got her on some new prenatal vitamins that don't have iron in them so she is feeling less sick all the time, so that's good too. I'm taking a half day to take my wife to the Doctor for our first ultrasound later today. \n\n\n---   \n**tl;dr**: Jenny'd my wife's favorite stuffed animal but he's fixed now and Teddy is a chubby little doggie and re-stuffed with fluff. ",
        "permalink": "/r/relationships/comments/2uitl0/update_me_27_m_with_my_wife_26f_i_washed_her/",
        "comments": [
            "[deleted]",
            "I hope one day someone loves me as much as you love your wife. You really put a lot in perspective for me- the men I've been seeing lately would never ever take me seriously over something like this, but this is absolutely something I would be devastated over as well. You rock for going above and beyond to make her happy and for internalizing the things that are important to your wife. Love to y'all and the belly-dweller! ",
            "[deleted]",
            "I'm glad to see it worked out :). \n\nJust so you know, next time wash teddy while in a pillow case. And AIR DRY. I can't stress it enough. Some stuffed animals have polyester fur that singes very easily in the dryer. ",
            ">We also got her on some new prenatal vitamins that don't have iron in them so she is feeling less sick all the time,\n\nThis is going to be random sounding, but (assuming your doctor approves) switch back to the ones with iron once she gets to the 2nd trimester and stops feeling less sick. We did the same thing for my wife when she was sick but then kept her on the low-iron vitamins and a later blood test showed her iron was ridiculously low. So check with your doctor about all this obviously, but I suggest just remember to switch back to the ones with iron once she stops feeling so sick (should be pretty soon, hang in there). \n\nAlso, from a new dad: enjoy the second trimester! Try to go do some fun stuff, because later she'll be too big to be comfortable anywhere, and then you'll have a baby and you won't be doing shit for yourselves.",
            "[removed]",
            "I'm glad that it worked out for you. Can you tell me how you fixed it?\n\nI really need to wash one of my girlfriend's stuffed animals, but I'm terrified of destroying it as well.",
            "I have been waiting for an update!  Yay! I'm very happy that you were able to fix her childhood doggy!\n",
            "[removed]",
            "what was her reaction?",
            "Easily the happiest update ever!! Go Teddy!!!",
            "That's great news! I have a teddy I've had since my first Christmas and my husband was joking around being rough with it when we just got together. The tears I cried when I saw told him how much I love my teddy! \n\nWell done for being a great husband and getting teddy back to good health. ",
            "I'm so happy for you and your wife.\n\nMy mom accidentally threw out my childhood bear and I still want to cry when I think about it.",
            "Awesome! For most people, the idea of a toy is such an insignificant thing. You deserve big high fives for understanding what it means to your wife and being so proactive in getting it fixed. \n\nBest of luck with the pregnancy! ",
            "TEDDY LIVESSSSSSSSSSSSSS YESSSSSSSSSSSSSS",
            "This update made me so happy! I'm glad Teddy is fixed and well again!!",
            "Yay! Next time teddy has to go through the wash use one of those net bags for lingerie or a tied up pillow case. It will help to prevent snags! ",
            "just awesome op. best of luck to all 3 of you, and stay the hell away from teddy from now on",
            "Awesome! I am so glad. My mum beheaded my beloved Teddy, so I could sympathise a lot! It will be great for your wife to have him back at this time. All the best for your first ultrasound! I hope all goes well!",
            "Awww so sweet! Are you and your wife going to get baby it's own teddy?",
            "[removed]",
            "Here is a [cached version of the update with pictures](http://webcache.googleusercontent.com/search?q=cache:https://www.reddit.com/r/relationships/comments/2uitl0/) for all those as desperate to see teddy fixed as I was...",
            "It's like the perfect ending to a fairy tale.  Long live Teddy!",
            "Hmmm with regard to the iron: iron in high doses causes sickness and trouble with stool. Try a thing called \"Slow Fe\".\n\n\"Slow Fe\" essentially releases the iron slowly and diminishes the unpleasant side effects.\n\nSource: Pharmaceutical engineering course.",
            "This is AMAZING. I would have cried and then drowned you with my tears. I always worry that my dog will get to my bear and then I would be so torn and so broken. ",
            "Awww, I'm a sentimental person and this really warmed my heart. I'm so glad it worked out and it's good to know seamstresses can do this kind of reconstructive surgery. ",
            "I am so happy for you guys ;-;",
            "Hooray!!  \n\nJust FYI, if you ever decide that he needs a wash again: stick him in a pillowcase.  Tie the case closed or use the kind with a zipper.  Seriously.  I've put many a stuffed animal through the washer and dryer in my life and they've never gotten damaged this way.  Always be sure to wash on delicate and tumble dry low, just to be safe, but a pillowcase should keep Teddy (and your future child's future stuffed animals!) nice and safe.",
            "I may or may not actually be crying right now. I'm so happy for you four. (OP, wife, Teddy and little one)",
            "I hope that this means your wife will continue to let you stuff her... :-)",
            "I was just thinking about this topic and wondering what happened last night when I went to go wash my own teddy! Good to hear, thanks for the update. =)",
            "Good job! Sometimes the solution to your problem is closer than you think! ",
            "Awesome. It's a good idea to get childhood toys restuffed periodically anyway. FWIW there's a teddy bear factory store thing in some malls that will do this for free. ",
            "[removed]",
            "Yeyyyyyy! I've been waiting for this update! ",
            "I am so happy that this worked out! ",
            "YAYYY!!!",
            "YAY!!! Little advice, next time Teddy needs to be cleaned you put him in a pillowcase. It always works well for my Bunny.",
            "Great tl;dr! How does your wife feel about teddy?",
            "AWWW",
            "Aww yay! Good job OP! :D",
            "Oh I'm so glad to see this! Thanks for the update :) ",
            "so happy it all worked out! Good luck at your appointment :)",
            "This is great news. Congratulations on the baby.  I'm currently 37 weeks and 5 days. ",
            "next time, put teddy in a pillow case when washing/drying ",
            "Usually updates here suck. I am prepared to be sad when I click an update - thanks for making my day!!\n\nBe sure to wash him in a pillowcase from now on! :) ",
            "Anyone else have/had SO's that still have a childhood blanket?",
            "I'm SO GLAD that Teddy's alive!! And yay for ultrasounds! ",
            "Woohoo! Also, a morning sickness remedy: lemon water. It's easy - water, ice, and a bunch of lemon slices. Lemons are very effective at combatting nausea, even smelling a lemon helped me when I was pregnant.",
            "[removed]",
            "I couldn't take the prenatals with iron in them either or I would get sick. I just took Flintstone's with less iron in them when I was pregnant via doctor's orders lol\n\nGlad to know teddy got fixed!",
            "[removed]",
            "I'm so glad you have a happy ending! When I was a child, my mother washed my favourite stuffed toy, Peaches, and for some reason, put it in the oven to dry, and forgot all about this. Peaches was destroyed, but luckily it didn't burn the place down. It was a tough loss for me, though.\nI'm really happy for you and for your wife that your situation resolved so beautifully. Wishing you both all the best. ",
            "Fantastic news.  So glad that Teddy lives. :)",
            "I'm so happy for you!!!  I was hoping this would have a happy ending. :). Congratulations!",
            "[removed]",
            "dude. as a 30F who still has her bear bear from when she was born on her bed at home... who takes him when she travels and uses as a pillow... you did good. I would DIE! Went to Jamaica in November and our luggage never made it back to Seattle from our connector flight in ATL. No mind my bag was 75 lbs of my clothes and gifts and makeup and shoes and toiletries.. my bear was in that bag and everything else was replaceable.\n\nBag showed up 3 days later. \n\nMy mom tells me Im too old and to give it up but I will most likely pass away in the nursing home with my 90 year old bear.",
            "Good on you, OP, for being so concerned for your wife and unborn child's health and even better on you for doing everything it took to fix Teddy. I can tell that you truly love your wife, and that's such a great thing! This is the happiest ending :)\n\nI read your original post and almost cried at work. I'm 23 and I have a security blanket from my childhood. I'm so attached that, when I was a kid and they told us in school to have a little emergency kit if the house ever caught on fire/weather emergency, I'd resolved that the only thing I needed was my blanket. If mine got destroyed I wouldn't know what I'd do - it's somehow survived years of abuse and is still going strong.",
            "Gratz man. I'm glad it worked out. In the future, maybe using a shoe bag in the dryer would be good to avoid this in the future. If your wife ever let's it be washed again.",
            "That's FANTASTIC.  You are a wonderful partner. So glad someone was able to put Teddy together again. And you learned a valuable lesson about washing treasures that will come in handy for the little one!",
            "I'm so glad it turned out so well. As a side note, their is a liquid iron supplement that is much easier on the stomach. I forget the name, but I'm sure you can google it. If low iron is a big concern, I highly recommend it. ",
            "[removed]",
            "You're a sweetheart. Lucky girl",
            "Hahaha yes! great news! :)",
            "Wonderful news! And for preggo nausea, I have to leave three bits of advice. First, if nausea is food induced: Smell a lemon. Pierce the skin with your nail and just inhale the clean, bright scent. It distracted me from feeling queasy so well, I'd fall asleep with it on my shoulder. Secondly, with doctors approval, half a chewable Dramamine (orange flavored) before the meal and she'll be able to fall asleep and keep her food down. Last, believe it or not, Slim Fast (chocolate royal) has Vitamin K which is known to help relieve nausea in pregnant women. It's also full of nutrients and gentle on the stomach. Good luck! I did this for a week while pregnant and it helped a lot!",
            "I'm glad that you were able to fix the teddy bear!",
            "I'm so happy for you that you weren't murdered and for your wife that she still has her happy childhood friend :)",
            "This is super heartwarming, but can I also say I'm so happy there are other 25+ year olds who have attachments to stuffed animals like this? I have one. I wish I could find another one. ",
            "I knew you would save him! On behalf of all adults who still treasure their childhood toy, thank you. ",
            "[removed]",
            "Glad all is well and congrats on the pregnancy! If you'll go through all that trouble to fix a stuffed animal I'm sure you'll be a great dad (: ",
            "I too have a life long stuffed animal (a bunny) and I have to hold that thing at night or it's hard to fall asleep. If she were destroyed I would also be heart broken. Glad Teddy has pulled through! You're a good husband. Congrats on the baby also!",
            "I'm having a rough day, and this is helping me feel better. :) Way to go!",
            "You just made my day, fucker. ",
            "[deleted]",
            "YAY!!!!\n\nSeriously this is one of those heart-warming Reddit things that makes me love this site.  And you're a good hubby.  :)",
            "Maybe your wife should grow up "
        ]
    },
    {
        "post_id": "awxq0c",
        "author": "prosperare",
        "title": "I [37/F] absolutely cannot stand my coworker [48/F] - How can I deal with this woman?",
        "url": "https://www.reddit.com/r/relationships/comments/awxq0c/i_37f_absolutely_cannot_stand_my_coworker_48f_how/",
        "score": 2417,
        "num_comments": 241,
        "created_utc": 1551642509.0,
        "selftext": "Have you ever just met someone who embodies everything you hate? This is that person for me. We work in a very small department (for about 2 years now) and she is practically within arms length of me. Why cannot I not stand her? Well..\n\nShe talks all day long. To me, to others, to her sister on the phone, etc. If you don't talk to her, she gets her feelings hurt and then huffs and puffs all day long. Or she leaves and goes to some other department to talk about us. \n\nShe fights with someone at least once a day. Me, her husband, her sister, our boss. Speaking of which...\n\nIf I say \"it's a nice day out\" - I will get 100 reasons back on why it isn't a nice day. She can literally argue about anything with anyone. The one time I stopped the \"fight\" and told her I didn't care about what we were arguing about - she cried for the rest of the afternoon. \n\nI get constant commentary on my actions - especially with food (I am on a diet and SHOULD be). God forbid I don't eat the amount of food she thinks I should. It is like having the mother you never wanted telling you your not eating enough. OH...she is also a \"vegan\" (Except for the **bacon** she eats every morning). \n\nSo we get preachy commentary also about meat, straws, recycling, animals, tree-hugging (literally) etc. All while she eats bacon, uses 100 Styrofoam cups a day, has non-neutered pets etc. Basically shes a hypocrite. \n\nGotta go to the bathroom? Well you should have asked her also if she needed to go so you both could go together. If its time to go to a meeting together she will yell rudely \"are we going or not?\". She acts like we are all joined at the hip. \n\nAre you cold? Well she is colder. Are you sick? She's been sicker. Family member died? Well hers are deader. We are always in some weird competition with her. Especially if it has to do with being seen as small, sickly, victim-y. It is so bizarre. \n\n\nShe doesn't pull her weight at work. She is hidden from our bosses view - so she spends hours on her phone. If you try to get her to help out or cover for someone on vacation she gives about 100 reasons why she can't or just flat out doesn't do what she says she will. \n\nMy boss is useless in this situation (shes a pushover). I wear earbuds but we are so close that unless I blow out my eardrums, I can hear all of this. I am at the point where I am considering quitting over her. I am a really laid back, introverted person and she exhaust me. I get this dread on Sunday afternoon from having to be around her again. Anyone have any suggestions on how to deal with her. My job is otherwise a pretty sweet situation, I would like to keep it for awhile. Thanks!\n\nTLDR - How do you deal with a co-worker who gets under your skin like it's their job? \n\n\n\n",
        "permalink": "/r/relationships/comments/awxq0c/i_37f_absolutely_cannot_stand_my_coworker_48f_how/",
        "comments": [
            "You need to gray rock her. Limit unnecessary conversation, and when you do talk to her, be as boring as possible. Don't express any strong opinions or argue with her. If she tries to suck you into her negativity, just blandly agree with whatever nonsense she's spouting and walk away. Don't feed her appetite for drama.",
            "Boundaries. You'll get HELLA push back at first but it's what you have to do. I had a boss that sounds a lot like this woman. \n\nMe, to co-worker: I have a headache, so glad today is done.\n\nBoss: Oh what *I* do is take Tylenol and then 2 hrs later take Ibuprofen. You need to do that. That's why your headaches keep coming back. You don't get rid of ALL the pain. Your posture is horrible too, it's like your head isn't even on your neck the way you're sitting, you should.....\n\nMe: I'm sorry, I was actually talking to Lina here. \n\nBoss: (Calls well after work hours with what should be a quick, legitimate question and then sits on the phone wanting to talk about her personal life for an hour if I let her.)\n\nMe: I was actually in the middle of dinner. I'm going to have to ask you to keep after hours calls quick and strictly work related when you need to make them. \n\nYou can apply this at work too. \n\nJane, I'm trying to concentrate on this. Would you mind finishing your call in the hallway please?\n\nJane, please stop commenting on my diet. My nutrition and weight are being monitored by a doctor and everything is fine. \n\nJane, your lifestyle choices are fine but they are YOUR lifestyle choices. Please stop criticizing mine. \n\nShe'll pout and cry. This is not your problem. Do not engage or debate after you've stated your boundary. If needed, restate it and then again, do not engage. \"Jane I've asked you several times to take personal calls away from our work area. It's distracting. Will you be able to do that or do we need to work with Boss to find a solution?\" \n\nIn my experience, 99% of the time people like this get so \"tired of everyone picking on them\" that they quit in pretty short order.",
            "\"Ask A Manager\" has many letters (it's an advice column) on pretty much this. But the gist of most of them is: \n\n1) Grey rock it, as others have said. Minimal, very neutral interactions. Make it hard for her to have \"fun\" or \"entertainment\" from you. \n\n2) If it's possible, do include her on your own terms. Maybe an email to the group every Friday, dropping off little things like a donut or a piece of candy, saying hi and bye, or whatever small things you can do. She sounds really lonely and tragic to me. \n\n3) Observe her behavior as if you were an anthropologist. \"See how Karen tries to establish dominance by saying her pets were buried in Pet Semetary and now she's not too sure about this new stray...\" Try to find the humor in it all. \n\n4) Let her be upset. She's an adult, don't try to fix it. She's punishing herself far worse than you ever could, trust me.  \n\n5) She if you can pinpoint the work-related cost of this. \"Boss, Karen is distracting and upsetting me and I've spoken to her more than once. I'm having trouble finishing...\" or \"I asked Karen to cover for me and she declined. She said she was having remora feed on her back that day. Anyhoo..\" Just give your boss the facts, if any, that make her an unsuitable worker. ",
            "Oh my god are we working in the same place ? Because you are describing my coworker as well. She was on maternity leave and is coming back in two weeks and I have been dreading that day ! I absolutely cannot stand her and have tried everything but she will never change :(",
            "\"Family member died? Well hers are deader.\" BA ha ha ha ha! \n\nOP, this is GOLD. But yeah, this must be unbearable As other commenters have said, you need to just gray rock her, and I guess start looking for another job since your boss is spineless and doesn't care. ",
            "You've gotten good advice, but I wanted to help you on the whole \"not blow out my eardrums\" thing.\n\nIf you go to whitenoisemp3s - dot - com, you need to download \"Rain on the River.\"  It is a fabulous track of white noise that is super effective at blocking noise at close distances.  Essentially, it's loud rain on a running stream, so there's lots of solid sound masking features, and since it is an hour long MP3, there isn't a \"seam\" to distract you.\n\nI've used this to help drown out my husband's snoring (which is now rectified I finally forced him into a sleep study and I don't know who is happier with his CPAP) with earbuds or headphones.  If it can help block that, it can help block a lot of her noise.",
            "If you're working for a bad boss, then the rest of the jib perks don't really matter. I have an amazing boss, and it makes me look forward to going to work every week. I don't think that, as a peer, there is any way you can get her to change her behavior. \n\nWhat you can do is move to a different desk (my boss did this...moved her desk out into the hall to get away from overly chatty people in the office, and it has made a world of difference). You can completely ignore your coworker. Sounds like it doesn't really matter if she's upset because you're not going to be reprimanded or told to change by any authority figures. \n\nI would just stop engaging. I would also find a new job. Having to carry a team members dead weight, while working for someone who won't help in any way, is just too much of a pain. Life is too short for that.",
            "Your options are\n\na) put up with it\n\nb) get a different job\n\nc) set boundaries and *don't let her feelings about it convince you you were wrong to set them*. \"I don't want to talk,\" \"I don't want to argue,\" \"I don't need advice on this,\" \"I'd rather not hear any more about this topic,\" \"that's none of your business,\" \"that's not your call,\" and \"give me privacy and personal space\"--these are all *completely normal and reasonable boundaries* which you've given up on defending because of her emotional blackmail. She's being *super extra inappropriate* and it is 100% okay to return awkwardness to sender and just *let her be unhappy*.\n\nThe obvious caveat is that she and anybody who has accustomed themselves to working around her personality will see you as the mean one. You have to weigh the potential consequences and how much that matters to you. Just remember that you aren't starting this. *She* has made you uncomfortable. You're not rocking the boat, you're refusing to stay in and help steady the boat that she's rocking. Staying quiet this long isn't keeping the peace; you haven't had any peace! It's giving *her* peace at *your* expense and *you don't have to do that.*",
            "wtf going to the bathroom together!? that is your well deserved alone time. how dare she.",
            "[removed]",
            "I had a co-worker like that. I didn't engage and mostly just ignored her.\n\nThen she was promoted to Assistant Manager. I started looking for a new job that afternoon. \n\nFound out the next day another co-worker was also looking for the same reason. \n\nFound out a week later a third co-worker was also looking.\n\nI suspect a fourth is leaving as well, but I don't talk to her as much.\n\n",
            "I had a good chuckle at “well hers are deader”, but barring that I sympathize with how frustrating this is. If this were someone you were trying to maintain a relationship with Id wrack my brain for better advice, but honestly I think quitting is the best thing for you, and tbh— for your boss as well. Let her know she’s lost a good employee because she didn’t do her job as the boss. (Once you’ve found another job yourself, mind.)\n\nIf you think you can maneuver to another job successfully and can maintain your boss as a reference while still doing so, it might even be worth letting your boss know you’re making plans to walk. It might inspire some spine. Otherwise I just don’t think it’s worth staying (if you can find something else, of course.) Good luck, and I hope something better comes along! ",
            "So I have this same experience at work. Worst part? She recently fell pregnant, and it's literally all I hear about.\n\nMy partner bought me a pair of noise cancelling headphones. Honestly, they're a god send. Sometimes I see her signalling at me, trying to get me to take my headphones off. But I just completely ignore it and pretend I can't see her.\n\nGet yourself a pair OP. It will literally change your life.",
            "I worked w/ an older woman like this. Very opinionated and a hypocrite, extremely similar to what you wrote about. We worked in an EMERGENCY communications job and she straight up sucked. My work tortured me for 2 weeks on a night shift w/ her and made her my trainer in which she just made me do 100% of the work while she sat back on her phone. After I realized the kind of person she was, I stonewalled her. I gave her no fuel to talk to me. I heard she started talking shit about me behind my back from another co-worker but I didn't care. I didn't have to talk shit about her because everyone knew how she was already.\n\nI was lucky in the sense that this job was just a filler job for me after moving to another state. I was applying for other higher paying jobs to match what I had before because I took a pay cut taking the communications job. I would say if you can, apply for another job if you're forced to work w/ her. Having a co-worker like that on the same shift will never make you happy to come to work. The job itself wasn't even hard most days and had a lot of downtime. This lady just didn't have a life outside of work and thought her co-workers were her personal friends even though her personality was incredibly insufferable. She had multiple incidents that should've gotten her fired but upper management would never put their foot down.\n\nI found out after I left that job everyone else in the next few months did too, leaving her alone w/ just 1 new employee.\n\n&#x200B;\n\n&#x200B;",
            "You think YOU have it bad?  I had a coworker 100x worse than this...\n\n&#x200B;\n\nJust kidding.  This sounds infuriating.  I understand white-knuckling through for the sake of keeping the peace, but you can't really consider it \"peace\" when you're fuming inside.  In addition to the grey rock technique that others have proposed, I'd also encourage you to take a firm stand on issues where she crosses into your personal boundaries.  The food thing, for example:\n\n\"If my doctor has a problem with my diet, they'll let me know.  I'd rather not talk about it.\"  \n\nResist the temptation to say, \"I appreciate your concern.\" What she's doing is not concern, and you don't appreciate it!  ",
            "Get noise canceling head phones, asked to be moved to a different desk if possible and then ignore her. Only talk to her about work topics. Bathroom, food, etc? Not a word to her. She'll complain regardless but at least she won't be talking to you. ",
            ">Family member died? Well hers are deader.\n\nI'm sorry, but I laughed. I definitely know someone like this. \n\nMy suggestion is to let her huff and puff. And then let her huff and puff the next day. And the next. \n\nShe can't talk MORE, right? And you won't get in trouble with your ineffectual boss, right? So, unless it's for work, no listening to her at all. ",
            "[deleted]",
            "You can ask your boss to move to a different desk, and if that's not enough, a different department. If you can't move to a different department then I would recommend a new job.\n\nHow do your colleagues feel about this woman? Is she actually good at her job?",
            "Be prepared that when you stop responding to her negative conversation (gray rocking her), initially she will escalate her negative behaviours. It's like a child that has tantrums and for the first time gets put in time out. They can't believe that the bahaviours that have always worked in the past to get what they want aren't working now and maybe they just need to scream louder and longer and kick their feet! So steel yourself. You can get through this. ",
            "keep the ear buds in. Never ever answer her while they are in. When she does get to you give her a blank stare and a shrug.\n\nStart looking for a new job. DOnt quit before our find one.\n\nShe sounds awful.  sorry",
            "It’d be amusing to make talking to you a negative experience. \n\nShe comes by to talk\n\n“Hey Karen, sorry to hear about xyz. Since you’ve got a moment, could you do this thing?\n\n(The only thing she hates worse than being ignored is being told to perform.)\n\nWhen she makes her excuse and is she doesn’t leave to do that excuse..\n\n“That sounds rough. I’m running behind on this though so I gotta fix it. Good luck with “work excuse 2”. \n\nIt’ll make a negative but subtle experience talking to you and increases the odds of her avoiding you. ",
            "Just ignore her? And if she bothers you tell her that you aren't interested in chatting because you know, you actually have work to do. Every time she tried to bring up something not work related, nip it in the bud and say you need to get back to work. Otherwise pretend she doesn't exist.  \nWhat is she going to do, go cry to the boss that you aren't wiling to be unproductive with her? If she does then bring up her excessive phone use while she's on the clock.\n\n  \nWorse case scenario, is there any way you can ask your boss if you can switch desks? If they ask why be honest. \"\\_\\_\\_\\_ is always distracting me from work with personal chit-chat and it's disruptive.\"",
            "If you end up quitting, make sure to tell your boss's boss that you left because of a situation your boss wouldn't address. Could be dicey to do politely, so maybe not worth losing a reference for, but your boss will never have to address the issue if nobody above her ever finds out about it ",
            "Is there anyway you can physically get the fuck away from her?This sounds like cruel and unusual punishment bro,wtf.ask to get transferred to another location,or just ghost the fuck out of her ",
            "I am going through the same thing with my current boss. I, unfortunately, became “buddy buddy” with her early on because it was my first “big girl job” and didn’t understand the importance of setting boundaries at work. Or that people could be so freaking annoying.  Or that people in managerial roles, at a pretty fast paced company where you sink or swim, have the time for so much gossip and just... talking... it drives me insane. \n\nI love my job and the company, so I’m not quite at the  point of leaving yet but I feel ya on the Sunday evening dread. \n\n",
            "There are multiple annoying things about Karen (I'm assuming her name is Karen, or maybe Kathleen) and I would isolate them and solve them directly: \n\nShe is too noisy and distracting - if you don't want to stir up trouble by requesting a different desk, just get better headphones and concentrate on your work. My old office had Do no Disturb signs for people trying to buckle down and work, but IDK if that would be awkward or not for you. In general, just create obvious physical boundaries, don't engage, and get noise cancelling headphones.\n\nBeing generally annoying/negative/observant about you - that really is an HR complaint. I'm not talking about getting her fired or even reprimanded, just an acknowledgement that she is crossing a professional line by constantly interacting this way. \n\nAs for being a slacker, I say let this one go. That is not your problem, and it doesn't affect you. And if it ever should, bring it up then and only then. Otherwise, that is between her and her employer, not you. \n\n&#x200B;",
            "Wait a second...is this woman my roommate? Because she does the EXACT SAME SHIT. I try to utilize headphones and my boyfriend as a buffer from her constant word-vomit, but obviously you can’t use those in your workplace. \n\nHonestly, the only way out of it may be telling it to her straight up. It may hurt her feelings, but at least you will have the emotional burden of her off your shoulders. ",
            "Some great advice here. Also helpful if you have someone else TRUSTWORTHY that’s close to the situation. You can vent together. \n\nHowever, she’s toxic for you. If you’re past the advice here being beneficial, and all you can feel is resentment toward her, you may need to move on for your own well being. \n\nFYI I can’t stand this person just from your description. Kudos for keeping your composure. ",
            "Noise-cancelling headphones (the ones that cover your ears and play white noise on top of what you're listening to) and minimal interaction with neutral statements (\"oh\" \"no thanks\" \"that's nice\"). I have a co-worker like yours who drives me bonkers and pretending she's not there or I'm indifferent has worked wonders to, at least, prevent her from pestering me.",
            "I recently had a coworker exactly like this. Disagreeing and arguing with everyone. Just spot on. Last week we all got together and would call her out on her bullshit. She cried and was dramatic, and we were not mean but firm. She complained she was being ganged up on. Last Tuesday she told the boss she was attacked and was quitting. That was the end of that. I’m sorry you’ve had to deal with someone in the workplace for so long :/ ",
            "I worked with a woman like this for a few years - actually, she trained me at that job when I started, then our desks were feet apart for like 2 years. She was the most miserable, negative person I'd ever met in my life and it was completely intolerable.\n\nEventually I had to actually tell my supervisor that I either needed my desk moved or I was going to quit. I moved upstairs and it was like a brand new job.\n\nMiserable, awful woman. Everything you described. Just dreadful.\n\nI'm talking about you, Debbie.",
            "This is a problem you will never solve and I think even grey rocking her will spark drama that will also make you miserable in the end.  Find a new job, and when you leave tell the boss that she's the reason.",
            "I just want to validate that this woman sounds atrocious! The bacon and vegan thing is too funny. I'm sure you can see the humor in all of it, but having to deal with her 5 days a week... OMG it's amazing you haven't done something that would probably get me kicked off this sub if I even joked about it. \n\nOthers have advice. I just wanted to say I'm sorry you are dealing with this awful person, and that your boss is a pushover. It might be worth shopping around for another job. Have you looked to see what opportunities are out there? Don't quit this job until you have something else lined up, but it doesn't hurt to shop around. ",
            "I would be very direct, not mean, but direct while speaking to her.  If she starts to ramble about her negativity walk away, she'll get the hint or just ask and there's nothing wrong with telling her, unless it's about work you have nothing further to discuss.  \n\nShe needs attention and can't get enough of it, but this is not your problem.  Don't help her with her tasks, only yours, if it affects you let it build up and explain to the boss why your work isn't getting done.  \n\nGood luck, I hope you find a positive way to deal with this person that helps you.",
            "If you're passionate about staying in this job, here's another option here that others haven't really covered, which is trying to get your pushover boss to solve the problem.\n\nThis is not necessarily preferable to anything else suggested, but in case you want to try it here is how:\n\nThe key is to make it easier for your boss to deal with / get rid of her.  If she's this annoying and underperforming, she's annoying to your boss, too.  So the way to get a pushover boss to act on this sort of thing is:\n\nA - Shorten the connection.  Make it more apparent over time, in a low-pressure way, the direct connection between Coworker and stuff that boss doesn't want.  Eg, casually mention more often the role coworker takes in distracting you, if she has questions send her directly to boss more, etc-- the exact form of this will vary widely, but find a way to \"help\" boss feel her direct impacts more, tai chi style.\n\nB - Lower the wall.  Decide what action you want to take, and put in the work of making it the path of least resistance for boss.  Eg, you want to move or have her be moved?  Have her fired (for cause)?  Document.  Find some awesome potential replacements and make sure boss meets them.  Put in a bit of extra work to show boss how you could totally move to this other thing.  \n\nC - Establish allies and social proof.  The more people who go to boss and make it clear that coworker is a problem (especially who join you and do A), the more gravity for your boss will be toward doing something.  One person pushing for action from a pushover will always be defeated (or thought of as \"making trouble\") against the option for inaction, but five people expecting action will make inaction feel really awkward.\n\nGood luck!",
            "Gray rock her. Pretend she doesn’t exist. Wear headphones. Just ignore her. She’s a narcissist for sure and will poke and prod you to get any kind of attention. The less attention you give her the less of a “fix” she gets ",
            "This is a pretty outrageous person, but I’ll give you the benefit of the doubt that everything you said is true.  Even if your boss is a pushover, have you at least talked to your boss about her behavior? It wouldn’t be hard to put pressure on her over this if you keep trying to address it.\n\nThis co worker sounds very mentally unstable. Borderline Personality Disorder is my totally amateur diagnosis. ",
            ">If you don't talk to her, she gets her feelings hurt \n\nSo what? She can get her feelings hurt. I don't understand why you must accommodate her?",
            "You need to leave. I have a similar co-worker and I only survive with the help of headphones and we are sitting quite far from eachother.\n\nOne of my other co-worker commented once, that whenever impossible co-worker is in vacation she again learn it is not normal to leave work with a headache.\n\nIf the company hasn't fired her yet (which they should have a long time ago), they never will. It is not good for you psycological health to spend each day with a person like this!",
            "\"OK.\"\n\nThat should be your standard answer. Then ignore her. \n\n* Keeping the conversation short it key here. \n* No emotion, no exclamation mark (OK!!!), no disappointment, and absolutely no question mark (OK???). \n* What it means: I've heard what you say. I understand. \n* What it doesn't mean: I agree. \n* If she says: but you agreed (because you said \"ok\"), you can say that you said OK, but that OK doesn't mean that you agree. Leave it at that. Don't explain it. Keep it short. Don't keep repeating it. \n* Say it once, maybe repeat it once or twice, then leave it. Try it and see what works. But keep it short. \n* Don't burst out in an emotional \"I said it was OK!!!!!!!\" if she keeps annoying you. Just ignore her or say it clear to her face that you want her to leave you alone. If you do so, do it short, neutral. \n* If you feel really nervous or mad, don't do it, but go away. You don't want her to see that she got to you. \n* Emotions feed her. Don't feed her.\n\nAnd let her pout, cry, puff, complain. It's her way to pull you into another conversation, and when you react, you reward her, and she wins. It tells her that her methods work, and she will continue to use them. \n\nThere is one risk: this can all make your day at work still all around her. If you notice that your day at work is not about work but still about her, then that's not good. If because of this, all you do is think about how to react to her, then it's not working. Not all people can do this stuff. Plus it can get to you. If you don't get help from management, it's time to look out for another job. ",
            "I know the Myers Briggs assessment is out of favor these days, but if you had a similar kind of team training event where you all \"discovered\" and shared your personality types, you might be able to find constructive language to use as a reminder of \"I'm an introvert, and it's nothing against you personally but it's very valuable to me that you shut the hell up and let me pretend you don't exist for the rest of the day.\"",
            "Please don't blow out your eardrums. ",
            "I have musician's ear plugs that reduce volume, maybe you could wear those.",
            "This is painfully familiar. Reminds me of that 'toxic coworker' study",
            "The word for these people is incessant. Everything they do is incessant. All day long. It’s like having a constant humming noise in the background and not being able to shut it off. Honestly, this would push me to levels reminiscent of Michael Douglas in Falling Down. Truthfully there doesn’t seem much you can do. I would be putting feelers out for other jobs honestly. I can’t deal with this just reading your comment let alone every day. ",
            "Noise canceling headphones, also I would just tell her you aren’t interested in her personal life or her opinions. When she gets upset. So what. Ignore ignore ignore when she talks to you about bs, say nothing & go about whatever you are doing. If she doesn’t get it, is there someone higher up then your boss you can speak to about her doing nothing? ",
            ">I am at the point where I am considering quitting over her.\n\nIs it possible to communicate this to your boss? Like if she's a pushover, you can push her over :)",
            "I recommend some wireless noise cancelling headphones from Bose or Sony. Phenomenal noise cancellation, you may never hear her again at work and have 20-30hour battery life on one charge. This works great for me when I just want to sit and get hours of work done. I recommend you do the same if all else fails. \n\nBose Quiet Comfort 35 Series 2 (better comfort)\nSony WH 1000 MX3 (better noise cancellation)",
            "This could happen literally anywhere you got a job. I know you don't like her but there are worse people to work with from what you describe. I hope venting helped a bit but:\n\n1) Remind yourself you go to work for money and you could run across people you dislike/are annoyed by anywhere.\n\n2) If it was me I would just keep gently shutting her down with \"I'm sorry X, I'm not one of those people who can talk and work and I need to concentrate on this.\"\n\n3) Nearly every workplace has people with grudges/gripes/secret resentments about who does what. Focus on your own work. Resentment is a bad look on adults. But also don't cover for this person either.\n\n4) Is it possible your extreme annoyance and wanting to leave are the other way round and she's getting on your nerves a lot because you want a change?",
            "This sounds like my ex coworker who is 13 years older than yours. The description is painfully accurate. She talked about ANYTHING, knew EVERYTHING better, always tried to give me advice on anything (unasked for), and obviously everything I said was worth shit and she would make sure to lecture me (28M). It did snow over night? Streets were full, but in her region, the streets were UNUSABLE. \n\nAnyway, I've been through a couple of fights with her and witnessed more than enough fights with other corworkers. Especially since she's an eldery lady, women that were younger were a potential for crazy fights no matter what they did.\n\nOne of my then co workers, a 39 year old woman, basically did what had to be done. She ceased all relations to this woman, openly maintained a \"we only talk about work related stuff\" policy, and it worked okay for her. Obviously the other woman made a big deal out of it with words like \"unprofessional\" \"borderline bullying\" and all that stuff, but it was more like an investment. The first weeks were hell due to the gossip from Eldery lady, but it toned down significantly as people got more than bored with her shit. \n\nSo, my experience with that (very ery sad) kind of person, ignore her. Any kind of approach to her behaviour will only be met with blocking, justifications, exaggerations, blaming you for beeing mean, etc. - just ignore her and keep communication on a business level. If she goes at you with any kind of gossip or whatever, let your supervisor know immediately. And I mean that - people like her are batshit crazy and will go any way necessary to back up their stories, even by lying to the bosses and making themselfs look like victims.",
            "I stopped reading for a good 3 minutes.  (Laughed so hard) after I read “Dead relative?” Hers are deader 😂😂😂 \n",
            "That's nothing, I had a colleague who needed to one up everything you said way worse then your colleague. ",
            "1. “hello jenny how are you”- she’ll chatter for minutes uninterrupted, look at her intently while making a grocery list in your head or whatever, periodically interjecting a noncommittal “huh!” or similar \n2. Upon conclusion of dull/complaining story, “wow that’s unreal” or similar \n3. “Well, I should stop keeping you, good to talk to you”—-best way to end a conversation politely is act like you’ve been taking up their time\n\n",
            "Omg, that would make me lose it. \n\nEven if I have to do one shift with an extra chatty person, I can literally feel my chest tightening with exhaustion from fake-laughing and pretending I'm interested. It can get so bad I feel like I'm gonna have a heart attack, then I go home and lose my head... I get snappy and will most likely cry and/or punch pillows. I don't think some people realise what being talked at does to others, but you feel like you can't say anything because being social is \"normal\" and \"healthy\". But some people DO NOT want to socialize at work, and certainly not with somebody who never stops talking, whining and showing displays of strong emotion all the time. That's so inappropriate at work. \n\nCan you ask to be moved? Can you say it's because she won't stop discussing non work related matters all day and it's reducing your capacity to work? Or make up some other reason if that wouldn't matter to them... sun reflection giving you migraines... something... ANYTHING...\n\nIn my job, I'll usually only ever be working with 1 person, sometimes 2 if we have students/shadow shifters etc. It's either on site or in a vehicle. There can be a fair amount of down time sometimes, so naturally you talk to the other person. But I have 1 guy I normally work with and then 2 other women on a couple of particular days. But when I have to work with someone newer and they chat non stop, I feel so exhausted by it that it drains my energy for doing my actual job. I can really feel it. I guess it's because you're not being your authentic self when someone is talking so much or talking about annoying topics, to the point you have to be fake to be polite.\nSome people are energized by chatter and some are the opposite, and you can never change who you are in that regard. ",
            "I have a manager like this also! Anything you bring up, and I mean anything, she will relate it to herself somehow, anything and everything. The lady talks non-stop. We joke she should have her own talk show so she could just talk talk talk talk talk. Literally you don't have to say a word for the entire lunch hour and she will have an entire conversation all by herself. I can't stand her. ",
            "I know exactly how you feel. Worse part is you're stuck with this person on a daily basis!!! I just want to tell you you're not alone. Can't wait till the day my contract ends and I don't have to deal with people like this. ",
            "Sounds like Penelope from SNL!   ",
            "When they have been sicker, and all that, its called gatekeeping, have a look at /r/gatekeeping and I would call her out on it.   Just with a wry smile say, weird how you've always been sicker eh. ",
            "Anytime my friends try to tell me something \"important\" but I dont really care or I just want to annoy them I just say \"ok\" boringly while shaking my head a little to make it seem dumb.",
            "Oh man I feel so sorry for you. I had to quit my job once because of something similar. I hope you’re out of that shitty cloud soon in one way or another because it can be truly draining ",
            "This sounds like one of the coworkers she talks about on Permission to Exist on YouTube. ",
            "This sounds like Histrionic Personality Disorder (I am currently in school for psych). You need to set major boundaries with her; have a straight forward talk. ",
            "I used to work with a woman like this. It could almost be her you’re describing, except for the whole vegan thing.\n\nIf you showed her any kind of interest she would latch onto you, and pay you special attention. I used to sit directly across from her, she used to stand up and look over her screen and talk to me, when I clearly had headphones in so I wouldn’t have to talk to her. I couldn’t deal with it. \n\nSo I used to give one word answers, or just nod when she spoke, and I never ever asked her a question about anything personal, or she would think it was OK to badger me about something else. Ignoring her was the only thing I found really worked. \n\nBare in mind, this woman was in her early 50s, I’m 23. ",
            "I'm a little late, but I go to college for Behavioural Science. We learned about intervention strategies for problem behaviour like DRO. DRO is Differential Reiforcement of Other Behaviour. This is defined as, \"Reinforcing behaviour you want more of and ignoring other behaviour you want less of. \" (Imo) So my advice is to just give no enthusiasm and no attention. When she asks questions that pertains about you, then give everything by rewarding her with attention. Keep doing this for a bit and see if anything changes :)",
            "Unless it directly affects your work (ie her slacking on a project both of you are working on), don't talk to her more than you need to. Don't feed into it and she will get bored.",
            "Look for another job. That can't be tolerated.",
            "Inform your Manager that you have been having an intense migraine, that with her talking, makes it exponentially worse, and hard for your to complete your work. 'Noise in general hurts'\n\nRequest to be moved away from her. ",
            "Don’t try to be nice to her because it doesn’t look like anything you do goes over well anyway, so fuck it, be blatant about tuning her out. She’s gonna cry about something anyway, who cares.",
            "In terms of her insulting your decisions. I would set clear boundaries and tell her its none of her business. If she continues to argue, just walk away. Be assertive and not reactive. When people are above someone else they tend to ignore the perpetrators decisions because they couldn't care what the other person does. I think this is the best way to handle it.",
            "As above, but I would also document, maybe diary, to ensure no backlash from her and HR. ",
            "This sounds really simple but sometimes we just don't get along with everyone. The key to dealing with these people is to rise above them and not to sink to their level. The anthropologist idea is fantastic, noise cancelling headphones is another good one. I was in a job with an elderly gentleman who was much the same like your colleague, added in some extra bigoted comments about people's sexuality and ethnicity and Christian preaching and you'll get the general idea. Keeping in mind that I have mixed heritage, (Scandinavian/African) and i belong to the LGBTQ community, him and I did not see eye to eye.   \n\n\nIt was frustrating and my bosses would do nothing partly because of his age, they didn't see a point to it. If he started talking about inappropriate subjects or something that wasn't right for the office, I would change the subject or say \"I don't think this is appropriate office conversation\". My other colleagues weren't brave enough to stand up to him at first, but after a while they also started doing this. It took time but eventually he got the point.   \n\n\nYou have to be persistent about your boundaries. You don't have to get on well with your colleagues but you have to have  a comfortable working environment.   \n\n\nIf this doesn't work and there's an HR department at your work, go to HR. It's not petty if it genuinely effects your ability to do your job.\n\n&#x200B;\n\nGood luck OP.",
            "Request a meeting with your boss and request that one of you move your desk. It might hurt her feeling but who gives a shit you're there to do your job for 8 hours and go home, not to make friends (especially with someone you don't like). If that doesnt work tell your boss that you'll leave if accommodations arent made",
            "I think every work place has that one person who’s constantly one upping you no matter what you say. But I’m lucky enough to spend maybe 1 hour per shift with them, not stuck near them constantly. I would be ice cold to her... don’t engage, just ignore. Hopefully she eventually gets the hint. But I’ve finally learned not to let anyone I work with affect my mood, especially outside of work. I try to remind myself that everyone is different and in a work place there’s no way everyone can jive well and get along.. so I avoid avoid avoid, until I can’t. Then I just agree, don’t converse, and let them bother someone else. ",
            "Keep ignoring her and let the grown ass needy middle aged woman cry in work every day about it. She'll either grow a pair and move past it eventually, she'll despise you and won't talk to you or she'll keep crying and your boss and coworkers notice that she's crying all the time and it may draw attention to her. I'd ask to be moved or have her moved somewhere else if I were you too.\n\nI also had a woman who turned everything into a competition and was pretty rude to me, but she was a very insecure woman who I don't think had her life together yet acted like it was. She's got sacked now (yay!) but I just didn't share anything about my life with her so she couldn't try to 'beat me' at something or gossip about me to her teen daughter and family! She would brag and brag about her life and how amazing it was or tell very personal or inappropriate things about her teen daughter's life with us which I found very unprofessional, but I just nodded and carried on with my work. I totally understand how you're feeling. I have coworkers that drive me up the wall every shift! ",
            "Also invest in Bose noise cancelling earbuds ...all the silence without the volume ",
            "I've worked with this person and it's maddening. She was a grown child with all the tantrums that come with it. You could totally do all the things people have suggested, the problem is that you want to have a normal relationship with your coworker. It grinds your gears all day every day even though you can most likely avoid her or ignore her. You want to be able to have small talk but you can't. It takes a toll on your will power, which probably runs out by noon. I'm sorry you have to deal with this!",
            "Reading this freaked me out, because you just described my boss to a T ",
            "I like to use a myriad of Samuel L Jackson faces. No words. Or I just walk away rudely multiple times. Combine for a double whammy. \n\nI only utilize this for assholes, or drunk patients trying to punch me. It's about 70 percent of my human interaction though. ",
            "> I get constant commentary on my actions - especially with food (I am on a diet and SHOULD be). God forbid I don't eat the amount of food she thinks I should. It is like having the mother you never wanted telling you your not eating enough. OH...she is also a \"vegan\" (Except for the bacon she eats every morning). \n\nCoworkers who comment on your food are the worst. I've never been big on lunch, normally at home I won't eat lunch, and at work I'll just have some ramen noodles or something. I had a colleague who would criticise my lunch every day, saying things like 'you should eat healthy food' and 'that's so bad for you' while walking past. ",
            "God someone at work is very much like this. Negative Nancy. Doing somewhat tricky work the whole team needs to know about it for the whole day... Hope I find something useful here too. ",
            "Omg... sounds just like my office mate trish. I'm excited today because there was a 2 hour weather delay for school and it's likely she just won't come in because her crotch nuggets are the most important beings in the world, and even though 3 of them are over 13, they can't be left to feed themselves and get to school buses alone!! When she becomes intolerable I send an SOS text to a friend in our office and he comes in or calls my desk to say he needs my help with something. If you have any buddies in the office,  see if you can set up an SOS system  or have a non-work friend call you, and say you need to step out to take the call. The downfall is you're away from your work, but if you can take a laptop with you,  even better. \n\n I have also decorated my half of the office to establish dominance and I bring in baked goods for the larger team,  so I am the preferred member of our shared office. It helps deflate her a bit when people swing in to comment on the brownies and how fun my space looks and they just ignore her in her sad gray pity corner. \n\n\nMy go to phrase when she's on a rant is \"wow, trish, that sounds really intense, I just need to handle this [insert task] for the client, then you can tell me about it\"   usually that'll buy me an hour of silence because she'll reply back \"well, I'm super busy handling this [insert fake task] so I can't talk right now anyway.\"    If you have a one-upper, make her one-up you with work. ",
            "> Are you cold? Well she is colder. Are you sick? She's been sicker. **Family member died? Well hers are deader.**\n\nOthers have already given great advice. I just wanted to post how funny I thought this was!",
            "In Tina Fey’s book, she talks of a co-worker who was always argumentative. She found humour in it and you should try to do the same or else you’re gonna go crazy. ",
            "I had a similar problem and asked to move cubicles. I now sit on a different part of the floor than my old nemesis and it’s been life changing. I can relate to the Sunday dread of going in and seeing them. If my coworker wasn’t there at 9:01 am I’d hold my breath hoping they weren’t coming in, then feel so pissed off when they’d eventually walk in. It’s worth asking- if your boss is so conflict-avoidant as to not do anything about this coworker, then moving you might be worth not having to have a further discussion about it!",
            "My son is engaged to marry a woman like your coworker. Burns bridges everywhere she goes from the sort of behavior you describe. My son can see that people don’t like her, but defends it saying that they simply aren’t comfortable with a person who demands that others be at their best. Ugh......",
            "Had this situation before. As far as I know, you are required to do a job. You are required to interact with her for work related purposes. You are not required to be her friend. If her conversation/interaction it doesn't have anything to do with work, then say...\"This doesn't have anything to do with work.\" and walk away/ tune her out.\n\nEventually, this person complained incessantly about a \"hostile work environment\". After several group meetings, enough of the group banded together to state that she was the only hostile in the work environment; after which she no longer interacted with anyone at all. She was let go in the next reduction-in-force cycle.",
            "\"I'm busy right now, can we talk later\" ... On repeat in many variations. \n\nGet noise cancelling ear buds and just plug your ears shut even if you're not listening to music, I would even listen to lofi/productive minimal type music to help reduce the stress this woman is putting on you. \n\nAsk boss to move your desk maybe? \nWhen I worked corporate I would straight  up tell people I'm busy, come back later or to not talk over me to go to the kitchen or somewhere else to have lengthy conversations.\n\nThen I got a few work from home days and my productivity almost doubled. No distractions or silly office meetings/politics to participate in. I also then became a freelancer and that changed my life and that company could no longer afford my rates as o resigned and worked on a contractual basis and for other companies.\n\nMaybe put your CV out and go on some interviews, can't hurt.\n\nShe sounds like she is draining the life out of you, good luck.\n\nEdit: Also she needs to be told to mind her own business... I wouldn't euphemise it ",
            "I don’t have any advice for you, but I just want to say I’m sorry you’ve got to deal with such an unpleasant person. She sounds like an absolute headcase. Best of luck, OP. ",
            "Have you considered getting your writing published because you're hilarious ",
            "God damn, this chick sounds annoying. ",
            "Malignant narcissist. I am sorry! I truly, truly am sorry! I pray you find relief!",
            "You already have great advice here so I'm not gonna add on that, but you said that the noise annoys you. Have you considered noise canceling earphones?\n\nThey're great and you can get mediocre ones for like 70$/€",
            "> I wear earbuds but we are so close that unless I blow out my eardrums, I can hear all of this.\n\nDon't damage your heating over this.   Time to buy some noise canceling earbuds or headset. ",
            "Okay, after reading that, I hate her too, if that makes you feel any better. \n\nYou can document her poor work habits, paying special attention to errors, delays and any mistake that costs the company money to fix. \n\nYou can look for another position within the same company. Is there something else? Best case scenario, you get a promotion and become her boss. Heh. \n\nTry talking to your pushover boss and when she does nothing, go on up the ladder to her boss and so on. \n\nDo not bother with HR unless you find something that someone can sue the company over. HR is not in the business of helping employees. HR is in the business of making sure the company doesn't get sued. ",
            "Well, if you're already willing to quit over this, I say it's OK to test some new boundaries and see if it gets better. That said, when you first set these new boundaries, know that things will probably get worse before they get better. \n\nGrey rocking her is going to be a big one. Just \"uh huh\" and \"mhm\" and \"sorry gotta get back to work now\" in response to just about everything she says.\n\nWhenever you can, copy your boss on emails between you two, so they are aware of the situation to whatever extent they can be. Especially on follow ups between conversations where she's supposed to do things and you think she won't follow through. \"Hey coworker, just wanted to follow up on our meeting this afternoon where it was decided you would do X.\" And then confirm the email if it's something in advance. \n\nThere will probably be a bit of an extinction burst. Be prepared for her to go to your boss about your change in behavior. Don't tell your boss that you're grey-rocking her, just tell your boss you've been really trying to concentrate on your work. ",
            ">she is also a \"vegan\" (Except for the bacon she eats every morning).\n\nThis alone was enough to make me dislike her.",
            "Pick and choose your battles. Sounds like she is going to talk about you and piss and moan, one way or the other. So, why let her get to you?? Ignore her. Let he talk about you and your co-workers. You all know she's a toad. don't give her the gift of your attention.",
            "Out of curiosity, have you or has anyone ever called her out on the hypocrisy?  Bacon and styrofoam cups and stuff?  How does she respond?",
            "I had an incessant talker at work. She wasn’t a bad person, she just really liked going on about nothing all the time. I didn’t really know how to deal with her so at one point whenever I was done listening to the 4th repeat that day about how her future kids with her future husband might turn out ginger despite her being a dark Italian, I’d just start putting headphones on my head. She got the hint and got better about it eventually (mainly we moved offices so we don’t share anymore, but I’m one of the few people she won’t visit in another office just to talk at now).\n\nIf you want a recommendation for some great noise cancelling headphones, I really like the Sony wh1000XM3, Bose QC35ii is also decent. If you’re on a stricter budget, Sony h.ear on 2 (WH-H900N) are much cheaper and aaaalmost as good.\n\nAll of the above are large over ear “fuck off Karen I’m working don’t bother me” headphones, as well as being able to reduce the noise from Karen’s loud ass phone calls.\n\nHave you complained to your boss that she’s on the phone all day? Maybe request to move to a *quieter* desk?",
            "So, I had an insufferable asshole know-everything jerk (being nice here) for a cubemate for a few years, he was the male version of this.\n\nTwo things that worked for me.\n\nOne, big massive fuckoff headphones.  We call them fuckoff headphones because when you wear them, it sends the signal to others to literally fuck off, I'm busy.  If she keeps interrupting you with your headphones, you can say something along the lines that you need the sound isolation, and when you have these headphones on, to leave you alone.  I had to tell a few people including him that the headphones mean don't bother me.\n\nTwo, don't speak to her.  First tell her you're not going to argue with her, or some way tell her she's not invited into conversations just because they occur within a 10 foot radius of her.  Then ignore everything she says.  I dealt with my annoying coworker like this.  A few times I told him this conversation wasn't his concern.  He didn't take the hint, and would butt in all the time, so I would talk over him when he jumped into a technical discussion that didn't concern him but occurred within earshot of him.  After a few days of that, he got the hint, even though being polite didn't work.",
            "I'm new to how to deal with difficult coworkers so I feel your pain. I don't think gray rocking works on coworkers as they think ignoring is rude. So try an alternative like only talking to her she has to do work related to you. Ask her feedback on her opinion on tasks, and see if you can get her to do her work that way. \n\nThe other thing is looking busy and just not being as available to her. Tell her your working on something and have to concentrate to get something important done. So both boundaries are an absolute must. Also is one reason why I don't like small offices, too much in your business.\n\nI wish you the best of luck, I think you need to just readjust your responses and make it set stone (don't worry about her reaction, your goal is to put a lock on her).",
            "You need to use your employment as leverage\n\nFind a palatable way to phrase it to your boss that this person is making your work experience unejoyable to the extent that you are reconsidering working there altogether. If your boss is worth a hill of beans, they will let the incompetent and cancerous employee go to save the good one.",
            "There are a lot of fabulous comments here about how to grey rock this narcissist.  They are all worthwhile.\n\nIf I were you, I would do all these things plus look for another job.  Grey rocking someone is tiring and not really a great way to live.  Even if you can keep her on the range, you're still missing out on the opportunity to work next to someone (at another job) who is fun and interesting and brings positive energy.  My 2 cents.",
            "I work with someone who's luckily really sweet, but she does talk almost constantly.  It's like the internal ticker in her brain just all comes out of her mouth.  It's so exhausting.  When I can't take it anymore, I put on my noise cancelling earbuds and tell her to \"wave\" if she needs me.  She goes \"okay bye!!!\" and I usually get 45 minutes or so of peace before she finds some \"emergency\" to interrupt me with.  That helps keep me sane, but I'm also job hunting lol.  ",
            "It helps to have somebody to vent to. I don’t mean a coworker of course but an SO, friend of family member you can call up and say “you won’t BELIEVE what she did today!” Having somebody you can laugh with about the absurdity of her comments makes it more amusing and less frustrating. I had a coworker I hated and I tried this. Soon I was eavesdropping on their conversations so that I could run home and tell my husband another funny story about them. ",
            "[deleted]",
            "I say fair enough. It works well and it's almost an answer to everything.\nI use it when I either don't know what to say or I don't care.",
            "Gonna play devil's advocate here. defs gonna get crucified.\n\nI can guarantee you that your boss isn't doing anything about your coworker because this is the type of shit that a boss can't do anything about, and nor should they. \n\nSo, your coworker is a chatty in the worst ways. So what? Are they a bad/evil/malicious person? Does your coworker steal? Physically abuse you? No? Then it's you, OP, that needs an attitude adjustment. Take this opportunity to learn how to be a social chameleon, to get along with everyone. It'll make the workplace better, and will make you a better person for it. \n\nIs she disruptive and interrupting your work day? Learn how to handle those situations tactfully, and politely. If that doesn't work, try smth different without being mean to them the next day. You'll figure it out. But adjust your own attitude, because you can only count on yourself and your own actions and opinions to actively change to make this (and any) situation better.\n\n",
            "My first thought was::: tell her what a crappy day it is outside, maybe she'll say it's a nice day.\nMy second thought was::: tell her it's much too quiet in the office and you wish she would talk to you more. I dunno if any of that works, but that's what came to mind.\nAnd, don't quit your job. You probably need that job even if she lives another hundred years. Keep looking for answers. Save the extreme measures for later. Give yourself time to let your mind find the correct answer.\nAnother thing, and this is a stretch of my imagination for sure::: maybe ask her to hang out after work one night. see if you can find something you like about her, and then try to get her to develop that thing, whatever it may be. she might need a hobby, something to fill up her mind with besides gossipping and yaking.\nAlso!! ::: maybe if she develops trust in you, you could start recording her and then in a week or so play it back. Make her listen to herself. She might start to hate her own voice if she has to hear it the way you do. Might cause her to want a personality  makeover.",
            "OP- \"Why cannot I not stand her.\" \nSo you can stand her?",
            "Either confront her or shut up about it. "
        ]
    },
    {
        "post_id": "4jimdo",
        "author": "Whatdoesamomwear",
        "title": "My husband (32/m) is upset that I (31/f) don't look more like a mom Part Deux",
        "url": "https://www.reddit.com/r/relationships/comments/4jimdo/my_husband_32m_is_upset_that_i_31f_dont_look_more/",
        "score": 2418,
        "num_comments": 178,
        "created_utc": 1463355829.0,
        "selftext": "OG: https://ud.reddit.com/r/relationships/comments/4i1s45/my_husband_32m_is_upset_that_i_31f_dont_look_more/\n\nI had no idea my post would get so much attention. There was a lot of really solid advice (and one creepy PM warning me that by dressing in business attire and wearing lipstick and heel I was being overly sexual around my child and that would turn my son into a serial killer. Stay gold, reddit)\n\nA couple of clarifying points\n\n* My MIL did work when my husband was growing up, she just did not have an office job. She works in a medical field and wears scrubs everyday. When she's not in scrubs, she's in sweatpants. Seriously. For our wedding, his family started a pool about whether or not she would wear sweats to the wedding.\n\n* I did not suddenly get sexy after my son was born. I was slightly overweight before my son was born and I'm back to my pre-baby slightly overweight shape.\n\n\nNow the update:\n\nDan and I went out without our son so we could talk. I told him that I was confused by his comment and I wanted to talk about it. I asked him if he could name specific things about the morning routine that made him feel as though our son was neglected. I offered to \"switch shifts\" so to speak if he though our son should have more AM parent time. To make a long and confusing conversation short- Dan's confused by the fact that I got over my postpartum depression and am back to normal now. For some context, my PPD never made me question whether or not I loved my son or made me feel like we never should have had him. My PPD made me feel like I was constantly failing my son, that I wasn't good enough to be his mom and that he deserved better. There were a few times I broke down and started crying and would tell Dan that he was so much better at being a parent than I was and that our son didn't deserve to have a shitty mom like me. Luckily, I have an amazing DR who recognized that this wasn't just baby blues and helped me get the help I needed. It could have been much worse.\n\nBasically, Dan only felt like a good parent when I was failing and telling him that I was terrible at it. Now that I'm doing better, he no longer feels like a good dad. It's shitty, but we're staring couple counseling, I'm continuing with the counseling I started for my PPD and Dan's going to see someone too. We're going to figure it out. And I'm still going to wear heels to work even though it's going to turn my son into an axe murderer.\n\nTL;DR- My husband felt inadequate once I dealt with my postpartum issues and tried to undermine me to feel better. We're getting counseling and my baby is going to be a serial killer.\n\n\nEdit-words are hard.\n",
        "permalink": "/r/relationships/comments/4jimdo/my_husband_32m_is_upset_that_i_31f_dont_look_more/",
        "comments": [
            "It seems like Dan has issues of his own that need to be addressed. It's pretty common to feel like you aren't doing a good job with your new kid, but when he had you reassuring him that he was an amazing dad all the time (just to clarify, don't change a thing, this isn't your fault) he felt like he had it together at least to you. Now that you aren't struggling, he probably compares himself to you and thinks he's lacking. There are other explanations obviously, but that's a very common one.\n\nI'm glad that you both will be addressing this in therapy, and I expect you'll see improvement soon. :)",
            "Solid update; I'm glad he could articulate his feelings and is so willing to get help. Also, props to you for being so on top of your PPD!\n\nThe only remaining mystery--what did your MIL wear to your wedding?",
            ">We're getting counseling and my baby is going to be a serial killer.\n\nThis seriously cracked me up.  I'm so glad you and your husband talked and that you guys are moving in the right direction =]",
            "It sounds like you have a strong sense of self and a great sense of humor. Your baby is going to be just fine.",
            "[removed]",
            "> We're getting counseling and my baby is going to be a serial killer\n\nCongrats!",
            "Sounds like Dan needs a counselor to work some shit out. \n\nGood for you being the smart, hot mom. He should be on his knees thanking whomever that you didn't develop Golden Uterus syndrome. ",
            "Keep up the good humor, and best of luck with counseling!",
            "I still find Dan's behavior strange... but I'm glad that you are both seeking counseling for your issues. Good luck!",
            "[deleted]",
            "...well that took a weird turn.\n\nI'm glad you got to the root of the issue. I really hope you can work through it together. Best of luck OP, keep being your fabulous self!",
            "[deleted]",
            "WebMD says men can get postpartum depression also. Maybe he is one of the people who suffer from it.",
            "> I'm still going to wear heels to work even though it's going to turn my son into an axe murdered.\n\nHahaha love it!",
            "For Christmas baby gets his first machete. :) ",
            ">My husband felt inadequate once I dealt with my postpartum issues and tried to undermine me to feel better.\n\n\nThat's pretty shitty behavior. Glad he at least owned up to it and is seeking counselling for it. Still, real shitty way to treat the mother of your child in order to feel better about yourself. \n\n\nWhen you were down, you built him up. When he's down, he cuts you down further. It's not just a different philosophy, it's a different kind of partner.",
            "> Basically, Dan only felt like a good parent when I was failing and telling him that I was terrible at it. Now that I'm doing better, he no longer feels like a good dad\n\nA sign of good parenting. Counseling will prevent it from becoming a toxic pissing match over who is the better parent, but the fact that he feels like he's not a good parent unless you tell him he is means he actually cares about being a good parent. Hopefully through therapy you guys can learn to build each other up and work together. Good luck OP.",
            "It would be much better if he grew up to be an axe murderer, than axe murdered, if you had to choose.",
            "I'm someone that has to wear a uniform to work, it's jeans instead of sweats for me. I totally feel for his mom, haha.\n\nPretty lame of him to rip you down like that for his own ego but it's neat that you two identified it together and are getting counseling for it. Depression has an effect on more than just you, it can really affect your partner as well, as you see now. You guys are gonna be fine. Good luck raising your own little Zodiac Killer. :)",
            "He feels your competency robs him of his.  This is definitely something to tackle in therapy.",
            "Glad you both figured it out and are getting counselling.   I'm sure you'll both getting over this and be awesome parents to your son.",
            "\nBelieve it or not having a baby , you lose your freedom and life as you know it. We grieve that loss. It's normal, but taboo to talk about it. Even if you planned for your bundle of joy and love this child like no other, part of you died inside. But then you emerge out of it with so much clarity\nHave you discussed the fact that you are grieving ? It doesn't make u a bad parent\n\nAlso according to the PM u said u got, my kids should become serial killers.   So far so good with my kids.  Love my heels and lipstick and work!  And my honor level kids with a nice small group of friends, who are world travelers and who got to meet a president Today (we all spoke to him and shook his hands ) rest assure that ur kids will come out fine\n\n\"If you were listening to today's political debate, you might wonder where this strain of anti-intellectualism came from . . . In politics and in life, ignorance is not a virtue,\" Obama ",
            "My mom always wore fashionable clothes and heels to work when we were little, and I can confirm my brother and I are both successful axe murderers. Not the most steady flow of income, but we make do ;)\n\nOn a more serious note, good for you for talking it out and getting professional help on this matter! I hope everything works out for you!",
            "Good talking about it!  Also, perhaps it needs to be said that even though you became a mom, you did NOT thus become just like his mom, and you will mom in your own way.",
            "Do you mind if I ask how you were able to treat your PPD? I am having my first child soon and curious and a little worried about having issues myself. (If too personal, no worries)",
            "I love this update!\n\nAnd I hope they make a cewl movie about your son's future exploits. Try working out an interesting MO. ",
            "And here I was wondering how a mom Part Deux looks like.\n",
            "I did not realize this was an update and spent way too long wondering, \"What is a 'mom part deux?'\"",
            "You sound amazing. Keep up the mental health work and keep on being awesome and rockin' those heels. ",
            "Start off by getting your son a hatchet.  He's way too young to handle an axe.",
            "I'm not sure I could handle being married to someone who willingly undermined me in every way to make up for their own short comings. \n\nBut I wish you the best of luck. I hope we won't be getting a bad news update.",
            ">Basically, Dan only felt like a good parent when I was failing and telling him that I was terrible at it. Now that I'm doing better, he no longer feels like a good dad. \n\nJeez. The feelings there are not uncommon, but taking it out on you and making up crazy accusations that you're a bad mother so that you'll keep on feeling like a bad mother--that's terrible. I'm glad you two are getting counseling, as that's about all you can do in this situation. ",
            "He has the same attitude schoolgirls have when they bitch about other girls, making themselves feel better. And the little spark of joy I get when my bf talks about the shit his ex did. Extremely unhealthy and immature way of looking at the world and he needs help. ",
            ">My husband felt inadequate once I dealt with my postpartum issues and tried to undermine me to feel better.\n\nSo your husband was emotionally abusing you. This is really messed up. ",
            "So he only feels like a good dad when you're failing?\n\nHe sounds like a giant turd",
            "Dan only feels good when you verbally praise him and when you were not your normal state of self. \n\nThat sounds like way deeper than marital issues. He has self esteem issues that would probably be best solved individually, like an actual psychiatrist.\n\nGood for you for both of you getting counselling! Dan sounds strange. Be wary!",
            "Just curious because I'm trying to conceive... your doctor recommended counselling for PPD?  I thought it was a brain chemical thing and most people just got drugs.  ",
            "Good luck. Hope it all works out. Sounds like Communication has opened it all up which should  alow the issues to be solved.\n\n  ...and I hope your Son isn't called Dexter :)",
            "Good update, glad you are both on track. I think Dan has other issues going on with such a strange complaint about you looking after yourself and the baby in the mornings while he gets the opportunity for a lie in as it were.\n\nI only say this as a relatively new father myself I can't fathom what he's going on about. It is like complaining about eating chocolate cake but it taste too good! The chocolate! Its too bloody nice!  Y'know?",
            ">(and one creepy PM warning me that by dressing in business attire and wearing lipstick and heel I was being overly sexual around my child and that would turn my son into a serial killer. Stay gold, reddit) \n\nFucking mental! hahaha\n\n>Basically, Dan only felt like a good parent when I was failing and telling him that I was terrible at it. Now that I'm doing better, he no longer feels like a good dad.\n\nIt sounds almost like he's viewing in competitively in a way. I don't know if you two are quite competitive with each other [I know me and my husband get quite competitive with stuff] but I imagine that it must get hard when you have a kid to both be the best parent you can be. You aren't actively trying to \"out-parent\" each other or anything, but I imagine you compare yourself to each other regularly even subconsciously - not in a \"I want to be better than you\" way, just in a \"I see you are doing so well and I don't feel I'm being as good so I need to step it up\" type way [although I could be totally wrong, I have no kids so what do I know! I'm just basing this on how I imagine it feels]. Glad that you two were able to talk it out and it seems like you're taking all the right steps! Best of luck!",
            "Can you maybe just throw in a \"here's baby to the best dad he could ever get!\" When he takes over? I know I like to hear that I'm a good mom occasionally, may make him less of a jerk. Lay it on thick until he realizes how much that comment was out of line?",
            "Fathers can come down with something like ppd. It's rare but it usually follows those who also get pregnancy sympathy emotions as well.",
            "This is a good update. Talking things through is wonderful! Good for you both, and best wishes. ",
            "I may be vastly oversimplifying this, but, it sounds like he might be seeking more verbal validation from you that HE is being a good parent.  Is it possible he just did it in an overly complicated (and seriously misguided) way?",
            "Oh I'm so happy you updated this! I commented on your last post and I've been thinking about you ever since. I'm so happy your husband is willing to get some help for this too. I think daddies' feelings about babies tend to get pushed aside. We're the ones with the hormones that do quite a bit of the heavy lifting. We have Dr.s looking out for us and ppd is talked about more than ever. I bet its really scary for dads to be providing and getting used to life with baby and new identity as a dad too. And because of gender roles and all that they probably feel like they can't show it or ask for help and reassurance. You sound like an excellent wife and mother and I'm so glad you have a partner that's willing to take steps to better support you :)",
            "This is a shitty situation, but are you sure it's not just that he feels most like a good parent when you actually tell him straight out? Maybe he needs that bit of extra validation? Perhaps it's not that he only feels good when you are failing.",
            "hey, what you do you know? Convienenty left out information that completely changes the context of the previous post. Might have been helpful to know all this...seems pretty freaking relevant.  \n\nAll I kept thinking with the old post...'Theres some more information that we're all missing\".\n\nNobody can offer effective advice if the don't know the whole story. "
        ]
    },
    {
        "post_id": "3pw5hj",
        "author": "tinderfailure1",
        "title": "UPDATE 2: I am a 21F that has had Tinder for 6 months and zero matches.",
        "url": "https://www.reddit.com/r/relationships/comments/3pw5hj/update_2_i_am_a_21f_that_has_had_tinder_for_6/",
        "score": 2415,
        "num_comments": 176,
        "created_utc": 1445598191.0,
        "selftext": "OP: https://www.reddit.com/r/relationships/comments/3piyuj/im_a_21f_that_has_had_tinder_for_6_months_with/\n\nUpdate 1: https://ud.reddit.com/r/relationships/comments/3plw8j/update_i_am_a_21f_that_has_had_tinder_for_6/\n\nWell, I restarted my Tinder profile yesterday and already got a couple of matches.  I don't know if the first profile just wasn't working or if Reddit just came to my rescue, haha.  Doesn't really explain the lack of OKC success, but I'm planning to start that up again too.\n\nThe main thing was that I talked to my friend.  I asked her for some advice on how to fix my looks.  She was really, really harsh about it.  She said it was doubtful I could fix things, that she felt sorry for me, that escorts were expensive but she'd front me the money if I wanted to lose my virginity (WTF?).  I decided I didn't need her in my life.  It sucks, because she was pretty much my only friend.\n\nI gave myself a look in the mirror and decided that I'm not all that ugly.  Sure, I'm not beautiful like my friend is or like a lot of girls on this college campus, but I'm okay.  I'm a good person, I have something to offer, and I'll just keep searching.  There's no point in crying over the opinion of someone mean like my friend.  I may not be a fitness model or beauty queen, but I'm okay.  \n\nI had a conversation with one of my Tinder matches and he seems genuinely nice, so I'll see how that goes.\n\nI am going to put in some more effort into my face and body.  I think exercise would help me.  I'm not about to sculpt myself or anything right now, but jogging a few times a week seems like a good start.  And I'm about to go to the drugstore and buy myself a couple more pieces of makeup, maybe a new cardigan or two.  We'll see how it goes.\n\n  \n**tl;dr**: Friend was a bitch, found a couple tinder matches, going to try to be comfortable in my own skin.",
        "permalink": "/r/relationships/comments/3pw5hj/update_2_i_am_a_21f_that_has_had_tinder_for_6/",
        "comments": [
            "I'd check out some of the helpful subreddit i.e r/thegirlsurvivalguide r/makeupeducation r/getmotivated r/sugarfreemua \n\nIf your willing to put up a picture of your face asking for tips in makeup education page of something that would likely be a good start, though you might get some hate I think you're strong enough to ignore it and get some great advice from impartial anonymous redditors. \n\nGood luck and I'm glad to see your on a good track! \n\nEdit: spelling mistakes ",
            "Great to see that you ditched her, she seemed more critical than helpful. That escort comment was way out of order too. \n\nI'm so glad that things are looking up for you, and I wish you all the best for the near future :)",
            "[deleted]",
            "Good for you!   At the end of the day you want someone who wants you for all that you offer.  Not just looks.  Personality, integrity, compassion and intelligence is what helps build a lasting relationship.  Not cleavage and a perky ass.  While you are dating do not sell yourself short or accept treatment that is less than what you want because you're afraid you won't find another.  You sound great, good luck!",
            "That's nice to read!\n\n\n*I may not be a fitness model or beauty queen, but I'm okay.*\n\nI think this is very important. Listen, I do not know how you look like, so I won't make any comments like \"You are beautiful\". Eventually, it doesn't really matter, really.\n\nWhen I was younger, I was obsessed with not being pretty enough. And I thought, if I just got prettier, everything would be alright. I surely am not a conventionally beautiful girl, but much, much prettier. And guess what? It didn't solve anything.\n\nSociety makes you believe that everything is or can be beautiful. I don't think this is true; but I think that it does not matter. We make \"being beautiful\" a much more important trait than it actually is. I mean, it's mostly genetics, really.\n\nThere are things we have control over. Whether we are kind, open- minded, ambitious, sympathetic etc. Those are things to be aware of.\n\nI hope you find a way being comfortable in your skin.\n\nI personally still like to indulge in \"beauty stuff\". I like learning new stuff about make up, or buying new clothes where I feel \"pretty like them\". Because it makes me remember that they are not better than me. And it is not about being better anyway, but.. You are good enough the way you are.\n\nI hope actively doing something for your body will help you feeling more comfortable in your skin. Maybe it'll have the side effect of people becoming more aware of you, but even if not- this is about you, not about them.\n\nI don't know whether you are beautiful, but I know that you are great and that you are good enough the way you are. And I hope you learn to see that, too!",
            "I'm glad that things are looking up for you, you do you :)\n\nPs: I still think you're pretty",
            "I'm glad you posted an update, I have been thinking about this since I read your first post.\n\nI'm not a particularly attractive person - not repulsive, but definitely not pretty and also kind of butch, and really not photogenic at all. When I was maybe 19 or 20 (like, more than a decade ago) my favorite uncle said something that really stuck with me - he said it about someone else, but I sort of think he meant it about me too. As a casual aside about another girl of similar age, he said \"Yeah, she hasn't really grown into her looks yet, has she?\"\n\nThe point being that you get what you get, bone-structure-wise, and if you don't win the lottery there (or if you get something kind of weird), it can take a while to figure out how to optimize what you have. Whether this includes makeup, or hairstyle, or just what kind of expression you tend to have on your face.\n\nExercise is great because muscle tone and good circulation will make you look better and feel happier. Running is fine, but doing a balanced whole-body workout is better. Like a Jillian Michaels video, she's got some short ones. Or Nia Shanks has some stuff.\n\nEating a good diet is good too - again not necessarily for \"weight loss\" per se, but for general health. People seriously look different and better if their nutrition is better. I'm sure you've seen people who are heavier people but beautiful and glowing with health, and also people of various sizes who are flabby and kind of grey and unappealing.\n\nProfile-wise, I would focus on pointing out what you are bringing to the table. Going on dates, I would focus on remembering to cultivate an actual interest in the person you're on a date with, even if it only lasts through coffee. It will be more fun, and also more likely to lead to more dates.\n\nsource: not pretty, got plenty of guy attention, happily married to a catch",
            "She was not your friend but just using you to make sure she gets all the attention. Good on you for dumping her. Removing her from your life will improve your self-esteem and confidence.",
            "It's good to hear that things are looking up :) \n\nThere are definitely a lot of guys that I know, who care a lot more about how awesome a girls personality is than her looks (although I'm sure you look stunning :) ). People who are transitioning out of teenage hood can be quite fickle; but the right guy is definitely out there! Good luck :)",
            "I know that this seems like a lie, but really, looks aren't everything and depending on the outfit, makeup, confidence and other factors, almost any person can be either a 4 or an 8.\n\nFirst of all, being sexy is an attitude. It's far more of an action than it is a quality. I often marvel at my SO's ability to just make me crazy for her.\n\nSecond, start looking for people in places that makes it more likely to connect, based on your personality and interests. I met my SO while starting my engineering degree and it makes a lot of sense that I met an awesome girl who is smart, likes gaming as much as I do and has a deep personality in there. Certainly, it would have been far more unlikely to meet her in a bar, mainly because *we both don't like going to bars*.\n\nThird, Kudos for ditching your shitty \"\"friend\"\". Time to make new ones. There are a lot of people who are not that bitchy or that shallow.\n\nFourth, is a great thing to put effort in yourself. Being healthy and toning your body a little is great. Just don't bother in becoming someone you are not. If you act like yourself, you will find people who likes you for what you are. That is the best you can hope for.",
            "Good update, I'm glad things are looking up. I'll give you a bit of advice though about weight-loss. You don't exercise your way to fat-loss, just like you can't diet your way to fitness. \n\nWeight loss is really just about diet. Running a mile burns about 100 calories, that's around 2 Oreo cookies. You can see that if you want to lose weight you aren't going to do it by running. As far as diet goes, I like /r/leangains some people like /r/paleo or /r/keto. \n\nBest of luck. ",
            "Check out /r/makeupaddiction \nThe people on there are so nice and helpful. They'll give you great tips, judgement free. ",
            "I know you said you were intimidated by r/makeupaddiction but I promise if you post asking for help and basic tutorials they will be happy to assist you! \n\nAnd great idea jogging. If you're not good about self discipline think about joining a running club! \n\nAlso. Who doesn't love a new cardigan? Go girl!\n\nBut the important thing to remember is that all these things are going to do WAY more for how you feel than how you look. And that's ok! You have to love yourself first. \n\nGood luck with those tinder matches! Keep trying ",
            "It's going to be much easier for you to address whatever issues you have with your appearance that it will be for your ex friend to address that black pit of hers that she calls a soul.\n\nI love your can-do, positive attitude.  You're going to do well.",
            "Don't start with the drug store make up, go to the department store and ask someone at a counter for help. They will teach you how to properly apply make up along with finding the exact colors that go with your skin tones. Usually they will do a full make up application for you for free, but will expect you to purchase product. Don't feel obligated to buy everything they use. \n\nEdit- spelling",
            "Whoa, escorts?  What?  Um, you do not need that biotch in your life, you're right!  Good for you for getting rid of that baggage!\n\nNow.  Can we talk makeup?  Because I freaking love makeup.  I love the textures, the colors, the sounds the little plastic cases make when they click together...LOVE IT.  I don't wear it on a daily basis because I love sleep more than I love makeup, but when I really want to indulge myself and feel super beautiful (I have meh/okay looks, really), I pluck my eyebrows and put on a subtle face with some fun eyeshadow and I feel like a million bucks.  I would love, love, love to chat with you about it!",
            "Get fit OP.  Not only will it help in the attractiveness area, but it also demonstrates a capacity for self-control, discipline, and a healthy lifestyle.  You'll also feel loads better from the endorphins, and probably meet new people at the gym.  \n\nGlad to hear your having some success now.  Even you're only getting a trickle of interest, don't sell your short for a creep.",
            "Awesome! Tinder came through for you! :D just remember if it doesn't work out with this guy there will be others.\n\nI bet if you join a club on your campus you can find a few new friends, too. It's KEY to find people who are kind and who support you. Nearby or even on the internet. \n\nYou can do this - get fit, find your own style, celebrate your beauty and enjoy being YOU. I'm so glad you're not letting the bastards get you down anymore. ",
            "WTF? I don't think that person was ever your friend. Sounds like she needed to put you down to feel good about her own shitty self image.",
            "Some of us don't photograph well. Consider getting a professional photographer to take a good pic of you to use on Tinder. Frontal shots usually don't look that great, but a three quarter view does. Maybe you have a friend who is into photography and can do this for you.\n\nAlso consider something like meetup.com where you can join some clubs and meet people in person. Personality trumps looks. But it helps to dress decently and be groomed. Don't overdo.\n\nGood that you're starting an exercise program. It will boost your confidence. If you join a gym you might get to meet people. ",
            "For whatever it's worth, I think the internet dating just kind of comes and goes in waves. I'm a 30M and I've been using OKC on and off for like 5 years, Tinder for six months. I'll go through stretches where nobody \"likes\" me, nobody chooses me, and nobody responds for my messages...only to be followed by a period where I'm kind of overwhelmed with matches.\n\nIn six months on Tinder I only had like four or five matches and nobody wanted to actually have a conversation once we were matched. However, in the last two weeks I've gotten eight matches and have met up with three people. No explanation as to why it was not happening for so long, nor for why it suddenly started happening.\n\nI guess the bottom line is that neither service is a reliable indicator for a person's worth or attractiveness. Focus on being happy with yourself for yourself and the dates will follow. Good luck!",
            "I didn't see your OP or update back when you posted them (I've read them now) but I'll give a little unsolicited advice. Regarding exercise: I don't know about you, but I think running is just about the worst thing ever. The way I got into shape was rock climbing (there are indoor gyms and your school may even have their own rock wall. It is wicked fun it hardly feels like a workout and works so many muscles (legs, abs, back, arms). The great thing about it is anyone of any ability level can do it because the routes are graded according to difficulty. It's also a great way to meet people.\n\n\n\n\nMakeup: I always thought my makeup was fine, but I learned some tips and techniques by going to Sephora (other places probably offer the same or similar services). Sephora has this cool thing where they use a scanning wand to figure out the exact skin color you have, then it matches to foundation colors that they sell (so go with no foundation on). Also if you spend $50 there they'll do your makeup where they do one half of your face and teach you how, then you do the other half to practice. Go in and take advantage of the sales people - in my experience they are helpful and not pushy, just tell them what you are looking for, and if you don't know, just admit that \"I'd like to start using makeup to better compliment my features but I don't know where to start.\"\n\n\n\nI'm glad you cut that mean \"friend\" out. Friendships should make you feel better, not worse.",
            "Just remember that, while people do find relationships on Tinder, it's not exactly designed for that and may not be the best place to look for a meaningful connection with someone. Best of luck!",
            "[deleted]",
            "Tinder isnt a good place when youre below average. They literally rate you based on your looks there. I think you should try proper dating sites",
            "Now you know how a very large portion of men feel.",
            "You asked her to be brutally honest and then got mad at her for her comments?",
            "Just wanted to chime in saying I'm so glad you've posted an update to let us know you're doing better! I saw your previous posts and was concerned for you, as your friend seemed to just be overly harsh and unhelpful.\n\nBest of luck OP, hope some good romance is just around the corner for you.",
            "Really pleased you're taking positive steps and that you got rid of your mean friend. \n\nI've always been a firm believer in it being personality you fall in love with. Yes, a lot of the time it's on packaging that attracts the eye but it's the personality that keeps you interested. Your friend is a good example. By her standards she's good looking but her personality is butt ugly.  \n\nYou sound like a lovely person and very humble.  Read any amount of fashion or beauty articles etc and they'll tell you how to maximise your assets. Find clothes that match your physique, hair style that matches your face, make up that compliments your colouring etc.  \n\nI've met many people who I thought were a bit below my physical standards on initial meeting but found them to be great people and that alone made them above average attractive. \n\nYour friend can go to hell with her unhelpful comments. \n\nGood luck. ",
            "Good to see you're working on yourself. What one may lack in the looks department, one can make up for in their personality. And being a good person is DEFINITELY helpful. \n\nAll the best. :)",
            "Great update! Glad you got rid of that \"friend\" and glad you are still trying and even getting some matches with the new profile. Good luck to you.",
            "Great update!  Beauty is in the eye of the beholder.  I think you're doing the right thing: cutting out a \"friend\" who brings you down and focusing on looking your best in a way that is comfortable to you.\n\nI see so many women these days with tons of make-up, fake hair, fake tans but they still look ugly to me because they are mean, superficial and shallow.  There is nothing wrong with taking care of your body but real beauty comes 100% from within.",
            "Is there a sephora near you? They can teach you how to put on make up and then you can go and buy cheaper stuff at a drug store. All the makeup in the world won't help unless you know how to use it. Also r/makeupaddiction is a good source for good products and tutorials. Another good source of help is r/skincareaddiction. ",
            "OP, I'm so glad to hear all of the things you posted.\n\nFrom the original posts, your 'friend' seemed very toxic -  she never once offered a suggestion on how to help you, only reinforced an idea (only an idea, not at all a truth!) that you were unattractive. We've all had to learn who makeup, clothing, hair styles, ETC will accentuate our features, and some people start learning a little bit later. There is **nothing** wrong with that.\n\n You sound like a good person - which makes you truly beautiful. :)\n",
            "Hey, ,I'm like 40 and. Have been on tinder and every dating site for 3 years , i be never ever had a match, ever, so yeah I'm like you times 1000",
            "'Friend' seemed horrible, you dont need people like that. Honesty is good and all but sounds like she was just plain fucking rude. \n\nExercise is a 100% effective way to make yourself more attractive. ",
            "OKCupid actually has a blog where they sometimes discuss ways you can improve your profile. I don't think I can post links here, but just search for \"okcupid photography\". If you search with or without the quotes, the top result is a different blog post about how you can have more effective pictures.",
            "I didn't see your first two posts, but I think you can kill several birds with one stone. Join a dance class. You'll get exercise, it will get you out of your comfort zone for a while, you'll meet men, you'll hopefully find you enjoy it, you'll learn a new skill and it will help you feel good about yourself. It certainly helped me a while back.",
            "You go girl! Kudos! Is nice to have friends who tell the truth, but there's a fine line there where that friend is just too pessimistic to add anything positive.",
            "You're a hero, good job getting rid of her. I loved reading that you took a good hard look at yourself and decided she was wrong! You're the only person who is sure to be with you all your life, so self-acceptance is really important. Ihope all goes well for you here on out.",
            "Very happy to hear you haven't given up on yourself or things getting better with time. Haven't seen any pics of you, but I'd wager you're very cute and are into a lot of awesome things that any good guy would be incredibly lucky to be with.\n  \nI 100% think your friend has some other deep-seated insecurities or jealousy issues that are making her respond in such a heartless manner. I mean, it's possible that she could be that dumb/clueless, but it's just too callous to be ignorance. Please don't take what she said to heart, there is a TON more to a successful relationship than stereotypical beauty tropes that most men (like me!) don't even find attractive in the first place.\n  \nKeep your chin up, cutie.",
            "You seem to have an upbeat attitude. You're well spoken and intelligent enough to get in to college. You're rational enough to approach a problem head on and look at things objectively, form a plan, eliminate others who won't help with that plan and then proceed on and succeed (I mean you did get some matches already). \n\nSo, I'd say you just won. Good job OP. You're gonna be a great catch for someone.",
            "One suggestion: Try a serious online dating platform (whatever that is in the states). I found my match on \"FriendScout\", but I think that is German only. I met some cool people through that website and I just checked that they even host single parties and have a date roulette (like tinder with the swiping) as well as regular dating with messages and stuff. See if something like that exists for your area. I think Tinder is just \"wanna fuck?\" mostly and there looks matter even more than on regular dating sites. Your former friend was kind of an ass.  \n  \nOf course there are a lot of things you can do if nature has not blessed you with super good looks, like taking good care of yourself, but staying mostly natural, exercising, subtle makeup, clothing, behaviour...I know the last one sounds hard, but you simply need to show some self-confidence, be funny, open, approachable. Sooner or later you will find someone. Sure you won't be banging every dude that comes around. My friends got girls pretty regularly when we were younger, I never did. I had terrible Akne and I'm not a Brad Pitt by any stretch of the imagination + I've put on weight as well over the years.  \n  \nOnline Dating is also a hit and miss, you need to realize that a lot of the dudes are either dicks or won't answer, it's worse when you're a guy seriously. I've sent messages to dozens, nay hundreds of women, got only a handful of responses and only 2 or 3 went further than 1 date, but no sex, until I met someone I have now been with for over 3 years.  \n  \nSo, chin up, and at em. Plastic surgery is a possibility if you really want to (I have not seen your face, so...) but it should be a last possibility.",
            "Now you're more confident, you're working on your appearance, you've got a few matches, *and* you got a toxic person out your life. Sounds like things are only looking up for you, which makes me happy. You sound like a great person, OP.",
            "Im happy to hear you decided you don't need this friend in your life. That was plain bitchy and she sounds like a dick.\n\nMakeup is fun to play with! See what works for you and roll with it. Confidence is also everything. ",
            "Yup, you solved the problem. \n\nGood luck.",
            "Yay you! Way to take a shitty experience and own your ability to turn it into a positive one! ",
            "I can't believe a friend would tell you that. There's being honest, then there's being a dick. Obviously I've never seen a picture of you but a friend of mine really turned her life around when she took an interest in exercising and \"advanced makeup\" techniques. There are subreddits to help you with both. Not sure what they are called though!",
            "The changes you are making sound awesome. I still recommend finding a geeky group of some sort if you dig that kind of guy.  I've been called ugly innumerable times,  and I'm so introverted/shy that I went through therapy to acclimate myself to going out in the world... but I still have an amazing boyfriend.  Thanks,  video games! (Initially met him through our college arcade group)",
            ">I gave myself a look in the mirror and decided that I'm not all that ugly. Sure, I'm not beautiful like my friend is or like a lot of girls on this college campus, but I'm okay. I'm a good person, I have something to offer, and I'll just keep searching. There's no point in crying over the opinion of someone mean like my friend. I may not be a fitness model or beauty queen, but I'm okay.\n\nAmazing attitude you have there. You will have success if you keep this up!\n\n>I am going to put in some more effort into my face and body. I think exercise would help me. I'm not about to sculpt myself or anything right now, but jogging a few times a week seems like a good start. And I'm about to go to the drugstore and buy myself a couple more pieces of makeup, maybe a new cardigan or two. We'll see how it goes.\n\nAwesome! If you want advice on fitness, /r/fitness helped me out tons.",
            "Maybe there are some clubs on your campus that might interest you and help you make new friends with similar interests. Good luck!",
            "I'm so proud of you for getting rid of her. You \"may not be a beauty queen\" on the outside, but it's not hard to tell which one of you is more beautiful on the inside. She sounds gross. You sound like a great person, someone is gonna be so lucky to meet you!",
            "Glad you ditched that 'friend' because she was brutal. Honesty is good but she went overboard. No nice advice just crushing you by saying even surgery can only go so far. She clearly didnt care about your feelings. \n\nIm so happy to hear you've already had some success and lets hope you have more success when you work on your luck. \n\nP.s. go you for looking at this in a positive/productive way.  Nothing is more beautiful than confidence. ",
            "Is there a sephora near you (Make up store)-go in and ask for a consult-tell them you have never worn much make up and you want a good every day look that will maximize your good points and minimize your bad-if there is something specific you want to highlite or low light mention it.\n\nAsk them what they are putting on you and what it does, how to do it.  They will give you a product list at the end. Ask them what the three most important things to buy are and, if you LOVE them, buy them. \n\nDont buy mascara-drug store mascara is every bit as good as high end mascara.  Probably buy some foundation, blush and maybe a good lip glass and pencil.  If you have good skin you won't need a concealer-if you have uncooperative skin get the concealaer instead of blush and buy drug store blush.\n\nYou NEED the sponge the use to apply the foundation or it won't blend properly. Go out and get your brows shaped ($11 ish-if your brows are very pale get them tinted too (and extra 18-20).  Shaping your brows properly can change your whole face-it will last about 2 months-then you can decide if you want to do it on your own or keep getting it done.\n\nIf there is not a spehora try Ulta (not quite as good)\nMake up is expensive-dont be surprised if your foundation costs $40-but it will last a full year.  There is also $100 foundation-I don't think they will test that on you but ask the price of the product and feel free to tell them thats too much.\n\nDo you like your hair cut? Is it easy to take care of-blow out, straighten, curl?  If you get a good hair cut it should only take you about 20 minutes to be in 'go out ready' shape-if you have a bad haircut or no shape to your hair no matter how much time you spend you won't like it.\n\nThis is mainly about you-to encourage you to make an investment in YOURSELF-for yourself, not for anyone else.  You are young now and your only responsibility is to yourself.  If you don't make an investment in your self and spend time on yourself now you never will-and you ARE worth it (Believe me when kids come a long later in life all you will have in your closet is comfy clothes-covered with spit up-take advantage of your independence now!)  Also-its true that when we feel better about our looks we feel more confident and that pays off big time in our relationships with other people and how we present ourselves.\n\nFinally-think of three things that interest you and try them out-ever want to be a gourmet cook-watch something on food network and then try the recipe-rock climbing look interesting?  Sing up for your local class.  Love animals-volunteer at a shelter.\n\nI think you are definitely on the right track after perhaps being more passive in the past-you are being more proactive now-just bump it up a notch.\n\nAnd your ex friend was an asshole-there is a way to give constructive criticism and she missed the mark so much she ended up in another galaxy ",
            "good luck!!! :D ",
            "You sound strong and mature. Glad you did not let the bitch get under your skin. She sounds awful, congrats on getting rid of her. ",
            "(((hugs)))\n\nON the drugstore makeup thing - call your local dept store that has makeup counters (macys, dillards, nordstroms, etc) or MAC/Sephora - and set up a free makeover.\n\nThey will do your makeup for free.  They will show you colors that might work for you.  If it doesn't feel comfortable, don't buy it, and don't get pressured into buying anything you don't want.\n\nHaving an impartial 3rd party to do the makeup really helps.  ANd be honest - \"I'm new at this and don't know what to do.  I need some tips\".\n\nAs for the ex-frenemy - you're in college - get involved and make new friends.  Join a club (D&D is fun! or a language club).  Try a sport (Rowing was a blast, and track is great for stamina) You will meet new people who are intelligent and interesting.  And at least 50% will be nicer than the bitch.\n\nYou go girl!",
            "Your \"friend\" is a complete bitch and you don't need friends like that in your life.  \n\nTry not to put so much pressure on yourself.  You have lots of time left to meet guys and have fun.  If you want to meet friends (guys and girls) why not try some campus groups? Or there are sites like MeetUp etc., which organize different events.  ",
            "One quick piece of advice, beware of starting your exercise routine with jogging. That's really hard on joints, etc. Building up your muscles first is important. Start walking, walking fast, or swim or ride a bike. There is no hurry here--you need to exercise the rest of your life. Start modest and take your time to build up and you are more likely to stick with it than if you aim for quick results and hurt yourself early on.",
            ">going to try to be comfortable in my own skin.\n\nThis is the most important thing. Self-confidence will help you make friends too (real ones - that girl was not your friend). Good luck OP, you sound like you've got this figured out.",
            "Good for you! Don't worry about what your friend said, that just seemed so unnecessarily mean. She wasn't being honest, she was being bitchy. \n\nJust light makeup, a cool hairstyle and flattering clothes can completely alter your appearance. Have fun trying out new styles! See what works best for you and run with it.",
            "I'm glad you got rid of a toxic friend! If you ever need any help with makeup or exercise, feel free to PM me. :D I used youtube to learn makeup and I am also a certified personal trainer. Jogging is awesome but if you ever want to switch things up, try adding in some HIIT (like sprint intervals) or plyometrics. Your positive attitude is wonderful and I really hope you have success with Tinder. :)\n\nEDIT: spelling",
            "Aw you seem sweet, you'll find a guy soon.  So many *bitches* out there that are just not a lot of guys (me included) types.",
            "[deleted]",
            "You might over reaching with your own goals. ",
            "I'm like your friend. Blunt/honest, and I wouldn't care much for your opinion as you would have asked for mine. The fact you ditch someone after asking them is pretty funny, but people are soft I suppose.",
            "You do realize that Tinder is the most superficial of all the dating sites, right? If online dating is your thing, try a pay site, the only couples I know IRL that have met on dating sites met on the premium ones.",
            "[removed]",
            "[removed]",
            "[removed]",
            "Holy shit your friend should take a running jump. I only started dating around your age there's nothing wrong with you. ",
            ">I'm a good person, I have something to offer\nYou're miles ahead of other women with your attitude here. And you are one hundred percent correct.\n\nWe are not perfect, and we are wired for struggle, but we deserve love and belonging.\n\nGet yours. <3 xoxoxo Be well.",
            "[removed]",
            "[removed]",
            "Different problem: late 20s male, 800 matches since I reset the app... and I just don't care.\n\nIf I had 1 match, I'd really, really try to talk. If I had 5, I would have options. Having near to 1,000? What's the point?\n\nedit: I'm not overly beautiful, I just live in a city PACKED with women. Just packed. It's wonderful, but when you're looking for one star, and you've got an entire sky full of them? It makes it difficult for a particular, unmotivated romantic. "
        ]
    }
]