[
    {
        "post_id": "3pajjr",
        "author": "throwawayzlo",
        "title": "My (43M) daughter (22F) has started stealing to support her heroin addiction, and my wife (39F) wants to kick her out of the house",
        "url": "https://www.reddit.com/r/relationships/comments/3pajjr/my_43m_daughter_22f_has_started_stealing_to/",
        "score": 2412,
        "num_comments": 137,
        "created_utc": 1445214560.0,
        "selftext": "First of all, thank you to everyone who responded to my [original thread](https://www.reddit.com/r/relationships/comments/3ccaf3/my_43m_daughter_22f_has_started_stealing_to/), harsh words or otherwise. I truly needed them, as I was completely blind to the pain that I was causing my family. I am truly sorry for disregarding the pain of my family. \n\nAfter making this thread and seeing the responses, I talked to my wife and son while my daughter was away, and I apologized for making excuses for her and not acknowledging how much I hurt them. We all cried for a long time and aired out a lot of feelings, and I was forgiven. Then, we all agreed to have a family intervention for our daughter. The deal was that she either goes to treatment or she doesn't get to stay in the home. My daughter was oddly unemotional during the meeting despite our pleas and crying, but she agreed to go to another treatment center about 200 miles away from home. We expected her to return today. \n\nBut our lives changed about 40 days after we dropped her off. We received a call from the police department near the treatment center, and they told us that a young woman was found hanging in a motel that morning. She left a note with her name, me and my wife's names, my phone number, and something along the lines of \"I'm sorry for everything, Mom & Dad & [Brother], but I will never be better. Good bye.\" \n\nShe was finally cremated last month, and we spread her ashes over the park we used to play in. I miss her every day, even though the last few years made us fucking miserable. The other 20 years (I adopted her when she was 2) were amazing, and those are the years I choose to remember. I remember her infectious smile and intelligence and how she could make me melt  without even trying. We all separately admitted to choosing to remember her this way, and not in the way she ultimately ended up. \n\nWe're all in counseling, both family counseling and one-on-one. Each of us go there 3 days per week, and we are becoming stronger as a family day by day. But there is still a gaping hole in my heart that I'm not sure will ever close. \n\n**tldr: my child committed suicide after leaving treatment early. we're devastated.**",
        "permalink": "/r/relationships/comments/3pajjr/my_43m_daughter_22f_has_started_stealing_to/",
        "comments": [
            "So so sorry. There are no words to comfort your family, I know, but I wish you well in your healing. You lost a child, one of the worst things imaginable and that hole will never close. And that's ok. ",
            "I am *so* sorry. This is heart breaking. But you did the right thing by holding an intervention, giving her the ultimatum, and sending her to treatment. I hope you never doubt your decision to do that. \n\nWhen I was 22, my parents gave me the same ultimatum, for the same reasons, and I ended up in treatment 2 states away. I relapsed after treatment, while still in that state and tiny treatment town, and thankfully that was short lived. My sobriety date is 2 days after my birthday, and I just recently got 3 years sober. I can't tell you how much I wish your update was a happier one, and I really can't put into words how sorry I truly am for not only you and your family, but also your daughter. The guilt and shame addicts experience once they get sober is honestly awful. It can and has lead to relapses since we don't know how to properly deal with our emotions anymore, we numbed them for so long.\n\nI've lost way too many friends to heroin, having been in their shoes, it's important that I remember that they're no longer suffering. I hope that you and your family find peace someday. You did the best thing you could have ever done for her. I'm so sorry. ",
            "[deleted]",
            "I am so sorry for your loss. The following is about my sister, a decades long opiate user. Please feel free to come back to it at a later time if you don't want to read it now, its fairly personal.\n\n\n\n\nTreatment, while statistically \"the best\" solution also gas a great number of undisclosed downsides that come in with the individuals who aren't there to get better. The first time my sister entered treatment, she said it was a great way to learn to be a better criminal/addict. \n\nIts also a place where the more intelligent kids whose families have the means to send them to treatment get a sincere dose of the reality of their plight. \n\nIt is impossible to equip a family for this, it is impossible to prepare for this, and it is impossible to imagine this, from start to finish. I can tell you with a straight face that your daughter may have truly believed she was doing the right thing for you. Opiate addiction is an unimaginable illness.\n\nMy sister never had the chance to go to treatment, my family doesnt have that kind of money. She struggled, mostly on the street, for the better part of the past 15 years. She has been a prostitute as well a pimp. A drug runner and a drug dealer. And anything else you can imagine. She finally started begging the probation system for rehab in 2011. She got about 21 days, once. That was it. There's simply no such thing as treatment for a single, indigent woman. \n\nMy sister is finally recovering. All it took was 20 weeks in ICU (broken over three years), a colostomy bag, nearly losing not one, but both of her hands, staph infections, removal of bone, nearly dying several times, I kidnapped her, all the methadone, smuggling suboxone, you name it and finally, after having every single person finally turn their backs on her - including me, the final hold out. After shutting the door for a year, she started crawling out, without my help.\n\nShe became very motivated last year and knew of a way to get herself off the street. She got knocked up, out of desperation. Suddenly, she had a bed in a rehab facility. Suddenly, she had benefits. Suddenly, she had all of these doors flying open. I was still amazed she managed to conceive. \n\nAnd she is really, actually doing it. I haven't had to enable her in any way. We live in Colorado, she doesn't even mess with dabbling in weed anymore, and she is a drug addict straight out of a textbook. \n\nShe fears homelessness more than she fears withdrawal. That's what it seems like it came down to. Its that fear that keeps it going. For her it seems like she had to fear something more, but it didn't become the homelessness and poverty until something more important than her was at stake.\n\nThat sounds positive, and it is, in its way. She still has a struggle ahead as a single mom, but for the first time in 15 years I believe she's clean. I don't check on her, she's been solid as a rock for over a year now. She doesn't lie, shes punctual (probably the biggest tell), and she's fat. The fetus seems healthy, she's due new years.\n\nBut the overall cost, the emotional cost, all that trauma, all the hospital nights, the lying. There were times when I begged her, while she lay unconscious and intubated in front of me, not to come back. I would tell her, after a decade of dealing with her addiction, that it was OK if she quit this time. I would understand. I promised her I would be really sad and it would be really hard, but going through this every year was just too hard anymore. I begged her to just stay asleep. \n\nI would have been happy with her at peace. It is just a motherfucker of an illness. I probably understand it better than anyone who has never tried it, and I don't really know how to convey it. I know my sister. I know she is in such a tiny set of the population of opiate addicts who get to recover, and so does she.\n\nI used to write about it a lot under a different moniker, but she still has a ways to go. She's on the methadone replacement still, the child will be born an addict. We will have to work with doctors to help the baby kick the single worst opioid out there. Hopefully we get it over with early. I do not have kids, but I do have a lot of infant experience.\n\nShe doesn't live with me and I will still never let her into my life in that way. She lives in a private, sober living residence for homeless, single mothers, where she can stay until the baby is 3 months old, then she is out on her own. Her completion of a previous program for pregnant mothers as well as her participation in a study with CU is helping with housing (think section 8) for a couple of years and other odds and ends. That's all privately funded, there's tons of support out there for single mothers, it turns out. \n\nIts an outcome. I do not have expectations of smooth skies ahead, that will maybe never exist, but at least she will have a healthy child at this point. \n\nPlease get your son to see someone. If yes young with no drug experience, get him a proper, fact based education in the topic. This can't continue to be about the scary boogey man heroin, the most evil drug ever. It isn't about that. Its about education and getting them to make responsible decisions, not using scare tactics. She's a walking scare tactic - her arms are visibly half missing - and that isn't enough to scare kids she's met.\n\nIm sorry, this is wordy. Having lived with this with two of my siblings, as well as the suicide of my 22 year old brother, in a certain light I hear where they were or would be coming from. \n\nIt really is peace. I've seen this every way. It is devastating but it does get easier. It will always hurt, but it will get better. I really hate that anyone has to go through this, no matter how long or short. \n\nThe people who are attracted to opiates tend to be the sweeter, kinder, more sensitive ones. The pain of the world is a lot, to them. They aren't scary or waiting to wrong anyone, they don't want to get sick. ",
            "oh Jesus. I'm sorry op, I'm so sorry. Nothing I can say will help but I am sorry for the pain your family is going through. This is not the update anyone wanted.\n\nSometimes it is easy to disregard there is a person behind the screen and be flippant about the situation. this drives home that there is real pain, real problems and sometimes the answer doesn't help or go the way it is expected.\n\n(hug/prayer)",
            "Wow I'm so sorry that happened, glad you guys are seeing someone to talk to individually and together. I wish your family well. As a parent myself, this is heartbreaking. ",
            "I'm sorry.",
            "I'm very sorry for your loss. I lost my brother to addiction, and it was so very painful. I am hoping and wishing for peace and comfort for your family. ",
            "I wish you and your family nothing, but good will. You guys tried your hardest, her demons were hers. Cherish her good memories, and may as you as a family come closer. ",
            "So sorry for your loss. This is why sexual assault and rape are so damaging. ",
            "OP, reading your first post was devastating, but just as I was reading through this update, I could feel my heart break for you. I have known and loved too many people who have become enslaved by addiction; this is the worst nightmare in this kind of situation. I don't have any sage advice that will heal your wounds, and though they may just seem like works on a screen, please know your family is in my thoughts and prayers. ",
            "I am so sorry for your family's loss.",
            "Saying I'm sorry seems so inadequate in this situation. I don't know what the right words are. I can't even imagine your pain from the whole situation. Just know that you tried, you did what you thought best, and you can't control the actions of others. ",
            "I'm so sorry that this happened to you and your family. But you did the right thing. You tried your best to get her the help that she so sorely needed, you provided her with all the love and support that you had.",
            "Oh my, this is a very heavy story. I am so sorry for you, I honestly don't think I've ever been this effected by a story on reddit. Seriously fuck that co-worker he deserves to burn in hell. I wish the best for you and your family in the future.",
            "My brother took his life under the same circumstances, he was also 22. This was last November. It's crazy thinking about how they were before the drugs. And wondering how they could have started that despite their good upbringing. I don't know what it's like to lose a child but i hope you stay really strong. There is nothing that will help this except for time. It's gonna hurt and it's gonna hurt bad, it should, cause that's how important she was to you. Best of luck.. ",
            "Don't blame yourself, or the way any of you handled her drug use. As a past drug user, I know these kinds of situations can be extremely difficult to manage, even under the best conditions. Its pretty hard to peel someone away from that lifestyle and mentality even when they haven't been through emotionally destructive times. The path to recovery from drug addiction is difficult to impossible enough, even when you have no history of trauma, and everything to live for... For someone in her position, I can't imagine the pain with which she struggled. Your family did their best, and its nothing but tragic the way things turned out.\n\nInstead, you should blame her rapist. He should burn for what he did to her, and your family.",
            "I am live in SE Ohio and we're in the midst of a massive heroin/opiate epidemic. I see my friend's and neighbor's names in the obituary section of my newspaper a few times a month. Heroin addiction can grab ahold of anybody. It doesn't discriminate. I am truly sorry for your loss.",
            "Sounds like you did everything right. It's unfortunate that sometimes doing everything right isn't enough. Best of luck to you all.",
            "I'm fucking tired of reddit's hard love circlejerk.\n\nI'm a former heroin addict.  Currently an alcoholic.  I'm depressed and lost.  If my parents kicked me out, I'm sure I will off myself.  \n\nThis tough \"love\" bullshit needs to fucking stop.  \n\nEdit:  This is an issue about MENTAL HEALTH.  Mental Health programs fucking suck in the United States and even getting treatment at certain facilities or rehabs won't fucking fix it.",
            "Please tell me the cowirker went to jail.  This person destroyed your daughter and families lives.  Jesus Christ.",
            "So sorry to hear about your loss. Heroin has left alot of people in places too similar to your families current state. You still made the right choice getting her to treatment, it's just tragic that the outcome didn't change.",
            "Just wanted to say that /r/GriefSupport and /r/SuicideBereavement are there for anyone who may need them. ",
            "I remember reading the original. This was a sad update OP. Sorry for your loss.",
            "I'm sorry for your loss, addiction is a horrible thing",
            "I am so sorry for your loss. Addiction is a horrible thing. I know it's just a strangers words on a screen, but this is so heartwrenching, and I hope you and your family get through okay. ",
            "I teared up reading this. I'm so sorry to hear this.",
            "My brother did the same exact thing. My parent and I always say that we lost my brother way before he committed suicide, a lot of the mourning we did for him was when he started using. Your life will drastically change in these next few years but just remember that you'll find peace again one day. \n\nAll you can do now is stay close to your family, tell them you love them everyday, and live the rest of your life with twice the love ",
            "My god this story is hits me so hard. As many of the other commentor, I too was in a situation almost identical to your daughter's (Grew up in a great home, started struggling with self image and self esteem mid teens, turned to heroin late teens and was kicked out by family for stealing. \n\nI was fortunate enough to have been provided a form of treatment that allows me to live a normal life and keep me away from all that, but I could have easily been in a situation similar to your daughter's if not for Subutex. I commend you for handling this the way you did, it seems that you did everything by the book and took responsibility for the aspects of the situation you could control. My parents really reaaalllyyy struggled and probably could have handled me a little better. They took the \"just don't get high...just don't do it\" approach. When they realized that didn't work and I things around the house were starting to dissappear left and right, they kcked me to the curb. My father was way more concerned with me getting over on him and his pride rather than the condition of his son. Once I was finally kicked out, the real fun began. A crime spree struck the area I was living in like none anyone had ever seen and I was the cause of at least 75 percent of any theft related incident. Over the course of just a couple of months I would say that I robbed over 300 vehicles, broke into at least 50 or 60 homes, and stuck up a gas station. \n\nWhen the law finally caught up with me, i was so numb to it all. The future didn't matter, the past didn't matter, life or death was literally a gamble every day, and I didnt care. Unfortunately (looking back) the judge I went in front of for one charge of breaking and entering for felony, was lenient with me due to my lack of a record and youth. I was released on personal recognizance (basically my word)  and I started right back up again, as I only spent one evening in the local county jail. Again, about a month later I was busted. Only this time I was caught inside of a home. I was held for 30 days and put on 2 years probation with what's known as a suspended sentence of 2.5 years in state prison. This meant that if I violated my probation in the smallest of ways, I would be automatically sent upstate. \n\nThe threat of state prison wasn't even enough to stop me. That goes to show how little control an addict has during a run. After 30 days I got out and again, a month later, I was picked up and help for another 90 days for another B+E for which I was caught red handed again. Only this time with the threat of long term imprisonment, I wanted to stop, but then I didn't, then I did again, it was like I was possessed. Even in jail I couldn't hold on to an honest desire to quit. Upon release I went to an 18 month residential program and stayed for about 8 of them before being fed up with the shoving God down your throat aspect and went to another program. Over the course of the next two years i bounced from program to program (as I was required by the courts to graduate a program before becoming a part of society again) I relapsed about 5 times, but only 2 real runs. \n\nAfter my last relapse, I had just completed probation and was a free man again, i decided to say fuck the program and asked my mother if I could spend some time at home to start rebuilding my life. I relapsed the next day and almost died of overdose. I went straight back to detox where I met an excellent doctor who allowed me into his subutex therapy program and I have been working with him ever since. \n\nToday it's been 3 years give or take, and let me tell you it hasn't been easy. I constantly struggle with my emotions, the guilt of what i put my family through, the families I probably scared shirtless, the heartless nature of my past. But I am fortunate. Your daughter's story is absolutely terrifying and sad and I really really resonate with your pain, though I know I really have no idea what your dealing with. I do want to say that you are not alone. And the story you have to tell really inspires me to be grateful for my escape from hell. Today I am working in my field of interest (IT) and have graduated from college. I wish you the healing you deserve, and hope that you grow from this utterly incomprehensible experience. I know it sounds weird to say, but I also think that your daughter, while obviously in a terrible frame of mind, and mentally suffering, did something fairly selfless. It speaks to her true character. While she apparently knew that she had caused so much pain, and couldn't bear the guilt, she also seemed to understand that she still had a desire to relieve her pain with the drug, unfortunately the same drug that causes all the pain to begin with. She knew that as long as she was on this plane of existence, she would cause more suffering, do solely to her illness. Its hard to understand this even as an addict, the fact that we are not out disease, and we usually bear the pain and weight of the burden associated with it on ourselves. She wanted to end your suffering too perhaps, and knew that this would be the better than ending her life slowly and dragging it out as she continued to use.\n\nThis is just the opinion of an addict, and I am in no way trying to speak for her, as I have no right to do so. This is just speculation, having been in a mind-frame similar, I wanted to share my thoughts. You can message me any time if you need support. Your journey is a hard one, and I commend you for sharing. Best wishes.",
            "I'm so sorry. Not exactly the same, but my older brother passed away from an accidental overdose, so I know the pain my parents went through... I remember being scared at how much my dad was crying. I know what you mean by the gaping hole. My parents did not seek counselling and it took my dad in particular YEARS to get back to normal. He'll never really be normal again, but he smiles now. I don't have kids but imagine losing your child is the worst pain a person can go through. You really did the right thing and did the best you could do, and I'm sure she appreciated the fact that you all cared about her enough to seek help for her. To INSIST on help for her. My parents would do the same. ",
            "I am so very sorry for your loss.\n\nDid anything ever happen to the person who assaulted her?  Because that person needs to know the full extent of what they have done.",
            "I recently found an old friend had died from an overdose, and I know she had nothing but enablers around her.\n\nThe fact that **you gave her a chance** is the most you could have done. You did more than most could have afforded, and it's beyond you if she couldn't cope with such love.\n\nDon't dwell. You did well.",
            "I am sorry for your loss.  You made the right decision.  You as a father can not stop what your children do.  The best you can do is point them in the right direction and hope the make the best of the knowledge you have given them.  I wish you the best, and remember, it wasn't your fault.",
            "My family helped push me into treatment, and I celebrated six years sober this past summer.\n\nI go to meetings and speak at treatment centers and I sometimes say out loud that I wish I knew what the magic formula was. I wish I knew so I could shout it from the rooftops. I wish I knew what the magic words were that were said to me that allowed me to push through the insanity of the end of my using days and the first six months of being sober, when I had no hope and knew I wouldn't make it... but just kept trying. I wish I knew what manipulation, what phrase, what encouragement, what piece of hope would work to save someone... but I just don't know. I share what worked for me, and I watch it work for many people, but I see that it doesn't work for many others. \n\nI'm so sorry for your family. I don't know if the hole will ever close either. I can say from my experience that you sound like a loving father who tried his best. \n\nMuch love and take care.",
            "I am so truly sorry.",
            "Im very sorry",
            "I'm sorry, really didn't expect that.\n\nI'm glad you can focus on remembering the good times you spent together. That's what you should always do. Focus on the positives.",
            "I am so sorry OP. I wish your family the best. RIP. ",
            "I feel like part of me want to cry when I read this. You are a very good man. Peace be with you.",
            "I am so sorry for the trials life had put you through. In your darkest moment, always remember her smiles and laughter.\n\nTake comfort that she love all of you enough to address the family before she left.",
            "As a father, I am heart broken for you. I'll pray for your family's peace and for your daughter. I'm sorry this happened. ",
            "I'm sorry for your loss OP. my father was an Herion addict,he caught HIV form a dirty needle. he did get clean but the damage was done to his self and our relationship. I never forgave him for ducking up his life and disappearing form mine when I was a teenager. \n\n\n\n\n\n\n",
            "I am truly sorry for your loss. We just lost our 24 year old cousin to an overdose. She had been back from rehab for 3 days. \nThere is no right answer. There is no could haves or should haves. The drug doesn't think rational or play fair. The drug steals your person long before death.  \nI am so sorry your family had to go through this. I hope you all can heal. She is free from her demons now.  ",
            "I am so terribly sorry.  My heart goes out to you and your family.\n\nI lost my sister to drug addiction - it is a horrible thing to watch.\n\nI wish you peace and healing...",
            "This is truly heartbreaking. I can't even begin fathom what you and your  family are going through. I am so sorry this happened to you. ",
            "You made the right decision and it's not your fault.  \nI am sorry to hear about your daughter.",
            "So very sorry for your loss.",
            "I am very sorry for your loss. You did what you could to help her. ",
            "Jesus... No mere words can give you and yours anything back.  May she rest in peace and may your family find stable ground.",
            "I am so sorry for your loss.  This same thing happened to my brother two years ago.  He was addicted to prescription pills and other drugs for seven years before he took his own life.  Just know that it will get easier over time, but you will always grieve and think about her everyday.",
            "Damn.... I dont even know what to say...\n\nshit...\n\nIm so sorry for your loss.\n\nI read your first thread but didnt comment because you already had a lot of good advice from other redditors but for this scenario? There is no advice good enough to deal with it but every single one helps a little bit.\n\nStay strong, bond with the rest of your family, don't let this drag you down and remember IT WAS NOT YOUR FAULT! ",
            "[removed]",
            "[removed]",
            "[removed]",
            "I'm really sorry for your loss, my thoughts are with you and your family",
            "[removed]",
            "[removed]",
            "That's terrible and I'm sorry for your loss.  I worry about things like this for my own children.  If you had to do it again, how would you stop it?  If you have any advice I'd like to hear it.",
            "[removed]",
            "[deleted]"
        ]
    },
    {
        "post_id": "3setgn",
        "author": "tvprobs",
        "title": "[UPDATE] Me [23F] with my husband [25M], married 3 months. He has to sleep with the TV on. It's driving me nuts.",
        "url": "https://www.reddit.com/r/relationships/comments/3setgn/update_me_23f_with_my_husband_25m_married_3/",
        "score": 2412,
        "num_comments": 329,
        "created_utc": 1447254052.0,
        "selftext": "Hey guys. I posted a couple of days ago. [Here](\nhttps://www.reddit.com/r/relationships/comments/3s519n/me_23f_with_my_husband_25m_married_3_months_he/) is the original post if you'd like to see it.\n\nThank you for all of the replies. It was nice to know that I was actually being reasonable in this situation with my husband. To all the people who said my husband is a complete dick or that we should get divorced, thanks but we're okay. Nothing a little communication can't fix.\n\nAnyways, to the good stuff. After I got all the responses, I told my husband that we needed to talk. He could tell something was up and that I was upset, so as soon as I got home from work we sat down and talked.\n\nI explained to him that while I have always not liked that he watches TV at night, I *really* do think the TV being on is what causes my back pain. I told him that I could see why he thought I was just trying to control him with it, but that I loved him and just wanted some relief from an achey back.\n\nMy husband first apologized and said he didn't realize how serious it was. I can sort of be a baby and a complainer when it comes to pain, so I really can't blame him there.\n\nNext, I told him we should figure out a solution that works for both of us. We talked about getting some kind of white noise maker or a sleep mask for me, but I really do just prefer a dark, quiet room. He also didn't think that white noise would put him to sleep. So, our compromise is that we are going to watch a movie or TV show on the couch every night before going to bed (he ALWAYS falls asleep when watching a movie or longer TV show) and then when we go to the bedroom we can just go straight to sleep.\n\nIt's worked the past two nights PERFECTLY. He's asleep by time the movie is over so I just nudge him and tell him to walk to the bedroom and then he falls back asleep immediately.\n\nSo, thanks again reddit! A little communication was the only thing needed. \n\n   \nTLDR: Husband and I figured out a solution. We'll watch a movie before bed so he falls asleep then go to the bedroom with no TV on. \n\n**Edit: Holy shit I can't believe this reached the front page of /r/relationships!**\n\n**For everyone saying to use the sleep timer on the TV: we have already thought of this. It doesn't work because he ends up falling asleep before me and then starts snoring.**\n\n**Last edit, I swear. Thank you again for all of your wonderful suggestions! We're going to look into ear plugs, tablets, eye masks, and all kinds of other stuff for when the movies stop working!!**",
        "permalink": "/r/relationships/comments/3setgn/update_me_23f_with_my_husband_25m_married_3/",
        "comments": [
            "[deleted]",
            "Another win for communication!\n\nIn case you need another solution: wireless headphones and a tablet or laptop propped up on a night stand on his side of the bed. Tell him to decrease the brightness setting and just take off the headphones when he's done. If you sleep facing away from him, you'll never know he was watching anything.",
            "Hold up, let's talk about WHY he can't sleep without television. I had the same thing, and let me share with you how I solved it (for the most part).\n\nAnd let's be honest, this isn't a permanent solution. Sooner or later you're going to get tired of watching a movie EVERY SINGLE NIGHT. Maybe this could be a good backup solution, but it should not be your go-to.\n\nMy educated guess is your husband has a similar thing to me: thoughts that are keeping him up at night, or anxiety (which is often caused by thoughts).  He can't sleep with these thoughts, so he needs a distraction, or he will literally be up for hours, if not most the night. BUT if he watches TV, he can distract his thoughts enough to allow him to drift off peacefully, and then when you switch over to the bed, he is still sleepy enough he can still fall asleep without the thoughts creeping back in and giving him little anxiety attacks that jump start his brain back into fight or flight mode. \n\n(BTW, if it is anxiety—and it sounds like it is—anxiety sucks. It's kind of like thinking that there is a hungry tiger in the room. Have you ever tried sleeping with a hungry tiger in the room? Not easy.)\n\nSo, here's what you need to do.:\n\n1. Keep doing the movie thing in the short term because it's working for now. \n\n1. Ask him WHY he needs the television, what does it do for him. Ask if it's thoughts/worries, and if so, what thoughts are they? \n\n1. You can talk about his worries a little bit, but feel out if he doesn't want to talk about it all right away, pace yourself. \n\n1. Find other solutions. Get a netflix/hulu/amazon account and he can watch on his phone with headphones until he falls asleep. \n\n1. Another solution: Reading. He might be emotionally dependent on television, but a good book that sucks you in can have the same effect as television in distracting those pesky thoughts. Getting a backlit e-reader is great because it distracts you the least, allowing you to sleep, but if not, getting a headlamp \n\n1. Another solution: Music/Audiobook/Podcast. You can set a sleep timer on these. Like the book idea, it might initially seem like it 'won't do the trick' because of the emotional dependence on television.\n\n1. Another solution: Get rid of/ease the pesky thoughts. This is the hardest one, and it takes the most self-work. Therapy is the obvious solution, but who has time/money for that? (I wish we all did, but that's beside the point). Making space in your day to sit with yourself, either through meditation or just \"spacing out\" is key. Don't wait for the thoughts to come at you at night, give them some time to breathe during the day. \n\nI used to be entirely dependent on television. Before I moved in with my now wife, I would fall asleep on my couch, and then head to bed, or just bring my laptop into the bedroom. After I moved in with her, I did the phone trick, sleeping on my side and watching reruns on my phone until I passed out. I still do it some times, but I was able to ween myself off it by trying to read until I got tired, and if that still didn't work then going back to the TV thing, **but always using the TV as a last resort.**\n\nYou've already shown some great communication, but this is a bandaid fix. Use those communication skills and dig a little deeper to find an even better solution. \n\nAgain, your current situation is going to get old sooner or later, so start being proactive and figure out solutions now. ",
            "We actually sleep with the furnace fan on.  She has tinnitus, and her ears start to ring horribly if it's completely silent, and I can't sleep unless there's white noise to focus my attention on.  It plays hell with the furnace filters but we actually discovered it when we were trying to get the kids to keep from waking each other up in the early morning hours when they were little.",
            "You guys (or just him with headphones) could try listening to podcasts, too. I find them relaxing even if I don't fall asleep five minutes in. There are a bunch of really interesting ones around 20 minutes long. ",
            "Just a thought OP, but does the tv in your bedroom have \"sleep mode?\" because my SO prefers to sleep with the tv on as well, so our compromise was to put sleep mode on so it automatically shuts off in 20-30 minutes (however long we set the timer). turns out she just likes *falling asleep* with the tv on, and once she's asleep there's no difference.",
            "I think it sounds like your husband has sleep apnea. I would suggest he get a sleep study done. The snoring and falling asleep during movies and tv are a dead give away. I think if he sleeps better through the night his sleep issues will improve.\n\nAlso I sleep with an eye mask and ear plugs. I can't hear or see anything. It is bliss. ",
            ">To all the people who said my husband is a complete dick or that we should get divorced, thanks but we're okay. Nothing a little communication can't fix.\n\n/r/relationships in a fucking nutshell.",
            "If blah blah blah doesn't work, GET DIVORCED. \n\n\nDid I do it right?",
            "Yay! I also have to be watching something to sleep. Though if I'm woken, that's it. I'm awake. If he starts having trouble again some other compromises my husband and I have done are turning down the brightness on the TV, setting a timer (most TVs have this feature), volume down to basically 1. Also, I prefer dvds to watch. TV is too random, nothing like waking up to a porn commercial at 3am. I put on quiet and dark movies or TV shows.",
            "Very nice! I wear a sleep mask as I need the room pitch dark and my husband wants a nightlight on, plus he wakes up 2 hours before I do. It took a few days to get used to the mask but now I sleep better with it than I did before he moved in (when the bedroom was all mine).",
            "Just read your first post along with this one! Glad it all seems to have worked out. I just wanted to suggest something in case you need a plan b. I needed to sleep with a tv show on for months because I need something to concentrate on as I wind down. I went travelling and needed to share a room with other people for a while so I bought an ipod nano and loaded it up with game of thrones audiobooks, radio dramas, podcasts and a little music. I use it every night to get to sleep. You can even set a timer on it so it goes to sleep after an hour, 2 hours, whatever and then you don't run the battery down.",
            "How severe is his snoring? Could he possibly have a sleep apnea issue?\n\nI have a pretty severe snoring issue (significantly less than it used to be due to weight loss, but it is still around), and without my c-pap machine... my wife has a lot of trouble sleeping. With that machine, my snoring is non-existent. \n\nLook around for a place to do a sleep study at. Many insurances cover doing one. I sleep more deeply with a c-pap machine than I ever thought possible, but still feel very sleepy by the next evening. Much easier to fall asleep each night. ",
            "Why are these top posts when all it requires is a little conversation/communication with a significant other, which is pretty much a basic concept?",
            "Awesome! I'm really happy this is working out for you. ",
            "Glad it's working for you. Something else to try might be having a fan on low in your room. It's what we do as my wife is the same way.",
            "That's awesome! ",
            "Also, listening to a podcast, or even netflix from your phone in bed may help.  My wife is similar to you, so we compromised and I listen to podcasts in bed as I fall asleep.",
            "I didn't see the original but I saw this update and my girlfriend and I had the same problem (me enjoying watching something to fall asleep to, he not able to fall asleep). I'm glad you talked about it and reached a compromise!  My SO and I found a different solution which is that I give her a foot rub in bed while I watch something. It puts her out in about 5 minutes and I'm free to watch what I want till I fall asleep! Been doing it for 4 years and no complaints about me watching anything.",
            "RokuTV has a headphone set you can pop into the bottom of the remote... We're thinking of getting another Roku anyways. BF goes to sleep much later than me and usually pops his headphones in his lappytop. ",
            "I love a fan for this reason and cannot sleep without one. The white noise and cool air help me sleep much better. My BF sleeps with the TV on sometimes but we use a sleep timer. That works well too! It's always off within an hour of us falling asleep.",
            "Why isn't anyone suggesting earplugs/blindfold? The wax ones are nice because they won't push all of your earwax into your ear and fuck your life up.",
            "have you tried the tv sleep timer?",
            "Earplugs are awesome btw.  It's the only way I managed to not murder some of my snoring exes.  It's always good to have some emergency pairs around just in case your optimal sleep ritual is impractical for whatever reason, and will save you a sleepless night full of resentment.",
            "Glad you found a solution. I use a sleep mask because my boyfriend likes to stay up later than me to watch shows on the tablet with his headphones. Works like a charm.",
            "Maybe someone already mentioned this, but have you tried listening to audiobooks instead of watching the TV? This is what my boyfriend and I do every night when we go to bed. Not only does it solve the need to have a TV on, we also get to listen to an awesome story together! And, I've found that it really helps both of us get to sleep. Just a thought. Good luck with everything, and I'm glad you were able to work out a solution! ",
            "I used to have to sleep with the tv on or music before I met my girlfriend but she needs silence. I just use headphones nowadays but often I've learned to sleep without it.",
            "Wear a sleep mask",
            "TIL loads of people need a TV on to fall asleep.\n\nI'd highly recommend meditation, I've found it really helps with sleep habits.",
            "Aww, this makes me so happy. I'm a TV sleeper and I'm trying pretty hard to give it up for my SO (although we have opposite sleep schedules so it makes it easy to cheat) and having that dark, quiet room really has already made a difference for me. I hope he sees a general improvement in his sleep too!",
            "> I could see why he thought I was just trying to control him with it, \n\nSo your next conversation will be about why he ever even entertained the notion that you were trying to control him? I sure don't see why he would think that.",
            "Just put a fucking sleep timer on. I do it every night.",
            "Dude, just sleep in different rooms, thats what we do.",
            "Jesus, people were telling you to divorce him? That almost completely discredits this sub",
            "IMO the bedroom is no place for a television. Your mileage may vary. ",
            "[deleted]",
            "Some tips for you.  \n\nfirst off,  don't ever call your husband or tell him \"we need to talk\" until you are both together and you are ready to talk...  it only causes un-needed stress and is psychological warfare.\n\nSecond,  you can let him watch TV in the bed, get a TV with a timer. so it shuts off in an hour or so. \n\nOR EVEN BETTER...  he should learn how to sleep without a TV on, he shouldn't have to fall asleep on the couch just to wake up and move to the bed room, he should stay awake until its time for bed, then go lay down and go to sleep, it makes for a much better rest.",
            "My doctor wrote a prescription out to give to my husband prohibiting TV during sleep hours. Now he uses his iPad if he can't sleep.",
            "TV is bright? Sleep masks exist. Problem solved. Who's next?",
            "All I've got to say is I feel your pain.",
            "What a terrible habit, very American. The bedroom is used only to sleep, get changed and have sex. So lame that people in this thread are so addicted to the TV. Oh well, not me nor my wife. ",
            "Not sure if this has already been suggested, but maybe you can also try using the Off Timer option on your TV to switch it off after a specific duration (say, 1 hour).",
            "I would have suggested earplugs but it's not good to leave the TV on as you probably feel. I kind of like the option of being able to watch something if I have trouble sleeping due to stress.",
            "Lol I'm glad you were able to find a solution. I used to be in your shoes, my gf always falls asleep with the same v on. I hated it. 4 years later I fall asleep with the tv on almost every night lol. ",
            "I didn't see your earlier post but I will comment here. I too have been in the habit of falling asleep to a tv playing. However you can retrain sleep patterns. Maybe a timer switch which turns the tv off after a period of time which is slowly brought forward. An alternative would be YouTube on the phone which would switch off after a  30-45min doco or show.",
            "My boyfriend and I live together, but we have different sleeping habits. We actually have our separate bedrooms, and it works great for us. If by chance this method doesn't last, you could try that!",
            "If you want or need to try something else: a white noise generator called the SleepMate 3000 is awesome. It's a globe shaped air generator that has vents you can open and close, to adjust the sound, and (the best part!) it doesn't loop like a lot of white noise generators as it's forced air. You don't have the constant breeze of a fan blowing on you, but you do get that wind tunnel sound effect. A long ago boyfriend slept with this thing on and I now can't live without it. \n\nMy guy falls asleep to whatever we try to watch with regularity so thankfully I can watch a film or show and not worry that it's affecting his sleep, but if it were the other way around he'd have no problems watching tv in the living room so I could sleep. I'm glad you guys found a solution! ",
            "Is there a medical reason for people only being able to sleep with a TV on? My uncle can't sleep any other way and my roommate let's the TV play through his speakers with the monitor off. I don't get it. I can only handle the hum of a fan. ",
            "also headphones are great. buy a tablet and plug some headphones in. ",
            "Have you tried a box fan? I know he *thinks* white noise won't help, but I thought the same. I thought I had to have the talking and movement.\n\nNope, box fan puts me out like a light. I was wrong. He could also be. Try a cheap $10 box fan at least and see, as maybe you sometimes won't want to watch a movie every single night just to fall asleep.",
            "My husband and I are on different sleep schedules most of the time. He works graveyard and I don't. So we got really comfy sleep masks and they are awesome. I'm glad every thing worked out for you and your husband, I just wanted to put my two cents in. ",
            "I had a SO with the same issue and it drove me nuts. I set the ps3 (we use it for netflix) to automatically shut off if the controller hasn't been used after a period of time. The tv itself turns off after the ps3 stops sending a signal to it. \n\nThis worked like a charm. Of course if she fell asleep before I did then I would just shut everything off myself. \n\nA sleep masks does work but it's weird. My brain knows the light is on in the room so it takes a little for my subconscious to let that go so I can sleep. Also I prefer to wake up as natural light comes into the room in the morning. The sleeping mask has made me over sleep because of this.\n\nI'm glad you guys found a solution that works! ",
            "Me and the girlfriend have a similar problem. I have to wait til she falls asleep and then turn it off.",
            "I've been wearing earplugs in order to sleep for over 15 years because my husband used to always leave the TV on *and* he snores. I used to use a sleep mask when we had a TV in the bedroom too.",
            "Good for you! Some of the comments from your other post made it seem that everyone thought your husband was the devil and didn't care about your feelings at all! But good job on communicating well:)",
            "Bob Ross re-runs.",
            "I don't know how people can go to sleep with that sort of distraction. We recently had guests stay over who have two little ones. The babies are light sleepers and their solution is to play classical music loudly to drown out external noise. Well, it was really loud! So loud that even with their guest bedroom door closed and our bedroom door closed, I could still hear the music and it was loud enough to keep me awake. They slept soundly but took me ages to get to sleep. ",
            "My SO does this as well, at first it drove me insane. Honestly what I did in the beginning was let her go and sleep before I did and I came to bed when I was actually exhausted and could fall asleep through anything. Now its just white noise to me and doesn't bother me at all, it also helps she only watches one show to help her sleep so after awhile knowing every plot point didn't distract me.",
            "I used to be like this. I swapped it out for a Fan and a night light and eventually just a fan. \n\nThough I've tried to sleep without white noise I can't thanks to Tinnitus. Which he might have.",
            "I'm glad you guys could come to a solution! I'm a tv sleeper. My fiance is not. We both sleep with fans on, but on top of the fan I need a tv show on or else I have panic attacks. He doesn't like the bright light from the tv, so as a compromise I put netflix on my computer up and turn it to the lowest brightness that isn't black. and then after like an hour or two the computer shuts off.",
            "I just use my roku 2 with headphones and it works fine for my girlfriend and I",
            ">To all the people who said my husband is a complete dick or that we should get divorced, thanks but we're okay. Nothing a little communication can't fix.\n\nthis sub in a nutshell",
            "I'm sort of like your husband - I like falling asleep to a movie, but as soon as I'm sleepy I turn it off. I really just need it so I stop thinking so much and am actually able to get sleepy. I notice without it, it will take me wayyyyyyy longer to fall asleep at night. ",
            "I sleep with a fan on, always have, and in the last 6 months or so I started sleeping with my computer screen on. I have night terrors and sleep paralysis and even as an adult I can't sleep in the dark. It's a lot easier to process that whatever weirdness I'm experiencing is just weirdness in a half sleepy state when my room has some light. My SO is an incredibly heavy sleeper so I can turn our actual light on without him waking if I'm having a bad night. I know I just got lucky and most people are driven nuts by noise/light during sleep.",
            "You could try listening to a really boring podcast or /r/asmr ",
            "As someone who sells mattresses for a living and spends my days dealing with couples in your situation,  I have to ask if you considered that the problem is your bed.   Obviously having a TV on will distract you from falling asleep,  but the pain that you described isn't a result of the light /sound of the TV,  but improper support from your mattress.   \n\nSeriously,  go to a mattress store and get fitted for the right kind of bed.   You are two different people with two completely different needs when it comes to sleep.   The two of you need to go in together and test out which style of bed will be best for both of you (I would recommend that you spend at least 10 minutes laying on your side to feel if there is going to be pressure in your hips and shoulders,  as well as if it's keeping your spine straight,  which it sounds like your current bed isn't).   I would also consider replacing your pillows.   It's 30% of your total sleep surface and 20% of your spine is supported by it.   Not to mention that for every 1/2 inch that you neck,  shoulders and spine are out of alignment,  there is 20 lbs of pressure to your muscles and joints and the average person sleeps at some kind of 2/3 inch angle (thats 80 - 120 lbs of pressure on your spine)  which is the main cause of everyone's back and neck pain. ",
            "most importantly - how is the back pain???  ",
            "havent really scrolled through the comments, so not sure if this has been suggested yet, but does your TV have a timer? Mine has the option to set it to 30, 60, or 90 minutes, and at the end of the timer the TV shuts off on its own.  \nThough, I'm not sure why you don't subconsciously roll onto your back after you've fallen asleep. i dont think i know anyone who falls asleep and wakes up in the exact same position every time they go to sleep",
            "I sleep with the tv, i always turn the brightness/backlight waaayyy down to keep the peace",
            "We have headphones set up so that one of us can watch and listen to tv while the other is not bothered by it. You can buy the set at Walmart and stores like that. ",
            "I'm glad the both of you were able to reach an agreement. A lack of proper sleep can rip a relationship apart. I'm glad your husband didn't just expect you to live with the inconvenience. ",
            "Has he tried listening to ASMR videos? I'd highly recommend them. There's a lot of different kinds, so try a variety before deciding",
            "My fiancee converted me from having a tv on, to a fan blowing. Works absolute wonders, and doesnt tempt me into staying up later than I need to! Glad to hear your on the right track, good luck!",
            "If it gets worse I downloaded a sound machine app that sounds like a fan for my fiancé and me! We had the same problem and he loves the new option and I don't notice it ",
            "People actually suggested divorce? geez reddit is something else..  Never ever come here for relationship advice.. if you have taken anything from this i hope it's that..",
            "My SO used to sleep with the tv on when we first met. I couldn't handle it. I compromised with him. Instead we started sleeping with music playing. He actually adjusted really fast. Now we dont sleep with anything on besides a fan. And the fan is only on because of me. Lol. ",
            "What about using an iPod with headphones? He can do that quietly in bed, even under the covers.",
            "Well I know you have a solution but thought I would reply anyway. I need the fan on, I usually fall asleep watching something and I sleep with a face pillow. I also have to coocoon myself and definitely prefer to sleep on my back. (I can drive myself nuts!) The brightness gets to me the most. Get yourself a nice mask or a flat pillow to put over your eyes and crease neatly around your nose. Once creased around your nose you should have full blackness. This helps me to sleep in mornings on the weekend! I pull blankets all the way up under my nose and then I have a neat air hole for fresh air and coocooned blackened comforting goodness for sleeping. I have been sleeping like this for about 9 years now. Its the best!",
            "Who pays the electricity bill/mortgage? These are questions that you need to ponder.",
            "I am very similar to your husband, I have to sleep with the tv on, radio on, or sometimes just a fan, I need noise to fall asleep but not always. If I have complete noise I automatically wake up, it sucks at times.  Maybe a Bluetooth might help him. ",
            "what works for me is  to just have some music preferably classical playing on a low volume  ",
            "I can't sleep at all without watching something. It caused a lot of issues in the past, but I got a £2 slim pillow speaker from Amazon, and use our WiiU gamepad to put something on Netflix and fall asleep. I angle it on the floor so I can see it out the side of the bed (though our bed is really low), and put the brightness right down. It means barely any light in the room, and my speaker is crystal clear with my head on the pillow, but the sound doesn't bleed at all. Of course this would work with any small device with Netflix. ",
            "I have had a good glance and I am really shocked no one has mentioned sleephones, or the pillows with headphones built in. I would seriously consider looking into it! \n\nGlad that communication has helped to begin with though!",
            "this is literally what me and my SO do every single night and its great! We also keep a fan on during sleep for the noise, I would suggest getting a big fan that would be lulling for you both and would keep some sort of white noise around without bothering you at all ",
            "Friendly suggestion, I'm in a similar situation where my girlfriend can't sleep with out the tv. I got her a little table that she has hooked up to her netflix, with the adjustable lightning for the screen and low volume we both sleep great! ",
            "I don't know if there is a difference between a TV, but I use an mp3 player to fall asleep. ",
            "Maybe he isn't into the white noise idea, but what about other kinds of audio? There are plenty of 2-8 hour long \"sleep hypnosis\" or \"guided meditation\" tracks on YouTube that I listen to with headphones and they helped me a lot with insomnia. If he prefers something narrative, maybe audio books would be good.\n\nBesides that, glad things have been working out better for you! Great job on the communication.",
            "Jesus. First world problems with easy solutions.\n\nI listen to music at night. Met girl. Dated. She moved in. Could no longer listen to music at night as it caused her sleep problems. Got sleep phones. Now I listen to music at night and she hears nothing.\n\nGet a sleep mask. Could also have husband get a Roku 3 with a headphone jack in remote or something. Problem solved. ",
            "47 years married. Still in love. Never had a TV or radio (except for an emergency weather radio) in our bedroom.\n\nA little reading, some talking, privacy (when the kids were still home),  a lot of *something else*, and sleeping are the bedroom activities for us. Works well so far :)\n\n\nGlad you guys worked something out to both your satisfaction.\n\n\nWish you all the best and many happy bedroom \"times\" :)\n\n\n*Nana internet hug*",
            "[deleted]",
            "Why not just use the sleep timer so it shuts off after x amount of time. ",
            "I absolutely need the TV to fall asleep, and my Husband needs dark and quiet. We compromised by putting on a sleep timer on the TV. \n\nI'm glad to read you guys were able find something that works for you. :)",
            "I need to listen to something as I go to sleep, so I just use headphones and play a podcast.\n\nThe headphones take a tiny bit of getting used to, but there is no sound or brightness for my SO.\n\nBesides there are all kind of comfortable headphone options, and sticking a flat one under a pillow works a charm through the natural soft amplification.",
            "I know how it feels from his side. I've tried going to sleep with the TV off and I just can't. Unless I take some sort of medication to knock me out I will just lay there the entire night thinking.\n\nLast few years I have used the sleep function but I see you've already said why that option wouldn't work for you.\n\nHopefully everything works out.",
            "What the hell with the comments on the original post? I can't believe this sub has gotten to this point. If I ever have a relationship problem I'm not going to post it here. ",
            ">  I really do think the TV being on is what causes my back pain\n\nwhat......?  What makes you think that?  I have chronic back pain too, just never thought of this as a contributor...",
            "Fuck that.  Break up hit the gym profit.",
            "You could also put on a 30 min -1 hour timer that allows the tv to turn off. ",
            "why couldn't you have worn a sleep/eye mask and some earplugs? ",
            "Slowly moving in with my GF. I sleep with TV.  She can't even sleep if my cell phone light is on.  Clashing issues right now. The other night I went and slept on couch, but then she was upset that I was not in bed.  ",
            "Yayyyy!!",
            "[deleted]",
            "i like to fall asleep with the tv on and im good to sleep after I fall asleep, much like your husband. We have a sleep timer on the tv, set it for an hour and im out and my wife only has to deal with it for a little while. Even if I wake up in the middle of the night I go right back to sleep in the dark.",
            "\"I'm sure this problem will just go away when we get married.  No need to bring it up now.\"",
            "That's so great to hear OP!!!!!! ",
            "Why not just sleep in different rooms? Why make it more difficult than it needs to be?"
        ]
    },
    {
        "post_id": "iju35i",
        "author": "aitacrybaby",
        "title": "UPDATE: I (22M) have always bottled up my feelings, but my GF (23F) wants me to open up more to her.",
        "url": "https://www.reddit.com/r/relationships/comments/iju35i/update_i_22m_have_always_bottled_up_my_feelings/",
        "score": 2413,
        "num_comments": 119,
        "created_utc": 1598861442.0,
        "selftext": "Original:  [https://www.reddit.com/r/relationships/comments/iils7b/i\\_22m\\_have\\_always\\_bottled\\_up\\_my\\_feelings\\_but\\_my/](https://www.reddit.com/r/relationships/comments/iils7b/i_22m_have_always_bottled_up_my_feelings_but_my/)\n\nHi! So, I know it hasn't been long since I posted on here, but a LOT has changed in a such a short amount of time, and I believe this post warrants its own update. Thank you to everyone on this and multiple other subreddits for their kindness and good advice. You helped me realize what I needed to do to get all these years of emotional turmoil out of my system while still maintaining my relationship with my GF.\n\n(TL;DR at the bottom)\n\nMy original plan with Katie was to go on a break (but not break up) while she went out of town with her family for a week. She'd be healing from the loss of her mother, and I'd be looking into better means of handling my emotions than just bottling them up.\n\nWell, I couldn't wait a week to resolve this. Since that night, this whole ordeal had been consuming my every thought, to the point where I thought I was gonna puke from the tension. I was afraid of both losing Katie, and of facing my feelings. I've had these mental barriers up for so long that the idea of them coming down scared me. My mind kept switching between being stoic, and being ready to burst in anger or sadness. I knew I had to let myself feel, but I didn't want to because of how much it hurt, but I couldn't just shake it off like I'd always done. I was scared, alone, and ready to burst.\n\nLater that day, I got a text from Katie asking if I could come over. She wanted to give me something before she left on her trip tomorrow. I headed for my car without a second thought. I decided that if I couldn't handle my emotions by myself, I'd do it with the one person I felt comfortable showing them with.\n\nOnce at her apartment, I did my best to stay calm in front of Katie, but I was already a mess. I was stammering every other sentence, dropping things, my voice and body trembling. It was obvious I was about to explode. Then, Katie showed me her phone. She said her dad had video recorded her mom's funeral, and asked if I'd like a copy to keep. I said yes, and Katie sent me a link to it on her DropBox, and I started watching it with her.\n\nNow, I was there at the actual funeral. The part that made me so close to crying before was when the preacher and family eulogies described Katie's mom: a nurturing, loving figure you could always turn to when you needed it. Someone ready with warm hugs, a shoulder to cry on, a sense of security knowing you were taken care of. Basically, everything I DIDN'T have from my single father. Every other time I've felt the tears coming on, I'd hold them back like a reflex. This time, though, instead of fighting my emotions, I fought the reflex. I let the tears pool in my eyes, and fought hard to keep my hands away from my face. I could really feel it now; all the years of anger, sadness, pain, and other negativity I'd kept bottled up inside were reaching the surface.\n\nThat did it. After all these years of being so afraid to, I started crying. It wasn't straight-up bawling; it was actually a bit forced at first. I wanted the tears to flow, but some part of me was screaming, \"No, stop it! Shame on you! This isn't appropriate for a man!\"\n\nThen, Katie gave me a hug, gently rubbing my back, saying things like \"It's ok,\" or \"Just let it all out,\" or \"you don't have to keep being strong for me.\" At one point, she said, \"My mom always made me feel safe whenever I was sad. Now I wanna do the same for you.\" That REALLY did it for me. I bawled my eyes out like someone just put all of Niagara Falls into my tear ducts. Katie just kept hugging me, and even kissed my head at one point. At first, I HATED how I was feeling; reliving all the fear, sadness, and hatred for everything my father put me through. This was more painful than any physical injury I'd ever sustained in my life. After a while, though, I realized I was finally getting the kind of love and support I wanted so badly as a kid. I didn't know Katie's mom very well, and my own mom even less, but based on how everyone described her, Katie was doing an AMAZING job of living through her mom's legacy of love and kindness. For the first time in ages, I felt like my feelings mattered.\n\nFor the next 3 or so hours, I just kept crying and crying. Of course, Katie couldn't sit there hugging me the whole time, but she did her best to keep me comfortable as I cried out 7 years worth of tears. She brought me tissues, water, gentle back rubs, and more hugs when she could, letting me know I could \"take all the time you needed.\" She's such a trooper. Not even my own father had this kind of patience for me.\n\nWhen I was finally done, Katie offered to have me spent the night with her. I was too tired, puffy-eyed, and had too bad a headache to drive safely home, so I graciously accepted. She later ordered my favorite takeout for dinner, and we finished the night with Stranger Things, and a make-out session. Katie's definitely a keeper.\n\nKatie's out of town now, but I'm still looking into effective techniques and methods for letting myself feel and cry again (if I have to.) I know all my problems didn't just disappear in one night, so I'll be seeing counseling regularly once my community college reopens in a few weeks. Hopefully, Katie will be feeling well enough from her loss to come back to class with me, too.\n\nTY for listening. :)\n\nTL;DR: After years of bottling up my feelings, I finally let myself cry (with my GF's help,) and I feel MUCH better about it.\n\nEdit: For those of you concerned that I'll start treating Katie like my mother or therapist, don't worry, I'm determined to prevent that from being the case. I can't afford therapy ATM, so I'll be seeing a counselor once my community college reopens later in September. I've also been looking into additional resources, like free online counseling.\n\nAlso, TYVM for all your kind words, advice, and awards! I didn't expect this post to blow up like this!",
        "permalink": "/r/relationships/comments/iju35i/update_i_22m_have_always_bottled_up_my_feelings/",
        "comments": [
            "Pro tip: you can practice naming your emotions. Maybe you can do that every day, take some time to think and identify how you are feeling. You can even keep a journal.",
            "Ah, I see you've discovered the crying headache, drink lots of water and sleep that's the way to get rid of it",
            "I can tell you from experience bottling up your feelings only ends in pain and hurt. At 22 your probably thinking  im fine but if you keep doing that for say another 20 years you will implode. \n\nIts not healthy and you should and need to find away to cope express and deal with those feelings. In a positive way.",
            "> I didn't know Katie's mom very well, and my own mom even less, but based on how everyone described her, Katie was doing an AMAZING job of living through her mom's legacy of love and kindness. For the first time in ages, I felt like my feelings mattered.\n\nTell Katie that. Hell, text it to her now. If someone felt that way about me and told me so? I'd carry those words in my heart the rest of my life. \n\nI'm so happy you have someone as amazing as Katie in your life, and I'm happy for her that she has you. You are a good person.",
            "Hey nephew, courage and vulnerability are two sides of the same coin.  Good work.  You deserve to be free of that weight.   Keep going.",
            "Hey man. I'm 21F and i have SUCH a hard time showing my emotions to others. Not for the same reasons, since i'm not a man, but because i often had to be the caretaker for my siblings and my father would ridicule me for crying when he would yell at me.\n\nI'm learning about how to open up too. It's hard. It's so hard. But my girlfriend is a lot like Katie - she's very patient and she \\*listens\\* to me, which is something I need. I really hope you guys can stay together for a long, long time.\n\nMy advice? Sometimes it's nice to schedule a time to cry! If something hard happens or if you're just having a rough day for mundane reasons, say to yourself \"alright, at 3pm i'm going to be by myself and have a nice cry\". It's super cathartic and it can really help you normalize crying to yourself. :)",
            "Just wanted to pitch in and validate that yeah, she’s a keeper. Take care of her.... and yourself. It’ll be hard at first but exploring your emotions will eventually become natural, even enjoyable should you choose so.",
            "I am very proud of you! That is incredibly strong of you! To accept and actively work with that many years of bottling your feelings in that way is nothing short of an impressive feat! You have made fantastic progress and by actively working toward dealing with your emotions in a balanced and healthy way I bet you will turn into one incredibly empathic and fantastic person. Trust me, you will definitely start feeling more at peace the more you progress, no matter how unsure, strange and rocky it might be atm. \n\nGo you and what an amazing gf you have!",
            "I'm proud of you! I didn't see your original post but I did read your whole update, and I'm glad you managed to overcome your fears and let down your walls to your amazing gf.\n\nI'd like to give you a very gentle reminder... Her mom did recently pass and just be careful to not overwhelm her (everyone is different). There's this thing called \"carrying the emotional load\" in a relationship, mostly in reference to women supporting their partners emotions while not receiving the same in return, because their partners cannot manage their own feelings. You're working on yourself (great!) But don't forget you are in a partnership 😊",
            "I'm so proud of you! This is the start of a much healthier you (I won't link them, but there are countless studies linking the suppression of negative emotions to physical health). \n\nI just want to chime in and say that while your gf is clearly an amazing person, please acknowledge that in the middle of her grief she was taking care of your emotional needs. This should be a one-off, and she cannot be your emotional guide right now. While seeking professional help, please also try to establish help in your existing social circle that isn't currently providing support to your gf. \n\nFor some interesting discussions around the socialisation of men and emotions I can highly recomment r/MensLib.",
            ">\"My mom always made me feel safe whenever I was sad. Now I wanna do the same for you.\"\n\nBless Katie and her mom. This here is true, healthy love. As someone who also found someone who makes it feel safe to express emotions (my parents didn't know how to be emotional supportive in a healthy way), I know how damn relieved you must feel to find someone like this.  I really hope you do go into counselling/therapy and I hope it helps you find a healthy way to express your emotions on a more frequent level. Someone in the comments is advising you to try to name emotions and journal it -- I second that. It's helped me a lot throughout the healing process.\n\nWishing you and Katie the best, dude.  \n\n\n( Edit: Spelling. )",
            "I’m 30 and have recently learned to address my feelings. My friendships have tanked due to lying and concealing how I feel, my family relationships have tanked due to my lying and concealing of true feelings and my relationship with my SO is tanking due to lying and concealing and hiding.\n\nBe open with your feelings. Be your true self, say it how it is, believe in something and stick with it.",
            "My mother used to berate and lecture me whenever I expressed emotions that didn't agree with her worldview. I learned to clam up too. \n\nWhat really helped me was to actually start telling some of my personal stories as little snippets to various friends. It helped me to realize that opening up didn't always mean a big emotional session, but I got to see how my friends would be supporting, and sometimes open up in response.",
            "My husband and I are in counseling and recently discussed a similar topic. He shuts me out of his emotions, in part because of how he feels I invalidate his feelings (I know not your issue). Regardless, our therapist told him to acknowledge how he's feeling daily to himself. To start processing his feelings. (E.g., I got angry when X happened because of Y.) Maybe this involves writing it down in a journal, maybe just in his head. But then he should practice bringing up one thing that he was feeling in the day (or doesn't have to be every day) to me. And I just listen.",
            "Man I'm proud of you this is hard stuff. Our culture asks men to amputate their feelings and use women as emotional crutches/labor by proxy. It's very hard to become 'fully human' because of all the training we received about proper gender roles and expression. And frankly it's killing men. They end up being far less resilient in the face of divorce, loss, and other difficulties.  \n\nI had a very hard time showing my feelings when I was 22 I don't think I'd cried in years and I had a lot to cry about. I'd had a lot of loss. I started working with a teacher that did a very active form of yoga and meditation, which you'd think was totally unrelated to feelings, but the more I tried to get calm and into my center the more stuff came up. It was like I was a lake and the calmer the surface the more the crap at the bottom started to rise up. It was very hard work. I broke down crying in those sessions over what I perceived to be the littlest things. It was hard to take. \n\nI realized that adage about being reed that bends is far stronger than being a tree that breaks in a storm. I wanted to be flexible inside. That flexibility is its own strength. It got easier and easier to let emotion move through me without it totally torquing me up. It took several years of that work to be able to do that by the way. The net effect being that I can handle my and other's emotions a lot better. I don't sit in judgement any longer about what I may feel. I just acknowledge it.",
            "I (50M) understand what you have gone through.  I was an emotional child, and my parents were divorced at a time when only one other kid in my school had divorced parents.  My father was probably more like me, naturally emotional, but he kept his emotions buried and taught me to do the same.  I am really glad that you have found someone who wants to be there to keep you safe while you start letting those feelings out.\n\nI'm also a clinical social worker, and if you need assistance finding therapy, I think you would find it beneficial.  I am a therapist, and I love being in therapy.  I wish everyone were in therapy.  If you just want to chat, let me know.  I feel ya, brah. 🙂",
            "What have you been doing to bring comfort to her during this hard time? (a detail that is remarkably absent from this post and the last)",
            "Have you looked into therapists that have a sliding scale? I haven't had much luck but there are therapists who offer a \"sliding scale\" of pricing for people who can't afford it.",
            "As an internet stranger I wanted to say condolences for Katie's mom, but also that I'm so impressed to see how the both of you took initiative in trying to solve this issue between you all while keeping the other's happiness and well being at the forefront. I think you both seem like wonderfully mature and caring individuals and it's lovely that you found a solution together. Katie is definitely a keeper and not the kind of girl you'll meet often in this world, so definitely do your utmost to honor and treasure her because I'm sure she does the same for you.\n\nI just wanted to add something as someone who's very much a nurturer and empath in personality. When I first met my boyfriend he was also very stoic; not necessarily afraid of showing emotion but just not the kind of person who would open up to me or reveal intimate thoughts and feelings. As time went on and we got closer I always tried to get him to open up a bit more to give him the chance to test the waters and see what kind of reaction I would have to him revealing more and more. Eventually, when he saw how much I cared about him and how I only had his best interest at heart and that I never judged him for any thought or emotion he showed me, he became a lot more comfortable with being vulnerable in front of me.\n\nMy point is: someone like Katie will never judge you no matter what you share with her, and I guarantee that just seeing you take this step with her means a lot to her. When you come across a nurturing, patient and loving person like she seems to be, you've found yourself a gold nugget because nurturers never give up on the people we care about. We'll always listen without any judgement or incendiary reaction, so you safely open up to us as much as you want or need to, at your own pace. As long as we feel you're actively making an effort to be better, we'll stick around for the long run. So please don't be afraid of vulnerability in the future and move forward at your own pace. You've got someone there who cares for you a lot. I know you two will be fine :)",
            "I’m just really proud of you for knowing that it’s worth it to work through this so that you can feel things emotionally in a healthy way.\n\nIt will be hard, but sounds like you have a great starting place for sure, and awareness to work on you for you, not just look to Katie to solve this. Keep going and good luck!",
            "My dude, I don't know you, but I'm SO happy for you and Katie. The fact she was able to be so nurturing even through a pain so great herself, it's just amazing.\nI've been working with my own bf, who used to bottle up his feelings as well. Seeing his true personality show when the facade goes down, this is just magical. It's worth every second.",
            "I’m so proud of you! It seems like you and Katie have a great partnership. Your communication skills and vulnerability with each other is wonderful to see, especially considering how young you are. I hope things continue to go well for you!",
            "Of course therapy is the best solution, but if you want to try it yourself I have a few things that might help. And Katie can help too, as you experienced. \nThink of actions that trigger feelings + your reflex. Go a haunted house together to feel fear, watch a sad movie and try to tell Katie what makes you sad. Go on a date together and think of stuff you liked. You know she will be there and listen to whatever feeling you have. So when you are feeling lonely, instead of thinking that it's not manly and you don't need anyone, try texting her: \"I miss you😘\". When you're feeling sad and it's too hard to tell her, ask if you can come over and just cry it out. Crying helps to clear out what you're sad/frustrated about.\nI'm also not good with emotions, and I used to bottle them up until I explode in tears or anger or both, but in my experience expressing my emotions when I feel them(could be mumbling \"fuck!\" under my face mask, or saying no / starting a discussion when I don't agree) help to get over the event and go on with my day without getting insane. I don't know if this will help, but I do wish you good luck!\n\nPS: don't hesitate to tell Katie how much she means to you",
            "I know this will get lost in the comments but order the game, \"Ungame\". It's used by therapists and the like to encourage communication. You have two stacks for prompts, one that's a bit more lighthearted and the other for deeper more serious conversations. Ever so often my husband and I will take it out and play, we flip between the two and we end up talking for hours and learning more about each other. It's great because while he's a talker and can open up, I have a much much harder time. This has helped a bunch and our relationship has become so much stronger!",
            "Therapy, therapy, therapy!! It’s okay for Katie to have helped you open the floodgates but now that you’ve started you need an appropriate avenue for spilling out your emotions. \n\nHealthy people typically have a larger support system they can trust with smaller tidbits of their emotional life. For example I have a few friends I can talk to about relationship issues, a few different friends I can talk to regarding spiritual things, a few different friends I can talk to about my fucked up family, a few different friends I can talk to about my coping mechanisms/my journey to healthier ones, etc, etc...this is a network I have for myself of ~15 people with some overlap, because they way I process, unfortunately, is venting. I spread it around so no one gets overwhelmed until I can afford therapy (which is next month and I’m SO excited).You said in your post, though, that you only trust Katie.\n\nEven if she wants to, even if she’s able to comfort and be patient with you, she cannot be your sole support. She cannot be the sole person you spill everything to. For one, she isn’t trained, so even if she means well she could a) mess up in a response or b) burn out emotionally supporting you.\n\nThis is NOT because you are “too much”. This is because humans are a social species and we’re not meant to keep everything inside, we’re meant to “share the yoke”, so to speak. As you have personally experienced, one person taking all of that on is too much to ask long term, unless they are specifically trained to do so for both your health and their own.\n\nPlease, continue confiding in Katie, but also do what you can to find additional outlets to continue to express yourself. Therapy is ideal, but guided journaling (self help books are  👌🏻👌🏻👌🏻, I highly recommend Adult Children of Emotionally Immature Parents by Lindsay Gibson. Whatever your dad did do for you, this is an area he did very badly.)\n\nYou deserve to feel your feelings, especially the hurtful ones so that they can pass through you. Every man does. To be afraid of crying is to be afraid of your very self, so the fact that you were able to cry anyway? To express yourself and this pain? That you worked to do it? That’s not weakness, that’s strength. \n\nIt is, ultimately, honesty. Honesty is not a weakness. “Men crying is a weakness” is not a truth, it’s a lie of a power fantasy.\n\nYou overcoming it means you will be able to experience true intimacy.\n\nYou’re doing great and I’m so proud of you. 💜",
            "Good for you! \n\nListen though: Katie just lost her Mom. You need to be supporting her, not the other way around. Right now Katie should not be comforting you. \n\nLook into online therapy options. See if you have friends or family to talk to, do some research, kerp posting. Yes, you should open up more to Katie. But dude ... Her mom just died. She should be crying on your shoulder, not you coming to her for comfort and validation!",
            "Honestly, this is good for you but I can’t help but feel awful for your poor girlfriend. You need your own therapy, not burdening her with all these emotions and making the loss of her mother about you and lack of a good parenting figure in your life. Katie just lost her MOTHER, and had to comfort you all day and for hours. Shouldn’t you he the one supporting and comforting her?",
            "Dude. Good for you. There is no shame in being sad, and in crying. Those are emotions. Having emotions is part of the human experience. You are not being weak, you are being human. :) \n\nI'm in a similar but different situation in that my partner has a hard time letting out any feeling other than anger. Plenty of it is due to things in our relationship over the years we have been together. I think we've reached a breaking point, and I'm worried that it might be too late for us, but if I can give you advice, don't hide your emotions anymore. It's not worth it. It creates so many fights where all we have to do is just talk to each other like people. I'm really happy you were able to let this out, and I thank you for sharing your story. Please be good to you and her, and don't let yourself shut down anymore. Your mental health, and your relationships will thank you.",
            "Dude, you're my role model.",
            "This was so beautiful if made me cry ♥️ I’m so sorry you’ve been through this trauma and pain but the way you are handling it and taking responsibility for it is truly incredible and your partner is really lucky",
            "I’m still working on letting these feelings out, and feeling like they are really processed, from things that are years old but I gotta agree with you that it’s an amazing feeling when you do let it out. We lost one of our dogs to old age a few months ago and after having a big cry about it, I couldn’t believe how much better I felt. And almost immediately after, I was able to look back on that pupper with really happy emotions. I haven’t had the urge to cry about it since, and I’m a very emotional person.\n\nI’m happy for you! Keep yourself open to truly experiencing these feelings, acknowledging their validity and your validity in feeling them, and be there for those you love when they need to do the same.",
            "I’m happy for OP. Continue growing. I’ve come to realize that unless someone tells me that what I’m experiencing is sad I feel that I don’t have permission to experience the emotion. I have not ever felt comfortable experiencing anger and rage. It’s something I’m working on.",
            "[deleted]",
            "I'm glad this worked out. I've heard horrible stories from both men and women about how women can sometimes treat men when they open up and are vulnerable. You got a good one and the type of woman I aspire to be.",
            "Good for you, that toxic masculinity shit hurts everyone",
            "“now i wanna do the same for you” :,)",
            "It takes an impressive amount of strength to be vulnerable like that. But... it also allows a closeness that is unique and powerful.\n\nI am happy you are starting on your road to recovery. ❤️",
            "I’m really glad you were able to let yourself be vulnerable with your girlfriend, it’s scary but something you really needed. I hope you two continue to love and support one another!\n\nTherapy will be a big help with just being able to talk freely and learn coping mechanisms and communication techniques. \n\nAlso, great choice of show to watch with someone you love! What season did you two end up watching?",
            "You write beautifully. Some times its much easier to write, where you have time to edit and reflect and watch your emotional responses. That can be harder to do in an in-person dialogue. You can try to start writing out feelings to Katie in emails, texts, even letters and postcards. \n\nBest of luck!",
            "You have feelings and they DO matter. Congratulations on taking the enormous leap of letting yourself be vulnerable! I know all too well how frickin difficult that is. Keep being true to yourself!",
            "As someone who has also bottled everything up to be strong for everyone else, for what it's worth I'm proud of you. I know the feeling trying to force yourself to be allowed to cry. I'm 34 and still can't get past that. I've managed to squeeze out a few years and force myself to cry for a minute or 2 but it's still a struggle. \n\nDoesn't help that my ex wife wanted me to open up as well and when I finally felt safe enough to, her response was for me to get my shit together....hince now ex wife!",
            "I'm really happy for you 😊",
            "I really reccomend looking at different apps.  There is one I use called mood space. It includes different techniques my therapist recommended (they didn't reccomend the app I found it later at the time I was journaling). My point being there are many different free resources you can find on your phone or online. Obviously doesn't replace therapy but it can get you started and it might cover \"homework\" a therapist would give you.",
            "My partner often bottles up his feelings until there is a release, he will be starting counseling soon. I hope you find a way to handle your feelings appropriately. I'm sure counseling will help with that a lot.",
            "The workbook Repeat After Me helped me recognize negative thought patterns from my childhood even more than years of in person therapy. \n\nIt can be intense but with the right support system it is manageable.",
            "Your update made me cry. I’m happy you got it out. I hope you find the right counselor who will help you through this. If you feel like it’s not working, try a different counselor. \n\nAs you heal, your dad might be interested to know that you’re healing. \nMy mom treated me the same way as your dad treated you. My dad was quite the opposite, so I knew when I could relax and when I couldn’t. \nYears later, I told my mom how she affected me when I was growing up. \nIt turns out she had an underlying issue that affected her deeply, and she was doing the best she could. Understanding her helped me further. \nIt also helped me to not repeat the pattern. \nIf you have kids, strive to be a better father than you had. You’ll enjoy them a lot!",
            "A couple of decent resources here on Reddit would be r/Menslib and r/attachment_theory.\n\nMenslib is a pretty open-minded sub about questioning traditional masculinity. I recommend the attachment theory subreddit because you and your partner can do an online quiz to figure out your attachment styles and then learn how to better communicate with each other.",
            "You seeing a free community college counselor is brilliant and you're doing an amazing job of helping you help yourself ❤ keep in touch with your counseling department at your CC, they usually have resources and ways to keep seeing them during the pandemic. \n\nYou're essentially my hubby, just 13 years younger. It took him a long time for communication and feelings to really show in our relationship because he wasn't allowed to before me. You'll really thank yourself after, instead if the mental breakdown and hospital visit we had either my hubby. \n\nI'll tell you what I told my hubby: Cry it out, man, give me an excuse to order take out and ice cream and nurture something...now we both feel better 🤷‍♀️",
            "You’re so courageous for facing this fear and insightful in how you approach it. I think you’re going to end up just fine.",
            "Good for you! I'm so happy that you found a release and a safe person to share it with.",
            "Check out fearlessman on you tube. Great perspective on processing emotions.",
            "Look into cognitive behavioral therapy. I have PTSD from multiple cases of abuse from my dad and many other traumatic events. Not much helps but CBT really helps you gain perspective, live in the moment and rewire your thoughts to whatever you'd like to reflect in your reality.",
            "You express your feelings very well in writing. Maybe try writing a letter or email (or even a text) sometimes if you find it hard to express yourself in person.",
            "I  love all of this dude. I wasn't gonna reply but here I am.\n\nI am so happy that you are opening up more and feeling feelings and emotions. Men die by suicide 3.53x more often than women so shit is no joke.\n\nI was raised in an environment where emotions are not expressed. I think that for you, and my brothers, its especially dangerous. Y'all live in a world that says you doesn't want you to express emotions, let alone being brainwashed by a parental figure. \n\nYour feelings matter and shouldn't always be bottled up. I really need you to remember that for a fact. You do not always  need to be strong. I'm so happy that you were vulnerable with Katie and I hope you continue to be. \n\nI read some other comments and agree with journaling, naming emotions and feelings. Try to find a counselor/therapist with a sliding scale based on income. \n\nMuch love",
            "Hey not sure if anyone’s recommended this to you already, but check out the sub r/CPTSD. It’s a great and supportive sub, and has helpful resources like books and such in the sidebar as well.",
            "See a good therapist. I had the exact same issue with some other ones as well and therapy does wonders. I was afraid of showing my emotions to a point where I was afraid to laugh loudly or kiss my mom. Therapy changed it within weeks.",
            "You can download Daylio for you to track what you feel. Been doing it for almost 2 years now.",
            "wow. katie sounds like an angel",
            "I have the same kind of history growing up. Not allowed to feel the emotions and told to be a \"real man\". It has been a long road to get to the point where I can feel and express my emotions. Nowadays I see my own vulnerability and emotionality as my strong side and integral part of my masculinity. I feel that I'm stronger than before because I'm not afraid to cry or express my negative and positive feelings. I've also found that women are more interested in me now as this makes me emotionally more mature",
            "I’m so sorry for everything that’s happened to you . I know I don’t know you but if you ever need to talk I’m here . Also I’m so glad you and your girlfriend are at least a little bit better now . It’s going to be hard working past it , to be able to show your emotions but just know your girlfriend is always there for you . She sounds like a great person.",
            "Your father was right, but only as a father. You are lucky mate, your girlfriend is a blessing. I'd say chrish every moment with her. Your father really did much for you to grow up to be a great man. You just didn't really got the kind of love a moyher would have provided. A mother is there for emotional support after all. \n\nNo offence, I felt that you were blaming your father, it might not be your intension, but blaming isn't the key. What seem obvious to us was forbidden to you all along. You matter, please remember that. Nobody deserves to through the mindset you were going through. You have right to show every emotion you can think of! Or you won't be a human let alone a man. Bottling up your emotions is just running away from everything. You are no robot, you are a human, live like a human, and good luck, live a good life!"
        ]
    },
    {
        "post_id": "bn0r7r",
        "author": "Throwaway01101927",
        "title": "[Update]I (26F)made a pros and cons list about my bf(28M) because I’m desperate for clarity. (Together 3 years.) Is it salvageable?",
        "url": "https://www.reddit.com/r/relationships/comments/bn0r7r/updatei_26fmade_a_pros_and_cons_list_about_my/",
        "score": 2410,
        "num_comments": 160,
        "created_utc": 1557507549.0,
        "selftext": "[Original Post Here](https://www.reddit.com/r/relationships/comments/bltkvn/i_26fmade_a_pros_and_cons_list_about_my_bf28m/)\n\nSo my last post wasn't that big on here, but since a lot of ya'll were very helpful, I wanted to update you guys. \n\n I sat my boyfriend down (with a dairy queen blizzard lol) to talk to him about why he stopped going to therapy before we dated, and how his cranky/sad/numb/back to happy days were taking a toll on me, and whether he would consider going to therapy with me. He stopped me there, and told me how he's been feeling the past few months. He told he how exhausted he is from feeling like he's disappointed me. And how he feels like he's walking on egg shells because if he disagrees with me on certain things, I get upset(to clarify- I'm a very sensitive person and if I feel misunderstood in a conversation, I will cry. This has led to him feeling like he can never be blunt or he has to be very careful in how he words things.) Which is totally valid and something I'm gone to therapy for in the past.\n\n\nIt was obvious to me he was wanting to break up from the first few minutes. We spent the next couple hours talking about where we both went wrong and apologized to each other. I told him I was so sorry for making him feel like I wasn't proud of him and made him feel like he couldn't relax or be himself. He told me how sorry he was for letting himself go. He also said he felt like he was holding me back in a lot of ways and that we both seem to be better versions of ourselves when we're by ourselves, which is probably true.\n\n\nWe held each other and cried a lot. He said he has a lot of respect for me and that I was worth every headache and asked me to please never date someone who isn't worthy of my time. I told him if he needed to go to bed or have some alone time to go smoke that was okay, but he said, \"I've left you alone too many times in our relationship. The least I can do is be there for you tonight and hold you.\" <<<<<--ughh kill me, i love him so much...\n\n\nI'm beyond devastated but I know this is for the best in the long run. A relationship shouldn't be this hard 3 years in. I had no idea how much of his unhappiness was due to me. It hurts, but now I know what I need to work on going forward. I deeply appreciate him coming out with the truth and initiating the breakup because if I thought he wanted to stay together, I don't think I could have gone through with it. I'm not strong at all. I just set up an appointment with my therapist. I hope he can give me something to help me sleep the next few months because I'm worried how this will affect my attendance at work and such. I'm currently waiting for him to get off work so we can start deciding who is moving out(i told him he could stay but he may be moving back to the town his family is in so idk) and how we're going to tell people. I'm going to miss him so much. I feel like I'm dying and feel so sick to my stomach but I know it will get better in time. I hope he finds happiness going forward, he definitely deserves it.\n\n\nTL;DR: My boyfriend was questioning our future just like I was and we broke up.",
        "permalink": "/r/relationships/comments/bn0r7r/updatei_26fmade_a_pros_and_cons_list_about_my/",
        "comments": [
            "I don't know you, but I'm so proud of you both. You were thoughtful, honest, and considerate of each other. You both acknowledged your difficulties and mistakes. You made a civil break out of respect for yourselves, and for the other's welfare. I know it stings a bit right now, but really, you did the right thing and you're both good people. I wish you both all the best in the future.",
            "This is an amazing story. It is clear how much you both love each other. But sometimes things don't work out. It is very painful but all you can do is be grateful for your time together and start to heal. As someone who has gone through something similar, I know how it is likely one of the hardest things you have ever gone through. But you will both be happier for it one day, even if you can't see it right now. Best of luck in your healing journey.",
            "I am sitting here crying my eyes out. I could have written your first post. And I’m petrified that in the near future I could be writing this very same update. Loving my boyfriend hurts. Fuck 💔",
            "I (41f) have written this with very few variations.\n*hug* I get it so much. I have to do this in the next couple of days. My boyfriend/best friend (38m) has been distant for a while... he hurt me really badly a few days ago. We’ve talked about separating our lives from each other. I’m sitting here crying because every time I think of not only losing my bf but my bestie. \n\nUnfortunately I’m sure going down different paths is the best thing for him. \n\nI don’t know what I’m going to do without him. We’ve been friends for so long and he has always been my rock. The one person I didn’t think I wouldn’t hurt so badly and vice versa.",
            ">A relationship shouldn't be this hard 3 years in.\n\nThat. That's what it's all about. You should be able to deal with your partner's shortcomings, but only if it feels right. \n\nThere are always ups and downs in a relationship, but eventually, a good spouse should make your life easier, not more tense. You'll get better, with time. Hugs.",
            "I can't tell you what's going to happen in the future, but I will say this - sometimes people need to be apart before they can be together. Sometimes people need to grow on their own before they can be with someone.\n\n&#x200B;\n\nOf course, I can't tell you how your story will turn out. But I think you're doing the best you can do, given the circumstances. Keep moving forward in your life, and hopefully he does too, and trust that if it's meant to be then it'll happen when the time is right. \n\n&#x200B;\n\nBut the key, I think, is to not be mentally dependent on a reconciliation happening, even if it ultimately does happen. If you reconcile down the road, it'll be after personal growth happens for both of you, but true growth only happens when you're doing it for the right reasons - i.e., doing it for yourself.\n\n&#x200B;\n\nI'm sure most people here don't really believe in the idea of \"meant to be\", but I really do believe that if two people are meant to be, they'll find their way back to each other eventually. You just gotta trust the process, painful as it is sometimes.\n\n&#x200B;\n\nSending you lots of love <3",
            "I think this is hard but best for you both in the long run. Maybe you’ll both meet again as better versions of yourselves and who knows? Well done for your emotional maturity OP! It’s hard to acknowledge your own faults and you’ve done so.",
            "Sometimes relationships aren’t meant to last forever. I’ve had romantic relationships and friendships end, and I still cherish our good times.\n\nHopefully this relationship helped you narrow down exactly what you are looking for in a partner. Sending love your way!",
            "Sorry, but don't you dare blame yourself for 'his unhappiness'. \n\nYou've said that he's been this way throughout your relationship with the sad/mad/cranky episodes, and if that was all down to you then he could've ended things much sooner. You can't blame yourself for someone else's actions and emotions.\n\nI really think you should write out a list of ways that you **helped** him in his life (or at least did your damn hardest to try to help), and you'll probably see fairly quickly that this isn't even nearly all your fault like you're making it seem in your head.\n\nChin up, you'll get through this and realise that while you had a good relationship *some of the time,* someone else will come along who'll give you a relationship where it feels good *all of the time*.",
            "You're going to be alright. Great even. You're growing.",
            "Both of you seem to love and care for each other. Both of you agree what the problems in the relationship are (poor communication on both of your parts, he has \"let himself go\" emotionally).\nNone of those problems seem like a fundamental incapability, but just the kind of thing people have to work through and overcome whether single or partnered.\nAs someone who has had extremely similar issues to what your boyfriend is dealing with, this breakup sounds like an excuse to really let himself go on a downward spiral.",
            "I'm amazed at how you've both dealt with it and come to a conclusion that is incredibly difficult to make. It's a great thing, but it probably feels like the worse... I hope it does work out for you both, and that you both continue to be good friends if that's the direction you want to go, or that you both manage to find a new way towards happiness if that's the way you want to go :) Bless you both.",
            "I just wanna give you the biggest hug! 😔💕 my ex husband and I had this same type of ending. It’s very rare that you have a loving, respectful, meaningful conversation that leads to going your separate ways. \n\nI wish you the best!!",
            "I broke up with a girl i dated for 2.5 years for similar reasons. We talked and cried for at least 4 hours and I ended up having to drive her home in my car, while my mom drove her car, bc she was crying too much to drive :(. ‘twas for the best too but a relationship died that night and the last hug was one of most the deepest pains i’ve ever felt.",
            "[deleted]",
            "Although I'm sad for your hurt and loss, this was really nice to read. You two handled yourselves so gracefully in this breakup and seem to have a genuine love and affection for one another. This level of maturity and respect in the disolution of a relationship speaks highly of both of your characters. I have a feeling you are both going to do very well, even if not together. Hope your heart heals quickly, OP.",
            "I had a mutually respectful, mature, heartbreaking breakup from a 3 year relationship, and there were times where I was tempted to go back because it was so comfortable and we shared so much together, but if you get back together and you're just gonna be miserable again, then it's time to give it up. \n\nJust because your relationship is tumultuous doesn't mean that it's doomed\n\nBut also, \n\nJust because you respect and love each other doesn't mean that you shouldn't break up.",
            "Your first post resonates with me in many ways....\n\nI'm scared to have some blunt conversations with my boyfriend because past attempts have not gone well. I love him so much and really see a future together, but certain things definitely need to change. On both of our parts",
            "You both left the friendship door open in the future it's sad but the reality is sometimes it doesn't work out.\nTakes less energy to hate someone than deal with mutual respect and good feelings. \n\nYou will be able to be fond on this in 10 years speaking as someone who can now look back on 10 years ago.\n\nYou live and learn :)",
            "i couldve written this all, almost exactly, a year ago.\n\ncan confirm: it gets better <3",
            "That’s a gut wrenching feeling. Waking up sux. \n\nIt will fade. Give it a week for the worst worst and then another two for the worst. Cry cry cry.  \n\nI just think that if you have to wonder about whether you will break up etc that he’s not the right person.  Your soul knew but your head/heart combo got you all tied up too much in attachment and hormones to want to leave.",
            "I have a question. Are you guys open with getting back together? I’m experiencing something that is close to your experience. My ex and I both agreed that maybe in the future, we can work things out. However, is that really realistic? Just wanted to hear your opinion. Best of luck to the both of us for our healing journey!",
            "Yeah, unfortunately it’s not enough to love each other. Sometimes it may just not be the right time and there are things you can’t overcome. It happened to me, but then I met someone where we were able to overcome the challenges. You’ll get through this!",
            "> I had no idea how much of his unhappiness was due to me. It hurts, but now I know what I need to work on going forward. I deeply appreciate him coming out with the truth and initiating the breakup because if I thought he wanted to stay together, I don't think I could have gone through with it. I'm not strong at all. I just set up an appointment with my therapist. \n\n\nHey, I just wanted to comment on these few lines- a lot of times, people find ways to pin their unhappiness on whatever is out there that isn't themselves.  Until they're willing to work on things, they'll be unhappy no matter where they are or who they're with, they'll just have different ways to explain exactly how that particular set of circumstances contributes- but really, it's coming from within.\n\nIt does sound like you guys weren't right for each other, but please  don't blame yourself TOO much.  You are strong enough to work on yourself and admit when you need help, and that's stronger than a lot of people will ever be.",
            "Not to attack you OP, just some insight into the other half of the whole picture.\n\nIn light of you sharing this update it seems like you may have been projecting your own issues with mental instability onto him. This isn’t to say he doesn’t have his own issues that need to be addressed, but I think by ignoring the fact that you were the one who was always ‘too sensitive’ and had to be treaded around may have lead to you perceiving his issues as way bigger than what they were. \n\nFrom personal experience, I think therapy is a very overused method of overcoming a slump which can be treated with a few weeks of exercise, eating enough fibre and protein, getting enough sleep, and focussing on your long term goals. The fact you were constantly pushing him into therapy when he probably didn’t need it most likely came off as very demanding and slightly inconsiderate of what he really needed.",
            "\"A relationship shouldnt be this hard after 3 years\"\n\nYou sound an awful lot similar to my husband and I's dynamic. Weve been together for 11 years. Relationships are NEVER easy. My dad told me this: \"you cant choose who you fall in love with, but its  choice to *stay* in love.\" Both parties need to be on deck to fix the relationship. But, to each their own... it sounds like you both were over the relationship. \n\nI wish you luck on your journey. Whatever is meant to be, will be.",
            "True love is knowing when it's time to stop and walk away without hurting those you love.",
            "It is much better to end it on this note than to continue something that hurts you both. I'm proud of your decision. Time will help.",
            "All the feels. Consciously uncoupling is a very healthy way to end a LTR. Good job recognizing you need help and getting back into therapy. You are stronger than you know and thanks for sharing your story. <3",
            "Stories like this make me afraid to fall in love, i've loved women before, but i don't think i've ever been in love before. Nobody has ever had such a profound effect on me that i threw caution to the wind and gave them my everything. As much as i want to, if it didn't work out because of something we had no control over it would shatter me, because i've been starved of it my entire life and i want it so desperately to fill the hole i've always felt i'm missing. Everyone wants pure, sincere, genuine and unconditiinal love, at one point it was just a biological function to encourage breeding for most people, but after being romanticized in movies, literature and music it's become so much more than that. It's something people will pursue to no end to obtain, and so many people will never get a taste of it, let alone have it be reciprocated back. \"You can die for it, or die trying to obtain it\". I wish you both the best, and part of me is imagining one day, when you're both more mentally fit to tackle it, you'll try again and succeed with flying colors.",
            "This must be so hard for you. I’m so sorry you are going through this.\n\nThis has only just happened for me too and in a similar, sad way.\n\nIt’s so hard when you are still in love with each other and still hold desire and warmth for the person. My and and I are two days post our breakup and I am a mess. \n\nHe broke a lot of my boundaries in our relationship and I have been very hurt and betrayed by him but He was also the calmest, most tender and patient man I ever met and when it was good it was very good.\n\nI’m getting through by focusing on one day at a time. Just get through to the next day. I’m told time makes it better so I’m waiting it out.\n\nI hope it doesn’t take too long for you \n\nLove to you all",
            "Actually, the third year is the most challenging year of every relationship. It a go or no-go time. I broke up with my ex around that time because I feel like I am not growing. He was preventing me on things I want and passionate about and I know that will do no harm to me. Sometimes letting go is the best thing to do and I am happy now with my new partner. We talked about our exes and what went wrong so that it will not happen the second time around. Also, we talk a lot about finances because it really is important.",
            "Dude none of that \"I'm not strong\" bullshit. You made this decision, you looked at your actions and his and decided to part ways to better yourselves. THAT IS SO GODDAMN BRAVE AND STRONG. Do you know how many people stay in shitty half assed relationships because they're afraid of being alone or facing who they or their partner really is?? Holy shit!",
            "Oh God, I'm crying. I'm sorry for the brake up and it's clear how much you two love each other but it's really for the best and you made the right choice.\nThat's the worst and best way to brake up with someone: if there is respect and even love, you will find how you helped each other even in future relationship.\nI wish the best for both of you.",
            "This one is so tough but it really sounds like it’s the right decision for both of you. It will be tough, but I suspect you’ll both be infinitely happier in the end.\n\nJust be careful not to internalise that “it was because of you that he was hurting so much” thought. There may well be things you need to work on but a lot of your concerns about wanting him to get his shit together and work on his mental health etc were valid. It certainly wasn’t just you that was causing him pain.\n\nAnyway, good luck op 🥰",
            "Same thing for me and my ex (were together for 3.5 years). We love eachother, sat down, talked, cried, laughed and split up. It's been a bit more than two weeks since breakup and the hardest thing right now is not to think about her. Some suggestions that might help you and might not. Cried the shit out of pillow on first couple days, and still sometimes want to. Yeah, 30yo guy crying (last time I cried was back in elementary I think) but I think that helped me a bit to raise my head and look at options that might get my mind off of my ex. Sooo...what helps me right now is focusing on other stuff, this week went for DnD(tabletop game), cheered me up a lot, met new people and laughed hard (I honestly feel uncomfortable/awkward around new people, but been trying to open up more lately) , also been going to martial arts classes (surprisingly, you might find it funny, but sparring with others, punching/getting punched really helps to get rid of the anger and sadness), and last but not least, doing some stuff with friends (watching a movie etc, without speaking about your ex). Have only one friend here, so I kinda annoyed shit out of her and her bf I think.. I know it's hard, but try to make some plans. Oh and almost forgot, I've been going to events/concerts etc, for educational porpouses (ate a lot of free samples in there) went to vegan fest (even tho I am not vegan), and yesterday went to a concert and had fun :) So yeah, netflix might be the option, but is it the best option? There is a lot of stuff to do out there, been wondering about dancing classes, also about learning to draw etc actually have no time for everything, same goes for being sad. Yeah, it takes a toll to motivate yourself to do the first step (like going to dnd, 40 new people, and all my brain wants is to be sad, but nope, play the game and have fun :D). Long post, chaotically written, but yeah, all I wanted to say is, STAY STRONG! :)",
            "Be strong. You guys both are awesome for recognizing your flaws and accepting it..which is the first step. try some group activities like group yoga or something..",
            "Also, one of the best traits of my husband is that he stays calm when I cry. Since I'm a teary person, we just power through it and pretend like I'm not crying basically. It might be worth finding someone who understands that the conversation doesn't have to end just because someone is crying. I guess it depends how disruptive your tears are, but for me, once I get my breath I can still talk.",
            "You are amazing and strong and you both sound like great people. This might be a weird thing to say just based off reading some stranger's post on the internet but I love you and hope the best for you as you move forward. Take care, and I hope you heal back stronger and more beautiful than before.",
            "I mean, my crush/gf broke up with me when I still had feelings for her.\n\nBut it was love created by hormones (I'm 16) and we were only together for 2 months.\nThis is probably wayyy worse. I hope you find someone you love so much you wouldn't even need to question any decision in your life because those decisions led you to them",
            "If you have to ask the answer is usually no, also there is someone out there that it'll be easy with, why settle for stress?",
            "I feel like this is the exact situation I was in but my ex didn't initiate a break up. You are so lucky this guy didnt strong you along for another two years",
            "Also, people don't need to know.",
            "Three months ago I broke up with the love of my life. I initiate the talk he initiated the break-up. First week I thought my heart will crush. It didn't.\nWas easier because we told to each other everything. So there was nothing left unsaid. He moved to the opposite part of Europe - and this made things even easier.\nWe remain friends. We talk once in few weeks. \nAaand yeah - I start dating. Because the truth is I was moving forward when chatting with other men. And currently I'm dating someone. He is so cool. \nI am confident you'll be amazingly fine. First week is hard. But hang on. Watch comedies and eat chocolate and give attention to other men.",
            "If you’re at the point where you need to make a pros and cons list, it sounds like you’re trying to talk yourself into staying.",
            "I’m so impressed with both of you. I’m decades older than you, and have two very long relationships in my past with men I loved with all my heart, but it just wasn’t meant to be. With both of them, I wish we’d acknowledged it sooner. Love is necessary, but it’s not all you need. I wish I’d seen that, and it takes so much courage to get to that place. I admire both of you, and wish you the best. This decision you’ve both made, even with the love you feel for each other, lays bricks in the road you’re each on toward a healthy, gutsy, fulfilled future. :)",
            "Seriously? Like grow the fuck up sorry that it sounds to harsh but why give up on someone and take the easy way out, give up so fast. Why fight for someone so much just to see them leave? But anyways maybe you guys just accepted the love you thought you'd deserved at the given moment just to find out you were total opposites but hey look at the brightside the light at the end of the tunnel will lead you into new worlds exciting worlds you both will one day reflect on the blessings you lived together and grow stronger as each day goes by\n\nBe at peace with yourself and one another exercise being alone for once enjoy you take time to live the best parts of what makes you, you. Love yourself enrich you to greater heights and only then you will realize you don't need a man to make you happy, and your relationships will be more calm and easy to take and live. I wish you the best peace and love...\n\nWhat a beautiful story you got going on there",
            "> And how he feels like he's walking on egg shells because if he disagrees with me on certain things, I get upset(to clarify- I'm a very sensitive person and if I feel misunderstood in a conversation, I will cry. This has led to him feeling like he can never be blunt or he has to be very careful in how he words things.) Which is totally valid and something I'm gone to therapy for in the past.\n\nSo you wanted him to go to therapy for his mood swings because they upset you, but you weren't going to therapy for that anymore?\n\nDon't get me wrong, it's a heartbreaking story and I'm sure if you made it clear to him that you two could still salvage things. But you both either needed to go to therapy to learn to deal with your issues or to learn to deal with your partner's issues. If you really feel that way about each other, it's clear that it doesn't have to be over. Relationships have survived a lot worse than two people loving the hell out of each other.",
            "Sounds like your manipulative",
            "I strongly doubt you will find someone like him. His values don't exist anymore in most of the men around (I'm a men btw)\n\nHis pros were much better than their cons. I bet You will compare every man to him and I bet all of them will lose in the comparison and you will end up in an unhappy marriage because of biological clock.\n\nYou should have worked out his cons much quicker.",
            "If you already made a list it’s prolly too late...",
            "Pros and cons list? You're disgusting. Your boyfriend isnt a homework assignment.",
            "If you have to make a list like this, even if salvageable, it's not worth it.",
            "What's there to answer here? Seems to me like you two worked it out welk enough on your own. You were both rational adults in this instance. Hope you guys find what you're looking for out there!",
            "Yes proceed with relationship."
        ]
    },
    {
        "post_id": "dntdhu",
        "author": "LindyG12",
        "title": "UPDATE My sister (37F) accuses me of favoring my nephew (9M) over my niece (9F)",
        "url": "https://www.reddit.com/r/relationships/comments/dntdhu/update_my_sister_37f_accuses_me_of_favoring_my/",
        "score": 2404,
        "num_comments": 182,
        "created_utc": 1572183682.0,
        "selftext": "Update to [this post ](https://www.reddit.com/r/relationships/comments/dln57i/my_sister_37f_accuses_me_22f_of_favoring_my/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nA lot of stuff went down yesterday....\nMy parents took all four grandkids to a trampoline place, so Anna and Michelle and their husbands were over to pick them up and stay for dinner. After dinner, Anna announced that she’s pregnant. I guess because of being over 35 she got this test called an NIPT and now she knows the baby’s gender even though she’s only 12 weeks. It’s a girl. Anna wasn’t supposed to be able to have any kids, so we were all happy for her. Except Michelle.\n\nOnce the dads took the kids downstairs to play in the playroom my parents have set up there, Michelle went off. She said Anna went and took the only thing she has left being best at (having the only granddaughter). I was going to leave because I don’t like being around when my sister fight, but then Michelle brought up the Universal trip and Ben. She said that she knows it’s wrong, but after Anna “took” having the oldest grandkid from her, she was at least happy that her kid had nothing wrong with her. Especially in the beginning, where Ben had a lot more issues and was really behind. He could barely talk when he was adopted. \n\nNow, Lily’s teacher and other people (her friends parents) are noticing that Lily might have attention problems. Apparently, the whole trip thing just was one thing too many. Even though she admitted that there’s no reason for it and my parents have always treated us the same, Michelle said she’s always felt competitive and second best to Anna. Now even I seem to like Anna’s kid better. \n\nAnna was kind of shocked at all this. She did get a little mad when Michelle was talking about how Lily was better than Ben, but they ended up crying and hugging each other. \n\nI told Michelle I would return the American Girl doll and take a trip to the AG store (which is within reasonable driving distance of us) and let Lily pick it out herself. Michelle said she and her husband will start the process of getting Lily evaluated. \n\nTL:DR! It wasn’t just about the trip.",
        "permalink": "/r/relationships/comments/dntdhu/update_my_sister_37f_accuses_me_of_favoring_my/",
        "comments": [
            "Aside from your sister’s issues...  Thank you for being Ben’s hero. That kid is really lucky to have you in his life.",
            "I'm glad they are getting your niece checked out. Both of my kids were diagnosed ADD as children,  it can be difficult. \n\nAs for the birthday gifts,  a trip to American Girl is a cool gift! I took our daughter to Chicago to AG, we made a day of it.  We had lunch at their restaurant and saw a show at their Theater.  She got 2 new dolls & a few outfits. Now given the cost,  she was almost 12, we wanted to give her something she'd been wanting to do for years.  We knew we'd probably never go back.  She's 25 now & we occassionally get her dolls out of their boxes to comb their hair,  change their outfits & reminisce on that special day she & I had together.  She loved that trip so much.",
            "Your sister sounds like she needs some therapy herself to deal with these feelings of inadequacy.\n\nLily would do well to be evaluated and get some supports for things if she needs them.\n\nBut your sister doesn’t get to dictate that everything from you has to be “fair” in her estimation.",
            "I’m glad they’re going to get Lily evaluated, but Michelle needs to be, too, for different reasons. Holy Hera. This is the kind of damage that if unaddressed, will absolutely damage her daughter and niblings—and their relationships with each other.",
            "[removed]",
            "So she was only the best at having grandkids because no one else had them?  She can still be the best but clearly she has some other issues with the family",
            "Family drama aside... I commented on your last post that it sounded like your niece may have ADHD. If that's what she's being evaluated for, please do some research and check out r/adhd if you do want to get closer to her. She isn't being malicious with how she focuses; she has a disorder and needs more stimulation and direction than neurotypical folks.\n\nShe probably doesn't enjoy amusement parks because of all the waiting and distractions. But she may enjoy a more enclosed and physical activity. What about doing a family escape room, or taking her to a show for a band she likes, or doing something creative together like painting, etc? It's hard when your brain works differently from others and you get left out because of it.",
            "Michelle sounds like she needs to work on some things within herself. Sorry for the drama. \nI have two young nieces and as they've grown up its switched back and forth who prefers to spend time with me more. About a year ago when the youngest just turned 4, she was with me ALL the time. Wanted endless attention and play time and reading books. Now, when the older one is 6 and a half, she spends more time with me talking about school and her friends and who annoys her. The younger one is content to have a good tickle fight and chase around the house and then wants to settle down and play on her own. \nIt's just how things go as kids grown up and develop their personalities.",
            "That is.... lot of drama. I had to flip back to the other post several time to figure out who was who",
            " I just looked through the other thread and there's so much snark toward a CHILD for liking clothes and YouTube and not being well behaved/pleasant.  I hate when, just because something conforms to stereotypes, people turn off their brains.  So much sympathy for one child in the story with special needs, and so many comments basically saying \"well if the girl only likes vapid stuff what are you supposed to dooo????\" Umm she's a CHILD she isn't required to love comic books and DnD to deserve the same care and consideration.  I hope some people who commented in the last thread are seeing this update.",
            "So is anybody shutting shit down whenever Michelle talks all this crap about Ben? I know we only have two posts and situations to go by, but in each one she mentions things about Ben that are a result of his prior childhood abuse, and it's honestly just fucking disgusting that she does so.",
            "This was wicked difficult to follow. So were Anna’s other sons also adopted..?",
            "The others gave you good advice on your family situation, I just want to add one thing. In your last pot you mentioned that Lily being on a phone or iPad a lot. This could be linked to her attention problems. The stimulation by smartphone and tablet can already be harmful to an adults ability to concentrate and work productively long term. To a child it is even more detrimental. Screen time should be limited to 30 to 45 minutes at day, ideally at that age. Plus, take into consideration that YouTube, even KidYouTube is not safe for children to be unsupervised. There are many harmful messages sent with some of the content and sadly very bad people who look for kids for dark purposes.   \n\n\nI know you're not in a situation to give you sister tips regarding parenting right now, but IF you spend some more time with Lily, try to get her attention away from the screen and social media at least for a bit.",
            "This is....a lot to process. If I have a family, God forbid I deal with stuff like this.\n \n\nBut OP, I do appreciate you trying to spend time with your niece the best way you can.",
            "Michelle is fucking nuts.\n\nThank you for being kind to ALL the children. The more people there are to outweigh Michelle’s weird jealousy issues, the more chances they’ll have at learning healthy, stable behavior. You’re doing great.",
            "Thank you for the update!",
            "[removed]",
            "Honestly I'd try taking the tablet away before diagnosing the kid with ADHD. She may very well have it, but tablets are notorious for sapping attention spans.",
            "I feel bad for Michelle. You have to be pretty unhappy with yourself to say so many hurtful things.\n\n I actually think that nine is a really tough time for girls. It’s this weirdly and insanely annoying age. My cousin is 10, and she also can be spoiled and whiny. She has very rigid interests (horses, specific ipad games, certain book series) and has trouble connecting to a new interest. But I find if I spend enough time with her, especially one on one, she gets much better. I have explained to her that you can’t expect people to share your interest and that you have to take turns playing games or talking about subjects that interest you and your interlocutor. So we have done that. I have also told her that she fails to contextualize her interest in a way that I can understand, which ends up being very frustrating. Like she will start talking about the story of a book she’s reading but will not set it up in a way that I can follow, so she ends up essentially grandstanding. So we jokingly get her to set up the story properly. She is very smart but has attention issues as well. She is getting evaluated for ADHD. \n\nI remember myself at that age, and it was a game to see how annoying we could be to other people, like that was funny. For me personally, that was a very vulnerable time even though I’m sure my behavior was super annoying and weird. Having female role models, like my aunt and my mom’s female friends, was very important to my development in retrospect. I actually still call one of them on Mother’s Day.  She never took me to an amusement park or anything like that. She mostly just interacted with me and my mom a lot. She would often come to dinner. She sometimes would pick me up from school if my mom couldn’t. She went on a couple of trips with us. She was an artist, and she hired me for work in her studio for a few weeks, which was my first job when I was 13 or so. I remember she was tough! We developed quite a bond. She never had children, and she gave me this really beautiful, small gold and pearl brooch that her aunt made 100 years ago. I doubt it’s worth a much money, but it is one of the things I treasure most. I don’t think the point is spending money on your niece. The point is spending time with her and giving her individualized attention.\n\nI think it’s amazing that you are championing your nephew. But it kind of sounds like you are missing an opportunity to be a valuable mentor to your niece. Especially when her mom seems to be emotionally unstable and maybe narcissistic. If her mom can say so many hurtful things to her sisters, I wonder what she is saying to her daughter. If your niece is addicted to her iPad, it could suggest that she is emotionally avoidant because of stuff going on at home.",
            "I'm confused about how you can be \"best at\" having a certain gender of child?",
            "I am kind of in the mind set that there is nothing wrong with having a stronger bond with one/some niece or nephew than the others. Growing up, I babysat a lot of my cousins and some of them just bonded with me more. They are now adults and we have really special relationships. \nSame goes with my aunt's and uncles. I have 7 uncles and 3 aunt's and each of us (my 2 sister and I) have different relationships with them. I think the key is to still nurture all the relationships but don't let you or anyone else get stuck on the fact they aren't all equal. Do things with them, try to find common interests but at the end of the day it still may not be the same for them as it is for Ben.\n I remember one Aunt and uncle, that I loved being around, trying to do things with my sisters but my sisters didn't really have interest, but they love hanging out with another uncle a lot for their own reasons and I personally have always and still struggle to connect with him. I think that the idea that every person has to have equal connection is kinda setting everyone up for disappointment. I really think that it's part of the human experience. It sounds like you are trying, and that it just comes easier with you and Ben. That's ok! Keep putting yourself out there with Lily, try to connect with her but again don't let anyone get on you if it's not at the same level.",
            "A competitive nature isn't anything you can reason with. My second eldest daughter is exactly like Michelle. Everything is a competition. Literally anyone's accomplish is a personal attack. Mh daughter cannot be happy for anyone and has to have the spotlight at all times, even going as far as to fake medical problems just to get attention. It's an impossible problem and isn't likely anyone's fault. Some people are just like this.",
            "I hope you will still take some of the comments on the other post to heart, even if it wasn’t all about the trip. The way you talked about Lily’s preferences versus bens was very dismissive and not good. And still the idea of taking one kid on a big trip and getting the other a doll is playing huge favorites. So event though it “wasn’t about the trip” I hope you take a good look at how you’re acting as well.",
            "I can't believe that A) the older sister would actively talk shit about her nephew and B) that the middle sister forgave her for it! Everyone is completely bypassing the fact that the oldest sister is creating this entire family drama over literally nothing (other than her own imagined feelings of inadequacy). To me that is symptomatic of a much larger problem that will only rear its head again. I don't feel like anything was actually resolved I feel like things were just talked over and smoothed out. Godspeed OP.",
            "Your sister is not wrong about you playing favorites. Just because a 9 year old likes different things than you do, doesn’t mean her likes are boring or that she isn’t “as cool” as the other kid her same age. You probably didn’t even realize it, just be mindful of it in the future. \n\nI think it’s great you are taking her to do something fun, too! I think she will always remember going to the AG store with her fun aunt. I am glad this story had a happy ending.",
            "She knows people can’t choose what gender babies are, right?\nThan k god the situation got better (?) .\nNext time you guys need to tell her to stop projecting and take care of her own child.",
            "She's projecting her own internal battle..",
            "I guess I have the unpopular opinion here, but I think Michelle was being entitled and this update confirms it. You are not obligated to invite all of the cousins to everything you do. If they were siblings I’d sympathize with her more. Michelle sounds like that person whose friends can’t hang out without her. \n\nI’d be reluctant to take my niece out too if she acted bored and ungrateful every time I did. And you’ve made plenty of effort to spend time with her.",
            "A trip to the AG Store is a great gift! And a very good compromise from your previous (also very good) gift",
            "speaking as an adult who was (very recently) diagnosed with ADHD, I'm really glad her attention issues have been caught earlier! I have to be honest, I had a really hard time explaining why I had such a need to be on my phone/immersed in something (started as reading at inappropriate times when I was younger because smartphones weren't everywhere) as I got older and a lot of it was just \"I can't keep track of/enjoy/learn from w/e that's going on because it's not stimulating enough\", which got reaaaally bad in college. I hope you can work to build a strong relationship with your niece! and know if she's being antisocial, its probably not you.",
            "youre very kind. personally  i think it should have been fine to do the harry potter thing since it was partly for your own enjoyment. the mom could have told lily that (or if ADHD prevents her from handling that, asked you to hide it from her.) mom could have been graceful and maybe in the future organically you plan something with lily another year and not your nephew.\nit's weird /rude to give a different amount of cash or very different priced gifts on xmas to grandkids or niblings. however an activity which is also for the giver doesnt seem quite the same-",
            "Sounds like your sister has a serious case of middle child syndrome and creates competition out of nowhere to rectify some ridiculous childhood slight.\n\nBut, I'm so happy to hear things seem to be working out! Harry Potter world is perfect for the nephew. American Girl Doll store (to pick out her own) is also perfect for niece! Maybe you could give her the justice giftcard and tell her you'll go with her to buy the clothes too.",
            "As someone with ADHD whose mom lashed out at me for this realization and took it personally (made it about herself) and made me feel like there was something wrong with me, there are some red flags I feel I must address.\n\nMichelle seems to believe that having “attention problems” has a bearing on her daughter’s worth. This is a classic message that is fed ADHDers that diminishes our self-worth and puts us at greater risk of depression and anxiety. Additionally, the longer it takes us to develop appropriate coping strategies the greater chance that we will eventually succumb to addiction. This is especially concerning because it sounds like Lily is already down that path.\n\nADHD is a terrible, outdated misnomer that is on its way to being replaced in the medical dictionaries sooner or later. Practically no aspect of it is accurate, and these inaccuracies are a huge cause of all the misconceptions. What is being called ADHD is actually just a completely natural psychological phenomenon that describes 1 in 13 humans worldwide, in which executive functions are diminished while other mental faculties including involuntary attention, creativity, empathy, and energy are enhanced. It is a trade-off: one that was advantageous for our hunter-gatherer ancestors but is disadvantaged in sedentary society. And a big part of that is because the judgement from the uneducated makes us internalize shame. Fuck a diagnosis. “ADHD” is one extreme end of a spectrum we all fall on, and it sounds like Lily is experiencing at least some common issues that trend on this side of the spectrum. She doesn’t need more judgement at home. Encourage her mom to get her evaluated, and then for Michelle and Lily to **study** as much as they can about the phenomenon called “ADHD” and healthy coping strategies\n\nEdit: The only YouTube videos on the subject I know of are Dr. Russell Barkley’s lectures. They are very much targeted for adults, many for *parents*. I highly recommend them for Michelle. I’m sure that there is *something* on YouTube that is written for kids that Lily and Michelle might enjoy watching together.",
            "How nice of you to turn the gift you wanted to give her into a whole experience! Im sure she felt really good about that . I honestly cannot believe how dramatic/petty all of this was though...Im shocked how both of your sisters compare their kids. & how much more  mature you come off. \n\n Maybe I just grew up thinking  some level of favoritism was normal.. I hope they will be careful on highlighting situations like this .  I'm a parent, I feel like this would teach entitled behavior.\n\nYou are ALL family!  It's really not your responsibility to calculate every kind interaction . As parents , they are more than welcome to take her to universal studios on their own dime - if that's what they felt was fair.  I think if my sister took my nephew to universal studios, I might be a little shocked . But nowhere near this magnitude .. these aren't your kids lol. You're just trying to be a fun aunt.",
            "You should see if lily's mom will take her to a child psychologist about the excessive watching of YouTube videos",
            "Sounds like Michelle has middle child syndrome. Definitely should seek counseling.",
            "The only problem here is your sister's entitled competitive attitude. Children don't exist for their parents  to score points for \"oldest grandchild\" and \"only girl.\" Everyone else in your family sounds lovely. Hopefully you will eventually find common ground to build a stronger bond with Lily because this poor girl couldn't possibly have a healthy relationship with her mother who doesn't seem to see her as an individual. Overall it sounds like you are a wonderful aunt to all of them.",
            "My goodness, if my sisters and I got pretty like this my mom would flip!  I never knew this type of dynamic existed.  Genuinely fascinated.  Michelle is the sister that seems to have the petty issues.  I am shocked that she came at you about what gift to give your neice.  In my family, what one child/cousin/nephew gets is not the business of anyone else, bc the person giving the gift, is giving it on their own terms, not bc \"so and so\" got a trip to Disneyland so now, you better get \"my so and so\" an epic gift, equally expensive or you don't love me and mine.  This was just, shocking.  I love learning about the human condition.  Don't let Michelle bully you into equality gifts...you do what you choose, set boundaries.",
            "NTA. Op, nice job.",
            "Thanks for the update and good on you. Shitty for your sister to make your other sisters wonderful pregnancy news about her.  If I was Anna I would never forgive her. Why does everything have to be a competition.",
            "Michelle sounds like an asshole",
            "I'm so glad there is more awareness and acceptance of girls ga ing ADHD. My brother and I both have it, but it manifested enormously differently.  In fact, he got lots of help growing up while I was was only diagnosed used 2 months ago....I am 41 years old. I feel like the trajectory of my life could have been immensely different had I gotten as much attention growing g up instead of being just \"good enough: to fly under the radar.",
            "I'm sorry but your sister needs to have bigger fish to fry. All of this seems very childish and self absorbed.",
            "I’m glad you were all able to work it out.",
            "Lily seems spoiled. Which does start with the parents. Being every kid will have different interests, you can't satisfy all on a trip to one place. Obviously you like to spend time with all but is harder when you don't have any shared interests. You don't and should not have to spend an equal amount on each kid. You do with what the interest is for. \nMichelle also should not expect that. She sounds pretty self centered and selfish. Totally disrespectful to you, Anna, Anna's kids and her own DD. That I would call out and not put up with it. You are a great aunt and try with all of them. Just don't put yourself out or feel guilty bc of Michelle and her attitude. Disgusts me when I see family's and/or siblings like this. \nGood luck hope you come up with some good activities. Don't be pushed or guilted in to it. Glad she is getting Lily checked out. Its a start.",
            "Autism in girls is hard to detect and could be misdiagnosed for ADHD. There are also cases where women and girls are diagnosed with both. I'm in my late 20s and recently discovered I may be on the spectrum. I say all this hoping OP sees this and hoping that if Lily is on the spectrum, that she's properly diagnosed and gets the educational resources she needs to thrive. My life would probably be entirely different if I'd known this crucial thing about myself growing up.",
            "Thank you for doing everything you do for them, and for making an effort with your niece. I know how hard it can be; I’m 26 and aunt to 3 boys and 3 girls, between the ages of almost 18 and 14 months. And my sister is pregnant again. \n\nLike many others have said, I think it’s more about the time and effort rather than the money, so hopefully the trip to AG will help. And hopefully Lily gets the help she needs :)",
            "> She said Anna went and took the only thing she has left being best at (having the only granddaughter).\n\nThat's a coincidence, it isn't an achievement.",
            "\"Michelle told me that if I don’t take Lily, I should do something equally expensive for her tenth birthday\"\n\nSounds pretty entitled.",
            "You're a good person, remember that amidsts all this. :)",
            "Michelle is a PSYCHO.",
            "Jesus Christ, your sister is fucked in the head.",
            "Nothing wrong with having a favorite newphew. You don't owe the other one anything.",
            "[removed]",
            "Having a kid sounds like an effing nightmare",
            "First world problems 😂",
            "Did u have to specify that ur sister is female, ur nephew is male and ur niece is female",
            "[deleted]"
        ]
    }
]