[
    {
        "post_id": "5ruzp4",
        "author": "keepouringoutofme",
        "title": "I [27f] have started doing all of the things my husband [28m] doesn't want to do with me on my own.",
        "url": "https://www.reddit.com/r/relationships/comments/5ruzp4/i_27f_have_started_doing_all_of_the_things_my/",
        "score": 2410,
        "num_comments": 265,
        "created_utc": 1486140456.0,
        "selftext": "My husband doesn't like to go out much. It's not something that I've ever faulted him for or been mad at him about. We've never gotten in fights about it til now and it's something he told me upfront when we had first gotten in the relationship 4 years ago. \"I'm never going to be the kind of person that likes to go out a lot, I just want to hang out at home\" and I of course said that it was fine because that's not a flaw to me, it's just a character trait. \n\n\nI used to suffer from depression due to a lot of traumas in my life. I found it really hard to go outside at all, and especially alone. I missed out on a lot of experiences because of this. In our first year of dating, he got me to have more confidence in myself so I stopped hiding. I got a therapist and have been on a wonderful little antidepressant. We got married one year later and I'm still happier than I have ever been, and I'm incredibly grateful to have him in my life. That hasn't changed one bit.\n\n\nNow, I know that this isn't want he does. I know that he doesn't stay inside because he's depressed, it's because it's in his nature to be a housecat. And like I said, I'm still fine with that. Lately he's not okay with me doing this, though. \n\n\nIf I ask him if he wants to see a movie with me and he said \"no\" or the more common, \"I don't know, maybe\" I'll usually ask him two more times and then if he still says no or \"maybe\" I'll go by myself. It's the same with going out to dinner, taking little classes, etc. We had fun with this at first. I would come home from doing the thing and then I would excitedly tell him what I'd done and the people I'd met. He'd happily listen and hug me and kiss me on the forehead. It was a really beautiful thing. At one point we called it \"my little adventures\" and I would take polaroid pictures and show them to him and then hang them on the kitchen wall. It was a seriously beautiful point in our relationship and the times that we would go out and take polaroids together were some of the happiest times in my life. I even made it a point to have us do / go to things that *he* liked to do. It was great. It was seriously so great.\n\n\nAbout two years ago I asked him, \"Hey, I've been really passionate about learning a language and eventually going to this languages place of origin. Do you want to study it with me and then go there too?\" and he said no to the language, but maybe to going with me. \n\n\nCut to now and I'm pretty damn good at this language. I decided about four months ago that I am going to this place. I asked him and he would still like to come with me and he said no and got kind of upset that I had learned this language without him. \"You're the one that's going to know anything, there's really no point in me going.\" I was kind of taken aback because during the process he was really supportive. I didn't really push it, but I apologized and went somewhere else to clear my head about things and we were fine later on that day. I bought the tickets for me and my mother to go \"the place\" about four weeks ago and ever since then, things have been really tense. If I ask him to do minor things, like come to the grocery store with me, he gets a bit of an attitude. I can tell that he knows this is ridiculous though, because he'll say sorry almost immediately and be sad and quiet the rest of the time.\n\n\nI've tried to talk to him about what's bothering him, but he keeps either saying that it's nothing and he doesn't want to talk about it, or will tell me not to press it and then get mad and leave. I don't know what to do at this point. Our relationship has been so great, but I can feel things being strained. I can feel him kind of slipping away. I don't know what to do. I thought about buying him a ticket to \"the place\" anyway and surprising him, because I really would love it if he could go with me and I know for a fact it's somewhere he's always been interested in. But I also don't want to force him, because I hate forcing people to do things. However, I also don't want to do stop having these experiences for myself just because he doesn't want to. I've never faulted him for wanting to be at home, so why is he faulting me for wanting to be outside? I don't know how to talk to him or what to say. If I have to stop doing things, then... I guess I will? But I also feel bad for having to stop, but it's not worth getting a divorce over or having things escalate that bad. I just don't know what to do or where to go from here.\n\n**Edit/Update:** Hi! Um, we had a bit of a long talk. I'm kind of a mix of exhausted / drained / excited now so I apologize if I make a lot of typos or word something wrong. In a kind of big nutshell: He said he feels like he's drowning in my success. I said I would learn a language and I did it. I said I would lose 180lbs and I did it earlier in our relationship and got the skin surgery. I have a pretty stress free job and it's getting to him. He's been trying really hard to just be happy but it's hard. He understands that it's wrong to feel this way and between feeling guilty about it and feeling this way at all, it's just been taking its toll. He also has a skin condition that makes him feel cautious of going outside, especially in another country. :( I never thought this would be the problem, because he's always acted as though it's not a bother to him at all and he doesn't care.  He's going to keep trying though, and to seek therapy independent of me because he thinks that he also may really be suffering from depression.\n\n\nNow, I have to say that we *do* have communication problems. Our friendship (two years before dating) started off long distance in an mmorpg so we're still kind of better with text-talking than outloud speaking. Sometimes we have a hard time saying when things are bothering us out loud, so we'll text it out and then read off of that text because we find it hard to verbalise and sometimes we just take things harder than we should. We've agreed to go to marriage counselling and we're making an appointment together tomorrow, so there are good things afoot.\n\nFor more good news: He's agreed to go on vacation with me and my mother!\n\nAlso, I just want to say thank you to every single person who commented. It means a lot that people would wish us good luck and give advice and even say they were going to pray. Thank you for all of the advice! I'm trying to go down and thank everyone one-by-one but it might take a while, and in case I can't... thank you for helping save us.  \n\n**Uh, edit to the edit!** I would also like to add that I messed up in this, too. I liked to think that hearing maybe / other apathetic answers instead of just yes or no didn't bother me, but it did. And sometimes, as some people pointed out, I would get kind of passive aggressive about it. I'd ask him simply because it meant that I tried at times. I'm not proud of it, but it happened. I'm going to work on that more and myself as well. \n  ---   \n  **tl;dr**: I've started going places and doing things without my husband because he's a housecat kind of guy. I'm fine with it, but now he's upset with me because I'm going on vacation without him.",
        "permalink": "/r/relationships/comments/5ruzp4/i_27f_have_started_doing_all_of_the_things_my/",
        "comments": [
            "This is one of those cases where I think you should tell him *everything* you just said here, you could even show him this post if you wanted.\n\nIf you decide to tell him all of this, sit him down and ask him to first just hear you out. Add in that you are worried about your relationship, and you want to fix things. He's unhappy about something, and you are unhappy because seeing him unhappy and worrying he is unhappy because you are doing something that may be contributing to his unhappiness in and of itself makes you unhappy. \n\nThe only way to fix this, is to talk about it. If he doesn't want to talk about the particular thing bothering him, it doesn't mean that you can't still talk about how it's affecting the relationship. ",
            "This reminds me of the time I say no to something because I don't want to step out of my comfort zone but later regret it completely. \n\nHe's grumbling to himself, he probably wants to go with you and half of him doesn't. I think you should ask one last time. Maybe he feels you gave up too easily? (You shouldn't have to obviously but some people deal with stuff immaturely) If you had coaxed him maybe he would've said yes and now his ego won't let him ask for more. Give him a way out. \n\nTell him you would love for him to go and you always imagined the holiday with him but you'll understand if he doesn't want to. This is a very no pressure way of asking. Get a very clear no and then move on with your conscience clear. If he wants something he needs to express it properly and reading his mind is not a skill you should have to learn. Enjoy your vacations and then see his attitude. If he's still in regret mode then ask for counseling. \n\nTell him you want clear and concise communication. If he wants something he should say it. If he's hesitating then you're right there to hold his hand. He only has to ask. ",
            "He probably feels ashamed that he's such an introvert/housecat, and wishes he was more adventurous and ambitious. \n\nWhile he may have always wanted to learn the language and go to that place, it seemed to him like far too much effort... A pipe dream, something that people dream about but never actually accomplish. \n\nThen you did it in four months, and all he has to show for how he spent the last four months is a few finished seasons on Netflix. \n\nEven if you're legitimately just doing it for yourself and not being passive aggressive towards him, and don't think less of him, he's responding from a place of shame and defensiveness. \n\nThat's his problem, I'm afraid. ",
            "> . \"You're the one that's going to know anything, there's really no point in me going.\"\n\nHey there, I'm an introverted (usually solo) traveller who often flies to countries where I don't speak the language at all.  Don't let that argument convince you!  It's absolutely not true.  On my first big trip I went to Chile with a friend who speaks Spanish and that was a lot of fun too!  My travel buddy didn't mind doing all the talking, and I didn't mind having someone there who speaks the language with me.  It's not a problem unless you make it one.",
            "I'm reading this as him not being happy that you're going, but realizing that this is his own problem and not yours and so not pushing the issue. He doesn't have to be happy about it, honestly. I would call him out on individual bad behavior, although it sounds like he apologizes for any slip ups.\n\nI do wonder, were you like \"I'm going to this place, would you like to come with me?\" or \"I want to plan a vacation to this place, and I'd really like you to go with me. Are you interested?\" A vacation to another country is a lot different to an outing or a day trip, and if it came across like you didn't really care whether he was there or not it could seem pretty hurtful. When he said, \"there's no point in me going,\" did you respond assuring him that he'd add something to the trip whether he knew the language or not?",
            "Someone else mentioned counseling and I think that's a solid route to take given the nature of how things are on both the sides of not really having an in between to resolve the situation (and it's really not this one trip but also any type of similar events/trips/movies, etc. from the past as well as those going forward) and the distinct breakdown of communication that is occurring as well. \n\nI also find it odd given the nature of things, you seem very lax in terms of how different the two of you are in terms of personalities/goals.\n\n\"I of course said that it was fine because that's not a flaw to me, it's just a character trait.\"\n\nSome traits that differ people are not compatible with. This particular introvert/extrovert difference is finally coming to a head in your relationship.\n\nYes early on it was small things, but essentially it sounds like you have your life, he has his, and when you go out and do things you document/report back to him. For some people this may work, for others it may not. \n\nOne thing to note:\n\n\" I even made it a point to have us do / go to things that he liked to do\"\n\nHow often has that been happening as of late? Do these outings still happen somewhat frequently? This may be a thing to discuss, i.e. going back to these joint/type of things if you have gotten away from that. \n\n",
            "Let him stew. He chose not to do these things with you, and he told you he doesn't want to go anyway. He's pulling you in two different directions. I would go on your vacation and let him deal with his problems on his own, but if you really want to make an effort, I suggest marriage counselling. ",
            "[deleted]",
            "I would go on the trip anyway, but I wouldn't leave with that tension just hanging around in your wake. \n\nWhile I totally agree that he basically did this to himself, his feelings are only going to fester while you're gone. The problem is that he isn't owning up to them. Sometimes I feel frustration that I know is misplaced. The way to diffuse it is to acknowledge it. \n\nIt could be that he never expected you to learn a new language and maybe this new, adventurous side of you makes him nervous. Little outings around town and an international trip to become fluent in a language are different levels of adventure. He's an introvert and you're becoming more extroverted then maybe he thought you would, and while relationships like that can be fully functional, he may begin to feel it's an incompatibility.\n\nI don't know, just brainstorming. The only person who can tell you for sure is your husband. \n\nAt some point prior to your trip, I would sit him down and just ask for an honest discussion.  Remind him that you love him, and whether he joins you or not you're still going to love him. Offer to buy him a ticket one final time, because it would be amazing if he were there, but also be supportive that if he stays home he should buy a new video game/project/whatever hobby he enjoys so he can have a great time too. Tell him when you get home you want to swap stories, tell him you'll send him postcards while you're gone. You know. Make sure he knows he's still a part of everything, even through your metamorphosis into a more confident, outgoing person.",
            "The mechanics of your relationship have changed substantially, and for you, as far as I can tell these changes have been enormously positive, and you should be very proud. What you have done takes a lot of emotional labour and really is pretty damn impressive - but, when he met you, fell in love with you etc, you were not as strong and capable as you are now. Is it possible he is considering where he fits in now? Once he was your knight in shining armor, does he even know how to be your partner, and not the one who fixes you?\n\nIt is time for you to engage him about the underlaying issues with you becoming more extrovert than him because you have come out of your shell. There is nothing wrong with him being more introvert, but its not ok to hold you back or make you feel bad about the things you've found to fill up your life with joy. - If he is unaware of why he is behaving the way he is, maybe he needs to take time to think about it, before what he does turns into emotional blackmail, as in moping when you do something on your own initiative that he doesnt want to do, but then gets upset about being excluded from, eventhough he has rejected your efforts of including him. There could be a simple explanation, but the underlaying issue is he is acting out his emotional turmoil on you, and that is just lazy and not ok.\n\nMaybe you should both write down how you each imagine this issue could be fixed, in a way that keeps your relationship healthy and intact. - I cannot imagine he would write: Stop doing the things you enjoy because I dont want to do them. - Rather he will be forced to look at what it is he is actually asking you to do. - And if he still insists after looking hard at the truth of the matter, then you need to grab it by the throat and tell him what the consequences for your relationship would be.\n\n\nThe question is: Is he still right for you, now that you dont need fixing. Does he know how to be your bf, when you are nolonger seeking shelter in his arms all the time? And can you guys talk about this stuff?\n\n\nPs. if I was you, I would show him this thread and all the replies, and ask him to read it - and leave him for a bit so he could take it all in. Your opening post is very kind and loving towards him, - you shouldnt worry on that account.",
            "It's kind of tough shit to be honest, if he doesn't want to go that's fine but life is too short to let people hold you back",
            "> He also has a skin condition that makes him feel cautious of going outside, especially in another country. :( I never thought this would be the problem, because he's always acted as though it's not a bother to him at all and he doesn't care.\n\nI wouldn't downplay this as \"housecat guy\". Common psychological problems associated with skin disease include feelings of stress, anxiety, anger, depression, shame, social isolation, low self-esteem and embarrassment. Skin conditions can also affect one’s personal, professional and social life. Just because he acts like it's not a bother to him doesn't mean it's not affecting him greatly. He might just not like to talk about it. ",
            "Let him be upset. He has no legit reason to be. He's probably upset with himself for not being the kind of person who wants to do things with his spouse. \n\nDon't buy him a ticket. ",
            "Has your husband been screened for depression lately? I mean, being a \"housecat\" is one thing. But this seems like it may go a little beyond being a homebody. ",
            "He's worried that you're going to meet someone who'll make you happier than him and that you'll leave him.\n\nAlso, as a result of his behaviour, you're way more likely to meet someone who'll make you happier than he does and you'll leave him.\n\nIt's not your problem though, it's his.\n\nCounselling should be your next sidequest",
            "You absolutely don't have to stop doing what you love and enjoy, but perhaps the resolution is that you won't do those things with your partner.\n\nEvery relationship has a price of admission. And maybe this is that price for you both? The question is are you happy with not sharing these experiences with your husband?",
            "It's finally clicked with him that you're growing - and he's not.\n\nHe's likely resenting it - and also afraid about where it will lead in the future.",
            ">  but it's not worth getting a divorce over \n\nEventually it will be. Even small things, left unaddressed can build over time and this is not a small thing to you. You should talk to him. Explain it just as you did and tell him that he doesn't have to participate with you but he cannot guilt you into not leaving the house. That's unfair to you. ",
            "Definitely do NOT buy him a ticket as a surprise. It sounds like you guys need more communication, because, for whatever reason, he isn't feeling heard.\n\nDo you ever go out for date nights? How often? He sounds like he might be rather agoraphobic, honestly. Not wanting to travel to a foreign country where he doesn't the language: okay, a lot of people have anxiety about that. But being unwilling to even go out to dinner or a movie? That's not normal.",
            "You know well why he's upset:  You are on the road to leaving him.  You are changing, getting better. He isn't and he doesn't want to.  You are growing apart instead of growing together and he feels it.  So do you.",
            "My wife likes to do certain things that I don't enjoy and I don't mind if she does them without me. But we had to come to that understanding which took time and trust. I'm a bit like your husband in that I'm somewhat non-committal, but my wife knows that if she really wants to do something, she doesn't need my permission to do it without me.  We talked about it and she knows how to handle it. But she usually asks if I want to go first though as a courtesy. ",
            "[deleted]",
            "He sounds exhausting. Have you asked him why he doesn't want to do all these things? It's really important as a couple to have some shared interests. This was one of the reasons I ended a relationship.",
            "are you  guys financially equal? that seems to be the main problem in my very similar relationship",
            "Ok, so. My husband is a lot like yours in that he doesn't like to go places, not even (especially not) the movies. BUT he does go to dinner with me from time to time, and he has never been petulant about me going places. He's encouraged me to do so, in fact, with my mom, friends, on my own - he wants me to have experiences which enrich my life despite his preferring to stay home.\n\nYour husband is not being supportive of that and he needs to start if you guys are going to be able to have a good ongoing relationship. Because otherwise either he's going to resent you for dragging him out or you're going to resent him for pissing in your cheerios all the time. Right now, it feels like (I imagine) he pulled a bait and switch: 'Nope, not gonna learn that language but you have fun. We'll go to that place eventually.' 'What do you mean you want to go to this place which you've wanted to go to, I can't speak the language so I won't have fun!' '...What do you MEAN, you're going with your mother and without me!' Etc. That's shifting goalposts so that the only option you're left with is the one where you stay home with him. That's not okay.\n\nEven if he doesn't want to go and clearly communicated that from the first (which he didn't), it still isn't okay to guilt you or prevent you from going yourself. You have agency; he should not be getting in the way of that. Having a discussion about his feelings and expectations? Sure. But not this.",
            "I think he's depressed and doesn't want to tell you. He secretly wants to do these things with you, but depression keeps him sitting in the house. Now he feels resentful of you thriving, and is lashing out accordingly.\n\nI know many people are happy being home bodies, but that's my take on it. I could easily be wrong.",
            "It seems clear he's used to you catering to him. You do you and he doesn't do anything but does listen; then you set up things for both of you and you two always do what he wants.\n\nThis is the first big thing where you are doing what you want. And you're even doing it now with someone else. You get a turn for you!\n\nHe needs therapy at this point, even if he doesn't understand why he's acting the way he is. He's now going to not listen to you and not go on your trip--and it's a good guess that he will act badly about it afterwards too? Just no. ",
            "my guess is that even though you've made a point to tell him you're only staying inside because you're depressed, you staying inside was significant to his own complacency with his homebody status. It's much easier to ignore our own behavior or not look at it closely if someone is right there beside us acting the same way. You've now upended that and he's judging himself and his behavior from a more societal perspective and he can't deal. \n\nit sounds like he knowsthat him giving you a hard time about this is wrong and you sound uber respectful so the sole issue is pretty much that he isn't talking to you about the issue or hasn't wrapped his head around it yet. \n\nI get the balance between pushy and wanting him to join but I think you should be a bit more pushy. Being a homebody is fine. Not going out into the world cuz anxiety and fear is not. He is clearly scared and anxious about this trip and so I think it's probably important that you don't just let him off the hook here without dealing with his underlying issues. \n\n\"Husband, it's clear to me that you're having some difficulty making your peace with my going on this vacation. I love you and have so much respect for who you are and I never want to push you into doing things you aren't comfortable. I know you prefer to stay home and I hope you know that I love our life together, and I wouldn't change anything about it. That said I think you understand that I enjoy going out and socializing more than you and need the freedom to go on this trip without feeling guilty that I'm abandoning you. \n\nThroughout the past 2 years I thought that we were planning this trip together and I was so excited about it. I still really want to have this experience with you and since it seems like at some point you wanted to go, I'm wondering what's changed. If you're anxious about traveling with me I'd like us to be able to talk about your preferences for the trip so that we can try to make it happen! i don't want to push you into doing Somethig you're so against, so if you really don't want to go then that's fine.  but it's clear that you're bothered by something and we need to talk about that and deal with that regardless\"",
            "Would you mind telling us the name of \"the wonderful little antidepressant\" you take? If it's too personal, ignore. Just seems rare that someone is that enthusiastic about them, since the side effects are often a burden. ",
            "Sounds like he should have gone to the therapist with you. ",
            "Why does he always say no? Does he have anxiety issues? I'm similar to you husband but it's because I'm dealing with some overwhelming anxiety and issues of low self worth. ",
            "I was in your exact situation with an ex bf. We ended up breaking up because he got upset and insecure, and I realized I was way happier actually getting out and doing stuff than sitting at home. Plus, I met a lot more people with my interests at that point. I would not let him hold you back.",
            "Even though he is the one excluding himself from the activities, it may be that he feels that you are \"leaving him\" by doing these things and making plans without him.\n\nShame and regret are powerful silencers.  You guys need to see a therapist and get this out in the open.",
            "Please don't stop doing things you enjoy because of him. You'll grow to resent him. It's not good for either one of you or your relationship. He can't be the only thing in your life.",
            "Great updates. I hope he follows up on the counseling. And teaching out with compassion instead of \"just deal with it\" as sine were suggesting helped you guys figure this out. ",
            "Very happy to see such a positive update.  Good job on the introspection and self-awareness.  Good luck with the counseling and have great time on your trip!",
            ">If I ask him if he wants to see a movie with me and he said \"no\" or the more common, \"I don't know, maybe\" I'll usually ask him two more times and then if he still says no or \"maybe\" I'll go by myself. It's the same with going out to dinner, taking little classes, etc. We had fun with this at first. I would come home from doing the thing and then I would excitedly tell him what I'd done and the people I'd met. He'd happily listen and hug me and kiss me on the forehead. It was a really beautiful thing. At one point we called it \"my little adventures\" and I would take polaroid pictures and show them to him and then hang them on the kitchen wall. It was a seriously beautiful point in our relationship and the times that we would go out and take polaroids together were some of the happiest times in my life. I even made it a point to have us do / go to things that he liked to do. It was great. It was seriously so great.\n\nWeird and unconventional relationship advice: I think you all should watch the movie \"Up\" together and talk it out after. I think that will give you both some perspective about what you want out of life and how to take things from here.",
            "There's a difference between saying \"i don't like going out much\" and \"i will nearly never go out ever. \" it's the difference between \"wanna come to this movie with me\" and \"I'm going to France, wanna come? \"\n\nIf you're okay with a partner that won't accompany you anywhere that's your choice. At the very least he needs to stop being so flaky. \"Doyou wanna come, yes or no, \" none of this maybe shit",
            "What has you so convinced that he isn't depressed or has severe anxiety? Because the way you describe him makes it sounds like he sure does have one of those things. ",
            "Yeah, he's being a bit of a baby. He knew you wanted to go on the trip, he didn't want to put the work in to learn any of the language, and now that you're going he feels too intimidated by the prospect of such a strange place that he doesn't want you to go. Since you're going with your mother, I say do it, but give him the chance to join along. ",
            "I seem to have a relatively similar personality to your husband. I know I can be stand-offish about going certain places for reasons other people wouldn't understand. Sometimes I get panicky about parking (I LOVE MY CAR) or I have no interest in certain topics/trips/events so I will be heavily against going. However, making your SO happy is usually a pretty big priority and it seems like in recent times he has been doing the opposite.\n\nIs it possible his mind is elsewhere, perhaps focussing on other priorities or something? I remember when my ex and I bought our house, she was very excited and was always talking about how she wanted to do X to the garden, and paint the siding, and do Y to the basement. My mind was simply trying to get the basics covered. I wanted to get the roof replaced, I wanted to get the rooms re-sheetrocked, and I wanted to be able to live there safely. I would always be a buzzkill to her ideas because my answer always had to be \"later\" or \"after this is done\".\n\nI know that analogy doesn't *exactly* relate, but is there something more immediate going on that could be bugging him that is taking his focus away from you/your happiness? Perhaps children? Living conditions? Health problems? Family issues? Does he just need to be coaxed to talk about things? I know I need to be in the right mood to talk about something, and if someone chooses their words incorrectly I will clam right up and not want to talk. \n\nJust some food for thought. I don't really think you're at fault here, but at the same time I know if I were in your position I would try to find every angle that *I* could help from. You can't change his preferences/personality, but perhaps you can help him figure himself out.\n\nGood luck! :)",
            "You need to talk to him. It sounds like your personal/knowledge growth is making him feel left out or insecure, but you should be able to let him know that you aren't growing beyond him. I would do what you can to encourage him to go with you on the trip, too. Ask him whether he'd like a crash course from you on the language, ask him what's holding him back here.\n\nIf need be, ask him to go to counseling. I would also frame this issue *entirely* around the language and trip, because you haven't mentioned anything else he's having problems with.",
            "Does he work outside of the home?",
            "Kudos to making things happen with actions, I love hitting goals whether it's fitness, emotional, mental or educational health. You might suggest a few couples counseling sessions with him and word it in a way that you have some things you'd like to discuss with him as well as whatever he'd like to discuss. That way it's not just a 'what's wrong with you' sort of thing, I hope things perk up it sounds like you guys have an enviable relationship otherwise.",
            "It's highlighting to him how introverted he is and that maybe he's missed out with not learning this language.\n\nHe also might feel that he's not adventurous enough for you and you going on this trip is because you don't get enough out of him which won't be making him feel too supportive.\n\nIt's his own issue but he also won't feel like talking to you about it. At the end of the day one of you has to force the other to sit down and communicate properly about it or you're just going to end up resenting each other.",
            "OP, what country are you going to? Depending on the country, there might be a large number of English speakers, making his concerns irrelevant. ",
            "Sometimes a \"we need to talk about this\" is in order. This is putting strain on your relationship, and avoiding the issue won't fix that. If it's a serious enough problem that he gets mad about you trying to address it, then that's even more reason to talk about it. Trying to avoid an unneccesary argument is paramount. He obviously sees something is wrong, and he needs to talk about it like an adult who wants their marriage to succeed. ",
            "This sounds a little like my fiance who suffers from what we believe to be social anxiety. She prefers to stay home and has trouble around lots of people and is hesitant to try new things. I've done a few things on my own that she later admitted to wanting to go with me on, but couldn't because of her anxiety. I think it's hard for us who don't suffer from this to truly understand what is going through their minds. It can be really frustrating trying to do something that makes them happy.",
            "This sounds a little like my fiance who suffers from what we believe to be social anxiety. She prefers to stay home and has trouble around lots of people and is hesitant to try new things. I've done a few things on my own that she later admitted to wanting to go with me on, but couldn't because of her anxiety. I think it's hard for us who don't suffer from this to truly understand what is going through their minds. It can be really frustrating trying to do something that makes them happy.",
            "There's a difference between being an introvert and being a prick. He sounds like a bit of a prick. I'm the most introverted person I know. I hate going out to bars, or even leaving the house if I don't have to but if my girlfriend wants to do something you can bet your ass that I'm going to suck it up and go to fucking grocery store with her without giving attitude like some snotty 6 year old. \n\nMaybe it's not this way and your post just made it sound like it, but seriously...being an introvert isn't an excuse to be an asshole",
            "You said you've tried talking to him and it didn't work. Have you tried saying this part? If not, maybe consider it?\n\n>Our relationship has been so great, but I can feel things being strained. I can feel him kind of slipping away. I don't know what to do.",
            "If you had kids with this guy, you'd be like a single mother.\n",
            "I'd ask if we can talk about what's bothering him *ever*, and if nit, I'd tell him that's not okay, because we're married and that's not how we're supposed to treat each other. I just want to know what about my activities has you upset, or if it's even related to that? I just need to know where the problem is coming from so that I can take the appropriate measures to help alleviate it. We're married. It's what we do, is help each other through our hard times.\n\nSorry for starting to talk like I was role-playing. It was the easiest way for me to communicate what I was trying to say. I pray for your marriage.",
            "Just checking for clarification- when you go to the movies by yourself, or booked the tickets, was there a step where you actually said \"Hey, I'm gonna head to that movie now- do you want to come with me?\"  or \"Hey, I'm booking those next week.  If you don't want to come, my mom will join me.  Are you coming?\"\n\nAlso, definitely take the advice of others and get marriage counseling.  A lack of communication kills relationships, and right now it seems like your husband actively doesn't want to communicate what's wrong to you.  Regardless of whether he tells you what it is or not, it's actively hurting your marriage. ",
            "I'm really pleased with your update! I was going to suggest that maybe he was slightly depressed because that's kind of how I act with my SO when I'm in a depressive funk. I'm glad he wants to get help and I'm sure you two can work it out. Have fun on your trip! ",
            "This reminds me of the children's book \"The Big O\". ",
            "My SO and I are very independent. If we want to do something without the other we just give them a heads up, and if we want the other to join us we explicitly invite them. We even have separate bank accounts even though we live together and will soon be married. \n\nStill, there are those times when one of us is really passionate about something, like a concert or whatever, and we will try to convince the other to go. Sometimes it works and they have a better time than they thought. However many times when that happens, it doesn't end well. \n\nWhen one of us does something because they feel obligated or coerced, they might passive-aggressively sabotage it by complaining a lot or just dampen the experience for the other. \n\nTLDR - if you want to do this thing your husband doesn't want to do, do it on your own. Better yet, befriend someone from class and arrange a trip with them to use your new language skills. Maybe one of your other friends would go. ",
            "Response to the edit\n\nCongratulations on the communication progress.  IMHO, don't go on vacation with your husband and your mother.  You might have the trip planned with your mother but I think your marriage is more important.",
            "He's upset with himself for being the way he is.",
            "You all need to work on communication. It sounds like he really isn't telling you what his problem is. He needs to open up. I suspect he is afraid of losing you. And maybe a bit jealous. ",
            "I didn't read this until your updates- I was so happy to read them! My thought was that he felt he was getting left behind in life (by his own choice). You guys sound like a cute couple and I'm glad he's getting help and you're living as the person you've always wanted to be!",
            "To your edit: If you guys are better at text-based communication, maybe you should consider keeping a journal around the house so that you can write back and forth sometimes.",
            "A few things from my perspective. While it's perfectly okay to do things without your SO (my wife and I have separate hobbies as well), I'm not entirely sure I'd be okay with my wife just going on a vacation without me. Vacations come with cost (flight, hotel, food, cab, etc.) that exceeds our individual budget allowance, and so these kinds of things would need to be both agreed on (for us) before making the purchase.\n\nWhat I read was that you asked if he wanted to go, responded that he didn't, and then you proceeded to plan and buy the things for the trip. Did you tell your husband that you were going to do it before you bought everything? Did you discuss you going without him? Was there an agreement made over the money it takes to go on this vacation? You said that things were great with your \"little adventures\", but taking a flight and going somewhere for a vacation goes beyond a \"little adventure\" (as you put it). I think there was a miscommunication here, and that he feels you stepped over a line that you didn't know was there. I know you said you've tried talking about it, but it hasn't gone well. I'm here to tell you that communication will likely fix this issue, and the two of you need to be able to get the communication going. That means therapy, a calm discussion about feelings, or a \"come to Jesus\" type of talk. It all depends on what communication works for you guys, but it needs to be worked out.",
            "[deleted]",
            "oh no.. please don't stop doing things just because he's a total bummer about it :( It would be so, so sad if you missed out on amazing and fun life experiences just because your husband likes to stay on the couch and play games.\n\nI think you should buy him a ticket to the place as a surprise. If he still says no... then honestly i think there's something really wrong with him. If he says no you should go - you've earned it!!! - and maybe go to marriage counselling when you're back home.\n\nPlease don't let him or anyone else limit your life. You'll have so many regrets if you do. ",
            "Where are these long-suffering women with these insecure husband's coming from? ",
            "You know? There's something I see you doing together in your future. Getting a divorce. \n\nTo be completely blunt about it, if your priorities are so completely different that he resents you for it, it's just a matter of time.",
            "You say the reason he doesn't go out isn't because he's depressed.... But now that you've been having all this fun and bettering yourself, I bet you it's making him feel a little down. ",
            "Out of curiosity - was this an expensive trip and did you book the tickets without EXPLICITLY talking to him about the money portion of it?  Because he seemed fine with everything up until the point when you were ready to book the trip...",
            "He's just upset because he misses your company at home. You guys will get through this, he just needs to get used to it. He's probably feeling left out. As a homebody myself, I can understand both sides.",
            "Perhaps part of it is that he didn't want to be wholly dependent on you while there. I've visited other countries with a friend/partner who was fluent, versus my kindergartner-babble. It can be an awkward dynamic unless you're comfortable with depending on them to be the liaison and secure that you're useful or valuable to them in other ways (companionship, other practical matters like packing/cooking/holding onto tickets and itineraries) and that they really don't mind being the person to negotiate everything. Maybe your husband is insecure about his worth to you.",
            "It sounds like he's more upset with himself for not going with you. Have you tried planning activities at home, like learning together on Duolingo, so that he is in a comfortable setting? \n\nKeep doing your \"me time\" outside the home and see if you can incorporate \"us time\" where he's comfortable.",
            "Buy him the ticket! I've traveled a lot and find that in many places English is commonly used. I'm sure he can still enjoy himself and even get by with just a few key phrases. ",
            "Yeah, it's called being an individual. ",
            "[deleted]",
            "Can you check with the airline if there's like a free 24hr cancellation policy? Maybe you could go ahead and surprise him with the ticket, but add if it's still no you can cancel it.\n\nI'm not sure how expensive it would be or if it's actually feasible, just a suggestion.",
            "Shot in the dark—some countries create social permission structures for men to grab or otherwise accost an unaccompanied woman, especially in festive/bar situations that draw tourists. I think some men can't help revving up the \"worst case scenario\" machine on this? Like maybe this makes him want you not to go, but he simultaneously realizes how f***ed up and irrational that is? If so, he really should keep it to himself, and it sounds like he is trying (\"I can tell that he knows this is ridiculous though, because he'll say sorry almost immediately and be sad and quiet the rest of the time\").\n\nAt least this would explain why he said he wants to go when that's something he normally wouldn't do, why he then took it back (because who flies thousands of miles just to chaperone their gf?), why he is inexplicably mad about it, and why he won't talk about it.",
            "File for divorce. Effective immediate ",
            "Did you marry my ex husband?? This is why we divorced!  He eventually came to resent me so much for having any kind of social life, there was absolutely no making him happy. 😔"
        ]
    },
    {
        "post_id": "3qus1n",
        "author": "iregretitthrowaway",
        "title": "[UPDATE] I(M/24) think I made a huge mistake in breaking up with my ex(F/20) 3 months later - (2 year update)",
        "url": "https://www.reddit.com/r/relationships/comments/3qus1n/update_im24_think_i_made_a_huge_mistake_in/",
        "score": 2403,
        "num_comments": 121,
        "created_utc": 1446221653.0,
        "selftext": "[Original](https://www.reddit.com/r/relationships/comments/1t1h0y/im24_think_i_made_a_huge_mistake_in_breaking_up/)\n\nThe original didn't get much attention, but here goes for anybody who ever wanted what happened.\n\nI ended up leaving her alone and decided to fix myself. I knew the way I treated her was horrible. I made a promise to myself that from then on, I would be sure to treat people the way they deserve. You shouldn't take people for granted, especially when they're nothing but good to you. Nobody deserves the way I treated her the first time around. I learned a lot in the time I took alone. Why I treated her the way I did and I looked carefully into the excuses I made. I did end up sleeping around, yeah. I did a lot of things I wanted to do(not with women, in life), and some things I'm ashamed of. I learned who I want to be, who I am, and how to get to that point. I'm still improving. But I still regretted the way I treated her for a long time. A really, really, really long time. And I still do.\n\n6 months after I posted, I ran into her jogging in the park. It was the first time I saw her since the concert. We spoke for a long time. Not about us - just about life and how we've been. Her and the new boyfriend had broken up, but I didn't expect that meant we would become anything. To my surprise, we began talking and hanging out again. I thought I'd never see her again. She was very wary on hanging out with me and I understood why. We'd meet up and walk in the park for a few hours, every week or so for almost a year. \n\nOne day she came over my house again, and well. We began going out on actual dates and I learned how to communicate. I don't hold things in anymore. We both hang out with each others friends now, and I guess there's so many things I never noticed about her. She's very sweet, beautiful, funny, and highly intelligent. I really hit the jackpot both times but this time I know I won't mess it up. So far it's been almost a year since she came over again, and things are well. I'm going to keep working on myself to be the best person I could be. Thanks for knocking some sense into me /r/relationships.\n\n**tl;dr**: I broke up with my girlfriend a little bit over 2 years ago and was a selfish asshole. We reconciled almost year and a half ago and I grew up a lot.",
        "permalink": "/r/relationships/comments/3qus1n/update_im24_think_i_made_a_huge_mistake_in/",
        "comments": [
            "Oh boy! Looks like fate has given you a second chance. Don't. Fuck. It. Up. ",
            "If nothing else, it's a good sign for your relationship that over the past year and a half you've changed from describing Brittany as\n\n>I liked many things about her. She had a good sense of humor, we like the same music and all of the same video games, she's hot, she gave me cool gifts. She was always there for me.\n\nto \n\n>She's very sweet, beautiful, funny, and highly intelligent. I really hit the jackpot both times but this time I know I won't mess it up.\n\nGo to therapy. Be kind to her. Good luck, and to second /u/ozogati's advice - Don't. Fuck. It. Up.",
            "You were a real asshole in your first post, but it seems like you've become a much better man, and you used the expierience to do that. Props to you and I'm happy it worked out. ",
            "Take from a man who regrets who he used to be, don't fuck this up man. I miss my first love still to This day. I've become a much better person but it's still probably not good enough.",
            "You have no idea how much I envy your girlfriend. I have been dreaming about this happening to me for two years. But...... I know he's not coming back. \n\n*HUGE Fucking Sigh*\n\nDon't screw it up!  And good job, you. ",
            "I seriously needed to read this today.\n\nI went back and read your OP and if the time frame wasn't all wrong I'd think you were my ex (BF?)\n\nSame situation. He was out of work, feeling down, I'd just moved to his state which was a big change, and.... HE changed. Like Brittany I tried so many times to communicate with him. He wouldn't. Instead he just froze me out. Physically and emotionally while saying everything was fine.\n\nAnd, like Brittany, I finally said \"I love you but I can't do this. I care about you and us but obviously you don't feel the same way, and I won't try to convince someone that me and our relationship is worth the effort.\"\n\nWell THEN he realized what he lost. THEN he saw what he'd been doing. THEN he tried to change. THEN he got counseling. THEN he made me a priority. \n\nWell, too bad that THEN I didn't care anymore. I'd tried so hard and got shut out, and it hurt every time. I didn't have any try left.\n\nBut, because I'd said \"Maybe we can hang out OCCASIONALLY and see how things go AT SOME POINT\" because I didn't hate him, it just didn't work out.... he took that to be carte blanche to harangue me with apologies and texts and angles and try to get me back. \n\nIf he'd tried that hard 6 months ago...\n\nI've told him keep up with his counseling but *NO CONTACT* for the moment. If - IF - I ever feel *truly* receptive to trying again we can see where things are. But he is free to move on as am I.\n\nI still care for him a lot. I still love the person he was and what we were before he couldn't communicate and took his stresses out on our relationship. If he finds that guy again, then maybe. I'm not holding my breath tho. I just don't know the future.\n\nBut it's good to read your post and know that, no matter how he and I end up, he may actually be sincere. \n\nAnd dude.... don't fuck up again. Appreciate the woman that loves you this time. Ok?\n\nThanks for sharing your experience, OP.",
            "The thing I love about r/relationships is that at times we can be real assholes to people but once in a while some users will give posters a wake up call, even if they are harsh, which will result in an Update like this one.\n    \nYou deserve this. Why? \n    \nBecause YOU changed. \n    \nYou didn't harass her untill she gave in. You just needed some guidance to let go. And you know what? It paid off!\n    \n> I'm going to keep working on myself to be the best person I could be. Thanks for knocking some sense into me /r/relationships.\n    \nThis is how every update here should end. keep working dude. There's always room for improvement.",
            "Just remember the engineer's prayer: \"Dear Lord, please don't let me fuck this up. Amen.\"\n\nSeriously though, I'm happy for you, and I hope each day you're a little better than the day before.",
            "This is really sweet. I broke up with my boyfriend just a short while into our relationship because he wasn't ready. Wasn't a good communicator, wasn't in a place for a relationship. I wasn't 100% on wanting to be in a relationship at all, and I realized I didn't want to commit to something that wasn't exactly right.\n\n\nAbout nine months after that we started hanging out again. I was wary, but three months after that we started dating and he's moving in with me tomorrow!\n\n\nI laugh when people say people never change. There are limits, and maybe fundamentals don't change, but behavior can. He was always a sweet soul and I always loved him. He just learned to be a better boyfriend!\n\nCongrats, and keep up the good work.",
            "As someone who *painfully* realises that they're a selfish asshole, **how** did you start down the road to fixing yourself?\n\nI'm an insane loner, I have pretty terrible self esteem, and honestly I find social interaction to be incredibly draining - so I honestly don't go searching for it. The most social interaction I have during the week, outside of work, is the few small bits of small talk with the coffeeshop girls, and the few people I know at my gym.  \nAnd I'm finding it hard (and harder as time goes on) to hold any kind of real, intelligent conversation,  my mind is often just a blank slate. ",
            "Awesome. \n\nSecond chances are a rarity, same with love. Go with it, appreciate, recognize, and try your hardest to be open. Love is beautiful and second chances are as well. ",
            "Upvoted for using wary instead of the erroneous and nigh ubiquitous \"weary\"",
            "You should count yourself extremely lucky she let you have another shot.  ",
            "I broke up with my girlfriend last night... Mainly for the same reasons. I've been selfish and I haven't shown her how much she means to me. I've hurt her many times, and this time it was one too many. We've argued in the past, separated, and i will come running back, apologizing and saying I'll try harder. All she wanted was more time and attention from me and I couldn't even give that. So when we broke up this time, I didn't chase after her. I don't want to hurt her again, and I need to figure things out about myself. I need to grow a lot more. Be someone more deserving of her.\n\nBut your story gives me hope. I really do hope one day I can be the man she wants me to be. I hope fate still brings me to her again.",
            "To all the hopefuls still wishing their exes would wise up and come back to them like OP...\n\nStop. Breathe. Let go. Really.. focus on yourself, really focus on yourself, and let the relationship go.\n\nTo give yourself hope and to hang on to your previous relationship will only serve to hurt you further.\n\nI know, I've tried. It only brought pain.\n\nSome tales are not meant to be finished. Some tales are meant to be life lessons to you.\n\nYou have your path, your ex has his/her path, and OP is going on his path.\n\nI highly believe that people are meant to teach us lessons in life. When you meet someone who is meant to teach you that lesson for a lifetime, they stay. Others only have to teach you once, and then they go.\n\nLet go, and everything will fall into place after.",
            "That's legitimately really sweet! I'm glad you shared that story.\n\nNow don't you fuck it up this time, hear?",
            "Don't mind me, just..^cryying",
            "With my wife at the time, I was a lot like you. I didn't communicate my feelings to her. I kept everything in which is part of why it failed. Now I have a girlfriend and couldn't be happier. I tell her just about everything (including when I'm going to poop). Everything is out in the open. It just feels so so good. I finally understand why people say \"communication is key\"\n\nGlad things worked out for you, man. Keep on communicating!",
            "Today is my first day alone after almost a 5 year relationship. We decided to separate to better ourselves. This gives me so much hope!! I'm happy for you and thank you for sharing this post.",
            "I wonder how much you really grew up in 6 months.\n\nI hope it's a lot; I hope it's an extraordinary amount surpassing all growings up in history, for the sake of your girlfriend.",
            "Sounds like you are a very lucky guy, and smart enough to recognize your faults to work on them, not many people would change to make things better.",
            "Amazing story... You changed because YOU WANTED to change. That's what's helping your relationship now. Keep it up! It was very nice to read this... Very refreshing.",
            "Congratulations mate. I'm glad you could see your faults and correct them. I wish you and your girlfriend a happy and fulfilling future.",
            "Congratulations. You really did hit the jackpot. You got time to learn about yourself and be better together. That's insanely rare, and really great that it happened to you.",
            "Aww cute update ",
            "Boy aren't you lucky to hit jackpot again. Britney sounds like a good sport. But bear in mind, she's obviously hurt by what you did last time and this is your only chance to redeem yourself. If you fuck it up again, man, I'm sure one of her friends would have your head for it.\n\nThat being said, best of luck. And don't. Ever. Fuck. It. Up. Again",
            "I would do anything for s second chance with the love of my life.  ",
            ":D My heart. ",
            "I think if you keep up the attitude of looking at your own behaviour and what you can do to actively and positively contribute to the health of yourself, her, and the relationship, you should fair just fine.  Congrats on a second chance - not many people get those with someone worthwhile :)",
            "When I was 22 I went through the same shit. Feels good to learn how to be a considerate human being doesn't it? Keep it up op. We all do shitty things in life, and make mistakes. I'm happy to see you were able to grow from it, and know that it was yourself you had to improve on. You learned your lesson the hard way, but there really was no better way for it to happen.   \n\nNow go buy her some flowers or text her something nice, just because.",
            "is this the same person that made the first post? they don't sound like the same person ",
            "As someone who went through something similar, but didn't end up speaking to her again. I'd like to bid you good luck, and am glad to see that you'll get your second chance.",
            "This is amazing. I was so frustrated by your original post after reading it but damn, you've come a long way. Proud of you and glad you got her back in the end and are clearly a better person now. ",
            "well shit, this just makes me feel bad about breaking my [23M] relationship with my 4 yr gf [23F]\n",
            "Everyone needs some introspection and it is hard to do, hard to change, but so rewarding when you're looking at improving yourself.  This is the kind of love story I like. Good job and many happy wishes for a long, loving life with her. ",
            "That's awesome bro, good for you :) Waiting for the Update II post on your wedding day ;)",
            "In your original post, you explained that you never learned how to communicate well, yet you've been in relationships since you were 16..\n\nYou're like an autistic Ricky Martin.",
            "I have nothing to say to this except \"ddon'tfuckitupagainawwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwWWWWWWWWWWWWWWWWWWWWW.\"",
            "Congrats and good luck. Wish I had a second chance. ",
            "Congratulations my friend!",
            "Awwwwww... :D :D :D :D :D\n\nYou just made my day, OP.  So happy for you!",
            "This really warms my heart.\n\nCongrats, and good luck!",
            "I'm sure anyone reading this will be happy for you. Best of luck OP.",
            "That's great news man. I used to be very self conscious and would project that insecurity onto my relationships. It's been a few years since I started to work on myself but I can say I've learned a lot as well. ",
            "Thanks for posting the update. ",
            "yay!! good luck! :)",
            "Good job. ",
            "I'm happy for you. Second chances are rare, but I'm glad you guys were able to make it work. ",
            "I really like you and your story",
            "Interested in how this walks out. Yes, she's someone special to you. And that's good. If something comes of it ill just remind you, a man's greatest ability is to simply walk away. I would have told you that before I believe and ill say it now. \n\n\nJust a precaution.",
            "$50 says he gets bored again",
            "Woah you sound exactly like my ex. Literally exactly. But no I didn't take him back lol. Over a year ago. Consider yourself lucky.",
            "But I still regretted the way I treated her for a long time. A really, really, really long time. And I still do.\n  \n  \n6 months after I posted...  \n  \nYou still seem to not really have a great perspective. Really work on yourself. And don't let changing moods or emotions dictate how you see the world so strongly. "
        ]
    },
    {
        "post_id": "11ecxks",
        "author": "None",
        "title": "My (36M) sister ( 28F) and brother (26M) feel guilty because I didn't have the same chances they had. They want to take care of me. I'm just happy they could achieve their dream and just want to keep living my life.",
        "url": "https://www.reddit.com/r/relationships/comments/11ecxks/my_36m_sister_28f_and_brother_26m_feel_guilty/",
        "score": 2401,
        "num_comments": 217,
        "created_utc": 1677601666.0,
        "selftext": "I (36M) have 2 siblings, Lena (28F) and Mark (26M). I have been taking care of them for most of my life.\n\nWhen I was 20, our parents died in an accident and I had to step up to take care of Mark and Lena. We didn't have any close relative, except for our grandma, who was too sick to take care care of us.\n\nI retired from university and got a job. Somehow we managed to survive, thanks to my work, our parents' inheritance and our grandma, who sent us money sometime.\n\nWhile they were growing up, there were many times I believed we couldn't keep living like that but I always tried to not show I was worried in front of them and to act as if everything was fine.\n\nWhen Lena was 17, she decided she wanted to be a doctor like our father. I don't know how we managed to pay for her university ( it was a joint effort of me, Lena, Mark and grandma)  but she was able to graduate. Grandma had been stuck in bed since I was 18 but she did the impossible to come to Lena's graduation ceremony. She basically came on a wheelchair with her doctor on one side and me on the other.\n\nMark loves flower since he was little and always said he wanted to work in a flower shop. That's exactly what he is doing now. It's not thrilling but it's a good job where he is able to do what he likes, so I'm happy for him.\n\nLena got married 2 years ago with Tom. He is a bit too innocent but all in all he is a good man.\n\nI work for a moving company. The salary is not the best but now that Lena and Mark are independent, it's enough to live my life and I'm slowly paying back my debts. I can't afford many luxuries but I don't care about that. I'm not a fancy person; as long as I'm healthy and I have a roof over my head and a book in my hands, I'm happy.\n\nUnfortunately my siblings don't agree with my way of thinking. They feel guilty because I couldn't go to college and couldn't get a better job and they blame themselves for this. I have told them a thousand of times that I don't care about that anymore and that I'm just happy they could achieve their dreams and live a comfortable life.\n\nIn the past 2 years I was able to convince them to let it go.\n\nRecently, though, I had a minor accident. Nothing serious, a desk fell on my hand and I broke two fingers. The doctor said they will heal in a couple of months.\n\nUnfortunately, this made Lena and Mark worry again about me.\n\nLena wants me to go live with her and her husband and Mark wants me to work in his flower shop.\n\nI don't want to be a burden to them, I don't want to interfere in my sister's wedding and I don't want my brother to give me a job out of pity.\n\nHow can I convince them I'm fine with my life and just want them to be happy and move on with their lives?\n\nTL;DR : I took care of my siblings since they were little. Now they insist on \"making things even\" by taking care of me. I don't want that.\n\nShort EDIT: I want to thank you all for the comments. I have read all the comments so far and you have given me a lot to think about. Thank you.",
        "permalink": "/r/relationships/comments/11ecxks/my_36m_sister_28f_and_brother_26m_feel_guilty/",
        "comments": [
            "I’m going to be blunt: you are letting your pride hurt your relationships with your siblings. Look how you describe your relationship with your siblings. I don’t want to be a burden. I don’t want their pity. I don’t want to interfere. \n\nI’m going to translate that for you: you’re scared to need anything from anyone because of your trauma of losing your parents. \n\nThat doesn’t mean you have to move in with your sister or take a job you don’t want. But it does mean that it’s not normal or healthy to do life without relying on the support of others. Your siblings want to help you, and the best way to get them to stop would be to give them suggestions of real help that will get you where you want to go for the next part of your life. Maybe that’s helping you pay off some of your debt into an interest free loan from them so you can focus on retraining for a new job. Maybe it’s helping you network to learn more about possible careers or find investors in a business of your own. I don’t know, but you have three successful people who want to help you succeed.\n\nLast, I suggest you read the essay the Sandwich Means I Love You by Captain Awkward. When you refuse the help of others, you are subconsciously telling them “I don’t want to give you opportunities to love me.” Which I’m sure is not what you want to say.",
            "OP, I’m going to take a different direction here;\nI’m in love with a man who, like you, struggles to receive and accept love for what it is, struggles to believe he is not a burden and that I do things for him because I truly want to. Doing things for him literally lights my heart up. I love to love him.\n\nIt is so difficult and so so so painful to repeatedly be told that he likes (whatever the gesture was), but to please not waste my time on him, that he knows I am busy, tired, etc. I know him well enough by now (and yes, we have discussed it) to know that this pushback isn’t because he doesn’t want to be loved, it is because he fears it, feels unworthy of it, fears he is a burden.\n(Yes, he is in therapy.)\n\nOP, on behalf of anyone in your life who loves you, I want you to know that some of our greatest joys in life is giving love and knowing it has been received. You are not a burden, nor a pity party. You are worthy of being loved and it lights up my fucking life to love that man and I am sure your siblings would be just as overjoyed to be able to give to you.",
            "Your brother isn’t offering you a job out of pity. He wants to help you like you’ve helped him, because he loves you—and same with your sister. They don’t see you as a burden! They want to help take care of you the way you’ve taken care of them.\n\nIf you truly don’t need it, tell them so. But if your normal job is performing hard manual labor, you’ve recently injured yourself so you can’t work for a while, AND you’re nearing 40…don’t you think you might need some help here? Maybe finding a job that will put less strain on your body? Or helping you with bills while your fingers heal? \n\nConsider letting them help you.",
            "At some point, you have to trust your siblings are adults and are capable of offering you gifts or support with sincerity, and not just out of childhood guilt.\n\nYou're infantilizing them when you refuse to even consider thier suggestions or gifts.\n\nThey are adults. They can choose what they can afford to offer someone they care for, and how they want to live their own adult lives. That includes offers they make to you, and suggestions about how you can be a part of their lives.\n\nLearn to accept some support graciously from people who care for you. Doesn't mean you have to accept every thing, or do things you don't want to do, but seriously, get the stick outta your ass, and give them the gift of trust and respect as fellow adults. Trust them to be sincere and thoughtful in what they are offering. Respect them enough to say Thank You, or No Thank You, instead of continuously re-enacting your roles from childhood with them and tell them you don't trust them to be acting out of anything but guilt. They are sensible and capable young adults. You get a lot of credit for them being that way. Learn to treat them as such.",
            "> I don't want to be a burden to them....I don't want my brother to give me a job out of pity.\n\nIs that why you gave up so much to raise your brother and sister?  Pity?  Was that how you felt about them?  That they were a burden?  Why are you the only one allowed to make sacrifices for your family members?\n\nYou literally gave up your future to ensure theirs.  It may not have felt like you had a choice, but you really did.  You could have looked after yourself, finished school, and built a comfortable life by now.  Your siblings would have survived.  \n\n> I have told them a thousand of times that I don't care about that anymore and that I'm just happy they could achieve their dreams and live a comfortable life.\n\nYou may have made peace with your decision but you are deluding yourself if you think your brother and sister do not know exactly how much you put yourself behind so they could get a good start in life.  They are adults and have been so for long enough enough to truly understand and appreciate what you did for them, **and they will never be able to forget it.**  At this point you are doing them a disservice by not allowing them to balance the scales, if only a little bit.\n\nIt is time you learn to allow yourself to receive help, not just give it.",
            "I think people enjoy doing nice things for people they love. I think sometimes we feel like we are being selfish by allowing others to help us. Sometimes oddly enough it can be a little selfish not to let loved ones help. Sounds like a really nice family you have and I admire how you’ve all gotten through something as difficult as this.",
            "I think you have forgotten that love is a two way street. If you just give and never receive then they will always feel as 8f they should have done more. \n\nPractice receiving outside of your comfort zone. If you are not working for a few weeks go visit Lena and Tom and practice not feeling like a burden. Just go \"be\". \n\nGo visit Mark and see what the flower shop work is all about and seriously consider it as a back up job possibility.  Moving company is hard on the body and it could be a healthy option. \n\nYou don't have to accept their bigger offers just try on the possibility. Do you have time off to try this?",
            ">as long as I'm healthy\n\nYeah your job is not going to keep you healthy. You helped your siblings, why would you turn your nose up at them returning the favor? You're only 36, dude, and the work you're doing now will wipe you out faster than usual retirement age.",
            "Here’s the thing.  You were given an incredibly difficult job at a particularly young age. You had to give up your vision of your future to do this job. You’ve done your job.  You did it so well both your siblings are thriving, happy, financially secure members of society. Great!  Now it’s your turn. What do you ultimately want?  Right now you have a physically demanding job that I’m not certain is sustainable for the long run. Now you get to decide where you want to be in 20 years. Do you want to go back to school?  Learn a trade?  The world is your oyster.  You incurred debt because of your siblings.  You feel they don’t owe you anything.  If the roles were reversed wouldn’t you feel the need to return something?  The people that you raised are good people that love you and want to return some of the goodness you gave them.  That’s a sign of just how much you did right.",
            "Listen to them. Moving heavy stuff at 36, till when? \nYou need another, easier on your body job. Maybe look into going back to college? Get a desk job. You graciously took care of your siblings without it being your responsibility, now allow them the opportunity to feel a little better by taking a little care of their older brother.",
            "Dude, listen to me. Your siblings are not treating you like a burden. They want to repay you for your efforts. There is nothing wrong with accepting help. \n\nRight now, you are letting your pride hurt the relationship between you and your siblings. Stop that. Yes, what you did was amazing. But let others take care of you for once.",
            "INFO: Do your broken fingers mean you can't continue at the movers or live on your own? I would assume you can continue, but your siblings offering you a job/rent free accommodation is making me think twice. Also, was the injury at work, and if so, was it determined who (if anyone) was at fault for purposes of compensation? That might be something to look at if you can't work from it.\n\nEither way, my point would be *Don't let \"I can survive\" be the reason you refuse support when the support is to try to help you thrive*. I understand not wanting to live with a couple, especially when they're relatives and noticeably younger than you - getting used to someone else's routines etc can be annoying. But if you're out of work, why not take the offer of a part time/temporary position at your brother's shop? I wouldn't say the offer is out of \"pity\", I see it as an offer from someone who has the budget and gap in workforce, who also happens to care about you and think you wouldn't immediately cock it up.\n\nI understand it can be stifling, but it sounds like they just want to help because they're good people. Often, accepting help from someone can make everyone happier - if you're sure you don't need the job or the bedroom, is there some physical task you could ask them to help with? \"No, I'm fine for money, but actually I was wanting to <trim the hedge/clean & fix up the decking/etc> and my fingers would make it awkward to do alone, could you come over next weekend and we'll make a day of it?\" They'd get to have helped, you get to prove that you're still capable, and you get to spend a day hanging out with your nice siblings.",
            "They don't feel guilty, relationships are supposed to be reciprocal",
            "Just saying, I'm 34 years old and I'm about to graduate from undergrad. Pick the right school and you would be in good company.\n\nNow that you're getting older, you will NOT regret finding a job that won't be so taxing on your body. You don't have to go for anything fancy or ambitious. Just a modest job so you can take care of yourself, and you won't risk slipping a disc in your spine and hurting for the rest of your life.\n\nI say accept your sibling's help. Let them do for you what you did for them.",
            "I don't have any advice but my God you all sound like absolutely wonderful humans. You all sound like you care about each other so much and every one of you are selfless and loving. \n\nI wish all of you nothing but the best things in life",
            "As a single kid with aging parents- be grateful you have people there that are willing to take care of you. You will need care at some point in your life and don't push them away if they are willing. \n\nBeing humble is great, but we live in a capitalistic society and money is the only way to ensure that we can have the proper care to die with dignity. Right now I can't afford to take care of my parents, and I'm also 900 miles away from them. I can't caregive for them if they needed it. \n\nTake the help.",
            "First of all bravo you sound like an amazing family man & it’s a breathe of fresh air personally to witness, but also maybe just tell them exactly like you said, now they are independent you’ve got your life to work on again & it’s exciting & also that you don’t think you need uni to be able to do what you want in life, good luck :) xx",
            "Have you ever seen the  movie \"Searching for Sugarman\"?\n\nPlease  do. It is about a humble man of greatness. \n\nOur World is rich because of people like you.",
            "I gave up my dreams to go to university and went to work when my dad died from cancer a few years ago.\nI worked to support my mum and younger sister.\n\nMy sister got into uni and has a degree in IT, we were eating 3 meals a day again and things were good.\n\n\nYour siblings do not see you as a burden, they want to reciprocate.\nI would accept their help if my sister was anything like your siblings",
            "This story is beautiful. The world needs more men like you.",
            "This wholesome story and excellent advice from strangers has me in tears. Great advice. \n\nYou don’t have to move in with your sister or take a job from your brother, but please allow them to help you in small ways. It sounds like they really want and need to give back. You helped raise these beautiful people.",
            "One thing that you could try would be to say something like this:\n\n\"Mark and Lena, when you offer me things like jobs in your business [or whatever; pick things that stand out to you as good examples of the behavior you are vexed about], I feel as if you think you have an obligation to me because of how we grew up.  I chose the life path that I am on, and am happy with it, and I need to feel as if you respect my choices.  For that to happen, I need you to stop trying to give me things and opportunities that you believe will make my life what you think it should be, instead of the life I want it to be.  Can you do that for me?\"\n\nEither they will catch the clue-by-four as you present it to them, or they will not.  \n\nIf they do not, then what you have to come to terms with is that they are *never* going to stop trying, and so at that point your choices are to just learn to live with their attempts, and politely decline them whenever they make them, or to distance yourself from them so that they don't have so many opportunities to try.\n\nBecause at the end of the day, you cannot change them.  If they do not choose to change this behavior, there's nothing you can do but accept that this is who they have chosen to be, and deal with it either through tolerance or distance.",
            "While you are recovering from injury.  Take up the offer to work in the flower shop. It'll allow everything to heal properly without your siblings having anxiety attacks worried that they would get the call that you are seriously hurt.\n\nYou raised some very loving and over bearing kids.  Your parents would be proud.  Now it's time to put your pride away and let them be your siblings.  Which means annoying you until you give in to their worries.  \n\nThis is their way of paying you back.  Let them.",
            "Don't look a gift horse in the mouth.  They want to help elevate you because you are family.  Someday you may be in position to return the favor in some way.",
            "Its not guilt they feel,  its love and gratitude. \n\nStop being so bloody stubborn, its likely you won't be able to do such a physical job until you retire, the wear and tear will take a toll on your body, so accept their help/support to make a career change to something that could be better physically and financially. If not flowers get your heads together and find something that you would enjoy. What was your goal when you went to college.",
            "Maybe you could ask them to help you out with college still. Moving company is a job you can do indeed, as long as you're healthy. But that latter part is no guarantee. You now are in a place where you could look at a back up career. You don't have to live with your siblings, but they would be able to help you out in a way that can change your life. \n\nPerhaps just look at the website of your local community college and just see what they offer. You could find a new passion this way.",
            "Just dropping in to say this the most wholesome post I've ever read on this sub. Your family truly treasures you and has not forgotten what you've done and sacrificed for them.",
            "You are an awesome man. Big brother and friend.  You sacrificed for your family.  Let them return a small portion of the gratitude they feel towards you.  It does not have to be a room or a job. But let them buy you a good steak dinner or pizza and beer.  Give them the opportunity to tangentially express their love for you being awesome and helping them succeed in their lives.  Sometimes the hardest way we can love someone is to let them love us.",
            "You sound like me. Look up hyper independent, I am sure you suffer fro this too. I’m",
            "Someone needs to turn yours and your siblings' lives into a Pixar movie because this is honestly the most wholesome relationship post I've seen. \n\nBut in all seriousness, please let them help you. It will only make the 3 of you stronger and closer as a family. I would give anything to have that kind of bond with my family..",
            "Dude you're a bad ass. They made a whole tv show about you when I was a kid. It was call Party of Five. \n\nYou gave up a lot to help them and sounds like you did a good job. Let me them help you. I am about sure you need some stuff you have not thought about. \n\nDo you have a 401k or Roth IRA? \n\nIts not to late to go back to college and pick up that dream. \n\nYour brother and sister worry about you and they want to be near you b/c you are family and that is something to treasure.",
            "You've put yourself into the position where you won't accept help for yourself. I'm trying to get out of that position myself with the help of a therapist. \n\nI've learned that letting people help you, even if you don't want the help, strengthens interpersonal bonds. Doing the \"I don't need your help, I can do this myself\" is good, but too much isn't. Even if it's something simple like getting a glass of water.\n\nOr maybe I'm just crazy and my therapist is playing along.",
            "You did a great thing for your siblings. However , you also got something out of it: pride and happiness or doing something worthwhile. It seems like from your post it was very satisfying to be able to give that to your siblings.\n\nHowever now you’re letting your pride stop them from the same thing. Helping people can really be a gift - and letting people help you can be a gift to them.",
            "Op don't let anyone guilt you into excepting help you said you didn't want.. there's nothing wrong with living your life the way you want no matter how that looks to anyone else",
            "Lol this reads like the script from some underdog film. Are you guys actually taking this seriously? It’s clearly a work of fiction. Jesus, read it again.",
            "I understand that you value being independent and  it’s really hard to let yourself be helped after you’ve spent so much of your life being a caregiver, but i think you should let them help you. theyre not trying to help because they pity you, they’re doing it because they love you and it hurts them to see you struggle after you sacrificed so much for their wellbeing and happiness. I actually do agree that the suggestion to move in with your sister is a little extreme (although a kind offer), but throw them a bone. if you accept some of their help, you won’t only make your life easier but you’ll also make them happy because it feels good to help your family members",
            "Sounds like you need to build some boundaries, below is a format you can use but one thing I would like to say... \n\nPerhaps there is a change in perspective you need to adopt, it's not about you being a burden, much like they weren't a burden for you. They want to help you, it's okay to accept assistance from family. Just because you're the eldest, doesn't mean that you can't allow them to give back to you. \n\nAllow them the gift of reciprocation. Don't rob them of that.\n\n-------------\n\nIn terms of boundaries, I recommend trying the WIN Method...\n\n(Note: The structure is always When/It/Next. There's always the one person who complains about this and thinks \"I\" is better, I disagree and that's not the format of this method. Do what works for you and keep scrolling.)\n\n[W]hen you...(insert problematic behavior)\n\n[I]t made me feel...(insert how it made you feel with full transparency)\n\n[N]ext time, please (insert desired outcome and lay your boundaries down) \n\nAfter this, it's about enforcing your boundaries. Don't allow yourself to be distracted or baited. If someone disrespects your boundaries...leave/hangup/tell them to contact you when they're ready to respect your boundaries. Don't negotiate them, stand by them.",
            "The way your siblings are behaving toward you is a testament to the fact you've raised them to be kind, considerate people who know to count their blessings.\n\nIt's really hard to accept help when you've had to do things for so long without reliable help, in your formative years. It's time now to let go of the role of parent, and take up the mantle of 20-year-old you again. Not saying you have to go to uni, but you have to relearn how to relate to your siblings as a sibling.\n\nYou are worthy of love and care when you're not erasing your every need to look after others, too.",
            "I dont know what to say about your predicament. But i just wanna say this, your parents would be proud of you beyond belief. Being a parent is hard and it takes two people. And you managed by yourself. Sometimes giving is what makes us happy. And you have giving them soo much and are happy to see them fulfilling their dreams, maybe its time to let them be happy by giving you something back. God knows you earned. Enjoy your siblings love.",
            "Listen to the top comments. We all think your siblings just love you. Let them!",
            "Were they burdens for you? Were you just pitying them? Did they interfere? I know dynamics changed and you took on a parent role but at the end of the day they are your siblings and you are theirs. They aren’t trying to pay you back penny for penny, they want to show you they love you and appreciate what you did. There is so much love in this post that’s so rare.",
            "Bro, You have done a great job in your life....\nI am really inspired...😊",
            "People who are overly worried about being a burden are usually the last people who are actually a burden.",
            "Aw I think it’s sweet your siblings care for you the way you cared for them! It’s the same thing! They’re grateful for you and your sacrifices. Let them help!",
            "First of all, I commend you for stepping up when you needed too in a time that I can't even begin to imagine how hard it was for you at such a young age. Second, as an oldest sibling, I get where you're coming from. I personally would have a hard time taking offers from my sisters too, but I don't think it's pity. It's love. You helped them get to where they are today. You got them through losing your parents at a time that they needed them most. You loved them so much that they always came first, just like your parents would have. Now it's their turn to \"repay\" you. And they want to. I don't think it's your pride getting in the way, I think you just don't want to \"disrupt\" their lives. You won't be, you'll be giving them the gift of being there for you, the way you were for them. And honestly even parents move in with their kids as they get older. Don't look at it as pity, look at it as love",
            "Don't rob them of their ability to be a blessing. I know I get it. I'm prideful when it comes to asking for or receiving help. I have been this way my whole life. I'll turn around and give the shirt off my back, but I can't say I would accept it if I was on the receiving end. Allow them to be a blessing for you the way you were for them.",
            "What you did after tragedy was incredible! You kept the family together. You sacrificed. Guess what, you did a great job. You are a wonderful role model. They want to help you because they love you, and because  you thought them that working together they could lift each other up, that they could fulfill their dreams, even under very difficult circumstances.  \n\nIt would be a good idea to honour those lessons, and respect the people you raised. You can guide their help, but if you refuse it that will diminish the lessons of strength of character you instilled in them. \n\nUltimately, you are their sibling. Do you think your parents would not have wanted the best for you? Do you think they would have wanted any one of their kids to refuse help from family? What if you wanted to help your parents and they refused? How would you feel?\n\nYou would be honouring your parents if you accepted the help and support of your siblings.",
            "Hi 36M. You should let your siblings help you in any way they can. They want to. They love you, you know.\n\nYou may feel like their father, but you're not. You are their older brother whom they admire infinetly - and they know what you did for them. They KNOW. And want to give back. You should let them, or they'll feel guilt for the rest of their lives.\n\nWe, the people a little older, may understand where you're coming from, but that doesn't mean it's right. You don't have to work at your brothers flower shop, you don't have to move in with your sister, if you really don't want to. But you need to figure out a way for them to help you. I'm sayin YOU need to because you're the one saying no to everything they offer and they don't know what else to do.\n\nThink of a way they can help, because that's all they want. I would, too, want to help. You seem amazing, and are not unworthy of help when you're in trouble. I promise.",
            "You took care of them because you love them. Why is it hard for you to accept that that's what they want to do for you, because they love you? They're not going to get hurt or disadvantaged by helping you now that they're grown. You enabled them to get to where they are now and they want you to succeed as they have.\n\nThey are not \"sacrificing\" anything for you, if that's what you're worried about. They're not paying you back in some way at the expense of their livelihoods or education.  \n\nYou've been too long in survival mode. But maybe if you just accept some help, you could be thriving.",
            "Let go of your pride, man. Let your siblings care for you the way you cared for them. You didn't have a choice, but they do, and they're choosing to be upstanding and wonderful people. Accept their gracious kindness—not enough of it is given out in this world. Make it count.",
            "I'm going to offer a suggestion that you're not going to agree with, but that you definitely need. I think it strikes a balance between it maybe not feeling like \"pity stuff\" (like having you move in with them), while also not being something merely symbolic, but actually something that a) you really need, b) would probably not be able to do for yourself, and c) will better your life in the long run.\n\nAsk them to bankroll you for a couple of (or five) years of psychodynamic psychotherapy with an experienced therapist (that's likely not the kind you'll be able to access through your insurance). You need this in the short term and idrectly because of your unprocessed trauma of losing your parents, which is definitely shaping the way you relate to the world (and definitely your siblings), and you need it in the long-term because you seem unable to see what they're seeing... which is that, while you're young today, continuing in a manual labour job is just not sustainable, and will land you in a world of trouble if for nothing else because you won't be able to support yourself when you're older and hoping to retire. I'm going to shortcut around your therapy and suspect that this short-sigthedness is a result of your having needed to spring into action when your parents died in order to support your siblings (Which was absolutely the thing to do at the time); but is a life-mode that is no longer applicable nor sustainable for you.\n\nI don't know what the future holds for you, but I know that carrying on like you are you're not going to end up a happy man. I think your siblings will be thrilled and jump at the opportunity to help you in such a tangible and veritable way, and I think this might just be \"not handout-y\" enough in order for it not to be painful for you to receive.",
            "What do you want? If you didn’t have to worry about being a burden, about being pitied, about money, about anything… what do you truly want? Do you want to go back to college? Do you want a different career? You and your siblings have survived. They’ve thrived. You’re allowed to dream now. \n\nIt’s okay to go beyond survival and just being satisfied with life. It’s probably been a while since you’ve reconnected with that possibility, so maybe think about what you wanted to do when you were twenty and go from there. \n\nNow what is something your siblings could do that would allow you to pursue those dreams?",
            "Wouldn't you do the same again for them if you could? I think you would. So why can't you accept their help?\n\nI'm not saying you should live with your sister or work in your brother's shop, but they are extending help, and you should seriously consider it. It's not about pity or guilt. It's about showing you how much they love and appreciate you. They see you struggling and can offer ways to make things easier for you. That is what family does.\n\nYou stepped up for them, now it's their turn to do the same for you. And it's out of nothing but love.",
            "These are your siblings, not your children. They want to help you out, just like you helped them. Why would you deny them the opportunity to do that now that they're in a position to?\n\nYou say you're fine, okay cool. But with their help you could work on making your life great. You did what you had to do to get by. Let them help you be great.",
            "You are a good man, but sometimes being too selfless is bad too. I can tell you raised your siblings well that’s why they want to take care of you, take your good karma man. Maybe not stay over with your sisters family that may be a bit too much but you can defintly take some support from them when you need it, like the flower shop. That request isn’t from pity, it’s from care.",
            "It’s not pity it’s family loving you and wanting you to succeed. \n\n\nIf you feel guilt…think of if this way. You’re older than they are and if you don’t get back on your feet then they could be possibly taking care of you in your old age. So it’s a win win for all!",
            "Let them help you pay off your debt. Why don't you want things evened out? I sure would take the money. Moving isn't an easy gig. One day you'll be too old to move a couch up five floors, what then? Just let them help you a bit financially. Because you deserve a good life too (your life is already good, I'm sure, but it can be less stressful)",
            "Let them contribute so you can build a retirement fund. It is something a child would do for a parent and you are a parent to them.\n\nYou are still young enough that this could be a great help down the road.",
            "Letting other people take care of us can be very difficult, particularly for people accustomed to being the provider.  But doing so allows them to express their love, and helps keep us humble.",
            "I was exactly you growing up. Yes my mom was there but she was either drunk or passed out when not at work. I took care of my younger brother and sister growing up and after, until a year and a half ago my sister caught covid and passed away. A horrible sitiluation because she was like my daughter and if you ask them they would say I raised them. I went no contact with them because some narcissistic kids lied to them. I miss my younger brother and his kids he's like my mom and is either at work or drunk off his ass, our older brother is in jail and ive only talked to him once in 6 years but lived with his ex and his kids to help her becuase she has brain cancer and i showed all 3 of them a better life. OP I am glad that your scenario after you guys grew up is better than mine. This is an amazing outcome and be glad they want to take care of you. I mean all this in the nicest way possible, please just love them the way they are and except that they just want to show you their gratitude. I would still take care of them if it were possible especially since I have some autoimmune issues and can barely take care of myself. Just reiterate to them how much it means to you that they want to take care of you but that you are fine.",
            "You should think about your future and how they CAN help you. Assuming you’re a mover and don’t have a desk job at a moving company, the odds of you making it too full retirement age without destroying your body are iffy. Even if you live in a country that supports retirement benefits, think hard about what your body/health will look like by the time you qualify and consider if that’s truly a healthy, happy future for you.\n\nIf not, think about what WOULD be. If the flower shop would be a good path, then you’re being irrational I’m not accepting this offer out of pride. Your family wants to share their success with you, and you’re not obligated to let them but it’s not being kind of you to reject this out of pride alone.\n\nIf you just simply don’t want to work in a flower shop/don’t want to live with your sister, think shot what you COULD do—is there a certification you could get to switch careers to something you might enjoy, that’s less likely to destroy your body? If so, talk to them about what it would take to get you set up and let them help you with it because they very clearly want to.",
            "Did you take care of them out of pity when you first took on all those responsibilities? You took care of them when they needed you the most without a thought, it’s just your hard work coming back. If there ever was such a thing as karma, this is it. As long as you aren’t smooching off of them any help they give is the help you gave them to begin with coming back around.",
            "Never give up On your life. Debt is an instrument, use it to your advantage and go to school if it means you can get a better job. You can always find ways to make substantial income via teaching, Uber, leasing, real estate and more. These are careers that can happen any time in life and can happen simultaneously. You can easily surpass 6 figures and enjoy the luxuries of life. \n\nIf your siblings do care for you, let them care for you in logical ways, like supporting you in business or stipends vs intruding jn your life. \n\nI would find ways to stay close but gain financial\nFreedom",
            "Question: did you ever see your siblings as a burden when you were raising them?\n\nIf the answer is no, what makes you think they will see or feel you as burden when all they want to do is to reciprocate the love and care they received from you? \n\nMark is not pitying you. He's offering you a job he think will be a better fit. You don't offer a job onto someone who is a burden because they wouldn't do the job but you can.\n\nWhy do you want them to move on with their lives so badly by essentially leaving you behind?\n\nYou literally taught them that's not what family does. You stepped up and finished raising them even at the cost of something big because you loved them. That's what they're trying to do with you. They love you and want to look out for you too now that they're able to as financially stable adults. They don't want to move on from you because you are their 3rd parent and want you in their lives happy and whole. They want to see you succeed too.",
            "You’re a good person. It’s hard sometimes to receive help from others especially if you’re always the breadwinner. But there’s nothing wrong to say yes to their offers and catch some break when you can. You deserve it.",
            "I think everyone has said the blunt part of it, but to add, it's okay to not want their help. You aren't required to accept it. And it's incredibly hard for most people to learn to take a compliment, let alone huge favors like that. \n\nThe best way to think about this is to compare what they think you deserve vs what you want and/or think you deserve. If you communicate complete contentment with a life they believe is far below what you deserve, they will believe that you're trying to stay strong for them. After all, you did it for so long and they certainly figured that out at some point. So your best bet is to note something you are willing to accept from them. In one comment you mention you'd like to go out to dinner with them. Definitely let them know that! They're not used to doing things for you so you have to help guide them towards the things that would actually make you feel loved. \n\nIn addition, keep thinking about your future. You sound so sweet and lovely, so I hope you find a great partner if you want one or just enjoy every book you get! But everyone needs help at some point, so I hope you can get to a comfortable enough place that you can list your siblings as emergency contacts.",
            "I think it's good to remember that you're not their parent and everything you did to raise them and get them to achieve there life's now was not because you had to it was because you loved them and wanted to look after them make sure they were okay, make sure they didn't have to deal with more pain of not having a house getting split up in the system etc. You did this with love, and they want to do the same for you now that they can to show thanks, love, and appreciation for what you did. I think that's all it really boils down to.",
            "If you're interested in going to school it's not too late.  You can do it on weekends and nights.",
            "My older sister was like this.  She sacrificed a lot so that her younger siblings could achieve some of the goals they had.\n\nSo she currently has a low paying job, for the rest of us have at least a decent paying job, enough to do more than just some of the basics.\n\nOne of the ways we pay her back is to help her take care of various bills around the house and doing things.  Honestly, she'll take care of her normal house bills, but let's say if something big and unexpected pops up,  like the AC broke down, then we help pay that.  Or in the case of her car , after sometime of using her really old car,  we got her another used car but it was just more modern.\n\nAnd if we go on any kind of family vacation , usually we take care of her bills like lodging and food and transportation.\n\nIt works out to show that we appreciate her and while we all still struggle to really make it,  but at least we have a good relationship with each other, so that even if sometimes we can't financially do all that we want to do but we can enjoy little things like hanging out together and having lunch or dinner.\n\nYou may not feel an urgent need of their financial care but every now and then if they offer things like this, accept it  graciously .  they want to do it for you.",
            "One of the greatest satisfactions of my life was being allowed to care for my mother as she was dying. I saw it as my opportunity to really show her the regard I had for her, and give her the love and care she gave me so freely all my life. \n\nNow. You aren't dying. But - you cared for your siblings because you wanted to, because you love them, right? Can you love them enough to give them the gift they're asking?  I guarantee they want to return your love, because they love you and understand the care you gave them for so long. The question is if you can put aside your pride long enough to give them this gift.",
            "Don't think of it as repayment or making it even. That's just a common phrase that people say. It's supposed to make you feel better, but obviously it makes it feel worse to hear it. You were unfairly burdened by having to care for your 10 and 12 year old siblings when you were only 20. It wasn't their fault, but it was a burden for you. When they say \"we want to repay you\" you hear \"now you're the burden, and we only want to help you out of fairness or a debt we owe you\" but that's not true.\n\nYour siblings love you, and they would want to help you even if you hadn't raised them as much as you did. Even if the accident had never happened to your parents. You were injured at work and your siblings are worried that if you continue that work you will get injured again, and they want you to heal quickly and then find a safer job. Because they love you. It isn't because of your past, or payback, or pity. They just love you. \n\nI think you should suck it up and move in with your sister. It can be temporary while your hand heals. And you don't have to work at the flower shop, but you should try to find a safer job. Once your hand is healed and you have a new job, you can move out and your siblings won't have to worry about you as much anymore, just like you wanted!",
            "They’re not doing this out of pity, they’re doing it because you’re their brother and in a tough spot.  Your brother doesn’t own the flower shop.  They’re helping you, you helped them.  Let them.",
            "A few years ago someone said, “allow people the blessing of helping you” to me. The more time passes, the better I understand that.",
            "You are a saint and should be proud of yourself. But I also think maybe it’s time to go live with your sister and do what YOU want to do with your life. Figure out what will make you happy and go for it. There’s nothing wrong with taking a break and figuring out your next move. Go back to college if you want. Finish at community and then go online (highly recommend penn state) \n\nIf you want to go back to school, don’t think you can’t. I was a janitor until I was 33 and finally finished college. Now I have an incredibly important job  in finance. It’s NEVER and I really mean never, too late. You deserve a break, and you deserve someone helping take care of you for awhile. \n\nBest of luck to you, I hope you get everything you want out of life because you absolutely deserve the best.",
            "You stepped up for your siblings when they needed it. Now they want to do the same for you. You may not like exactly what they have in mind but do not turn them away. Try to work out a plan together. They love you and want to help you move forward in life, just as you did for them! \n\nPlease don’t think of yourself as a burden or even needing their ‘pity’. You didn’t see them as a burden, nor pitied them when they were small. You guys help one another out when needs be. That’s what a loving, caring family do. Be happy and proud that you set such a great example, and happier and prouder now that they learnt from you and want to give you the love and support during an awkward time.",
            "Your siblings love you like crazy, let them love you. Just guide them to what you'd like them to help with. We all need help for something.\n\n\"I don't need a new job, but I'd love it if you'd come and fix my garden with me.\"\n\n\"I like living on my own, but I'd love to spend a vacation with you guys together.\"",
            "I feel like everyone else here has covered the advice part. I want to just give you something else-\n\nI hope you know you can put the armor down. It's time to give yourself a break and truly internalize in your bones- you overcame impossible odds and stepped up to be the best possible big bro Lena and Mark could have ever asked for. You were their hope and their rock from such a young age. From this stranger and I'm sure from your siblings, we have the same message to you- thank you.\n\nYou can rest. Your need to fight the world is done. You don't need to fight anymore. The impossible task is done. You can let love in and let work, honor and pride take a backseat now.",
            "Why do you feel like you need to convince them?  You shouldn’t have to tell them more than once or twice - anything beyond that and they are crossing boundaries.\n\nYou can’t control their behavior, only yours, so the only way to fix a situation is to adjust **your** behavior. Honestly, this sounds like you have boundary issues. So, you need to find ways to enforce those boundaries. They can only cross a boundary if you allow it. Figure out why you are letting them cross boundaries (what fear do you have), and then change your behavior to enforce the boundaries. \n\nDo some research on enforcing boundaries… a google search will yield quite a bit.",
            "Don't know if this has been said, but how about some support for you to go back to Universtity? 36 isn't too old for this. \n\nAlso, as you feel, keep living your own life. If a bit of financial help with paying off the debtks you incurred while raising/supporting them is available, you can take it without feeling guilty, you made sacrifices for them.",
            "You brought them up because you love them. You sacrificed yourself and your career for them. Now, they have their shit together and have the ability to say ‘you’ve given us everything we ever wanted, but for us to be truly happy, we need to see you happy and okay.’ \n\nSit down with them and discuss your options. Maybe moving in with your sister whilst you recover/get rid of your debts, and working with your brother in his flower shop may be exactly what you need. \n\nDon’t be hard on yourself and don’t let your pride stop you from bettering yourself. Your parents would want you all to be okay, not just 2 of you.",
            "You are wonderful.  What you wrote, your life, how you think and deal with things are very loving and admirable x",
            "Hi, I just want to say sometimes it's just a nice thing to let your loved ones help you.\n\nI know of two friends where both lived very comfortably, but one was REALLY well off. The very well-off friend always *insisted* on paying for everything, and the other friend was sad because they just wanted to do something nice for the other. It's good to do things without expectation of anything in return (unless it becomes manipulative, but that's not the case here), but it's also good to let your close ones do nice things for you sometimes.\n\nMaybe it's not accepting your siblings' specific offers (living with her or taking a job), but do try to let them support you sometimes. It's okay and even healthy to enjoy mutual support.",
            "This is beautiful. It's not about repaying you. Why is it only you were able to show your love by making all that sacrifice yet they cannot demonstrate theirs ?",
            "Take it from a guy who is nearing 40, who thought that the manual labor of his thirties wasn’t strenuous enough to warrant consideration: either swallow your pride now, accept their help, let them complete the circle and help you now… or find yourself being an *actual* burden in less than half a decade; when your knees, back, shoulders, neck, and fingers all simultaneously decide that the last end table you schlepped up some stairs *was the last fucking end table*.\n\nThe retirement plan for laborers is “dead”. Let your siblings transition you out now, take a light duty job in a paid-off home, or else. Trust me, they’d rather help you do that now— they want to enjoy your presence in their lives, and this is how you can give that to them. They’re not going to be happy if you reject them, only to find yourself in five years, depending on them to wheel your broken ass in for regular cortisone injections so you can hold a fork.. or shoving pillows between your knees and oxys in your mouth at 7am every morning for a month, because you tried to bend over and tie your shoes the day before.",
            "This is the most beautiful thread I've read in all my years as a redditor. Thank you to everyone who weighed in. OP, whatever you decide to do, please know that we -- and I'm daring to speak for everyone here -- appreciate your outlook on the world, your perseverance, and the amazing human beings you've raised. And we root for you to see and accept their expression of love and care, however you choose to do so. <3",
            "If the flower shop pays similarly, you should definitely consider that my man. \n\nI sincerely have an insane amount of respect for movers. On the same level as teachers. What you do is a noble profession that can be physically brutal. \n\nBe honest with yourself, you know that’s a young man’s job. You have no future as a mover.",
            "Moving will destroy your body over time. Try to find something a bit less destructive when you are able. Good luck and congratulations on kicking ass!",
            "You are a good person. They know this, and they want to give back to you. Let them.",
            "It’s okay to let people love you the way they want to.",
            "It sounds like you raised two kids into two incredible adults who probably worked as hard as they did to one day be able to pay it back in some way. I know from growing up poor how much I still dream about being able to say to my parents okay, let me take some of the load off of you guys. Maybe you can't accept the bigger gestures, but maybe look for ways to learn to accept the smaller ones (without feeling like it means to also accept being a \"burden\" -- they do not think like this, no matter what your brain tells you). Let them spoil you -- take you out to dinner, or maybe even a trip. You lived your life for them, but that shouldn't be your only character defining trait. Get to know them as people instead of just your dependents now that you can. You are only two years older than me, but you sound so defeated even while you say you're fine. It's probably a defense mechanism, like the top commenter said, about needing to control things because of your own trauma. What started as a shield has become a fence, and if you don't learn to let them it could become a wall. You don't deserve that.",
            "OP just wanted to say that you were put in an impossible situation. You really stepped up and took on a massive amount of responsibility with grace. You have a lot of good karma coming your way. Sometimes it arrives through the people we love. \n\nPS: The actions of not only you but also your siblings is a clear reflection of who your parents were. If you were my kid I can’t imagine being more proud of who you are as a person.",
            "What you did is beyond incredible, selfless and the most loving thing you could have done. Not many people could have done it. Try to put yourself in their positions. It probably hurts them knowing of your sacrifices and they want to return the love you showed and gave them. Relationships aren’t one sided, let them love you and show their gratitude. Have you considered going back to school?  You supported them out of love now let them do the same. You sound like a really great human.",
            "This post sounds like it was written by ChatGPT",
            "you're like the best sister ever. you deserve to be treated with respect and looked after, you just have to let your silblings be there for you 🖤",
            "I think youre the kind of sibling that dreams are made of, my friend. If you truly do not need/want their offered aid, then that is fair. However, if it is something you’re refusing to do because the thought of being taken care of cripples your sense of agency… then maybe allow that to fall away and count it a blessing you’ve got family to lean in on in vulnerable, humbling times. \n\nAs the eldest sibling with a younger brother I love as I do my own soul, I too have nothing but deepened peace with every modicum of “success” that comes his way… especially if it is something I long for. He does not ever feel bad about this though LOL and neither do I. If he were to obtain resources in surplus that I lack, I too would give some degree of pushback as its just not a matter of “Even Stevens” to me. Then again, if the man insisted, I’d be rude to turn down a loved ones gifts and blessings. Anyways, it can be hard to discern within ourselves whether or not we have fully allowed ourselves to receive life’s various blessings, whenever we are accustomed to tending to ourselves and others dependent on us to be a blessing in their daily lives - as you did with your siblings at just 20 years old.\n\nYou have a real gift here and some karmic brownie points in the realm of compassion, integrity and responsibility - let those who know this about you more than a stranger on Reddit, reward you accordingly.",
            "I once read that you can be independant also accept others love and help, It doesnt make you less independent or less power 😊",
            "You are a fucking hero. Period. Thank you for being you and taking care of your siblings and sending them off into the world as decent human beings.",
            "I admire what you have done for your siblings, you're a truly great man, that being said, you're letting your pride harm your relationship with the two closest family members you'll have for the rest of your life.\n\nI understand that you don't want their \"pity\", but try to put yourself in their shoes and understand that they feel guilt, whether this feeling os justifiable or not is not something you can determine on your own. \n\nThey can treat you, without you being a \"burden\" to them. Were they a \"burden\" to you? I'm sure you wouldn't call them that, so why call yourself that? \n\nPick your battles, I wouldn't go live with my brother and his family over two broken fingers or accept a job from my other brother, but you can think of someway to make them feel useful to you or they can. You need communication in this situation, don't let your pride hurt your relationship.",
            "You seem like a rare man. I seriously respect it. I think it would be super cool for you to accept that your siblings care so much about you. I mean dang. You deserve that man. You just gotta figure out how to help them love on you better. In my family nobody talks about their feelings, and so I get if it can be a bit awkward to show that when you're so use to being the leader, but I think it would be good for you and your siblings to talk about some different ways to show appreciation. For some people, simply accepting compliments can be so damn difficult, but we owe it to our loved ones to let them feel needed sometimes. Anyway, good job man. You ought be proud.",
            "Take what they're offering. Go back to school and get a job that isn't manual labour. How many more years could you be a mover, anyway? You raised your siblings well and their care of you is a testament to you as a person."
        ]
    },
    {
        "post_id": "4vvwo4",
        "author": "scriblydibly",
        "title": "UPDATE: My best friend [25F] has been ignoring me for a year and now wants me [25F] to give her fiance a job.",
        "url": "https://www.reddit.com/r/relationships/comments/4vvwo4/update_my_best_friend_25f_has_been_ignoring_me/",
        "score": 2400,
        "num_comments": 94,
        "created_utc": 1470185851.0,
        "selftext": "Thank you all for the dozens of helpful comments and messages. Here's the OP: https://www.reddit.com/r/relationships/comments/4v35ti/my_best_friend_25f_has_been_ignoring_me_for_a/\n\n\n\nI called Sarah's home phone the morning after I got her message. Her mom answered and told me she was out with Joe. We chatted for a few minutes, and.then she suddenly started crying. She told me she feels like she's lost her daughter. She said she would ask Sarah to call me. I didn't get a call back. \n\n\nThe next day I got a surprise visit from Lily, who Sarah and I were really good friends with in college. Lily and I had fallen out of touch and I was really excited to see her again. That night I took her to a party. An actor that Sarah always liked was there, and Lily ended up hitting it off with him and posting a picture of the three of us doing shots on Facebook. \n\n\nThat night I got a text from Sarah saying, \"Since when do you hang out with (actor)?\" I was extremely annoyed and didn't respond. An hour later she texted \"I guess you're too much of a celebrity to respond.\"\n\n\nI spent about an hour ranting to poor Lily, and then composed an email to Sarah. I think I kept it pretty unemotional. Basically, I told her that she had really hurt me by cutting me out of her life, and I didn't think it was fair for her to suddenly reappear with no explanation or apology. I also said that I think her relationship with Joe is toxic and that I hope she overcomes her fear of being alone so that she can stop jumping into unhealthy relationships. Finally I told her that both her mother and I are worried about her, but I don't have the time or emotional energy to keep trying anymore. If she wants to get in touch when she's fixed her personal issues, I'll be open to listening. Until then, we're not friends anymore. \n\n\n\nI'm upset, I'm tired, but mostly I'm done. I hope I made the right decision. \n\n\n\n---   \n**tl;dr**: Best friend is no longer my friend. ",
        "permalink": "/r/relationships/comments/4vvwo4/update_my_best_friend_25f_has_been_ignoring_me/",
        "comments": [
            "> \"I guess you're too much of a celebrity to respond.\"\n\nWow. Boy was I wrong about her.\n\nIf this is how she tries to get back into your life (and no, I don't think we can chalk this one up to Joe), she's truly no longer your friend. Unbelievably rude.\n\nI'm deeply sorry for her mother, it must be extremely painful to see your daughter lose herself so thoroughly. But I think you're justified in being done. That is about as disappointing an update as I could have imagined. I'm sorry, OP.",
            "> \"Since when do you hang out with (actor)?\"\n\n\"We've been married for months. Where have you been?\"",
            "You made the right decision.\n\nI live in LA, too. It's funny how people reappear when they think you know someone they want to or have connections they need, and it's especially hard when you aren't from here and it's someone from a \"normal\" place. In my experience, a lot of people are not going to be happy for you unless you are doing things for them...and those aren't the people you should do things for. It's great that you didn't try to get him a job and stood up for yourself to her. You haven't gone Hollywood, your friend has gone Joetown. When you're in an unhealthy relationship, and your friend's pattern of unhealthy relationships is notable, you either leave or you subscribe to the other person's worldview. She's subscribed to his worldview, you realized it, and you are better off being away from her as long as she's this person. ",
            "Sounds like you did the reasonable thing. I'm sure she won't respond or reach out until she breaks up with her bf, if she ever does. She doesn't sound like a pleasant person though, in that last message she was baiting you just to get a response. Nice people don't do that. ",
            "Man. This is painful but it seems you made the right decision. Some people grow up, and some people don't - even if the two of you were best friends. Sometimes lives diverge. \n\nCongratulations to you on your success. Keep rockin' it. And don't be surprised if Sarah tries to come into your life again. At that time you'll have the power to decide if she gets let in again or not. ",
            "You did make the right decision, and I'm glad that in the email you mentioned her relationship with Joe. Right now she might be close minded and just brush off what you said in the email, but in the long run hopefully she sees that you and her mother are right. Good job OP!",
            "Jeez. You made the right decision, but I'm sorry that it ended up this way. Good for you for being clear and emphatic in your message to her - maybe she'll think on your words at some future point with Joe, and they will give her the push she needs to look at the relationship and her own behaviour in it with fresh eyes. And if not, at least you know you were honest, and you tried. Her poor, poor mother :-(",
            "Sorry this friendship had to end this way.\n\nKeep in mind she may not be the first or only person to see you as an \"in\" when it comes to the entertainment business. So you may want to have a ready response for when that happens. Sometimes non committal and non offensive.",
            "I know it's not quite the same, but when I got into law school I had all sorts of people I used to know come out of the woodworks and ask for free legal advice from me. You just have been be realistic about people's intentions.  But you handled this situation reasonably and maturely. Good for you. \n\nGood luck on the script.",
            "I'm a guy and I told my best guy friend the same thing about his wife(they've broken up over a dozen times) . She is a manipulative poisonous, and all around bad person, but he stayed with her because of his two kids. I told him he doesn't have to stay with her even if they have children together. He even agreed with me that day. Well, a couple of weeks later she's prego and he gets back together with her. I haven't seen him in over 6 months. Been friends for about 12 years. Oh well, sometimes the truth hurts. I lost a friend but one day hopefully he realizes that she's a succubus. ",
            "It sounds like you did the reasonable thing. You're putting the ball in her court to make the effort.\n\nOn the other hand, it speaks volumes how her mother cried to you. ",
            "You did the right thing. Sarah sounds like a former \"best friend\" of mine who completely ghosted me when I got an amazing job offer in another state, then tried to insert herself back into my life and act like nothing ever happened, then got really pissed when I wouldn't have it.\n\nOne of my favorite quotes is, \"When people show you who they really are, believe them.\" Sounds like Sarah has shown you her true colors.",
            "I was Sarah. You did the right thing. No matter what she was going through there was nothing you could say or do to help her. Reaching out the way you did was perfect- you made it clear you weren't going to put up with her bullsit and still left the door open. Knowing i had people I could turn to even though I didnt deserve it was what eventually saved me. I was in a bad place for a long time and I know how much I hurt the people closest to me. It took me a lot of years before I got help and another 2 years of therapy but even after all that time those open doors let me go home. You need to move on with your life and it sounds like you are doing that. Dont ever let yourself feel guitly for not helping her, you did everything you could. ",
            "You did the right thing.",
            "Can you update if she responds?\n\nAnd I do think you made the right decision. Either this will help her realize what she's doing, or she's really going to live the rest of her life as this terrible person she's become.\n\nGood luck, OP.",
            "She seems like the kind of person that would only want to talk to you if she needs something. I have a friend who only texts me or appoligizes to me when she needs me. Otherwise, I'm not important enough otherwise. That's good your no longer friends with her!",
            "Going through something similar with a best friend as well. This was inspiring. You see it from a different perspective when it's not you.\n\nYou're not wrong. I'm so sorry for your loss. Or hers for that matter. You sound like an amazing friend. And shouldn't be treated like anything less than amazing. ",
            "Wow, this hits close to home as my ex best friend did the same thing (never talking to me unless she benefitted; near the end) and her name was the same. I'm so glad you reconnected with a friend while dumping a toxic part of your life. Your email was mature and if she emails back, I would simply ignore it. Don't feed the troll, as they say",
            "Kudos to you for this awesome and mature response. ",
            "It sounds like Lily also found out that you were working in Hollywood and conveniently just showed up. ",
            ">tl;dr: Best friend is no longer my friend.\n\nShouldn't the part where y'all didn't talk for a year have tipped you off about that?",
            "I did almost the exact same thing with a good friend of mine who wouldn't take care of the bad things in her life. Just wanted to let you know that it worked out brilliantly. She got back in touch after a few months. She had gotten a lot of good things in motion in her life. We are now better friends than we were before.",
            "So sorry it came to this conclusion. I was hoping she'd come around. You deserved an apology.",
            ":/ People change. I believe you made the right decision. ",
            "From the sounds of it, she may have been competiting with you for a while, even when you didn't think she was. That explains her behavior. People like that aren't good friends and create trust issues for others. ",
            "YAASS!X You served her the right meal! Not only did you give her that gourmet fillet mignon but you gave her some aptly seasoned vegetables and a full cheese cake! Toxic friend gone and done with!! I'm proud of you OP :D",
            "> *both her mother* and I are worried about her\n\nIn the future, **please do not do this again**. Her mother broke down *to you* because she can't break down to Sarah without risking her cutting contact. This was in confidence. Not something you should have aired to Sarah. You cut contact with her, but you threw her mother under a bus and now Sarah might cut contact with mom because she feels mom 'sided' with you. You just gave Joe ammunition against Sarah's mom and might have isolated her even more.\n\nYou didn't successfully keep this unemotional. You cutting contact is not a problem. It's a healthy decision if you can't handle trying to be Sarah's lifeline when/if she decides to grab it and get out. Burning other possible escape ropes for people who can handle this emotional turmoil to help Sarah is a problem though.\n\nIf Sarah asks about her mom's feelings, *lie*. You made it up. You lied because you felt hurt and wanted to hurt her too or something. Whatever. Just don't spill more beans about how her mom is worried about her, because that's not going to help. It's going to burn the rest of the bridge. I understand why you did it because you're hoping it makes her realize things are seriously wrong, but it was a big mistake in my opinion. That wasn't yours to tell her.",
            "The kind of insecure behavior you described is neither reparable by your actions, nor acceptable in a friend. Great job writing that letter and clearly stating your perspective on the matter, and telling her what she needs to work on to earn your friendship back. I hope you appreciate the chance you had in getting closure through writing, cause it sucks to lose your close friend of over a decade through a slow petering out of communication ...\n",
            "> I hope I made the right decision. \n\nYou did.",
            "Happened to me too. I'm sorry for being so negative but I don't believe that people can change. Not in the essentials. She's just shown you some of her true colors. I recommend moving on and making new friends. Hopefully they're not gonna treat you like a free pass to a better job. But you've handled it with grace, good for you! \n\nEverything best:)",
            "Good luck on the movie!",
            "How does one completely cut off a friend after finding a s/o??",
            "tell her to fuck off",
            ">I told her that she had really hurt me by cutting me out of her life, and I didn't think it was fair for her to suddenly reappear with no explanation or apology.\n\nThat part was good.   The part after was not necessary was it?  Seemed like the part that followed was downhill.    If for whatever reason Sarah ever see's the light,  you have made it harder for her to crawl out of her hole.    But on the other hand,  maybe the kick you gave her is what she needed.   These situations are so draining,  but if we can't give them the energy they deserve,  we really are too lazy to care.   Caring hurts.   That's life.   We try to defend ourselves from that hurt.   But it causes more hurt.",
            "Lily sounds like much more of a keeper! ",
            "Is it possible her mother didn't pass on your message?",
            "Hey that's great good choice. Hey do you think you could get me a job? Or maybe just bring me along to any celebrity parties you attend?",
            "TLDR but maybe his financial and emotional situation have deteriorated this entire year and now he's seeking for help.\nIf that's not the case, sorry.\nBut if this may be the case, for him it's time to recognize good friends and ask for help, so if you like this friend, this may be the time to be a friend and get over that slow year.\nIgnore me if this is not the case, just read your title."
        ]
    },
    {
        "post_id": "52nzd7",
        "author": "PaperThinSkinflint",
        "title": "My sister [32] and her husband [30] are getting evicted from their apartment, and my mom [65] and dad [67] thinks that I [40M] should let them live in my beach house for free",
        "url": "https://www.reddit.com/r/relationships/comments/52nzd7/my_sister_32_and_her_husband_30_are_getting/",
        "score": 2402,
        "num_comments": 439,
        "created_utc": 1473814342.0,
        "selftext": "\n\nI’m a successful engineer and architect. Did it on my own, no help from parents. I moved from their house at eighteen and lived on my own, and paid for my own things ever since. Paid for my own college with loans, and paid those all back with my own job.\n\n\nSister was different. They spoiled her. She was the baby. My dad was earning more money by the time she was born and since I was out of the house they had more money to buy her whatever she wanted, including a thirty thousand dollar wedding when she was 22, to a guy two years younger than her who never went to college. She went to college for a degree in fashion and did a grand total of nothing with it. \n\n\nHer husband has always been spotty with employment, and my parents are always bailing him and my sister out because his own parents are dead or don’t talk to him. He’s supposed to be a professional DJ.\n\n\nAnyway I have a large apartment in the city where I live with my wife [39] and daughter [4]. I own a small beach condo (two bedrooms). My family usually goes there when the weather is good.\n\n\nMy sister and her husband are getting thrown out of their apartment because both of them are deadbeats.\n\n\nMy mom and dad are I guess tired of giving them money because now my mom is telling me I should either give my sister money or let her and her husband live in my beach house rent free.\n\n\nI don’t want them to live in my beach house, and told my mother as much. My mom says I’m being cruel and selfish.\n\n\nWhat’s “cruel and selfish” I think is the fact that mom and dad live in a three bedroom house and haven’t invited sister and her husband to live with them but are putting it on me.\n\n\nMy wife is being nice about it and telling me to do what’s right but I can tell she will miss visiting the beach house.\n\n\nPlus I think that once my sister and her worthless husband get in, they will never leave.\n\n\nMy parents are telling me to “man up” and be a big brother.\n\n\nLooking for advice on how to best handle this in a way that doesn’t let them have my beach house, but still isn’t cruel, and is helpful.\n\n\n\nTl;dr: sister and her husband want to live in my beach house for free. I say no. My mom says I’m mean. I say what’s mean is them not even spotting me five bucks for gas in college when they spent at least fifty thousand on my sister’s fashion AA at FIDM.\n",
        "permalink": "/r/relationships/comments/52nzd7/my_sister_32_and_her_husband_30_are_getting/",
        "comments": [
            "You need to say \"No\".  Your sister and her husband are irresponsible.  Your parents may enable that behavior but you should not.\n\nIf you let them into your condo, you can pretty much guarantee that you will end up having to evict them and they will damage your condo.  If you think your parents are calling you names now, wait until you hear what they call you when you evict your sister.\n\nYou need to tell your parents, \"I love you both, but you have always spoiled Sister.  If you want to have Sis and BIL move in with you, that is your right.  But I will not enable their irresponsible behavior.  They are both adults and need to start taking care of themselves.\"",
            "No. You'll wind up having to evict them yourself given their spotty employment and already getting evicted from their current apartment.\n\n>He’s supposed to be a professional DJ.\n\nLook forward to a trashed beach house, neighbors who hate you, noise complaints and fines after they've thrown massives raves.",
            "[deleted]",
            "This isn't \"being nice\" or \"doing what's right\", it's *enabling*. \n\nYou let your sister live there, you will end up having to evict her and probably have to pay a bunch of money to repair and clean up the place, not to mention you won't get to use the beach house you bought and pay taxes on, for likely *years.*\n\nFirst thing's first; **go to your beach house, change and up grade the locks.** Don't give your parents a key. Make sure it's locked up tight, and ask your neighbors if you have any that you know to keep an eye on the place. \n\nFrom now on, **your parents and your sister don't get to use it any more.**\n\nYour sister is a 32 year old married woman. She and her husband can take care of each other. Your parents are obviously tired of taking care of them, but because they've spoiled her instead of letting her stand on her own two (well four, since there's two of them) feet, they want you to take care of her instead. \n\nTell them no. Don't give your sister a penny. If your parents harass you about it, a simple, \"I worked hard and took care of myself, including putting myself through school without any help and now taking care of my family. There's no reason Sister and BIL can't do the same. I have my own family to take care of. I no longer wish to discuss this; you help them if you feel they need help.\" If your parents persist, go low contact with them. \n\n",
            "[deleted]",
            "Make sure you grab every key to that beach house you can. I wouldn't put it past your parents to give your sister the key to \"let herself in\".\n\nTell your mum that your beach house is none of her business and she has no right to offer your property and assistance because she pooped you out several years ago. \n\n> My wife is being nice about it and telling me to do what’s right but I can tell she will miss visiting the beach house. \n\nThen start renting the beach house out to paying people when you don't go on vacation there.\n\nSend your sister to the welfare office to sign up for housing and food stamps, etc.",
            "Stand your ground on this one. Your sister needs to learn how life is without a safety net always there's to catch her. They will have to both get a job or bite the bullet and move back in with your parents if they are soft enough. This is not your problem though. Offer to help in some other way perhaps. Job hunting, apartment hunting etc but do not give them your house. \n\nYour parents created this dependency issue and I think you should point that out to them. \"Manning up\" is standing up for yourself here - not caving in to parent pressure. ",
            "Since they created that mess of dependency they might as well see it through. So stand your ground and accept the labeling of jerk until it blows over.",
            "Don't let your family bully you into bad decisions.\n\nYour wife and child do not deserve the stress and financial loss this situation would cost you. Just think of them whenever you answer. \n\nBe a protective dad and husband. \n\nThey will...\nNever leave your place.\nThey will force you into long drawn out evictions. \nThey will cost you, time, energy, money and damage to your place. \nLegal fees\nUtilities they will never pay. \nAnger from neighbours, police and the city. \nLegal landlord responsibilities without income. \nLoss of your use of you place. \nThey will tarnish your happy thoughts of your escape place. \n\nThere is ZERO upside. They will be totally ungrateful and undeserving. \n\nIf mom is that concerned about her child. She will protect her.  ",
            "\"no.  But I totally support you guys taking them in and will help with the moving.\"\n\n\"im not the parent and I haven't enabled this kind of behavior.  I have my own family to support and think about\"\n\n\"No\"\n\nNO, this is not up for debate.\"\n\n\"Im going to have to say good bye since you keep trying to guilt m into something I have been clear I am not doing.  Please give me a call when you ar ready to talk about other things\"",
            "Have you asked your mom why she isn't inviting your brother and her husband to live with them?\n\nIf that hasn't been raised yet, ask directly. \"Well mom, wouldn't it be better for them to move in with you? You have more room and they can help around the house.\"\n\nI think you should get over the \"cruel\" aspect. What you're doing isn't \"cruel.\" If you allow your sister and BIL to live there for free, they'll likely never leave. Depending on the state, it can take a very, very long time to go through the eviction process. I can't even imagine what names your family would call you as you tried to evict your sister after she'd been living there for years without paying rent. \n\nAs for ways you can help out -- offer to take a look at their resumes. If you're comfortable with it, offer to help with their job search. Offer to help pay a security deposit on their next apartment (but not rent). Offer to help them move their stuff into your parents' house. \n\nIf push comes to shove, and you're getting pressured from all sides, and just want everyone to leave you alone, offer money over the condo.   \n\nBut really, I think you should stand your ground on this. Your parents won't be around forever, and if you start bailing your sister out now -- she'll just keep coming back to you again and again and again. It's already clear that when your parents get old and it's time to consider nursing homes and hospice, the responsibility will fall on you alone. Don't take on the additional burden of your sister and her deadbeat husband. \n\nIn other words, I think this is one of those hills that is worth dying on. ",
            "Nope.  Mom is trying to palm the sister off on you.  Let sis and her hubby move in with mom and dad.  Decrease drastically  the amount of contact you have with mom and any other relative who just want to take advantage of you.",
            "No, no, no, and fuck no. Do not do it. I went through a similar situation and it ended up costing me many thousands of dollars. He was going through a hard time so I let him move into an unoccupied apartment I had. Once his rent and utilities were taken care of, he suddenly became completely unemployed and \"couldn't find a job.\" He started regularly hitting me up for gas and grocery money in addition to the free apartment. It took two years before I eventually realized that I was enabling and not helping and I kicked him out. There was ugly drama and he ended up being cut off by everyone in the family because of it. Miraculously, since he has been out on his own and had to pay his own bills he has managed to stay employed. Funny how that works.\n\nYour parents aren't asking you to help your sister and her husband, they are asking you to enable them. Seriously, don't do it. There will be so, so many regrets if you do.",
            "Saying \"no\" is not mean, but asking the son who you never financed to give shelter to the daughter and SIL you spoiled, when you probably know that they may take advantage and never leave the place, and when you know that you have enough space on your own house, and then calling him \"mean\" when he doesn't accept, is evil.\n\nIf you accept, you know the risks. And if you don't, be sure that you're not being mean, even if your parents try to make you feel guilty and manipulate you.\nThey didn't give you, their son, any help when you were 18 and now are calling you \"mean\" for not giving their deadbeat daughter (and her deadbeat husband) a place when they're already in their 30s. This is totally wrong.",
            "If your parents feel this strongly, they need to give them *their* house. It sounds like you have a Golden Child/Scapegoat dynamic in your family where you are expected to sacrifice for her.  How long are you going to buy into this dynamic.  Isn't it past time for you to realize that your parents don't have your best interests at heart?  \"No\" is a complete sentence.  Use it often. ",
            "No? Professional DJ? Wth. Mom and dad want to foist her on you because they know she's a deadbeat. It is well past time for both of them to grow up.",
            "If you let them live there, they:\n\n* 1) probably won't respect the property because people rarely do when there's no financial incentive to maintain it; \n\n* 2) probably won't pay rent, security or anything else to offset their financial burden on you;\n\n* 3) won't leave easily, so you'll be in the awkward position of legally evicting your sister and her husband; if you think your parents hate you now, imagine when you have to ruin their credit and make it nearly impossible for them to rent again;\n\n* 4) won't get to use your house, but will still be paying for upkeep, taxes, mortgage, and whatever else; this is going to piss you off every time you pay a bill on this house.\n\ntl;dr NO FUCKING WAY SHOULD YOU DO THIS.",
            "**No.** Tell them all to fuck off.",
            "Doing the right thing is not letting them move in. You are 100 percent right in saying no. You work hard for **your** child, let your parents house them if they wish. If they keep pushing, you may need to put them on time-out or even change your number if they abuse your goodwill.",
            "If they're getting evicted, they have reached the end of a very long road. This is not a situation that blew up over one weekend. \n\nYour choice isn't between cruel and being walked on. That doesn't make sense and isn't fair. \n\nA friend of mine let her deadbeat brother and sister stay in her condo a decade or so ago. Now she is in another city, eaking out a living in a 350 Sq ft. apartmen and paying on the condo that they live in rent free. \n\nIt will be much, much, much, much harder to get them out of there later than to say \"No\" now. ",
            "Let's say for arguments sake that you are being \"mean\" and \"cruel\" and selfish. So what. You bought that condo and if you want to be mean and cruel and selfish with it you can. And there's nothing wrong with making that choice. \n\nThe reality is your parents are using those terms to guilt/bully/manipulate you into doing something you don't want to do. The power of those words is that doing X is better than being thought of as those words. Yet the people tossing around those terms clearly don't have as much consideration for you as they're asking you give them. \n\nYou remove the power of those words when you accept you'd rather do right by your wife and kid and yourself and enjoy your condo than deal with years of free loading sister. And if that means selfish people who only care about themselves think you're mean and cruel, so be it. Better to pay that price that dig yourself further into resentment debt. ",
            "We've got a saying around here: \"Not your circus, not your monkeys.\"\n\nYour parents can house your sister. You and your wife earned that beach house to use and enjoy. Tell your parents that your beach house is unavailable for their use. Do not put \"I'm sorry, but....\" in front of that. Your sister will literally never learn unless she faces a hardship. Quelle surprise, a hardship. Maybe even offer some platitude like, \"When God closes a door (living in an apartment), he opens a window (moving back in with the parents).\" :)",
            "Don't ever rent to shitty tenants. Ever. Ever. \n\nESPECIALLY FAMILY! Avoid at all costs. Imagine the turmoil when you need to evict them in 8 months. \n\nIf you want to help them with rent that's one thing. Don't give them possession of your property.\n\nYou really shouldn't give them a thing. But DO NOT GIVE THEM POSSESSION OF YOUR PROPERTY. ",
            "[removed]",
            "You won't be lending them your beach house, you'll be giving it to them. Except it'll still be you paying the bills and taxes on it, even though you don't live there any more.\n\nThe term \"Golden Child\" comes to mind. Go visit /r/raisedbynarcissists/ and see if a lot of things don't make sense.",
            "Seriously, go change the locks on your condo, like tomorrow morning. ",
            "If you let them in, good luck getting them out. \n\nThey'll never leave a sweet, rent-free, beach house. You'll end up resenting them even more as you try to evict them. (See also, squatter's rights.) This could potentially rip your family apart.\n\nYour sister's poor choices are not your circus. They need to get their lives in order and nice beach house is not the way to those tough decisions.",
            "I think the best way to say no is just to say no. The more you justify and explain your no, the more options you give people to argue with your decision. The reality is that no matter what you say, your parents, and your sister, will not like your decision and will probably be upset with you. But, the bigger reality is that you don't have to justify your decision to them or anyone. It is your money and property that you worked hard to acquire. I think we all have a responsibility to give back, but that does not mean supporting deadbeats.  \n\nAssuming these two are not completely irredeemable, there are certainly ways you can help however. There are few places in the country where two people making around minimum wage cannot afford to live. $10 an hour, times 2000 hours a year, times 2 people is 40k a year. You aren't going to be living large or buying nice beach condos on 40k a year, but that should be enough to pay some rent and support yourself. \n\nIt sounds like you have your shit together on the career side and could probably help both of them to land some kind of job. I don't mean having a friend hire them, that can blow up in your face, More helping them put together resumes, researching jobs, that kind of thing. \n\nIf you wanted to help them financially, though you certainly shouldn't be expected to, you could offer to help them pay for training programs or education. But I would only do so if they accept an offer to help them land employment and they manage to do so and keep a job for a period of time. \n\nFrom what you have said, the odds of them actually appreciating and accepting that kind of help are likely slim to none. But it would be the only thing that would actually help them in the long run. It sounds like you already know this, but letting them live for free or bailing them out of their own poor decisions might seem like help, but it is really just enabling them and making it even harder for them when reality finally sets in. \n\nHowever, they might surprise you and if it were me, I would at least make the offer. \n\n\"Sister, you know I love you and want the best for you and your family, however I will not let you live in my house for free and I will not simply give you money. I do want to help and if you and your husband want help finding jobs I am happy to do so. We can work on getting some resumes together, we can practice interviews, and we can look together to find some good jobs for both of you. Whatever it takes to help you get back on your feet in a stable job. \n\nIf you can show that you can hold down a job and be responsible, then I can see about helping you improve your skill set and get on a good career path. There are lots of certificate and other programs that can lead to good paying and interesting careers. \n\nI understand if you do not want to do that, but know that the door is always open.\" \n\nLike I said, odds are she will spit back in your face, but if you want to try and be helpful I think that is the way to do it. ",
            "So they move in and rack up your hydro bills and such and then you have to pay more money and end up kicking them out. My  husband's couisn moved in with us she was on hard times she was paying little re t and then 6 months after she said I should t have to pay rent were family I told her to pack her bags and get out.",
            ">I think that once my sister and her worthless husband get in, they will never leave.\n\nyour instincts are correct. \n\nmy mom let my uncle and his new wife live in our old house rent free to \"help them get started.\" \n\nthey lived there for free for 10 years. \n\nthen they got divorced, my uncle's wife left, and my grandma decided to let him live in her mountain cabin for awhile to help him \"get back on his feet.\" \n\nhe stayed for free for another 10 years. ",
            "Your parents can get fucked it's not their property.\n\nAlso this has nothing to do with \"manning up\" they can 'man up' and make due with the extra company. Consider the following:\n\n* Your sister and her boo need supervision and encouragement.\n\n* Yhey are being kicked out; you will also have to kick them out.\n\n\n\n\nActually agree to it on the condition that your and your sisters parents will be financially responsible for any damages the daughter and husband rack up - and get that in writing. Family problems deserve *family solutions*.\n\npro tip: this suggestion is actually for seeing how quickly your parents completely reverse their decision although if they're so willing to front for your daughter that they agree to this it may not be too bad of an option provided objective independent appraisal.\n\npersonally i'd never agree to it.\n",
            "Absolutely not. They haven't proven to be good tenants. Sibling or not, that headache isn't worth your time.\n\n I would point out to your parents that you are a father and husband first and can't clean up your sisters messes. She needs to start digging herself out of holes. That beach house is an investment that you can't just let people borrow.",
            "First things first, change your locks on your beach condo. No one but you and your wife get a key.\n\n\nYou know what I think would be just grand? They move in with your fucking parents. The gall to say, you really need to do something because she's your sister meanwhile this coming from your mother..\n\nThe reason your mother is telling you this is because her and your father don't want to live with them.\n\nIf your mother ever tells you again that you should let them live there I would directly tell her that I think being your sisters mom and dad that the right thing to do is for your sister and husband to move in to their house.  Tell her she really should parent up.",
            "Real estate broker here.  You will never get them out of the property unless you evict them again.",
            ">Plus I think that once my sister and her worthless husband get in, they will never leave.\n\nYou're right, by the way, and tenancy laws would only make this even worse. DO NOT let them move in.",
            "Just to check something, no one else in the family has a key, right? You said the family goes there when the weather is good.  \nJust... want to make sure you don't turn up one day and find a surprise tenant.. ",
            ">My wife is being nice about it and telling me to do what’s right\n\nWhat's right is not to enable their irresponsibility like your parents do. They'll just bed down in your beach house and feel like they never have to leave if you let them in there. Stand your ground, tell them no, your parents are just passing the buck because they don't want them in their house.",
            "Refuse. I bet your parents will take them in. If they try to give you shit about it, list all of the reasons you have in your original post. \nIf your parents DON'T take them in, and they are actually going to end up on the street, of course take them in. Then tell your parents how they are monsters who let their child end up homeless and how you had to step in to fix their shitty parenting. ",
            "All these comments are correct.  Having been one to throw money into the pit, I can also say that not only would you be giving up access to your beach condo, but they would likely trash it.  I have my regrets.  Hopefully, you will stick to your guns.  You are completely in the right.",
            ">Plus I think that once my sister and her worthless husband get in, they will never leave.\n\nBingo.\n\nDon't do it. ",
            "If reading r/justnomil has taught me anything its that your sister is the Golden Child and can do no wrong in mummy and daddy's eyes so there for you have to let them live in the beach house. First of all no is a full sentence and you are not obliged to let them move in rent free. They made their bed they can lay in it. Simple. Also by the sounds of it this beach house is used alot by yourself and wife so no your not cruel by saying no. If she wanted somewhere to live they should have paid rent and gotten jobs. I also suggest posting this to r/justnomil the ladies and gentlemen there can offer loads of advice dealing with this stuff all the time. Good luck OP",
            "No man you'll be enabling their shitty lazy lives.\n\nMy sister married a deadbeat DJ so I feel like I know exactly how you feel. \n\nThey will go through some discomfort and anger but they will learn how to take care of themselves. ",
            "My sister-in-law got kicked out of where she was living. Husband said she can live in his house (currently residing somewhere else). For $150 and she needs to buy her own food, we don't want her to eat my father-in-law's food(who we support).  ends up, that alcohol and pot are more important then rent and food. She even says we do nothing for her. ",
            "\"Plus I think that once my sister and her worthless husband get in, they will never leave.\"\n\nThis will happen, I guarantee it",
            "Depending on how you feel about confrontation go straight to the source and end it. Tell your sister you hear she's having a hard time but unfortunately you wouldn't be able to have her stay in the beach house because your mom had mentioned it. Done ",
            "Saying no is the mature and direct route. Also consider saying that you're thinking of selling it in a few months, or you're renting it out via Airbnb.\n\nSounds like your parents enabled her, and now they want you to pick up the slack. ",
            "\"I'm sorry I cannot help, but this would be against the condo rules. Maybe it's best if they stayed with you and dad for a while to help them get on their feet.\"",
            "You are not her father. You don't owe her a place to live.\n\nYour parents spoiled her. This is their message. Let them clean it up.",
            "They are well into adulthood. Your sister and BIL should figure their own stuff out. The rest of the family shouldn't have to take them on as a burden, including your parents. \n\nOffer to help fill out their job applications or government assistance paperwork with them, but that's it. ",
            "lol no! you can say no to this its ridiculous. your parents are reaping what they sowed when she was younger. how dare they put their parenting failures on you. terrible.",
            "I wouldn't even let them rent the place if they had money.",
            "If you want to help, the only thing you should do is set them up with a financial planner who can help them learn some fiscal responsibility.  Otherwise, no fucking way do you let them anywhere near your condo.",
            "You are not being cruel and selfish. Your mother is, by demanding that of you.\n\nHonestly, your sister and her husband will never grow up if your parents don't stop enabling them, or if your parents guilt you into enabling them in your parents' place. What would actually be helpful for your sister and her husband is if they have to face the consequences of their actions.",
            "I'm sorry but your mother is horrible.\nDon't you dare give your deadbeat sister your beachhouse. The reason shes done nothing with her life is because your parents enabled her.\n\nIf you give the beach house too them be prepared for alot of damage, not looking after it, complaints from neighbors etc...\n\nWhat your sister needs is a come to jesus moment. We wont bail you out anymore.... find a local trailer park.\n\nShe's not done anything to show or prove that she is making effort and her deadshit hubby is probably worse.\n\nFor the sake of your marriage and your own lil family.... your sister isnt your problem do not give her a place to stay. Tell your mum its not going to happen. She does nothing, she accomplished nothing so she deserves nothing from you. Your not her mother your job isnt to parent her.",
            "\"My wife is being nice about it and telling me to do what’s right but I can tell she will miss visiting the beach house.\"\n\nI don't think giving in to your irresponsible sister and her equally irresponsible husband is actually the \"right thing\". It's the pushover thing, and it's going to come back and bite you squarely in the ass. ",
            "\"Why would they want to live at my beach house when they would clearly be much more comfortable in your house, mom? You'll cater to sister's every need and make sure husband never has to hold down a real job. Can't say my place comes with the same amenities.\"",
            "Don't help your sister and her husband. They will NEVER leave if you let hem move in, I mean, they're getting evicted... It's not your responsibility to bail them out and your parents are being ridiculous",
            ">My wife is being nice about it and telling me to do what’s right but I can tell she will miss visiting the beach house.\n\nI applaud your wife's kind heart and I think that if it were my husband's family doing the same to him, I would probably be inclined to react the same as your wife...But speaking as an objective third party in this, I'm not sure that the \"right thing\" is necessarily to let them live there. \n\nDo your parents expect them to pay rent or do they want you to just let them live there rent-free for however long they need?? I think i you *do* decide to let them live there, you need to make sure they are paying rent and there should be a deadline on it. Maybe offer to help them get back on their feet in the sense of helping them figure out a plan of action. Give them an end-date as to when they'd have to leave and ask them what steps they plan on taking to be out of there and independent by the time of the deadline and **definitely** set up ground rules that you both sign (family or not). That is all, of course, if you do decide to take them in. Personally, I would stick to my guns.\n\nHave you asked your parents why they haven't volunteered one of their spare bedroom? She is your sister, not your child. It is not your responsibility for how she turns out. There's being generous and then there's enabling. Tell your parents that you don't want to enable her by just handing things to her. You didn't get any handouts and you've worked for everything you have. It's time she learn to d the same.\n\nThink a the end of the day, you kind of need to decide how important the matter is. Do you want to put your foot down, give a hard \"no\", and potentially cause a problem with the relationship between you and your family or do you cave and sacrifice for probably no pay off other than feeling like maybe you've done a good deed for charity....\n\n>My mom says I’m mean. I say what’s mean is them not even spotting me five bucks for gas in college when they spent at least fifty thousand on my sister’s fashion AA at FIDM.\n\nI would be saying this to my mom. I would be explaining everything you've mentioned here about how you've built yourself up without help and that she's done your sister no favors - but that's me personally because I think, in this specific scenario, I would feel like I wouldn't be afraid of hurting the family relationship as it seems like that damage is already done (although you might feel differently, OP).",
            "The great thing about owning property is that you have the authority over who can/can't live there. Sounds like your parents are regretting their life choices and are shifting the blame onto you.",
            "Tell them you have rented out the beach house.  Airbnb or something and that it is not available. Then suggest that sister stay with mom.\n\nStand your ground, there is a social safety net. They can apply for welfare or social assistance.",
            ">but still isn’t cruel, and is helpful.\n\nYou want to be helpful? Be the first person who isn't enabling them. Be the first one to show your sister that there are consequences for ones actions. It will suck for them at first but that is the best thing you can do for them ever.",
            "If you let them in you're not going to be able to get them out. They'll be legal tenants.",
            "I agree that you shouldn't give her the beach house as a living arrangement. What's your relationship like with your sister? From the tone and context it doesn't seem very good. I do think that if your sister ever shows positive change that you should consider maybe connecting with her again. If you tell her no, just say you've been burned before and it's a you issue not about her. \n\nThe only reason I'm saying this is because my family was in a very similar situation. My older brother was successful without much help from my parents and has resentment towards them and my youngest sister and myself about things out of my control (we went on a handful of international vacations with my parents, were given cars I our early twenties, were often indulged with presents at Christmas, etc.)\n\nI really miss my brother and I don't think he will ever talk to me or be there for me. In reality, my home environment was really toxic in a way he didn't experience. My parents had a happy marriage until money came into play. My sister and I experienced consistent verbal and sometimes physical abuse from my parents that led my sister to some really dangerous behaviors and me to depression and suicidal ideation in early high school. \n\nMy older siblings didn't have that experience and my brother especially doesn't believe it and considers is spoiled if we ever talk about our problems with our parents. The physical abuse was inconsistent but the verbal abuse really destroyed me and my sister emotionally. I was browbeaten so much that I didn't have a single positive thought about myself, wasn't allowed to get my license as an 'irresponsible menace' for something like not cleaning my room so I didn't drive until I was 21 and needed a job. Our credit had been ruined by my parents and both my sister and I had earned money as kid actors burning but it was totally gone (the cars were purchased out of guilt). \n\nWe both developed depression, she struggles with severe anxiety. We both took a long time to graduate college due to mental illness. She developed addiction that ruined ten years of her life. And still my Brother can't see past his have-have not mentality. He believes that we wasted opportunities he wasn't given. Doesn't believe or care that our childhoods were vastly different in more ways than abundance. He likes the narrative of spoiled problem children and not abusive parents. He lectures us because we have very poor relationships with our parents because Mom and Dad are generally sweet and funny and charismatic. \n\nOnly now in my 30s am I finally successful with a mountain of student debt. I refused help from my anyone and avoided my parents and worked hard to get here. My sister took longer and has a lot of resentment and somewhat entitled feelings (she feels our parents should financially support her as an acknowledgment of the hardship we had to deal with as kids and money they took).\n\nAll this to say, maybe your sister has a different experience than you. Maybe she was spoiled and crippled emotionally. Maybe she has an unhealthy codependent relationship with your parents. Some things may appear one way outwardly but in fact are another. You don't have to offer your beach house to be a good older brother. Just meet up now and then for coffee and a good conversation. Maybe she is spoiled and could use a loving reality check. Or maybe she is confused and doesn't even know what to do with her life. People are rarely villains. ",
            "Don't let them live in your beach house. \n\nBut don't call them \"deadbeats\", and don't call yourself \"successful\". Don't put down people who didn't go to college, or who studied fashion, or who are trying to be DJs. You come across as very arrogant.\n\nThat's just a comment on the tone of your post. The actual advice is hell no, don't let them live in your beach house, because that won't end well.",
            "Situations like this are difficult.  \nYou may want to start by voicing your opinion on the situation and letting them know that enabling your sister is not the right thing to do. You cannot, in good faith, continue this destructive cycle by giving your sister money or allowing her to stay at your beach house.  \nThe only way you could feel comfortable allowing her to stay at the beach house is if both she and the husband obtained and maintained full-time jobs for at least 3 months prior to moving in. (From what it sounds like, this will not happen.)  \nEmphasize that because you love your sister and bil, you cannot bear to watch them continue down the path of enabled self-destruction. You cannot give.  \nOffer up other things - like, maybe you will help your sister job hunt or spruce her resume.  \n\n",
            "Don't set yourself on fire to keep them warm. Especially as they most likely will just throw some fuel on you",
            "\"what is right\" is not enabling their shitty behavior. ",
            "If you let them move in, remember that they can establish tenancy. From the way you describe them, they sounds like *fine* citizens. But really, don't let them move in and make a headache for yourself.",
            "Better to have everyone mad at you now, instead of more angry later, when you have to evict them. ",
            "Easy.  Tell your mom your deadbeat sister isn't entitled to your hard-earned property, and then just stop responding for awhile and things will either blow over or escalate.  ",
            "Now the easy way is say the answer is and shall remain a hard and definite No. Point out that your parents can house the monsters they made and enabled, and wash your hands of this nonsense; there is a reason you left at 18 isn't there? There's also the sitcom solution; change the locks at the beach house and start \"renting\" it to people; airbnb, colleagues, etc. Doesn't have to be a lot, doesn't have to be any, but pretend that you can't have them living there because some hidden costs have come up and it's burning a hole in your wallet and only paying for itself through rent: act like if you aren't renting it (at a rate much higher than you know they can afford) that you would have to sell it. Hell, just pretend to rent it even.",
            "**NO NO NO NO NO NO NO NO NO!!!!!!!!!!!!!!!!!!!**",
            "HAHAHAHAHAHAHAHAHAHAHAHAHAHAhahahaaaaa......oh, wait, they're *serious?*  \n\n**AAAAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHA!!!!!!**\n\n\n....but really, no.  You don't need that shit, you don't *want* that shit, and no one can make you EAT that shit.  Just say no.",
            "When you tell them no send them all a text and message on Facebook just in case they decide to \"crash\" there and you have to involve law enforcement . To prove you never consented to them being there. \n\nAlso I'd go out there and just double check everything is nice and locked up tight every so often. ",
            "\"No\" is a complete sentence. Just keep repeating it until they get sick of hearing it. ",
            "Please don't give them access to your beach house. You will have to pay for everything and they will never leave again cause it's free and easy and soon they will beg for more ",
            ">Looking for advice on how to best handle this in a way that doesn’t let them have my beach house, but still isn’t cruel, and is helpful.\n\nYour parents weren't \"cruel\" and look where your sister is because of that. They spoiled her, they should take responsibility and take her in their house.\n\nNo matter what you do (even if you let your sister live in your beach house) - you will be cruel to them at some point. Suppose you let them in. First, they ruin it. When you get upset - they will say that you are cruel to them. Second, they run out of money and will ask you. When you deny the money - they will say that you are cruel to them. There is no way not to be perceived as cruel down the road.\n\nYou should understand, that being cruel to them is the only healthy thing. They need to face a reality, and it's cruel itself: they are in 30-s, with no skills and spoiled, need to look for a job, most probably close to minimum wage - that's cruel.\n\nDon't shield them from life, don't repeat your parents' mistake. \n \n\n",
            "Enabling is not \"manning up\" it's pussying out. End of story. ",
            "Further enabling your sister is not \"what's right\". This should have very little to do with missing the beach house and everything to do with your sister needing to start acting like an adult, even if she learns the hard way.\n\nLiving off you rather than mommy and daddy won't change her destructive behavior.",
            "do not do it! your parents are trying to put their problems on you. do not enable your sister. i have a sister in a very similar situation. my parents have provided for her her whole life. she and her husband live in my parents basement. they just had a baby.  I would tell my sister to beat feet, grow up and take care of yourself like an adult",
            "Your parents have been enabling your sister all of her life and they're tired of it.  And now they'd like you to take over.\n\nDon't do it.  It's not your responsibility to take over pouring money into the bottomless pit that is your sister and her husband.  That money belongs to you (you earned it), your wife, daughter, and your future.\n\nYou can take over enabling her, but for how long?  The rest of your life?  If your sister out-lives you, will your daughter inherit the burden?  Your sister needs to learn to be an adult.  She might as well start now before you've handed over your beach house, your retirement fund, your daughter's college fund, and how ever many thousands of dollars more your sister wants.",
            "I know this will probably get buried, but I have some personal insight into this. My brother and SIL let her brother move into their beach condo because SIL's brother and his family fell on hard times (got laid off and had no job prospects). There were lots of promises about how long they'd live there (under 6 mos), brother and SIL could still use it, etc. After over 2 years, they ended up having to formally evict brother, which of course caused a HUGE issue with the family. \n\nSave yourself the trouble on the front end. It would be different if this was clearly temporary - if they had a new job starting in a few months but couldn't cover their bills until then - but it's not. They have no prospects and they're not going to give up free housing once they get used to it. It will cause far less angst in the family to say no now than to try to evict them in a couple of years. ",
            "This is entirely up to you. You are well within reason to refuse them. However I wouldn't allow your resentment and anger toward your parents to crowd your decision and it sounds like this resentment is eating at you. \n\nYes, your mom is being entirely unfair and shifting the problem to you. \n\nIf you decide to allow them to move in, I would insist that they fill out a lease and make it legal. Include a time-frame (perhaps six months)? And insist that they pay some sort of rent to cover their costs. This can be entirely on your terms. \n\nDon't hand out any money directly to them, if you decide to go that route. \n\nFrom what I understand, these are two adults entirely capable of working and with nothing preventing them from doing so but their laziness. \n\nIf you don't want to be a part of any of this, but still want to do something, perhaps offer to help your sister with a resume or to put her in touch with a temp agency or headhunter. \n\nThis can't be allowed to go on the way it has.",
            "If your sister doesn't learn how to grow up and take care of her own problems now, she never will. Trust me, I speak from experience.\n\n\nIn my Mom's side of the family, she was the responsible one. The one who was good with money. The one who received zero help, hand-outs, or anything from her parents. Her younger sister had been coddled and bailed out of every bad situation she got herself into. Mom was guilted by their parents into helping her. My aunt would rent a place, stop paying rent, get evicted, have nowhere to live and no money (and she was married with 3 kids) and my grandparents would drain their bank accounts to help her and then have no money to pay their mortgage. So my Mom would give them money. She bailed them out more than once when they were about to lose their house, up until she couldn't do it anymore because she got too sick and her own income became eaten up by medical bills. \n\n\nSo where do they all stand, now? My aunt is in her 50s. My Mom passed away last year following a long expensive battle with a terminal illness. My grandparents are in their 80s, with no retirement savings. They live off of their tiny pensions. My aunt is still doing the same old shit. Renting houses, not paying, being evicted, etc. My sister and I have taken on the responsibility of sending money to our grandparents because it's either that or they won't have enough money for groceries by the end of the month otherwise (they have at least stopped giving my aunt money, but only because they literally can't afford to). My aunt has ruined her middle daughter's credit by taking out accounts in her name and then defaulting on them. She will never learn, and one day she's going to be just like our grandparents..with no savings to help when she can't work anymore. So I guess it will fall to her daughters to bail her out. It's a pretty shitty cycle to get stuck in, and if you and your parents don't try to break it now for your sister, it will continue for the rest of your lives.",
            "Nope, nope, nope. Just be firm but polite. Do NOT get dragged into an argument where you have to JADE (justify, argue, defend, explain) your reasoning. Like this:\n\nFamily: So what about your beach house? Are you going to man up and be a good brother?\n\nYou: I'm sorry, that's not possible. That's my final answer and I'm not going to budge.\n\nFamiily: What?? Why??\n\nYou: It's not possible.\n\nFamily: You're an awful brother! You can't even tell us why?? You're terrible!\n\nYou: This conversation is over. The decision has been made. If you keep pressing the topic, I'm going to have to hang up/leave.\n\nFamily: Oh no you don't! You tell us right now how you could have the heart to do this to your own sister!\n\nYou: I love you all very much, but this isn't productive. I'll talk to you later. [hang up/leave/stop responding]\n\nDraw boundaries. You already know what will happen if they move in, and you don't want them to. There is no way to magically make them/your parents okay with the fact that you're not going to let them stay in your home for free. You can only control your own behaviors by being polite and kind in your tone, and not getting drawn into a debate (which might lead to raised tempers & destroyed relationships). ",
            "Late to the party, I know OP.  Still, here goes.  Stick to your guns.  Just my opinion, but everything that you just said would happen seems to be a spot-on-target assessment based on the past irresponsible actions of your younger sibling.  They'll never leave and you'll have a lifetime of resentment to deal with (both yours AND that of your wife).  Look your mother in the eye and say \"Hey Mom.  You have three bedrooms at your house, don't you?  Wouldn't (insert little sister's name here) be better off LEARNING from you if she is living in the same place?\"  Volley the ball back in her court.  Watch her squirm and try to shift the blame.  It really does sound like your parents are tired of the unreasonable behavior of their daughter.  You'll be better off in the long run if Mom and Dad are saddled with this problem because one day THEY'LL have to speak their mind/truth to your sister and possibly set her straight on some issues that you as a sibling shouldn't have to address.  As there are two sides to every story, I'm only seeing/reading this from your side of the coin.  However, I can give my opinion that if you relent and give into the demands of someone else trying to invade your peace-of-mind, you'll only be setting yourself up for the disappointment of not only losing something that you've worked very hard for YOUR own family, but also the TIME you will have to invest in dealing with your sister and her 'husband' because you've essentially become her surrogate parent by providing house and home to her and the mooching brother-in-law.  You're being forced to take over responsibilities that your Mother and Father are trying to divorce themselves from as a couple who simply don't want or feel like dealing with the headache of your sister any longer.  You didn't make her that way, THEY did and now they're dissatisfied with the results of their irresponsibility?  Think about this: what is the value of your summer home? Now...would you give your sister that much in cash? If so, build her a home someplace FAR away and treat it as a gift.  If the answer is 'No Way!' then tell her no and don't think twice about it.",
            "Since you did ask for a way to be nice, one way to soften bad news is to offer an alternative. \n\n\"I can't offer to let you rent the beach house, but I'm happy to help you draw up a budget and look for a new place that is more affordable.\"\n\nThis isn't what they want, of course, but it's harder to paint you as the bad guy. And then every time any one brings it up, your go to is \"Would you like to sit down and go over your finances and see if I can help you draw up a budget and find a more affordable place?\"\n\n",
            "Manning up doesn't mean allowing people to use you.  Manning up means the exact  opposite.  You are not responsible for your sister and her deadbeat life.  You are not obligated to fund their life.  You are not obligated to pay for her.  She is not your responsibility. ",
            "\"I have that property listed as a vacation rental. We're depending on that money for my kids college fund. If you want to buy the house from me and let sister live in it, I'm all ears.\"",
            "Don't tell them no. Tell them FUCK NO. ",
            "Um... Yeah NO.  They made her they can let her live with them.  Period.  And you are right, they won't leave.",
            "Why do you even pick up the phone when your parents call when they treat you like a piece of shit?  Tell them to go fuck themselves.",
            "Not saying what you should or shouldn't do but you might consider that you're taking the financial wisdom that your upbringing gifted you for granted to the same degree that your sister has taken her financial handouts for granted. Neither of you is more wise than the other. This cycle can only be broken with gratitude from someone. Anyone. ",
            "Stick to your guns. Your sister and BIL are adults and need to learn to act like adults, and that involves taking some responsibility. They won't do that if everything is just handed to them. If your parents are that concerned about them, they'll offer them a room in their house.",
            "Don't give in, they'll never learn if you do.",
            "I think you should tell your mom that you never signed up to take care of your sister, and that you don't feel you should be penalized for making your own living, and earning your own things, by having them taken from you.\n\nTell her that having sis and husband living at your beach house will not do anything for them finding gainful employment, that it will be a vacation, instead, and you earned the right to go vacation there yourself.  Tell her that her granddaughter is the one who should be able to vacation at your beach house.\n\nTell her that if she wants them to have free housing, she can provide it herself.  You made your way.  If she doesn't want to force sis to make her own way, SHE can continue to support her.",
            "She's their kid, let THEM parent her. They're not willing to offer what they expect you to?",
            "Just say no, you sister is your mother's problem not you. Keep saying no because in the moment they put a foot in your place then it will be your problem",
            "All the comments i see are very harsh and direct and although they are not wrong, I think the way they go about it is. Like hide your keys? Fuck that, its your home. \n\nWhat I would do is talk to your parents, with your sister also present. Say something like:\n\n\"I know sis and husband are about to be evicted and I have a beach house but we use it very often. I spent a lot of money to get that beach house and I don't rent it because my family uses it. Its not vacant. Now if I let them live there, rent free, then I have no income from the beach house, and I dont have the beach house anymore. And if my kid wants to go to the beach during the holidays what do i do? Do i kick sister out or do i go stay there with her? It would be as if I just gave them a house for free.\" \n\n",
            "You are not being mean. You are being a good big brother by helping your sister learn the responsibilities of an adult. \n\nIf everyone continues to baby your sister, she will never have any motivation to fend for herself. She needs to get a decent job. She needs to tell her husband to get a decent job. Then they can pay for an apartment. She and her husband will never do those things if you give her free accomodations.",
            "Good on you for saying No. Finally, someone is shutting down the very destructive gravy train your parents began. The very BEST thing your sister can have happen to her right now is being thrown out and forced to fend for herself. She's been spoilt all her life and will not learn any other way. As for your parents, they're only upset because they're not seeing things through the best interests of their kids, they're seeing her as an extension of themselves. Your parents are narcissists.",
            "Not no way, not no how.",
            "If they couldn't find another place and are about to be straight up homeless I would let them rent your condo, agent involved, proper lease drawn up etc. but otherwise everything everyone else is saying. ",
            "They may think that, but I don't and I'm your financial advisor. Tell them you financial adviser said no. ",
            "I don't understand how people get into these situations and even post here.\n\nNO.\n\nThat is your answer.\nWhat's hard about that?",
            "OH hell no! Don't let them in your beach house or give them money. They have no incentive to do better if they are always being bailed out. Can't get a DJ job, be a waiter. Can't find a job in your degree field, work retail. Time to grow up. ",
            "I would sooner sell my beach house then let a couple bums live there rent-free purely because we share some chromosomes.\n\nYour parents enable your sister's shitty behavior. They made the monster, they have to deal with it. Wash your hands of the situation.",
            "Don't do it. I let my sister and her husband live with me for 3 months after they got evicted and it was a disaster. They just took advantage of my kindness and when I put my foot down they stopped talking to me. We don't have a relationship anymore (not that I mind because she's a selfish jerk) and the whole thing caused months of anxiety. ",
            "> >  He’s supposed to be a professional DJ.   That's \"rich\".\n\nI'm sorry your parents are asking you to pay for their mistakes likes it's nothing. We all know they'd destroy your beach house or anything else given to them. It's hard, but you must tell your parents No. Just like they should have told your sister many, many times, No. You have no obligation to here or her husband. If everyone continues to support them, when do they get their wake up call and realize: I'm not making money as a DJ maybe I better get a job and the same with your sister.",
            "Either flat our refuse or if you're asking for other options:\n\n- They stay at your parents for x amount of time. In that time they can either get short course qualification or licenses for jobs in demand (stuff like basic care system, catering, driver etc) Time determined in how long this takes and time to look for work. \n\n- If by the deadline they achieve this but jobs are still early days for them to afford to move. Lease them the beach house on a cheaper rate but have solid contract to evict if its not kept up to standards or they lose their jobs for whatever reason. \n\n- Other option if there's seasonal work at the beach house area. Parents pay for their travel to interviews. If they get the job they can rent from you for that season, part them and part parents. Then with the money left over. They move out to their own place or parents to find permanent jobs. \n\n- if they fail they go back to mom and dads. If they fail again there by a new deadline they have to look at government support and government housing.\n\nMaybe be honest with your parents that you know they're passing her onto you as they are tired of bailing her out. They need to admit this problem wont end unless she sorts herself out and learns. You might need to confront your sister together. \n\nI'm guessing though beach house might be in area where there are less jobs or jobs are more seasonal. So this could be worst options for your sister on getting on her own feet.",
            "\"Man Up\" doesn't mean to be a push-over to your sister and parents.\n\n\"Man Up\" would be to stick to your convictions. If your priority is the family you've made over the one you were born with then I whole heartily you \"Man Up\", and with the courage to face whatever consequence may follow apply your priorities to the situation. You'll never go wrong that way.",
            "Frame it like \"you are adults, yes it's possible for me to host you for a week, but you must get out by x, for your own sake, stand on your own feet\"",
            "No chance. You can't do this. If you want to rent it okay, but market value. Seriously. Don't fuck around.",
            "OMFG the shit parents do to there children.  Dude listen, your sister and her deadbeat husband will never advance or grow in life with everyone always taking care of them.  Its time for some fucking tough love.  You legit will have these jackasses in your place, destroying it, expecting you to fix problems that come along with daily use.  Are you willing to spend your money on a waterheater when it blows, or money on a broken window because they cant afford it after they break it accidentally.  its not just about helping them, theres alot that goes along with that.\n\nif, if you need to help them you offer them a bridge loan, the load should be written out, signed and notarized.  Time to end this.",
            "is your name Harper is she called allian? ",
            "No. Firm no.  They can live with her.",
            "If they're being evicted than they don't have enough respect for their home to pay rent and if they don't have enough respect for their own home than they won't have a lick of respect for your home. \n\n\nI recommend you redirect the issue. Tell your parents that your sister needs a positive environment and living by themselves won't do them any good. They need to your parents so they can motivate her and her husband to get back on their feet. \n\n\nRight now that beach house is a nice luxury but also a safety net for you and your family. It's a valuable asset to keep in shape and a bunch of squatters will only cost you money. Your sister and her husband aren't going anywhere fast so don't get involved.",
            "Now I'm terrified of raising a child like your sister.",
            "A different opinion here. If you do want a middle ground I would treat her like a regular tenant. Build up a lease that says she can stay there for 1-2 months for free and then start charging rent. That will show that you are being nice but also covering your basis. \nAnd it also makes it clear this is a temporary situation.  It's amazing what a legal document can do to the behavior of people. I would even charge a security deposit too. That would be a great way to make it professional and serious. Maybe they get their game tidied up in there. ",
            "Lie and tell them the house is already rented out. Yes, I like the cowardly, easy way out.",
            "Your wife is correct.  You let these people in, they will never leave.  Your mom is very nicely keeping her loser daughter out of her own home.  Take a lesson from your mom.  Tell mom, \"Mom, you have sis live in your big empty house for the first five years, and I'll *consider* putting her up for the next five.\"",
            "Tell your parents they haven't finished raising your sister into a functional adult and they should let her move in so they can finish the job. ",
            "No is a full sentence. ",
            "\"Sorry, it's already rented out to someone else.\"",
            "If you want to get your parents off your back, tell them you'll think about it, but you need to talk to your lawyer about it first.  Then never talk to your 'lawyer' or report that he said it was a bad idea because of liability or taxes or some bullshit like that. ",
            "Letting them stay there will turn into a nightmare and won't teach them anything about being responsible. I wouldn't do it. They will likely trash the place and you'd have to evict them. If they were upstanding citizens who ran into some bad luck it'd be different. ",
            "The next time they bring the subject up, cut in mid- sentence and clearly exclaim, \"Oh! The colors!\" as you stare into the sky. Then change the subject.\n\nThey want to play dumb about having space for their golden child, you can too for a good-for-nothing sibling.\n\nI'm sure your house will be trashed if you let them move in. They're over 30 for fucking sake.",
            "Two and a Half Men comes to mind.\n\nYou move me into a rent-free beach house and there ain't no way you're ever gettin me out of it on my own free will.",
            "Say no. It's not cruel. Enabling them to continue believing the world owes them a living would be cruel.",
            "Anyone that says 'man up' is usually not worth listening to about anything. Not your circus not your monkeys.",
            "You're 40 years old. Say no",
            "I'd put my foot down.  No way would they move into that beach house.  I wouldn't even let them move in if they agreed to pay rent, knowing that they have a history of NOT paying rent. ",
            "Tell your parents that if they think your sister and her husband are entitled to free housing for no good reason, then Lindsay and Tobias can move in with them.",
            "Tell them to pound sand. You earned that vacation home and they have no say in what you do with it. \n\nAs others have said, collect the keys, change the locks and enjoy your own beach house. \n\nAlso, talk to your wife and explain to her why you do not wish to do this and your reasoning. ",
            "Don't do it. \n\nYou're not obligated to help them. ",
            "You earned it, you have pretty much answered your own question in this thread. Show them this post and tell them they are not staying, and that the need to book their ideas up and sort their life out.",
            "If you decide to let your sister and her husband live in the beach house, then be sure to set up a lease agreement with something like $1 for monthly rent. Consult with a property lawyer. The lease agreement will protect you and give you a better chance for when you need to evict them. If you have the option, offer to have sister or her husband work off the rent in some manner. Also, put a time limit on the rental.",
            "I would sell the condo before I'd let them stay in it. I've seen this play out in real life. My husband's step-mother was in a similar situation and her relatives did tens of thousands of dollars in damages and even damaged her credit (she left the utilities in her name and they never paid). She's gone through years of stress over the situation and is still dealing with the fallout. ",
            "Man just buy her a caravan or a mini house to live in, something cheap so she has a roof over her head or just rent one for her. She will probably leave after a week so just rent one. You can find one a state away or something so you don't have to deal with her.",
            ">What’s “cruel and selfish” I think is the fact that mom and dad live in a three bedroom house and haven’t invited sister and her husband to live with them but are putting it on me.\n\nTell them that. Put them on the spot. Remind them that they're the parents, and they have the responsibility to care for their daughter. You didn't raise a deadbeat, so you shouldn't take care of a deadbeat.\n\nAnd have cameras installed outside your beach house property. Just in case of squatters.",
            "Please don't do this. If you let them live there, you are continuing to enable them. Also, if they can't be bothered to take care of themselves, I don't think they will be bothered to take care of your property, either. ",
            "\"The condo HOA doesn't allow that\"",
            "Lmao this is an easy scenario! They can fuck off",
            "It's time to be selfish. Whats gonna happen if you let them live in your beach house? It's gonna be a dump, you wont ever get rid of them and you will hate your sister even more than she is gonna hate you for saying no. Whats the upside there?",
            "I agree with your wife in that you should do what's right.  In this case what's right is allowing your sister to live with the consequences of her actions.\n\nDo not let them move in to your place.  Do not give them money.  They've had their bad habits enabled for long enough.",
            "> I say what’s mean is them not even spotting me five bucks for gas in college when they spent at least fifty thousand on my sister’s fashion AA at FIDM.\n\nNone of that matters. The fact of the matter is your sister and her husband are deadbeats, and they're not your responsibility.",
            "Interesting that \"manning up\" requires you saying yes, instead of saying yes = \"rolling over and giving in to our demands.\" \n\nI think, in this case, \"manning up\" = \"No, they can't stay at our beach house.\"",
            "Lots of responses, not sure you'll see this, but one way to avoid excess resentment is to center the relationship here. Say no and if necessary tell them that it's because you don't want to jeopardize your relationship with your sister and BIL by bringing a landlord/tenant dimension into the relationship. ",
            "I know this feels uncomfortable now, but imagine how bad it'll feel when they stop paying rent and you need to evict them. A little discomfort now will save you in the long run!",
            "It would be best to suss out the two distinct problems here:\n\n1) You're resentful of your parents for not helping you financially while spoiling your sister (understandable).\n2) You don't want to help your sister and her husband because you feel you'd be enabling their irresponsibility and that they'll never leave once they move in (also understandable). \n\nBut not necessarily the same issues. Your sister didn't cause your parents to stiff you while spoiling her, and doesn't need to be \"punished\" for that (she's certainly not entitled to the beach house, but your tone seems to be more about getting back at your parents through this, rather than really about your sister), but you do have a separate relationship with her, with separate issues. \n\nIf you can tease out a distinct relationship/issues with your sister, you might be able to find a solution in the middle somewhere. You don't need to give up your beach house, especially if you think nothing's going to change and they're just going to stay there rent-free indefinitely. But maybe if she's willing to work on her life, you might be amenable to helping her get there (within your own means, without causing any hardship to your own household?)\n\nThe good news for you is that money can have strings. You may not want to let your sister and husband keep ignoring reality, but you might be able to live with helping them out IF they make some kind of commitment to improve their own circumstances.\n\nThat means, potentially: letting them have the beach condo for a set period of time (in WRITING, with signatures), for a nominal amount of rent, IF your sister and husband take concrete steps of their own, such as going back to school, financial counseling, employment counseling, etc. \n\nOr it could potentially mean offering to pay for those aforementioned steps for them, sans beach house, with commitment on their part to follow through.\n\nNamely, rather than working through your parents here, talk to your sister and her husband. Are they willing to make changes? Are you willing to help them make changes? If they want to keep on what they're doing, but with you bankrolling them in the form of the beach condo or monetary help, feel free to tell them to screw off until they're willing to take responsibility for themselves.  \n\nOf course, you're entitled to tell them to screw off regardless, but food for thought if there are circumstances/ways you might be willing to help.",
            "along with all the great advice about how to stop them from moving in, i would suggest you contact the office at the beach to ensure that your parents and the sister/bil are no longer allowed to go there for free. \n\nI dont know what arrangement you have, but if you have them on the list of allowed people, even when you do say no (you should) they might try and move anyway.  \n\nif they require you to be able to go, this is a mute point, but wanted to mention in case it is relevant. ",
            "No just no.  Hell no.  ",
            "Sometimes, people need to hit rock bottom and get a fire lit under their asses to turn their life around.  Your parents have been enabling and spoiling your sister her entire life.  Now, they want you to take up the reins.  Respectfully decline, and if they continue to harass you about it, then cut down on your contact for the time being.\n\nYou don't even have to make this about the disparate treatment you realized from your parents (though I understand how that is a source of resentment).  Make this about not further enabling your sister's poor work ethic and money management -- and that of her husband.",
            "A rent free beach house is the best place to get back on your feet.",
            "Admit nothing, deny everything, make counter-accusations. \n\nYour sister is not your responsibility. We can't even claim she's your responsibility on account of being your sister as she and you haven't got good relations and so there is no history to build on and no willingness on her part to pull her own weight. Your parents are guilttripping you because they find it easier to manipulate you, a reasonable person, than get through to their other kid, an unreasonable person. The only way to deal with this is to become just as resistant to whatever they say as your sister is. Then watch what they do. What is their plan of action if they can't be bailed out by their only reasonable, accountable family member?\n\nI say your mom is mean, not you. She is cruel and selfish, not you. Your wife is telling you to do what's right - well there is only 1 right thing to do here: stop enabling your deadbeat sister and her deadbeat husband, stop enabling your two faced parents, and if nobody is doing consequences anymore, you be the one handing them out. Wanna do what's right? What's right is to protect your family - yourself, your wife, your daughter. What's wrong is to yield to bullies such as your parents and your sister at the expense of your own family. \n\nWhat do you want to teach your daughter? Want to teach her that it's necessary to roll over and take whatever shit is dished out by Auntie and Uncle because after all Daddy does so as well? Or do you want to teach her that it's always good and right, and necessary to stand up for justice, stand up for yourself, draw lines, and not take bull, threats or blackmail from anyone, even if they're your family (or maybe especially if they're your family).\n\nThere's no need to be cruel to them, rub anything in their faces, or laugh at their misfortune. Be calm, but be a rock. Your word is final. They aren't moving in. You aren't giving them money. If they're willing to do their work, then you're willing to help (with your time - never with money, re-sellable items, or free accommodation), but the second they start pushing back, you're done. \n\nYou can sympathize with their plight, but still not let them use you. You can be concerned for them, but still not let them use you. The only reason your mom is conflating empathy and letting someone use you is because it's an effective tactic to manipulate you. Surely your sister can apply for a job at a fast-food joint and so can her husband. Surely they can move in back with your parents while they get back on their feet if they're really so worried for her.\n\nThe reason why your parents aren't inviting them is the same reason why you shouldn't take them in. Your parents know they won't be able to ever get them out again. They know your sister and her husband are leeches. They're just trying to dupe you and create misdirection so that you don't realize it yourself.",
            "Letting them live in your beach house or giving them a sum of money would be a band-aid on a broken leg. To be helpful you could \n1. Offer to help them organize their finances/create a budget\n2. Offer to help them create a well organized resume so they can find jobs\n3. Offer to show them how to apply for financial aid if they are interested in college or trade school\n\nIf you don't give them the beach house, you're the bad guy now. \n\nIf you do give them the beach house, you're the bad guy later when you need to kick them out.",
            "Money or the beach house?  Send them a check for a dollar and say \"Fine, I sent them some money.\"",
            "Well, just say \"No\", and that's it, there is nothing cruel about saying \"no\" to unreasonable demands. They're adult, they can take care of themselves, and if they can't, well, you have your own problems to take care of. Letting them live in your beach house won't solve anything, they need to get their act together.",
            "I would set them up to fail, I would have them try to pay something, when they fail I would kick them out.  \n\nOr I would say no I'm not in the business of supporting princesses. \n\nReally for me the thing is that I help those who would help me, and my gut says the situation was reversed your sister would say no. ",
            " I think is the fact that mom and dad live in a three bedroom house and haven’t invited sister and her husband to live with them but are putting it on me.\n\nThey don't want them living their for the same reason you don't, but guess what they birthed her not you so they should either tell these people to get financially responsible or take them in themselves.",
            "NO!\nNO NONONONONONO!!!!\nNO ABSO-FUCKING-LUTELY NOT!\nNO! HELL NO! NEVER! UH-UH! \n\nthat should be your response...and nothing more",
            "Give them a copy of the help wanted ads",
            "Lots of great replies already, but I wanted to add one thing. You ask what you can do to help your sister? The best thing you can do is refuse to help. Let her suffer some consequences. She's already 32 and doesn't have her act together. Let her hit rock bottom so she can learn to climb back up on her own. It sounds cruel, but unless she faces consequences for her own actions, others will continue paying the price for her. Don't waste your time, effort, or money. She has to figure this out for herself.",
            "Your parents are enablers sir. I have a BIL who was bailed out over and over by his mom. A year prior to her death, she entrusted me with a ledger of all of his loans. At the first meeting subsequent to her death, I pulled out the ledger and told him that his piece of the estate would entail him giving us back well in excess of $100K. He bawled like a baby, especially when I told him that mom gave us orders NOT to let him get away with it.",
            "People need to stop enabling them period. They're in this mess because they've always had a safety net from your parents. Now that your parents are pulling out they want to saddle you with it. \n  \nManning up would be putting your foot down and saying they're both full grown adults who are fully capable of employment. Your sister isn't mentally disabled or handicapped and neither is her boyfriend(arguably). \n  \nIt's not that they've fallen on hard times, they've never been given a reason to grow up. Why the fuck would you reward them with a fucking beach house? ",
            "Let your parents know you feel their tough-love stance with you was the right way to go. Since you obviously learned the value of a dollar.  And seeing as that the value of a two bedroom beach house for 6 months exceeds the going rate what do they expect you to do?\nYour beach house is your property. If you want to rent it you would get money, but you choose to instead invest that value in time for your family together at the beach. You are under no requirement to give that money to your sister or your parents. Your parents are floundering because they are caught in a place where they will either have to let sister live with them or give them money for a place. By putting you in this position, they are trying to exculpate themselves. \nYou might want to suggest that sister try offering services as a house-sitter. If you wanted to, you could offer to pay for a storage space for some amount of time.\n",
            "Saying no is completely fine and for the best. It is not in her best interest to be bailed out again, it only enables her further. ",
            "Dude be mean af otherwise they won't respect you and they won't ever leave the beach house. Tell them all to fuck off. ",
            "Tell them you have decided to put it on the market.  Then don't.",
            "Rent the beach house out to a decent family to shut down the possibility of letting your sister stay there, tell your sister and mother the beach house is already rented and she can't move there. Tell your sister and your mother that the only monetary help you are willing to give is to pay at this point is directly to a reputable moving company the cost of shifting her back with your parents. Tell your sister (and just your sister) that once she's back home with her parents you are willing to give her a one-off payment of (whatever figure you know is enough she'll find tempting)  to help  her and her husband start seeking work. \n\nThen walk the fuck away and let your sister get to work on convincing your mother to let her move back home.\n",
            "I don't have any brothers or sisters, but I would go with a compromise. Offer to cover their deposit for a new apartment as a one time thing while they get their shit together.  That should keep family tensions to a minimum while still preserving your vacation spot.  ",
            "Honestly, just tell your parents no. You're not responsible for your sister and your parents shouldn't be either.\n\nYou're not cruel for not giving them an excuse to freeload. And you could turn it around and say to your parents, \"If I'm cruel, then what are you? You have the space for them, AND you're trying to guilt me into doing it instead.\"\n\nI hope that neither your parents or your sister has a key to your beach house.\n\nAs for your wife, you need to make sure she's supporting your decision and not being wishy-washy about it. Be a united front or else your parents will use her to guilt you as well. And remind her that it's not your responsibility to take care of two full-grown adults.",
            ">Plus I think that once my sister and her worthless husband get in, they will never leave.\n\nOf course. So unless both you and your wife want to give your sister and her husband a free place to live for the next 50 or so years, don't let them move in. Don't even let them spend the night or set foot in that house, period. Don't explain, don't argue, don't justify or anythig to your sister or your folks. The answer is simply No. NO. Period.",
            "Just chiming in to say \"Nope nope nope nope N O P E.\" \n\nOP, do not let them take advantage of you! ",
            "Tell your sister and BIL directly that it's not going to work. Just straight up \"yeah so mom talked to me about you guys staying at my other property, that's not going to work so please don't assume you have that option\". \n\nKeep it simple, don't give a bunch of reasons why, as the only reason you need is that it's your property and your decision. As soon as you bring up the \"you're irresponsible, spoiled, entitled, husband is a deadbeat, etc\" it will just create more drama and now likes like this is some personal attack on your family. \"I just don't want to let you take up residence at my property, regardless of the situation\" whenever they ask why and give you the guilt trip. No long winded arguments, like most things in life just keep it simple and don't leave it open for drama. \n\nI stress again, go directly to your sister and BIL. Not to defend them, but often times in situations like this your mother will not convey back to your sister/bil exactly what you've said. I've been in situations where relatives or co-workers are trying to get me to do a favor for a friend or someone else, you tell the person no and they just keep coming back. Probably because the middle man (your mom in this case) didn't have the hear to tell the other person no, and probably already built it up to them as a sure thing. So instead of your sister hearing the hard \"no\" she needs so they can get their shit together, they probably keep getting promises from your mom that she will convince you. Every time I've been in a situation (usually been something like getting someone a job or interview, or lending/investing/donating money in something) as soon as ive gone directly to the person needing something it's pretty much ended the situation right there. Sure everyone's not going to be happy, and you will probably get a mean call from you mom, but again just say \"sorry mom, I've already told Sister/BIL directly, it's settled and I don't want to talk about it anymore\".  \n",
            "First of all, trust your instincts: the answer is no.  No rent-free living, because then at some point you'll have to be the apartment owner kicking out the deadbeats.\n\nIf you don't care to ever hear from any of them again, just tell them no and to figure it out.  If you want to try to do the generous thing without acquiring an albatross, I would stick to offers like, \"Look, I can't put you up in my place, but let's meet up for lunch and go over apartment listings and I'll help with the sec. deposit/1st month's rent/whatever.\"  Do whatever you think is appropriate, but make it a one-time, in-kind contribution.\n\nI have this family member in my family as well, and you just don't get anywhere giving away total freebies.  I've offered to help find an apartment, help apply for jobs, come over for dinner to get a free meal, etc.  I just don't think crashing at my place indefinitely is a solution, and I don't want to get to the point where I'm evicting family from my own property.\n\nFrankly, if you think they are total fuck ups, I don't think you're really helping them if you extend the period of time prior to them hitting rock bottom, but I can also understand that even if you think they suck, they are family and you have a nagging desire to do \"what's right\".  I'd give them some amount of help to clear your conscience and give them an opportunity to grab the life vest.  Just don't get suckered into a permanent financial papoose: offer one-time help that is meaningful but not creating further dependency.",
            "If you want, you could let them move in for a very limited amount of time. Like get a contract drawn up with specific conditions and a clear time limit, and once that's over they gotta leave, whether or not they're \"on their feet.\" They also agree to pay any and all damages upon leaving. \n\nBut I agree you shouldn't enable them. They're adults and need to be treated as such. Dysfunctional families are so hard to break from because there's this constant \"I need to save them\" mentality. ",
            "Do you want to eventually evict your own sister from your condo? If not then don't let her move in.",
            "There are ways that you can help your family, and help yourself at the same time.\n\nPay for your sister and her husband to have three sessions with a financial planner that charges by the hour. (This will be about $300). \n\nYou could also hook them up with a career counsellor, again, who charges by the hour. One session should do it.\n\nYou'll be out about $500, but if your sister and her husband are serious about improving their lives, these two services will help a lot. It'll also help them stop being so dependent on your parents. ",
            "No is a full sentence. Failing that, as it sounds like your parents will need more than that, work out how much it will cost you exactly to have your sister stay in the beach house and, when your parents ask you again, lay this out in front of them. \n\nThen tell them, in no uncertain terms, that if they decided as parents that subsidizing their daughter to the point of helplessness was their responsibility, that's fine. But you're not her parent, you're her brother and you have no such responsibility. \n\nWhat you DO have is a responsibility to the future of your own daughter and you don't see why income that you make and resources that you've built up (on your own) should be used for her fully-grown aunt rather than her. \n\nThat is your decision made as a parent and an adult regarding your daughter and your sister. Your parents will have to make their own decisions regarding their daughter and your sister but you're not interest in having their responsibility moved over onto you. You have plenty of your own and you'll not discuss it any further. \n",
            "> I don’t want them to live in my beach house, and told my mother as much.\n\nYou set a boundary, but it was ignored. You must have your reasons, and so must your mother. Are either of them good reasons? Personally, I don't think Reddit can definitively answer that for you. Ultimately, it's your property, hence your decision to make. Whatever you decide, the outcome will be on you - for better, or worse, and everything in between.\n\nI doubt you'd ever get any thanks or acknowledgment of culpability if things went absolutely pear-shaped if you did agree to allow your sis to reside there rent-free, but perhaps the same would apply even if you didn't - instead you'd just end up being known as the tight-ass who let his own kid sister crash and burn. Both ways, you'd feel like a chump who should've expected what he got. \n\nThe other possibility is that things don't go pear-shaped, and instead go swimmingly. Everyone is grateful and restituitional. Your struggle and achievements on the path to attaining your current state of success are appreciated and validated. You feel content and fulfilled. If you don't take the chance, you may never know. But, is it worth the risk?\n\nI dunno.\n\nDon't let your resentment for your parents' seemingly inequitable treatment of you and your sister cloud your more humanitarian judgment. Don't let your innate guilt to appease your own parents' wishes cloud your more pragmatic judgment, either. \n\nYour sister is a product of your parents' upbringing, but so are you. Make of that what you will.",
            "\"No - you've bailed and paid the way for Sister. She needs to learn how to manage. I'm not giving up my apartment and throwing money at her will not solve the issue. I've been fully independent since I was 18 because I had to be.  You've given her everything and I'm not going to take over since she has failed at being an adult.\"   \n  \nYour sister will never leave, and if she's been a dink about everything up to now I wouldn't even count that she would care for your property well.  If you could swing it, you could offer first and last months rent as a loan, but you don't have to. They are adults, I'm sure they will figure it out.",
            "Tell them you are her parents invite them to sleep in one of your three bedrooms. ",
            "If you want an excuse, tell them you started airbnb-ing it and it was so popular it booked for most of every month for the next 5-6 months! and people are still booking it.\n\n\nOr you can just tell them \"don't rely on me for a place to live, you need to be finding that yourself\"\n\nAnd as for your parents- I would absolutely tell them that they've always given her money and bailed her out, if they can't do that anymore, then they can't offer you and your property up because it's not theirs.",
            "You are right here. Your parents need to stop enabling them, and ESPECIALLY need to stop expecting you to pick up your sister's slack. She needs to get her act together and start acting like an adult, and that will never happen if people keep rescuing her. You and your family deserve what YOU have earned. She has no right to it, and has been given more opportunity than most, yet she's squandered it. I would encourage you to stick to your guns, and not feel guilty. She is not your child, not your responsibility. And I know family should help family, but this is not a bad stroke of luck she's stumbled upon. It's not a series of unfortunate events that have unjustly put her in this position. Usually the only way for people like this to change is tough love. I'd suggest talking with your parents about this as well, as they will need to be onboard with this approach also. Things like only helping her if they both go out and get jobs, any money lent is to be paid back, if they stay with your parents they need to contribute financially and they can only stay for no longer than two months etc. They need to start helping themselves.",
            "Have mom and dad move into beach house and have them offer sister the house.  Ha!",
            "When I saw the title, I was about to say you are cruel and heartless for not helping your own sister out, but yea you SHOULDN'T. They are not just going through a hard time temporarily. I don't think they would want to move out if you give them an apt for free. They NEED to go through this hard time by themself so they can learn and move forward",
            "Let them live there. But they have to pay rent at fair market value. Treat them like tenants. Charge them for damages. Don't do them any favors.\n\nObviously, let them know before they move in. Get a fancy legal rental agreement. Once they see all that shit, hopefully they'll change their minds.",
            "Tell them no. That's all. \"No.\" And you are done!\n\nYou are right. They will never leave. They will trash your house, run up the bills, and you will wind up evicting them which will make your parents mad at you as well.\n\nShe is 30 and not paying her bills. That is her fault not yours. As a big brother you can offer finical guidance, help them with their resumes, and other such pieces of advice. ",
            "Don't really have any advice other than DON'T FUCKING ALLOW YOUR BUM OF A SISTER AND HER HUSBAND TO USE YOUR BEACHOUSE! And fuck your parents and their enabling bullshit after letting you fend for yourself. ",
            "So what's going to happen here, if you let them move in, is you're going to be trying to find a way to kick them out in 6 months or a year or more, and you won't be able to. Or if you are, you're the cruel bastard who kicked them out on the street. Better that you don't let them in in the first place, and don't mix business with family.",
            "Re-iterating the point, if you let them into your beach house, free or paid for, you will end up kicking them out.\n\nSeriously dude, the points you have laid down here in your post are perfectly justifiable grounds to tell them and your parents No, because of previously said points.\n\nI wouldn't take any noticee of the name calling, dont rise to it.",
            "You say NO. \n\nYour parents are enablers and have destroyed your sisters life by allowing her to be. Don't play this game",
            "Caring for your sister is not your responsibilty. She is your sister, not your daughter. She is a grown woman to boot. Shes had PLENTY of time to get her life sorted out. Tell them all no. Because, you're right, your sister will never let go of a situation where she can live rent-free. She will take advantage of you until you FORCE her to stop, the doing of which will tear things apart anyway. Better to put your foot down now when you havent lost anything. \n\nI would suggest saying, \"I have seen what Sister does with your money and property already. The money and property I earn is the support myself and my family, not Sister. She cannot stay at my beach house and I will not give her money.\" \n\nI mean, your sister hasnt even gathered the courage to ask you for help herself. ",
            "Nope. Noooooooope. Nooooooooooopw.\n\nSister and BIL are grown ass, capable adults. They can go get jobs at Target  or wherever and rent a room in a house somewhere until they can get on their feet.  If you feel like being generous maybe get her a gift card to a grocery store, you know to help out here and there. Do NOT let them move into your beach house. You'll be enabling them to keep being lazy and you'll never get them out. Your parents helped make your sister an incapable adult, she's their problem not yours, don't let them make her your problem. ",
            "My uncle was like this. They never learn if you keep holding their hand. You won't be able to get them out once they are in. Maintenance will get neglected, etc. They are not your problem",
            "Your wife is s saint for not putting her foot down on this shit. Ask your parents why they don't live with them.",
            ">man up and be a big brother \n\nMaybe they should man up and be good parents. Or maybe your sister should man up and get her fucking life together. Or maybe her husband should man up and take care of his wife. This is literally everyone elses problem but yours. Your parents don't seem to want to blame anyone for their collosal failure. Tell it to them straight, they did a terrible job raising her and that's not your burden to bear.",
            "No, NO NO No, Nien, Niet, Nadie, Nada, Non\n\nYou will never see your beach hosue again, you will never be able to get the out - youd be giving them a nice ass  house\n\nYour parents already crossed the line and are to blame, they are gaslighting",
            "Frankly I wouldn't bother having a relationship with any of those people. ",
            "Don't do it!  They will never pay you anything; they will trash the place; and eviction is a legal nightmare.  \n\nYou've worked hard for what you have.  You've made good choices, and you have a nice life to show for it.  Don't let anyone guilt you into this.",
            "Did you tell your parents everything you told us?",
            "That's a whole lotta nope.\n\nI just had to 'evict' an adult family member in similar circumstances, and my only regret was allowing it to happen in the first place.\n\nSend them a list of rental properties, wish them well, but tell them you have your own family to support now, and you're not taking things away from them to fund their lifestyle.",
            ">What’s “cruel and selfish” I think is the fact that mom and dad live in a three bedroom house and haven’t invited sister and her husband to live with them but are putting it on me.\n\nThis right here. I would honestly put it back on them and ask them why they aren't taking sister and her husband in if they are so concern. After all she is their daughter not yours. \n\nNot sure how your insurance on the condo works but there would be all kind of liability that you are taking on by letting someone who is NOT you living at your condo.",
            "I don't think there is a way to do this without becoming \"cruel\" in their eyes. Kinda just gotta rip that bandaid off ",
            "\"No.\" It is a complete sentence! ",
            "You have already made up your mind so I am not sure why you're here asking for advice. Do you just want validation? Ok, NP: \n\n\nGood work on OP on being a successful individual despite \"no help from parents\" who I guess didn't raise you or instill any values in you. And, oh gosh, your sister does indeed sound like a horrible person and yes, you are much better than she is. \n\n\nIf you want to help them out financially offer a month's rent, career advice, etc. You are under no obligation to do anything, obviously.",
            "Tell them you're already renting the house out . ",
            "Your parents are calling you names for taking on a liability they seem to be tired of taking on themselves.\n\nSay no.\n\n",
            ">He's supposed to be a professional DJ\n\nI literally raged when I saw that. He may as well said he wanted to be Pele or an actor",
            "Perhaps you could be conveniently planning to sell the beach house, so it's not a good time to bring in tenants?",
            "> I say what’s mean is them not even spotting me five bucks for gas in college when they spent at least fifty thousand on my sister’s fashion AA at FIDM.\n\nFUCK that shit, you don't owe them.",
            "My favorite thing about being an adult is telling my family to fuck off when they make unreasonable demands of me. I don't owe them what they think I owe them. \n\nIt's not your job to take care of your adult siblings. If they've entered hardship- they need to work to fix it, like other adults do. You can lend a hand, but are by no means obligated to. ",
            "Seeing this same question every couple of days on this sub is so *depressing*. \n\nDude. Friend. Repeat after me, okay? Please? *\"I did not ask to be born and I do not owe my family anything for the privilege of existing.\"* You do not owe your greedy irresponsible family a single god-damned cent just because they happen to share genes with you. Please please *please* do not cave on this. ",
            "It completely boils down to this: your sister and brother-in-law will never grow up if people keep bailing them out. It is better for them in the long run if you do NOT enable them. Make them figure it out on their own for once in their life. \n\nAs for your parents, tell them exactly that. Explain to them why you are refusing. Yes, \"No\" is a complete sentence, but it also comes across cold and heartless. Deep down, your parents know they are partially responsible for your sister's failures, but they don't want to feel guilty about it. They, like the rest of us, have to deal with the consequences of their actions. \n\nBest of luck.",
            "Smartest thing you can do is not let them live at the beach house. If you want to, you could give them some cash, but then I wouldn't give anymore and let them find a way.\n\nSometimes folks need to live their truths.",
            "Reality can be cruel....gotta just lay it on em.  They will manage when they stop depending on crutches.",
            "The hardest part in all of this is going to be your family blaming you for something you didn't even do.  They will keep guilting you and making you feel terrible.  You need to constantly reinforce the truth in your mind and in your wife's mind.\n\n* You are saying no because you love them\n* You are saying no because you care about them\n* You are saying no because you want them to grow up\n* You are saying no because you do not want to enable them\n* You are saying no because they are not entitled to your stuff\n\nGood luck keeping strong!  It is sometimes a painful and lonely road but it is the right road!",
            "Tell them that you need to focus on what's best for your daughter and wife and that as much as you love your sister, it is not your responsibility to take care of her. \n\nIf they get super ugly, you can always say that it is their responsibility because they brought her into this world. < I wouldn't actually say this.\n\n\nIf you do feel like you want to help them at all, I would loan them a small amount of money that you are okay with losing. It'll be easier to give them money than to evict them later, but only do this if you really want to and knowing the risk of not getting your money back.",
            "You could use this as an opportunity to help your sister get back on her feet and on a path to prosperity. Although I don't agree with allowing them to live in your beach house. I also don't agree with you allowing your sister and BIL live like deadbeats without pushing them ina positive direction. It sounds like you resent her for being spoiled all her life. I believe the course of action includes your parents bailing them out while you mentor your BIL so he can properly take Care of your sister. Furthermore you should probably speak to your parents about your issues with them concerning the way you were raised ",
            "Give them more handouts isn't \"what's right\". Ignore your parents and stick to your guns and say no. These are adults it's time for them to act like it. They are going to destroy your beach house and if you go the money route they will be back for more. ",
            "No. If they move in, they will never move out. ",
            "They're 32 and 30 NOT 22 and 20.  The 'man up and be a big brother' attitude is BS.  They are adults and need to act like it, not expect their family to carry them.  Definitely don't let them stay there - something tells me a free beach house = NOT moving out less a nasty eviction ensues. ",
            "If you want to support your sister, an alternative approach would be to draw up a legally binding contract that allows them to be supported by your generosity for a very limited amount of time.  \n\nThey get two free months(or whatever you agree to) to stay as a guest at your condo and then they are required to vacate.  They cannot get mail or package delivery at your place, you cover all the utils, etc.  They waive any claim of residence while staying at your place.  They are registered guests.  They sign the agreement, witnessed by a notary or other legal official.",
            "DO NOT LET THEM LIVE THERE!  They'll just mooch off you forever.  Offer your sister and her husband financial advice or help with their resumes or something, but do not let them stay in the beach house, not even for one night.  If you parents are so worried about them, they can let them stay in their house!",
            "Do not let them move into your beach house.  They will never leave or they will trash it or both.  Your responsibility is to your wife and yourself.\n\nYour sister and her husband are their own responsibility.  If your parents are so fixated on making sure they are infantalized, then mom and dad can have them move in with them.",
            "In my opinion, as the baby of the family and former deadbeat, she will never grow up until forced to.\n\nMy parents were constantly giving me money and helping my husband and I out. Now to be honest I had a college degree but chose to stay home with my kids and just have my husband work. I also had a multitude of health issues, so not just being lazy.\n\nAnyway, my husband and I always knew we could fall back on my parents. They would supplement our income, help with kids, etc. Then my parents financial situation changed and they couldn't. At first it was a huge struggle. Then my husband and I learned we were perfectly capable of taking care our ourselves and let me tell you...what a blessing. To believe I ourselves, to know that no matter what, if we work hard we will be fine. This also made us become better parents. We became an example to our children. If things kept going the way they were I would have had three kids who thought that depending on their parents at 30 was normal. Which it most definitely is not.\n\nYou need to have a brutally honest conversation with your parents. They are enabling your sister. If you let them live there free, you are enabling your sister being lazy. That's all it is...why work when you don't have to?\n\nShe might be mad now, but if she's forced to grow up and develops self confidence, she will come to you and thank you. You and your wife worked hard to be able to enjoy having a beach house. You shouldn't have to sacrifice that because your sister is being a child. Period. ",
            "If it's something you WANT to do you could lay guidelines. You could tell your sister you want to help her out and they can stay for a month while they get on their feet but after that they have to move out. If it's something you don't want to do, stick with your gut. Your parents and sister will get over it. ",
            "You'll never be able to get them out of there.  I can understand that on a very basic level this can look selfish (You have two homes, your sister has none, let her use one!), but in reality it could turn into a huge fucking headache.  \n\nAlso, outside of this issue, I wouldn't lean on the \"made it on my own\" thing too much IRL.  It almost always makes someone think you're a huge dickhead and does you no favors.  Especially when you didn't do it on your own - you had parents that cared for you for 18 years and grew up in fucking America.",
            "Say NO. \n\nShe needs to learn the hard way.",
            "Tell your parents to go fuck themselves. None of this is your concern.",
            "Don't do it. It will not end well. You will have to evict them and repair the damage to the property afterwards. After all of that goes down, would you rather be in that place regarding all of the relationships, or would you rather be in the place where you tell them that you will not enable her?",
            "dont do it!! If you do decide to help, give them money but never let them stay in your house. Once someone moves in somewhere it can be incredibly hard to kick them out. Look up squatters rights and tenant laws in your state\n",
            "\"Man up\" huh, that's pretty rich.",
            "No one who tells someone else to “man up” has their best interests in mind. ",
            "They got evicted for a reason",
            ">I don’t want them to live in my beach house\n\nThen don't. \"No.\" is a complete sentence. \"No. This issue is closed. If you bring it up again I will hang up the phone.\"",
            "Just my own experience with family, my parents called me heartless, cruel and mean because I excommunicated my brother but I never regretted it. Don't let these opinions hurt you, there are better things to enjoy in life. You have a wife and a daughter you can go home to. ",
            "Why can't your sister and husband \"man up\"? They're adults right?",
            "So my dad has a huge heart for others. Especially the poor because he (like you) is a self-starting man without help from his parents. He owns his own business and is very successful because of his hard work. He bought a log cabin with 15 acres in north Florida to have a place to go for vacations. He recently decided to build his own home along the beach, so he decided to make a little extra money on the side by renting out the vacation house to these people from the town. This couple (45M? 45F?) comes along and they tell him the husband just got a job in the town and are starting over their new life, but don't have enough for the security deposit, but can pay monthly. Well, they paid for the first 9 months, they would call us and tell us how great everything was, how the neighbors were good people, they would send us a check and it would always go through. Until one day, the checks start coming. We tried calling, no answer. We called the neighbors and they said they haven't heard or seen them, nor have they ever met them. So we take a small weekend trip there. When we got there, the door was swinging open in the wind. They left us a note that told us they lost their jobs because of drug use and they couldn't pay the rent, or for the damages. This is what they did: \n1) Flooded the house because they tried to do their own plumbing.\n2) Filled the washer and drier with used motor oil from the tractor, cars, etc.\n3) Ruined the flooring with cigarette burns from letting their smokes out (this was a non-smoking home)\n4) Stole every piece of kitchen utensil, pot, pan, microwave, everything\n5) Stickers placed on the walls, mirrors and windows\n6) The front lock had been kicked in and damage was around the door was extensive, all of the windows were open...\n7) They didn't mow the lawn or keep watch over the 15 acres as they said they would, we were billed from the city for that.\n8) Black mold damage from spilling a liquid substance in the attic, it sunk through and damaged the ceiling in the living room. \n9) Set up a \"burn pile\" of their trash (Not legal in the area they were renting in)\n10) They used fake names, their phones are now disconnected, and their lovely note ended with a bold \"Fuck you white man!\" (I suppose they were referring to my father)\nNeedless to say, a majority of the poor are poor for the same reason you are the wealthy man you are, because you chose it to be that way, just as they chose to bake bad decisions in life.\nDo not rent out to those losers. Don't think you are doing a 'good deed' by helping them. You need to do what is best for you and your family. Giving them your beach house is not an option. Please tell me you haven't done this because the post is about a month old.\n",
            "If for some reason you give in then at least demand rent and have an appropriate contract drawn up.  I rent a home to my sister but she pays full rent and we have a legal agreement as per state law.  ",
            "Tell them that you were planning on using it as an Airbnb residence for the extra income, and if they'd like to take advantage of that, (at *perhaps* a discounted \"family rate\", they'd be welcome to it.)  \nJust an idea, and of course, they'd have to responsible and sign every contract that and actual Airbnb occupant would be required to.   \nSee how interested they are in *that* (which is more than fair, actually.)  \nBut the fact that they just want to use it for *free* is completely asinine. ",
            "Maybe you compromise a bit and let them live there for a month while they get back on their feet.\n\nHopefully, you light a fire. If they dont leave though, you will have to really stand firm on kicking them out.",
            "Man some of you are heartless. If you ever struggled though some shit you might have a heart.",
            "How amazing the support for OP. In a similar post, https://np.reddit.com/r/relationships/comments/5124fo/my_wife_27f_and_family_think_i_29m_am_a_jerk/ , another OP was a jerk for refusing to let his sister live with him after she lost her home.\n\nAnyway, I agree with you OP.\n\n",
            "Compromise? Let them stay for 2, or even just 1 month, to get their shit together. Put it in writing. That way your parents can't be mad at you for doing nothing and you get the pleasure of kicking them out if they remain shitty people. ",
            "Life sucks sometimes. Just do it and be thankful that you have them. ",
            "Personally, I'd give my sister enough money for six months rent in a tiny apartment, provided I could easily afford that. Of course they probably still won't have their shit together, but then you can say to your mother that you've helped, you've given them a fair shot, and now it's up to them. It's not your responsibility and it's certainly not what's fair or deserved, but then charity rarely is. Giving someone a second chance is charity, anything else is enabling. ",
            "A.  I don't think letting them live rent free is a good idea.  It essentially sets the standard that they have a lease for no payment on the place.  I am not a lawyer, but this just sounds like it establishes bad precedents.\n\n B.  It think you can help them but make sure it's clear that it's temporary. You have a tenant moving into the beach house in 3 months.  They have to be out of there.  In the mean time they can get on their feet, BUT.. in contribution they need to help get the house ready.  some thing like that.  Nothing is for free.",
            "I taught this in middle school as an engineering teacher on how to be a basic human being.\n\nPassive - you get run over\nAggressive - you run over other people\nAssertive - you know your responsibilities and expect others to keep their responsibilities...\n\nIdeal is third.\n\nIf you want to reach out to your family... I would recommend two types of actions.\n\n1. Recommend that your mother and father take in, so that there is an accountability for your sister and her husband to get a job.  If they take your beach house they will be unsupervised.\n\n2. If you do decide to let them use your beach house, you establish the fact that they have to get on their feet and you do so by having an invasive approach.  What I mean to say is, they submit you a schedule every week of all their activities for that week.  They find jobs. You hire someone to check on them or have a way to check on them(they submit a picture on Instagram, you call that location, etc.). On this schedule only allow for one day to be a relaxing day, the other days have to be intentional and implicit to getting them on their feet.  (IF YOU DO THIS, YOU HAVE TO CAST THE VISION OF WHERE YOU WANT THEM TO BE, AND THEY HAVE TO BE COMMITTED TO DO IT.). Yes, they will feel like you are telling them what to do, but BEACH HOUSES AREN'T CHEAP.\n",
            "Be the bigger man and say yes.",
            "These situations are only as complicated as people let them become. Do you love your sister and would you do anything in reason to assist her? The answer is clearly no, so inform her that she is not allowed to live there or any basis. \n\nYou pride yourself on being 40 and having your own affairs in order and having a NIMBY approach to the matter, let me ask you, if you didn't have all those components in order would you then help your sister?  You clearly wouldn't so why are you using that as a justification for narcissistic behaviour? \n",
            "Offer them a deal.  \n\nIf your parents are offering you now their house, you would allow your sister to yours now.  \n\nNot promise on the will, or things like that, they transfer now the ownership of their house to you.  \n\nIf they refuse this deal, simply shrug and say it's not your fault. ",
            "An architect with a vacation home? You're not Rafael Vinoly or something are you?"
        ]
    }
]