[
    {
        "post_id": "5gpjb5",
        "author": "wtfinstagram",
        "title": "[UPDATE] I [23 M] found my girlfriend's [23F] fake instagram account where she follows my exes, past flings, hookups, etc.",
        "url": "https://www.reddit.com/r/relationships/comments/5gpjb5/update_i_23_m_found_my_girlfriends_23f_fake/",
        "score": 2400,
        "num_comments": 79,
        "created_utc": 1480982639.0,
        "selftext": "Original post [here](https://www.reddit.com/r/relationships/comments/5g5f6u/i_23_m_found_my_girlfriends_23f_fake_instagram/)\n\n\nSo I decided to try to talk to my girlfriend casually about the account. \n\n\nI told her that when she was letting me use her phone (I logged her out of Instagram and was going to log into mine so that I could post a photo directly from her phone, and saw the other account as an option) I noticed the other account.\n\n\nShe looked horrified at first, but then without any prompting at all she confessed that she had a super insecure day after exactly the incident I was discussing with other commenters [here](https://www.reddit.com/r/relationships/comments/5g5f6u/i_23_m_found_my_girlfriends_23f_fake_instagram/dapmmqk/?st=iw8j5cz5&sh=51581fcc)  (so thank you very much for making me introspect, reddit). She ranted to her best friend about how she was feeling, and the two of them made the account. They crept the accounts that accepted the follow requests, her friend helped her boost her ego a bit with some girl talk, and she completely forgot about it. \n\n\nShe said she was having a really hard time when I was depressed, but felt like she couldn’t complain about it because my pain was “worse,” so she just sort of let a whole bunch get to her over time. \n\n\nShe told me that she felt her poor handling of certain things this summer (her words), and the massive insecurity she felt, was an indicator that she probably needed to talk to someone and work through some things, and she’s actually been seeing a therapist every other week or so for the past few months. This wasn't just due to the summer, as she felt she's needed to do this for a while, it was just sort of what motivated her.\n\nThis shocked me, and she apologized for not telling me. She says that she felt like she couldn’t complain to me about her mental health when she knew I was going through so much. And then when I started to get better she didn’t know how to randomly bring it up since some time had past. \n\nI had no idea how hard my depression was on her. I feel so selfish that I didn’t even notice, but she says she completely understands, and she know how preoccupying depression can be. \n\nAll in all, she apologized profusely for the account, deleted it in front of me, and we promised to try to get back to being the good communicators we were before my depression hit. \n\nTL;DR - Talked to her. She was embarrassed, had forgotten about the account, and revealed why she made the account without any prompting. She took trying to support me during my depression harder than I realized, and we're going to try to be better communicators. ",
        "permalink": "/r/relationships/comments/5gpjb5/update_i_23_m_found_my_girlfriends_23f_fake/",
        "comments": [
            "I think your gf has actually been quite mature and handled herself well here... realising her insecurity and then going to see a therapist for help is a really refreshing thing to hear especially on this sub. I think you can apologise for that night and not responding to her because I think she is right to be a bit upset about that since you did respond to these other girls. \n\nAnyway sounds like it's being handled well by both of you so keep it up and maybe be a bit more sensitive to her insecurity since it was sparked off for genuine reasons. I think any of us would feel the same if our partner was texting exes but not replying to us.",
            "OP, I'm glad to hear that you worked things out with each other. I hope you enjoy many joyful decades together. I would warn of the tendency to relapse and that you should both keep each other on a \"feelings watch\" i.e., if either of you feels insecure, to have the courage to speak up to each other FIRST. ",
            "Depression is one hell of a blinding mental illness. It's hard to see how your depression effects others around you. I'm glad you guys talked it out. ",
            "I think the self-awareness you've both shown in the last post and this one is a really great sign, OP. Best of luck to you both getting the help you need and keep on communicating like champs.",
            "I feel like you should have been more apologetic towards her in all of this as she seems to be completely blaming only herself",
            "It's nice to see reasonable communication between two seemingly functioning people. Hopefully your girlfriend doesn't have any more self-image issues and you continue to feel good about yourself as well",
            "Your gf has a good head on her shoulders. Her reaction and response is very mature. Hold onto her OP! ",
            "That...pretty much couldn't have gone any better. Textbook conflict resolution.\n\nNow its up to you to manage your depression properly to ensure something like this doesnt happen again without you talking about it.",
            "Good communication wins again! Sounds like you're both maturely working to become better people. Best of luck to you both!",
            "Dude she sounds awesome. Keep her. ",
            "Oh god I spend too much time here. I remember a thread w/ subsequent updates a couple years ago with the exact same situation, except they were older and married.",
            "Wait, so you chatted up past hookups and ignored your girlfriend? If I were in your gf's shoes, I would have dumped you in a heartbeat. \n\nYou don't get to blame your mental illness (or being drunk) for the fact that you're a piece of shit. ",
            "This conversation is really mature for 23! You may have a keeper here, OP (and her, too)!",
            "This sounds like a pretty model example of how to deal with the situation pleased it worked out for you.",
            "Honestly, I don't even think it's that weird that she has an Instagram account following them.\n\nI social media stalk the exes of any guy I'm seeing/interested in (including ex-hookups, ex-flings...even good female friends who I suspect he's had feelings for).\n\nThis behavior might sound crazy to you, but basically every girl I know does the same thing. (I've actually deleted Facebook before for this reason...it enables me to find out way too much!)\n\nAnd I'm actually not the jealous type AT ALL. Seriously. Neither are the other girls I know who do this. It's something hardwired in our brains, I tell you, haha....we just need to know your past and need to know you like us more than you liked them/we fit better with you than they did. ;)\n\nOne friend of mine said she just likes to look at exes to see what they have in common with her...she thinks it's really interesting.\n\nI could discuss my analysis of why I think women are like this, but I'll hold off for now because at this point I'm just rambling. :)",
            "How the hell does she know the instagram accounts of all of your past ex's\\flings? ",
            "Blah blah blah,  this is creepy behaviour op "
        ]
    },
    {
        "post_id": "4hzjca",
        "author": "ismomcheating",
        "title": "An update, things don't go so well. Original: Me [19M], my sister [21F] found a video of our mom [45F] she thinks its of her cheating, but I think it might not be. We can't agree what to do with it.",
        "url": "https://www.reddit.com/r/relationships/comments/4hzjca/an_update_things_dont_go_so_well_original_me_19m/",
        "score": 2397,
        "num_comments": 371,
        "created_utc": 1462448932.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/4gnzc3/me_19m_my_sister_21f_found_a_video_of_our_mom_45f/\n\n**TLDR: nobody was cheating, but my sister fucked up my parents relationship.  Mom is crying now and has gone to stay with her parents, won't talk to my sister or me.**\n\nYeah, things didn't go so well unfortunately.\n\nI kept arguing with my sister.  I told her if she's so certain they're cheating, the least we could do is ask dad first if he knows about the tape but not mention that we've seen it.  She was determined that it was cheating, based on the hands and the feet, she was like \"those definitely aren't dads\".\n\nI told her she was creepy as fuck, if that was them in the video, and God knows how many times she's watched it, she was basically watching a video of *our mother* naked and fucking our dad's dick. Even if it wasn't our dad's dick, its still fucking gross.  She didn't care.  I told her if I couldn't stop her, she should at least leave me out of it, i want nothing to do with it.\n\nShe went nuclear, she went and told them everything, and embarrassed the fuck out of herself.  Turned out her little detective work was way off, it *was* dad in the video.\n\nOur dad was angry but mostly bewildered, but he just laughed it off and got over it.\n\nOur mom however didn't take it so well.  She had a panic attack, she went nuts.  She was like \"what the hell is wrong with you kids?\"  I tried to stay out of it but my sister dragged me into it and named me as her accomplice even though I had warned her against it.  Our mom was so hurt and upset, not only that her daughter would so brazely accuse her of cheating, but that her children had watched an explicit sex tape of her.  She was really traumatized, she couldn't take it any more.\n\nShe got up and left to her parents house where she's been there for a whole day to recuperate.  She only called our dad to speak to, she won't speak to us.  Our dad told us to just give it time until she's feeling better.\n\n\n   \n",
        "permalink": "/r/relationships/comments/4hzjca/an_update_things_dont_go_so_well_original_me_19m/",
        "comments": [
            "Well your sister is a shitty detective.  Your mom needs time to de-stress.  \n\nOn another note, is that tape no longer in your sister's possession?  She seemed to have been obsessed with it.  I would remove it from her possession and give it to your father.  Before she does something even more stupid.",
            "Have you talked to your dad and told him everything about you discouraging your sister? Make sure he knows you didn't want anything to do with your sisters shenanigans and ask him to  tell your mom that, and when she's ready you can speak to her directly and apologize on behalf of your sister.",
            "...Welp.\n\nDon't ever leave your sister alone with your computer. Or phone. Or mail. Or journal. Or literally anything she could wildly misinterpret. Lesson learned, I guess. ",
            "\"TLDR: nobody was cheating, but my sister fucked up ~~my parents relationship~~ **our relationship with our mother forever**. Mom is crying now and has gone to stay with her parents, won't talk to my sister or me.\"\n \n \n\nFixed that for you OP! You should definitely remember that your sister is untrustworthy in the future.",
            "[removed]",
            "[deleted]",
            "for the life of me, i dont understand what your sister was thinking.. ",
            "Your sister did not trust your mother to be faithful to your father. I think this is the biggest problem here.",
            "I hope this is a lesson learned for your sister to stay the hell out of other people's business. Sorry you had to be dragged through all of it. ",
            "Well this is why everyone was saying not to because there really wasn't any proof, turns out kitapillar was spot on. Feel bad for you and your mom, but your relationship should be fine I think she just needs time. I'm sorry your sister named you accomplice though especially because you said you didn't want part in it. ",
            "So exactly what EVERYONE in the last thread said would happen did. I like how now you're changing the story a bit so it looks like you didn't condone her telling them. This was the exact plan that you laid out to me last time when I (and everyone else) told you not to. Stay out of other peoples business and especially their sex lives. Not just your parents but everybody's. I was hoping for this update so I could laugh but now I just feel bad for your mom. That sucks. Hopefully you and your sister learn how to not snoop around other peoples shit and to not accuse your poor mother of cheating. I'm sure this makes her think what your sister (and you to an extent) must think of her for her kids to not trust her enough to think she'd cheat and keep a video of it. Her kids watching it just adds insult to injury. This is all too bad",
            "This is why I always encourage people to stay out of other people's relationships. Your sister sound like a piece if work... Like she actually wanted their relationship to implode. Sickening.",
            "I think if you want to try to repair your relationship with your mother a good first step would be reaching out to her via phone/email/text/whatever & say something that hits the notes of:\n\n* you're sorry that I violated her privacy\n* you will never violate her privacy like that again\n* you trusted & believed she was always faithful to your father\n* you love her & respect her as your mother\n* you hope she can forgive you\n* you'll do what you can to rebuild her trust in you\n* once she feels comfortable enough to, you hope she will return home because you, sister & dad miss her very much\n\nYour sister is going to have even more work to do. I just think you need to reassure your mom that she's still your mom, you don't think any differently of her, & you'd like to repair your relationship.\n\nI'm sorry your sister stirred up all this shit for your family. Glad to hear your dad is still holding it together tho.",
            "Don't rob a bank with your sister.",
            "You and your sister need to spend less time on Reddit and more time in real life.",
            "I love the dad in this situation. Hes so chill and just like. \"Yea thats me giving your mom the D\"  Then his wife freaks out and hes all like... \"She'll get over it\"",
            "TIL\n\n1. Stay out of parents sex lives\n\n2. Never be filmed having sex",
            "You don't say you apologized to your mom for your significant part in all this. Apologize to your mom, without defenses or excuses. APOLOGIZE TO YOUR MOM.\n\nYour mom is right to wonder what the hell is wrong with you kids. You apparently decided to take the advice of this group only after you argued repeatedly to confront them in some some way. \n\nI hope you at least learned something. Your sister is probably so defensive right now she will try to rationalize it all away but I hope you don't, and become a wiser person.\n\nAPOLOGIZE!\n\n",
            "It's kind of sad because I, and a lot of other redditors, said exactly this would happen. Your mom *wasn't* cheating because, surprise surprise, your parents still have an active sex life because they're young and still in love. Of course your mom is mortified. Jesus Christ. \n\nNext time tell your sister not to snoop, accuse and be happy that your parents still love each other. ",
            "[deleted]",
            "Yeah I told you in the last thread your sister should just drop it because it's none of her business. I hate to say I told you so but....",
            "Man, we warned and warned and warned you. ",
            "What in the everloving fuck is wrong with your sister? ",
            "Your sister is an asshole.",
            "\"She was like \"why do you care? I'm the one who did the snooping, so only I'll get in trouble. I'll cover you if they try to get mad at you.\"\"\n\nWell that didn't go according to plan.",
            "Sounds like your sister fucked things up for you and your parents. She sounds like a drama queen.\n\n",
            "Virtually **every single reply to your first thread** warned you that this was bound to happen. Your sister leapfrogged to conclusions and (per your update) damaged her relationship with your mother as a result. \n\nI hope your sister learned a lesson and hopefully you can learn from her mistake. \n",
            "Your sister needs to grow the hell up. Your parents are human beings before they're moms/dads/spouses/etc. and they have every right to expect privacy *in their own home,* even from their children. Sorry you got dragged into this, but your sister should maybe do some soul-searching and try to figure out why she did this. Really irresponsible, really immature, and really, really, *really* inappropriate for a 21 year old to be doing to their parents. That's messed up.",
            "Your sister needs help, If I were your mom, I would be freaked out also and probably not trust your sister especially ever again. I would try to explain to her when she's ready to talk how you didn't think it was right for your sister to blow this up. Even if she doesn't believe you, at least maybe you can be settled knowing that you told her the truth behind it. ",
            "just in time for mother's day! she sure does feel loved!\n\n\n\nseriously tho- y'all fucked up. i can't decide if you and your sister should bankrupt yourselves on the grandest mother's day ever, or just get the hell out of dodge & leave the poor woman alone with dad. maybe do both. ",
            "You could show your OP to your parents and use it as proof that you actively discouraged you sister from confronting them with the video. Make sure to point out the date of when you posted it. ",
            "Good job, super sleuths.\n\nHope you two have alternate housing arrangements.",
            "[deleted]",
            "I know you didn't ask a question, but I'll give you advice anyway because that's what this is for. If my wife and I were in place of your mom and dad, it would go down like this. We would get some money together and make sure you guys had everything you need, first, last, and security, health insurance paid, and cars with revision and registration up to date. Then we would sit you down and say that you're both adults now and it's time you go off on your own. You should prepare for this eventuality. I wouldn't mind so much, but I would support my wife in asking you both to leave. ",
            "'Mind your own business' is really really good advice that not enough people here seem to know how to take. I know it wasn't the OP 's fault in this case but geez people, think of this next time you're considering playing detective about other peoples relationships, especially your elders. Remember the potential consequences .",
            "All I can say is we told you",
            "I'm completely speculating, but this doesn't seem like just a stupid mistake by your sister. The fact that she watched it a bunch of times makes me think this might be some mental sex issues. Is your sister a virgin? Has she been in a relationship? Her reaction is almost like she's never seen people have sex before",
            "I don't see how this fucks up your parent's relationship? Your mom is embarrassed and needed a few days. Your dad got a chuckle out of the whole things and gets a few days alone. Don't fall into the same HILARIOUS OMG DRAMATICS your sister did. She's the one that messed up her relationship with your parents.",
            "I just read your OP and all your responses. You did the complete opposite of everyone's advice. \n\nIn this update, you made it seem like it was all your sister's doing. But instead of letting her fuck everything up on her own, you \"compromised\" and came up with this genius idea of confronting both of your parents together with their fucking sex tape.\n\nSo echoing your poor mother, what the fuck IS wrong with you?",
            "I'm sure its been said many times, but your sister is gross. She should probably get some therapy too, because what she did was not normal. If I saw a video where my mom was having sex with a man that I couldn't immediately see the face of, I would assume its my dad. I would proceed to be super super grossed out and turn it off immediately. EW, just saw my parents sex tape, I'm going to try never think about that again. Why the fuck was she so obsessed with it?",
            "I would take this as a warning that your sister likes drama, doesn't have good judgement and generally stirs shit up.  Keep her out of your business and don't trust her behavior in the future.",
            "Only way to make this right and take the awkwardness out the air is for them to see you two doing it.....",
            "So, question for everyone:\n\nThis is hindsight, but maybe valuable hindsight.  Given OP knew his sister was going to do this, should he have forewarned his parents?  Would that have helped defuse the situation, for OP if no one else, or would it have made it worse?",
            "Shit man, your original post already made me cringe so hard I almost imploded. There should be no scenario where you and your sister should ever bring this up to your parents just for some dramatic narrative you guys feel like fulfilling",
            "As I suggested in my comment on your original thread, your sister is just out to create drama. I suggest you disassociate yourself from her and this story ASAP by talking to your father.\n\nYou can also write you mom an email or text where you that you were always in favor of not saying anything and that you strongly discouraged your sister.",
            "It's kind of incesty that your sister was studying your parents sex tape so much imo.",
            "Parents, sex tapes are like loaded guns. You shouldn't keep them in the house where your kids can get a hold of them, they'll seriously injure themselves by accident! ",
            "Good. Your sister deserves the silent treatment after that BS.",
            "What the hell is wrong with your sister? Tell her to get a damn life and or a hobby. ",
            "Just in time for Mothers Day! ",
            "That is so awful & I feel so terrible for your mother.I would never let your sister be in my house unsupervised ever again. She's 21 - she should know better than to be so disrespectful of other people's privacy. ",
            "Cringe humor. I like it. Thanks for the laugh!",
            "So, interfering in the sex lives of grown adults to pursue some juvenile idea of revenge/justice doesn't work out so good?\r\n\r\nWell, colour me surprised. /s",
            ">but my sister fucked up my parents' relationship\n\ni fail to see how, as she appears to be fine talking to her husband. it would seem she is uncomfortable with her kids at this very moment and not her husband. kinda clickbaity, js",
            "So, it's exactly what EVERY SINGLE PERSON TOLD YOU WAS GOING TO HAPPEN.",
            "You should remember this story and warn all your sister's boyfriend secretly. \n\nShe sounds like the one that would \"welcome herself\" into my computer files and accuse me of cheating when she sees me in a photo with some girl who turned out to be my dead sister.   ",
            "Throw your sister under the bus as hard and fast as you can dude. She dragged you into this for no reason after snooping through your parents' private shit whereas your parents did nothing wrong. Also make sure your laptop and phone are password protected and she never goes on them",
            "Wow. Incredible job of trying to put this all on your sister! The original post is all about you doing this as a team, but, yeah, fuck her she is the perv.",
            "Sister wanted teh drama. Sister got teh drama.\n\n",
            "Good grief. How old are you and your sister? Parents like sex too. Cheating or not this was NONE of her business.",
            "your mom is just embarrassed right now, and i know you said it was nasty (the video) and all. but you should be happy your parents are sexually active and happy, it shows their relationship is doing well. yeah its embarrassing and not the best thing to see or talk about. but try to take it in a positive light and maybe communicate that with your mom. like i said i think shes just super embarrassed.",
            "Write your mom a letter, explaining your role. At this point, your sister acted so poorly it makes sense to at least plainly state the choices and decisions you made and your sister made and how they differ. \n\nRemind your mom that you love her and that while yeah, it's not the sort of thing you want to watch, there's nothing wrong with her being in love with your dad.",
            "your sister is the best daughter ever, she got what she wanted, she fucked up your parents relationship.",
            ">  I tried to stay out of it but my sister dragged me into it and named me as her accomplice even though I had warned her against it. \n\nWtf is wrong with your sister. ",
            "So pretty much what everyone here said would happen",
            "I would definitely buy your mom a day at the spa or something",
            "Poor mum. Sounds like she's mortified and for good reason. Hopefully she just needs a few days to calm down.",
            "Okay, you and your sister are pretty young. I'm not going to condemn you for the train of thought \"hey a dirty video of mom... BETTER WATCH IT AND EXAMINE IF THE DUDE IS DAD!\". But people who commented on your original thread have even spelt it out for you. You find something sexual with your family member in it? You fucking close it, hand it to the family member's spouse and say you've found this, accidentally opened it, fortunately you closed it ASAP, and can they please keep this stuff more hidden. \n\nIf they knew about the tape, they are more discreet with their sex tapes now. If they didn't know about the tape, they know now. Case closed on your end, AKA not everything is supposed to be solved by you, and even if it's moral to disclose information, there are good and bad ways of going about it. Pick the good ways. The end.",
            "Your sister is a bull-headed idiot. Your sister shouldn't have snooped on your mom's laptop, at all, but it wasn't a good idea to have the sex tape be so easily findable if all it took was a little snooping. But your mom isn't to blame here, pretty much only your sister. OP, you should make sure that your mom and dad know that you told your sister that she was wrong and being an idiot.",
            "This is pretty funny. I hope you all laugh it off next week. ",
            "Your sister is an idiot and needs to learn what boundaries and respecting others means. Explain what happened to your dad and mother when she is ready so they know you aren't as awful as she is.",
            "Dude. Your Mother's Day is going to be sooo awkward",
            "Shitty detective work. Your sister must be a redditor too",
            "Ok why did she say she would cover you and explain it was her idea in the last post, but is now throwing you under the bus as well? I don't know any great advice for this situation but you really need to reevaluate your relationship with your sister. ",
            "People are being so melodramatic about this, things can definitely be turned around and patched up. Give your mom some space, she's probably weirded out and doesn't know how to talk about this with you. After a bit, write her a letter explaining the situation from your perspective; don't throw your sis under the bus, just say you both didn't really know what to do when you found it, and that you assumed the worst without really thinking it through. Mainly you owe her a big, and thought out apology. Apologize for breaching her privacy, and for bringing it out like that. Tell her you love her, and you want to do whatever it takes to earn her trust back. Bear in mind not to expect her to be over it overnight, and make it clear in your letter that you know it will be a process earning her trust back and just how precious it is.\n\nGet your dad to deliver the letter, and when it feels right sit down with her together.\n\nWish you the best of luck, and remember the takeaway from this is that you should have given her a chance to explain it in private. ",
            "I'm sorry this happened to your family OP.  I hope your sister uses this experience to learn how to stay the fuck out of other peoples personal files.",
            "I would give your mother a day or two to gather her thoughts and calm down a little.  \nThen I would send a very clear and concise message to both your parents outlining that you absolutely were NOT an accomplice to this and constantly advocated that your sister drop the subject altogether.  \nAdvise them you can prove you were trying NOT to mess up anything between them and definately did not want your sister attempting to do that same (you can show them the original Reddit post you made - if you have texts/messages to your sister saying \"Don't do it\", screenshot them and share them).   \nOverall apologise for how the whole situation went down but be clear that you wanted NOTHING to do with this and this was all your sisters crusade, you are not at fault here, you did nothing wrong, you cannot stop your sister.   \nYour sister fucked up in major way, you don't need to be bundled in with that bad feelings that are going her way right now.     \nGive your parents some time to digest things and avoid being bated to provide any justification for what you (or \"you both\") did.    \nConstantly repeat you never wanted any part of this and regularly told your sister to drop it.  \nDon't get too deep in the weeds with your reasoning for who/how/what/were/why you did anything.   \nYou tried the best you could to get her to not go nuclear, she chose to go nuclear.  \nThis is on her, not on you.  \nDon't try and rush a resolution, your parents will come back to you when they feel it's right.  \nUntil things are ok between you and your parents again do NOT speak to your sister.   \nIgnore, Block, Avoid your sister until things return to a semblance of normality\nShe may start to pull some very sneaky and twisted stuff now that she's fucked up so badly.  \nShe'll drag you down with her and manipulate conversations with you posthumously.  \nFrankly I'd consider reducing contact with her after that for a long while until she grows the hell up and stops being a drama llama.  \nEDIT: Said \"No Contact\", really meant \"Avoid the Hell out Of\"",
            "I don't think this will be an unbreachable issue, but I don't blame your mom for being really angry and horrified. If I were you I would get your sister and urge her to give a heartfelt apology to your parents and promise not to snoop again.",
            "Sheesh, don't let your sister borrow any phones or laptops from now on. Also your sister needs some kind of hobby. \n\n",
            "If you stir the shit, you're going to get shit stirred",
            "That is suuuuuper fucked up, sorry mom...",
            "Man what a great Mother's Day present! ",
            "To your sister, Nice job breaking it (it being the relationship)",
            "Your dad is boss.",
            "Ok so what is the sister doing now?",
            "Pictures of your mom, sister, and your dad's hog or else it didn't happen",
            "On the plus side, you know your parents still love each other.. and on the missionary position side, you know you're parents are still fuckings.\n\n\n\nMy dad died when i was 25, i dream that he was still around. If he was still around an boning my mom.. i would thank the starz. \n\n\nYou need to get over it... your dad did, because he still loves your mom.\n\n\nfucking grow up.",
            "Your sister is so dumb honestly I feel bad for your mom",
            "it's almost as if she *wanted* the outcome to be cheating.. wtf ",
            "Not your fault at all. But I love how the top comment in your first post called this. Sounded like your sister was stirring up drama with no real evidence from the start.\n\n\nI'm going to echo the sentiment that you tell your dad you tried to get your sister to drop this. Make sure he tells your mom. She will actually feel better knowing one of her kids wasn't in on this.",
            "Your mom is upset now, but hopefully with time this will turn into something you can look back on and laugh at? Maybe?\n",
            "Wow. I honestly thought his was going to go the complete opposite way! \n\nThat said, your sister is immature and should bear the brunt of the backlash from this! You did nothing wrong from the look of it.",
            "It's times like these when we learn the unconditional love a parent has for their child is, well, not *entirely* unconditional.\n\nYour sister's a psycho.",
            "[deleted]",
            "therapy or treat your parents to shopping trip, holiday, spa day to get over the horror of your sisters stupidity. talk to your dad about your involvement ",
            "It's strange that if her sister was right people would be praising her instead of telling her to stay out of other people's business.",
            "Wait.... Did your sister post he first post I remember that your sister found the video.",
            "it seems like you have a pretty cool dad - i would just trust his judgement.",
            "That's fucking hilarious. She'll get over it. ",
            "Your mom is super embarrassed.  Honestly, if you make a sex tape, don't be SHOCKED when it gets out!  This is why you don't do sex tapes to begin with!",
            "How embarrassing. Though, your mom is overreacting quite a bit. ",
            "Dude your momma is trippppppin laugh it off and move on",
            "Dude I'm just sorry you watched your parents bang. Eeeeesh. She'll get over it, especially for the fact that it wasn't you calling her out...",
            "[deleted]",
            "When your Mom has calmed down, you need to pull her aside and make it clear that you didn't want any part of it. ",
            "Whoops.  Hoping it turns out all right.",
            "While I agree your sister fucked up, she was also probably pretty panicked and confused. At the end of the day your mother reacting the way she did is wrong because she is the one that made the sex tape and hid it so poorly. I'm sure if her husband made a sex tape that showed he was cheating on her she would want to see it. Your sister had the right intentions but dragging you into it was a dick move.\n\n**EDIT** Because of the hate i'm receiving from this comment, if you found a video of your mom banging some dude you didn't think was your father how would you go about it? Would you let it eat away at you and just never bring it up even though your mother could be cheating on your father? When his parents made that sex tape they knew the risks of someone else watching it if they didn't hide it well, I mean let's be real, they recorded it for their own pleasure. Knowing that, the mother totally over reacted. She feels betrayed that she would think she would cheat on him but it was her and her husbands own damn fault that they didn't hide the video in a place their children couldn't access it. The daughter clearly wasn't thinking straight and it was 100% scummy of her to drag her brother into it when he didn't want anything to do with it but she had the right intentions regardless of what you redditor detectives choose to believe.",
            "[deleted]"
        ]
    },
    {
        "post_id": "3gj1zg",
        "author": "othermanproblems",
        "title": "UPDATE- Well apparently my [27M] \"girlfriend\" [30F] of 5 months is happily married with two children",
        "url": "https://www.reddit.com/r/relationships/comments/3gj1zg/update_well_apparently_my_27m_girlfriend_30f_of_5/",
        "score": 2402,
        "num_comments": 224,
        "created_utc": 1439251487.0,
        "selftext": "[First part](https://www.reddit.com/r/relationships/comments/3g5hxr/well_apparently_my_27m_girlfriend_of_5_months_30f/)\n\n\nCurrently typing this from my hospital bed because he beat the shit out of me.\n\n\nJust kidding.\n\n\nSome posters tried to tell me not to tell him but fuck that. Most of you told me to go through with it but through email/letter basically without physical interaction. Even though it was a massive risk, I thought it would be better for me to explain this shit to him in person so I decided to meet him.\n\n\nI called work explaining I'd be late and then drove over to his workplace around 7:20 am. Then I just went inside and waited in the lobby, watching the door for him to appear. He came in around 8 am and immediately I walked up to him, told him by name I have something important to tell him, and asked if he could meet me after work at a nearby Starbucks. He was perplexed but I convinced him that it's very important and told him not to tell anyone. He agreed, thankfully.\n\n\nSo then I went to my job and went about the day as usual. At 5:30 I was waiting at Starbucks and he came in shortly after. Then the conversation began.\n\n\nI explained to him that what I was gonna say would crush him and I requested a chance to say my piece without interruption. He allowed this so I told him everything. About how I met his wife, how she used a fake name, the 5 month affair, the lengths she went to to conceal it, everything. For my own safety I emphasized how I didn't know she was married, how I found out about her secret, and how I decided to tell him as soon as I found out. I then handed him a folder containing all of the screenshots. He looked through all of it and then just stared at his coffee in total silence for a minute or two.\n\n\nHe then replied, firstly thanking me for coming to him with this information and for doing the right thing. He said if he were in my position he would have done the same thing. Then he told me how he had suspected his wife was cheating but then his wife lied to him, assuring him nothing was going on.\n\n\nThen for the next 10 minutes he asked questions about the affair, like about the dates we went on, the sex (she never did anal with him but did it often with me), the conversations we had, etc. I told him the complete truth. By the end of this he was enraged but didn't attack me or anything. Instead he thanked me once more for telling him, and told me I'm a good man. Then he said that although he appreciates me telling him, he told me never to contact him again for obvious reasons. I totally understood and was cool with it.\n\n\nAt this point he was getting up to leave so I asked him what he plans to do. He said he would definitely divorce her and that the screenshots would help him out since they apparently have an infidelity clause in their prenup (she cheated on him at the early stages of their relationship). I was elated to hear this, wished him the best of luck, and we parted ways. I paid for his coffee.\n\n\nSo there it is. Thankfully I escaped unharmed. No injuries, no wounds, nothing. I deleted the cheating bitch's number and cleared my phone of all traces of this shitstorm. I'm proud of what I did and I pray that the cheating bitch faces harsh justice. \n\n\nGood night, Reddit, hero signing out.\n   \n\ntl;dr: Met up with guy after work, told him everything as per original plan. He thanked me, said he would divorce her, and will use my screenshots as evidence due to the infidelity clause in their prenup. Total win all around.",
        "permalink": "/r/relationships/comments/3gj1zg/update_well_apparently_my_27m_girlfriend_30f_of_5/",
        "comments": [
            "[removed]",
            "Both of you guys sound like up and up dudes.\n\nYou guys handled it very well.\n\n btw the first few sentences got me. Well played op.",
            "Good for you.  Handled that like a pro.  I wouldn't be surprised if you get a nasty phonecall, email, text, or worse from the ex-missus.  Be engarde.    ",
            "Firstly, good on you! You did the right thing. \n\nSecond, wow I would have killed to be sitting within earshot of you guys at that Starbucks",
            ">since they apparently have an infidelity clause in their prenup (she cheated on him at the early stages of their relationship). \n\nAt least he took some precautions although arguably not marrying a cheater in the first place would have been the best course of action.",
            "Good for you for taking the risk and letting the man know what a lying cheat she is. Poor man clearly gave her the benefit of the doubt and second chance. Clever move have a prenuptial with an infidelity clause in it. Hope all goes well for him.\n\nMay your next gf not make you an accessory to cheating.",
            ">(she never did anal with him but did it often with me)\n\nlol. Guess she was trying to be one of those *classy broads*.",
            "If I could go one whole day without reading about anal sex on reddit I would be so happy. It somehow gets worked into every damn thing. Anal isn't even the best sexual thing.\n\nUgh",
            "> he asked questions about the affair, like about the dates we went on, the sex (she never did anal with him but did it often with me)\n\nI got about this far before I realized i didn't believe this story at all.",
            "how to get a top post in /r/relationships:\n\n1. mention someone being a cheater\n2. that's it",
            "Good man. Also, very thoughtful of you to pay for his coffee. ",
            "Flawless victory.",
            "/r/thathappened ",
            ">firstly thanking me for coming to him with this information and for doing the right thing. He said if he were in my position he would have done the same thing.\n\nThat's pretty much why this sub usually errs on the side of \"tell the cuckholded spouse\". It will suck for them short-term, but in the long run it's better to avoid STDs, the possibility of children, and a drawn-out marriage where one party has totally checked out.",
            "I got so worried when I saw the first paragraph! Glad to hear you guys talked. Stay well.",
            "Did it ever come up that you were in his house? That's about where I would have lost it and thrown a table.",
            ">  I deleted the cheating bitch's number and cleared my phone of all traces of this shitstorm. \n\nYou're going to be asked to recount all of this and more to his lawyers in a sworn deposition to be used in the divorce.  If it gets nasty, her lawyers will also depose you and ask you all sorts of WTF stuff to try to help her.",
            "I'm interested to know if this lady will text or call you or show up at your door to either have you take her back (once she's kicked out) or to freak out at you for \"ruining her life\".\n\n",
            "I'm so glad you told the husband.",
            "Has she messaged you at all being like \"fuck you asshole\"??",
            "Good job! Has she tried to contact you?",
            "dang dude,  good on you!  this world needs more people like you ",
            "You did the right thing here. Both of you sound like stand-up guys and I can't imagine what her husband is going through. Just awful. Well played, sir. ",
            "Who paid for the coffee or did you guys just mooch?",
            "OP, nicely done. You and the other man sounds like good people.",
            "Bravo!",
            "[removed]",
            "Well done.  You are a good guy and you both deserve better.",
            "This is a rare account of two mature adults talking over a tough subject and not having it devolve into some kind of bullshit or fight. \n\nGood work sir. ",
            "I wonder how silly OP would feel if one day he turns on the news and sees that this man actually ended up killing his wife. \n\nSounds morbid and fucked up to say, but I've seen a lot of shit like this (woman cheating on husband) on this sub before and never had that thought cross my mind before...",
            "You're a good man. ",
            "Or they are into cuckolding, he took your screenshots home and they got it on like never before. Just a thought. ",
            "You're my hero.",
            "\"I paid for his coffee.\" Good man"
        ]
    },
    {
        "post_id": "aucle3",
        "author": "martin_shillkri",
        "title": "My [29M] fiancée [30F] is obsessed with her side business, and it's taking over our lives.",
        "url": "https://www.reddit.com/r/relationships/comments/aucle3/my_29m_fiancée_30f_is_obsessed_with_her_side/",
        "score": 2395,
        "num_comments": 269,
        "created_utc": 1551042463.0,
        "selftext": "Background: I'm a graduate student, just wrapping up my PhD, living in LA. My fiancée and I have been dating for two years, and engaged for three months. She works in corporate strategy at a big company. Neither of us make a lot of money, we live in a tiny 1 BR/BA.\n\nRecently, one of our friends [27F] started selling jewelry and other little handmade trinkets via an online store (Etsy). It's going well, she's selling about one thing a day and making a bit of money on the side.\n\nI'm pretty sure my fiancée got envious. She's artsy at heart, and often looked for a side-gig. After our friend started selling crafts, my fiancée tried her hand at a number of things -- jewelry, pottery, etc. until she settled on paper flowers.\n\nMy fiancée has made _thousands_ of paper flowers over the past two months. \n\nShe's been trying to sell them online, and has gotten some success -- selling a few dollars' worth every day. That wasn't enough though, so she's also been selling them at markets, fairs, and plainly on the streets after work. \n\nHowever, the paper flowers don't make much money. Though we're not \"well off\" by any means, she still makes more money at her day job. \n\nBut I've caught her skipping her day job to sell flowers! In the last two weeks, she's actually been taking sick days and \"working from home\" in the mornings, telling her boss she's on calls or stuck in traffic when she's actually spending the first three hours of the day going door-to-door hawking paper flowers.\n\nAnd don't get me wrong. They're nice flowers. She's doing a great job at making them, and her drive is impressive. But I feel as if it's an obsession that's taking over her life, when she should be prioritizing her real work, and frankly, our relationship. We've been less intimate and have had less time for dates and other fun things because she's always working on the paper flowers. The closest we get these days is when I help her bring flower packages to the post office, or when I'm helping her take photos of the flowers. Stuff like that. I feel like I've become an accessory to her side business (which, I repeat, doesn't actually make much money at all). \n\nIt's had impacts in other ways as well. Hanging out with our friends is a struggle now, because my fiancée doesn't want to talk about anything but the flowers. She's always carrying some in her purse, showing them off, and if a friend shows only a little bit of interest, my fiancée will try to sell them some. It's awkward. \n\nI have no idea what to do. I'm considering taking a break and moving back in with my parents (also in LA) for a few weeks while hoping for her to stabilize. But that seems extreme. What should I do?\n\n---\n\n**TL;DR;** : Fiancée is obsessed with her arts-and-crafts side business, which doesn't make a lot of money, but it's totally taking over her life, hurting her other priorities and our relationship. What should I do?",
        "permalink": "/r/relationships/comments/aucle3/my_29m_fiancée_30f_is_obsessed_with_her_side/",
        "comments": [
            "You mentioned she's artsy, I'm a creative kind of person and I find that I need to express that side of myself every now and again. It sounds like she's feeling unfulfilled in her current job and wants to explore more artistic avenues.\n\nIs there a possibility she could look into a job that fills the lack of creativity she might be feeling? As others have mentioned you should definitely have a conversation with her to see what exactly is driving this.",
            "You're right to be concerned. Having a hobby is one thing, but skipping out on her day job to do this is concerning. Sit her down and ask her what her goal is with this flower business. Remind her that her day job should still be her priority.",
            "I hate the \"you should talk to her\" advice because it's such a cliche, but's honestly, it's a cliche because it's a good starting point. If you haven't talked with her about this and fully explained how it's affecting you and your relationship, that's a great place to start. \n\nAlso, asking her how she's feeling about her flowers vs. her current job; is she not fulfilled in her current role? Is there something she could do in her current role to get more job satisfaction (and potentially spend less time with the flowers)? Is there a different professional path she is looking towards? Understanding her \"why\" for this a little deeper could help you both find a more intentional/specific solution. Good luck!",
            "Oh God, this was me (your GF) years ago when I first moved into a house with my then significant other.  Right when we bought the house I started a business that consumed me for 5 years.  I wanted him to embrace it too and help me.  He patiently tolerated my taking over our house with inventory.\n\nIn my mind, I was building an entrepreneurial future for us.   \n\nBut it didn't work out.  I folded the business after 5 years.\n\nbut the damage was done.\n\nWe hadn't connected or taken a trip and barely had sex in those 5 years.\n\nWe eventualy spilt up because we had grown apart and it was really my fault.\n\nI think lack of communication is what killed us.  He never verbalized that he resented my time with the business.\n\nHe never asked me what the long term plan was or asked if I had a business plan. (I didnt.)\n\nI did have to \"get it out of  my system\" to see what running a business was like. So I advise letter her pursue it in some way.  But be open about the impact it's having on your relatioship.  Perhaps a couples counselor would help.\n\nI'd hate for her to be writing on Reddit in 10 years how she threw away a good relationship for a flower business.\n\n(On the other hand, on the off chance that you see this business has potentia and she's onto something big, then you can be patient and ride it out, if it could benefit you both down the road.  That is the life of an entrepreneur.)\n\n&#x200B;",
            "As a corporate strategist, has she done some thinking about how profitable she could be? Does she have some sort of model that explains this? As a management consultant, I would do this to validate my idea with some basic assumptions. Is she being deliberate about this business to strike rich because she knows she can, or is she just doing arts and crafts to one up her friend?\n\nThe answer to that question is important. Ask her to make a model if she hasn't.\n\nOther than that, it seems like you're being supportive and relationships with side hustles can be tough. That being said you have every right to want to spend more time with her and she should recognize this and agree to some sort of compromise. ",
            "[deleted]",
            "In addition to what other people have said, can you do a breakdown of hours spent making flowers vs profit made so far? Seeing that the flowers only make .003 cents of profit per flower might be a good metric.\n\nAlternatively, watch the episode of the Big Bang Theory where Penny starts her flower pin business.\n\nEdit: I saw some comments about how OP should encourage her in growing her business, marketing ideas, etc. As someone who briefly looked into doing the exact same thing as OP’s gf, there is literally no way she’s going to make money off of this. Paper flowers, even the more complicated designs, are insanely cheap and there are plenty of wholesalers already in the market. One woman making them by hand will flat out not be able to compete.",
            "Sit down with her and try to plan out the next five years of the paper flower business. How much does she want to budget and is there a way she can break even/make a profit? What does she see as the longterm goal? Does she want to have paper flower retail stores or do a gallery show of her paper flower work? Does she eventually want to quit her day job? Make it concrete and it might be come clearer to her whether this is something she wants to pursue or just an obsession.",
            "I live in LA too and paper flowers are a huuuuge thing at weddings here.\n\nMaybe she should look into marketing them for weddings? \n\n\nAnyway - this is not sustainable as I am sure you know. I would definitely sit her down and explain that you support her flower business AS LONG AS it does not get in the way of her job or your relationship.\n\nPut your foot down. If she gets fired from her job I have a feeling you will be screwed paying the bills. ",
            "Look, I have a hobby business and a fulltime job. Most artists I know personally, \"successful\" ones, all have day jobs. The folks who are able to do just what they love for a living, very rare, and they work HARD and longer hours than any day job, and the financial risks are REAL. \n\nSkipping work for this is not sustainable, and as you said, she's not making much (if any, lets be real here after you account for time spent + materials) profit. It's great that she's found something she's passionate about, but balancing that is tough. Remember that the root for passion in Latin means to suffer/endure, it requires sacrifice in other areas of your life. I would suggest wording your concerns carefully so that she doesn't think you don't support her creative endeavors, but that you miss the time you spend together and you're concerned about her skipping work.",
            "I have several family members who are professional artists. They all have day jobs - except one, who inherited several million dollars. MOST artists and creative people have day jobs. That's just how it is. And you can't imperil your day job to make art, because if you lose a good day job, you may find yourself having to work multiple minimum wage jobs and no longer having TIME.\n\nMaybe link her to Sara Benincasa's essay \"Real Artists Have Day Jobs\" (on Medium).\n\n\"The biggest myth we are fed as artists is that we need to sustain ourselves solely on our art. This is ridiculous. Every artist has at some point in time had some other job. Some of them kept these jobs their entire lives. In the latter category: William Carlos Williams was a doctor in New Jersey; Henry Darger was a custodian in Chicago; Harvey Pekar was a VA Hospital clerk in Cleveland.\"",
            "Talk it out with her, but the skipping work (lying) thing needs to be shut down HARD.  ",
            "Always shocks me when people post stuff like this without having had a real, blunt, serious conversation with their partner.\n\nWhat do you do? Raise all of the concerns you show to her directly.  Go from there. ",
            "[deleted]",
            "Always prioritize your day job first. Your day job gives you securities and benefits like sick leave, normal leaves. Selling things like paper flowers might seem a great idea but you have to understand that if someone decides to flood the market with similar products, your sales are gone. Also paper flowers while nice is not something needed, you can't get return sales. Why would they not go for actual flowers or plastic flowers?\n\nI think your fiancee hopes this can turn into a profitable business and she can quit her job but let me be frank the journey is much more difficult. She hasn't even gotten to the part where she files for taxes.",
            "Yeah this was one weird read to be honest. Question Id ask myself is, do you think this will last long? Do you think she can realise that she is chasing some dream that cant really be attained, and can she be bored of doing the same shit with the paper flowers. And how long has this been ongoing?\n\n&#x200B;\n\nIf it has not been ongoing for that long, Im sure the excitement will cool down, and you wont actually be the one stopping her. I dont know all the info though, care to further give me details?",
            "Would love an update on this in the future ",
            "It sounds like she wants this to be an actual business, not just a money-making hobby? \n\nI have gone through the experience of having my husband start a business shortly after we married so I can tell you what we did that worked for us;\n- Agree on a specific timeline and profit expectations that would make this worth the time and energy being put in to trying to make it a business, rather than just doing it as a fun side project.\n- Agree on what “work hours” being put into this business are going to be okay for both of you, and what days/times are reserved for couples time.\n- Set a “start-up” budget for the business and agreed that once that money ran out, if the business isn’t self-sustaining, no more money will be put into it. It doesn’t sound (?) like this is a current concern of yours, but you could maybe encourage her to do so. I’m sure paper isn’t the most expensive supply, but I can still imagine going down a wormhole of thinking if you just have a better camera, or took photography lessons, or spend more to advertise your products, that’s all the business needs to take off.\n\nIn addition to the above, if you haven’t already, just tell her you don’t think she should be skipping her job for the side business and you don’t feel comfortable when get-togethers with friends turn to her trying to sell them flowers.\n\nIf you both can’t have these discussions productively, well, marriage comes with tough discussions and working together as a team, so maybe your plan of time apart is warranted.\n",
            "> In the last two weeks, she's actually been taking sick days and \"working from home\" in the mornings, telling her boss she's on calls or stuck in traffic when she's actually spending the first three hours of the day **going door-to-door hawking paper flowers.**\n\nShe's *what*? \n\nEverything else she's doing sounds like she's frustrated with her job and is trying to find a creative outlet, and is maybe losing sight of her other priorities. Taking time off to go *door-knocking*, in this age of the internet, etsy, and craft fairs, is honestly verging on insane. What is she trying to achieve by interrupting people at home to try and hawk paper flowers?",
            "it sounds like her creative life is a lot more important to her than she thought. perhaps support for that emerging realization is as important as her coming to grips with a realistic way to bring this element to the forefront. ",
            "It's very likely that she's losing quite a bit of money on this expensive hobby. I think offering to help her do an in-depth cost analysis of EVERYTHING it costs to make a single flower might show her that there is a lot she can do to grow the business that doesn't include countless unpaid hours hawking her craft on the curb. Count everything from the actual materials, to the gas she uses driving to and from events, and the time she spends on photography and social media marketing. She needs to not only be replacing her current salary to cover household budget needs, but also making a little extra (aka profit) to invest in the business. You can't \"make\" her go back to work but you can insist that the shared household budget comes first financially and the relationship comes first in her priorities as a necessary condition of your continued state togetherness. You can be supportive AND have boundaries! ",
            "Sounds like she doesn't like her day job. She is using her own time and resources. I say let her be and maybe encourage her to seek another job. But those sick days may come in handy for interviews so better not use them all up.",
            "Sorry I don’t have any relationship advice to give you, only to suggest that if your GF is serious about this then she needs to do some study and market research. Like what is the actual need for paper flowers? Is she selling them to brides? If her prices are competitive she could make some money there and at least if she’s working towards a specific client she’s not making paper flowers willy-nilly. ",
            "As a fellow PhD student, I want to point out our privileged position. We get to do work we are super passionate about, and that sometimes consumes our minds totally for weeks on end even against all our efforts. Im not the hardest working student, but I definitely am too distracted to socialise with friends most of the time and sometimes tune out when my live in boyfriend speaks to me. \n\nFor the whole of your 2 years together she has seen you slave away at a passion. Although I don't justify some of the more risky behaviour she is taking, i think maybe just appreciate she is doing what she has seen you do for 2 years.\n\nYou explain how things have changed with this business, but is there a chance that things may change again once you finish your PhD and have more free time to see her around the work?\n\nA lot of us don't realised the constant grind that is needed to really get a business going. And that the most successful business people will have had many failed ventures. This is possibly a step on a ladder for her to the next thing up, and a great learning experience. But unfortunately, just like the phd journey, sometimes the learning comes with a lot of stress and lost time.\n\nJust a slightly different perspective (and very different from my comment on someone else's post that says side hustles, passions and dream jobs are a con, when we should really just want a job that let's us live a good life outside of it) ",
            "[deleted]",
            "[deleted]",
            "It's not a real business. It's not even a hobby that pays for itself, unless she values her time at $0.\n\nThe nicest thing you can do is offer to help her write a business plan. She will quickly realize that this isnt a business.\n\n\n",
            "all of the advice here is fine but also she MUST STOP going door to door and selling on the street.  First off, no one wants to be solicited like that.   Second going door to door is unsafe.   Third, what a way to sink the perceived value of your goods then by doing those things.  ",
            "Sitting down and making a plan with her is the best advice. \"Hiw much time per week do you feel is fair for you to spend on your business?\" \n\nDo not condone her or come off as unsupportive. It will backfire if you do. If this business isn't going to be successful, she will figure that out in her own. ",
            "Honestly she may be super unhappy with her day job. If she’s finding joy in this side hustle even if she doesn’t make a ton off of it while also compromising her day job, my guess is she’s using this to cope with how unhappy / unfulfilling her Corp strat job is. That being said, it’s irresponsible and unhealthy for her to do this so you definitely need to discuss this with her.",
            "I am going the comments, but....I was on her side until you said she was \"taking time off\" to do this business.  If she wanted to make this her full time gig, then she has to quit her corporate job.  I suspect she can't afford to do that since you are working toward your PhD.  ",
            "I can see how awkward it would be having her try and sell stuff to your friends. It reminds me of having “acquaintances” and friends trying to sell me stuff from their multilevel marketing schemes. Good luck OP — just talk to her and see what her goals are. OR help her market her skills to the right kind of employer — like a wedding decor place or craft company. ",
            "She should narrow her focus down.maybe she could focus on making paper flower bouquets/table decorations for weddings? That way she could charge more for them, but do it less often? ",
            "I feel for her a tiny bit as someone who moonlioghts as an artist. But alot of that is wayy over the line. I make sure with my other half when going out to live paint at events that it doesn't disrupt our time together and try to make it to shows when shes already asleep. one day of the week I dont do art stuff and we hang out. I appreciate the sacrifices she makes and let her know every chance I get. She makes more than me and shares everything we have. I too have thrown out prices when friends say they like a painting and catch myself. Im curious if she saw your friends success and was inspired or just the reasoning. Selling something you made from your head and using that money to provide gets me higher than anything out there. Makes me feel almost weightless, graceful, and for a small moment everything is okay. My 5 year goal is to get 1000 real fans. People that know and like my work, not bots or people that follow for follow, people local. If I could sell a 16x20in on canvas consistently for 50 bucks a pop I would quit my day job and paint 600 paintings a year. no joke.",
            "It sounds to me like her job kind of sucks. I don't know the details of \"corporate strategy,\" but it sounds like something that should pay more than what she's getting. Maybe if she found a better job she wouldn't be so fixated on the flowers. ",
            "Are they the sort of paper flowers one could affix to a large but portable wall of sorts, by the hundreds/thousands, in a pastel gradient fashion, and then here or sell the entire thing (or hire them out if she makes more with different colour pallets) as a beautiful wedding or event backdrop... or even to photographers or studios or theaters etc. Maybe she needs to think a little bigger to make some more dosh. ",
            "Unless you're a real artist who can sell prints for $20 and originals for $500, the real money in crafting is YouTube and that's still a hell of a lot of work/initial investment.",
            "Take her to seek medical attention. She might have a brain tumor.",
            ">She works in corporate strategy at a big company. Neither of us make a lot of money, we live in a tiny 1 BR/BA.\n\nHow do you work in corporate strategy for a big company and not make decent bucks?",
            "At the root of this is your partners jealousy over watching her friend monetize her hobby. I recently read an article that pointed out, In many any ways, we are taught that hobbies are meaningless unless they generate income.\n\nSince I can’t link, I suggest you google “The Modern Trap of Feeling Obligated to Turn Hobbies Into Hustles”\n\nAs an artist, i think this is an incredibly important read for creatives. We artists do spend a lot of time feeling woefully inadequate in our creative pursuits, and very competitive with other artists. Selling art is still how people seek validation for the effort and skill.\n\nYou wife needs to find a new source of creative validation. One that allows her to achieve a healthier balance in her life. There’s an obvious limitation to how much paper flowers can and should be monetized. ",
            "Although there's no excuse for her skipping out on work and being dishonest with you and her boss, I'd say that this artsy endeavour is only bordering on 'obsession' because there's some thrill in sneakily doing something that she's truly passionate about.   \n\n\nI've seen heaps of people in our generation freak out about general life stuff around 30- it was common for our parents to stick it out in jobs they hated because that's the responsible thing to do. Her friend's success probably made her realise what she's actually passionate about, and what she isn't. I know she's in the wrong in regards to the way she's going about it, but if I were you, I'd ask her if this is all a sign that she'd like to pick up a casual job and get a degree in fine arts, or flesh out her side-business with more time I'd ask her if this is a sign that her day-to-day job doesn't make her 'happy', and, if she's miserable doing it I'd tell her that we'll work together to figure out a way in which she can feel fulfilled while she works. You're doing your PhD so I assume you already have this sort of passion in regards to work/school, because nobody really sticks it out to PhD if they don't.   \n\n\nPersonal anecdote time: My partner has always loved music- he had a guitar from age 6, can play very well, is a trained singer and used to try and write songs all throughout his teenage years whilst dreaming of touring around the world. But, the world sorta broke him down and he saw nothing coming from his efforts, so he got a degree in I.T. and went on to work full-time as a technician- for years he said it was fine, and then he hit 30 and had a bit of a drunken freak-out, saying he 'never thought he would have to settle when he was a kid, but everyone just works until they die, how depressing'. Well, fuck that I say- I'm a school therapist and I love going into work everyday, my work's fulfilling- I want him to have that.   \n\n\nSo, I bought him a pretty nice acoustic guitar as a belated birthday present- I encouraged him to seek out a part-time job and once he found one, he should quit because I don't want him working in misery ASAP. He found work at a bar, we moved to a cheaper suburb in our city and he quit. He was absolutely *ecstatic* and he started to remind me of the guy he was when he was 24! When he wasn't at the bar, he was practising and trying to write music. After a few weeks he sought out a busking license and started doing that in the city centre, performing to pedestrians, and he made decent money! People would crowd around him and not leave until songs were over. People would request songs that they loved- we didn't have as much money as we used to, but he was so much happier every day which is worth its weight in gold. Skip two years and he's busking, tutoring kids in guitar and making passive income on a couple of lesser known (but well liked) albums he's released & playing local gigs (and all this tied together is about as much as he used to make) expect he doesn't have a crushed soul.  \n\n\nSorry for the ramble. If you love her, you'll work with her to ensure that she has a happy life in work and other ways, or else, what's the point of life? You might have to make some financial adjustments, but I think it's well worth it. ",
            "You should nip this in the bud (either get her to reign it in or leave) before she becomes Jan and you become Michael. ",
            "It sounds like she has a passion and she’s trying to pursue it. A lot of artists struggle with how to make the jump and commit themselves to full time. Maybe think about it from that angle. ",
            "So you haven't even talked to her about your concerns yet and you're already thinking about leaving... I'd rethink that engagement",
            "Could she not have a compromise of working in a flower shop or something ... 2 birds one stone",
            "Encourage her to pursue it as a hobby not a money making investment/gig. IF it becomes something then she can totally consider it PT work or something and include that when you bring it up so you're clarifying that you believe in her and are considering her ideals. \n\nMaybe also remind her that there are TONS of \"gig\" options that can pay pretty decent and some might fall in line with things she likes and that could be an option to help build some more money in the meantime while still being happier. Good luck.",
            "Encourage her to apply for a real sales job. She sounds like she could make a killing! I am a woman and I sell cars.  I love my job and I'm happy with the money I make. Sounds like your fiance would kick my ass. If she is going to spend 40 hours week selling something it should be lucrative. And I bet would make her happy. They are always looking for women in the car biz!",
            "New business ideas like this need time and money. My mum has an Etsy business that does incredibly well but it didn’t from the start. She didn’t have a job beforehand so she had the time and patience to make her Etsy grow. She also had to have a lot of money up front for materials to make her jewellery which was quite expensive. She has over 3000 sales now for items that cost anymore from £20-£70 but the amount of TIME and research she put into it wasn’t something she could do if she had a full time job. If she’s serious about it, she needs to ensure she’s making enough money to quit and make this her full time job ",
            "I bet you a paper cut she will quit her job after the wedding and burn out if nothing changes. Please be wise,  get a prenup. You also have needs that should be respected. she must to give you the love and attention that you think is fair. this will only get worse if ignored. \n\nShe could change her job, work a part time and devote more to craft. If she develops her product designs into something worth more money, does weddings, teaches classes, and gets into more craft shows it will be ok. You can make money in these things but it's tricky. \n\n&#x200B;\n\nShe needs to look at the whole cost, paper to sale. how much do materials cost? how many hours? do the math and look at how much she's really making per hour. On her best week I'm guessing 1.50/hour. This usually helps begin the plan. \n\n&#x200B;\n\nShe will cry and say you don't love her. Don't fall for it. Stay solid and practical. all couples have problems. Good couples work things out fairly. ",
            "It sounds like she really enjoy's her hobby and intends to turn it into a full time job. Maybe I missed it, but does she enjoy her day job? Maybe she's miserable in the work force and has found a passion in paper flowers. If so, you should support her. It may take time, but she could potentially become successful with her side hustle. If she serious about this, you should support her. \n\nBe happy she's not selling crap for some MLM company.",
            "I have a bit of a different perspective. I joined an MLM and tried really hard to make a go of it. It was very out of left field for me to do this, and I took a year of unpaid leave to pursue it, which in our case was acceptable financially.\n\nMy husband supported me continually, not in a \"yes, quit your job and do this!\" way but a sort of \"I believe in you and won't hold you back\" way. If he hadn't, I'm not sure what would have happened to us.\n\nAs it stands, I stopped the MLM, gratefully took the lessons I learned from that, and am much happier with my day job now.\n\nBut it was 3 years that I'm shocked my husband was able to support me through.\n\nI wouldn't judge you if you're not willing to stand by her through this, but when my husband was able to do that for me I can't tell you how much it meant to me. To know that I could do something that society views as possibly slightly less bad than prostitution, lose money at it, give up tons of time and my social veneer and still have him support me was incredible.",
            "Your fiancé reminds me a lot of myself. When I started my business, selling on Etsy and other marketplaces, I worked at it around the clock. Lived and breathed the stuff. I didn’t skip work, but when I was off, I invested all my free time into my brand. Now I’m incorporated, making more money than I ever did at my old job, and happier than ever.\n\nThis is what starting a business looks like. If you’re not working hard enough that it causes other people concern, you won’t make it. With her drive, I think your wife has what it takes, based on your description. \n\nYou said she’s skipping work; to me, that sounds like she hopes to make this hobby a full time job. She just hasn’t told you yet. Maybe because she thinks you won’t believe in her. \n\nTry supporting your fiancé. Ask her about her goals. She’s found a passion and that’s a good thing. ",
            "It would be good to not belittle or dismiss her ambition and obvious drive (not obsession) to start a business.  This is no longer just a hobby.  It sounds like your partner has found fulfilling motivation to go down the entrepreneurial path.  Starting a business is hard whilst in a relationship.  Often it's not a 9-5 effort, it's tends to be a heart and soul effort if it is to survive.  She's probably learning a lot about business in the process, and while it may only be paper flowers today, it may possibly turn into 50 things in the future on a successful Amazon partnership, for example. OP, tell her how you feel about the relationship needing more attention but also try to help her with guidance, suggesting other things to sell, etc.  ",
            "Your fiancee is unhappy with the day to day life that you think she's neglecting.  Whether that's just her job, your relationship, whatever... you need to get to the bottom of it.  It's a very real possibility that her \"real\" job isn't the priority to her that it is to you and that she doesn't feel fulfilled by it.",
            "I think she needs to be encouraged to continue her business on the side and over time, if it is able to scale effectively then reevaluate and potentially do it full time. Life is not about choosing the path that nets the most cash it’s about finding fulfillment and happiness. I would be devastated if I were her to read this post. Though that’s not to say it’s acceptable to avoid responsibilities but as her fiancée it’s your responsibility to help her find the right way to continue finding value as well as continuing to maintain her current work, I’m sure she would help you do the same",
            "Maybe she really hates her job in corporate strategy and sees the paper flowers business as a way out of that? Talk to her from a place of concern and kindness and try to say (if you feel this way) that, whilst you are really proud of her for dedicating so much of herself to a new interest/hobby/side hustle, you’re worried that her priorities have shifted in a way that could be potentially really bad for her and your relationship ie getting fired. Ask her to think about why she has become a little obsessive about the flowers....is it to mask something else going on eg trying to figure out what her true passion is. Good luck.",
            "Try and figure out a way to small scale manufacturing, more flowers less time and effort. I know it sounds like you’re enabling something that seems self deprecating, but in the end she’s happy doing something that she enjoys. Plus trying to design a flower that’s more time efficient to make is a pretty good challenge. \n\n\nI myself have used my friends as inspiration (jealousy) to try something new. Heck I learned how to play guitar because of it as well as getting in shape and becoming way more organised.  \n\nHelp her find a better balance, help her organise her time. After all isn’t support part of the relationship deal. It’s a hobby that’s hopefully gonna pay itself, like my music gigs on weekends. Don’t get me wrong I’m studying full time and have other commitments at work and volunteering, I’m always busy but having someone there with you is far more fun than to have someone telling you it’s a waste of time. ",
            "When the heart finds true passion, it is a sign that life is going good. Life is about finding happiness. For some, that happiness is a steady job and a house. For others, it's being a starving artist doing what you love. \n\nI know it's hard for you OP, but ask yourself if you'd rather your fiancee be truly happy doing something she loves, or be miserable working somewhere she doesn't want to.",
            "Life separately for 12 months, that may indufe a wake up call.",
            "Personally, I think you guy should have a talk about it, i mean have an actual conversation, non aggressive. Because she might love doing her craft more than working her everyday job. She wants to play it safe because she knows selling flowers isn’t lucrative just yet. That’s just a character of someone that would like to own a business of her own. \nJust have a talk and bring to create a balance, she probably doesn’t tell u she skips work because of the fear of you being negative or discouraging. Have a conversation and help her to create a balance and manage her time well. But don’t kill her drive... ",
            "Anecdotal, OP: my father is the Vice President of an extremely successful company with state contracts. He makes ridiculously good money and is from an outside perspective a very successful man. He's also really creative; a lifelong musician, artist and a passionate hobbyist woodworker. For years he has talked about walking away from his lucrative corporate job to explore more creative endeavors. Whenever his stress level is amped up he begins to obsess over these fantasies of quitting his job and recently he was diagnosed with some medical conditions and he keeps talking about walking away to sell handmade woodcrafts on etsy. \n\nIt sounds like your partner is going through something similar. You mention that she doesn't make much money at her high pressure job. Would it be feasible for you to carry the burden of household expenses for a short time to allow her to explore this creative outlet and perhaps give her time to transition to a less stressful job? I know it may not seem like the most logical move for her to leave her steady job to make paper flowers, and it probably isn't, but I suspect this side gig of hers is filling a void and supporting her and encouraging her to find a (real)job better suited to her skills now will probably make for a healthier relationship in the long run. \n",
            "She'll eventually get over the initial zeal and have a huge stock of flowers to sell at a more relaxed pace.",
            "Have you, and I know this is a radical suggestiong, tried *talking to her about it??*",
            "Hahaha your post made me laugh out loud!!! I think you're sooo lucky to have a front row seat to creative passion!!! I'm 44 and experienced something similar when i made my first album. I got totally obsessed, and in the end it sold around 20,000 copies. No it didn't make me rich, but that one spurt of obsessive creativity put my status as an artist on a level i wouldn't trade for a secure corporate job. If you're financially dependent on her, then maybe you should get a side gig, but don't stand in the way of someone's creative dreams. They will blame you forever.",
            "Communication is the key. Talk to her and tell her she can keep her business but she also needs a stable income. ",
            "Maybe she's doesn't really want to get married to you and she's living in a state of denial. Just a thought.",
            "Sounds like shes burnt out with the normal 9-5 grind. \n\nYou gotta ask yourself now, are you ok with supporting her at a fun but nearly zero money job for the rest of your careers? Ie are you okay with being the one that makes the money, while she goes off and does a fun \"job\" that makes little to no money? \n\nIf so: great! If not, you really need to tell her this NOW before it ruins your (future)marriage",
            "You've got lots of good advice about sitting her down and having a loving but frank talk with her about how her actions in respect to her flower business is damaging right now. So I'm not going to rehash that, but I do have a suggestion that you could pitch to her along with your talk.\n\nYour GF needs to find the niche her flowers will work FOR her, so she's not working for them. Right now, she's working for them and that's bad. I would suggest she look about how to present her work for wedding bouquets and displays - there is BIG money in the wedding industry and if she really throws herself into perfecting wedding bouquets, displays & favours, she could do REALLY well. I know I would absolutely consider beautiful paper flowers which I could them preserve in a shadow box or display permanently as a memento of my wedding for example. I'd also consider beautiful paper flower wedding memento displays for people who I know have a personal involvement in my marriage, like my in laws for instance.\n\nIf GF does some research into what the trend is in terms of looks for wedding bouquets, what's selling hot on Etsy in that category, comes up with some solid designs and commits to presenting them well on Etsy and locally (which is going to involve learning about SEO, taking great photo's, writing great descriptions - storytelling is HUGE on Etsy for example, people don't just buy a product, they buy a story and experience) - There's definitely a potential for her to not just make a little profit, but to actually build a business there. She needs to plan her work, and work her plan. What she's doing right now is just chasing, and you never catch success that way.",
            "This reeks of my hypomanic episodes... I have BP2 so it isn’t terrible but a full blown manic episode does this exact thing. This is the first thing I thought of when I read this post.",
            "I understand your concern about finances, and i think the other folks here gave enough advice about talking to her about it. But, as a creative myself, I think it's really important that you support her artistic endeavors. It doesn't necessarily have to be her paper flower business; maybe you can ask her to teach you how to paint, or something of the like. Believe me, it would mean so much for her. \n\nI wish you the best in your relationship! ",
            "if you cannot accept the girl, just leave it, find other one that you can accept.  \ni married 2 times so far, 2nd marriage is work out because of we speak everything out. i mean everything. we not hide anything, even if i have crush in my office i let her know, and we speak about how to solve it. If family is important to me i find another job. attraction chemistry is nature, you cannot avoid that.  \n\n\nSolution to your \"problem\".  \ni assume you don't know her well enough. you should encourage her to do what ever she will happy to do for the rest of her life. Trust me, nature of woman is to nurture, man are bread winner and guardian of his family.   \nWe are human being the greatest design in entire universe. you need to let your feeling speak and let your heart hear. you will find the answer for everything. ",
            "I'm also an artisan. The first month, I made only around 100 bucks. Now I make my living out of it. It took hours and hours of work and effort and it was TOTALLY worth it as I was never happier with my professional life. To me it sounds like your fiancee has found her passion and you are being very unsupportive. I saw people calling it a \"hobbie\" in the comments, and well, maybe it's not a hobbie to her. She's probably feeling unhappy at her day job and is looking for something that makes her want to wake up everyday, and it looks like she found it! Great! Of course she'll not be making buckets of money right from the start, but it looks like she's doing very well and willing to put on the effort. It takes time, but this could be great for her. You should support her instead of putting her down.",
            "Has she been talking to you about having kids recently? Sounds like she’s prepping for a time when she won’t be able to work full time.  ",
            "[removed]",
            "[removed]",
            "Step you’re Game up make more money and be the Jim to her Pam. You’re sounding like a real Roy Anderson ",
            "[removed]"
        ]
    },
    {
        "post_id": "4b1tfx",
        "author": "exflingspreadingrumo",
        "title": "[UPDATE] By sheer coincidence, I [25F] just started a new job and happen to work with someone [25M] who I had an awful one night stand with 8 months ago. He's telling everyone I'm crazy, and I'm not fitting in at all.",
        "url": "https://www.reddit.com/r/relationships/comments/4b1tfx/update_by_sheer_coincidence_i_25f_just_started_a/",
        "score": 2393,
        "num_comments": 60,
        "created_utc": 1458362064.0,
        "selftext": "[Original post here](https://www.reddit.com/r/relationships/comments/48w633/by_sheer_coincidence_i_25f_just_started_a_new_job/)\n\n**tl;dr original** I had an awful one night stand with this guy Eric. I basically got very drunk and started crying after sex on our first date. Just started a new job, and guess who works with me? Eric. He is telling everyone what happened between us, and I'm very embarrassed.\n\n\n--------------------------------------------------------------\n\n\nThanks to everyone who responded to my original post! Most of you told me to keep my head high, own what happened, and focus on my work, and that's exactly what I did. To those of you reminding me to tell my boyfriend, I actually already had, and he was supportive and sympathetic to my situation.\n\n\nAnyway, you guys were right, I just had to wait for things to blow over. It's been about two weeks since I posted and one month since I started my new job. I made a really diligent effort to be really helpful, friendly, and hardworking, and it worked! I'm getting along with all my coworkers now, including Eric. I no longer feel paranoid that people are whispering about me being crazy or anything. \n\n\nIn fact, what inspired me to write this post was that Eric and I had been assigned to tackle a project together. Yesterday we both had to stay late to wrap up a presentation we had been working on for a while, which was the first time we had ever actually been alone (well, besides for the time we had sex). \n\n\nI was nervous about it but determined to just focus on work and get through it. But we had a little downtime while we were uploading our presentation/video to the server and we started chatting, at which point I made a self deprecating joke \"If this thing crashes I might just burst into tears again.\"\n\n\nHe laughed at that and we ended up clearing the air. He first started by apologizing if he or anyone at work had made me uncomfortable. And then he described our Tinder incident last summer, but from his perspective:\n\n\nBasically, he had actually just downloaded Tinder that week over the summer when we started talking. I was the first person he had ever talked to or gone on a date with through the app. His work friends were actually the ones who encouraged him to download it, so they knew about me and our planned date almost from the beginning. They were actually the ones who suggested the beer festival. \n\n\nSo, we have our date and it goes horribly, and of course on Monday everyone is asking him how it goes. And he basically explains to them what happened, and they all laugh off the situation with how awful that must have been, and how it sucks that that was his first date, and maybe Tinder just isn't for him, blahblahblah.\n\n\nSo when I first start working there, they ALL already knew who I was, from way back summer. Which is actually kind of a relief, because it means that Eric didn't immediately see me and spill the beans to everyone like some jerk. \n\n\nEric and I then cleared the air and said that from getting to know me over the last month I seem very cool and professional, and he hopes that there is no ill will between us. I said definitely not, I don't blame him for what happened. I explained very briefly about how I was just in a bad place when I met him that summer from losing my job, and just drank too much, and he said not to worry about it and he totally understands. I'm just glad we were able to address the elephant in the room. \n\n\nAlso, about the one friend I had made previously who told me what Eric was saying. She actually is relatively new to the office also, and *wasn't* around last summer when this Tinder thing happened. So from her perspective, it looked like Eric was spreading a fresh rumor, when in actuality people were discussing stuff they already had known. \n\n\nSo yeah! Things are good!\n\n   \n**tl;dr**: Everything blew over on its own, I just focused on myself and getting work done. Eric and I ended up clearing the air, and he said that our coworkers were actually the ones who made him get Tinder, so they knew about me from the very beginning. No malicious rumors were intentionally spread, and everybody is on good terms now!",
        "permalink": "/r/relationships/comments/4b1tfx/update_by_sheer_coincidence_i_25f_just_started_a/",
        "comments": [
            "[removed]",
            "> which was the first time we had ever actually been alone (well, besides for the time we had sex)\n\n\nLaughed at this. Good for you OP! I was worried from your original post that you had been thrown into some cliquey and gossip-fueled work environment, but this really just seems like an innocent misunderstanding. Yay!",
            "This is a great update and I'm really happy things are going well for you now!\n\nKeeping yourself professional, positive, and helpful at work has shown people that you are more than a friend's funny anecdote. You are an asset to have on the team. I'm glad that you and Eric got to clear the air.\n\nYou should also be thankful to the newish coworker that told you. She might end up being someone who likes to gossip, but if she was just giving you a heads up about what people were saying, I know I would appreciate it in your situation. \n\nIs your bf happy that things have blown over? Some people would have trouble with their partner working with someone they've slept with. ",
            "That joke took some stones.  Badass OP.  How could anyone think badly about someone that cool.   ",
            "Well it's always good to read a nice reasonable update. Glad things worked out for you OP! ",
            "Awesome, I'm glad things have worked out for you, OP. Good luck at the new job, and keep holding your head high!",
            "So great to hear about such a positive outcome after a horribly icky initial situation.  I'm so glad things have worked out for you, OP!",
            "At least this is a good update! Make sure you and Eric keep it professional from now on!",
            "Your update just make my smile. Love to hear a happy update!",
            "OP, work in a place long enough and everybody will have gossip about everyone else eventually.  ",
            "That's awesome. And I'm just dying of curiosity, does Eric still use Tinder? ",
            "This is a great update, happy for you OP! ",
            "Soooooo... second date?",
            "Eric's still a dick, though.\n\n\"Hey, who's that new girl who you obviously know?\"\n\n\"A friend of a friend I met at a party once.\"\n\nThe end.\n\n\"Hey, who's that new girl who you obviously know?\"\n\n\"The butt of all our jokes for the last eight months! Luckily, she's not also a human being or a professional or anything, so no worries about making her feel like shit in a new environment. Ha ha ha, remember that time she cried after sex with me? Good times.\"",
            "How could everyone know who you are from tinder? Eight months later they remember your picture that somebody showed them once? I believe eric is just covering his ass, sounds like a douche. ",
            "So when you two start dating again, fall in love, and write a movie script that is a hit Rom-Com, make sure to remember us.",
            "\"So when I first start working there, they ALL already knew who I was, from way back summer.\"\n\nThat story doesn't add up. Eric may have regaled them with his one-night stand story in summer. However I really doubt he told them your full name or provided a photo. If he did, he's a complete creep and weirdo. It's one thing to mock a stranger sexually, but it's another to provide full photos and names to your co-workers.\n\nIf he didn't go that far, how on earth would anyone recognise you when you came in to work months later?",
            "On the one hand, good thing you're feeling better but on the other, if I was your bf and you were at work clearing the air and being buddy buddy with a dude you drunkenly fucked half a year ago I wouldn't necessarily feel too swell. But every relationship is different I suppose. ",
            "[deleted]"
        ]
    }
]