[
    {
        "post_id": "o4zzmz",
        "author": "Immediate_March_6598",
        "title": "(UPDATE) My (36M) family is upset I'm 'prioritizing' my BIL over my niece after my sister (27F) cheated.",
        "url": "https://www.reddit.com/r/relationships/comments/o4zzmz/update_my_36m_family_is_upset_im_prioritizing_my/",
        "score": 2395,
        "num_comments": 216,
        "created_utc": 1624295151.0,
        "selftext": "Link to original [post](https://www.reddit.com/r/relationships/comments/nsbhlr/my_36m_family_is_upset_im_prioritizing_my_bil/)\n\nFirstly, thank you everyone for your comments, messages, insights and support. It really helped me strengthen my resolve and find solace in what I was doing. I'll address a few concerns/questions that popped up before my mini-update.\n\nYes, Bill knows Jane is his. When Tom got his paternity test done, he and Bill had him go separately to be tested.\n\nWhy am I letting Tom stay with me? Well..he was family for years and for me, you don't just chuck family onto the streets except for extreme situations. Divorce takes a year in my state and Tom is opting to stay to make sure it can all be handled quickly and smoothly to get it finalized as soon as possible. That said, he plans on moving back to his homestate after that so I am letting him stay with me so he can save money for his move and moving expenses. Otherwise, the only places he could afford on his own require 6 and 12 month leases.\n\nSupporting Tom and Bill may result in my sister and I having little to no contact. True, it may, and that'll be our crosses to bear but I can't find it in me to ignore others needing help just to satiate her and excuse her behavior. I still love my sister, whatever my feelings or opinions of what she did or is doing have no place in this, nor is it really the time for me to go expressing them to her. Bill's lawyer says its very likely Bill will wind up with a custody arrangement and he has assured me that if things do go south with my sister that she won't let me see my niece, I'd always be welcome to visit them to see her during his time with her.\n\nNow for the update..its not a huge one but rather surprising. My sister is still being cranky and doubling down, doing all she can to guilt Tom into reconciling and adamant about Bill not being involved because 'she has a husband that just needs to realize they can work through this, Tom is Jane's dad and Bill is not needed'. So..meh there. Last week I went on a fishing trip with both Tom and Bill for the three of us to just relax and forget all this nonsense for a bit. Once we got back my mother showed up to try talking to me about why I am doing any of this.\n\nSurprisingly, we had a decent talk after some heated tension. I wound up showing her the post and while she wasn't happy I was airing our laundry, it helped a bit. Ultimately I was able to get it through to her that given the circumstances and the high probability Bill is going to be a presence in Jane's life from here on out, the best thing for Jane would be if our family and Bill could at least co-exist. I asked her how she would feel if her granddaughter was constantly having to choose who to spend time with for birthdays, graduation, prom pictures, etc, or gods forbid, we all put her in a position that she would have to lie to everyone about what she wanted just to not hurt feelings. It took a while but that seemed to at least get through to her a bit. She's still not happy about the whole situation, but she did agree to a dinner in a public place to meet Bill and some of his family and I'm happy to say that that wound up going off really well and Bill's mother had a good heart to heart with her. So, some progress. Thanks again everyone for the support.\n\nTLDR: My sister is still trying to pressure my BIL into reconciling and mad at me for supporting BIL and her daughter's father, but my mother is at least making some progress towards accepting my niece's biological father.",
        "permalink": "/r/relationships/comments/o4zzmz/update_my_36m_family_is_upset_im_prioritizing_my/",
        "comments": [
            "[deleted]",
            "Damn. \n\nSo your sister lied to both of these men for years and now expects them and everyone else to bend to her will? It sounds like you, Tom, and Bill have Jane's best interests in mind more your sister or parents do. \n\nKudos to you for doing the right thing.",
            "I'm still surprised anyone is listening to your sister.    \n\nShe married Tom, cheated on him with Bill and became pregnant (unbeknownst to Bill), and then decided Tom was who she wanted to be the father. She doesn't get to decide that ffs. If I were Tom I'd skedaddle too, and the fact that Bill contacted them to stand up and be a father speaks to his character. Maybe it will rub off on your sister.     \n\nYou are a great person OP. You actually seek harmony and what is best for Jane. She is lucky to have you :)",
            "Are Bill and Tom going to slowly transition father roles so Jane doesn’t end up with abandonment issues ? Maybe they can slowly pull Tom out of her life if he played a big role and then get Bill in there full time so she can have a bond with him",
            "OP, you truly are a stellar human being.\n\nIf you are not a counselor or mediator, you should probably look into it as an alternative career.  Just amazing how you brought everyone together.\n\nHugs to you.",
            "As far as I’m concerned, you’re doing everything right. Helping out Tom and Bill is a good choice. Good job.",
            "The mental gymnastics by your sister and anyone who supports her reasoning and way of thinking makes my head hurt.\n\nProps to you though my man. You are an amazing person and are 100% doing the right thing.",
            "I totally support your decision. My brother cheated on his wife/ left her for a 19 year old. I supported her after. I wasn't mean to him, he is still my brother, and I understand we all make mistakes. But she is the Aunt to my children. They all know and love her. She had every intention of being married to him forever and was a good wife. She was a great friend and sister in law. She's STILL a great friend. I was recently a bridesmaid (just me and her sister) in her (very small) wedding. My family luckily agreed. My brother made a vow, promised to love her and be loyal. HE brought her into the family and promised it was now hers as well. We all took that seriously.",
            "How is Jane doing in all of this? It must be hard when your dad disappears one day. Is she ok with it?",
            "Anyone else really confused that he called his BIL Tom and the other guy... Bill.",
            "Her actions caused this, not your reaction. I still talk to my ex BIL even though my sister didn't want me to. That's not her call to make.",
            "OP, you are very admirable. You are doing the right thing and it is obvious that you, Tom, and Bill care more for your niece than your sister. You really make me hopeful for the human race. \n\nYour BIL, Tom, how is he taking all if this?\n\nThe three of you went fishing, so obviously Tom is okay with Bill now.  What were Tom's feelings about Bill when Bill first contacted him?  I try to think what I would think in Bill's place. If there had been no signs, clues, or red flags about my wife cheating I suppose I would not believe Bill at first.\n\nAlso your sister didn't tell Bill she was married when they began the affair? So Bill just thought she was a regular GF and only broke it off because he had to move away? \n\nI guess Bill thinks that he must have dodged a bullet. \n\nMan Tom will be totally left out of this when he moves to his home state. Does he have any friends or family there that can be a support network for him? \n\nAlso how long were your sister and tom been together, dating and marriage?",
            "Did I miss it or did noone mentions TOMS family? Like they were grandparents and ( possibly uncle's aunt's) now all of a sudden nope! Not ! How sad for all involved - bills parents were mentioned but they gained a grandaughter ....",
            "You're doing wonderful. You're helping both Bill and Tom through a time that could have been far darker.\n\nYour sister is being quite entitled. She cannot dictate what Jane, Tom, Bill or you do.\n\nI hope Bill sues for full custody and settled for joint. Your sister sounds controlling and manipulative. What matters is not just what she wants but what all parties concerned want.",
            "I hope Tom doesn't fall, he needs to get rid of the snake that is his sister.\n\nBill really has a right to be close to his daughter.",
            "Jesus Christ poor Tom. I’ve seen similar stories from other “Toms” and I gotta say, they’re scarred for life. To raise a child with your wife and suddenly realize that everything was a lie; she’s not yours and your wife has been cheating all along. I can’t judge anyone for whatever they decide to do after that. You’re a wonderful guy for helping him out at the worst point in his life and bringing everyone together",
            "Cheating sucks.\n\nYou sister hasn't earnt anything but expects everything. If anything she owes a lot to the people around her for how she's treated them. \n\nYou're not betraying her at all. You're allowed to disagree with your family. \n\nYou're not doing anything wrong buddy. \n\nPeople need to learn that actions have consequences. She might have an underlying issue causing her to act out or seek attention elsewhere but she needs to make the effort to accept the consequesnces of her actions before she deserves any support.",
            "Honestly I've been here with my siblings before. My brother cheated on his wife, I knew and she didn't. She was one of my best friends, but I would have told her even if we weren't close. He hasn't really talked to me since they divorced and her and I are still friends. \n\nAnother brother is verbally, mentally, and emotionally abusive to his SO and kids. I have helped get her out of his house when they wanted to leave and she didn't have a way to leave. They are still together because it's very hard to really leave an abusive relationship and him and I only talk because i want to make sure I'm \"allowed\" to be there for my SIL and their kids bc she is isolated from everyone else who could help her if she ever decides to really leave. \n\nIn these situations and in yours, we know what's right and are willing to do that regardless of what other people who want to enable negative behaviors might thing, and there is power in being able to stand up for what you know is right. I know family is hard especially when they're in the wrong and you stand against it. But it's worth it because the victims in these situations deserve better.",
            "Poor Jane\n\nAt least your families seem to be working through this with love, your sister notwithstanding.  \n\nBut poor Jane :(",
            "You're doing the right thing, even in your first post with supporting Tom. Your sister needs to get it through her head that Jane is not Tom's daughter.",
            "Man, you, Tom and Bill should try for custody of Jane and your sister can go kick rocks. 3 men and a baby style. Jane'll have multiple family groups, 3 dads who get along for co-parenting and love her very much, and a mom who's around sometimes I guess.   \nAll jokes aside, it's awesome you're stepping in to help facilitate a setup that'll hopefully work out well for the kid. Nobody deserves to be stuck in the situation you were in and you're doing what you can to help keep that from repeating.  Helping out Tom, allowing Bill in, and helping the family overall cope with the situation instead of hurting a little kid for the rest of her life just to appease some social expectations. Your sister needs to get on the same page as to what's good for everyone involved, not just what she wants. Good luck on that bit.",
            "Wait, maybe I missed this part somewhere. Is Tom still planning on being in Jane’s life after he and your sister get divorced?",
            "Youre a profoundly good person. Your sister, however, is not.",
            "You are an angel, seriously. You took your experience on this earth and used it to help another person have it better. Not everyone does that, but you did, and that makes you an amazing human. Your niece may not ever know what you did for her, but in my eyes it’s a huge deal that made her future brighter. Thank you for being you.",
            "Keep fighting the good fight, OP! You’re walking the right path, keep going.",
            "Thank you for sharing this update. It sounds like your niece is blessed with you, a caring uncle and a  father  that definitely  supports you maintaining your relationship with your niece.\nI really admire your efforts to read all the comments, including mine that were blunt, and working through the complexity of this situation. \nAll the best",
            "There are good people on this planet and OP, you are one of them.\n\nIt's heartening to me when I come across them.",
            "IMO, you’re doing the right thing. Your sister is being unfair to her daughter & your BIL. He’s the only father she has known so I’m sure she can’t understand why her mom is keeping her away from him & you. I don’t understand why Tom is dealing with Bill but that’s his choice. It’s good that Bill wants to be in his child’s life. If I were Tom, I’d head back home & give Bill no fight to remove my name off the birth certificate. Your sister is dead wrong. Your family is too IMO. But that can be resolved if/when Tom goes back to his hometown.",
            "[removed]",
            "Damn OP I love your resolve through all of this , makes you seem like an attractive person",
            "[deleted]",
            "Does Tom have any contact with Jane and your sister?",
            "I just want to say you're doing a really good thing for your Niece, even if she is too young (I'm actually unsure of her age) to realise it now. Visitation sucks. It's so much better when different families get along together. You should be proud of yourself, you're in a tough spot but you're doing awesome work",
            "oh yeah how could you choose the victim over anyone else? /s i mean only an evil person would do that /s\n\n\nscrew the lot of them",
            "You're not hurting your relationship with your neice. She is weaponizing your relationship with your neice and hurting you both herself. \nYou're a really good person.",
            "What you're doing is impressive, and it's the best way to ensure that your niece has a dad in t he mix when all is said and done. Good on you.",
            "OP, are you married or in a relationship? If so what does your SO think of this situation?",
            "I had something similar happen to me and my ex wife. She had an affair while we were married and ended up pregnant. For a year, I raised my daughter thinking I was the bio father. After finding out the truth, the hard way, we separated and eventually divorced. Fast forward a couple years to when I went for custody for all my daughters, and I was granted custody of three girls under the age of 5. After that proceeding, I adopted the youngest daughter and raised her as my own. \n\nI am not the expert in this situation, but if the two men have a relationship to raise this daughter, I pray for the best. This young lady will benefit from both guys being involved in her life. Sorry the rest of your families are being cows",
            "It seems like everything they’re doing is ultimately in support of your niece and out of empathy from having gone through a situation similar to hers.",
            "You’re doing the right thing!!! Don’t let their petty and bitter energy knock you down! They all know they are wrong. Women being women they’re stubborn. You’re doing well OP good for you and your niece. She’s lucky to have someone like you fighting for her!!!",
            "I'm happy Tom is so CCC (Cool, Calm and Collected) about this. Once someone does something like this to you, a lot of hate, rage and sadness comes boiling out. \n\nDespite his broken heart he's doing what he can to move quickly through this without any mess.\n\nI commend Bill for stepping in and actually trying to take care of his child. Most guys would go \"whew dodged a bullet\" and let the lie continue for the rest of their life. He's inviting a boat load of responsibility cost free.  While it should be standard for everyone, it's not and so props to him\n\nAnd last but not least props to you for doing the right thing. This whole shit-uation could have been a lot worse without everyone's efforts 👏👏",
            "tell her to shut up, she's a disgusting woman and cheating and hiding the baby in unjustifiable you do you my guy and good luck (i hope u dont get mad at me for saying that abt ur sis because it looks like u still love her)",
            "Am I the only one starting to suspect that the parents are responsible for raising such an entitled and obviously sociopathic child amd deserve partial blame for her actions?\n\nAfter hearing how OP's step dad treated OP when he tried to become closer to his other family, these people sound really toxic and dont understand what \"family\" really means",
            "It’s so painfully obvious how immature and selfish someone is when they not only fuck up so big (this is a character defect btw she actively chose to maintain a cheating relationship - disgusting), but then to *tell* the one hurt they can just get over it and move on lmao. Your sister deserves the harshest reality slap in the world, and only after you see the gravity of this set into her eyes, then pull the rug out and tell her she can carry this alone for the rest of her life.\n\nBill deserves Jane and likewise. But if Tom can’t be around her.. then although that sucks, I understand. And maybe with her being so young she won’t be affected or remember him much. But 20 years from now when she’s told about all this, man her mom is gonna be in trouble all over again. She really done goofed.",
            "Your sister is trying to minimise the extreme damage she has caused and instead of trying to be sensitive, admit what she did to herself and everyone else she wants nothing to change. She wants to use all of her social sway in the family to make that happen. She wants to guilt Tom into doing something that is not in his own interest. She wants her family onside to support her in that. It's selfish. I guess it's like if you commit a crime and try to cover it up. She's desperately hoping to hide it, hoping it can all just be made better somehow. Reality isn't hitting her yet, probably because she lived a lie so long. She's deluded but hopefully, she will come to her senses. \n\nYou're involved in this, that would be my worry. Very involved. Because something similar happened to you, helping the situation is helping you work through your own trauma. Be very careful with that because seeing things through the lens of our trauma can cause us to lose perspective. And losing perspective here could make you lose out on family. So I think being very clear and knowing your boundaries is important. \n\nHaving said that I believe you are doing the right thing for Bill and Tom and your niece. For your family. You're just not feeding into the narrative that what your sister did doesn't change things - it does. You've spoken to your mother and the reality that Bill will be a part of their lives is sinking in for her. But she probably still needs to see, and your sister maybe needs to hear, that you love her. That you doing this doesn't mean that you love Tom more, essentially. You think her thinking and actions around this were wrong and you know she is hurting and her life is falling apart right now. By doing what you are doing, you are having her back. You're not stopping Tom from coming back to her but the reality is, he is divorcing her, he has good reason and she needs to accept that. And when she looks back at the situation with some hindsight in the future you think she will be happier and feel better about what happened and how your family conducted itself in a crisis. She can do as she sees fit and you don't want to judge her. But abandoning Tom when he needs some help is what your conscience dictates. \n\nI'd say aswel, make sure and take care of yourself. You're helping Tom but you need to show your family that your loyalty is to all of them - not just your sister. You're trying to accept reality and do the right thing. Your sister is not accepting reality at the moment - but some day she will have to. And you'd be there for her if a situation like this ever arose and her partner had cheated. The damage is done and you're just trying to minimise the pain to everyone from the fallout.\n\nIt's a lot to get across to your family. But long run you're doing what's right for your niece and ultimately, your sister. You also need to do what's right for you so when the time comes and your sister and family need to accept Bill that they trust you too. And some honesty without judgement might get you there. \n\nYou're a good person, and what you're doing is sweet but above all else avoid trauma bonding and being seen as the saviour in all of this. It's not your drama. You're just picking Tom up and dusting him off and sending him on his way. Same with Bill, you're creating a bit of a tendril but he will have to build the branches. Don't be too involved in the creation of that relationship. A voice of reason or somewhere to shelter from a storm. You can't side with anyone here.",
            "OP, you are a saint of saints. You are also some god level mediator to get Tom and Bill to reconcile. I know your sister is the primary cause of a lot of drama, and it takes two to tango, but I would be hard pressed to have any kind of relationship with the other guy if I was Bill OR Tom.\n\nHang in there, OP. You have made awesome progress and no matter what is said seem to be really trying to give Jane the best life she can have given the circumstances. I wish you the best.",
            "Bio dad didn't even know about Jane.  Your sister is awful and you are doing the right thing.  Glad mom is seeing the truth and realizing Bill isn't going anywhere and he's a good guy, and so is Tom.  Poor Tom, imagine, raising what you thought was your daughter, with your faithful wife...then WHAMO...Tom needs to do what's best for Tom and glad you are there for him!  \n\nSounds like the beginning of the 3 amigos!  A blossoming friendship...amazing how much good can grow from something that started as \"bad\".",
            "You have a very good heart sir and both Bill and Tom have found a very dear lifelong friend in you. Standing up to family is hard but you are siding on the side of good and right as opposed to obligation and bitterness. Sending best wishes to all your family",
            "Frankly, your sister is a terrible person, she hurt a man who did not deserve it, her own husband, and committed adultery. Nobody should be acting like this is OK. A family that enables this is just as bad as the adulteress. How'd you end up being the only one with any morals and ethics?\n\nI think Bill should be encouraged to seek 50/50 custody and be a father to his daughter. I hope you spend more time with your biological family and I can only think that that's where you got your good ethics. I'm sorry your family, especially your sister, are such terrible people, I imagine it can be tough to do the right thing when you have people who were so close to you trying to pressure you into doing the absolutely wrong thing.",
            "Nothing like a heaping amount of entitlement piled on top of infidelity and paternity fraud. Yikes.   \n\n\nInitially reading this I felt you may be a little \"too close\" to all the parties involved, but after some careful thought, no - it's definitely a good thing there's someone who's familiar with all involved (maybe to a lesser extent with Bill) in there advocating for the actual victims of your sister's actions. A judge may not handle things quite the way is best for all (but your sister) involved. Someone NEEDS to advocate for these victims, and it seems like you're doing just that, good job sir.  \n\n\nThe birth cert and Bill wanting to take on the father role needs to be documented, heavily. Otherwise, your sister WILL seek child support from Tom, and because he's on the cert and has been around for 3 years, she will probably be awarded the support from him - that paperwork needs to get fixed - ASAP.",
            "OP, you are right in supporting both Bill and Tom. Your sister is upset because things are not working out the way she wants them to be. Too bad. She is the one that caused all of this to happen. Sounds like she has some mental/ emotional issues that would require professional help.",
            "why does your sister want tom to stay married to her? does she get something like insurance from the army cuz tom is a vet? cuz its obvious she isnt in love with him cuz its one thing to cheat, but then to lie to a man and tell him he is the father??? no way could anyone do that to sum1 they love. maybe she just doesnt want the divorce stigma. i wonder how many more dudes she banged. i dated 2 bartenders. both of thems dads owned the bar. if ur woman is hott and a bartender ur relationship will be a nightmare"
        ]
    },
    {
        "post_id": "a57xo1",
        "author": "Hazzie666",
        "title": "[UPDATE] My (24F) father (46M) refuses to come to my wedding because it wont be on \"American Soil\" I'm really upset and my father thinks I'm being overly sensitive.",
        "url": "https://www.reddit.com/r/relationships/comments/a57xo1/update_my_24f_father_46m_refuses_to_come_to_my/",
        "score": 2387,
        "num_comments": 138,
        "created_utc": 1544543310.0,
        "selftext": "Original: https://www.reddit.com/r/relationships/comments/8q63aw/my_24f_father_46m_refuses_to_come_to_my_wedding/\n\n\n\nSo long story short, he isn't coming. He is now saying that he's afraid to get on the boat or he has also said he doesn't want to be on a boat with my mother. (Their split was anything but amicable) He's helped out financially but not to the extent as promised. As I said in the original post...his money wasn't needed but it would be/is helpful. My fiance (now technically husband) and I decided that we would have a small ceremony to be legally married here in Iowa since it was going to cost nearly 9x more to be legally married on the cruise ship.  My father was invited and forgot to come even after being reminded multiple times. It really put where I stand with him into perspective.\n\nThe actual wedding ceremony is just over a month away. Everything has been purchased and the final touches are being taken care of. I asked my stepfather to walk me down the aisle which he tearfully accepted! I'm extremely excited to be spending my wedding surrounded by the people that care about me. \n\nThank you all for your kind words and wonderful advice. \n\nTldr: my father is a coward and isn't coming to my wedding",
        "permalink": "/r/relationships/comments/a57xo1/update_my_24f_father_46m_refuses_to_come_to_my/",
        "comments": [
            ">My father was invited and forgot to come even after being reminded multiple times. It really put where I stand with him into perspective.\n\nHe didn't forget. He's making a conscious choice to not be involved in your life. I'm so sorry OP. \n\nWhen this is all over, consider talking to a therapist. Being rejected by a parent is hard and requires a grieving process to get through.\n\nCongrats on your wedding and I wish you all the happiness.",
            "I guess the ship/your mother was just an excuse he could justifiably use to avoid your wedding.  Once you had it in Iowa, he could only fall back on \"forgetting\".  I'm sorry you had to realize how little your father cares like this OP, but I'm glad you're not still trying to kowtow to him.",
            "Sorry, op. This made me sad. I also had to distance myself from family members for being outright jerks. I'd like to say it gets better. But you're adding better people to your life to compensate. I hope everything goes great! Try to not let it dampen your awesome day!",
            "If you want to be really baller, take a really nice picture with your stepfather as he walks you down the aisle and post it all over social media so your father and everyone else can see it. \n\nI'm petty like that. ",
            "I'm sorry, OP. That must carry so much disappointment for you BUT it also quickly shed light on what the true nature of your relationship with your father will be which I think is good for the long run. To be frank he doesn't sound very stable mentally, and was trying to hold you hostage emotionally, so I am glad you have held onto your plans to have the wedding you want. I think this will also be an excellent turning point for you into your adult life with your husband and any kids you may raise to have firm boundaries with him and redefine the role he can play (read: extremely minimal).\n\nYour TLDR says it all. Hugs to you.",
            "Reverse Davy Jones loophole, fill a bucket with \"American Soil\" and make him stand in it. Or fill his shoes with it and tiny pebbles.",
            "Your father sounds super manipulative. Maybe some emotional distance in your relationship is just what you needed. But it's a shame it came because he was a jerk about your wedding. It's supposed to an amazing time.\n\nAnyway, congrats from a fellow Iowan! ",
            "oh my gosh I remember you! I mean, I guess this wasn't a surprise, but it's still disappointing that he couldn't pull his head out of his ass for one day. ",
            "I hope you have a wonderful, memorable wedding day. Good luck to you both.",
            "In your previous post, is demand that you try really hard to convince him sounded a lot like he realized he's being treated like a dad who wasn't there for a lot of your childhood. And he doesn't like it very much and wants you to suck up to him for a while. He wants tons of attention and to be given the credit for parenting that he didn't earn. ",
            "I remember you! I’m so sorry your father is behaving this way, but it is his loss, not yours. Big hugs to you, and may you and your husband have a wonderful wedding day. :)",
            "OP, congrats on your wedding. Look at your father not coming as a blessing in disguise. You don't have to deal with the hostility between your parents, for one. As a fellow child of non-amicably divorced parents, I can tell you that you'll be grateful when you're not having to run interference or assigning someone else to do it.\n\nEnjoy! You deserve it :)",
            "\"Forgot\"\n\n&#x200B;\n\nYour dad is an asshole. I hope you have a beautiful, drama free wedding day, surrounded by all the people who love you!",
            "Your stepfather sounds like a better dad than your dad.",
            "I'm sorry you had to deal with that. People often forget who the day is supposed to be about! Congratulations and enjoy your special day 💓",
            "I remember your post and I think of it sometimes, thank you for the update. sorry your dad is like this.",
            "As awful as the situation is, the good thing is that you can now begin the healing process. You know where you stand with him and how he feels, and can continue the relationship accordingly. I'm so sorry that you have to go through this! ",
            "I just got to say, congratulations!! Enjoy your ceremony, and don't worry about your 'father'. Sounds like step-dad has it covered. ",
            "His attitude is a poor effort that shames America.  Nationalism makes a weaker nation.  You don't need such ignorance in your life, especially around such a special time for you and yours.  Good luck with the wedding.",
            "My father was invited and forgot to come\n\n&#x200B;\n\nAren't you glad you didn't waste your emotional energy trying to placate him.\n\n&#x200B;\n\nCongrats! Have a lovely cruise",
            "Mine didn't come either because he \"couldn't afford it\" Which was complete fucking bullshit because him and his wife could afford to eat at nice restaurants 3-4 times a week. I'm pretty sure his wife was upset because I told her I would be having my step father walk me down the aisle instead of him so she made the decision they wouldn't be coming and chose to blame it on money like cowards. The people that are meant to be there will be there and that\"s all that matters. Focus on the positivity and enjoy your day!",
            "I love it. You're the \"sensitive\" one, but he's the one pitching a baby tantrum.\n\nI wish you a wonderful wedding(s) and a wonderful life! You deserve positivity and love from people who deserve to be in your life without all that drama and, frankly, stupidity.",
            "r/raisedbynarcissists\n\nA sub you should check out. ",
            "One question do know if your father is going to run into legal trouble and do alshame to admit it ? Like can be on probation ? ",
            "Your dad is being a selfish ahole for sure.",
            "Congrats on your upcoming wedding OP! That being said, I can relate to having an uninvolved and cowardly father--it's best he's not there in the first place. Anyone who can't even be bothered to come isn't someone you'd want at your wedding anyway.",
            "Whatever Insecurities he has .. the inability to see how well you are all doing without him he should be able to put aside for one day . As a person let down by a parent constantly I suggest this mentslity accept they will be in your life but only on their terms and u accept that's them or if too toxic for you then you put in some boundrys or walk away",
            "Tell him to dig up some soil and bring it with him",
            "That's such a petty, dumb reason to miss out on an important moment in your life. If he's really not willing to put that aside for your special day, he doesn't deserve to be there. ",
            "So I guess your Stepfather is the real MVP here. Biology is important, but not necessary. It must of been so surreal for him to get to walk you down the isle considering his reaction! \n\nBest wishes op!\n\n",
            "Send him an \"uninvite\" card. Rather than jumping back and forth through hoops and such. Just so him your fed up and look forward to not having him there. Seems like he'd rather make your life difficult holding to grudges and not allowing himself to have the patience to deal with other people or situations different than what he is accustomed to.\n\n\nAlso charge him a fee to view the wedding tapes and send his money back.",
            "My dad didn't come to my wedding in Thailand, I honestly think he's afraid of flying / getting some horrible Asian disease.\n\nReal pity he didn't come, he would have been able to spend two weeks with my little brother the month before he died...",
            "I'm so happy for you that you have a step-father you love so you can have him walk you down the aisle.",
            "Your dad was a deadbeat growing up and now he’s still a deadbeat, shocker. You probably wanted to assume the best of him, sorry it didn’t go the way you planned.\n\nI’d keep him away from any future kids.",
            "Yikes, such stupid nationalistic pride. Sounds qwhite rwhite ",
            "Oh jeez I remember this--I'm so sorry your dad is being a jerk, but you are probably going to have way more fun without him.",
            "\\> My father was invited and forgot to come \n\n&#x200B;\n\nHe did not forget. Is that what he told you? Because it's bullshit. He skipped out on purpose.",
            "Showing up would require getting a passport, which I presume that he doesn't have, and which requires a lot of paperwork and follow-through that it sounds like he isn't likely to be able to pull off. With only a month remaining, the odds of getting a passport back that quickly from the State Department are pretty close to zero. So he probably can't change his mind now even if he wanted to.",
            "This is a risk you take when you have a destination wedding.  It's sad that your father wasn't up front about his hangups before you booked the accommodations, but he is his own person, and he gets to chose whether or not he leaves the country, not you.",
            "Who the heck cares on what soil you get married on?? Isn't the marriage itself what's important? I'm sorry to say this since he's your father but talk about nonsense.  Is he like a third generation war veteran and every male in the family tree died at some war or something? Maybe then I would kinda understand.",
            "he may have an overwhleming fear/phobia about being on a boat, and also be unmcomfortable admiting it. That is a very terrifying thing for many people. Perhaps additional communication could help you both get on the same page. ",
            "I am sure he loves you but maybe the split from your mother is too difficult for him to bare and cannot be in the same vicinity as her. It's a shame but i doubt he is doing it to spite you. everyone is calling him a coward but they dont know what he is going through. it's sort of sickening that people can just discount his feelings. He said no, and he means no. he has his own reasoning so maybe try and listen to him for once.\n\npeople on here live in black and white. a lot of the advice you have been given is absolutely atrocious and written by petty people who cannot look outside themselves.\n\n",
            "Lame excuses are used by people with social anxiety as well as selfish assholes.  I'm not saying he's a good guy with mental health issues, just that it is possible.",
            "Americans are fucking nuts lol. What a weird hangup. ",
            "\nSeems like it was really the boat issue that keeps him from joining you. Maybe he thinks it's not natural to be on a boat in the middle of the big water.\n\nEither way, thank him for being  your father and let him know you'll miss him at the ceremony.\n\n",
            "Sometimes parents are like\nBabies. You got to sweet talk them. They need to feel wanted.   Men in general. But even more parents ",
            "[removed]"
        ]
    },
    {
        "post_id": "34zqre",
        "author": "lottowinerthrowaway",
        "title": "[UPDATE] I [21F] won the lotto a while ago and my family [24-58 M/F] found out and is talking to me again.",
        "url": "https://www.reddit.com/r/relationships/comments/34zqre/update_i_21f_won_the_lotto_a_while_ago_and_my/",
        "score": 2384,
        "num_comments": 254,
        "created_utc": 1430864441.0,
        "selftext": "Hi everyone. Sorry for not posting an update, I have quite a few messages asking me how I'm doing, so I thought I'd post here on what's going on. \n\nI realised people were trying to figure out where I came from, since the dialect or the tone of my writing is a bit off. I actually have a bit of a learning disability, so my partner comes on and sort of corrects things for me. \n\nThe original post is here: http://www.reddit.com/r/relationships/comments/2xpni7/\n\nWell, we ended up having to move, which is no problem to be honest. It was the safer route for our little family that's growing. We also installed extra security and have contacted police, schools, neighbours, etc. I'll tell you the story. \n\nFirst of all, I'm just going to say that I stopped talking to my sister. She's acting as if she did nothing wrong, but she knows what she did.\n\nSo about a month and a half ago, we had already started packing, since we were moving away. My dad texted me and asked if I wanted to meet up, just myself. I said no at first, because I knew that he was going to try and yell at me again for not giving him any money, as well as my grandma. (I looked into /r/raisedbynarcissists that was suggested by some people since he tries to gaslight me a lot.) He then ended up writing an email and apologised for everything he had said and done on his and grandma's behalf. I was actually surprised my dad was apologising for the first time in his life. He then asked if we could meet again, so I caved in and met him. We went to a cafe and I had a really nice time talking to him, yet I felt a bit off. We were probably sitting there talking for about an hour. He was checking his phone a lot. \n\nAfter we left, I went straight home (my partner had our son with him) and found that the property we were living in at the time had been broken into. I realised at that point that dad used me as a sort of.. decoy or something. I called the police immediately and told them that we have secret installation and camera's, so we'l be able to see who did what and when. They scanned the house with a German Shepard dog, and had an inspection and investigation. Meanwhile, I contacted my partner and then went down to the police station with them. They started watching the videos, and behold, it was my own fucking grandmother. I guess she doesn't need that knee surgery then.. I asked the officers what I could do and like many suggested in the first post, they suggested a restraining order, specifically a protection order straight away.  I had the evidence. I was so round up, I just wanted to call my dad and fucking yell at him because I knew he and grandma planned this together. I decided not to because that could jeopardise things in court. They ended up stealing my jewellery and my partner's oculus. (no idea why..) I told my partner to store it away properly, but he didn't. The police officer asked me why I didn't want to press charges on them for slashing my tires and stealing my mail. I said I had the benefit of the doubt about them, but I was wrong..\n\nThe police found my grandmother and father around my property and arrested them. They were standing there pretending to be worried and sad that the house was broken into. My dad went to trial. He couldn't afford a lawyer so he had a public defender. My father is to be sentenced to 4 years in prison for robbing our house. I ended up finding out that he did a home invasion many years ago, went to prison and then came out and flew to his home country after his parole ended. I was taken back by all of this. My grandma is currently in hospital, because she actually did hurt her knee and leg from breaking into our house.\n\n At least right now, I have a protection order against them. They cannot come near me or my family, or the property. \n\nAs for my partner and my son, I apologised to him and said I shouldn't have met my dad. He understood and just said that it's normal to crave love. I'm really honestly heartbroken that my family would do this to me, but at least we've moved into a better property, I can get the therapy I need and I can focus on my new family.\n\nThanks for reading. \n\nEDIT: Thanks for the support guys. I really appreciate it. \n\n   \n**tl;dr**: family apologises, meets me, breaks and steals stuff in my house and tries to act scared when they see the house has been broken into",
        "permalink": "/r/relationships/comments/34zqre/update_i_21f_won_the_lotto_a_while_ago_and_my/",
        "comments": [
            "I really feel absolutely terrible for you - but I laughed my arse off at your grandmother's injury.  Poetic fucking justice. ",
            "[deleted]",
            "I am so extremely sorry about your situation. I can't imagine what I would do in your place, but I think you handled it perfectly. There is no need to apologize about meeting your dad, he manipulated you into doing it and it is 100% his fault. I'm so happy everything has sorted out for you and your family is safe. \n\nAs for the emotional damage this has probably caused you, have you gone to therapy? That might help a lot with the fact that you were abandoned by your entire family..",
            "You should get your dad and grandma t-shirts: \"My daughter/granddaughter won the lotto, and all I got was 4 years in jail for burglary... and this shirt.\"",
            "Damn, sorry your family is so shitty!  That's unbelievable.  I hope they get the jail time they deserve and never have you in their life again.  ",
            "[deleted]",
            "[deleted]",
            "[removed]",
            "Damn. The other day I was reading about an NFL player who had to cut off his family. He offered to buy his parents a house with a cap of  $300,000. They got pissed when he wouldn't buy them an $800,000 house.\n\nSituation ended up much like you described. His sisters showing up when he wasn't home, threatening violence to his wife through the front door. Had to get a restraining order against his family.\n\nMoney does crazy things.",
            ">My grandma is currently in hospital, because she actually did hurt her knee and leg from breaking into our house.\n\nI don't believe in karma, but damn...",
            "[deleted]",
            "I am so sorry this happened to you. Did you get the jewelry back?",
            " Hey. I'm sorry you're going through this. \n\nI grew up in an abusive home and had to cut my family out of my life. It's been about 12 years now, but it wasn't always easy.  It's hard not to feel sad, especially around family centric events -- weddings, birth of your son etc. so I understand why you met with your dad. Completely normal. \n\nBut you're lucky. I don't mean the money, fuck the money. It's nice, but I mean you're lucky. You've got a partner who is supportive. You've got a healthy son that you can provide for, you're healthy and you've got a good head on your shoulder. You seem smart and capable. Those are all things that make you lucky. You don't need them, and you are going to overcome by living a good life that is true to who you are. \n\nGood luck. \n\n",
            "What kind of pathetic fucking father robs his own child's house?",
            "what about your sister after she found out about your dad's arrest? does she feel guilty in any of this? ",
            "Sweet Jesus! All's well that ends well, I suppose. \n\nStay strong.  Look after yourself and your little family.  Good luck.",
            "Christ, that's so low. Sorry to hear about that, OP. I'm glad you were able to stick it to 'em in court.",
            "Glad you busted the conniving bastards. I hope Granny gets punished too.\n\nBTW What's an oculus?",
            "I still want to know if you've contacted your credit bureaus and locked down your file with all three.\n\nMaybe I assumed too much last time, but if your family knows your social insurance/date of birth/etc they can apply for credit in your name and get themselves listed as authorised users (but non-responsible parties) on credit cards.\n\nGetting your bureau locked down means you cannot get instant credit anymore. All credit you get must be done by hand, via the mail and certified to the satisfaction of the reporting agencies and lenders. \n\nIf you go into xyz store and want a store card, it will be instantly declined when they run your info. You will then get an application the mail. You will have to fill out whatever the lender wants, they will verify the info by hand and then work it out with your reporting bureau who is currently locking them out of any information about you.\n\nThe bureau will contact you to confirm that you do indeed want credit and will ask your permission to grant it. \n\nIf you set up a PO box or secure mailbox, no one can intercept this mail and finish your applications.\n\nYou have been naive already in some of your decision making, but you're learning...the hard way. Don't learn this one the hard way. Do it before it becomes a problem.",
            "Jeeze... I'm sorry I didn't catch the first post because I have experience with family and money and could've given you some insider's knowledgd.\n\nLong story short my family owns a lot of land. Lets say about 1000 acres. Literally every generation change in my lifetime and almost every one I have heard about in the past has had some dramatic farce much like your own including but not limited to stealing from fathers on their deathbed and straight up murder.\n\nThe sad fact of the matter is your blood cannot be trusted when large sums of value are being thrown around. People I have known my entire life have done unbelievable things. Relatives I didn't even know existed pop up all of the time in search of fortune and usually trying to hide their true intentions.\n\nTL;DR you can't trust your family especially where this is concerned. I've always told myself that I have to evaluate my family as if they were a complete stranger. When my family does anything questionable I ask myself what would I do if a complete stranger did what my family member just did. The answer is usually cut them off completely unfortunately.\n\n",
            "[deleted]",
            "> My grandma is currently in hospital, because she actually did hurt her knee and leg from breaking into our house.\n\nKarma's a bitch.\n\nI am sorry for you OP but glad you made yourself a better family.",
            "lol your grandma breaking into your house. what did she expect? your millions in cash stashed in the house?\nlmao",
            "Your family are arses.\n\nGood luck with your partner and kid! \n\n",
            "Its amazing what relatives feel entitled to sometimes. ",
            "omg.",
            "Holy shit. Talk about justice porn? I mean there were still a lot of problems. But wow. He's going to prison again for this robbery and your grandma actually does need knee surgery. \n\nThey bothered you for money, and now after trying and failing, they need it even more.\n\nDon't give them a penny. They already did enough damage. Good luck though.",
            "I just wanted to say thank you so much for sharing your story and I'm really sorry that you had to deal with all of this :( That's so messed up but I'm glad that you're moving again and hopefully they will never find your new address. Perhaps consider getting an alarm system installed in your new house? It may be worth the price if nothing else to just feel safer at home.",
            "[deleted]",
            "TELL THEM TO GO FUCK THEMSELVES REAL GOOD",
            "That's terrible. At least you have your own family now. Good luck!",
            "Holy fucking shit. Well, I'm glad that's resolved. ",
            "Fuuuuck ",
            "Money brings out the worst in people. Unfortunantly for you it bought out the arsehole on your father and grandmother, i really don't get it. Money is nice but to steal from your own blood? Pathetic. ",
            "Just curious, how many PM's did you get after posting your stories? I can only imagine that talking about winning the lottery garners a lot of attention from people looking for money. At least you are anonymous here.\n\nIt especially sucks that you did the right thing in this, to give your sister help when she needed it, only to end up having to move and suffer from the criminal actions of your family. I hope this doesn't stop your generosity towards your close friends and family for next time someone is in need. \n\nPerhaps an anonymous way of giving someone in need cash could be through a lawyer, or some other confidential/anonymous way. Or just by saying you won a much, much smaller, lotterie and it's all gone.",
            "If you haven't already done so, get a will made so in case (god forbid) anything happens to you and/or your partner, your relatives will not get custody of your child or control of any of your money.  Also, please get yourself a good financial adviser :)  \n\n",
            "I have always had a fantasy of hitting Lotto and it always comes down to being prepared before collecting any money. In other words having everything in place and then just fucking disappearing all the while acting like everything is normal beforehand. The OP just reinforced this thought process. Money turns people into assholes. ",
            "I'm sorry your family is full of shitheads.  :(",
            "This is SO surreal. I was happy to read that you got to meet up with your dad and at least make up, but then... Fuck them, that is so low. Good for you, congratulations on the new house. I'm happy that you got to start your own family that at least cares for you.",
            "> They ended up stealing my jewellery and **my partner's oculus.** (no idea why..)\n\nOculus is life; Oculus is love, that is why.\n\nBest of luck to you and your growing family; strive to be happy and don't let unfortunately things in the past hinder your ability to look towards the future with hope.",
            "This should be in /r/justiceporn ",
            "Your original post and also this update is the reason I won't be telling my family about the life insurance money my mom left me when she passed a few weeks ago.  Thanks for helping me avoid a potential shifty situation with your horrible situation....  Glad you moved tho and they got arrested. Best of luck! ",
            "Fake.  No one gets a trial that quickly.",
            "> As for my partner and my son, I apologised to him and said I shouldn't have met my dad. He understood and just said that it's normal to crave love.\n\nI'm really glad he said that. :-)\n\nWe can't chose our family. But that's fine because we're NOT obligated to love them.\n\nEDIT: \"Not obligated to love.\" (Whoooops!)",
            "This feels a little too perfect to me.",
            "Your partner sounds wonderful. Your family not so much.",
            "I'm blowing the bullshit whistle....dad sentence to 4 years (know how long court cases take to go yo trial) yet grandma is in hospital for injuries occurred while breaking in....timeline fucked ",
            "People are funny ducks aren't they?",
            "What is an 'oculus' in this context? I looked it up and it's supposedly a hole type feature of classical architecture but that doesn't make sense.",
            "Simple advice: Do what you need to and don't look back until you are well and truly ready.\n\nFamily is family and money tends to bring out the worst in most anybody. Truthfully it would be difficult for me to not ask if I knew you and the only thing stopping me would likely be my pride. However, don't feel bad, things happen for a reason. I learned long ago that if you don't over think and just let events play out, they tend to work out in the end.\n\nLike I said, do what you need to do, it is your life and the livelihood of your family.",
            "> My grandma is currently in hospital, because she actually did hurt her knee and leg from breaking into our house.\n\nKarma's a bitch Grandma!",
            "Monsters. ",
            "Damn. I'm so sorry you had to go through this with your own family but it really is true....money is the root of all evil. ",
            "/r/JusticePorn",
            "I would also suggest changing all your phone numbers and blocking them on all social media.",
            "Jesus, you have an evil and pretty stupid family. What were they going to say? We were just in the area? This is like the plot for a home alone movie",
            "[deleted]",
            "I know this thread is kind of old by now and this,response will be buried and you'll prolly never read this. But....\n\nMy heart seriously goes out to you. I cannot imagine my own family turn so rotten over something as trivial as money. They should be happy for you but instead turned greedy and absolutely terrible. I'm so sorry. I hope now that you've moved and gotten your protection order in place that things get better for you. You deserve it. Good vibes your way.",
            "Oh, dear. You've faced, as a family and as an individual, so many hardships. People hear 'lottery' and forget that with it comes so many different kinds of strife.\n\nYou've done the hardest but the right thing. You've let go of connections who would only use and hurt you. Invigorate your sense of family definition as those who have been truly gracious, and know you for you and have been kind. Whom you can trust, because the money issue isn't something they even know about, but they were, or ahead are there, for you for all the right reasons.\n\nI hope you future fares better. When I think of hardships in my life or see it in others, I'll remember your post and be humbled that there is no easy path in life so long as we are human and are around humans.",
            "lesson learned...never let anyone know you won the lottery.",
            "People go crazy around money. Have had death in families and swear they all swoop on, do whatever they need, and take what they can. Vultures. ",
            "You're doing a great job as a mom. I have seen a lot of people too afraid to stand up to their own families (it's a legitimately difficult thing to do) to stand up for themselves, and their kids got hurt in the process. Good for you for protecting yourself, your SO, and your son.",
            "A protection order is only a piece of paper.",
            "Sorry but it seems to me that you ran 3 times against the same wall. No empathy there. I understand that it is your family but if my family was that fucked up I wouldnt always give in and get shit on the next moment.",
            "I am sorry this happened, but you now know exactly where your relationship with them lies and can act accordingly to be safe and protect your child and SO from them. Be well.",
            "Money will unfortunately show the bad side of certain family members. What a terrible thing to happen. ",
            ">because she actually did hurt her knee and leg from breaking into our house.\n\n\nsweet sweet karma. You have my congrats on having security and the willingness to leave these toxic people to their own fate.",
            "Money can really bring out the ugly side of people... =\\ Then again, it can also bring out the beauty in people. Sorry to say the former was your experience.",
            "Wow, your family sucks. Can I have some money? Just kidding. Actually I'm not. Give me your money.\n\nSeriously though, what the hell. Do everything in your power to ensure they never find you again. What a clusterfuck of shitty people to have to deal with. Hang in there kiddo.",
            "> They cannot come near me or my family, or the property.\n\nYes, yes they can, they just can't do it legally. They haven't shown much respect for obeying the law in the past, so I'd keep my guard up.",
            "Unrelated: Why do people on reddit constantly say partner and SO? Isn't he your husband?",
            "Growing up my parents used to make comments about how lucky my sisters and I were to have parents who actually cared and not some of the other families out there.  Now i know exactly which kind of families they were referring to.",
            "This is why I wouldn't tell a soul if I won =] good luck OP.",
            "man I don't get it... if my family member won the lotto, I'd be jealous but I'd also be happy for them. I might tease them a bit about money but I'd never mean it and I'm poor as sin. O.o",
            "Sorry to say this, but this cracked me up.\n\n>My grandma is currently in hospital, because she actually did hurt her knee and leg from breaking into our house\n\nHope everything calms down for you now though.",
            "very happy you came out on the better side of this. Sorry your famishitty using you like this, but it sounds like you have a great family now and with that new money you live a happy stress free life",
            "Best of luck to you and your family at the new place, OP! Hope things get better!",
            "I feel so sad for that poor Oculus :(. ",
            "I read your first post and I was so worried for you...  Very sad that this happened, but glad it's over.  Now you can enjoy your life without any nagging doubts about your family- you know for sure they are scum & your life has been better without them.  And will be better still in the future :)",
            "Sorry you have such a shitty family. Keep the family you are raising away from these psychos. You grandmother... seriously? WTF. \n\nBest of luck to you!",
            "It sucks, but this is how it is for nearly every lottery winner, at least in the USA. Families and friends turn into animals, and usually the winners end up getting themselves into debt. Spend smart, good luck!",
            ">My father is to be sentenced to 4 years in prison for robbing our house. I ended up finding out that he did a home invasion many years ago, went to prison and then came out and flew to his home country after his parole ended.\n\nSweet sweet justice.",
            "It...it got removed :/",
            "I'm calling BS. \n\nThe timing doesn't work. six weeks for an arrest, appointment of counsel, a felony trial and sentencing? That doesn't happen.",
            "Try to be smart about the money. A huge number of people lose all their winnings within 5 years, even people who have won very large sums. Make a rule that you will only take out a portion of the investment income (you have it in some conservative investments, right?). For instance, if you had it in some bonds that made 4%, you out only take out 2%. That way you will have the money your whole life and it will grow over time.\n\nRule number 1: never put the principal at risk.",
            "All I can add is to do some counseling with your partner now before later. Money can change you two for the worse.\n\nSet boundaries on the money, what kind of lifestyle you two want, and teach eachother the techniques you want to utilize when you feel the other is breaking promises with the money.",
            "I'm sorry you have vultures for family OP. What assholes. Out of curiosity, did the police recover your jewellery? Was it expensive stuff or sentimental? I still can't believe a grandmother would steal from their own grandchild... My jaw... It's on the floor",
            "Did you get your jewellery back?",
            "The story is bogus. It was entertaining to read tho.",
            "[removed]"
        ]
    },
    {
        "post_id": "5fojr4",
        "author": "ccboyf",
        "title": "\"UPDATE\" My [24f] boyfriend [25m] of 8 months is starting to police my eating habits and I'm tired of it.",
        "url": "https://www.reddit.com/r/relationships/comments/5fojr4/update_my_24f_boyfriend_25m_of_8_months_is/",
        "score": 2384,
        "num_comments": 102,
        "created_utc": 1480494338.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/53jjzt/my_24f_boyfriend_25m_of_8_months_is_starting_to/ \n  \n\nSo in case anyone is wondering turns out my (now) ex's mother and two sisters had him convinced I had some kind of eating disorder and would nag at him about it and make him feel like crap for \"letting\" me hurt myself. All three of them are obese so idk why he weighed their opinion on nutrition so heavily. I pointed that out (with more tact) and we had a much better conversation about why he needed to lay off on how I eat. He did make a lot of effort to keep his opinions to himself but could never completely let his worry go. \n\n\nOfficially this isn't why we broke up but it was kind of like the shattering illusion from HIMYM that kind of made me start noticing how he's quick to be arrogant, condescending, and patronizing when he thinks he's right and how he buys into every dumb thing his family tells him without question. Stuff like that. \n \n\n\n  **tl;dr**: Boyfriend's overweight family was telling him I must have an eating disorder. We talked it out but broke up later anyway. ",
        "permalink": "/r/relationships/comments/5fojr4/update_my_24f_boyfriend_25m_of_8_months_is/",
        "comments": [
            "> made me start noticing how he's quick to be arrogant, condescending, and patronizing when he thinks he's right and how he buys into every dumb thing his family tells him without question. \n\nYou saved yourself from a lot of future hurt.",
            "Well, its not a bad thing to have this figured out by 8 months in and to know this wasnt going anywhere. Better to move along in life and find someone worth your time. ",
            "So his obese family was trying to make you obese to feel better about themselves. That's the most fucked manipulation I think I've heard of. Wow. Glad you got away from that. ",
            "> it was kind of like the shattering illusion from HIMYM\n\nFrom *How I Met Your Mother* season 3 episode 8 entitled *Spoiler Alert* (Wikipedia synopsis):\n\n> Ted thinks that he has found the perfect girl, Cathy (played by Lindsay Price), but the group disagrees. At first they refuse to give a reason so as not to \"spoil\" her for him, but eventually Marshall tells him that she talks too much. Now that Ted knows, he cannot stand her garrulousness. The five friends then let slip each other's flaws until all are \"spoiled\", and thus are more annoying to those who had previously not noticed the flaws.\n\n> Whenever one or more of the group has these quirks pointed out to them, the sound of glass shattering is heard. This represents the shattering of their illusions about one another.\n",
            ">All three of them are obese so I don't know why he weighed their opinions on nutrition so heavily\n\n👌🏿",
            "It's good that the illusion was shattered sooner rather than later. \n\nHe doesn't sound worth it at all. Good on you! ",
            "Sounds like they were real crabs in a bucket - they were either trying to sabotage the relationship or sabotage your health, whether or not they can even realize it on any sensible level.  They may TRULY have believed they were right and had good intentions.  If so, they are being purposefully obstructionist and ignorant, and they didn't respect your right to self-knowledge and self-understanding. The whole dynamic is looney.  Glad you're moving on!",
            "Sucks that this lead to a breakup, but you don't seem too hurt about. \n\nAll I can say is to enjoy your newfound freedom! ",
            "I'm probably going to get downvoted but it sounds like his family was serving him a huge plate of fat logic and he ate it. You are a normal weight a desirable weight however 69% of the population is now overweight which is the new \"normal\". I'm sorry you have experienced this first hand. \n\nI am 5'5\" 127lbs and I went out with my boyfriends extended family and they told me how I need to eat a burger and how I'm a stick. It's everywhere ",
            "Good for you. Judging by your original post, he seems abusive and controlling. ",
            "Aside from being completely wrong about your eating habits, they also seem to have the wrong idea about how to help someone with an eating disorder...",
            "[removed]",
            "Smart cookie to spot the underlying reasons that required breaking up over.  Hugs!",
            "/r/fatlogic\n\nMy family is obese and they like to tell me all sorts of crazy reasons that I'm not anymore (genes, the fact that I go hiking every few months, bone structure, etc..) It can be upsetting given that I was obese myself for a few years and got sick of it so I took the effort to actually do something about it.\n\nKudos for sticking up for yourself and getting out of a manipulative and controlling relationship.",
            "Well obviously you're starving yourself, you're not fat like them. Fuck it, better off without him.",
            ">Boyfriend's overweight family was telling him I must have an eating disorder\n\nUGH. This pisses me off. Sorry, just because I'm not overly obese like you are and i'm skinny, does not mean I'm unhealthy. \n\nThat sort of attitude pisses me off when people say that kind of shit.\n\nPS: I'm 5'10\" 150lbs male who gets this a lot. Sorry, but I'm at a very health weight. Little on the skinny side, but still very healthy weight. ",
            "Sounded like a feeder trying to stay in the closet while still attempting to control your food intake in hopes you would gain. \n\nI have a similarly small appetite, but my guy understands. I can put myself in your shoes, and it's oddly terrifying.\n\nYou really did dodge an awful bullet. ",
            "If it makes you feel any better, I'm glad he wasn't a feeder and trying to make you participate in a fetish unwillingly..",
            ">All three of them are obese so idk why he weighed their opinion on nutrition so heavily.\n\nThis is an absolutely killer pun. Anyway, well done for making the right (but difficult) decision.",
            "I'm glad you saw through this issue into other incompatibilities. Also that's horrible of his family to try to basically get you on their obesity train. Why... so they're not ugly next to you? Oh well, not your problem anymore!",
            "Thank you so much for updating, really glad you got away from that lunatic.",
            "Even if he took their advice to heart, he could've just talked to you about it. Just a quick \"hey, i notice you don't eat very much, and I'm a little concerned. are you sure that's healthy?\" Then you could just look up the daily recommended calories for your height, and the discussion is done. Arrogant and condescending is right.",
            "\"All three of them are obese so idk why he weighed their opinion on nutrition so heavily.\" .... hehe pun intended?",
            "Sounds like you dodged a bullet. From the original post it sounds like you have a pretty healthy appetite. Besides which, it was none of his family's damn business what your diet is like. You don't need people like that in your life.",
            "I didn't see the original post but I am similarly sized to you and I would not have put up with someone telling me I need to eat more half as long as you did. You're definitely better off. ",
            "Good for you for getting away from such a jerk. You made the right decision for yourself and your future!",
            "haha, *glass breaking noise*. Sorry, I love HIMYM.\n\nI'm sorry it didn't work out between you too, but it was definitley a red flag that he was so obsessed about your eating habits.. I think you're way better off without him. Good luck :)",
            ">the shattering illusion from HIMYM\n\nI'm curious how many people get the reference. Even took me a sec :)",
            "Wow he sounded controlling as hell and unable to see through his family's bs.  They were def jealous of the skinny gf and wanted to fatten you up so they wouldn't look so bad.  Glad you're away from that gross family.",
            "It's control and I'd suggest break up now before it gets worse I can tell you from my experience with that there's always worse with that kind of person you have the right to do what you want it's that simple ",
            "[deleted]",
            "It's control and I'd suggest break up now before it gets worse I can tell you from my experience with that there's always worse with that kind of person you have the right to do what you want it's that simple "
        ]
    },
    {
        "post_id": "4jbh6t",
        "author": "James19104",
        "title": "My [15M] dad [47M] remarried and I've lost everything I had to my new step siblings [16F-11M-10M] who treat me horribly.",
        "url": "https://www.reddit.com/r/relationships/comments/4jbh6t/my_15m_dad_47m_remarried_and_ive_lost_everything/",
        "score": 2384,
        "num_comments": 523,
        "created_utc": 1463233910.0,
        "selftext": "My dad married my step mother 3 months ago and I feel like it made my life significantly harder and less pleasant. They moved in with us and for the indefinite future this situation will not change.\n\nWe have a 3 bedroom house and before they moved in, my dad and I had our rooms (both with bathrooms) and there was a smaller room which was a study for my dad. After they moved in, Jenny [16F, turning 17 next month] got my room, and I had to share the smaller room with Tom [11M] and Mike [10M]. All my books, my telescope, my stuff are packed and in the basement now since there's no space anymore. This made me real angry but my dad told me that I have to be a team player and this is what him and his wife agreed on.\n\nJenny treats me like shit. She sometimes acts as if I'm not there at all, and sometimes is super aggressive and hostile towards me. The other I asked Tom to stop going through my things and she became so angry that \"I have no right to order her brother around\", she told me to get it in my thick scull that I'm not their big brother to tell them what to do, even though all I asked was for them to stop going through my things. She said it's best if I don't talk to them at all since that way they will get less influence from a weirdo like me. What I don't get is that if she's so concerned that I might leave a bad influence on Tom and Mike why doesn't she take them into her room?\n\nTom and Mike don't respect any boundaries. They're always through my stuff. I have a watch which was a gift from my mother (she died of cancer) and they took it from my drawer and lost it. I found it weeks later in the basement with its front glass broken. \n\nBefore they moved in I used to get a $100 allowance every month. Now Jenny gets $75, I get $35 and Tom and Mike each get $30. I had an Xbox but these kids broke it down.\n\nI used to spend a lot of time with my dad. He used to come see me play basketball almost every week, he hasn't done it even once in the past three months since he's always working overtime. We eat out once a week and none of them in these three months have been to any of my favorite places, but Jenny, Tom and Mike have each chosen their favorites more than once. \n\nI complained about all of it to my father last week and he told me that family is all about sacrifices, and I have to make mine. Haven't I made enough sacrifices already? I feel like I'm the only one making sacrifices. I looked forward to them moving in here but I now feel like an outsider at home, it's not my home anymore.\n\nLife has become very difficult for me. I spend as much time as I can outside because inside is so frustrating but this is causing problems as well. My dad keeps telling me that not being around means I'm not accepting them as part of the family while in reality it's the opposite. So I get grounded for not being around, and being around is horrible. \n\nI don't want to live here anymore but I'm only 15 and can't move out. I have nobody else who can take me in. I can't stay here for 3 more years. I'll go crazy. I often fantasize about running away at night but I know that's also as horrible if not even more.\n\nI don't know what to do. Can anyone give me a suggestion?\n\n**tl;dr**: Father remarried and his wife and three kids moved in. They've taken over my room, my things, my space, my budget and treat me horribly. I feel frustrated and very unhappy here. I don't know what to do to make my life a little easier. ",
        "permalink": "/r/relationships/comments/4jbh6t/my_15m_dad_47m_remarried_and_ive_lost_everything/",
        "comments": [
            "Your dad is totally screwing this up. If he thinks you all are on a team, and he is the leader, he needs to remember that a leader:\n\n1. Makes sure every person on the team is valued;\n2. Enforces rules fairly;\n3. Solves problems instead of issuing judgement.\n\nOP, what outside adult can you talk with to be your advocate? This is bullshit.",
            "Is there any way the basement can be fixed up enough for you to have your own room down there?",
            "I'm not sure where your dad and stepmom's logic is in giving Jenny the larger room and shoving three boys in a smaller bedroom.. or cutting your allowance to $35 and still giving Jenny $75. However, I doubt your father is going to respond to complaining about these because he'll just come back with the whole \"you have to sacrifice\" thing.\n\nWhat he might respond to is you telling him you feel uncomfortable in your own home and like you're losing your family. If your dad expects you to bond with your stepsiblings he is the one responsible for facilitating it. Tell him everything about Jenny's behavior, how they constantly break things of yours without consequences (watch from mother, Xbox, all that), that you feel like you don't get as much time together, like your opinions matter less in dinner/everything else- I really don't see how any dad could ground you after understanding why you're out of the house so much. I feel so badly for you, if talking to him doesn't work maybe you need to give him a letter with everything laid out like in this thread so he can't cut you off in the middle of explaining. If all else fails I hope you get a scholarship to somewhere far away.",
            "First of all: who came up with the stupid idea of giving three people the smaller room and your step sister the larger one?\n\nYour father really needs to get his mind straight. Yes, you have to make some sacrifices, but so do the other children!\nHe does not want to discipline them though to look good in front of your step mum, but that needs to stop. \n\nDid you tell him about the watch? Breaking such an important piece of memory is extremely rude. Try to stand up for yourself as well as you can and call them out on their behaviour. Maybe your step mother will finally start to say something.\n\nEDIT: spelling; also --> start to\nEDIT 2: Apart from that, the age gap of one year to your step sister justifies a 40$ difference, whereas the 4/5 year age gap to your step brother justifies a 5$ difference?!",
            "for now, I think you should do what you can, keeping valuables locked, saving a percentage of the allowance for the future. as for the long term, this kind of sucks since you can't just move out. is there a basement in the house you could live in instead of the other room? any friends you can crash with occasionally? no extended family? ",
            "It sounds like Jenny is the biggest problem. If she's 17, is the plan for her to move out soon? Maybe you can talk to your dad about getting your own room and having the two younger boys share.",
            "[removed]",
            "Are you able to sit down with your dad and say that you would like to take on more responsibility towards your future? If he can sign working papers and you can get a job or do volunteering, then you would have a positive reason to not be present. Also if you get a job, do not bring the money home. Take it directly to a savings account. Your step siblings don't respect your belongings so I don't doubt that they would be fine with taking your money as well. Do not let your father or new family members have access to the money if possible.\n\nThe volunteering and work will look great on a resume and for future college opportunities if you are able to do this.\n\nIf neither of these options pan out, do you have relatives who are nearby? Anyone who you can reach out to for help?\n\nAnd lastly, if you want to try to talk with your dad privately one last time you could say something like,\n\n\"Dad, I know our family is going through a lot of changes right now and it's important for everyone involved to be a team player. I need to know that when I'm putting an effort to be a team player that everyone else will be making an effort too. It's been hard since mom died and I need your support and the support from the new members who want to join our family. \n\nOne thing that is important to me is having belongings respected. I found mom's watch broken and it is tearing me apart. What are ways that we can keep treasured items safe now?\n\nAnother thing is how to encourage positive interactions. It's been hard for everyone coming together and I feel stressed with how my new siblings talk to me. What are your plans for encouraging more family-oriented activities and interactions to promote better family dynamics? How will you reinforce positive interactions if the 3 siblings all speak out against me? I can feel outnumbered and overwhelmed at times and I want to see how you are going to address this.\n\nAlso, I need you to remember that this is a big adjustment for all of us. I will also need one on one time with you and to get to do separate activities with you. I need your support and I need time to adjust.\"",
            "A tip for dealing with the \"team player\" guilt-trip (I've had that used on me before):\n\n\"Dad, being a \"team player\" is a two-way street: **You're** not playing on **my** team.  I'm asking you to talk with my brothers about not going through my stuff.  I'm asking you to let me pick the restaurant as often as the other kids do.  These are normal, \"team player\" requests.  Why don't you have my back on these things?\"\n\nAnother general tip for talking to **everyone** about these things is to use the \"When you... I feel... will you.\" pattern.  It keeps you from saying something that they can attack you for, because you focus on **specific behaviors** and how those behaviors make *you feel*.  You don't get into motivations or anything that will make them feel defensive, or give them a chance to deflect:\n\n\"<brothers>, when you go through my stuff I feel anxious that you're going to break something, the way you broke my mother's watch. Will you stop touching my things?\"\n\nIf they don't stop - talk to BOTH of your parents:\n\n\"<parents>, I've asked them to stop going through my things, and they don't.  Can you please make them stop.\"\n\n\"<parents>, when you ignore my reasonable requests, I feel like you don't care about me.  Will you tell me why you're not helping me set reasonable boundaries and ground-rules?\"\n\nIt's not magic, but it can help focus conversations.\n\nGood luck!",
            "Why would Jenny get the bigger room alone while 3 boys share a smaller one? That doesn't make any sense. \nI would talk to your dad again and really make him see what's going on. It's not ok that you're treated that way in your own home. \nI would also get their mom involved about the boundaries. Those kids need to stay out of your stuff. And have her replace or repair the stuff they broke. ",
            "Send your Dad a link to this thread, so he can see what other adults and parents think about how he is letting his son be treated.  If he won't listen to you, maybe reading some of these responses will shame him into acting like a Dad and protecting you instead of letting you get thrown to the wolves.",
            "Your dad is not really listening or seeing how he is bungling the merging of two families.\n\nHere's what you can try to address immediately:\n\n*  Ask your dad if he can make up a rotating schedule to post on the refrigerator of who gets to choose where to eat out.  Explain you know it's a special treat to go out to eat and everyone gets excited when they know they get to choose.\n\n* Ask your dad this, \"What are we going to do about the expensive or non-replaceable item like the xbox or the watch?\"\n\n*  Ask your dad if he can set aside one day every other week so he can watch you play basketball.  Let him know you miss his presence and feel lonely and left out and miss the one on one time you used to have.\n\n*  Talk to your dad one on one on a daily basis.  Ask him if he has 15 minutes he can give to you daily so you can talk about anything and everything.  \n\n*  Ask your dad if you can have a private space/time for you to do private things.\n\nHere's what you can try with your step-siblings:\n\n*  If Jenny brings up you talking or chastising Tom and Mike again, don't get into an argument with her.  State that you have a right to not have your stuff messed with and then close your door or walk away.  This one is hard; but while you don't give in, you also don't want to engage with her.\n\n*  Tom and Mike are unfortunately at the ages where they will go through your stuff.  You can make it fun for all by showing them what things they can play with and what they can't.  And of the items they can't, put them in a locked container that you buy (sorry) with your allowance.\n\nThings that you're going to have to let go:\n\n*  The allowance reduction and the unfairness of the split.\n\n*  The 3 kids to one room thing.  \n\nWhat you can do for yourself:\n\n*  See if you can find a part-time job.  Driving age is coming up and you're going to want to have cash to buy a vehicle and pay for gas and insurance.\n\n*  Take time with Tom and Mike and play basketball with them.  Getting along better does mean you all have to get to know each other.  If you can do it while doing something you like to do, it's easier.\n\n*  Not much you can do with Jenny.  Be polite though.\n\nIf you have any aunts/uncles on either side of your dad or mom to talk with, hit them up. Or your guidance counselor at school.  It really does help to talk all this out face to face with someone.",
            "I'll tell you exactly what to do. Study hard in school, get yourself a full academic scholarship and move out in a few years when you graduate. Your dad probably has self worth issues, married to not be alone and unfortunatley anything you say will glance off him right now because his hands are tied.",
            "I wish someone would tell your dad that just because he's fucking some lady and married her, does not make her kids your family. You are sacrificing for his benefit, none of your own.\n\nMy only advice is to ask your father why one person gets the big room and three people have to share the little one. Ask him why you had to make all these sacrifices but none of her children did. Ask him why it's alright for these other kids to break gifts from your dead mother. Ask your father when he decided that his sex life was more important that his only child who lost his only mother. Tell him you dream about running away, that you think at this point a life of surfing couches seems more appealing than this life. Tell him he has created a situation where all his only son thinks about is how soon he can escape and never look back.\n\nDrop a giant honesty bomb.\n\nAnd make sure to write everything you want to say down. Read it out to him. That way he a)knows you thought about it and aren't shooting from the hip, and b) if he interrupts you, you can pick right back up where you left off.",
            "[deleted]",
            "Seriously talk to other family members about moving in with them. Tell your father it's obvious that he has chosen his new family over you. Is it because you're a reminder of your mother? Tell him how they act and talk to you when he isn't around.  How he hasn't sacrificed anything, only Gained a partner who puts the needs of her children above you and your needs at any cost. How disrespectful they are and how they mention you aren't family.",
            "Is the school counselor any good? Or maybe a teacher you trust?",
            "This seems very unreasonable to be honest. Why does she get her own room why the rest of you share? Why does she get so much more money? Why is she defending awful behavior? She really is the problem. You need to make it very clear to your father that it is not acceptable. Have a grown up discussion, sit him down and tell him everything that is going on. You haven't said anything about your new step mother? If you have a decent relationship with her you could also tell her what her kids are doing since they probably aren't comfortable correcting each others kids. You are very patient but if you don't play it smart it will only bite you in the ass and it will only get worse. Best of luck! \nI'm sorry for your loss OP",
            "If I were you, I wouldn't do any of the things recommended here. I know you are only 15, but 15 is one year from being able to get a driver's license. It's time for you to start maneuvering to leave home.\n\nFirstly, is there any restaurant within walking distance of your house? If so, express to your father that you are going to try to get a job washing dishes, busing tables, whatever. No restaurants/diners? Try retail places, some of them don't mind hiring kids for simple tasks as well. If you get a job, you will be able to have significantly less time at home without being grounded for it.\n\nOpen your OWN bank account WITH NOBODY ELSE'S NAME ON IT (!!) and deposit your checks. Save, save, save. Put your new allowance (sucks dude, I'm sorry) in there too. Bide your time, work as many hours as you can while still getting your homework done.\n\nWithin a couple years, you'll be able to afford a car, get a license, and make yourself scarce. At 17/18, fill out your FAFSA, take out loans, and get the fuck out for school. Community college might be a fabulous option, it's cheaper, so you could allocate loan money to a cheap apartment. Do your prerequisite courses there and then transfer to a bigger university. Living off of loans sucks, it will be hard in the future when you have to pay them back... but it will be infinitely better than living with your doormat dad, evil stepmom, and her bitch kids.\n\nGood luck kid. I know you're super young, but honestly 16 is when I started to really do my own thing and make myself scarce anyway. Time to grow up and get out of there, because nobody is looking out for your best interests at home.",
            "OP, that really stinks and I'm sorry you're dealing with all of this.\n\nMy suggestion would be to write down this post in a letter to give to your dad. It is possible that he was not listening the first time you tried to tell him all this stuff, or that he interrupted you or didnt understand. A letter will make sure you can express all of your thoughts and feelings without your dad having the opportunity to interrupt.\n\nYou dont talk about your step mother in this post a whole lot. What is your relationship with her like? If she has been kind to you and seems like a good person, maybe consider giving her a letter that expresses your thoughts and feelings as well. It's possible that she has no idea you are feeling so uncomfortable and frustrated. \n\nBeyond this, do you have a school counselor or teacher, relative or adult in your life that you could talk to about this situation? Sometimes it really helps to talk out loud about your frustrations to someone who will really listen and can offer another perspective and good advice.\n\nAlso: Family counseling. Ask your dad about going to see a family counselor, because it could only help your situation. A (good) family counselor would act as an unbiased third party mediator, and would help you guys communicate your frustrations and feelings to each other, and hopefully help you work through problems and negotiate fairer treatment for all kids.\n\nIf family counseling is out of the question, maybe ask to see a counselor or therapist that specializes in the merging of two families with kids. That kind of person will be able to help you better than anyone else on reddit can.",
            "I am half fuming reading this. I am going to talk out of my ass for most of this post, but this is what I believe every human have a right to.\n\n>  This made me real angry but my dad told me that I have to be a team player and this is what **him and his wife** agreed on.\n\nNononono, you do not have to be a team player here, if they did not deem it necessary to include you in the plan you have every right to oppose it. Seriously, they want you to just accept whatever crap they throw at you, just because they made a plan? \"Sorry son, the plan says we do not have to take your view into consideration, sorry, hands tied!.\" Utter bollocks, as a 15 year old and a member of the family you have every right to be included in this discussion *before* they made any decisions. Hell, any child should have the decent human right to be included in what they expect/should be expected with a new family. If they did not include you in the planning, you have no obligation to follow that plan.\n\n> I complained about all of it to my father last week and he told me that family is all about sacrifices, and I have to make mine.\n\nSacrifices for who? From what you have written it seems your dad have more or less thrown you under the bus for his own convenience. Certainly you have all had to make sacrifices, but did he ever communicate to you about them before the marriage? Once again, if he did not tell you about the changes beforehand, you have no reason to accept them. And if he expects sacrifices, he needs to make the same for **you**, not his new wife, not his new step-kids. You should be able to expect he will have your back, and *value* your sacrifices. If this is currently how much your sacrifices are worth to him, consider stopping the payments.\n\nYou should have the right of human decency, and privacy. You should not have to hide in your own home, you should not have to protect your belongings yourself, you have the right to defend yourself and your belongings when they are being damaged. Your wishes, requests and opinions have just as much right to exist as those of the rest of the family, **you** have just as much right to live and exist in your family as anyone else.  \n\nSo what to do? You need to communicate to your dad that if he wants all of you to be a family, you are important. You should be respected, accepted and valued, both in the family, and as an individual. You should not have to accept unfair treatment, **under any circumstance**. You should be included in decisions regarding your own life, you should be able to make demands, and for heavens sake, you should not have to have to protect yourself this way. Basic human decency, common courtesy, that is what you should demand. If they want you to be a team player, they need to invite you to the team briefings, if they want you to make sacrifices you should be able to make demands in return. This is a matter of communication, your dad should communicate with you, and have your best interest at heart, as well as the family. **You should be treated like a human, as your father's son and someone worthy of respect.**\n\nMy deepest condolences for your mother and situation, and my sincerest hopes for the improvement of said situation, from someone with the deepest sympathy for your situation. Rant over.",
            "When my parents had their heads so far up their asses with their own lives that they couldn't see how they were hurting us, I wrote letters. My parents were pretty A+ overall, and I haven't suffered the personal tragedy that you have so I can't completely relate, but I'll try my best. I'm a teacher and I specialize in Autism and behaviour. It has taught me a lot about how to deal with unhealthy human behaviour problems. I'll try to be brief with the behaviour stuff and then I'll draft a letter for you.\n\nIt sounds like your Dad and Stepmom are both overwhelmed and are giving the kids with the bigger behaviour problems more to keep them happy. Really it's just placating them. Your stepsiblings won't actually be happy because they get treated better, it will just bribe them to be on their best behaviour when the adults are around, and treat you worse when they are not. They are unknowingly setting up some really bad relationship dynamics by doing what they are doing.\n\nThey could also be so consumed and self involved with their new relationship that they have convinced themselves your relationships with each other will be rocky at first, but will work themselves out with time. This is also bad practice. You may learn how to live with each other like you are, (avoiding, being forced to stand up for yourself, hiding important personal items) but this is a bandaid type of solution and will likely lead to a lot of pent up frustration and long term personality conflicts.\n\nYour stepsiblings definitely feel as shitty about this situation as you do, and they, with a united front are placing the blame for their feelings squarely on your shoulders when it should be on their mother's. Try saying this to the boys. Something like, \"guys, this is a really shitty situation (\"tough\" if you don't want to swear). I'm sorry we're stuck together like this. Can you think of anything we can do together to make it better? \n\nBonding with the boys will subvert the destructive behaviour of your step sister. She may actually be struggling the most with this situation despite being given the most and being allowed to treat you terribly. If you can isolate her and get the boys on your side, the step mom will start to see some of daughter's problems as her own, not all of her kids \"justifiably\" not getting along with you. It will also show you're putting in some effort. AND they will likely stop doing shitty things to you like breaking your watch. They are young and are acting out because this move has been traumatizing. This is not an excuse for their poor behaviour. They owe you more than a proper apology. It won't come until they understand that it was wrong to hurt you, and that won't come until they care about you. Young kids are pretty moldable. \n\nIf your step sister notices you all getting closer, her behavior might escalate. Be aware of this and hide any important personal items that you have left, or stash them at a friend's house in a box.\n\nAs for your dad and step mother, you should be talking to them both together. They should be seeking counseling on how to make this transition smooth for everyone. Just going to your Dad keeps the family \"sides\" in place and won't be effective. Your Dad has already shown that he's not going to bat for you against step mom, so you need to change the dynamic to boundaries that you need to make this massive change in your life manageable. This is where the letter comes in.\n\nDear Dad and Step Dragon (jk),\n\nThis move has been a massive change in all our lives. I hope that in time we all come together and that this family grows strong and has lots of celebrations and good times to look forward to.\n\nI know that this has been very hard on me. I know it must be hard on you both too. I don't think complaining to you about the things that aren't working does anything but add to both of your stress, so I thought I would write this and clearly and calmly outline what I need to adjust to all of this. \n\n1) My personal items need to be respected. If something gets broken I expect an apology and for it to be replaced. Something very sentimental of mine was broken that cannot be replaced. I need both of you to find a way to ensure other items like this will be safe in the future.\n\n2) I understand why I have to share space with the boys. Forcing the three of us to share that small space together for three years until I go to school is not a long term solution. I need you both to find another solution to the space issue (cough, cough, fix up the basement), and let me know the timeline for that change. If I know when I will have a reasonable amount of space again, I'll be able to manage things for now.\n\n3) I need you both to respect that I have suffered a traumatic loss in my life. And now I feel like I'm losing my Dad too. I'm not being dramatic, my whole world was destroyed when my mom died, and now I have to adjust to my Dad not being just my Dad anymore. I understand that work keeps you from my games, but I'm 15 and I still need to know you're proud of me. I might need therapy to cope with all of this.\n\n4) If you can't help resolve some of the personality conflicts between step sister and I, I think we should go to some family therapy sessions together. We may not have to be best friends a love each other, but we do need to live together, and everyone has a right to a calm, safe, living environment. \n\nI love you. I want this to work. Can we please sit and talk about this, just the three of us, together tomorrow. \n\nThanks,\n\nOP\n\nGood luck and update!!! My grandparents split up (my grandmother was an abusive parent) and my grandpa remarried my step grandmother. He had 5 kids and she had 4! They were mostly teenagers. The stories from that time are totally crazy! There are still personality conflicts to this day, but they tried their very best and did do therapy to help. In the end what happened is a pretty close-knit family with tons of cousins and lots of happy memories. There is light at the end of this tunnel! My uncle had to sell his drum kit and move out at 17 so they could buy a different house. There was no space for him. He still talks about it, but they all still love each other and have somehow worked it out. Some sacrifices are shitty, but okay. Being bullied by your step siblings, however, is not okay and needs to be dealt with. \n\n",
            "What is your step mother's role in all this? What were her kids like before the big move? If she just honestly raised her kids to be the spoiled brats they appear to be, approaching her won't do shit. But is it possible that there is a benefit to approach g them both? Like it or not, you are also her child now, and neither of them seem to be very good at sharing the responsibility of parenting. \n\n",
            "Show your father this post and insist he reads through all the replies as well.\n\n\nAnd dad, you are being a tool. You are sacrificing the emotional health of your own child, in order to ease and accomodate the new life you have chosen, that he has no say in. - You are doing a really bad job.\n\nStand up for your son, even if it means not pleasing your new wife. Your son will resent you when he is an adult, and you will be lucky to have a relationship with him if this continues. In fact, as it is now, you should consider that in 3 yrs when he can move out, you will have destroyed any notion of you being loving and having loyalty to him at all. - Get your head out of your ass, and do something, instead of asking this 15 yr old to do all the accomodation for your life choices!  - Thats right dad. STRANGERS are sticking up for your son, because you are not. Shame on you!",
            "I'm sorry but your father is abandoning you and you cannot depend on him to help or protect you from this point on. He is so desperate to make this new situation work that he is prepared to sacrifice your happiness. You need to look out for yourself,\n\nDo you have any grandparents or other family you could stay with?",
            "Just so you know, the glass face on your mom's watch can be replaced. \n\nI am sorry you lost your Mom. Do you have other family members in the area? (Aunts, uncles, grandparents?) you are old enough that you can reach out to them, figure out who has the most sense, and try to arrange for a few weeks visit over the summer. (Or just a dinner at their place every now and then.) once you identify a trusted adult, you can explain the problems and try to find solutions. At your age, you can move in with a relative or a friend if you choose to, and they (probably) cant stop you. *\n\n* not a lawyer. But you can google \"emancipated minor\" for your state. You dont even need to do emancipation if your dad agrees to a \"temporary\" visit to a relative.",
            "\n>I complained about all of it to my father last week and he told me that family is all about sacrifices, and I have to make mine. \n\nYou should ask your dad if one of the sacrifices he made was the chance at having any future relationship with his child. ",
            "\"Dad, I'm not happy right now and you're pushing away your own flesh and blood.  I have done everything you've asked and have done my best to make this work,  and asking any more from me is just not possible.   My most meaningful possessions are being destroyed by my step-siblings, but the most important thing that's being destroyed is our relationship.   If things continue as they are, there won't be a relationship between us soon.  I don't expect that things will go back to the way they were.  I just want everyone to be expected to make the sacrifices I am, and that's not happening right now.  If things can't change,  then I'll grin and bear it for the next 3 years, but when I'm 18, I'm gone.\"  ",
            "Jenny told you not to boss her brother around because you're not his brother, while simultaneously not being your big sister (by her logic). Don't put up with her shit",
            "Get a job if your state allows you to at 15.  It's a good way to get out of the house and you will be paid.  Get a bank account and save up the majority of each paycheck.  Be ready to move out on or soon after your 18th birthday.  Also, let your dad read this post and our responses.  He is entitled to his happiness, true, but it seems he is blinded a bit by new love and letting his new wife walk over both of you.",
            "> he told me that family is all about sacrifices, and I have to make mine\n\nI hate this line.  Getting married is his choice so he should have to accept whatever comes along with that for himself, but since you had no input he should be doing his best to make this experience good for you. Honestly, both your dad and your stepmom sound less than ideal if they can give Jenny both her own room and the higher allowance. (I understand she needs her privacy, but she could change in the bathroom. Also, how do they reason that a teen girl needs her own privacy, but 1 teen and 2 preteen boys will not need their own privacy? The only fair thing is a 2/2 split where nobody gets their own privacy.) I almost can't blame her for being such a tyrant because she clearly grew up learning it's OK to be entitled.\n\nRuining your mom's watch is absolutely the last straw. Even though they probably didn't know what they were doing I'm so angry on your behalf and sorry about that. And if you're going to have to share a room with two people, those people, whoever they are, better damn well learn to respect your privacy. For the short-term I'd recommend moving the remaining valuables to the basement, because somehow to young minds they become less \"interesting\" there.\n\nI would recommend telling your dad that blending a family is supposed to be about COMPROMISE, not sacrifice, and that not only are you getting a raw deal, it's very clearly affecting your mental and emotional health. Your dad needs to make quality time to spend with you, and listen to you, and have your back. Just because he may be more strapped for time now does not excuse him from being a dad to his son. His attempts to \"not rock the boat\" are just selfish and cowardly. I would also tell him that spending time outside the house is keeping you sane, and attempting to limit your time forming other meaningful relationships, and punishing you for not wanting to be around this mess, is _controlling_. \n\nTell him that he either gets to stand up and DO something about this shitty situation where your stepsiblings are yelling at you and insulting you and breaking your things, or, _you won't be around for that shitty situation_. His choice.",
            "My husband went though this at your age and it caused a huge rift between he and his father.  Almost identical, except in addition to all that they picked up and moved to another state while my husband was away at summer camp and decided that none of his stuff was important enough to bring.\n\nMy father in law divorced the stepmom 5 years later but the damage was done.  It's starting to heal now another 10 years later but it's a rough road.  \n\nEverybody else gives good advice but the cold fact is that nothing you can do will guaranteed make the situation better.  What my husband did about the \"spend time with the family\" obligation was to get an after school job. That way most evenings and weekends he could clear out without it being a slap to the family, plus he got some cash.  As long as your grades don't slip it's hard to protest about a teen that has too good of a work ethic.\n\nGood luck. :-(",
            "I know there are two sides to every story, but it seems like you are getting a very raw deal if even the larger part of what you say is true. Even if everyone was fabulous to you, losing your space and losing your allowance would be enough to make the situation a real pisser. It seems hard, but the squeaky wheel gets greased, so perhaps go outside the family and try and get some counselling? Not just for you, but for the whole group.  Also, as someone else stated, do you have any extended family you could stay with for a while? I know you miss your dad, but you won't miss him any less if you lived elsewhere. ",
            ">Tom and Mike don't respect any boundaries. They're always through my stuff. I have a watch which was a gift from my mother (she died of cancer) and they took it from my drawer and lost it. I found it weeks later in the basement with its front glass broken.\n\nThis alone would make me tell \"the parents\" and make THEM reinforce the respect by your stuff.",
            "You need to speak to your school counseler, or principle or teacher.  You are thinking about running away, this is not good.  You need someone to help you, and be an advocate for you, because either your dad is totally whipped and going along with his wife, or he's just an asshole.   Regardless of the cause you need an adult helping you.",
            "Okay. This sucks. This isn't fair. This is life. It's time to put in the grown up pants and figure out what to do. \n\nYou've talked to your dad. He's dismissed it. He's clearly favoring his new family over you (I am so sorry about this he's handling this blend so awfully). \n\n1. Can you talk to a counselor at your school, or a trusted teacher, and see if they're willing to mediate a conversation between you and your dad so he may listen better?\n\n2. Can you look into getting a part time job? It'll get you out of the house, and you can start saving up so you can move the heck out the day you turn 18. (Don't do this at the expense of your studies! Some kids can handle the extra responsibility, but there is NO shame if you can't)\n\n3. Do you have any relatives or close friends you could move in with if things get worse? Or stay with regularly to get a break?\n\nYou sound like a good person, and this is a shitty situation that can really put someone down a bad path. Please don't let it. I'm so sorry you're facing this and your dad is being such an idiot. You don't deserve this and you've got options to make this better.",
            "> The other I asked Tom to stop going through my things and she became so angry that \"I have no right to order her brother around\", she told me to get it in my thick scull that I'm not their big brother to tell them what to do, even though all I asked was for them to stop going through my things. She said it's best if I don't talk to them at all since that way they will get less influence from a weirdo like me\n\nTo OP's dad: this is the part that worries me the most. Sharing and sacrificing is motivated by a spirit of cooperation and caring. If you allow behaviour like this to continue it will destroy that spirit. \n\nNo matter what the disagreement is, you have to teach your kids (all of them!) to treat each other with compassion, and if they can't muster that, then at least treat each other with respect. \n\n> I'll go crazy. I often fantasize about running away at night but I know that's also as horrible if not even more.\n\nPlease listen to your son. These are his real thoughts and feelings.",
            "Your dad is an ass, show him this thread, hopefully it'll shame him into treating you more fairly.",
            "Hi OP,\nYou mention a basement - is there a way you can make part of the basement your room? That way, you're still in the house, but you can have your time away from the brats. \n\nHere's how to sell it:\n\n* You're getting older and need privacy. As a guy, your dad should get this. \n* The little boys need more space; tensions are high, and stuff is getting broken.\n* Whatever improvements are made to make a room in the basement, will allow it to be used as a guest room after you move out. \n\nWhatever you do, keep that room meticulously clean. Also, get a storage locker for your room, and keep anything you hold precious locked in it, even when you are home.  ",
            "I have a few questions,\n  \n* Does Jenny have a job?\n* Why do a 10 and 11 year old need an allowance?\n* Why can't Jenny take the smaller room? You're dad must be a very stupid person if he thinks it is a smart idea to cram three people into a small room and let the person who isn't sharing have their own room.\n* Is there a room in the basement you could clear out and live in? You can tell your dad he needs to make sacrifices if he questions you.\n* How has your step mother been treating you?\n\nI personally had to get a job when I was 14 if I wanted to buy my own things, I will say 14 and 15 is a little young to be working when you don't have a reliable form of transportation, so since it is summer Jenny should have a job because she has no reason to not be driving and not keeping a job. Try going to your step mother, it sounds like she's the one running the family now. Tell he that you're unhappy, that you feel like you aren't part of the family. I wold also try to find a spot to move your valuables to so the little ones don't break them, you can't entirely fault the 10 and 11 year old, they are trying to adjust and it is a lot harder for younger kids than it is for someone who is yours or Jenny's age. I feel sitting down with both you father and step mother would be more beneficial than just going to your father about it because it is clear he really isn't on your side",
            "Oh man this rings home a little too much for me. When my dad remarried, something very similar happened. I even remember my stepmom at one point telling me, \"You are not a part of this family nor will you ever be\". It sucks, it really does.\n\nI lucked out because I was able to move in with my mom and then grandma to avoid as much of this abuse as possible, but it doesn't seem like you have an outlet like that.\n\nSometimes writing our feelings works out better then saying them. Make a list of what all you've sacrificed. Make a list of all the things they have broken. Make a list of any time you are made to feel like you aren't part of the family. Make a letter about how all of this makes you feel and is influencing your decisions in the future (for example, when I talked to my dad I emphasized how I will never be a part of his life again unless changes were made).\n\nFor a successful mixed family to work, everything has to be shared. Everything has to be equal. It sounds like your father is just appeasing his new wife atm, which will do more harm then good. It's setting a horrible precedent and will not change unless change happens soon.\n\nI would say be as brutally honest as you can in this letter. Tell your father exactly how his actions and your stepmoms words and actions will affect you right now and in the future. Tell him if you fantasize about leaving and never coming back. Tell him how hurt you were that a momento of the mother you'll never see again was stolen and broken without any repercussions. \n\nAlso, make sure to tell him how much you were looking forward to this new family at first. Tell him how you envisioned a family where you were all working together and get along. How he had time for you, your step siblings, and stepmom. Tell him how you were excited to share a house. And then tell him in all of the ways that dream was shattered, using real evidence and facts.\n\nMaybe even show your father this thread. Let him see stories like mine where family situations like this have forever ruined any chance at a close and deep relationship between bio father and son (in my case daughter). Your father needs a wake up call, and soon. I forever wish that I could have the relationship with my father like I used to, but all of those years of abuse (which I consider stuff like you listed as abuse since it's mainly directed at you) and inequality has forever tarnished the relationship I could have had with my father and stepfamily. I resent my stepsisters now and will never be as close to them as I wish we could have been (and how close I pictured it when I found out about the new family). \n\nAnother suggestion would be family therapy for everyone... or at least for you and your dad. A family therapist would be able to help set up ways in which you all can work together to be a happy blended family. A good therapist would also make sure that your words and feelings are known and validated. I would say ask your father if you all can do this, to become a stronger family... also to help deal with the loss of your mother and how this new family fits into the picture.\n\nFinally, if you ever need to vent, feel free to pm me. I have gone through a lot with my family and can offer an ear to listen or give you tips and tricks on how to cope / deal with certain situations. In my case, things got real bad... my stepmom went from telling me I wasn't a part of the family, to hitting me one day and spinning it to seem like I attacked her first (which my dad and stepsisters believed). It was bad, but through certain methods and through some self discoveries I've been able to \"survive\" it all and come out a better person... you can too.",
            "Can I ask what all the basement is being used for? Could you possibly convert it or part of it into a bedroom for yourself? That would be my first step if possible, establish a new private space, and then work on any remaining problems after that.",
            "Just don't come around any more. What is he going to do ground you? Sounds like being grounded isn't much shitty than not being grounded. I would avoid being home as much as possible, and if your dad drops that line again \"by you not being here your not accepting the family\" I would then say hell yeah I don't accept them, they sure as hell don't accept me. Try to get a job bussing tables, save that money and get the fuck out, your dad doesn't have his sights on your well being so you must take it into your own hands, unfortunately its at your young age",
            "Your father has betrayed you. He is sacrificing your well being for the sake of being comfortable with his new wife.\n\n\n1. Talk to any adult you trust: school consular, teacher, social worker. Follow their advice.\n\n2. Find a local library and study very hard there. When you are 18 - apply to several universities, go for scholarship and move out. \n\n3. Life is unfair. People who suppose to love and protect you will screw you over. You have to become strong and self-sufficient.\n\nGood luck!",
            "Have you told your father what Jenny said to you? She was way out of line and completely unjustified. You have the right to ask someone not to touch your stuff. It doesn't seem right for your Dad to ground you for trying to stay out of the house after she has said it's best that you don't talk to them. Your Dad is trying to make things as easy as possible for his new step children but he's letting himself neglect you and your needs. You will need to make some sacrifices to help this arrangement to continue and help make your Dad and the family he's married into happy, such as with some of your stuff being stored in the basement and the allowance, but in other cases you need to open the lines of communication with everyone so that there are clear boundaries. Some of your belongings you can probably let your little step brothers play with, but others like your watch should be out of bounds. Since those kids just don't respect your wishes see if maybe you can arrange a locked drawer or something? Ask your Dad and your new step mom if they can please fix your watch that they wrecked. You're owed at least that. Bring up the fact that you've not once had a chance to eat out at one of your favourite places while the other kids have. That isn't fair at all and your Dad and step Mom have no excuse for that. Personally I think it's wrong that Jenny has been given the larger room while the 3 of you are in a smaller room, and that your allowance is closer in size to the 10 and 11 year old than the 17 year old. You've made a lot of sacrifices but there should be some compromise here as you seem to be taking the brunt of it. The others probably have found it hard to move home but your arrangements are clearly a lot worse off than before. Maybe try to get a part time job that will keep you out of the house more and give you more independence and budget.",
            "I don't have much advice for you other than an idea to give you some more space.   When I was 14 I moved into one half of my basement to escape sharing a room with my two sisters.   I had a wall made out of bookcases, and slept on an old couch until I figured out how to take my bed apart and move it.  \n\nMy advice is make a plan for turning part of the basement into your room. Put as much detail into it as possible.  Think of what you would have to do, like moving boxes around or getting an area rug for the part of the basement you want to make yours.  Make sure you stress that you will do all the work and it will cost your family no time or effort on their part.  \n\nEven if your dad doesn't go for the basement idea, the fact that you put so much thought and time into creating a plan to get your own space  might wake your dad up to the reality that his child is unhappy.  I wish you luck and recommend books as an at home escape.  Rarely do siblings or parents think to mess with something as innocent as a book.  ",
            "Holy shit, OP. As a parent and stepparent, this makes my blood boil.\n\nWe have my stepsons on weekends. They get their own room--the slight bigger one--because their younger brother goes to bed 2-3 hours before them. That is the ONLY reason they're separated like this. If we have another kid, the younger two will share a room, or the older two will get the downstairs basement (which is as big as the master bedroom with its own bathroom) and the other two will have their own rooms.\n\nThe way your dad has done this is horseshit. Why can't he clear out the basement and give that to you? You're 15 years old, only 2 years younger than your older stepsister--why don't YOU get personal space? You have to share a room with two SIGNIFICANTLY younger stepsiblings?\n\nIf your dad refuses the basement option, quite frankly, I'd look into either moving in with another family member who gives a crap about your personal space/items (seriously, your dad doesn't punish the stepkids for ruining your things? BULL. SHIT.), or start thinking ahead. It sounds like you'll have to grow up a lot faster than you expected, but it'll give you a plan.\n\nConsider what jobs you can get once you're of age. Once you hit that age, start applying. If it means you take the bus, so be it. At that age, see if any of your friends want to rent out an apartment together--at least then you'll have say in what's going on.\n\nAs for your dad's punishments--well, I can't say this is the BEST way to go about it, but when I was kept home or grounded or banned form TV or whatever, I read. A lot. Keep your nose in a book that interests you. It's a lot harder for a parent to justify banning you from books, and once you find the kind that interest you, it'll give you a place to escape while you read. That should at least give you a coping mechanism for when you're stuck in a place you hate to be.\n\nIf possible, I'd also speak to a school counselor and ask if they have any other coping mechanisms they can recommend.\n\nI'm truly sorry. Your father and stepmother are embarrassments on blended families. You don't make one kid sacrifice; EVERYONE has to be a team player. Putting all the onus on you is shitty parenting. He's turning you into the scapegoat. I imagine your mother would be ashamed of how he's behaving.",
            "How did your dad react to the watch thing. Everyone else is sort of glossing over it. But you need to raise hell about that. They broke a momento of your mother who died from cancer. That is messed up. And tell them to keep their hands off your stuff tell Jenny to shut up get out of your face because you didn't invite her into the conversation and you are done being nice. \nActually ignore all of that advice. I forget sometimes people are not as abrasive as me. I will try to be more peaceful. Tell your dad that you feel like he is choosing this woman and her family over you and you feel betrayed. They broke something given to you by your mom. His first wife. Does he have any emotions left? Why is he not fixing that watch or taking away their allowance to fix it? Also, tell Jenny that from now on she is not to speak to you unless you directly say so. Next time tell those kids to keep their hands off your stuff from now on. And if she buts in put your hand in her face and tell her \"Hush I'm not talking to you right now\" and turn your back to her\" Say she has been acting like a prissy queen for too long and you are knocking her off her throne. So she can screw off. Actually that sounded abrasive to. Well you get the idea. Just do it nicer somehow.",
            "You could go live with other relatives if the option is open",
            "I'm sorry you ended up in such a shitty situation, I really feel for you. \n\nStand your ground with your step-siblings; do not be mean or unkind (that's ammunition for them to use against you), but be firm and make it known you're not cool with their violation of your boundaries. I know it's exhausting but the more you do it the easier it gets, trust me. If you don't show any signs of weakness and are consistent in your attitude towards them, they might just back off. Hell, maybe even respect you. They're probably just as pissed off as you are. \n\nAs for your Dad, he's got blinkers on and is clearly pandering to his new wife & insta-family unit, and until the shine wears off (or you move out), he's not likely to see the light I'm afraid. Again, keep on letting it be known - firmly and fairly - that you are unhappy with the situation. I know what it's like to have a parent who doesn't listen to straightforward communication. \n\nCan you get a part-time job to supplement your allowance? This might help you save up a bit more until you can move out. Also, it'd keep you out of the house more. ",
            "Your father and step mother really messed up creating a situation that guarantees their children wont get on. \n\nIf you have anything else of your mother's pack them up and ask one of your relatives if you can store it at their house, or just hide the box if that's not possible. \n\nGood news is you only have to put up with this until you graduate, study hard, get a job once you're old enough and save money like crazy.",
            "I really feel for you, it sounds like your father really can't see what he's doing. I have two suggestions. \n1) send him this thread if you think he's be receptive to it.\n2) do you have a school councillor or trusted teacher you can talk to? Maybe they could help meditate a conversation with your father. ",
            "If your dad is constantly working overtime, I do not understand why any of you even get allowance or eat out...",
            "I really feel for you, OP. \n\nMaybe your dad (foolishly) is thinking of you as an extension of himself - HE'S had to sacrifice a lot to build a new life with this new woman, when the biggest part of that old life was you. The part that takes it over the edge is that he's putting that burden on *you,* when you never asked for any of this. \n\nI wonder what kind of dynamic OP's dad and new wife have for him to think that he needs to cater to her (and by that same extension as before, her kids) to be approved of. \n\nIf he really does think in those terms, maybe remind him that he should really be working for family unity where everyone cares about each other, instead of thinking in terms of sacrifice. The first framework results in a need for you to be treated equally, where the second has got you to where you are now. ",
            "Your post made me so, so angry for you. \n\nYour dad isn't listening to you; he is being selfish right now. He is putting his happiness in front of yours, which is a really shitty thing to do, especially since you can't just leave. \n\nIs there someone who could mediate a conversation between the two of you, so he is forced to listen and answer when you bring up examples of very clear favoritism towards your stepsiblings? Maybe a counselor in school could help. If money isn't tight, you can ask him to see a therapist (you can say you're still grieving your mom and needs outsite help in dealing with these feelings - which is probably true anyway). Then you can ask your therapist to mediate.",
            "Show your dad this post.  Tell him your relationship is slipping away.  That you are happy for his new family, but it should come at the expense of your happiness. \n\nThat's all you can do. There are shitty fathers in life. Though I can never understand the parents who follow this script, some do it with no good sense or remorse.  ",
            "Jenny should have the smaller room with you three boys sharing the bigger one. Hands down.\n\nAs far as her allowance verses yours, is it possible she has more expenses (like does she drive and need the gas money)? Will her allowance increase on her birthday? Will yours? Is she being rewarded for her academics?",
            "OP, your step sister is clearly having a rough time adjusting to life in your house. She probably wants to be there as much as you want her to be there. Make friends, as best you can. I know that doesnt seem \"fair\" or \"right\", but youre playing a game of politics now; justice is broken in your household. Right now, you've got nobody in your corner. I know what that feels like. It's important to not lose your cool. If you go ape, you step-siblings can feign innocence and win, even if you have undeniable evidence. \n\nI have a few questions:\n\n- How long was your dad dating your step mom before they got married?\n\n- Did you meet your step-siblings before they moved in? Before your dad got married?\n\n- Your dad works overtime, did he do that before, or are there significant new expenses? Does your step mom work?\n\nLet me make a book recommendation to you: \"How To Win Friends And Influence People\" by Dale Carnegie. It is your new bible. Read it, know it, practice it. Your job now is manipulation. I know that sounds wrong, but where others in your house have failed to build a working system, it is your opportunity now to succeed. Let me be clear: I am not advocating for you to lie, cheat, or prey on others here. That is a counter-productive strategy. There are a lot of positive methodologies in this book that can help you without hurting others.\n\nIf you need a copy, I suggest you procure a digital one so that it cannot be destroyed and will be forever present in the cloud. If you have no money, PM me and I'll be happy to send you a credit on the platform of your choice.\n\nThe point in doing this is that once they like you, you can begin to leverage it. Slowly at first, then more later. I know that sounds really shitty, and I promise I did not twirl my mustache just now, but you're in a shitty situation already. What you have now does not work for anybody in your new family, especially you and your dad. You have the power to change that. You just need to learn how.",
            "I don't know your dad, but this reminds me of mine. (Rant coming...)\nMine told me, \"you always have a home here..etc\" but married his wife 4 years ago and brought her & her teenage daughter over and everything changed. \nWife went through my stuff I had packed there, burned my mother's fancy candles, used my picture frames to put pics of herself in (posted a pic of herself in every room of the house as well.. Even the basement bathroom. Literally. Every room), used my personal stuff for her personal use, threw out my mother's books and decorated the house with my fancier items. I. Was. Livid.\nThat broke my relationship with my dad (not that it was particularly great to begin with) because he didn't hold her accountable. To this day I still avoid her like the plague. He tried lecturing recently on how I'm never around and \"that makes her feel bad, like you don't care.\" The moment I raised my point, he dismissed me entirely, \"Carry on. You never let go of anything.\" Fuck you.\nThat's my rant. I'm much happier having left that far behind as a memory and I've since made my own home. An important lesson here is you know how much this hurts, remember this for future.\n\nEdited: 'her' to herself.\nEdit 2: I'm not much help in my response here as reading this post made me angry. I sympathize with OP; though I hope the future of the bioparent-child relationship is not destroyed as a result of the marriage and move-in like mine was, if there is no room for compromise for OP, unfortunately, it may require patiently waiting and saving before being able to fly from the nest and build your own. Make yours happy and fair.",
            "Try having another talk with your dad.  Tell him how hard all the change has been on you and that you feel your relationship with him is being damaged.  Ask to go to counseling *with him*.  I get the whole everyone needs to make sacrifices thing, but maybe having an outside view can help you both to see how those sacrifices are being made by each member of this new family. ",
            "Your dad is being extremely unreasonable and inconsiderate of his own son, just to please his new wife and her kids.\n\nYou should explain your side of the situation and hopefully get him to understand the damage that he is doing to his own family.",
            "One of Jenny's brothers needs to share that room with her to even things out somewhat. This current arrangement makes no sense. \n\nAlso, bring the watch to your dad and tell him that it should be professionally fixed and made off limits to anyone but you. That's the least he can do for you after all these changes. ",
            "OP, I think you should sit your dad and step mom down and show them this thread. It's not at all unreasonable for them to expect you to make sacrifices and share, but they need to be more equitable in their treatment of the four of you. It sounds to me like Jenny feels just as uprooted by the transition. It doesn't excuse her treatment of you, but your parents should be stepping up and helping her find a healthier way to deal with it instead of allowing her to take it out on you or allowing her to try and drive a wedge between you and your new brothers. One thing that stood out to me- you say your dad is working a lot of overtime. If he's doing that, its likely because he has to- he has three additional mouths to feed now. Talk to him, but also be patient with him. It sounds to me like he's not insensitive so much as stressed out and impatient- he has much less time and energy but is now, for the first time in his life as a parent, having to play mediator between siblings. Granted, that's not an excuse. He made the choice to marry your stepmother and commit to being a father to all of you, so he needs to be willing to fully address these situations rather than being dismissive of your feelings. Your parents aren't doing any of you any favors by allowing the situation run unchecked- their silence is an unintentional endorsement.",
            ">This made me real angry but my dad told me that I have to be a team player and this is what him and his wife agreed on.\n\nYou know in order for one to be a team player you have to be on the TEAM. This sounds like a 1v5 scrimmage game. ",
            "There is a lot of good advice on this thread to improve your situation in the short term. However, your dad & step mom may just not do anything. This is a sad reality. So,  barring substatial changes in equality and your expected sacrifice, you shoudl still be making an exit plan. That is, how to make yourself financially stable enough so that when you are legally old enough to be able to remove yourself from this situation, you can. \n\nI moved out when I was 17, and some places you can move out when you are 16, even without legal emancipation. It's not the ideal road, but you are smart, intelligent and almost a legal adult. You do not have to take this shit forever. Can you get a part-time job and save up money to at least have some options when you are old enough to get out?",
            "Give us an update eventually OP. Personally I wouldn't have moved my shit and would have fought the entire process. Of course your father bungled the whole thing. But at a certain point you need to stand up for yourself and your property, and take matters into your own hands. Demand respect. You should have been more upright with your dad and refused to move your shit out of the room. Good Luck",
            "Do you have grandparents who you could possibly speak with about this?  Maybe you could even temporarily move in with them depending on how the relationship is?",
            "Show your dad this post. He needs to realise what this situation is doing to you. Best of luck!",
            "Can you talk to your step mom about this? Or is she against you as well? You haven't mentioned her so it seems like she is not a problem. Sit her down show her things like the watch, and tell her how hard it's been for you",
            "I had a really terrible childhood (in different ways & I will spare you the details), and my strategy became to hunker down and focus on getting out of there. Once I got out of high school, I was gone. \n\nOP, how are your grades? Are you a good and independent student as well as an athlete? An option for you might be early college.  Google Simon's Rock; it's a wonderful place where 16 year-olds who are mature can start college and skip the last two years of high school.  ",
            "Double down on your school work, get a job, try to build relationships with people who can give you letters of recommendation later, maybe volunteer. In three years you'll be able to move out and go to college with the scholarship you earned because of the good grades and volunteer work. After that fade away. When your father eventually asks why you have no relationship tell him he killed it for the sake of his new family then go no contact.\n\nIf the scholarship route fails join the navy.",
            "Reading this post makes me so sad. I was going to say tell your dad, but you did and it seems like he's prioritizing his new family. Do you have anyone else to talk to about this that might influence your dad to make a move in the right direction? Maybe your grandparents? I am really upset that they broke your belongings too, especially your watch from your dead mom. And then your dad grounds you for being outside so much...",
            "Show your dad this post",
            "Sounds like it's time to whoop some 11 and 10 year old ass.",
            "Worst situation to be in tbh, since you have nowhere to go(unless you have your grandparents that you can go to)\n\nFrom the way your dad replies, he's just lying to himself to make him look better. Endure it, get good grades then leave him for good. Take everything that belonged to your mother. Let him regret his life once he lose you and by extension, your mother.",
            "Maybe it would be best to write a letter to your dad telling him how you feel, and why you don't think it's fair because the others are not being \"team players\" either. It will be hard to ignore. Also mention that you would like to spend some alone time with him, like you used to. I hope it goes well for you!",
            "This is an untenable situation for you. \n\nAre there any grandparents in the picture? Are you friendly with them?",
            "If talking to him 1-to-1 is not possible. Could you talk to school counselor about this? Maybe he/she can arrange a meeting and talk this through.  \n\nIf all else fail, you stick with it. Keep working on the relationship with your dad, and just use the place to sleep. Work hard on school and work. I used to think I would go crazy when I was your age too, but I didn't. So, use this to fuel your determination and move out when you can. Start finding work everywhere and start saving up. 3 years is a long time, but it is not crazy long.",
            "Why not turn the basement into a bedroom for the two younger kids?",
            "Show him this thread and how you feel. Ask him what Jenny and the brothers are sacrificing? Sacrifice is a 2 way street. You give some, they give some",
            "Why does Jenny get so much more money than everyone else?",
            "To me it sounds like OP's step-mom is valuing her children above OP and his dad is not taking a stand for his child. But no matter what the cause is, there are multiple problems that need to be fixed.\n\n1. Your allowance was going to dip no matter what as soon as your dad remarried, yet your dad suddenly having so much overtime leads me to believe that he's the bread winner, so personally, I think allowence should be split as you-$60 Jenny-$50 Tom & Mike-$30 each. Or, you know, GIVING EACH CHILD ONLY WHAT THEY EARN THROUGH CHORES.\n\n2. You and the two other boys should be moved to the bigger room, and Jenny to the smaller one. She's one person, you're three, you need more room, that's that.\n\n3. Tell Tom & Mike that whether they like it or not, you're their older brother now. And you deserve the minimal respect of leaving your things alone. If it continues, skip your father and talk to your step-mom. If he won't listen to you, she might.\n\n4. Overall, talk to BOTH of your parents together. Repeatedly if necissary. Your complaints are not selfish, you deserve a level of respect that you simply aren't getting and won't get until you talk to the people who are bothering you.\n\nGood luck, OP",
            "How can your Dad have reasoned that any of this is compromise? How do the allowances and room assignment make any sense? The girl didn't compromise at all.\n\nSo your Dad is gonna be a let his wife whip him (and you)? Get your own bank account (that they don't know about) and get a job ASAP. Save money. Don't even replace the XBox. Make sure you get into college with the best aid/scholarship possible. \n\n> I spend as much time as I can outside because inside is so frustrating but this is causing problems as well. My dad keeps telling me that not being around means I'm not accepting them as part of the family while in reality it's the opposite. So I get grounded for not being around, and being around is horrible.\n\nDude...rebel.\n\nDon't let him ground you. He can't lock you in the house (if he tries call the cops on him). He can't stop you from getting a job. He cannot stop you from living. This is absurd.",
            "Is there anyway you can maybe turn the basement into a room for just you? Ask your dad about doing that. \n\nTry to ask your dad if you guys can do something alone together, and vent to him about all of this. If he says anything about sacrifice or being a team player, say it's not fair that the other kids don't have to abide by the same rules. If you can't make the basement into a room, ask for some kind of lock box that you can put your stuff in so they can't break it. \n\nCommunication is important. Before doing anything, talk to him about all of your grievances. He sounds like he cares about you. He might think you are one person who he doesn't have to worry about in the sense that whatever happens you will deal with it because doing so would make life easier and that you are alright with this. Just tell him what's wrong and he will help you feel better.",
            "You need to tell your Dad to stop being selfish tell him what they did to the watch if he fails to see your problem i suggest contacting grandparents or uncles and aunts  or maybe a orphanage.\n\n15 year olds should not have to deal with this pain this is not petty sibling fights this is straight up fucking up someones life if he is willing to make your life a living hell for another woman and step kids that sound like irritating little brats then you are better off leaving it made be hard but be strong it is for the greater good.",
            "As an intermediate measure, I would suggest a footlocker with lock to minimize the damage. Boys are animals. ",
            "OP, a lot of the advice that you're receiving thus far in this thread is only going to create more conflict and make your life more miserable.\n\nThe first thing you have got to realize is that Jenny and her brothers hate this situation as much as you do.  They probably feel the same way about your dad as you feel about your stepmom.  And they definitely feel the same way about you as you do about them.  It's a shitty situation for a kid, especially a teenager.  This is not the family you grew up with and the life you expected.  And they're feeling the same thing.  In your interactions with them, keep that in mind.  You haven't done anything to deserve crappy treatment, but you're all kids and you might be taking this shit out on each other because of the shitty situation.\n\nWhen the younger kids fuck with your shit, deal with your father.  If you haven't already, let him know ASAP about that watch and what it meant to you.  I can't imagine that he'll let that slide without at least speaking to your stepmom.  Then ask if they can work out an arrangement to repalce your XBox if they were responsible for breaking it.  Perhaps you get part of their allowance until it's repaid or replaced.  But deal with your dad.\n\nBe cordial and respectful to Jenny.  You guys have to live together, but you don't have to like each other.  As long as she respects your space, respect hers.  And if she violates it, speak with her and give her a chance to resolve the issue among yourselves.  But if that doesn't work, go to your dad and explain the situation.\n\nYou can complain about the room, but you've probably lost it until she moves out.  Although it seems far away, college should be your goal.  A good one where you'll need to leave home.  And after that, graduating from college with a decent degree so that you won't have to move back home.  Until then, make home a place where you sleep, not where you spend your time.  Get a good extracurricular at school, that will keep you from home until later in the day (and stick with it, it look good on college applications to have passion for something).  Summer may suck, but see if your father will pay to get you something that will keep you out of the house.\n\nFor the next summer, their are a ton of summer academic programs at colleges that, 1. Will look amazing on your college application, 2. Will keep you out of the house and 3. Will make you some great friends and give you great experiences.  You need to apply during the school year.",
            "Sorry for the loss of your mom.  The good news is that you are 15, almost 16 and can get a part-time job.  Include that with finding a place to do some extra studying, maybe a local library.  In short, you are getting an opportunity to grow up a bit quicker.  I know it sucks but this is going to make your life a lot easier down the line.\n\nTry to get along with your siblings and make their life easier.  \n\nI know the first reaction is to try arch your back and settle in for a battle but I don't think it's worth it.  You will be better off taking the high road, establishing your life away from your new siblings.",
            "Do you have any extended family or close family friends? I feel like it would be helpful if you had an aunt, grandparent, or just another adult to help speak on your behalf.",
            "Getting a job and joining activities and clubs will get you out of the home more.  Tell your dad you're thinking forward to college applications.  You can save your money for college or to move out ASAP.  For your most valuable things you could get a lockbox.  Do not trust money around your brothers though, I'm sure they'd try to smash a lockbox to open it if they knew there was cash in it.",
            "Lots of commenters have made very good suggestions and I definitely agree with showing him this post - this is insane. I hope things get better for you",
            "Good advice here from everybody but I wanted to add: Nothing scares parents more than to have screwed up so bad their kids want nothing to do with them as adults.  Talk to your dad and tell him you only have three more years with him and once you're 18, you are out and you won't forget how unfairly he's treating you now. If he wants to have an adult relationship with you at all,  he needs to start showing he cares about you more than his new wife.  ",
            "It sounds like your father is working really hard to look good to his new wife. Is his new wife doing anything to get to know you and look good for your dad?\n\nHonestly your story makes me cry.\n\nWhat I see is that your mom and dad made this beautiful life together. Got married... bought a house... made a baby... filled the family with love..\n\nThings went horribly wrong...\n\nYour dad, as he should have, has moved on.. however instead of bringing you with him and building a new family for the two of you, you seem to be in the way of his new life.\n\nI really hope that his new wife is not the problem here.. because if she was/is not totally into you being in her life then your dad should have moved on... It may be that his heart was so broken and he latched onto this woman he would have been totally perfect if he had been childless.. but he isn't.\n\nUnfortunately sometimes parents put their happiness first in these types of instances and completely overlook the promises that they made when they brought children into the world...\n\n\nSooo.. what I would ask your dad is:\n\n\"Is me being in your life a sacrifice that you have to make now that Mom is gone?\" \n\n\nIt is important that he know that you realized that after mom died, it wasn't going to be you and him making your way through the world as a duo forever... That you wanted him to find love again and be happy but that you never expected that him being happy meant that you were in the way.\n\nTell him that you feel like more of a possession than a living breathing part of his life. When things were awesome, you were important... but now that he has a new life, it seems that there isn't enough room in the house for you anymore and instead of people all finding a place to fit in, you are being pushed out.\n\n\nI also agree with others about the room. The 2 brothers should have moved in with you, not you completely be put in a corner of the office... If your dad and his new wife cannot afford a larger home they need to do better than this.\n\nThe allowance is also ridiculous. Their mom should continue with their allowances and your dad should continue with yours.\n\nHow is it that your dad does not see that him getting married took away everything for you? Including, it seems, his love.\n\n\nEDIT: I just want to add... When parents believe in their children, listen to them and love them they create a world where the child can make their own way.. where dreams come true and where the results of hard work can be envisioned... \nWhen parents brush children off... try to make the child say and do and be what the parents needs at the moment so the child isn't a burden... when the child has to fit into the parents life... an environment is created where the child is always working for attention and love and his/her own hopes and dreams become things that are unimportant and unobtainable...\nIf your dad is reading this.. please do not break your child... Children are not throwaways... and once you break them they don't go back the way they once were. Don't you love your child anymore? What you are doing is exactly what happens when a puppy grows up and isn't fun and cute anymore for those who bought a puppy for entertainment, so he gets chained up and forgotten. Your child is not a toy, he is a living, breathing growing person who will be his own adult very shortly... Don't you dare give away all his opportunities to your new wives daughter.\n\nI am so angry at your father right now... So angry!",
            "If you have grandparents that you get along with well, I'd ask your dad for a private moment tell him everything everyone else has said if you get no where you can give him an ultimatum and threaten to ask your grandparents to let you move in with them.  I've done that in the past and it helped my situation out tremendously which was a bit different but it could help.  Sorry you have such a shitty situation.",
            "Find a full time job after school, and when on weekends just go out with your friends. You won't be seeing much of your \"family\" if you're always busy",
            "Is it possible to convert the basement into a room for you?",
            "You really have my sympathy. I grew up in much the same situation. My dad remarried when I was 7, my step mother had 4 kids already. Dad gave his heart and soul to his step daughters who came to idolize him. My step mother barely tolerated me, and treated me as a servant. I don't believe my dad realized until many years later how much damage that did to me.\n\nDo you have any other adults in your life, preferably on your father's side of the family, who might mention to your dad that you're being treated like the least family member?\n\nI wish I had better advice for you. Hang in there.",
            "I think, to an extent, your Dad is right about sacrifices.  You're not going to have the same amount of space you had before with three kids moving in.  \n\n16F is an immature fuckwit.  Ignore her 100%.\nThe young boys need to be told not to touch your stuff etc but at some point you have to expect kids to be kids and maybe consider locking up anything important or valuable.  Have you tried talking to the step mom about the kids damaging your stuff?  She may actually be a decent person and willing to discipline them even if your Dad isn't.  \n \nAllowance is the one thing that is really ridiculous, but you're old enough to get a job.  I don't think whining about it to them will score you any points even if it's unfair.\n\nIf they continue being shitheads and the parents refuse to step in it may be worth talking to a school guidance counsellor.  ",
            "OMG, I swear this is so familiar... \n\nhttps://www.reddit.com/r/relationships/comments/4e5g1v/my_two_girls_14f_1_8f_are_giving_my_step_son_16m/\n\nOk... I know the ages and genders are a little diferent and the post has been removed :( but I swear this was your stepmom posting about this... ",
            "I am a teacher for people your age. Pick a teacher at your school - anyone that you feel is most responsive or you have the best relationship with. Tell them exactly what you said here, or show them your original post. They will have the skills to know which counselors in the school would be best able to serve you, or direct you towards another source that would be helpful in understanding. As teachers, we are bound by law to help protect students and most of us take that responsibility very seriously.",
            "Dear me, what a tough situation for you to be in at such a young age.   How was/is your relationship with your dad, pretty close I'm assuming?  \n\nHonestly, if my son ever sat me down and told me what you've typed, I'd be deeply concerned and make moves to do something about it.  \n\nYou have written your post in a clear and honest way, that deserves respect.\n\nTalk to your father again.  Tell him what you told us and remain calm whilst you do so.  Try not to let anger get the better of you, even though I'm sure you're feeling pretty angry about it all.  \n\nIf you were disappointed in the outcome of your last talk, have you thought about writing to him instead of talking?  I often find I'm able to put my thoughts across better in words than in speech.  It gives me time to reflect on my words and can help avoid escalating things into a fruitless argument.\n\nAbove all, don't bottle this up and remember, this is a major life change for everyone, so you need to give them a bit of slack too.",
            "Man I feel really bad for you. If we didn't live in different countries I'd almost offer you the spare room at my place.",
            "You're getting a lot of validation about your situation, and it seems like it's well deserved....yet not a ton of actual practical advice for what to do. \n\nI definitely think you should talk to your dad about this, but you're going to need to be strategic. If you go it with all complaints and \"everything sucks\", he's not going to take you seriously. The best way to get someone to accept negative feedback is with something called the \"praise sandwich\": give your criticism sandwiched between two praises. \n\nIn action, it looks like this:\n\n**Unhelpful version:** *Your paper isn't very good. You didn't even write about the topic I assigned. It's going to fail if you don't fix it. *\n\n**Helpful version:** *I have your paper, and I can tell you spent a lot of time and effort researching X. I think you're going in the wrong direction, as I'm really looking for Y. That said, your writing is persuasive, so I think you'll be able to make a solid argument if you change your focus a bit.*\n\nYes, some of the specific language is a bit softer, but the overall message in the second version is still better. Good aspects are acknowledged, and specific feedback and something to work on is presented. \n\nIn terms of dealing with your dad, you're going to need to validate some of his decisions, of he'll hear the first version. I suggest something along the lines of *\"I'm glad you married $stepmother, I think she really makes you happy and I really want you to be happy. I'm struggling with my new living arrangements, and I'm hoping you can help. $Stepsister keeps saying $meanthings to me, and it makes me feel really bad. I also need some help getting $stepbrothers to respect my stuff, because they keep breaking things that are important to me. I don't mind sharing $Thing1 and $Thing2, but maybe you and $stepmother can make a rule for them about $MyPrecious.\"*\n\nGood luck!",
            "Does your dad have a good, log time friend that you can talk to? It could be that this friend might be able to get through to dad. The friend might also have some concerns o their own. ",
            "I'm going to say this in the nicest possible way... your dad values the pussy he is getting more than you. Simple as that. It's not going to change and there's probably nothing you can do about it. ",
            "When we bought this house my husband tried to give his son from a previous relationship the significantly larger bedroom, with the MUCH larger closet. It happened to have an attached bathroom that could also be accessed from outside. I would be storing baby gear, accessories, saved clothes for new ones, clothes for TWO growing girls, and beds and toys for two.\n\nMy husband got in a huge huff because his eight year old son needed privacy (for what???) and his own bathroom. Hello, that's what towels and robes are for. The girls got the damn bigger room with the big closet. That made SENSE. What your dad is doing makes no sense. The three boys need the bigger room in your case; that's just crazy. Princess needs to be put in her place. I'm so sorry you're going through this.",
            "Ask your dad for a combination lockbox for your valuables. Take a look at the basement, is there any chance it's easily convertible into a room for you? Encourage Jenny to aim towards going to college out of state. Ask your Dad if he can sort out getting your Xbox fixed or replaced since your steps broke it.  \nAsk him politely to outline Jenny's \"sacrifices\" to make you feel better about yours.  \nAre your mum's parents still around? Maybe getting closer to them might be nice and provide you with a potential backup home if things get any worse where you are.",
            "Your dad has completely dropped the ball on parenting here. I cannot imagine *ever* making the choices your father has made in regard to handling a blended family. Really disgusted, to be honest.",
            "It's the age of smartphones and surveillance. Record the conversation with (android) smart voice recorder and lure the new girl into a conversation where she belittled you. In the conversation respond normally, be reasonable, and don't raise tour voice. If she hits you or makes non verbal responses, say what she's doing in an Incredulous way (like: really? That's what you're going to do? Hit me and break my stuff right in front of me? How would you react if I did that to YOUR stuff? \n\nIf dad doesn't listen then, go to a guidance counselor as school and tell them that the situation is making your school life hard to deal with and you really need help... They'll call dad and send him a meeting request. Then you'll get a supervised meeting with a counselor and your dad. ",
            "OP there is nothing i can say that hasn't been said already just keep up updated and don't back down and don't give up continue to fight for equality among your household.",
            "Do you have any other adults you can speak to or trust? It sounds like your father isn't willing to listen to you because his priority, at least right now, is pleasing your stepmother. But someone HE respects might be able to advocate for you. Maybe your father has his head so far up his own ass / is overwhelmed by the new changes, that he is incapable of understanding how alienated you feel and needs someone to tell him how badly he is fucking up the transition.\n\nIn the meantime, maybe joining some sort of young adult volunteer program can keep you busy, help you make new friends, restore you sense of self-worth, etc.",
            "Do you have any other adult relatives you're close to? I'd honestly talk to them and see if they can speak to your mother. Or maybe see if you can get family counseling.",
            "You have to tell your dad that if he don't stop thinking with his dick, he's going to lose you. You are not treated as a part of the \"team\", playing in your fathers dicks team would be a poor career chioce. Ask if you can get a transfeer or something. Nobody want to be a part of a team that doesn't give play time.\n\nIn three years, you can leave. Remind your father of that. Be honest. He'll be able to bench you on his dick team for three more years, and after that he may lose you forever.\n\nAnd tell him to grow some balls. Playing on a dick team without balls suck big time. He should get out of that raggy old dress and get his son the life he deserves.\n\nAnd tell him a genius on the internet said he's a failure as a father.",
            "Jeez, your Dad sounds selfish. If he can't afford to move to a home that accommodates 6 people, he should not have acquired 4 more family members. \n\nCan you get a summer job to earn some money? If he has to reduce your allowance now itself , then it looks like he will not be able to help you with getting a car or going to college etc. ",
            "[removed]",
            "You're dad's a loser who sacrificed his own flesh and bloods well being so he could fuck some lady and raise her kids. You can try and talk to your dad but I honestly think he'll be too much of a wuss to stand up to his new wife and her kids.",
            "There are two options(actually the or four but two real options). I REALLY hope you get a chance to read this. Number 1 is you can sit your step mom down and discuss this with her. Tell her that you want to get along and be a team player but her horrible children (don't really say that) are making it difficult. Just say \"I want everyone to get along but Jenny treats me like crap and the smaller ones don't respect boundaries. If she is a reasonable person then you can come to a level of respect and reach an agreement. If she isn't a reasonable woman then it makes option two the go-to. I would normally not suggest this of a child because I'm big on respecting parents and elders in general. But it sounds like your dad is a bit of an ass. And this step mother could of could not be a much better person. Just kidding from the post I'm going with the latter since it appears she hasn't raised respectful children. Anyways on to option 2. If your going to be grounded and punished anyways... Then do whatever you want. Not be a horrible kid. Still do your school work and be a decent human. But if people aren't giving you any respect then there isn't much reason for you to show respect either. You have to give respect to earn it. And that even goes for parents. If he forces you to be around people who treat you like shit then show him he can't force you to be around it. Make your own curfew. This goes back to bring decent human. Not just \"I'll show him and stay out til 3 am \"... But \" I'm gonna get out of the house until bedtime \". He will ground you and take away your allowance. And probably try to find other punishments. And it may take 2 times... It may take 15... It may never change. But you can tell him that your tried communicating with him and he was busy choosing to try to make his new family happy at the expense of your happiness and disregarding and not caring about the resentment he is causing. In true relationship fashion in sure 75% of people are going to suggest talking to a therapist. But that doesn't sound exactly like it's likely to happen. So communicate with step mom. Then you can try talking to dad one more time. Then it's time to just do what it takes to preserve your well being. Whatever that may be.",
            "Your dad doesn't seem to understand that he's burning the father-son bridge between you two. He is literally telling you \"you have to be a team player, you have to do all these things, but the other kids don't.\" \n\nThis is how a parent becomes estranged from their children (the beginning steps, at least.) My father told me to \"stop being a selfish teenager\" when at 14, there were kids going through my stuff, who weren't even remotely step/related. \n\nThis is how a parent teaches a child that they're not a priority, and that their voices and boundaries are not valued. \n\nThis post made me so sad for you OP, and so angry at your father. It makes me want to ask him \"what in the ever loving fuck are you thinking?!?!?!\" and try to wake him up to the reality of his massive fuck ups here. \n\nI am *so* sorry. You deserve a parent who prioritizes you and your needs. Please consider contacting your mother's side of the family and trying to move out. You need an adult advocate, because it's clear that your father doesn't value your voice. ",
            "dont you have any relative that you could move in? no uncle or grandparent?",
            "All the other suggestions are excellent, I just like to add that it might be possible to have the basement refinished into a small bedroom for you. You would get a lot of privacy back and security for your possessions. If your dad will hire electricians, you can even spin it as you can do all the work and learn a skill in the process.\n\nEdit: plus, it's an investment into the house. It will add value if he ever wants to resell it.",
            "Oh kid, this is rough. Talk about \"blended families\", huh? that said, you're in the middle of everyone negotiating their place in the pecking order. YOur stepsister is not mad at YOU, per se, she's mad at her mom for splitting with her dad and marrying *your* dad. You're just the innocent bystander. Your dad just wants a new wife, so he's listening to your concerns with half an ear. So now you're going to have to grow up a lot faster than you planned on. Keep your eye on the horizon. Meaning: start planning for your future when you get to go away and live your life in a happier way - *your own*. Get the best marks you can get in school, with maybe the promise of going *away* to college, where you can be your own person again. Plan for a career that will support you out on your own. In the meantime, do little things to try to at least be friends with your steps. I don't mean to be phony, but try to be kinder. These kids got screwed over just the way you did.",
            "Wasn't there a post recently from a Smom that was in this situation? Her daughter was being horrible to her stepson and he had given up so much for them? Do you think that could be your stepmom? I'm sorry I don't even know where to find it. ",
            "OP, I recommend saving up a good bit of that money (and more when you get a job) to buy a decent-sized personal safe. Lock and code/key, everything. I used to have to deal with siblings taking and breaking my possessions, and that's the last thing you need on top of this dramatic shift in dynamic and treatment.\n\nYou may not be able to do much about it unless you talk to your dad, but I still believe your best bet will be to purchase a safe. A decent-sized one to start will be about 100$, but it will be well worth it. Use that allowance.\n\nIf you get questioned for buying such a thing, I would make it a point to bring up your watch and the xbox (both very expensive items), and explain that such blatant disrespect for basic privacy and property is unacceptable. And since none of those kids are being held accountable for their shitty actions, that's one of the most reasonable courses of action to take. If your stepmom and dad can't control these kids, you have to step up and take control of the situation in any way you can. Good luck.",
            "OP, when I was in high school I went through something very similar, but with my mom rather than my dad. From my experience, I feel like the new marriage and additional family members are clouding your dads' judgment. In my moms' case, she was too insecure in herself and her relationship to stand up to my step-dad, and when I stood up for myself I just caused more problems for her. I'm not defending how your dad is acting, just giving you a new scope to look at things so you could frame your next move appropriately. You're being treated unfairly, that much is clear. Write your dad a letter, or maybe seek out a third party adult to confide in who your dad could respect enough to listen to. ",
            "Do you have any uncles, aunts or grandparents you could talk to or live with?",
            "How big and nice is your basement? Can you and your Dad fix up a portion of it and make it a room for yourself?\n\nIt won't resolve the issues with your dad not listening to you but it might give you a little personal space you can call your own again.\n\nI do agree with your Dad in that some sacrifices are needed. But I think many of the decisions being made are not intelligent with regards to things being fair for the children. Also your step sister seems overly rude.",
            "Do you absolutely have NO family members you can stay with? Even an aunt or uncle? \n\nI feel so bad for you. I'm childfree but if I had a respectful, quiet late teens relative like yourself, I'd open my home to you in an instant to give you some peace.\n\nYou need to get out.",
            "You need an advocate on your side.  \n\nIs there a teacher or a guidance counsellor at school who you trust and respect?  \n\nIf you print up your post, take it with you and use that as a basis to explain things to them, that might be a good start.  \n\nYou could also say that you don't want home life issues to impact your school life and grades... so you need help in figuring out what your options are or what the best plan of action to move forward would be.  \n\nAlso tell them that you don't feel heard, listened to, respected and really need an objective adult to give you support.  It would also be to your benefit to remind them of the trauma and upheaval your life went through when you lost your mom.  \n\nGood luck and please post again and let us know how things are going. ",
            "Could you clear it out and move into the basement since your stuff is already there. And put a lock on the door.",
            "I really doubt your father is going to change, even if you find a way to articulate your issues to him in a mature and calm manner. \n\nDo you have family anywhere you can go be with, like grandparents or aunts/uncles? You need to do what's best for you long term and that might mean living somewhere else until you graduate and supporting yourself once you hit college age. You might also find that this is the wake up your father needs to realize he isn't treating you fairly. \n\nWhatever happens, I hope it works out for the best for you. This is horrible for you to have to deal with after losing your mother. ",
            "Sorry this is happening to you. Sounds ridiculously miserable. I know I would be.\n\nJust hang in there and move out. That's all I can say. You can do it. And talk to your dad. I know it didn't really work the other times, but really let him know that you're so miserable and everyone treats you horribly, including your dad who pretty much dismisses you, that you want to leave. If you can, try to gather all your valuables and stash it somewhere in the basement. Then ask a few friends if you can stay over at their place time to time, if they're ok with it. That way you get some space. Good luck.",
            "Hi! I went through something similar as a child. My room was shared with a step sister. And she slowly got nice furniture as I kept the same small child stuff. Money was spent on her all the time while I felt shafted. Her mom was the purchaser and her mom loved her. \n\nThere's something magical that happens at age 16. You or your friends get cars/licenses. It was freedom. I left the nest and was there just enough to eat/sleep/shower. \n\nAs a parent now with some perspective, your dad and his wife need to establish their roles with all 4 of you. This older step sister shouldn't be parenting you at all. With any luck, she'll be gone soon. \n\nAs an adult, I have no contact with my step siblings. We are in different states with different lives. In your case, focus on making yourself better than them. Regardless of what sister says, the younger boys may look up to you as a role model. You aren't the black sheep. You aren't a weirdo. Do good in school. Get a part time job and save up for a car. Earn your freedom and set an example. \n\nI'm sad to say, it'll never go back to the way it was before. My memories of pre-step family will always be cherished. I maintain a separate relationship with my dad and have come to realize he will grow old and die with this wife of his. He can \"choose\" his kid now and lose the wife. You're going to grow up and move out and this step mom will still be there. ",
            "You should suggest therapy/counselling, maybe just for the two of you to start. You can lie to get it: I know I've been acting out, so can we get some help for me to adjust to these changes? Then explain to the counsellor how you feel. Try to focus on the more important things first: they stole and broke your dead mom's watch and got no consequences, your step-sister verbally abuses you and gets no consequences, they make it so you hate being in your own home and are afraid there and get no consequences, and if you try to stay away, so that you could feel safe from harassment, then you get the consequences. I know that all of these things are important to you, and I totally get what you are saying, but if you start the discussion with things like having to share a room or not getting your favourite foods, adults will think you're just complaining about being in a blended family. The situation isn't that you need to share a room or that your allowance was reduced, it's that your father has decided that, of the 6 people living in your house, one (you) needs to be a \"team member\" and the rest can do whatever they like with no consequences. You are used to being your dad's first priority. It was obvious that his priorities would shift after his marriage. But now you're not even on his list of priorities at all. His priorities are: making his wife happy, making his step kids happy, making himself happy, making sure you're sufficiently punished for wanting to live safely  in your own house. I hope your dad snaps out of it soon. If he doesn't, I know that 3 years feels long, but it will end eventually. Then you can get out and never look back. \n\nOne supplementary suggestion is to have lots of excuses for being out of the house: join all possible teams and after-school activities. Spend a lot of time in the library doing homework. Maybe even get a part-time job. \n\nAnother suggestion, only if nothing else works, is being honest, with your dad and with every other person in your life, every single time. I think you probably care about your father and try to please him or not make him look bad in front of others. Don't. \"How is it living with new step siblings?\" \"It's really shitty, mainly because they call me names and steal my stuff, and then I get punished for it.\" \"Why are you joining all these clubs?\" \"Because otherwise I would need to stay home, where I get called names and my things get stolen and broken.\" I'm a firm believer in not making things easy for people who don't deserve it. Right now, it's way easier for him to punish you for existing than it is for him to talk with his wife or control his step kids. Make it hard for him to keep doing what he is doing, by clearly stating, to him and everyone else, what's going on. Don't let him lie to himself by pretending this is just about you being spoiled by your allowance or something. This is about you feeling unhappy and unsafe in your own home. This will definitely cause more conflict, so don't do it unless you've tried other ways of communicating with him.",
            "You could get a job to get out of the house, or involve you with a lot of extracurricular activities. There's always the option of getting a GED and enrolling in college early. ",
            "It sounds like your stepmother is trying to provoke you into either some massive angry confrontation to give herself the moral high ground or into you simply leaving the house so she can have all of your dad's attention.   She's effectively trying to constructively dismiss you from the family, with a drip drip drip manipulation on your father.  What would your mother say to him if she could see what is happening?\n\nDo you have any living grandparents or aunt/uncles who could talk some sense into your father? ",
            "I know this doesn't fix all the problems but you said your house has a basement? Would it be possible for you to make yourself a room there? At least that way you could have your own space, and most definitely get a lock box for your valuables! You need to sit down with your dad and stepmom and have a conversation about the things going on and they should also understand that your life's been turn upside down. I mean you went from just the two of you, to adding four people to your family unit. I can tell you from past experience, (I had a horrible stepmom growing up, she's much better now that we are all adults) bide your time. Three years is a long time, get good grades and stay out of trouble and then get the hell out of there! I hope it gets better for you! But your stepmom sounds like a POS, and her kids can do no wrong in her eyes. I'm sorry you're dealing with this, OP. ",
            "Can you go to ACADEMY SPORTS and get a safe to lock-up your valuables?... Esp your mom's watch. (You can replace the watch-face, at least.) I'm sorry. Get a job. Get a bank account and save. Get ready to move out once you start college. ",
            "I notice a lot of talk about sacrifices you need to make for them.  But if your dad is working a lot more than he used to, and yet there's less money available, that tells me that your new stepmom and her kids are getting substantial resources from your Dad.  So are they sacrificing for the team as well?  Or this all \"You and your Dad sacrifice, they reap the benefits?\"  \n\nMaybe your Dad has fallen in love with a woman who has less money than he does, and so now the new family unit has a lower lifestyle than you used to enjoy.  So don't think of it as sacrificing to make your stepmom and her kids happy.  Think of it as sacrificing for your Dad's sake.  Even if his new wife truly loves him and isn't just a gold-digger, the happiness level of her kids can affect the stresses on a relationship.  So his desire to give them the best life possible is understandable.  \n\nBut your Dad needs to recognize that you're sacrificing for HIS sake, and not make that harder than it has to be by grounding you because you're trying to make the best of a bad situation. He needs to meet you halfway.",
            "I would suggest writing a script for yourself to follow, or a letter, where you outline all the issues and some potential choices.\n\nLike the game system. Look up how much it would cost to replace. Explain that the game system got broken and that you would like it replaced. Explain your ideas for how that could be done: 1) parents replace. 2) children that broke it contribute to cost. 3) all of you contribute to cost (and include how many allowance weeks that would be) as that is the most equitable way to do it and you are getting a new system, not an old one, so you contributing also gets you something better.\n\nThe watch can also be fixed. I would suggest listing options for that too.\n\nI am guessing your dad and step mom are in way, way, over their heads. Laying it out with options may get you what you want quicker, even if it means more compromise.\n\nAlso, in my experience, the adults are expecting you to be \"the least work.\" Which is unfair. Often adults think teen girls are a challenge, or small children are a challenge. I may be projecting but it seems like your dad is expecting you to \"man up,\" but that isn't appropriate. Firstly, that is going to make you resent your new siblings. Secondly, that's a 20 year ago attitude, AND you're still a kid. I hope it is not the case here that this is their expectation.\n\nI don't know if there is any possibility in talking to the oldest and coming to a truce of sorts. She may be convinced to see your way of thinking on some things. You might be able to talk to her about how you are both older and could look out for each other with the parents. There will inevitably be times in the future where she wants  to go out but someone has to stay home with the younger kids. Or where you may get a job and a car and she has none and may need her. Ask her to think ahead and think about if there is ever a time when she may need you and to realise that she is either building or breaking a relationship now. ",
            "I would have sent somebody to the hospital after that watch bit....no way...\n\nYou need to stand up for yourself in some way, that at least is for sure, not sure what the best way would be but they at least have to understand that what they're doing is wrong.",
            "Hey OP, I'm sorry your situation has changed for the worst. It really sucks, especially at the age that you are and the age of your new step-siblings.....I wonder if your dad is often overworking because he's trying his best to make the situation for the whole family better? Maybe he wants to get a nicer, bigger house so you can have your own room again, so all your allowances can be more equal, etc?\n\nSounds like your dad hasn't given much thought to your concerns, and he may be brushing it off because a lot of adults think teens can get dramatic about small things. But why don't you show him this post, and ask him to really give thought to how miserable you are? You have a lot of internet strangers here who are listening to you and giving you support, please don't get too frustrated and run away! Breathe, go hang out with friends, and try approaching your dad in a calm but serious manner, or just send him this post. Good luck, I hope your situation improves!",
            "You know what you can do? Be the best you can be at school (Freshman in high school?). Get laser focused on school life, events, etc. Parents can't say much when you're excelling at school and that's what you're out for. This way you can go anywhere you want when you graduate due to having your pick of schools for university. You'll likely also be able to obtain scholarships. Don't focus on anything else but that one singular goal Take every day, one day at a time and control what you can control to make a better life for yourself. \n\nHere's the reasoning: Your step-siblings are most likely just as upset as you are. Getting a rise out of you and a reaction allows them to feel comfort in knowing that you're as uncomfortable as they are. Non-reactions or not being focused on them will cause them to get bored or turn their attention to other things. And being the new dad, your dad wants to make your step mom's life as easy as possible and that means making her kids' life as easy as possible. Unfortunately, this means sacrificing your comfort. There are two reactions you can have to this: 1. Complain your heart out and maybe get what you want, possibly making life more difficult for your dad and the step family as well as burning up any goodwill you may have built up and may be able to build up in the future. 2. Do what you can to make life easy for everyone else in the short term and build up good will, while also giving yourself the flexibility to do what you want when you're of age.\n\nEconomically and in game theory, giving yourself options is the best thing because it allows you to dictate terms of engagement in the end. You'll also grow as a person and be able to overcome struggles that come later in life. Xbox is broken? Go study instead. Don't spend your allowance money; save it and invest into your tomorrow. Most likely, your step sister isn't saving her $100/week, neither are your brothers. Leverage in life is the most important commodity. But don't just burn your leverage for what you want immediately; think about the future. \n\n\nTL;DR: Focus on the things you can control, like schoolwork and money management. Take the sacrifices, store as leverage. Your dad and stepmom, if they don't notice now, will at some point notice and realize they've been shunning your needs. If you want to be a real clear about your sacrifices, write down every time a sacrifice has been made. But more for yourself; look at it and say, what's one more thing? ",
            "Have you sat him down and told him all this? ",
            "Your stepmom must be hot as fuck. \n\nThis is some bullshit. Your dad isn't standing up for you or even himself. I think he may have to get his man-card taken away.",
            "If you can you should just move out. ",
            "Yeah dude your new family sucks. One thing you should do for now is buy some kind of safe box to put your special belongings there that way you will be able to protect the things that are meaningful to you. Try to spend the most time out of your house. I know it kinda sucks but as of now your father is not thinking logically and therefore you should try to spend the least time with them in the house. Focus on increasing your grades so that you can get a scholarship to a good university and then forget about living with those people.\n\nYou need to survive.",
            "A lot of the things here seem like a good idea. Maybe you haven't talked to him in private, in your post you said that you have talked to him but was it away from the rest of the family? \n\nAnother thing that I saw is that your father is probably also making sacrifices (working overtime to fund these bogus allowences), but it seems like it he doesn't keep you in mind in them. You could phrase it like \"Dad I know how we've all been through a hard time and in these past few months adjustment has been the new policy. And due to these adjustments we've all had to make sacrifices in different ways, but due to how you've reacted to me and how I feel about the situation I don't feel like I've been in your mind these last months. I just wish that we could change a few things and re-establish some boundries.\" I assume your a only son so if that's the case I would add this. \"Also adjusting to having siblings has been hard and how they've been treating me has been less than optimal. I'd like for them to respect me and my personal space.\" \n\n\"It's all been a lot to process and I just don't want to feel like I'm carrying the short end of everyone's stick. Once again, I know it hasn't been an easy process for anyone in the house, but I'd rather this be a negotiation rather than just a order.\" \n\nIf you go with the letter or talk route, try and make sure he's alone when he reads/hears this. I'm sure it's just as much a process for you as it is for him, and he probably took these decitions thinking that they were fair looking to him and that you could take whatever came in your way.\n\nHopefully you can work this out.",
            "OP will remember that. When your dad is old you still have no obligation to take care of him.",
            "Is you father wealthy? Because to me they found their way to manipulate him, sacrificing you in the process.",
            "Honestly, I'd consider showing this to your dad, and all our responses. Maybe it will wake him up. Sometimes you need an outside perspective to see what you're doing is wrong.",
            "Your relationship with your step-siblings sounds really unfortunate. How is your relationship with your step-mom? Can you go talk to her about how you feel? She might be able to lay down the law with her kids so they respect your space and your stuff. You are as much a part of the \"team\" and anyone else and deserve to have your voice heard.",
            "In addition to previous comment, wait for this post to fill up with suggestions, then show it to your dad.",
            "I think the mother is definitely whipping the father.",
            "Look mate, you've got to tell your dad that he can't just forgo his own kid because he's remarried. Are there any family members you have that would  support you? Threaten to move out. He can't just do this to you.\n\nI'm so sorry this has happened to you.",
            "I would show your dad this post.",
            "I'm late to the party and you've already received a lot of good advice, but I wanted to share with you that I experienced nearly the same thing when I was growing up, so you know you're not alone.\n\nMy dad remarried when I was about 11, to a woman with two kids around the same age as my little brother (4) and I. Thankfully, our mom had custody of us, so we only had to share living space during our part-time, every other weekend visits. Unfortunately, our dad's favoritism of our step-siblings was present full-time. If my brother and step-brother had sports games at the same time, my dad ALWAYS chose the step-brother. If one of us fought with one of them, he ALWAYS chose their side, even if we were right. There was a period during my teenage years where I tried living with my dad because of difficulties with my mom, and I literally went back to living with my physically and mentally abusive mother because of how I was treated at my dad's. And keep in mind, the step-kids' dad was still in the picture and had joint custody. But still, my dad was being more of a dad to them than to my brother and me. And he was letting his new wife make all the parenting decisions, even though she wouldn't let him have a say in how she parented her kids.\n\nFor my dad, he was blinded by \"love\" (aka having regular sex after years of being alone). He and the second wife were married less than a year after meeting online. They stayed married for nearly ten years, until he finally got fed-up with her laissez-faire attitude of parenting, letting her kids get away with anything, to the point where her teenaged son pulled a knife on my dad after being told not to scream at his mother. Then they separated and finally divorced.\n\nIs it similar for your dad? Is the relationship still young enough that maybe he's just blinded by the novelty of it and letting your step-mom run the show? It could be that once the \"honeymoon\" period is over, he might pull his head out of his ass.\n\nI think following some of the advice here (like showing him this thread) could be helpful, depending on how your dad handles being told he's wrong. My dad never handles that kind of thing well, so it wouldn't have helped me. Otherwise, as someone who has been here, it hurts for me to tell you that things may never really change. With my dad, when I tried to explain my feelings, I was told I was being too sensitive and anti-social with my \"siblings,\" and that I needed to get my act together and be a full member of the \"family\" or get used to being excluded. I'm hoping you are more successful. If you need to talk to someone who's been through this, please feel free to PM me anytime.",
            "Find reasons to get out of the house that they can't argue with: camp, volunteer work, extra-curricular activity. When you are old enough -- if you can -- get a job.  That will both put some distance between you and them and give you a foundation to get out as soon as possible.\n\nYour step-mom sees you as a competitor for your father's attention, money and affection -- and that's a fight you can't win as long as your dad has the hots for her.\n\nAnd since all of those are good resume builders you can just say you are trying to be a successful adult -- it has nothing to do with them -- why would it?  That will be hard to argue with.",
            "I just want to validate your emotions that this is crazy. Why are you being treated lesser? Why are your new step sibs allowed to break your things? Perhaps you could look into a scholarship to boarding school or see if you can set something up with a friend's parents (spent every weekend at their house.. Some people are mad chill like that).",
            "!remindme 3 months",
            "remindme! 2 months",
            "Don't stop voicing your grievances to your father. When he comes back \"you have to make sacrifices,\" you tell him it's unfair that you're making too many sacrifices without you ever getting to voice your opinion about what was going to happen. Do you not feel like you got replaced with the stepsister? I think I would.\n\nExplain to him you feel like you're being treated like a 12 year old triplet to your two stepbrothers, and that it isn't fair for you three boys to share a smaller space or that the stepsister gets more than twice what you're personally getting now. That maybe it should be split $60/$50, but not $75/$35.\n\nFinally and most importantly, remind him that YES, this situation isn't going to last forever. BUT that someday you will be living on your own and will be able to choose what kind of relationship you and he will have when you're an adult. That if you go through the next three years feeling like you never mattered that much compared to his 'new family', that if they were treated as always more important to him than you were, then your father-son relationship is not going to be what he hopes it will be when you get older and have your own spouse and children.\n\nYou have little or no power right now. It sucks, but that's just the way it is. But when you get older and can get out on your own, then you will have all the power to decide what kind of relationship you'll have with your family and stepfamily. Because if everything goes like this till you move out, you won't want a relationship with them later in life. Not any of them.\n\n",
            "Tell your Step-Mother.",
            "It sounds like everything was done to cater to Jenny. If she were to get her own room, it should have been the small one. 3 kids sharing a small room is ridiculous when other arrangements are possible. Please show this to your dad, OP. Also agree with talking to a counselor at school. You are the only one making sacrifices for the \"team\" which is completely unfair.",
            "Everyone else here covered good advice, so I'll just throw this out: next time your step-sister lashes out at the boys, stick up for them. Guarantee their behavior will turn around.",
            "Have you asked him about you and the boys moving to the bigger room. I know it wouldn't help much, but it make alot more sense for 3 people sharing a room to have a bigger room than just one person and you might have more space. And for the going through the stuff maybe trying getting a small lockbox for your valuables?",
            "3 more years buddy. You can make it. Try and do things to get out of the house, definitely get a job when you turn 16 to get out the house n get your own money. Fuck those people. ",
            "THe next time she tells you that you can't tell her kids what to do, look her square in the eye and say \"Fuck you, you're not my mother.  You can't tell ME what to do.\"",
            "I agree. Show this letter to everyone in the new \"family\". ",
            "It sounds like Jenny is mommy's favorite and Jenny gets what Jenny wants.",
            "Do you have a job or do extra curricular activites? Might be a good time to get into those things. I joined drama and did set design while working. Kept me out of the house and then when I got a bf his family knew my situation and let me live there. \n\nIt also helps you save money so you can move out sooner and buy a car for yourself so you don't need to depend on your family st all when you turn 18. I was very happy I planned to move out at 18, started planning at your age.\n\nWhere is your mom, can you live with her? ",
            ">I complained about all of it to my father last week and he told me that family is all about sacrifices, and I have to make mine. Haven't I made enough sacrifices already? I feel like I'm the only one making sacrifices. I looked forward to them moving in here but I now feel like an outsider at home, it's not my home anymore.\n\nBelieve me, you're dad is making sacrifices too.  He's married a woman who sees nothing wrong with walking (stomping) all over her partner, and you are now getting caught up in that.  \n\nTry taking a step back and doing some observation.  Why, exactly, is your dad now working so much over-time?  What's his life become?  What has he lost or given up?  You've lost your room, your privacy, and apparently a lot of your dad.  Stop and watch and see what he's lost.  I bet it's a lot as well, quite probably more (it's like an iceberg, you'l miss most of it unless you really look).\n\nYour dad seems weak.  He's letting this happen, and apparently hiding from the consequences.  That's terrible, and everything that falls on you is of course completely undeserved.  Your dad deserves his fate, but you don't.\n\nI'm sorry.  It's sounds miserable.  I have no advice.  People like your dad don't generally react well to people telling them the truth about their lives - and especially not from their children!  But, I just thought you should realize the reason you've lost so much is because of this over-bearing, uncaring, selfish woman and a weak father.  And that you're not the only victim.",
            "your dad is not going to do anything. you need to stand up for yourself now. this might seem extreme but you might need to slap some sense into your step sisters/brothers.\n\nobviously the younger ones are just playful so dont kill them or hit them but jenny is 17. since she says shes not your sister and youre not her brother, why would you let a stranger push you around?? just give her a slap or two. it doesn't matter if you lose the fight just keep slapping her and she'll know to leave you the fuck alone because your dad obviously is not doing to do his part as a dad. it doesnt matter if your stepmum or stepdad comes in and scream at you later. just keep doing it.\n\nand you are going to want to move away when you get into college/university so yea.",
            "Sorry but this is pretty similar to my growing up situation. Not really a lot you can do, but if step monster gets physical go to the police first, not dad. Newlyweds will sweep shit under the rug. Best you can do is to stay out of the house until you can move. That was the only thing that made it better for my situation. Ten years later and I still harbor a little resentment to be honest.",
            "If your step sister gets aggressive, I would get physical back. She's only 1 year older, you should be able to take her. This will be unpopular on Reddit, but if your parents refuse to reign her behavior in that leaves only you to put her in check. Same goes for you're younger step siblings. If they break your stuff, demand thier allowance goes towards fixing it. If your parents fail to do so, I would take something of equal value from them.",
            "I'm sorry but I couldn't even read half of it since it made me extremely angry. I would rage and make those little shit respect my authority. ",
            "Are you a religious family with a pastor or similar figure? If so go to your pastor and have a talk,a cruel reality check is in order\nYour father letting the fact your mothers watch got broken is horrible example for you and a dam shame to HIS wife.\n\nIf your not religious go to a guidance console or similar \n\nAlso start documenting stuff,like how jen treats you like crap.\n\nIf you really feel hopeless start treating him like shit as  last resort "
        ]
    }
]