[
    {
        "post_id": "42vdem",
        "author": "Throwawayavegan",
        "title": "Me [29F] with my vegan coworker [29F]. I don't know how to deal with her.",
        "url": "https://www.reddit.com/r/relationships/comments/42vdem/me_29f_with_my_vegan_coworker_29f_i_dont_know_how/",
        "score": 2376,
        "num_comments": 964,
        "created_utc": 1453863443.0,
        "selftext": "As the title states, I have this vegan coworker (we'll call her Vegan) who is very active on FB and in the office about being vegan and how cruel farming is and everything.\n\nEach to their own. I don't necessarily disagree with her views on animal cruelty but here's the thing, I'm a hunter. Not a trophy hunter but I do shoot feral pigs, rabbits, ducks (introduced, classified game ducks) and foxes and I fish too.\n\nAll except for the fish are classified as pests, foxes especially kill native wildlife and farm animals and farmers will often put you up on their property for free to hunt them.\n\nI have passed tests here, especially for identification of game ducks vs protected species and practice ethical hunting, i.e. allow the animal to have a fair chase, no dogs or tracking devices, practicing marksmanship and dispatching prey swiftly and humanely and not wasting the meat.\n\nNone of that is obviously good enough for Vegan. When she first came onto the team and told everyone she was vegan, I kept my mouth shut about my hunting. I also think she's really intolerant because she preaches to people about how going vegan will help with their various ailments and always turns up her nose at people heating up meat in microwave. As a result, we've kind of consciously started excluding her when we get up for lunch.\n\nHowever last year I started going hunting more regularly with a work friend from another department whose uncle owns a farm where feral pigs and like are an issue and he often swings by to have a chat about guns/bows and our next trip and she found out I was a hunter. This isn't even at our desks, it's in the kitchen area that has tables and stuff, we sometimes eat our lunches together.\n\nEver since then, every conversation I've had with her, she's referred to hunting and how cruel it is. \n\nOne time, I wore a leather pencil skirt to work and she had a go at me for wearing animal products. She seems to have singled me because of the fact that I go hunting.\n\nMy boss has no spine, I've tried talking to him about this, but she just intimidates him and makes it seem like she's been persecuted and he's back down from that.\n\nShe even tried to get a \"vegan\" shelf in the fridge and tried to rope in some Hindu vegetarian guys to do that but they pointed out that they use milk and cheese and honey in their cooking. They also think she's nuts. \n\nIt's gotten to the point where we go out for drinks on a Friday night at 5 and we never ask her. I don't organize these things, a coworker does but my boss told me, when I brought it up in one on one meeting, that she feels really left out and she seems to think it's my fault because I've been here for longer and I'm somehow poisoning them against her or something.\n\nI have since been conscious of this if anyone starts conversation about Vegan, I just say I don't talk to her unless it's work related and she's more than adequate at her job. It's actually become something of a joke or \"catchphrase\".\n\nI told my boss I don't organize anything except official events and she's always been invited. If she's not invited to informal stuff, that's not even organized by me, then that's not my problem. The coworker that doesn't invite her, she managed to piss him off because he's eaten guinea pig (he's from Peru) and she asked him if he'd eaten any of his other pets. For the record, he never ate a guinea pig that was a pet, it's something they eat in Peru.\n\nWhenever she brings up hunting or anything, I just point blank ask her there was anything work related that she wanted to talk about, and if there wasn't, I would start talking to someone else or just walk off. I have asked her multiple times to keep conversations work related. I never start a conversation with her at all.\n\nMost of the time, she pounces when I'm in the kitchen making tea, getting water or just stretching my legs.\n\nOne time last week, a group of us were talking and she got up join the discussion. A horrible silence fell over the group to the point where I just excused myself and went to me desk and so did a few others.\n\nIt all came to a head in our team meeting today when our boss, usually at the ends asks if there's any positive news or celebrations outside of work people want to share like engagements, marathons, charity appeals etc and Vegan sarcastically asked me how many \"lives I'd taken last weekend\".\n\nI got annoyed and said her constant badgering me about my hobbies and choice to eat meat was discriminatory and bothersome and that unless it was work related, she was not to engage me in conversation otherwise and told our \"scribe\" to put that in the meeting minutes.\n\nShe seemed a bit shocked by that and my boss looked uncomfortable but said fair enough. I thought that was the end of that but the right before our boss went to close the meeting, 2 other coworkers also put their hands up and asked Vegan to only engage them in work related discussions and that they were also uncomfortable being given non-medical health advice pertaining to their choice to consume meat and their diets. Again boss looked uncomfortable but asked Vegan to respect their wishes and closed the meeting.\n\nVegan didn't look anyone in the eye after that but headed straight to the bathroom. My boss was trying to get one of the coworkers to see if she was OK and I think one of them eventually checked up on her but she was in a cubicle and asked to be left alone. She eventually came out and asked my boss to leave early which she did. \n\nI feel awful now. She embarrassed me in front of my team with the \"lives taken\" comment so I pushed back but I am caught between not wanting her to miserable and not wanting anything to do with her at all.\n\nA few of my coworkers and I ended up in a proactive conference call after this with HR who basically said that always been subjected to unwanted advice and jabs about eating meat was not OK but some \"mediation\" was in order to ensure cut the tension in the workplace.\n\nThe HR rep then called my boss who explained what happened in the team meeting and complaints that we'd made one on one etc but then he went into a meeting room and didn't hear the rest of discussion.\n\nI don't know what to do, assuming she comes into work tomorrow or if I should even talk to her at all. \n\nTLDR: Vegan coworker keeps making jabs at me, I snapped and told her not to talk to me unless it was work related and 2 other coworkers followed suit. Vegan left work early upset. Not sure how to proceed from here.",
        "permalink": "/r/relationships/comments/42vdem/me_29f_with_my_vegan_coworker_29f_i_dont_know_how/",
        "comments": [
            "Chiming in as a vegan here. She is being completely ridiculous. She has now created a hostile work place for you and your coworkers. As a vegan in the world she cannot expect to never encounter meat eaters. Its one thing to state your opinions, but it is quite another to berate your coworkers. If she didn't want to work with meat eaters she should choose a vegan company to work for. Do not engage her further, she has been harassing you. This is her problem now.\n\nEdit: typo",
            "You're doing everything right, really. I wouldn't change a thing, you're by the book and if your boss is spineless in dealing with a bag of shithead crazy, that's for him to work out with HR when he gets his butt chewed. You have every right to push back on someone who harasses you at work, and you're not being cruel, you're being professional. Well done! ",
            "I know you are uncomfortable and feel guilty but this is essentially your boss's fault.  You made a boundary request, you didn't attack her as a person, you cited the behavior you wanted stopped and that was all.  He should have pulled her aside and said there had been complaints about her pushing her views unsolicited onto other co workers and that it was inappropriate; that she should consider this a verbal warning and the next time would be written and the third time would be termination.  That is the boss's job.  He didn't do it and now everyone else had to confront her and 'make' her feel bad.  She brought this on herself and your boss enabled it.  It isn't your responsibility to fix it.  (ETA and I hate hunting and was a vegetarian for a long time.  This situation isn't a belief problem it's is a behavior problem)  ",
            "I have nothing productive to add, but I love the image of the Hindu guys tapping out of her (vegan, cruelty-free) nuttiness.",
            "As other people have noted, she's a bully.  She's been working hard to establish dominance--I'm surprised she hasn't been peeing on people's desks.\n\nLeave her alone.  Don't extend your hand to her, just politely nod when you see her, have the professional conversations you need to have with her and get on with your life.\n\nSince she's a bully, any attempt to jolly her along may be seen as weakness.  Bullies gotta bully, so I would not trust any apparent change in behavior.  At all.  She'll probably just gun for revenge--you've got a wishy-washy boss, yes?  I wonder how hard she'd have to work to get him to take up her cause?\n\nBe rigorously professional with her--dot every i, cross every t, triple check that she is not even for a nanosecond outside of any loop in which she has a professional concern.  If you are talking with other people when she walks in a room, you all should probably make a point of acknowledging her presence with a wave and a smile before returning to conversation--you don't want accusations that you guys are \"plotting\" or otherwise freezing her out.\n\nEtc.\n\nMaybe consult HR on how best to move forward so that everyone's ass is covered?",
            "She dug her own hole, now she can lie in it. Hopefully by two other people speaking their mind your boss can start to see that it's obviously not just you that doesn't like her.\n\nHow insufferable",
            "Why did you come here for advice, you've done everything perfectly, imo.  Don't feel bad, don't engage her, just keep on keeping on!",
            "This is not on you. You've done everything right. She has the freedom to make her own choices, and the office respects her lifestyle choices - no one is going up to her and demanding she start eating meat. It's her problem that she can't extend the same courtesy to you and the rest of the office, so let her face the consequences. Maybe this jarring event will slap her awake to what a jerk she's being!\n\nEdit: I just wanted to also point out that it's incredibly insensitive of her to berate someone for partaking in their cultural dish, guinea pigs are staples in some parts of Peru. That's like shaming an Argentinian for eating beef. Very disrespectful.",
            "> I feel awful now. She embarrassed me in front of my team with the \"lives taken\" comment so I pushed back but I am caught between not wanting her to miserable and not wanting anything to do with her at all.\n\nOP, I just want you to be aware that your co-worker didn't care at all about making you uncomfortable or miserable. You've done more than enough to show her courtesy and fairness in this, and she has not relented. Her misery in this is her own fault by being unflinchingly insistent about pushing her personal values upon others.",
            "She can't take what she dishes out, dude!! Do not feel bad. What if you went and cried in the bathroom because of all her comments? You  had a reason to. But no, the second someone gives her the same shit (actually you did it much more maturely and in the right manner; defense) she can not take it. \n\n\nDoes she watch Freelee the banana girl or ever mentioned her? She's a popular youtuber who does this same thing and encourages her followers to do the same. ",
            "You did fine. Be honest and stick to the truth, which is that she's a fine coworker except she can't stop being insulting to you about a perfectly reasonable difference of opinion. If she can't stand being around people who disagree with her, that's not your fault.\n",
            "Dude, no.  No, do not talk to her when she comes back in.  If she's going to be a pushy, aggressive, offensive harridan at work and alienate literally every single one of her coworkers, then she deserves the treatment she's been given.  She's just awful.  I mean, awful. I'm trying to teach my kids that, if you act like an asshole, nobody's gonna want to play with you.  She obviously missed that lesson. Princess is in the real world now, where not everyone gets a trophy, and you don't have to share, and you get excluded from play dates if you're insufferable. ",
            "Bully's come in many forms, but she is a bully. The best way to deal with a bully is to confront them head on. You did this and in true bully fashion, she backed off. Don't feel bad about what you did. This will ultimately cause less trouble in the office than letting her continue.",
            "Sometimes, you just want to ask someone: \"What's your major malfunction jackass?\" I had a coworker who sold his car so he could ride his bike to work everyday. To hear him tell it, one would have thought that he was singlehandedly saving the earth. He spent the first few weeks of this telling people that they should too. Then one day he made an off handed joke about how fat people should be forced to sell their cars and ride a bike, while looking at me (yes, I'm overweight). I just looked at him and said, \"I would, but, I don't want to turn into an asshole.\" He shut up after that. \n\nOP, you did the right thing. Vegan was being an ass and you handled it perfectly. ",
            ">I am caught between not wanting her to be miserable and not wanting anything to do with her.\n\nUh-uh. You of all should know the risks of going soft on a wounded adversary, Ms. Hunter.",
            "[deleted]",
            ">I feel awful now.\n\nDon't. Everything that happened was a consequence of her own actions and words. The only person to blame here is herself.\n\nYou stuck up for yourself, and not only that, you gave courage to your co-workers who may have been too afraid to speak up before.\n\nYou did a good thing.",
            "You made the right call.  She needs to learn this lesson. Let HR take over.  Your request for her to not harass you for how you live your life is fair, and you won't harass her about hers. \n\nShe's on a fine line here.  HR will want to avoid you making a formal complaint at all costs.  See it through. Vegan needs to *learn* this lesson. ",
            "As a vegan, I don't think you did anything inappropriate with regards to her. Some vegans, especially younger ones, are just bitter and angry people. Although, not without good reason. Still not a very good excuse to bully people. ",
            "Your boss is in deep shit for letting this happen.  It's their job to manage these sorts of things before they get out of hand, that's why they are called managers.  You're supposed to focussed on your work not workplace interpersonal drama.",
            "Okay.\n\nI am a vegan.\n\nI have hunter relatives.  I do not judge them at all.  I am really close to them.\n\nI happen to be obsessed with bones.\n\nI collect scavenged bones.\n\nI do not want any piece of an animal to go to waste if it's going to be killed anyways.\n\nSo my uncle calls me every time he goes duck hunting etc and I pick up a bag of duck heads/legs.  Right now I have 12 duck heads buried in my yard so nature can eat away at the flesh so I'm left with those beautiful skulls.\n\nI'm aware that this isn't typical.\n\nWhat I'm trying to say is that your coworker is being unreasonable and \"holier than thou,\" but there are a variety of people out there that just simply choose to not eat animal products, and choose not to partake in the \"commercial harvesting of animals\" or whatever.  I don't kill, but I certainly do scavenge.  I feel like it's morally moot since it'll be going into a landfill if not in my artwork.\n\nYou did the right thing.  100% you did the right thing.  You were provoked into responding.  She made her bed.",
            "* she feels really left out and she seems to think it's my fault\n\nHas anyone directly told her, she's left out because of her behavior? Maybe it's difficult to tell her she's snobby and rude - she sounds like the kind of person who escalates to get things their way. So, nobody ends up wanting to tell her because of that? I wouldn't be surprised if people don't expect her to take it smoothly. But it's important for people to tell her that she's left out for her own behavior. She doesn't respect people - by extension, nobody wants to spend time with her.\n\n* Vegan sarcastically asked me how many \"lives I'd taken last weekend\"\n\nDoes she really expect people to want her informal company, when she's a toxic asshat? I mean, you sound like a reasonable, responsible, considerate hunter. And you're getting the opposite of that treatment because this jerk believes a generalization more than they do the golden rule. She's miserable because of how she treats people. I think it's great that you feel sorry, but this woman did bring this on herself. You've repeatedly expressed your disinterest in her advice and your displeasure of her mission to, seemingly berate anyone who doesn't have her diet. And all this tension exists because your boss won't do their job in the first place, which is to manage things. \n\nI'd be tempted to extend - well, not an apology. I wouldn't apologize for standing up to myself. But I would want to try touching base with her. Actually, I might seek someone to mediate the conversation, for posterity and for help in communicating with her. If she doesn't realize just how horrible she treats everyone, I'd feel compelled to talk to her about it. That's the thing though - can she be talked to about this? I feel like that's probably where you hesitate the most - even if you did reach out, she might still take it as offense or blow up on you. I would reach out and *end* the conversation if she does her usually toxic crap. You tell her that's the reason she's in the place she is now, and you tell her you won't continue the conversation until she can have one with respect. Otherwise she needs to keep it to herself and do her job.\n\n",
            "At my moms work they have a vegan coworker but he doesn't push it on anyone and they bring in Oreos for him on birthday because they're vegan. Theres nothing wrong with being a vegan and stating that but harassing others about heir choices? Not okay. She brought this on herself, she had many chances to cut it out. Just keep your head down and avoid her. ",
            "I do not know how things could have been handled better. This girl is a bully and like many bullies, they cannot handle it when their victims are fighting back. Normal people would have apologized and trying to clear the situation, explaining herself instead of going to the bathroom to cry and asking to go home early because of belly ache.\n\n\nWhat is she? Kinder-freakin-gardener?\n\n\nYou have done well friend, stand your ground and do not feel bad. You best a bully at her game, be proud.",
            "You did nothing wrong. In fact, you have exercised really good restraint. She is imposing her values and beliefs on you and your coworkers, and harassing you because you don't share her values. This is no different than if she was to impose her religious beliefs on you, completely inappropriate.\n\nFor some reason people don't understand that values are the same as religion and do not belong in the workplace.\n\n",
            "You have nothing to feel bad or guilty about. Your coworker is obnoxious and unprofessional. Do not apologize to her or extend any kind of olive branch first. ",
            "You handled it very well, you shouldn't stress too much about her emotions. She needs people to be straight forward with her like that if she didn't get the point before that. People like her are why i feel so awkward telling people I don't eat meat, i always think others will stereotype all non meat eaters to being like her.",
            "Fuck her.  I think when you get to the point where you have to say, \"Please only engage me in work-related discussion, \" is where you don't feel bad about hurting her feelings.\n\nSeriously, this is ridiculous and this lady clearly has some boundary issues.",
            "This woman is about to come into a crossroads in her life where she will either let herself realize that her actions towards others are to blame for her being disliked, or convince herself that everyone hates her because she is vegan.\n\nIt's a rare event to witness someone having such a moment. I wonder what she'll chose.",
            "I used to be vegan. She's the type that gives us a bad name. I would never engage people in vegan conversations except to turn down their animal products if they offered with an explanation. In fact people would be often initiate the conversations themselves, which eventually got annoying, basically they were trying to find some logical trap to \"prove\" I should give up and eat meat. \n\nSeriously, she needs to shut up about it, evangelical people are annoying and do nothing but make their cause seem ridiculous. ",
            "These are the posts that make me wish that the person in question goes on reddit and sees the thread and realizes what a complete shithead they are. A man can dream.",
            "Honestly it sounds like you handled it very well. You and others checked her inappropriate actions and now she feels bad about being a bitch to everybody, as she should. What to do now? Keep your chin up, be better than her, and let her know you don't hate her for being obnoxious even if she hates you for being a hunter.",
            "Just as one working woman to another: I want to commend you for standing up for yourself. *feminism fistbump*",
            "You did everything fine, seriously.\n\nI wouldn't engage her in conversation unless you have to at this point.",
            "Honestly, she keeps attacking you and your hobbies, but you never attacked her for her hobbies. Telling her to not talk to you unless it's work related is very professional. If she could not understand that and felt it was an attack, that is her problem to be upset about. And the fact she would attack the others who ate animal products and what-not too, she needs to learn boundaries.",
            "She's gone out of her way to be really nasty about this whole situation. I think having mediation could potentially help defuse this situation. Your boss really should have brought in HR when you made the initial complaint - it's only gotten more out of hand since that point. They were trying to play it cool but in the end it escalated and now the vegan's upset and angry, you and your coworkers are uncomfortable and have endured weeks or months of unwanted jabs. Very messy.\n\nHopefully HR will help her understand what appropriate boundaries are and that her behaviour thus far has been wholly unwelcome and just plain gross and pushy. There are certain things she's welcome to do: bring icky kale and quinoa salads to office potlucks. Use her own utensils/plates to avoid cross contamination, order vegan beer at the bar. There are things she's not welcome to do: comment on other people's fucking diet. Insist others stop using the communal microwave.\n\nIn the future if this kind of bullshit attitude behaviour continues you might want to bring it straight to the HR rep. You should ask them what you and your coworkers are intended to do if these behaviours 'resurface' post-mediation, especially given your boss's history of inaction.",
            "You demand respect, like any normal person would. You don't go up to a church, a vegan or someone gay and 'question their lifestyle' do you? No. It's extremely inappropriate and unnecessary. And if HR asks why you choose to stand up against VEGAN say it was affecting your work environment and you began feeling threatened at work and questioned about your choices. You shouldn't feel bad. Your boss was probably uncomfortable because they just didn't want to say anything mean to Vegan incase of them going to HR.",
            ">I feel awful now.\n\nLol why? She was bullying you and finally got put in her place. That's her problem, not yours. Keep enforcing boundaries and always keep in mind that she is a BULLY. She consistently tries to grill you over shit that's your personal life and not any of her business. She's a rude person and got called out on her rudeness. Good.",
            "Vegan here. It's because of people like her that I often get shit because of my eating habits. There are so many crazy vegans out there, and it makes us look like assholes. She needs to understand that because she's eating a certain way doesn't mean that everybody wants to do the same as her. Meat is fucking delicious, and I can't blame anybody for wanting to eat a good steak whenever they goddamn feel like it. She's absolutely ridiculous, and she deserved what she got in the end. Don't blame yourself.",
            "She seems a bit crazy with her vegan status. I'm of the opinion that regardless of your beliefs, you should never force them on others. I have a good friend who is vegan and we have a great time at restaurants. We went to a work function that had a buffet, and we wandered around finding food that was vegan friendly for her. I sat next to her and ate food I normally would (meat) and she was totally cool about it, because she knows I'm not vegan. I'm pretty sure that's how most vegans would react to food situations.",
            "Short and sweet, she brought this on herself. An overwhelming majority of people in the world aren't vegan, and I'm sure it's still a pretty large majority that are omnivorous/carnivorous (I tried to look up some stats, but best I found was a few countries having around a 5% vegan population). When she, as the single vegan of the workplace, began to pester people about their eating choices, I don't get how she didn't expect backlash, especially when she pushed boundaries. In my opinion, it's no better than trying to push your religion on people in the workplace. I'm guessing you don't have HR otherwise I would suggest escalating to them for her harassment if she doesn't stop now. ",
            "Fellow vegan here. I am so sorry that you have to endure this. I have no advise other than hold your ground, make your boundaries clear to her. \n\nI hate vegans like this. You can't be seirous to think that constant nagging would convert ANYONE to veganism.. -.-",
            ">I feel awful now.\n\nDon't.  Vegan deserved it a long, long time ago.  If she didn't want people shutting her out, she shouldn't have been an insufferable asshole to everyone.\n\n>Not sure how to proceed from here.\n\nShow up and do your job.  If you have to interact with her, be polite and only talk about work.  If she apologizes, graciously accept it and thank her for apologizing but you do NOT have to then try to be friends with her. It's OK (and for the best) to keep your relationship strictly professional.  \n",
            ">She embarrassed me in front of my team with the \"lives taken\" comment so I pushed back but I am caught between not wanting her to miserable and not wanting anything to do with her at all.\n\nYou did the right thing. She was harassing you! And others! You guys aren't leaving her out because she's vegan. Or even because she's awkward or different or whatever. You're leaving her out because *she's* being discriminating, harassing her co-workers, and acting like a first-rate asshole. I really feel like what you did was the absolute right thing and the fact that others chimed in with the same request kind of shows this. She needs to keep her head down, do her job, and wait for time to pass. \n\nYou should stay clear of her, hold her to this requirement at least for awhile (if she starts harassing you again, call her out immediately and call it what it is: Harassment and creating a hostile work environment), and let HR do its thing. Participate in any mediation they arrange but don't engage her yourself. ",
            "I don't see why you should even care what comes out of this psycho's mouth. \n\nJust say \"oooookay\" and change the subject or ignore her. ",
            "OP, you rock. You did everything you could to put up with her bullshit, and when the issue came to a head, you were respectful and told her not to engage you unless it was work related. I know it sucks to hurt someone's feelings, but lets face it, she didn't give a shit about your own.\n  \nHow much do I need to paypal you to get some tasty deer jerky? I am not fucking around here.",
            "Another vegan offering my 2p.\n\nFor those who are talking about previous experiences with 'rabid vegans,' I don't think the real issue here is the veganism. In the past I've been \"attacked\" by 'rabid atheists' and 'rabid christians' but like i said it's not about the belief system.\n\nThis has less to do with veganism and more to do with living and letting live. \n\nThe vegan person in the post is likely a new vegan like everyone else pointed out, and hopefully will learn through this experience about not shoving her beliefs down others throat. \n\n\nOP has handled situation correctly.",
            "In your shoes I would also feel very guilty, because someone is suffering.  But just because you feel empathy for another human being doesn't mean that it is your fault.\n\nYou did not create the situation and you did not escalate the situation.  \n\nResponsibility for de-escalating lies with your boss, HR, and the woman who created all of this.  I don't think you can or should do anything.",
            "Your HR department should be on board with this - you are under no obligation to discuss or do anything with this person that is not work related. I had a coworker who wasn't nearly as bad as yours, but she desperately wanted to be my \"friend\" and she was awkward as hell and quite rude at times. When she wasn't invited to a lunch, she would confront me. At Christmas, she gave me a small gift and used the opportunity to say \"I just feel at times like you hate me.\" She took my reserved parking spot once. She often would refer to another coworker as \"hating\" her. She used the Secret Santa gift exchange to give a coded message to someone saying \"you are mean to your Secret Santa.\" I could go on. I went to HR because I was afraid that I would lose my shit on this idiot and I wanted to know what my obligations were. HR told me that my only obligations were to not be hostile, and to not block anything work-related. So all you have to do is be civil to her *where work is concerned*. Be strong. Her behavior is more about her than about you. She is making herself look like the jerk, not you. Continue to firmly shoot her down. If you're lucky, she will get laid off like my work nemesis did.",
            "Your post reads like a \"how to\" guide on the proper way to deal with obnoxious coworkers.  Seriously, I don't know what you could have done differently.  It sounds like your only issue is that while you're fed up with her, you're also a decent human being who doesn't want to make anyone feel bad.  That is totally understandable, but the thing is it's that common non-confrontational attitude that allows people like your coworker to exist in the first place.  If everyone called people like her out on their behavior, they would modify it.  I love the part where after you spoke up in the meeting, two of your coworkers did as well.  Everyone was thinking what you said, but they didn't want to be the first one to say it.  I get that you feel guilty, I probably would in your shoes as well, but you did not create this situation.  She did.  All you did is attempt to resolve it, and it seems like you've gone about it in the best possible way.",
            "It's funny that you've displayed more empathy than someone who dictates their whole diet on the idea of empathy..\n\nBut really it sounds like your boss is the most to blame here. He should have spoken with her about it not being professional and brought HR in much earlier. This is poor management that catered to a person who sounds like they don't understand how to behave in a workplace. Honestly, she doesn't seem cut out to work in an environment that doesn't cater to her delicate sensibilities. I would have fired her for her incredibly intimidating behavior.\n\nThat being said, I'd personally think you should tell her you are sorry for the situation and that you want to maintain a courteous workplace and extend a friendly hand to her, but do not take responsibility because it isn't yours.",
            "You sound like you've handled this perfectly. It's your boss/HR that's not doing his job. \nI'd keep doing what you're doing.",
            "If she's so passionate about the vegan cause, to the point that she's willing to alienate her coworkers, who are you to stop her? ",
            "Vegan here. Being a vegan in a nonvegan world can be hard sometimes. It's heartbreaking to see what happens to nonhuman animals and it is so incredibly frustrating that people just don't care or don't see the problem. \n\nBUT that does not explain or excuse her bullying and behaviour. Maybe she has good intentions, but being hurtful to people around her is not an acceptable way to act. And pragmatically, it will just lead to people dismissing all her views. Alienating and insulting people is about the most ineffective method of activism. \n\nI think that keeping conversations to work-related topics for now is a good idea. Let HR do mediation. Make sure that you aren't hassling her for being vegan (doesn't sound like that's the case here at all though!) and hopefully she will stop attacking everybody else.\n\nEdit: You did nothing wrong to her in this situation, by the way. I don't want to come off like I'm defending her or anything. Don't feel guilty about her reaction to what you said. It was bound to happen with the way she acts. If not you, then it would have been somebody else eventually. If she acted like a regular reasonable person then she wouldn't have excluded herself, but she chose not to. ",
            "\"It's cool that you're vegan and all, but it's not cool that you keep trying to shove it in everyone's face.  You are free to make whatever choices you want in your life, but SO AM I.  Stop bothering me with your crap or I will report you for harassment.\"\n\nSay that.  Do that.",
            "I'm sorry your stupid co-worker is a horrible representation of a vegan. I think you handled it quite well.",
            "I think she got the message.  She's pretty dense if she didn't see this coming though, I don't know how it could be much of a surprise but I guess it hurts when your pride takes a big hit and you're embarrassed on the topic of something you're passionate about.\n\nDon't do things out of your way to smooth things over - ie don't talk about food, meals, being vegan, anything like that, but you can break the ice by asking normal coworker questions like \"how was your weekend\", \"it's really stormy out there\", \"this project is coming along smoothly\", etc.\n\nAlso, let HR do their job of mediating the concerns but definitely lay some ground rules with them that they need to understand that \"When Bob has a problem with a bunch of people, the bunch of people probably aren't the problem. Bob is\" so they don't try to lay this out as a bullying claim against all of you. It was entirely inappropriate of her to continue nagging after you about your diet differences, medical recommendations, and pressuring/discrimination about your personal life. Not to mention the rude comment she made in the meeting. ",
            "Her own fault. She's being disruptive and creating tension in the workplace - not because she's vegan but because she's a jerk who can't keep her gob shut and has a holier-than-thou attitude. You did nothing but stand up for yourself against her constant bullying, and it's up to her to learn to stfu if she wants to be able to work... well, anywhere.",
            "I don't think you should feel bad. Someone needed to say something and the fact that others backed you up shows that. It's fine that she's vegan, it's fine that you hunt. She needs to mind her own beeswax.",
            "I have a friend who is vegan and while we try to accommodate, she realizes it is not easy for people in college to be able to. \n\nFor her birthday party we looked up a vegan cake recipe and icing as well and made her a cake. Had other vegan foods but it was the cake that I right was better than most cakes I've had. Even on my birthday a few weeks later I asked the baker of the group to do another vegan cake because 1 she could eat it too and 2 it was better in my opinion.\n\nHonestly she has never tried to make us vegan so it's never been a problem.\n\nI think this woman on the other hand has made everyone uncomfortable and that is because of her trying to push her choices on others. You don't need to accommodate for her choice. It isn't on the company or your Co-workers to make a shelf for her in the fridge. And she had no right calling you out in that meeting. ",
            "I think it's wrong (and stupid) to try to force your views on another person. She's made a lifestyle choice which has come to define her. She's not given you any opportunity to know anything about her other than that she's a vegan. Does she have a personality? Or is she just Vegan?\n\nIt would be the same if she was one of those annoying proselyting Christians who go round saying how you're going to hell for wearing a skirt! She's alienated herself. You're not responsible. You did the right thing",
            "Give HR and your boss time to deal with this. If she ends up \"miserable\" at work, its her doing, not yours.",
            "You feel sorry because you believe she sincerely feels like a victim and did not foresee the consequences of her behaviour. But there is absolutely nothing you can do about it. Other people may be able to reach out and educate her and guide her towards more appropriate behaviour. But you are enemy #1, any advice will be counter productive. There is nothing you can do for her.\n\n",
            "BOOM! What a great comeback in that meeting!! If she engages you in non-work conversation then it's off to HR you go! :)",
            "She's, at heart, just an annoying person who happens to be vegan so that's what she has to talk about. We have a person like this in our office that makes every conversation uncomfortable and people regularly complain to HR. I think you're doing all you can do, no fault of yours. ",
            "What she said to your Peruvian coworker is culturally insensitive and would have gotten her written up and submitted for cultural sensitivity training in my office. Seriously. My jaw hit the floor when I read that.\n\nI think that if you just lay low and play it by the book, you should be fine. I'm a pescetarian with a vegetarian boyfriend, so speaking as someone with a primarily plant based diet, I think she was way over the line. And saying what she did in a meeting? Damn. You shut her down with a quickness, and I don't think she expected it - especially in front of so many others. What she did was completely inappropriate. But yeah, I'd go by the book now - don't speak to her unless it regards work, be professional and let it be. \n\nDo not feel bad or try to take it back, because that won't instill any sense of responsibility or accountability in her. And I'm curious to see how this story develops, so keep us posted.",
            "You need to make a complaint in writing with your boss or HR that this woman is creating a hostile work environment bu badgering you over your food choices and lifestyle.  I think she screwed up by making her comments in a meeting and it is good for you that those comments were entered into the minutes.  Take a copy of those minutes to HR as well.",
            "So what if she feels a little bad now? Frankly, that's fucking karma and she's constantly pushing other people's boundaries, giving unwanted \"advice\", making people feel like garbage about their life choices and forcing her beliefs on others.\n\n\n\nShe's reaping the consequences of her actions. She made a terrible jab at you and you retailiate and she feels bad because no one (including your spineless boss who really should've because that is literally harassment) stood up to her before.\n\n\nYou tried to be civil, it didn't work. This is her fault.",
            "I'd say you handled the situation as best you could. You went through the proper steps with your boss and with her. It didn't work. She calls you out in a team meeting and you pushed back in an appropriate manner. I know she probably feels like she's being excluded but this is of her own doing. It's okay to have your beliefs. It's not okay to persecute others for not going along with you. I'd continue on doing what you've been doing and leave it at that.",
            "Don't do anything. Sure you felt bad when she went to the bathroom, you're a person, you have compassion, but however you felt, you also know she did it to herself. She targeted you specifically for your hunting, she was hostile to several members of the team, and she expected .. what, a pat on the back and everyone loving her and accepting her eternal wisdom?\n\nWanting to keep discussions work-related is nothing bad. You didn't tell her she was a terrible worker, you didn't throw her under the bus, you simply re-clarified what boundaries are. If she can't handle that, then yeah I'm sad for her too but that's life. \n\nKeep doing what you were doing, but don't talk to her. She's not going to be receptive to that and it will seem to her like you played the situation to get her in an uncomfortable position and then when she was cornered, you swept in to \"save\" her. (I know this isn't what you were doing, but she may feel this was the case.) The talk about only work also applies to you. Keep it polite, keep it professional, keep boundaries firm. You already handled it. It's handled, at least until the point when she starts stirring more shit.\n\nShe's a big girl. She'll get over it. If she won't get over it, then that's her thing, and she'll probably leave, but you didn't overstep your bounds, not even once, and you simply said what needed to be said to protect your dignity and work environment.",
            "I've been vegan for nearly four years, in my current job right now for two, and my workplace is entirely the opposite. Just yesterday, I was called out during an office wellness seminar by my boss who made a wise-crack in front of the whole office about an \"employee here who eats a lot of things you can't pronounce.\"\n\nJust before the seminar, I was heating up a buffalo cauliflower pizza I'd made the night before. I'd made a comment to one of my friends in the office to wait for the \"Smells delicious, but I'm sure I'd never eat that weird stuff\" comments. Sure enough, there was a deluge of them as I heated up my slices in the toaster oven.\n\nI have no idea how to address this, but I'd certainly never behave or react like Vegan here in your story. It's completely unproductive behavior and totally uncalled for. You've done the right thing.\n\nedit: typo\n",
            "You said exactly the right thing in the meeting and having it added to the meeting minutes was genius!  You noticed that you then had 2 other people who backed you up.  And you will probably have several others.\n\nShe is creating a 'hostile environment' at your work.   If someone went out of their way to call you out for wearing or not wearing some type of religious artifact - that would be a 'hostile environment'.  This is the same thing.  She goes out of her way to call you out because you are not part of her self-professed culture.\n\nIF you remember the dates of when she said some of the things she said (like the skirt incident and the refrigerator incident) write it down.  That gives you a time line of her behavior and witnesses to her behavior.",
            "This woman is being intolerant and creating a hostile work environment.\n\nDo not feel awful if she gets fired because if she does, it's HER OWN FAULT.\n\nYou and your coworkers were professional, polite, and respectful of her beliefs.  You avoided the confrontations and attempted to keep your interactions work related.  If she wasn't so obsessed with making sure everyone knows she is morally superior and more evolved than them, then her ass wouldn't be in hot water right now.  But it is...because she is intolerant and hostile and lacks the ability to live and let live.\n\nAll of you (minus the Vegan Avenger) should be commended for acting like professional adults. ",
            "Just a thought, she isn't being an obnoxious and rude fucker because she's a vegan. She's being an obnoxious and rude fucker because that's the kind of person she is.\n\nNo pity, if she can't sew her judgemental mouth shut yet then she needs to learn a lesson in respect sooner rather than later.",
            "I dated a vegan guy for 3+ years. I had 5 vegan room mates. Most of our friends group was vegan. I eat meat and no one ever gave me shit about it. I did use a separate cutting board for my meat at home but that's just good hygiene. In fact my ex and several of my vegan friends have a lot of respect for people who choose to hunt their own game. A big reason that people go vegan is to avoid participating in unethical modern industrial farming practices which lead to needless, long term suffering of animals. Hunting also cuts down on the reliance of industrial farming practices and as you mentioned can also have ecological benefits for your region. \n\nAs far as your work is concerned it sounds like you are handling this as well as you can. You shouldn't be embarrassed by her comments during the work meeting, it sounds like your coworkers are on your side. I predict a tense but short lived working relationship with this woman, she probably will either quit or get herself fired. Until then continue to only engage with her on work related matters. ",
            "Please post a follow up!!",
            ">I got annoyed and said her constant badgering me about my hobbies and choice to eat meat was discriminatory and bothersome and that unless it was work related, she was not to engage me in conversation otherwise and told our \"scribe\" to put that in the meeting minutes.\n\nYou're my hero. And apparently, also a hero to some of your coworkers.\n\n>I feel awful now. She embarrassed me in front of my team with the \"lives taken\" comment so I pushed back but I am caught between not wanting her to miserable and not wanting anything to do with her at all.\n\nIf she can't dish it, maybe she should change her diet.\n\nAlso, she didn't seem to be too bothered by all the vitriol she's been spewing. So now she's got a little splashback; maybe this will make her rethink her life choices, specifically, the one where she chose to be an asshole to her co-workers.\n\nSorry, no real advice, but I just wanted to let you know I think you're a decent sort. Don't beat yourself up over this.",
            "You're not forcing her to eat meat. She's shoving her own values down your throat. Tell her her values are like a penis 'It's OK to have one, but don't go whipping it out in public and shove it down our throats'",
            "I have one of those activist Vegan's for a SIL. Her righteousness drives me absolutely mad. I respect her choices (as I do with all humans) yet she has no problems whatsoever staging little protests every time meat is either discussed, or eaten. \n\nGood luck with your battle... I think what you did what more than reasonable - sometimes you just have to agree to disagree, something your Vegan has issues understanding. ",
            "You did well. Like, really well. It's not your fault that she can't accept that you and others don't want her \"advice\", and the comment about taking lives was very rude and uncalled for. \n\nIf it was me, I think I would go ask her \"Do you want to talk about what happened yesterday?\" and if she does, don't apologize but tell her that she went over the line with the comment in the meeting, and that while it's fine to be vegan and tell others about it if they ask, she has no right to bully you and shove her values down your throat.\n\nAlso, I have the deepest respect for hunters like you. It is definitely one of the most ethic sources for meat, as the animal is shot while still being free and stress-free. Keep doing what you do!",
            "You don't have to proceed with any changes. You did exactly what you should have, now she just needs to learn to STFU. \n\nJust try not to make it awkward.\n\nI don't get along with my coworkers either, they dislike me a much more subdued tension and I basically just talk to them about work and leave if other conversations come up and go into much detail. Lots of fake smiling, nodding and basic faking it.\n\nYou did your part, lets hope she does her's.",
            "I think you handled this extremely well. She is unreasonable, harassing you & making you uncomfortable at work. You have every right to request she not speak to you unless it's work related given her previous behavior. \n\nI wouldn't bother. You've done nothing wrong. Perhaps she'll start to realize pushing your lifestyle and beliefs on people is a fast way to get people to not like you. ",
            ">She even tried to get a \"vegan\" shelf in the fridge and tried to rope in some Hindu vegetarian guys to do that but they pointed out that they use milk and cheese and honey in their cooking. They also think she's nuts. \n\ni'm sorry but this is hilarious. ",
            "Vegetarian of 16 years chiming in (vegan for four of those years , and mostly-vegan for 2: I live in Chicago, and occasionally cheat with deep dish cheese pizza, because holy shit have you had it? It's goddamn delicious). \n\nI don't bring up my diet unless it's relevant: \n\"Hey, wanna split some wings?\" \n\"No thanks, I'm not a meat eater. I brought something from home. Enjoy though!\" \n\nDo I think the meat industry is deplorable? Fuck yes I do. But I actually have a soft spot for hunters - the animal is killed swiftly, the meat is used directly, there's either minimal or beneficial environmental impact, and there's potentially a population benefit. Do I ever want to hear about animals killed for meat? No. But do I think non-sport hunters have a proverbial leg to stand on? Yeah. And do I think it's right to force my views on anyone else? No. If someone asks me about my diet, I'm more than happy to talk about it. But 99% of the time, all you have to do is say, \"no thanks,\" and shut the fuck up. Preaching only makes you look like an asshole.  \n\n\n**TL:DR:** As a fellow veg, your coworker is a total asshole. Be honest about why she isn't invited! If she can't handle the fact that spreading her \"gospel of moral superiority\" is making her a pariah, she probably won't change. If she's willing to make an effort, cool; if not... well, fuck her, she can eat lunch alone. ",
            "The best thing to do would be you and your co workers all take up crossfit. You need to fight fire with fire here. Whenever she brings up her vegan non sense, belt out some shit about crossfit and how awesome you are at crossfitting stuff.",
            "You need to make an official complaint about her making it a hostile workplace. She would/will do the same thing. It's one thing to make a joke but you have told her to stop and she continues so its now become harassment. ",
            "Frankly, you've handled this pretty much perfectly up until now (being calm, professional, asking if she had any work related things to say and then shutting down the conversation when she didn't), so what you should do is just continue that. \n\nWhen she comes in, act like you always act towards her. Do you usually say \"hello\" or \"good morning\" and then get back to whatever? Then do that. Don't change your own behavior just because she couldn't handle you objecting to how she treats you. \n\nIf you want to \"just have a talk about what happened\" - do it in mediation with HR. You don't want to have a private talk and then it all becomes he said/she said with HR later on.",
            "I do not think you did anything wrong however I can understand why you might feel responsible. No reasonable person wants to make another person cry or feel left out but it is her actions that have brought her to this point not yours. To put it into perspective: if, when she had her snarky comment to you in that meeting you had not retaliated but instead left in tears and gone home early, would she have felt guilty like you do now? Probably not. I know an eye for an eye is not a great metaphor for life but in this circumstance I think that you need to protect you and let her deal with her own actions. Best of luck",
            "She was being a bitch and bullying you. Now she's upset because everyone (rightly) thinks she's a bitch. It's great that you stood up for yourself. It encouraged other people to stand up for themselves. You've probably improved everyone's work environment in that single move. \n\nSo what if she's upset? It's her fault, not yours. Her personality flaws are not your problem. She'll be fine. She's a grownup.  ",
            "I wouldn't engage her ever unless it was business related. She created this, and unless she chills out the status quo remains in place.",
            "Tell HR exactly what she's done and how it makes you feel.",
            ">When she first came onto the team and told everyone she was vegan. \n  \nI picture a funny introduction. \"Hi, I'm (x), Vegan.\" Kind of like \"Bob Vance, Vance Refrigeration\"",
            "She's harassing multiple employees, and openly saying/doing racist/culturally insensitive shit. Hostile work environment. *She* is the problem here. \n\nHR is involved, which is the correct course of action.",
            "Show her these replies. Her \"community\" is embarrassed to be associated with people like her. ",
            "You did the right thing. Her personal opinions have nothing to do with her job and therefore this would be considered workplace harassment. You have every right to ask for things the way that you did. \n\nYou aren't excluding her, she is excluding herself by being such a persnickety bitch...\n\n... And can I just say that I am guilty off stereotyping myself. I didn't read [F] in the title and thought you were a man until you said pencil skirt. So good on you for being so awesome and more gutsy then most people out there!!!\n",
            "Look, I'm a vegetarian and I find hunting distasteful. But that has nothing to do with workplace behaviour. You merely responded to what she said. Your colleagues then put in their bit. In other words,  an open secret came out into the open. If she is upset that's her business.",
            "Don't feel guilty for her escalating the issue. You've dealt with problem at the same levels that she is continually raising it. You're definitely in the right here. This is a problem for your HR department, not you.",
            "Role reversal time - how many milliseconds would it have taken her to complain to HR if you'd done the same to her regarding her life choices?\n\nThis isn't normal behaviour - more than half of my friends/social group are vegetarian or vegan, and the only time I ever notice is when we're eating out or if the topic comes up in passing conversation.\n\n This level of criticism of your chosen lifestyle after you've repeatedly asked her to back off is harassment, and HR should deal with it as such. If she does come back, stick to your guns - only work-related conversation, and remove yourself physically (and report to HR) every time she tries to engage you in non-work talk.",
            "Leave it where it is. If she complains to HR, you've got 2 witnesses who will say she's creating a hostile work environment. Next time you get into a situation like this, *before* you're pissed off, calmly ask the person if they will abstain from militant vegan/crossfit/Amway/atheist/Scientology/World of Warcraft/etc comments. If they don't, then file a complaint with HR, letting them know you've politely informed the person you don't wish to discuss whatever. If HR doesn't react, talk to your supervisor. If they don't react, talk to a labor lawyer. (Or hold a pig roast in the parking lot, but then the co-worker may talk to a lawyer... might still be worth it.)",
            "I think you did everything right.  Her embarrassment is legitimate, but she put it on herself.\n\nYour co-worker was being rude and you called her out on it.  She could have walked away from the meeting thinking that it was just you who had a problem with her, but the fact that two other co-workers mentioned it showed her that the issue was **her**.\n\nLife choices that do no affect work should not be discussed in a workplace setting. \n\nI eat healthier than a lot of my co-workers, and while I could start lecturing them on how their food choices are affecting their lives, I don't because it's not my place and I should respect their decisions, regardless of whether I agree with them or not. ",
            "Fuck her, she deserved what she got.",
            "I am not a vegan but I stopped eating meat when I was about 12/13 yo (I drink milk almost every day though and eat dairy products) and I feel that she's going out of the her way to preach her views on others (do your thing and let others do their is basically what most vegas and vegetarians do - freaking hell, my ex used to eat meat almost everyday and I didn't care in the slightest). I mean the entire situation would be totally different if she was preaching her religion and if she said \"Jesus is the solution to all of your problems\" etc... So I feel you should treat her as such. \n\nDo your work and if you have any work related issues with her, you should talk to her (in the end this should not affect you professionally). Also don't forget that you owe her no explanation. ",
            "I was vegan for about a year and a half, and vegetarian longer than that. \n\nHonestly? She needed this wake-up call, and the fact that your coworkers joined in only reinforces the fact. \n\nIt's one thing to be passionate about your beliefs, it's another to self-righteously belittle everyone around you to the point that they're uncomfortable even being in a room with you. That is NOT a sustainable workplace environment. ",
            "I think you actually handled this remarkably well. It's your boss that dropped the ball here- they should have address your and everyone else's complaints long ago.",
            "The issue here isn't veganism, it's her need to gather attention for it, or justify her choice, she probably doesn't understand the issue and saw it as an attack on her. Hence the need for mediation from HR, Tread carefully and lightly, however keep in mind you've done nothing wrong here. ",
            "You nailed it as far as I'm concerned. You don't need our advice. You shut that shit down and you were professional. She's the asshole here.",
            "I was like that when I was about ten or eleven.  I thought it was all so gross and vocalized it (though only to my family). One day my mother said to me \"If you want us to respect your chooses, you have to respect ours.\" That was it I got it. I've tried to keep it to myself since even though my dad hunts, my brother ect. I don't antagonize them anymore. Not even when I'm getting the \"but meet is good for you\" or \"what about the poor vegetables suffering.\" I try to end the conversation by joking or something. Anyway try saying what my mother said it might hit hér in the right way.",
            "> unless it was work related, she was not to engage me in conversation otherwise and told our \"scribe\" to put that in the meeting minutes\n\nYou're a goddamn American hero, and I'm going to use this method myself.  It's brilliant.",
            "\"Vegan, you're good at your job. You really are. But you're not going to win any vegan converts here. Everybody has heard all of the vegan arguments before. None of it is a revelation to them. They chose meat. By continuing to harass coworkers about their diets, all you're doing is making them want to minimize their contact with you. If you want to get along with your coworkers, come talk with them about TV, or sports, or anything that isn't proselytizing. No religion, no politics, no veganism. It's your choice.\"",
            "This isn't about veganism. This is about a bully who picked up the mantle of veganism to harass others and make everyone around her feel uncomfortable. My suggestion is not to show her any sympathy: you handled this perfectly, and she's pouting because people are standing up to her. If she comes back to work, continue showing her professional courtesy, and nothing more. She now needs to deal with the fallout of her actions.",
            "This isn't really about her veganism. Basically she's an insecure person who latched on to this fad and now needs to validate herself in the eyes of others that her choice was the right choice.\n\nI almost feel sorry for people who don't have the mental fortitude to just do what they want to do and not seek validation from others.\n\nAlmost.\n\nAs you obviously know, this is just a fucking job. They pay you strictly for the work you do and nothing else. So the only thing that matters is the work you get done and the money you take home. Anything beyond that is not your responsibility. Definitely not this girl's feelings.",
            ">I don't know what to do, assuming she comes into work tomorrow or if I should even talk to her at all.\n\nNo, you abide by your own request to only engage when it is work related. This is all on her, stop feeling bad for being driven to the edge of your rope - it doesn't even sound like you were mean or disrespectful.\n\n>I feel awful now.\n\nAgain, this is all on her, so stop feeling awful. You stood up for yourself, there is nothing bad about that. It's actually a good thing.\n\n",
            "Naw, don't fuck with perfection.  You are handling this in textbook style.  Just keep handing her rope and let HR hang her.",
            "You keep doing exactly what you are doing. Vegan really owes the office an apology. It's fine to live your life however you want and while it's obvious that it's important to her it's not ok to be rude and hostile to people for not living life according to her rules. She is being unprofessional, insulting, and inappropriate. Stick to the script. In mediation, tell her to stop making comments about your personal choices and you'll get along great. If you want to try to make inroads, you can apologize for snapping at her but you've tried to deal with this diplomatically for months and it's not working. Sorry it had to come to this point, but you really need her behavior to stop and it is just that simple. Rinse and repeat. \n\nMy husband was a vegan for several years and many of his coworkers would attack and bully him in the office because he was the guy who always had to order french fries and a salad when they went out to lunch. He never lectured them about their meal choices or talked about being vegan. Finally he told them to shut the fuck up about it. That was the last time he had to say anything.  ",
            "Vegan here!\n\nShe's crazy and militant.  No question.  The only time I bring up my veganism at work is if someone offers me food that I can't have.\n\nI think of how I want to be treated.  I don't like it when people impose their moral, religious, political, or otherwise kinds of beliefs on me and I try to do the same favor.  Granted, if someone asks me about it, I would talk about it.  But not in the kind of context where I would be telling them how to live their lives.  \n\nRealistically, I think veganism is something that's right for some and not for others.  So if hunting is your thing, go for it! \n\nIn dealing with this workplace issue, you're doing everything right.  Perhaps talk about how excluding her seemed to be logical because she can't enjoy the activities that you engaged in outside of work.  She surely would have reacted poorly to being invited to a burger joint or a hunting trip and may even have seen that as an insult.  That's actually a reasonable way to put it for the HR people that makes you sound less snobby.\n\nSadly, not everybody will get along.  You're not obligated to like anyone.  And you're not obligated to be her friend.  And you're also not obligated to care about how she feels.  Sometimes the truth hurts.  You didn't go out of the way to hurt her really, you did what you needed to protect yourself from her militant comments.  And sometimes the truth hurts.  You shouldn't feel responsible for her feelings because you really weren't trying to cause her harm.  You can be civil but you're under no order to be friendly.  I would not go out of your way to talk to her, hold true to your request.  She may also feel like you're taunting her if you try to talk to her.  \n\nHope things improve!",
            "Vegetarian here:\nshe seems to have latched on to some sort of belief to shove down people's throats. Same way people preach about religion to non-religious people. Still really annoying. They can't tell that no one wants to hear it and they get way too self-righteous about it. \n\nIn my own personal experience, I find myself harassed by meat eaters all the time. I even go as far as to apologize to them for offending them (yea, i know, i'm a pushover) just to avoid awkward situations and then try to laugh it off. \nShe's doing the same thing but with opposite views. \nI think if you just let HR handle it from here, you should be fine. They already know that a lot of people have complained about her. Either she changes the way she interacts with people in a professional office setting or she can GTFO. \n",
            "The problem is your boss isn't comfortable being a boss. If I were leading a group of people I would have taken this woman aside and told her that it's great she's so passionate about something, but this sort of behavior is only acceptable from impudent children and not adults. There are a lot of vegans who don't act like this and it makes me very sad that they ruin it for the people who can enjoy their choices quietly.\n\nIf I were you, you could approach her and maybe have a heart to heart. Maybe ask her out for a drink away from the office?",
            "I see where your problem lies. Basically it's a hostile work environment. The issue at hand is not caused by you but the coworker.  Folks in HR don't like hearing that phrase at all. When circumstances like these are occurring use the hostile work environment phrase and people will get involved. QUICKLY. By the way, it's totally your right to go past your boss straight to HR. He has no repercussions available to punish you. Hostile work environments are a federal and state matter and you are protected. ",
            "She clearly wants you to be miserable, because she has missed hint after hint. Your spineless boss' refusal to tackle it when it was easy caused this, not you.",
            "Let her be miserable.  She made her bed, let her lay in it.  Just keep it professional at all times around her.  Sooner or later, she will likely find another job.",
            "This doesn't help the stigma of Vegans being cultists (exaggerating here). The self-righteousness of some is insane and incredibly insecure in my opinion. Live and let live. ",
            "Fucking ignore her.  Who cares?   If she lets her personality interfere with her work then you can complain and she can be reprimanded or replaced.   She started it.   It isn't a crime to hunt, eat meat, or wear animal fur/skin.   It's her fucking problem.   If she wants to talk work then cool.  \n\n\nBut it isn't up to you to be friends with people you work with, you certainly don't have to.  And you can omit them from whatever you want.   If they feel bad, they should reflect on why it happened and do better, get over it, or get a new job.\n\n\nI wouldn't think twice about this.   She went out of her way to be a cunt to you so just ignore her.  That is the high road.   If you apologize to her, you basically have no spine either.   This chick needs tough love so just leave it be.",
            "I like that you have been patient and sensitive towards Vegan. As far as I understand it, patience and understanding are some pretty important pillars of the Vegan philosophy. I think you are providing a great example to her, and you may have had a positive impact on her despite the initial embarrassment she feels now. ",
            "I wonder if you live in Seattle, because you sound like you're working with my ex-girlfriend...",
            "> The coworker that doesn't invite her, she managed to piss him off because he's eaten guinea pig (he's from Peru) and she asked him if he'd eaten any of his other pets. For the record, he never ate a guinea pig that was a pet, it's something they eat in Peru.\n\nSo by the sounds of it she's also a racist or at the very least not culturally sensitive. ",
            "Fifteen year corporate veteran and actual veteran veteran here. \n\nSwap out the hunter parts of your story for: homosexual, black, heterosexual, fat, ugly, attractive, or autistic. Now think about whether or not those scenarios would be one where inappropriate harassment was occurring. It's not the subject matter that's important; It's whether or not you're being harassed. From the story, it's clear that you did the right thing aside from perhaps the public tag-team but it's totally understandable under the circumstances. \n\nNow consider that if \"vegan\" were \"unwanted sexual advancer\" and think about the same story. Again, sometimes it isn't the subject of the story that is the problem and only the behaviour itself. \n\nHarassment is harassment. \"Vegan\" is creating a toxic workplace. There's a reason why PETA marches and March Against Monsanto don't happen in the workplace: We're there for the agenda of the company that pays us, not our own private agenda... Aside from the \"gots ta get paid\" agenda, of course.\n\nSounds like your boss is highly ineffective and let this spiral out of control. It's a good thing HR is stepping in. Sometimes it's best to handle bullshit like this above the local manager anyway. That was the mistake everyone made. Bring in the big guns on garbage like this.\n\nEDIT/Afterthought: L'esprit D'escalier or whatevs... I wonder if she's new at this \"vegan\" stuff and overcompensating for her own guilt? Having been an atheist and skeptic for forty years I constantly run across baby atheists and baby skeptics that exhibit similar behaviours and scream TEH LOGICAL PHALLUSIES all over the workplace and internet. They're very annoying and stifle intelligent discussion. It takes a while for new beliefs to crystallize into normal ways of thinking. Perhaps she's going on full-bore to undo the \"damage\" she's done in the past?\n\nAnother edit: There's a good permalink in this thread you should make sure to read: https://www.reddit.com/r/relationships/comments/42vdem/me_29f_with_my_vegan_coworker_29f_i_dont_know_how/czdp339",
            "It's pretty clear you need to hunt and eat her. I didn't even need to read through your 5 million word essay to figure that one out.",
            "You did the right thing.  Some people are so sanctimonious and have their heads so far up their own ass that they simply *will not listen* until they're called out publicly.  It's not like you didn't try other methods of getting through to her first - you treated her with more patience and respect than most people would.  ",
            "Kinda sounds like the problem is already solving itself tbh...",
            "I nearly bust out laughing when I got to the part where the \"Hindu vegetarian guys\" thought she was nuts.\n\nI immediately thought of this piece from Robin Williams' set that he did at the Met.\n\n> \"Marijuana users being condescending to alcoholics - that's a little hypocritical isn't it!? It's kinda like Idi Amin looking at Gandhi and going 'You're too intense!'\" - Robin Williams (1984, at the Met).",
            "Vegan sounds like a real bitch. I'm sure that even if she wasn't a vegan, she would find other stuff to be shitty about.",
            "\"I feel awful now.\"\n\nYou shouldn't feel bad. She's a shitty human being and you quite correctly put her in her place.\n\nI'm vegetarian, and I have very strong beliefs about the matter, but I would NEVER EVER in a million years pull the rubbish she's pulling, especially at work.",
            "Why do you feel awful, lol? She got exactly what she deserved, both from a moral perspective and from a workplace conduct/law perspective. You have done absolutely nothing wrong.. the only problem here is your spineless boss not having stepped in earlier to remedy her behaviour.",
            "You're being too nice and accommodating. This is not on you.",
            "> I got annoyed and said her constant badgering me about my hobbies and choice to eat meat was discriminatory and bothersome and that unless it was work related, she was not to engage me in conversation otherwise and told our \"scribe\" to put that in the meeting minutes.\n\nYou are my hero\n\n> She embarrassed me in front of my team with the \"lives taken\" comment so I pushed back but I am caught between not wanting her to miserable and not wanting anything to do with her at all.\n\nShe dug that hole. It's not your problem.\n\nYou stood up to her and she couldn't handle it. I can't see anything you did wrong; you have much more patience than I would.",
            "Buy a Venus fly trap, pitcher plant, or any other meat eating plant and place it in clear view.  Then when she says anything snarky you can remind her that not even plants agree with her.\n\nThis is a joke that will not help the situation become any less uncomfortable.  Sometimes HR can leave you hanging when the other party cries more pathetically.  Since you seem like a grown women this will probably put you at a disadvantage with HR.\n",
            "How do you know someone is vegan? They'll f'n tell you! I worked and became friends with a co worker who was vegan. Very close friends. And honestly they really just need a wake up call. Your co worker has probably whined to all her vegan friends about how disgusting the caveman meat eaters are at work, and thats that. Theyll get over it. And your office will probably never have to listen to how fantastic it is to be vegan again. I know i sound mean. But my friend was exactly like that until i said 'you know, shut the hell up. Youre annoying.' Then when into the i respect you and what you believe in, just as i do with religion, politics etc, but respect me enough to not push it on me. That was 10 years ago and we're best friends to this day. She doesnt really like it when i 'forget' to make hers a vegan burger..but whatcha gon do :)",
            "She is a bully. Document everything and prepare to have her escalate.",
            "Tell hr that vegan established hostile work environment long before the meeting took place, and that what u did was the outcome of the hostility she created and not the cause",
            "I'm a vegetarian and when I read stories like this it makes me so mad. I think you did the right thing. If anyone was being discriminated against it was you. She dug herself into this hole and I hope she learns from it, otherwise she will find herself with very few friends. ",
            "What a shitty ordeal... She is so in the wrong, and you've acted beyond gracefully! Imagine if you had been as strident and verbal about your views thorughout.\n\nIf I were you, I'd write down some bullet points, for use if you should need them in mediation:\n\n- She has badgered you about it constantly for an extended amount of time, and you have not engaged at all in any discussion.\n\n- You are being badgered for doing something completely legal, and which actually benfits the environment.\n\n- You have gone to your boss for help, because it has bothered you so much.\n\n- She has blamed you to your boss for what co-workers have decided to do.\n\n- Her behaviour is dicriminatory and harassing.\n\n- She has outright attempted to humiliate you in a professional gathering with her 'lives taken' remark. This is bullying in the work-place.\n\nKeep this written down, and then try not to worry. HR is on your side, you co-workers will all agree with you, and you have acted very very professionally without escalating or rising to any bait.",
            "She made this bed. It's on her to lay in it now. You handled the situation really well. Public shaming is an effective tool in these sitautions. If she changes her ways you can give her a second chance, but you don't have to. If the comments don't stop...\n\n>Vegan sarcastically asked me how many \"lives I'd taken last weekend\".\n\n*\"Dude... I'm pretty sure I knocked out like 10% of the local ducks last night. It was awesome!\"*\n\nGo unrealistically unrepentant. When people make this big of a target of themselves, you might as well take your shots. When they see they're not going to get under your skin and the people around them aren't on their side, the enthusiasm for continuing the crusade usually wanes.",
            ">I feel awful now. She embarrassed me in front of my team with the \"lives taken\" comment so I pushed back but I am caught between not wanting her to miserable and not wanting anything to do with her at all.\n\nDon't feel awful. She has done this to herself. ",
            "You are fine. It's not like you verbally abused her or purposely discriminate her. If she is not invited to the informal events after work there is nothing the hr can do about it. HR are not stupid they will deal with her. If your co workers doesn't like the person she won't get invited to event after work. ( why would anyone invite her for drinks after work when she starts to shove that vegan crap down your throat during work? That is just asking for trouble ) \n\nYou handle it perfectly as you are at work and wanted to keep the conversation work related. If you have a different view keep it to yourself and keep your mouth shut. \n\nAdded bonus if I'm eating my lunch and she start spewing her vegan crap. The next day I'll probably order a nice juicy medium steak and eat that infront of her. You have your choices I have mine, don't like it ? Keep it to yourself.",
            "\"OMG, you're not Catholic?\" \"Omg, you went to synagogue last Sunday? You know you're going to hell, right?\"\n\n\nSound any different? Didn't think so.... ",
            "A joke that a vegan friend (who isn't overbearing) told me: How can you tell if someone you know is vegan? Don't worry, they will let you know :)",
            "You have nothing to feel bad about, and good on you for directly addressing the problem and calling her out. I understand having a health choice you feel confident about, but no one else owes you a change.",
            "First of all. This is a situation she has created with her intolerance. You seems to be far more patient than most. If she starts any crap or tries to play the victim you need to get on top of that.\n\nLuckily your vegan coworker seems pretty dumb as well as annoying and anyone including your boss must realize who's at fault here when two other coworkers asked her to stop talking to them.",
            "I was kind of expecting to read that you would go into the bathroom to comfort her and you guys start a unique quirky best friendship. I then realised this isn't a novel. \n\nI think your amazing that you still don't want her to be miserable and it shows how great you are. \n\nI think you've done 100% the right thing. ",
            "I agree there should be some mediation, but I don't think you or the other people who asked her not to talk about non-work related things to them should be the ones to do it. She was hurt, clearly, but her hurt is a straightforward consequence of her behavior towards you and others and you have nothing to feel guilty about. And right now you have it in the meeting minutes that you don't want her to talk to you about anything other than work, you're golden. Talking to her personally about her reaction and your feelings might help, but then again it might totally undo what you gained in this meeting.",
            "You did good. Don't give a shit about her reaction.",
            "She's 100% at fault here and owes everyone she's annoyed an apology.  It would be the same if she were any other sort of evangelical tut-tutting over people's sins.  She needs to keep her personal beliefs to herself if she can't learn to engage without demeaning people.",
            "You shouldn't feel the least bit guilty in this situation. It's one thing to discuss differences in lifestyles with others, but what she has been doing to you and your coworkers would be considered harassment. She can't just accept that you hunt and eat meat, she belittles you for it. You handled the situation well. She belittled you in front a group and you stood up for yourself and told her your boundaries. If she continues the harassment, just tell her that you're not talking about her veganism or your hunting anymore and to leave you alone unless she has something work related to talk about. Eventually she'll realize noone wants to hear it and if she wants to get along with coworkers she needs to learn to put your differences aside. Also, your boss sounds like they need better training on how to handle conflict in the office. ",
            "Soooooo passive agressive... ",
            "It's in HR's hands now. Sounds like you're gonna have a mediation session with her and HR to try to patch things up.  Nothing you can do, just keep being professional.",
            "Talk to HR and state all the facts from the post. This lady created a hostile environment for you. She is harassing you.",
            "She got what was coming honestly, she is overbearing and obnoxious and wouldn't stop despite being asked multiple times. I'm actually surprised you took her shenanigans for so long before taking action. ",
            "Sounds like you acted reasonably. Just keep a cool head. Be like the Fonz. Ride dis shit out. ",
            "I'm interested in what country you're in. Is it England? Or a euro country?\n\nI've never heard of places where foxes are pests but ducks are released for shooting. Sounds really interesting.",
            "Sounds like you dealt with her just fine if you ask me.",
            "If she was early 20s, I'd have some sympathy for her, but at her age, she ought to know that you can't be aggressively obnoxious to people about their lifestyles and then expect them to voluntarily hang out with you.\n\nGiven that your boss wouldn't pull her aside and tell her a polite version of that, you handled things as well as you could. \n\n The mediation is probably the best option, but for tomorrow, I'd be pleasant to her, but not engage in any conversation about that meeting except to reiterate your boundaries politely.\n",
            "I think she might be crazy and using the veganism as a crutch. Like, people who get super obsessed with whatever one particular issue or thing and it's all they talk about and get super bent out of shape about, that to me is a sign of lack of balance.",
            "Don't do anything. You were perfectly clear, didn't do anything wrong, are completely within your rights. What did she think, she could go on a vegan crusade and there would be literally no push back from anyone, ever?",
            "You've handled this perfectly as far as I can tell.  Basically this girl was going to be upset if she wasn't allowed to irritate everyone in the office on a daily basis and you guys shut that down.  So what, she's upset because she has to interact professionally?  SHE was the one being out of line and now she's learned (hopefully) a lesson.  ",
            "The fact she's a vegan doesn't matter at all.\nIf she was a vocal atheist, extremely religious, etc etc she'd likely act the same way.\nYou handled it the correct way.  You notice how your co-workers followed your lead?\n\nHR in most privates companies is getting more and more \"conservative\" - meaning they are more and more likely to play the  middle of the road to avoid any form of lawsuit.  Government HR is even worse.  \n\nDon't feel bad or guilty about your personal choices.  They are YOURS - and you don't have to justify them to anyone.\n\n",
            "I think she just learned a valuable lesson about overstepping her bounds.  It is unfortunate that she pushed you to the point of public confrontation, but you really had no choice here.  \nMaybe, and it's certainly not a requirement, you could write her a private note saying that you are sorry that everything went down this way, but your beliefs don't deserve to be publically called out at work and you felt you had no choice.  ",
            "Sounds like she can dish it out but can't take it. If you badger your co-workers, you shouldn't expect to be invited to happy hour. If you criticize people in meetings about stuff unrelated to work, you don't get to cry in the bathroom when you get called in it.\n\nShe's a drama llama. Keep on keeping her at arm's length.",
            "Melbourne?",
            "It seems like she felt like no one could touch her and when finally someone didn't want to be bullied anymore she didn't know how to take it. I think saying it in the meeting with witnesses and then support from other co workers was the only thing you could have done since your boss clearly has no control of the interpersonal dynamics of the work place. \n\nYou tried to he an adult about it, you tried to he curteous, you tried to talk to your boss and it wasn't enough.  So when she tried to tear you down to be funny (in front of your whole office no less ) you stood up for yourself,  good for you! Hopefully she will treat people with respect and tolerance in the future. Keep documenting things though if she keeps trying to start crap, you may need it, you never know.",
            "Late to the party, but I'll throw my 2 cents in anyway.\n\n\nI spent 7 years working for a certain grocery retailer known for it's healthy attitude and vegan/vegetarian options. I worked there PRIMARILY as IT, but I also moonlit as a butcher/meat cutter when the need arose, which was pretty frequent.\n\n\nWord about this got around the office and I had a LOT of issues with the vegan/vegetarian employees being dicks to me about it... even though it was part of my damned job and I was HELPING the company WE ALL worked for. Someone even went so far as to cover my desk/computer with fake blood, writing the word KILLER in huge letters with said blood on the window in front of my desk.\n\n\nI think your response was PERFECTLY called for. This is now on Vegan to deal with her own preachy behaviors and the results thereof. Hopefully she learns something from this experience, but her bad feels are as a DIRECT result of her bullying behavior and I have a hard time working up any sympathy for her.",
            "I have a vegan coworker. She doesn't often work with me, but when she does pick up shifts with me, she talks about being vegan, of course, but when it's time to cook meals for the kids, she'll cook even if it has meat in it. \n\nSo I'd say your vegan is being pretty ridiculous. I learned early on that shoving beliefs down someone throat is not the way to go about making converts, whether it's religion, vegan-ism or whatever. ",
            "I was going to mention that you have to be proactive, and a bit on the offence with people like that or they'll dictate the tone of every conversation and railroad everyone. If you give her any room, she'll feel like she has the high ground. You handled that meeting perfectly. Do that kind of thing every time.\n\nThere are some super religious members of my family (some would say, cultists) and they force me to be on the offence. They disrespect my position, and if I fail to challenge their moral judgments, they will be more and more emboldened until they're guilting my children for their clothing and entertainment choices and telling them that I'm going to hell. But if I confidentially push back, then I set where the line is.\n\nIt is this way for all kinds of fundamentalists - religious or otherwise. ",
            "Honestly, I can see how you would reach your breaking point with that.  And I'm glad some other coworkers said the same thing, so don't think it's only you.  You don't need to be friends with this person, only interact politely at work, so that's what you do.  It's her own fault for being so preachy.  Everyone knows she's vegan, so that should be enough; if they want more information about it then they could go to her.  She shouldn't just keep pushing her beliefs onto everyone else (just like people wouldn't do that with religion, etc. at work).",
            "16 years vegetarian here. My experience is people who are that vocal or incessant are only doing it for people to be impressed with them, etc. I would bet in two years she won't be vegan anymore and will say her doctor told her she needed more protein, or some other lame excuse. You seem like a responsible hunter, and responsibly hunted wild game is an order of magnitude more humane than factory farming. I'd ignore her and if she continues get HR involved. She needs to grow up. ",
            "Sounds like you guys are handling things in a responsible manner. \n\nShe sounds like one of those uber christians that has to try and convert you every chamce they get and claims that anything not approved personally by the local pastor is the devils work. \n\nI understand that she is trying to save things, and in her mind that is universally justifiable but she needs to learn tact or she is going to have this problem everywhere she goes until she signs up with peta. ",
            "What is up with your boss, do they have some sort of attachment to this person or personal ties? Why is your boss involving themselves in personal matters and asking you why she's no longer invited to non work related outings and that she feels left. He's basically asking you why you and other colleagues aren't friends with her outside of work, while also knowing that she brings literally all of this on herself. It just seems wildly inappropriate that he's the involved in her and by extent your personal life. ",
            "Everything you did, you did correctly. When I started reading, I thought about all kinds of advice to give you, but you're doing everyhting already and handling the situation like and adult. If she is miserable, she is making herself miserable. She has no right to impose her eating habits on other people by constant nagging and guilt-tripping.",
            "OP, you handled this extremely well. You didn't take the bait and stayed professional. In fact, you put up with it longer than anyone would reasonably be expected too.\n\nI'm an avid fisherman and come from a hunting family and I used to get into big arguments with a vegan friend. She would provoke them when she saw me going fishing and I would get annoyed and argue back (I practice catch and release). It never did any good but I was younger and more brash. \n\n",
            "Next time you talk to your boss mention the words \"harassment\" and \"lawsuit\" and see him spontaneously grow a spine. He needs to handle this before Vegan blows up in the office. ",
            "Spineless boss didn't help this at all is my first thought",
            "Continue to document that she's being inappropriate. If she starts again I highly recommend emailing her for a paper trail. \" please cease and desist and comment towards my hunting or choice to eat meat. Your comments are not relevant to work and any future comments will be considered harassment \"",
            ">I don't know what to do,\n\nEnjoy your victory? You won. Congrats. HR seems to understand she was harassing you, and they now want to smooth things over. The problem is out in the open. Don't back down if it ever comes back up. Otherwise maybe give your coworker a chance to turn over a new leaf. (That would be the exceedingly nice thing to do anyway.)",
            "Your boss F'd up.   He knew about it, he witnessed it, and he said nothing.   I'd sure he will be getting reprimanded, extra training, possibly even demoted.\n\n\n\nVegan is definitely out of line and should have been dealt with long ago.",
            "You're handling this professionally, as you should.  It's not your job to protect her feelings; it's your job to be able to communicate with her civilly on work-related matters.  It sounds like you've been doing that so far.\n\nIt's also good that you've documented this with your boss multiple times, and that it came up at a meeting with you and two other coworkers who had their discomfort registered in the meeting minutes.  So now you have a paper trail.\n\nFrankly, you need to continue to not engage her on non-work-related matters, as cordially as you can.  You don't have to like each other, you just have to work together.",
            "But does she have superpowers?",
            "OP You've done everything right. Eagerly waiting on an update! ",
            "Only she can stop forest fires... and being a complete jerk to her coworkers and then crying when they don't like her or want to have a beer with her. I think you've done a fine job of sticking up for yourself and establishing reasonable boundaries. All there is for it is just to stick to your guns and don't engage her outside of what is needed to get work done until she can learn to handle herself in mixed society.",
            "Be proud of yourself. You are a true workplace hero.\n\nHope everyone has a toast on Friday!\n\nedit: I, personally, would never speak to her again for anything other than work related discussions, as you have been doing. Eventually others (as is happening) will begin to do the same, ostracizing her more and more. Eventually this parasite that makes you uncomfortable at your own place of work will leave. I guarantee this is a common theme in her life; you are not the first but you most likely have handled it the most professionally.",
            "You've done everything by the book so far - you're using the right kind of language (from a legal standpoint), you're not overtly excluding her, you're not bullying her, you're not doing anything that could be construed as harassing or harmful. Keep doing what you're doing, and eventually - most likely sooner rather than later - she'll hoist herself by her own petard. If you wanted to escalate things, you could make a complaint to HR about her harassing you, there's certainly a case to be made for it.",
            "She's being incredibly ridiculous. My best friend is a vegetarian, and my husband and I are avid hunters. She actually APPLAUDS us for hunting because the animal is killed humanely, and the meat is 100% organic, and there are no added chemicals or growth hormones. It's something like 99% fat free and it's honestly delicious. She needs to get a grip.",
            "I'm the first person to handle a situation with compassion and apologies, but she was the instigator here. You didn't do anything wrong, you were being constantly harassed and then asked for it to stop. Just because she's playing victim doesn't mean you owe her anything. I'm a vegetarian myself and would never dream of treating people this way.",
            "I think you should proceed as it is right now. Seems like all the necessary steps were taken and the confrontation was very cordial. If it happens again tell her \"this is why you're single.\" And that should put a permanent stop to it. Unless she isn't single.",
            "I only understand the situation from your explanation but the entire time I was reading I was wondering why you didn't go to HR earlier, she was consistently berating you over your hobbies and eating habits- in my eyes it has been pretty close to harassment for a pretty long time. Should you feel bad? I do not think so, it was all fun and games for her until the seriousness of her actions finally set in, how she did not understand she was annoying people from the beginning is beyond my understanding. Your boss also should have spoken up earlier and it should not have taken a band of employees to get the point across. She's an adult she can now reap her actions. \n\nI would take no action, continue acting as you did before the incident, only engage her in work related conversation, if HR calls you in explain the situation and do not forget to mention that your spineless boss ignored the situation. ",
            "Meat eater here (I sensed a pattern so I thought it was relevant) haha I don't think you need to do anything. She created a very uncomfortable work environment for herself, she's embarrassed & probably feels foolish. But she's a grown up, she'll move past it. Eventually she'll probably try to reconnect with everyone (hopefully not about food) & at that point I'd suggest giving her a shot(reading back I think I should clarify, i mean a chance, Do Not hunt her with your shotgun!) . As long as she's not trying to convert you she might be a nice person.",
            "Don't you dare feel awful for calling her out on her bullying. And that's what it is, bullying. She needed to be formally put in her place because she is causing a hostile work environment. Just steer clear of her unless it's specifically work related. You don't want or need to hear her views on her veganism.",
            "Seems like you handled the situation. ",
            "Vegan is being absolutely ridiculous and creating a hostile work environment. The end. You haven't done anything wrong. She could be acting like this about any subject and she'd still be in the wrong. \n\nI know vegans and one of them even helped me grill chicken at a BBQ because I wasn't sure how to use the gas grill. It was no big deal.\n ",
            "Other than the spineless boss it sounds almost like a perfect fantasy of how to deal with an irritating coworker. \n\nShe's nasty, has made everyone dislike her and now she's being shunned.\n\nOther than genuinely trying to be her friend, which would be a miserable process that you should feel no obligation to go through, I can't imagine anything else you can do.\n\nHopefully things will work themselves out naturally and she'll quit.",
            "You've done the right thing, she was the one who kept escalating and was going to push until someone stood up. She is using her vegan status to feel superior and harass people. Don't feel badly, its your work environment too, plus you helped make it better for others. ",
            "You're a good person for caring enough to post. YOU did everything right. Your colleagues waited till an opportunity arose and took it, I think their actions were a little bit mean.\n\nJust keep doing what you intend to keep doing. We have all had asshole colleagues, ones who think their sniping is fine but other people doing it is terrible. \n\nKeep doing what you're doing",
            "\"How many lives have you taken this weekend???\"\n\n\"Do you remember how many breads you've eaten?\"",
            "Why don't you want her to be miserable? She certainly doesn't extend the same consideration to you. She's being nosy, judgmental, sanctimonious, and more. And you're being a saint for still putting her feelings ahead of your own. But it's time to stop. \n\nContinue to avoid her and, if she continues to badger you, make a complaint to HR. Make a complaint each time this happens. It's the only way to compel your company to protect you.",
            "You've done the right thing. Let HR take it from here.",
            "I don't have anything against vegans here but she's pushing her non-work related agenda at work.  It's inappropriate.  This would be analogous to her actively pushing her religion or her politics in the workplace.  I think you handled it correctly. She asked for this and now it came back to her, not the way she wanted but she got a response.  Perhaps she will be more metered in her response from now on.",
            "Perfect responses to escalating harassment.  You handled it perfectly, and have been amazingly accommodating with her incessant nagging. Well done. \n\nA1 score for proper hunting training and responsibility. It's the Same here in Sweden. ",
            "If you really want things to be normal at work you can try pulling her aside and saying something like- \"I don't think it is good for either of us to be talking about hunting or veganism. But perhaps both of us could have handled this better. We have to work together and I have no problem with you aside from this issue. I see no reason why wouldn't couldn't be perfectly fine work friends.\" That should diffuse any situation if that is what you really want.",
            "I have an annoying vegan co worker too but nowhere near as bad as yours. She also only eats organic (or stuff labeled organic anyway).\n\nShe thinks all meat is bad for you, GMOs etc. (Doesn't know what GMO stands for, at least when I asked) but yeah gives unwanted and often incorrect medical advice she gets from vegan publications.\n\nThings were kind of tense once because I called her organic only diet an expensive hobby after she said anyone regardless of income level could shop at Whole Foods if they \"budget correctly\". Tried to tell her about inner city food deserts and she just dismissed me.\n\nShe also told me drinking pineapple juice would cure the common cold. I did just to humor her and when it didn't work she said \"Oh, well you also have to eat vegan.\"",
            "Vegan got fucking wrecked, and she brought it on herself. Zero sympathy for her.",
            "It seems like this woman is obnoxious and overbearing, and is now upset that some people aren't eager to hang out with her because of it. \nThe thing is, if she were just being generally abrasive and annoying, and people didn't like her, she would just be the annoying girl at the office.  But it seems, somehow, that she feels that her being vegan makes her a member of a protected class- almost as if you or your coworkers had said \"don't talk to me about anything but work because you're 'fill in race or sexual orientation here'\"... it seems like a few of the vegans I know see themselves in a similar way.  \n",
            "This is work, not social hour or high school. Part of her JOB includes getting along with others, her co-workers. Your boss should grow a pair and tell her to turn it down a bit. Other than that, all you can do is ask that the boss sit in on a group conversation with her and ask her (politely) to turn down the volume on some of her opinions.",
            "It seems like you got the point across to her. Just curious what do you do with these animals? Do you eat them? As someone who does eat meat and hunts occasionally for meat, I would never be able to kill something if I wasn't going to use it.",
            "You were not out of line for what you did at the meeting.  Your coworker created the situation and you reacted professionally IMO.  If you didn't react, it would encourage her to do it again and/or escalate.\n\nAs for the future do not engage with her unless it's a professional matter and when you do so act casual and polite.  If she tries to start up with you about something vegan related just cut her off immediately and say calmly but firmly: \"We already talked about this, we're not going over it again.\"  Repeat as necessary and if she escalates just walk away.",
            "How bizarre that she'd focus on you for being a hunter when hunted animals typically live and die under *way* more humane circumstances than factory farmed ones. I mean yeah, if you were a poacher hacking off rhinos' horns then sure, that'd be a problem, but it sounds like you're a responsible hunter.\n\nAnyway, you did the right thing. She's made her own life miserable by proselytizing endlessly at work and making a snide comment about you *during a team meeting*. Maybe your decision to address the problem in the most appropriate possible way (given the circumstances) will help her to change her wildly unprofessional behavior, which will benefit her in the long run.\n\nI'll echo the other advice here and say don't address this or anything that's not directly work-related with her tomorrow. If she apologizes (doubt it but who knows) then accept, but don't offer an automatic return apology because you did nothing wrong. My bet is she'll just be ultra subdued because she knows now that multiple team members feel the same way you do about her."
        ]
    },
    {
        "post_id": "3ktw49",
        "author": "wtfdidat",
        "title": "Update: Me [25M] and my friend [27M] of fifteen years. His son [11M] is becoming sexually inappropriate towards me.",
        "url": "https://www.reddit.com/r/relationships/comments/3ktw49/update_me_25m_and_my_friend_27m_of_fifteen_years/",
        "score": 2373,
        "num_comments": 115,
        "created_utc": 1442179232.0,
        "selftext": "Original here: https://www.reddit.com/r/relationships/comments/3kcdcy/me_25m_and_my_friend_27m_of_fifteen_years_his_son/\n\nThank you all for your comments, I really appreciate it.\n\nI apologize if any of this seems rambling or disjointed, but I just got back, and I want to write all this down before I forget.\n\n\nI called John today, and told him that I would like to talk to him alone.  He invited me over, and we talked over coffee.\n\n\nWhen I told him what had happened with his son, he seemed shocked, but he took it well.  He said that he was surprised, as James had not been displaying anything in the way of sexually inappropriate behavior, though he did admit he had been told that James acting out sexually was a possibility, so it wasn't entirely unexpected.\n\n\nHe said that he wished I had come forward after the hallway incident, but that he understood why I had brushed it off, and didn't hold it against me.  He's just glad that I came forward and told him the truth.  I was visibly upset, so I'm sure he could tell how deeply this was affecting me.  I asked him if he wanted me to cut ties with them, temporarily or permanently, but he said absolutely not.  He believes that it's important for James to have a gay role model in his life, and felt that not having me around would come across as punitive and shaming to James, and would end up doing more harm than good.  He confirmed to me that James is seeing a therapist, but that they were down to monthly visits, as James had seemed to be adjusting well.  John said that he was going to go back to weekly visits in light of his behavior.  He asked me to stick around until James got home.\n\nWhen James arrived, John said that he wanted to talk to him about what had happened between James and I.  James looked extremely guilty, and started tearing up.  After John reiterated what had happened and asked if he had anything he'd like to say, James broke down crying and saying how sorry he was.  We both reassured him that we weren't angry with him, and that he wasn't in any trouble, but that he needed to understand that this behavior was inappropriate, and why.  As per the suggestion of several of the comments, I apologized for saying he should never touch anyone the way he did, and we discussed the issue of consent at length.  John then asked him why he did what he did.\n\n\nJames talked a lot about it, but was rambling nervously.  I get the feeling that he was sorting it out in his head as he was talking, so it was a little difficult to follow, but I'll paraphrase what he said, as I understand it.\n\n\nHe confirmed for us that he had not done this with anyone else.  He has had a brief crush or two on other boys at school, but was self-aware enough to know that they were straight, and not interested in him romantically.  He admitted that he did have a little bit of a crush on me as well, but assumed that I was straight.\n\n\nHowever, when he found out that I was gay, he mistook my affection for him as attraction, and came to the conclusion that I was only friendly with him because I wanted him sexually.  John asked him if he acted the way he had because he wanted to have sex with me.  James said no, but that he thought that if he didn't repay my affection with sexual acts that I wouldn't want to be his friend anymore.  He also expressed some concern that if he didn't initiate it I would, and that he'd rather do it on his terms.  I told him that sex was never any part of my intentions, and that I was friends with him because he was nice, that I enjoyed talking to him and hanging out with him, that I like him because of who he is as a person.  He asked if he was ugly.  I said no, and explained that most people are attracted to people close to their own age.  He admitted that if he were to have a boyfriend that he'd want a boyfriend his age.\n\n\nWe started wrapping things up, but I noticed James seemed dejected.  I asked him what was wrong.   He asked me if I hated him now.  I admit I got a little choked up when he said that.  I gave him a big hug and told him that I would never hate him, and that I would always be his friend.  He asked if we would still get to hang out, and I said yes, but only when his father was home, and that I wouldn't be able to babysit for him for awhile.  John made sure he understood that this was not a punishment, just a precaution.  James seemed agreeable to it.\n\nAt this point, John said he had some things he wanted to discuss with James privately, so we said our goodbyes, and I left.\n\nAll in all I feel pretty good about it.  I think we were able to explain things to James in a way that he understood.  I hope I handled this the right way.\n\n\nI'd like to wrap this up by thanking everyone for their comments, but especially /u/Doughchild for their heartbreaking, but very insightful comments in [this thread.](https://www.reddit.com/r/relationships/comments/3kcdcy/me_25m_and_my_friend_27m_of_fifteen_years_his_son/cuwe8kq)  I read it again just now, and started crying, because I was struck by how much of that I saw in James.  Thank you for helping me understand.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   \n**tl;dr**: The poor kid thought that if he didn't sleep with me, I wouldn't want to be his friend anymore.  I think I helped him understand that that's not the case.  Supervised visits, and no babysitting for the foreseeable future.",
        "permalink": "/r/relationships/comments/3ktw49/update_me_25m_and_my_friend_27m_of_fifteen_years/",
        "comments": [
            "Reading where that kid's head was at is heartbreaking. How could someone take advantage of someone so vulnerable? He's really lucky to have you two as positive forces in his life. ",
            "You guys need some type of award for how your handling this.\n\nThat boy is going to grow up to be SO well adjusted.\n\nThanks for the update and keep it up!",
            "I'm glad it helped. I was touched reading from others, but i didn't want to derail by commenting further. \n\nI'm sad that my explanation was one that indeed applied to James. People tend to think that once abuse is over, that the victim should visit a therapist a few times and then just stop talking about it and  move on. This is exactly the part that never goes away. James will be 60 and still struggle with this burden, that never was his to carry.\n\nYou did everything in the best possible way. John seems to be a very good dad, he's making sure James gets the help he needs. He will need to keep guiding James, but it's great that he could talk about his crushes. And you did well in affirming to James what your expectations exactly were, because he's going to run into this with everyone he meets; not understanding that he's nice enough as he is and that he can say no. You both have helped James so very much with the way you handled this. \n\nThanks for the update.\n\n",
            "This is the best possible outcome.  However inadvertently, James was able to draw attention to a wounded part of him that still needs attention.  Imagine if he'd broken his leg and it didn't set correctly.  His acting out was the limp that allows his father to know that the bone has to be reset.\n\nIf you address the subject again, you can tell him the truth:  You weren't upset because of harm done to you (although you don't like people touching you without permission).  You were upset because you wish he could feel that your love and regard for him is because of who is he is, not because of what he can do for you.",
            "You handled that in the best way possible!\n\nI'm proud of you.  You and his dad are being terrific stand up male role models for a young man who needs it.",
            "Thank you for writing this. I am sitting, typing this while sobbing. And I've got to express why I am so touched by this post and update, as sharing seems to be a healthy and helpful thing to do in these sort of threads. \n\nI was sexually abused for long term by a neighbor. \n\nMy family (mostly my mother) reacted horribly and handled it very wrongly. No excuses, middle class family, education regarding the damages of sexual abuse, it all came down to that she cared more about her image in regards to those outside of the family were more important to her than the happiness of those within. My siblings reflected her behavior. Alone, I had to confront my abuser and threaten to tell the police if he would not stop touching me. He was a neighbor and I still had to see him all the time, but the abuse stopped when I was 9 (the age that James was when the authorities stepped in). \n\nSo the abuse stopped. But the after affects didn't. \n\nI was very over sexualized with my affections, and had many of the same thought patterns that this poor kid has. I thought that I could only earn people's affections by giving sexual attention. It led to repeats of abuse by those who sensed I was vulnerable and easily coerced. And things that were inappropriate enough to draw attention from outsiders (e.g., showing my body to other children, inappropriate touching of non-family adults, etc.) were all addressed with harsh punishment and shaming. I remember begging my mother for therapy at 12 because I wanted to kill myself; I was so unhappy and so confused with all the blank stretches in my memories, and she would scream at me for making her feel like a bad mother. \n\nNow, reading this and hearing how you two are helping and guiding this poor confused kid, is making me sob. I would have given anything to have people like you in my life. To have this kind of love. The abuse was not that bad for me; what was horrible was having my parent punish me over and over for it. Being forbidden to tell my father. I still struggle to talk in therapy because I feel like I am going to be punished for it. Even having a neutral response would have been bearable. But James has people who love him. He has people who are willing to help him, and *that* is what is going to make it so he can grow into happy and well adjusted adult. He must feel so accepted and loved right now. It might have been hard to speak with him, but the fact that he told you these things is a miracle of love. It is proof that he feels he can talk to you and his father about how he feels. What an amazing gift.\n\nAs a survivor, I can say how people respond to abuse (even today) has a far greater affect on me than abuse does. People that show that they care enough to reach through the darkness and pull you out, they are what makes it all bearable and something to grow from, not something that will crush you into pieces. Thank you so much for sharing this update and reassuring the scared kid in me that there are good people out there that love others enough to understand and help. \n\nEdit: clarified/fixed sentences\n\nEdit again: thank you everyone for the kind comments, messages, and gold. What a wonderful response to find when I logged in :). I am really grateful for the loving community here, it is really hard for me to share this part of me, so thank you for making that easier. ",
            ">James said no, but that he thought that if he didn't repay my affection with sexual acts that I wouldn't want to be his friend anymore.\n\nmy heart just snapped in half for this little guy. that is just so damn sad and heartbreaking. you and his dad are being so caring, loving and understanding with all this. he will never forget it and will appreciate til the day he dies. you 2 rock!!",
            "> but that he thought that if he didn't repay my affection with sexual acts that I wouldn't want to be his friend anymore. He also expressed some concern that if he didn't initiate it I would, and that he'd rather do it on his terms. I told him that sex was never any part of my intentions, and that I was friends with him because he was nice, that I enjoyed talking to him and hanging out with him, that I like him because of who he is as a person. He asked if he was ugly.\n\nThis kid is 11. Holy crap, that's mind boggling. Congratulations for handling it so well, and thanks for sharing this story. It really sheds light on the strange manifestations of sexual abuse. ",
            "This is honestly the best update I've read here in my 15 months in this subreddit.",
            "<3 \n\nThanks so much for the update!",
            "It's sad that James went through this trauma but he has a bright future. you guys seem so exceptionally awesome at helping him. Most people don't know how and would probably end up trying to repress any sexual behavior or feelings which would not help in the future.",
            "Wow you guys sounded like a couple 40 y/o's in the way you handle this situation I was a little flabbergasted to see you two are still only in your 20's. Well done bravo.",
            "This is very normal for a child with a history of sexual abuse. James has been given the message that his only value is sexual value, he needs to offer sex for people to like him, that he has no right to decline sex, it will happen anyway (hence saying he'd rather have sex on his terms rather than you just taking it from him). My heart breaks for him that he feels the only poles in his relationships are \"Wants to have sex with me\" and \"Hates me\".\n\nJames is dealing with a lot, as a gay youth AND a sexual abuse survivor. But it sounds like he has responsible adults looking out for him who care about him very much.\n\nGood job, guys.",
            "Who is cutting onions in here *sniff* well done OP. You are truly a great guy. ",
            "> James said no, but that he thought that if he didn't repay my affection with sexual acts that I wouldn't want to be his friend anymore.\n\nThis is the saddest thing I have ever read.\n\nI really feel for this boy, but he's going to be ok. Great work.",
            "You very likely just changed this young man's life in a positive way.  Kudos",
            "What could have been a disaster for all of you ended up being a really special moment because of all three of you. You were able to broach the subject with John, he was able to to hear you and ask you to be there to talk to James with him.  And James, wow.  He was able to talk openly to you and his dad about what must be so confusing and difficult for him.  This is what taking the road less travelled looks like.  It was scary, and awkward, and fraught with anxiety, but I think it made a profound difference in James' future.",
            "This seems like the best possible outcome. How great to have two very positive male role models in his life to help him heal. Kudos to you both. ",
            "This is great. Well played OP, glad it worked out well. Kind of want updates every month letting me know how well the kid is doing now!",
            "This made me cry. I'm so glad a young person like that has the help and support he needs. Please continue to be a good role model for him as he grows up. Sexuality is a confusing thing, even more so when it's unusual or different. It makes me sad to think that for the parts of growing up I was completely lost. Please make sure he develops well and has a healthy view on sex. Thank you for sharing this.",
            "I had something happen to me as a kid, but in my experience it made me overly sexual at an early age and I discovered masturbation early and had fantasized about inappropriate things due to whatever effects the incident had on my brain. \n\nWhether this boy fantasizes about OP or not, I don't know, but it's a possibility and he might be ashamed of what he did--having to admit it to his own dad and be confronted. That said, I'm glad he's getting therapy because I didn't and had to come to terms with it and realize I wasn't disgusting or at fault on my own.",
            "You did an incredible job handling this situation",
            "You are a truly wonderful individual. Thank you for handling this situation with sensitivity and grace!",
            "I'm just curious, who was John to James before the custody? ",
            "Very well done, and thanks for the update! This sounds like it couldn't have gone over any better!\n\nOut of curiosity - why is it that you guys decided, that you shouldn't babysit him anymore or be alone around him? Is it because you are feeling uncomfortable? Or are worried that your friend might doubt the nature of the interactions with the son?",
            "You both handled it beautifully. It's amazing that you both could talk to him that openly about the situation. I wish my mom could've done that for me too when I was sexually abused as a child, but I felt ashamed of my abuse and she only perpetuated that shame. Although his past was unfortunate and horrible, he's bound for a great future with the two of you as major influences in his life. ",
            "I am happy to hear how this turned out! It seems like you all handled it very well and covered everything that needed to be covered. I'm glad James, although maybe he seemed guilty or embarrassed, was able to understand it all and talk it out. I'm also glad to hear that John was understanding, you're both wonderful people and James is going to grow up great because of you guys!! Also, I'm glad that he has you as a role model who is not actually family, and also I think it is great that (from your original thread) you were able to answer any questions he had because you both have the same sexuality. I feel sad for James but it seems like it was all explained to him awesomely and I'm glad that it went well and you can still be a good friend and a positive role model to him.",
            "Man, you're a good guy.  ",
            "You sound like a great guy, OP. Perfectly handled. ",
            "Poor kid :( it is awesome that uou took the time to talk this out with him and his dad. I hope he can grow and learn and get somewhat back to normal :( poor kid",
            "crazy story man, so glad everything worked out for the best it seems, gives me a good feeling in my tummy hahaha",
            "That was a win-win outcome.  Congrats!",
            "I don't oftain weigh in to subjects I don't have experiance with but reading your two posts I just wanted to let you know I'm hoping all the best for the three of you.  You all sound like total heroes for the way you are dealing with this otherwise shitty situation.  Good luck.",
            "And that my friends is how you handle things like a true mature grownup. \n\nNice job my friend. ",
            "Aw man, this is really sweet.  Good job OP.",
            "Having been sexually abused around his age, but by boy much younger, which led to some extreme behavior.\n\nYou guys handled this with such subtly and understanding. He is going to grow up to know how good people can be and how natural sex and his sexuality should be.",
            "> came to the conclusion that I was only friendly with him because I wanted him sexually.\n\nOh, poor little guy. That breaks my heart. I hope he makes progress in therapy.",
            "Woah! I'm speechless... Not just because of the boy's experience as a molested kid and his resulting assumptions about relationships/friendships, but also because of the absolute mature way his father, your friend, managed a situation that most of us would find hard to tackle -- especially because it takes a lot of emotional intelligence and open-mindedness (or just plain common sense) to do what you, guys, did. I think what you did was just perfect, especially because you never ever sought to make the boy feel bad about what he did, but, on the contrary, state that there was a behavior that wasn't precisely  appropriate, yet he is loved and cherished. I really look up to your friend, man.",
            "I think you handled this well. I was similarly sexually inappropriate at about the same age, also following abuse, and I'm sure I made many adults quite uncomfortable at the time. I look back on this with chagrin. You managed it well, I'm glad he's in therapy just generally, and I hope he can resist the temptation to act out unless in the appropriate context.",
            "Am I the only one here who thinks this child is a little too young for all of this?  Talking about repaying affection with sex and/or sexual acts and such at age 11?  This is a grade school child we're talking about here.\n\nI don't wish to offend, but something about this strikes me as very, very wrong.",
            "Your husband's son would be better off in an assisted or independent living facility where he can get appropriate care and have staff who understand how to handle his illness. Your husband probably has good intentions, but he needs to realize that the best place for his son is not in your home.",
            "[deleted]"
        ]
    },
    {
        "post_id": "41rh73",
        "author": "mythrowawayforyoutod",
        "title": "[UPDATE] My [23F] mother [54F] didn't realize how much I helped out around the house until I moved out and now she wants me back",
        "url": "https://www.reddit.com/r/relationships/comments/41rh73/update_my_23f_mother_54f_didnt_realize_how_much_i/",
        "score": 2378,
        "num_comments": 343,
        "created_utc": 1453246923.0,
        "selftext": "[Here is the original post](https://www.reddit.com/r/relationships/comments/3wr7th/my_23f_mother_54f_didnt_realize_how_much_i_helped/)\n\n\n**tl;dr original:** Grew up taking care of my family and household duties. I moved out and my home has become a mess. No one realized how much I cleaned up around the house until I was gone, and now my mom wants me to move back.\n\n\n-----------------------------------------------------------\n\n\nI was kind of surprised by how much everyones response to my mother was a resounding no. It made me feel silly for even considering it; there was really no benefit to keep enabling my mom and move back home.\n\n\nWell, Reddit, I'm sad to say that turning my mom down was the first time I had ever really stood up to her, and it did not go well. She instantly starting gulit tripping me -- how she had raised me, how family was everything, how I was being selfish and abandoning her\n\n\nWhen that didn't work, her insults turned more aggressive. She said I owed her money -- the money it cost to raise me, put me through college (my parents paid partial tuition), the accumulation of \"rent\" for letting me live at home during college (at no point had we ever discussed this), etc. Again, she pressed that I was taking advantage of the family by not moving back home and helping out.\n\n\nI don't wanna get into much detail because I am still very, very sad about how this has turned out, but my mom hasn't responded to my calls in weeks. She's antagonized me against the whole family, telling my siblings that I did something ambiguously terrible and am abandoning the family. I had a phone conversation with my sister Rachel, who said something along the lines of \"mom said you did something really mean to her, she won't tell us what, but she said that's why she made you move out.\" I've never been really close to my siblings, but I'm kind of taken aback how little anyone seems to care that I'm gone.\n\n\nRecently my mom put up a picture on Facebook of the whole family, with me absent, captioned \"The only people in my life I'll ever need.\"\n\n\nI'm trying to focus on my work and my friends to get through this, but I am in a very sad place right now. \n\n\n**tl;dr** Mom didn't take it well that I'm not moving home. She's completely cut me out of her life and is trying to turn my family against me. ",
        "permalink": "/r/relationships/comments/41rh73/update_my_23f_mother_54f_didnt_realize_how_much_i/",
        "comments": [
            "[deleted]",
            "Wow. The Facebook thing would kind of seal it for me.  I'd screenshot that, and, someday in the future, when she calls you needing help with something, I'd pull out that picture and tell her that she should just call one of the other people since that's all she'll ever need.",
            "[deleted]",
            "Ugh, the fact that you spent your entire time at that house doing chores without being asked and without any appreciation, only to be harassed and abused when you refused to go back to that situation makes my blood boil.  You made the right choice, OP.  You don't need family who treats you like trash.",
            "First of all, quit calling mom. All you're doing is making her feel better by allowing her to give you the silent treatment. Stop doing that, and go about living your life. Hell, unfollow her on Facebook so you don't have to see any of the shit she posts. If any of your siblings call again, ask if they notice how filthy the house has gotten since you left. Tell them you were the one keeping the house clean, and mom's pissed because you refused to come back home and play servant. If they get pissy too, block their numbers and carry on with your life. Things will cool down in a few months, and you can reestablish a relationship with your family on your terms.",
            ">my mom hasn't responded to my calls in weeks\n\nAlways keep this in mind:  You don't need her; she needs you.  I would immediately stop calling and stop trying to get back in her good graces.  You don't need to worry about what she thinks of you, it's the other way around.\n\nBe young, be independent, be happy and free, move on with your life.  Some day, I guarantee you this will happen, after you've lived without her and all your siblings leave the nest, she'll call you with the \"I don't know how we ever drifted apart, time to put the past behind us\" speech.",
            "Oh, you owe her money for the cost of raising you? Cool. Does she owe you money for your unpaid labour as a housekeeper over however many years? Yeah, that's what I thought.\n\nIt sucks your mum is reacting like this, but that's her damage, not yours. You've done nothing wrong, and you're going to continue to flourish without her.",
            "[removed]",
            "[deleted]",
            "Let yourself get angry. I don't mean lash out and yell, I just mean allow yourself to feel your justified anger. The power of that justified anger will steel your reserve so you don't give into her tactics - because that's what they are, they're spiteful and mean tactics meant to weaken your resolve and bend you to her will.\n\nIf you had a daughter, would you treat her the way your mother is treating you? If you behaved in that way, would you think you were a good parent? Your mother is having a tantrum, and all you can do is ignore her while she wails and kicks. \n\nSet your siblings straight and then hide your mother from your FB feed. It may take sometime, but she'll want to make amends eventually - hopefully she won't have destroyed your relationship by then. ",
            "Check out r/raisedbynarcissists. Your story would fit right in there.",
            "Whoooooa.\n\nI know it's easy for us to say that you are better off without her, goood riddance, etc. I know she's your mom, and, at least in the experiences with my own mother, no matter how terribly they act, there is still some part of us that wants their love and approval. It might take a long time to extinguish that, if we ever can.\n\nI know it hurts terribly right now, *especially* with her attempts to isolate you. The longer you are away from her, the easier it's going to get. There is this poisonous, toxic cloud around you now that is her influence. The longer you are away, that cloud is going to dissipate. You are going to breath more clearly, see more clearly, and think more clearly than you ever have. The power she has over your thoughts and feelings will be cut off, and she will seem every bit as sad, petty, and tragic as she does to us now. But you *have* to stay away. Don't call her. Don't reach out. If she reaches out, do *not* pick up the phone until you are confident that cloud is gone, and you know she has no power to surround you in it again. \n\nIf there is any family that you are at all close with that is not like your mom, I would recommend possibly reaching out to them. Keep rules strict. If *anyone* tries to get you to make up with your mom, or takes her side, or apologize first, whatever, you don't talk to them either. If your mom is always like this, which no doubt she is, you probably have some relatives she has pissed off or at least know what she is like. Get closer to family who isn't in her cloud, and let them help defend you. It's easy to say screw 'em all and what they think of me... and I agree with that to an extent. But no one wants to be badmouthed without the chance to defend themselves. See if there is anyone in your life who will support you.\n\nIt's going to get better. You are strong, and you were a good daughter. Don't ever let her convince you that you weren't. Use that patience and kindness you showed toward your family on people that appreciate and love you.",
            "I want you to know, and remember something.\n\nFamily is *not* your blood relations.  Family is *not* who raised you.\n\nThe people who love you, care about you, and lift you up - these people are your family.  Your family, is who *you* choose to love and surround yourself with.  Surround yourself with love and cut out the hate with no regrets.",
            "I am sorry she's taking it this way.  She should not have taken advantage of you in your childhood and she should not be trying to put you back in that role.\n\nI AM proud of you for taking control of your life.  Well done!",
            "Please tell your siblings the truth about what happened. If your next oldest sibling is 15, that's absolutely old enough to know the truth. When they get older and move out, they may need you for moral support.  And tell any other family that asks the truth, too. Your mom is being extremely immature and manipulative. Can you look into seeing a therapist to help you deal with this?",
            "You're doing the right thing. This is the sort of growing pain that occurs when something is freed from a cage. I'm sorry that your mother is manipulative and beastly--but as your sibs get older, they're going to be more and more willing to see your side of this farce.",
            "This is really sad. I'm sorry for you. But your mom is wrong about you and never forget that. ",
            "That's rough, but you did the right thing. Mom is toxic. Its not going to be easy, but at least now you know you have to set out on your own",
            "Don't worry. Your siblings will go through the same process as you.\n\nKeep contact with them. Be open about the truth. This will shake out alright.\n\nI'm sorry for your loss.",
            "What. A. Twat. \n\nAt least she's let you see her true nature before you were able to be guilted into doing anything more for her. Perhaps it's time to write a letter to your siblings and let them know the current situation from your side, and just leave it at that. Enjoy your extra free time of not being an unpaid servant.",
            "I would suggest just unfollowing her so you don't see her posts on your Facebook feed anymore.  Than you can live in ignorant bliss without obviously breaking off from her nonsense.  ",
            "You could have easily turned it back on her for all the free maid and nanny services provided to the family before you moved out means you don't owe them squat. ",
            ">my mom hasn't responded to my calls in weeks\n\nWhy are you still calling her? Stop calling her.\n\n>Recently my mom put up a picture on Facebook of the whole family, with me absent, captioned \"The only people in my life I'll ever need.\"\n\nThat is just cartoonishly trashy behavior. \n\nSave that picture and the next time she starts guilt-tripping you, email that picture to her.",
            "See the person you could have been helping? Ungrateful, mean, and a bully. \n\nI know this is hurting, but you need to see you hold all the power in the situation. She is doing the grown narcissistic version of a temper tantrum. Do as anyone would do with a tantrum. Ignore it and show her that shit won't work. \n\nI would go no contact with her at least for a while. You shouldn't consider visiting until she apologizes and let her know that. If she is mean again? Back to no contact and start the process over again. Eventually you will see if she cares enough to act decent. If she never does then you're still making out on top.",
            "I'm so sorry that your mom chose to end her relationship with you for the time being instead of handling your choice like an adult. It's natural to feel a sense of loss, but that doesn't mean you didn't do what was right for you. You're deserving of respect and shouldn't be taken advantage of. ",
            "> mom said you did something really mean to her, she won't tell us what, but she said that's why she made you move out.\"\n\nHeh. Mommy won't say why because she knows she's wrong and being hateful because she didn't get her slave back. Don't call her, text her, or anything with her. She's willing to screw her child over for the sake of laundry and dishes. You don't owe her any money or your time. Especially with that attitude of her's.",
            "your mom is nuts.",
            "Your mom is being very immature.\n\nFirst off, you don't owe her any money for raising you. She made the choice to have you, that's the cost of being a parent.\n\nSecond, I'm sorry that your mom is ruining your relationship. The goal of raising children is to give them skills to be independent, not keep them serving the parents till death do them part. She should be proud that you're managing on your own, not distancing you from all family.\n\nYour mom is a lost cause, at least for the time being.",
            "No fault of yours, but your mother's response just makes me so angry! It's bullshit! A child does not owe it's parent for the cost of upbringing. At all. Let your siblings know your side and that leaving does not mean you don't love them. You do you and hopefully your mother will get over it.\n\nWhere is your father in all this?",
            "I'm really sorry that she is treating you this way. It must be really rough and painful. Just know that you are doing the right thing, and that going back would not and will not solve anything. Your mom is not being loving or rational, so there's no real point in trying to get through to her. \n\nJust focus on yourself and keep busy, maybe talk to a therapist if you can afford it. *hug*",
            "Your mom is scum. Complete and absolute scum. If your family believes her, they're idiots. Are you sure you weren't adopted? \n\nDon't call her anymore. Every time she ignores your call, it gives her a little thrill about how her awful treatment of you is working. The way to go is to straight up ignore her until she apologizes, profusely, for all of her bad behavior and then tells everyone else it was her fault. Only then can you start to even think about possibly allowing her back into your life in any way shape or form. ",
            "When someone chooses to have a child and raise them, the cost of raising them is a gift. It does not need to be repaid. It's the \"cost of doing business,\" i.e. the cost of having a child. Now, if you win the lottery or something and want to \"reimburse\" her for that money she spent, that'd be a wonderfully touching gesture on your part, but certainly not a requirement.\n\nIf she continues to harp about the money you \"owe\" her, hand her an invoice for your services as maid and housecleaner for the last 18 years or whatever. What a surprise! The amount you \"owe\" her is exactly equal to the amount she \"owes\" you!",
            "Stop hiding what happened from your siblings. Call your sister and tell her the whole story,  currently she was told you did something bad and you said nothing to defend yourself? That makes it sound like you did. ",
            "Oldest of five here, 16 years older than the youngest. I babysat a Lot. Cleaned, I was mama zombieboobies. \n\nWhen I moved out my parents were shocked. It never occurred to them I might like my own bed and money one day. Basically, don't feel guilty.  Also, sorry your mom is immature and a little crazy, I know that feel too.  \n\nIf you occasionally feel like posting pics of your fabulous, clean life on Facebook, I don't think that would be such a bad thing.  Enjoy life. ",
            "I know this is recommended all the time here, but you really should check out /r/raisedbynarcissists, because her reaction sounds like a classic narcissistic response. I'm sure there were clues all along, but you might not have noticed because you always did what she wanted. If you check out the site and her behavior sounds familiar, keep in mind that the more you try to be nice to a narcissist, the meaner they are to you. If you're rude and dismissive, they tend to try to suck up to you. No idea why, but being nice doesn't pay in this case. ",
            "You 100% do not deserve any of her abuse. I am so sorry this is how she is acting. Please focus on the people who love you.",
            "Am so sorry to hear about your mother's reaction. It's hard when someone you love treats you so badly.\n\nRemember first, though, that you don't owe her anything. As people are fond of saying on r/relationships, you didn't ask to be born, your mother made that choice and at that point she had an obligation to take care of you. Again, you owe her nothing.\n\nYou have done much above and beyond the typical child as well. The amount of work you put into the house is admirable and something you should be proud of. Again, you owe her nothing.\n\nCheck-in with your siblings, explain to them what really happened. Ask them if your mom expected any of them to do what she's expecting you to do. \n\nTalk with your friends about this, lean on them. This is the time to get support from those around you. Again, sorry this had to happen, but your mom did this, not you. \n\nGood luck.",
            "Wow. That's a really strong and vicious response to not that big of a problem. That is some serious emotional manipulation and guilt-tripping. I bet if you sat down with a therapist or close friend as an outside observer and talked about your childhood you'll realize that this sort of thing was a lot more frequent than you thought. Emotional abuse can be very subtle; especially when it's all you know. People don't reach that level of emotional manipulation without practice.",
            "I'm very impressed OP. You're showing your younger siblings that it's ok to not cave in under pressure from mom (or anyone). You're doing the hard work now to ensure that you have the possibility of a healthy relationship with your mom down the road. You're staying strong in the face of bullying, manipulation and lies. You're my new hero. \n\nEveryone in this thread is right, stop calling her, and after that hateful post I'd block her (not your sibs) on Facebook too. Your brothers and sisters are going to go through the same thing the first time they cross her too, so leave the lines of communication open,  they'll see it eventually. Probably sooner now that you're not there. If anyone asks what's going on don't be shy, be honest and tell them. Being honest about boundaries is important and part of being an adult. \n\nKeep doing what you're doing, you are amazing.",
            "Im so sorry, OP. Thats awful and heart wrenching to go through. :(",
            "Sorry your mom is being so horrible.  \n\nEvery child at some point leaves the house and becomes independent, and she should be happy you've become an adult.  Instead, she's regretful that she lost her domestic staff.  She'd rather have you live as a live in maid and nanny instead of starting your own life.\n\nTry to maintain relationships with everyone in your family but your mom.  When they say your mom is telling them you did something bad, tell them that she's mad you wouldn't move back home to run the household for her.\n\nShe'll probably cool off in a few months once everyone adjusts to you living on your own and picking up the slack (or just accepting the mess), but if she doesn't reach out to you then don't include her in big life events (promotions at work, wedding, babies).  Invite everyone else, but not her.  If she asks, tell her you thought she wasn't interested because she hasn't been taking your calls and posting passive aggressive things on social media.  If she tries cutting you down again, tell her she's a disappointment as a mother because of her unrealistic expectations from her adult children and emotional manipulation.\n\nAlso, if things are still strained when she gets older, I'd push hard to put her in a home when you and your siblings are discussing what to do with her.  Don't take her in.",
            "Wow, now that's doubling down on crazy. Your siblings will understand when they are older, you just gotta move on and look out for #1.",
            "Your mom sounds coocoo for cocopuffs ",
            "This is probably messed up but this story makes me want to call my mom and tell her how much I love her. \n\nGoddamn dude, I can't imagine how that feels. ",
            "> I had a phone conversation with my sister Rachel, who said something along the lines of \"mom said you did something really mean to her, she won't tell us what, but she said that's why she made you move out.\"\n\nYou should have told her the truth: That your mum wanted you to come back and clean up after everyone.\n\nEven if she didn't believe you at this point, she would at least have some warning that your mother will try to guilt-trip another sibling into cleaning up after everyone.\n\n> I've never been really close to my siblings, but I'm kind of taken aback how little anyone seems to care that I'm gone.\n\nThat's because you spent most of your life cleaning instead of having quality time with them. See if you can reach out to them to meet for coffee once in awhile. They may just be used to not having you to talk to because you're busy cleaning.",
            "Maybe you need better defensive techniques against her spreading lies about that. When your sister says \"you did something bad against mom\" you ask \"do you really believe that?\" , or \"mom is mad at me for moving out, she is badmouthing me, hoping I will cave in and move back\". Straight up. Get it straight what has happened so there is that seed of doubt about the narrative your mother is telling. I'm sure they are more then aware of what your mom is like. \n\nAlso, I would forget about her. She is never going to change. She doesn't really care about you, she just wants you as her indentured servant she can fill with doubts about how you owe her. Saying you should pay her back for everything you cost growing up is her trying to set you back. Normal parents want their children to succeed but if you succeed she cannot get what she wants from you so she is trying make it impossible for you to be independent.  ",
            "Your mother sounds like she is 54 going on 12.",
            "Wants to charge you rent? How about you charge her for the free housekeeping and childcare you provided all those years. \n\nStay strong. The silent treatment is a last ditch effort to manipulate you into moving back home. The only appropriate response to the snub on facebook is to unfriend her. Also, don't be shy about setting your sister straight when she comes at you with lies.",
            "BTW, if she tries to manipulate your family against you, feel free to turn it around - tell them you moved out by choice, your reasons for doing so, and your plan going ahead. Let them know that you still care about her, and that you're really hurt by her behavior, but when she's ready to accept you back on reasonable terms, you'll gladly see her again.",
            "Wow, situations like these really reveal a persons true colors. Take a bit to let what your mother has said and done to you (unfairly) sink and and realize that you should not tolerate that behavior.\n\nIf you value your relationship with your siblings, I would suggest setting them straight if that boat hasn't already sailed. Did your sister believe what your mom told her about you, that you did something bad and SHE made you move out? Rubbish, your mother clearly isn't above lying to get what she wants. ",
            "Something similar happened to me, except it was an aunt.  When my mom died unexpectedly at age 45, my aunt literally turned the entire family against me.  It resulted in a lot of harassment, lies, and me getting sued by my grandfather, so I moved over 1000 miles away.  I cut off all family contact.  *Best choice ever.*",
            "I would cut contact with her, and maybe the rest of your family, at least for a year or two. The only leverage we have over our parents as adult children is our presence in their lives. That will allow you to develop patterns of behavior independent of her as well.",
            "It hurts, but please remember that none of what she's doing is in any way your fault - your mom is behaving in a selfish and childish way. She's trying to make it hurt so you come crawling back, just the way she wants you to. \n\nIt sounds like you're pretty well put-together. I don't know a lot about your situation, but it sounds like you've got this. \n\nOh, and if she ever brings up the money thing again, give her a quote for how much a maid makes an hour, and figure that into her idea of what you \"owe\" her. ",
            "If she insists you pay her for 20-odd years of food and rent, I think you should insist she pay you for 20-odd years of housework. Should about even out.",
            "Stop calling and remove her from your facebook. Cut all contact. Yes its very hard but its what you have to do for yourself. I'm so sorry your family is awful. You could consider writing your sibling(s) and email and explain everything if you want to try and stay in touch with them. But your mother... she is not acting like a parent should, and you will be much better off without her toxic, narcissistic presence in your life. I'm so sorry. ",
            "Your mother is a grade C for CRAZY narcissist. You should head over to /r/raisedbynarcissists, I bet you'll hear a lot of familiar things there.\n\nYou may want to write an email to all of your siblings and family that you really do care about. Be prepared, that your mother will make outlandish and wild accusations about you and why you are a bad person. Warning everyone against that is something you should do but be fore warned, your Mom will have her Flying Monkeys (people who believe her). \n\nYou owe your mother nothing. Move on with your life and speak to everyone else, but her. Also, she will try and upend you through your siblings, so just watch out for that.",
            "Visit /r/raisedbynarcissists.  Sounds like your mother could be a narcissist.\n\nYour mother only wants you in her life for what she can get out of you (housekeeping, money...).  The minute you don't play her game, she's got no use for you.  You're better off to go live your life without her holding you back.",
            "You might want to visit /r/raisedbynarcissists , even if she isn't actually a real narcissist she is being very manipulative and cold to you and you might identify with some of the stories there or the advice commonly posted. ",
            "I'm so, so sorry.  Create your own family now with people you choose.  Whatever happens with your birth family just remember you are allowed to say no and you're allowed to speak up for yourself and set boundaries.  If any of that fails you are always, always wholeheartedly allowed to say No.\n\nKeep in mind.  I, personally, have said to my own mother: \"It's time you back off.  It is not your place or responsibility to say that to me and we need a break from each other\"  And she, after a gaping mouthed, speechless 30 seconds said \"ok\" and then waited a month of radio silence for me to call her.  And because I set healthy boundaries and she has become a healthy (ish) person she did as I asked and we now have a healthy relationship. She's not perfect but she knows she won't get away with crossing the line I set. Don't settle for anything less, you're allowed to stand up for yourself to family.  ",
            "Whoa! This is NOT how family works! The whole point is to raise you children and then let them go and make their own life. This is so unhealthy! Stay strong OP, hope you have a strong support system. You're worth way more than what she's making you out to be.",
            "I can't imagine how you are feeling from all this, it sounds so draining. You are sad and maybe it feels like you made it all worse, but we are all rooting for you for a reason. Strangely enough we have a better view from the outside. Standing up to your mother is the best thing you could have done for yourself, and you should be very proud that you did it. Stay strong, and don't hesitate to get in touch if you find yourself too sad or in need of encouragement. Hugs.",
            "I think you are more sad over what type of parent you have.I always wanted a nurturing, best friend, and take care of me when I'm sick kind of mom. What I got was a suck it up, get over it and nock it off type. I had to grieve that I'm not going to have that. Years later tables are turned. I'm now taking care of her. I looked her in the eye one time and said \"you should be thanking me that I didn't take after you. I'm kind, compassionate and care about people. \" I get an attitude sometimes. She yells at me \"where do I get that from\" I smile and say \"you!\" One day your mother will need to be cared for. It will be your siblings problem.",
            "You can get through this.",
            "> . She said I owed her money -- the money it cost to raise me, put me through college (my parents paid partial tuition), the accumulation of \"rent\" for letting me live at home during college (at no point had we ever discussed this), etc. \n\nIf she indeed thinks money is owed, there are court systems for that sort of thing.  Not that a judge in the world would ever find in her favor.\n\nI would say get out ahead of her as far as PR goes.  Who knows what she is saying, but just emphasize the truth to the rest of the family members and let them make their decisions.",
            "If you owe her rent from while you were staying there and going to school, she owes you back wages for your work as her cook and housekeeper.",
            "Stay strong. YOU CAN DO THIS. Think about it.. she is counting on you giving in. She's been counting on that since the beginning because that's what little respect she has for you. She'll keep turning up the heat because she knows that you'll cave. \n\nYou got this far. Stick with it.",
            "Did you tell your sister the whole story?",
            "I had a VERY similar experience with my mother. I had finally decided to set some boundaries with her and for the first time ever told her that I could not talk when she called me. I told her that I would call her back but that it would not be that day, but the next as I had a friend in town. That was enough for her to lose her shit and she began calling and calling and calling. She finally left a message telling me that I was an ungrateful bitch and started listing off every thing she had ever bought me. She then told me to never talk to her again. \n\nShe then went on to tell my sister that I was a horrible person who did unspeakable things to her but would. It elaborate. My sister would call me up demanding that I apologize to my mother. \n\nIt sucks. I'm sorry you don't have a nice mother. Once you stop expecting anything else, it gets a little easier, but it still really sucks. ",
            "If you are so desperate to contact her, draw up an invoice for everything you \"owe\" her and then draw up one for all the housekeeping and cooking you did and make it balance out. Include a picture of yourself and label it, \"the only person I will ever need\"",
            "Take the high road and save the FB shot for later, or comment. Comment and expose all you've done for her and this is how she's treating you. The only thing FB is good for these days is getting people to like, comment, and share stupid things. Might as well make something meaningful. \n\nAlso tell your siblings. Tell them the truth. Couldn't hurt. \n\nWhere is your dad in all of this?",
            "Whoa. This is INTENSE.\n\nI cannot in anyway relate to the extreme behavior of your Mom, but I would say that I used to keep the family together (contact them, plan vacations, etc.). I stopped recently and seeing who makes the effort to contact me and see me has really opened my eyes over who in the family values me...and who doesn't.\n\nIf your entire family is willing to just stop talking to you over your Mom's absurd allegations (which aren't even clear!), then you need to accept that, despite being blood, they are not family.",
            "I love that she tried to guilt trip you saying family is important and when it didn't work she switches gears to cut you out of the family. It certainly shows how important family is to her. I wouldn't call her again and wait for her to call you with a apology because what she said and did is unacceptable. She knows that she would be in the wrong which is why she lied to your siblings. If you speak to them again you should tell them the truth of why she's so mad at you. ",
            "Tell her that she can deduct the amount from your paycheck for all those hours working as a housekeeper/nanny!\n\nThey always get so pissed when they realize you've slipped out of your leash!",
            "This is perhaps messed up but this story makes me want to call my mom and tell her how much I love her.\n\nGoddamn dude, I cannot imagine how that feels.\n",
            "Is your mom 15 years old? ",
            "\"Sure mom, I'll pay you rent but you need to pay me retroactively for a nannying/house keeping wage. As soon as you start making payments for my services I'll pay for yours. As far as needing help around the house why don't you ask one of the family members belonging to the group of 'the only people you'll ever need?'\" ",
            "Etrikoba dui tetapo toe pobe pebapa? Toe a bego papru pupe ie. I pi e getu tigripi ie. Upu dupo pipo pitoi ebri. Truka tiiba bie tee to kia dipo bibe. Kipube tupata iti po piita ketite tati e e. U i dlei ii grekikreke gipu. Akre tritriudrio brope tregau. Pope kedeki brobi pupiki itri pipriki. Ia ite ekle pai pe beepa. Oi pe ge tii pitidii oblebo kliaki ebi. Tode tuitli tli tepe iu. Udee a ti tlepokra go pepo. Pepepo klota kreba pikeki tipi pade. Toi klipe i aboplike bledakei pidepuapi kate glika eudlotuge. Koa tigriklo kipe bri i io. Gita kitibi epa ta pie kiti titupe. Tre papri pipebro traiogle bitikle topie. Pai pita tepiti pipretepabu kekliaki kli. Itipe kuepikri ako teadrutiu pi a. Biki i aklipebita di ko kitlo da uti eii! Bapiepro ti peikri ukibli obi ibu puo diproti. I ipli pipugre pipla pepu to kei. Pai pipe pri obi kipiedo aiki pada. Tadapi pateboeti bruplapa brae daoteta! Pua putu peibike akla eprei pitekri. Kie tu bakri ki epopio prabloti apu tita. Ko pipleki bleipipro otu kropi pro. Tipio e a tlepiki ki pebriate a bri kige. De po trau titi kro gii.",
            "I honestly went through the exact same thing. \n\nI did everything for my family. Cooked, cleaned, washed clothes, took care of animals, played taxi, the whole 9. \n\nWhen I moved out it all went to hell in a hand basket and my whole family bitched and moaned and complained about having to take care of themselves. \n\nWhich was the first step in the rapid deterioration of my relationship with them. We don't even speak now. ",
            "I'm sorry this happened to you, your mother seems really petty and cruel. Just remember that *she* chose to raise you, you had no say in that. You don't owe her anything; and quite frankly, you've paid her back (if there were anything TO pay back) by keeping the house clean for everyone during the time you were living at home.\n\nHonestly, one of the most important lessons you can learn growing up is that when you're out in the world, you are able to choose your own family and your own tribe. Lots of people keep the families they grew up with but you're never under any obligation to do so, and you can still find a new family. Surround yourself with people who care about you for who you are and make them your family.",
            "Reading this post made me want to hug my mum. It's so easy to take your relatives for granted and you only realize how much they are wonderful when you hear horror stories like this one. It's so sad that everyone doesn't have loving parents. Stay string OP and remove these toxic people from your lives!",
            "Dam girl, your mom is selfish.",
            "See, I had a similar fallout with my family over how they have reacted since I moved away 8 years ago.\n\nBasically they have turned more petty and argumentative to the extreme and mainly yell at one another to communicate.\n\nWhen I objected to this when I was visiting it was put in my face that I was gone for 8 years and not really part of the family any more...\n\nFamily is who you make of it, not just those of whom you share blood.\n\nI love my family, and always will, but I have family where I live now, not least of all my wife.\n\nFamily isn't just your last name or you genetics, they are the people you trust to involve in your life and trust to share your life with. ",
            "This may not apply to you but you may want to check out /r/raisedbynarcissists you may have been the golden child",
            "That is terrible. I am so sorry you have to deal with such crap. Stay strong and know that you are a good person! Hugs!!",
            "Your mother is a narcissistic bitch who thinks you owe her your life because she raised you. This mindset is so disgusting and toxic and you did the right thing.",
            "/r/raisedbynarcissists\n\nstay strong. you made the right decision.",
            "IRL Cinderella. Except you were your own prince and fairy godmother and got yourself out of there.",
            "So, she needs you to do chores, but she wants to charge you rent? And she wants you to move back home, so you can do chores again... and presumably she'll charge you more rent?\n\nThis is painful, OP, and sad. I never understand why some people treat their family members so badly. Hopefully you will be able to reconcile in the future.",
            "I feel like there was a whole lot of shit you are leaving out of your posts relating to how terrible a person your mom really is.",
            "/r/raisedbynarcissists \n\nMy gf's mother did this when she moved out (well, we.. I had lived there for a couple months). It was awful.\n\nIt was house chores and also taking care of her brother, who was a drug addict. It's taken several years and the death of her brother to get her mom to come around and be mostly not abusive. \n\nMy missus went low contact with her mom for a long time... it was the best thing for her. Any time her mom would start a guilt trip, start yelling, or berating her, she would hang up the phone. She still called her mom just about every day unless she said something particularly nasty (which, I wouldn't. I'd probably call once a week, but her mom has severe depression... gf didn't want to just ignore her).\n\nReally sorry you're going through this, but it's not you... it's your mom. She's a narcissist and will do whatever it takes to get her way. She'll say \"it's all about you, it's all about what you want\" but in reality, it's all about her. It always has been, always will be.\n\nGo low contact, don't let her berate or insult you, better yourself. It's like drug addiction... you can't fix someone for them. All you can do is try to set a good example and hope they follow. Or you may even want to go no contact for a while... since she \"doesn't need\" you, which is right up there on the list of things you should never say to your children.\n\nAlso, I'd be sure to talk to the rest of the family... maybe not even about your mom, I'd be careful not to badmouth her too much, because then people might take sides... unless they know how your mom is. Just to check in with them and make sure they know you're not actually abandoning the family. \"Hey! How are you doing? I just got a new place here, you should stop by sometime. [optional] Mom's kind of upset, I think she's feeling the empty nest syndrome... I hope she comes around.. it was just time to start my adult life ;)\"\n\nI don't know how the rest of your relationship is with your mom... but if she's generally not abusive and shitty, I hope she really does come around. It's tough dealing with parents with mental disorders. I've told my SO so many times \"if that was my mom I would have dropped her from my life by now\" but she reminds me, \"she's mentally ill, and that's the only mom I've got.\"\n\nIf you want any more advice, I highly recommend /r/raisedbynarcissists, or if you want to talk to someone who's been there, feel free to PM. ",
            "Your mom just gave you the gift of freedom!  You already didn't feel moving back home was a good idea, you're mom helped you out and solidified your resolve.  Celebrate your freedom!",
            "Wow this post seems like it could be on the raised by narcasistic thread.\nBut hey OP, I'm sorry you have to go through this. Kill them with kindness but use this situation as a reason the never regret moving out ",
            "I'd have captioned her photo and mentioned that she's pissed that you won't move back home and clean up her house.",
            "First of all, your mother is a raging narcissist. She does not care about you, she only cares about what you provided to her. As soon as the cleaning stopped, she demanded you drop what you're doing and help her. When you said no, she began badmouthing you to family, and pulling up the costs of raising you (that is a trick many bad parents use to try and justify that you owe them something. You do not owe them anything, it's called being a parent. If they didn't want to pay to take care of you, they shouldn't have had you. Parents cannot ask for that money later.)\n\nThe picture on Facebook is a low blow, and it was posted to spite you. Tell your siblings what you actually did, tell them mom is acting ridiculous, explain your reasoning. Please cut your mom out of your life. She's being a child because she doesn't want to do chores. She's being toxic to you because she's being selfish. Do not let her get away with it. ",
            "Send *her* a bill the the years of housekeeping work you did. $16/hr, 12 hours a week, 15 years. Comes to around $150,000.",
            "/r/raisedbynarissists (sp?)",
            "This sounds like something you should post in /r/raisedbynarcissists, they have a lot of experience with these situations. You're not alone in this. ",
            "Holy dogshit. It didnt sound bad enough in the original to warrant a raisedbynarcissists mention, but it sure as hell does now!",
            "Wow. I'm so sorry to hear this. It must be horribly painful. You deserve better. (((hugs)))",
            "Your mother sounds like an insufferable narcissist. I would feel no shame in cutting someone like that out of my life. ",
            "You should put up a picture of her on your Facebook with the caption \"The only narcissist in my life I'll ever need.  (go do your own damn housework)\"",
            "I am so, so sorry OP, and I know it's hard to see it now, but at least you know now that your mother's love is extremely, extremely conditional. That will make it easier to say no again in the future- and I guarantee you, if you don't cut her off completely now, she will be back. She's being childish and terrible. Good luck, OP. Stay strong!",
            "I'm sorry to say that your mother sounds like a terrible person who's just shown her true colors. It took incredible strength to stand up to your mother like that.  Stay strong, I know it may not seem like it, but you're better off without her controlling you.\n\nAll you can do about your siblings is be truthful.  Tell them what happened.  Even if they don't believe you right now, it could help them recognize what kind of person your mother is in the future.\n\nAnd, for the love of god, stop calling her.  Keep communication with her to a minimum.",
            "Congratulations on moving and staying out. I think every child should try and move out somewhere between the ages of 18 and 21.",
            "Most parents would be estatic that their kids have finally moved out of the house while yours wants you to come back",
            "She is a horrible person your mother that is, she just wants you to be her house slave and use you. if she really loves you she would want you to be the best person you can be. You don't owe her shit for raising you, guess what she decide to have you as a baby and she is entitled to raise you and pay for what ever you need since you are a baby and in her care. Please don't break and go back if you do she will always have that over you and will continue to have power over you. The best revenge is success my friend she will come around sooner or later if not you don't need someone so evil in your life like that anyway  ",
            "That's so sad. I'm really sorry that's happened to you. You don't deserve to be treated this way at all. ",
            "It would be OK to talk to your siblings and explain your side. I bet if you ask them about their experiences with your mom, you might hear some things you didn't know about. \n\nIf you ever feel guilty, just remember that she could hire a cleaning service. ",
            "I have similar issues with my mum. She was mentally absent a lot when I was young and I automatically took on extra responsibility as she slept most of the time. Then when I got older she always had some health problem which meant she couldn't do as much so I continued to be the stand in carer but when I left home it was almost expected that I would step in to help her with my younger siblings even after they were adults themselves. It's been years now since I lived at home and its no better except she knows I won't take as much of her shit. I haven't spoken to my mum for over a year at this point and I got a call from the police wanting to know if my brother could stay at my place for one night as him and my mum had a bust up. I had to turn them down as I know with my mum it is never just a simple thing. I feel terrible but I also have to watch out for my mental state and it could have been a very bad situation for me to be in.",
            "Honestly it seems to me that you raised yourself, not your mother. It seems like you have been very independent from a young age and your mother has been a lazy slob and not at all considered that you have been doing a lot of work behind the scenes. It seems to me that she never cared for you. I am so sorry to say that, and I hope I am wrong on a whole level, but for now, that's what it seems like to me. \n\nI am sure if you explain the situation to a family member (just like you did here but in a bit more detail), they might actually understand and tell your mother off or make her understand that she needs to get up and be independent herself.",
            "Count yourself lucky that she left and walked away. You are free now and can life a good life without that. If it stays this way you will notice that you are going to be feeling better with time. Maybe even smile more. ",
            "she sounds horrible",
            "Holy crap, do we have the same mother or something?\n\nDon't let yourself be gaslighted or guilted. You were incredible kind for doing all those chores without even complaining, and she should be grateful.\n\nI'm sorry that it doesn't seem like your family cares, and that your mom is spreading lies about you. *Do not move home and become her slave*. Good luck!",
            "Keep your conscience clean. From what it sounds like, you've got the moral high ground here, so don't allow yourself to stoop to her level. Eventually, if you stay strong and level-headed, eventually she will burn herself out and realize the wrong in her actions. Then, be ready and willing to have a mature talk and clear things up. It just takes willpower, and you've got it. ",
            "Holy wow your mom is a horror.",
            "It sounds like a codependency issue, not that I'm an expert. I do recommend you seek out a good counselor to have a few sessions with.\n\nDon't give in to your mother's tantrums. She needs to grow up.\n\n>I had a phone conversation with my sister Rachel, who said something along the lines of \"mom said you did something really mean to her, she won't tell us what, but she said that's why she made you move out.\" I've never been really close to my siblings, but I'm kind of taken aback how little anyone seems to care that I'm gone.\n\nThis seems very telling. It's almost sounds like you're about the only one in the family who has matured in emotional terms.\n\n>I'm trying to focus on my work and my friends to get through this, but I am in a very sad place right now. \n\nThat sounds normal. Grief is something nearly everybody goes through. I do think it will be good for you to make an appointment to see a counselor. I will say that to me you sound like a OK sort of person. I don't see you have done anything wrong and you deserve to live your life how you want to.",
            "Her reaction doesn't surprise me. I'm so sorry your mom is so shitty, OP. :/",
            "Wow, your mum sounds like a terrificly terrifying human being. I sure wouldn't want her manipulative emotional abuse in my life. Good on you for standing up to her, OP. I hope you don't feel too sad about the revelation that no-one in your family seems to care that much about you, I know that one is hard to take if you always held them dear to you, but your mother is doing you a favour unintentionally by outing your family as people who don't value you in their lives, else they would fight harder to figure out what happened. Here's to hoping she at least cleans up for Christmas, or it will be quite an embarrassment for her to receive guests in a pigsty! Hope she cleans up her act, too, because she's just being an embarrassment to the human race. \nLove you, OP, you're the best!\n\nOkay, I might've gone a bit overboard with the emotional support there, but reading about how your mum treats you made me want to balance it out somehow :D",
            "I am so sorry that your mother turned out like that. \nShe has managed to hide this side of her from you untill now and I can only imagine how hurtful it is for you to finally see her true colors. \nIn order to not back down know that what you have seen will not dissappear. It will resurface if she feels she must. I say this as an attempt to give you the strength needed. \nI would be heartbroken if my mother suddenly behaved like that.\nSo, I can only say that I hope you get through this. \n",
            "I'm so sorry your mom is being this shitty. I was excited at first to see your update, I hoped your mom was at least showing signs of growing up. Sometimes parents, too, need a solid push to \"grow up\" into the next phase of life after their children become adults. But no, your mom actually is a jerk. I'm sorry :(",
            "That is so cruel, I am so sorry.  I hope that one day you can build your own family with people that love and respect you, rather than abuse and take advantage of you.  ",
            "I feel for you, OP. From what you're describing, your mom sounds a heck of alot like my mom. I know it must be rough and I hope the best for you both. ",
            "have you ever seen Cinderella?",
            "/r/raisedbynarcissists \n\nYou owe her no money, nothing. She decided to have kids, she pays for them. What a horrid parent. ",
            "Are your dad or grandparents in the picture?  Explain to them how unfair what your mom is asking of you is, and how cruel and hurtful she's being with cutting off your relationship and posting such disgraceful facebook messages.  If they say, that you should bear it because your mom has some sort of headstrong personality and that this is the easiest way or that it's your duty as a child to obedient, let them know that \"despite your being a woman and their child/grandchild,\" you have feelings too and that they matter and that you don't deserve to be treated the way that you're being treated by her.  That your mom unbidden by you turned your relationship into a monetary one rather than a parent-child-family one.  That not once did you ever ask to be paid to do all the things that you did around the house for your family, but that as soon as your mom realized that she your not doing it anymore was inconvenient for her, she asked you for rent, the money it took to raise you, and college tuition fees.  That this very dialogue makes you feel like you are not part of this family and that the only value your mother seems to for you is that of a maid and helping hand.  That you hope it was spoken in the moment and that she didn't mean it (that from her perspective, she's rationalizing in a very egocentric manner that you don't care about her and are leaving her to suffer), but that you're somewhat skeptical of that notion since she's trying to say that you said and did horrible things to her when in fact it was her who did it to you and that she continues to ostracize you from your family and her life.\n\nLet them know that you've done everything that's been expected of you as a daughter and an older sibling.  That it's time for you spread your wings and think about your future and your career, rather than be a secondary mother to your siblings, that any obligation to do that as a family member ended when you reached college and focused on your career and your siblings grew old enough to bear the responsibility that was hoisted upon you at age 8.  It's your siblings turn to take care of things.  That you're available to consult and teach, but that you're not moving back and you're not doing these things for them.  Let them know that there is absolutely nothing so urgent happening at home that it's absolutely vital that you come home.  That this is something your siblings need to learn to do for themselves.\n\nGood luck.  Hopefully you log in and read this before a month.",
            "Wow, your mom is going full ham. Why are you trying to call her multiple times? She is the one being horrible here. You should not be the one reaching out. Actually, I would tell her to get fucked even if she reached out and gave a big sincere apolegy. The shit she pulled is unforgivable.",
            "This situation is one that stay true to the whole saying \"you don't know/appreciate what you had until it's gone\".",
            "Well, if she's going there with rent, maybe you should start drawing up some invoices for babysitting, maid services, and chef (if you did cook, I'm not sure if you mentioned that).",
            "Sorry that this happened. Stories like these always confuse me. This is not how parents (or adults in general) should act. It's completely immature. I hope you can at least fix things with your siblings if your mother won't back down. Good luck.",
            "That sounds incredibly hurtful. I am sorry you had this experience with your mom, but I guess now you know doesn't feel the unconditional motherly love that most moms feel. \n\nGiven her behavior, you are clearly better off without her, but I'm sure it still hurts.\n\nStay strong.",
            "About the \"money you owe her\": Tell her you paid her by doing free labour as a nanny/housekeeper. ",
            "She cut you out? \n\nThink of it as a blessing in disguise - she is toxic and she is out of your life.\n\nIt ok to think of her as dead, and mourn your family for what it could have been. It's ok to be sad and even more ok to talk to a neutral, trained person to process your feeling and get out of your sadness.\n\nYou will meet people, while not related to you, will love you and cherish you for who you are and not because they can take advantage of you.\n\n((hugs)).",
            "I think this is a good lesson parents how not to raise kids ",
            "I'm so, so, sorry. Please don't let this get you down. I know that's easier said than done but the only thing you can do is explain your part to whomever you think is important enough to know the whole story and let karma take it's course. Considering that she got mad at you first leads me to believe she has no idea how to parent the other children and got lucky with you. This is not your fault.",
            "I know how it feels to be sad when your mom treats you that way. And I've got nothing more to add to the advice others have given to you, but I do want to tell you that your feelings are what I've felt too, and I wanted to give you Internet hugs!",
            "As stated by /u/FireStorm005: \"Her mom owes her money for the years of cleaning service, laundry service, babysitting service, and cooking...\" absolutely. If it had been to her financial disadvantage to have your services on-hand, she wouldn't be working so hard to regain that luxury.",
            "Cant really add more than people have said bar your mother is a terrible, manipulative arsehole and you are better off without her, even if you dont feel like it right now. ",
            "Stop calling your mum, she likes the attention. Keep talking to your siblings, they've done nothing wrong.\n\nDon't get dragged into facebook drama either. Just keep going.",
            "This sounds really tough. Good luck with everything.\n\nAlso /r/raisedbynarcissists might be a thing to check out.",
            "Hum... \n\nYou are the first one to leave the nest right?\n\nIs not just the helping with the house thing, she was not prepared to let you go, and reacted badly. It will pass, just stay strong in your decision.",
            "To be completely honest, I am going through an eerily similar situation myself. I still live at home and have recently decided it's time to move out but one of my biggest worries is my family reacting like yours. I am so sorry that you had to go through that. That being said, you made the right choice by saying no. You need to live your own life, and I understand you feel a responsibility, even if it was one you took upon yourself growing up, but it's time to think about yourself now. Your mother might be acting a little petty right now but I feel like once some time passes she'll accept it. She knew eventually you would be leaving. Once things calm down you can set the record straight with the rest of your family, but I think right now it's just a matter of getting your mom to accept that it's time for you to live your life. Good luck, I hope everything turns out well for you. ",
            "You have done the right thing, hopefully one day she will understand but stay strong till then ",
            "r/raisedbynarcissists ",
            "I dont understand why you would want a relationship with this owman AT ALL.  You should want zero contact.\n\nWrite your siblings an email explaining what happened. Say you love them and will always be there for them, but you cant live your life being a stand in for your mom because she is too lazy to do it herself.  \n\nThen get therapy and stay strong.\n\nYour mom is a classic narcissist abuser and you escaped. You should be so proud of yourself. ",
            "You didn't get a say on being born, her saying you owe her is bullshit.",
            "Take the fact that she cut you out as a blessing. You don't need that kind of person in your life. Ain't nobody got time for that.",
            "Does she not realize that she's the responsible one for not teaching your siblings to do more around the house? She needs to instill that in them, not you. She sounds like a grown child trying to put blame on you. Stay strong, you don't need that. ",
            "Have you read about Narcissistic Personality Disorder?",
            "Just tell the Rest of your Family the real Story, its part of being a Parent to raise the Child and pay Costs for Stuff. ",
            "Squee! I'm so glad so many have already directed you to /r/raisedbynarcissists. This is such N behaviour, and it's so gross.\n\nI am so, so sorry this has happened to you. I personally understand what it feels like for someone to try to reel you back in to keep their lives comfortable at your expense. This will be hard, I'm not going to lie. Nparents NEVER make shit like this easy.\n\nWe are always here for you, and feel free to inbox any of us or make a post at /r/raisedbynarcissists whenever you like if you ever need anything. We will do our best to offer you all the support and acception you deserve as a human being. \n\nMany hugs. <3",
            "What the hell! I'm sorry to say your mother sounds like a terrible person. How dare she guilt trip you into owing her for giving you a place to stay while growing up? That's a basic level of care you must give a child when you decide to have one, without any expectation of your child owing you something for that. Regarding college tuition and rent, if she really expected you to pay her back for this she should have explicitly outlined this at the time. She is obviously extremely selfish with no consideration for your aspirations. She would rather you flounder at home, dedicating your time to nannying a family of ostensible layabouts and couldn't give a hoot about squashing your endeavours to make a successful life for yourself.\n\nI *completely* understand why you would be upset about this. I cut both my parents out of my life over a year ago for their selfish behaviour and, while the reality that they only gave a crap about me to a certain extent that suited them was difficult at first, I'm now at a stage where I do not miss them *at all* and reflect on how much worse I actually used to feel whenever I was around them. If your mother doesn't apologise for her outrageously embarrassing and petulant behaviour of her own accord and drop this whole situation, I would honestly consider cutting her out. Perhaps you could write a letter to the rest of your family clarifying the situation as your mother is obviously lying about what happened (again, something I also experienced). Maybe a Facebook message to your siblings could work better as there's no chance that way of your mother intercepting a letter (though you mention you weren't all that close to your siblings so maybe you don't feel the need to).\n\nSorry you have to go through this, OP. I hope you have close friends around you who are supporting you through this and I promise the sad feeling you have will go away with time. Ultimately, there isn't much point keeping people like this who will drain you in your life.",
            "Remove her from hour Facebook or just hide her posts for awhile. You don't need to see that shit. ",
            "Dude your mom sounds like a child. F that b.\n\nYou're grown. You put in the time. You should continue to invest your time into yourself and people who will care about you in kind.\n\nGet out of here with that guilt trip shit.",
            "You could also argue that your taking care of the house was your contribution to the family, so she's effectively asking for you to pay another by bringing money in the form of back-dated rent into it. She chose to have you; the costs associated with raising a child were her decision, not yours.",
            "What about your Dad? Where is he in this equation?",
            "Wow, your mum is BEYOND narcissistic.... she can't handle that you've become an adult, and you are living your own life, and it's sent her doolally. \n\nI just hope the rest of your family have more sense than your mum, and they realise she's just acting crazy.\n\nDocument it, it'll come back to bite her in the ass.",
            "I have news for you.  Your mother needs you more at 54 years old than you need her at 23 years old.  \n\nShe wants space?  Fine.  Give her space.  Time is on your side, not hers.  Eventually she's going to hit her 60's and need support.\n\nAnd as for reimbursing her for raising you?  Cut her an invoice for all the time you spent cleaning. ",
            "Your mom is a pretty awful person: I'm sorry OP.\n\nJust try to stay in contact with your sane family members and write off your relationship with mom. She's pretty much made the decision for you anyhow.",
            "yeah, it was never your responsibility as their child. the parents job is to raise a child so they can live on their own and one day maybe have their own family.\n\nyour mother is acting, in my opinion, extremely childish. Saying lies, provoking and trying to control you? What is this, high school? As a person for even considering moving back after your mother said that means you're a realy good person. Hopefully your mother will turn around and apologize, but she seems pretty selfish, self-centered and unaware of her responsibilities as a parent, who's supposed to give support, not expect to receive it from your child.\n\nI cannot fathom expecting my son to stay home as a grown ass adult at 23 to move back home so he can babysit. I'm 24 and I already have my own family.\n\nMaybe you should go back home and babysit her ;)",
            "OMG, she is being serious, dont let yourself down. you dont make anything wrong, move out from parent house is part of grown up. i think your mom need to grow up now too. she´s being like a 10 years old girl, trying to make you do what she wants. i know is sad but you have to be strong on this. talk with your siblings, tell them all the things she is doing to you, if you´re close they will undestand you. sorry for this, but your mom is being incredibly selfish and a total b****. one question, your other siblings are living with her? a big hug for you OP.",
            "It's emotional blackmail.\n\nDon't give in now or she'll know that it works.\n\nGood luck!",
            "Wow, I'm sorry OP! I hope you can find people who aren't total assholes to be your new family.",
            "Has your mother always put her interests ahead of any one else's, including you and your siblings?  Was their one sibling that got more attention than the rest?",
            "Honestly be done with your family.\n\nIt will save you time, money, and heart ache in the future.   Sounds like the whole family is toxic likely because of your mom.",
            "A. Why can't you be honest with your sisters and the rest of the family and tell them what is really going on? Stick up for yourself--don't let her pin you against everyone just because she says so.\n\nB. Since when do parents get refunded for bringing a child into the world? She is hilarious if she thinks that threatening that you owe money for having been raised into the world would ever hold up.\n\nSorry for your situation. Know that just because people are relatives doesn't mean you are obligated to have them in your life. Family is all about who sticks by you.",
            "I'm really sad to read this. I'm really sad that instead of appreciating all you've ever done without being constantly asked to do them, and acknowledging that it's time for you to start your adult life independent of your family, she's treating you like this. How is it YOUR fault or even responsibility that no one ever sat down the family to lay down some ground rules? To make up a chore schedule? What does your dad have to say about all this? Or your grandparents for that matter? Again, I'm sad for you that things took such a dramatic turn, and I hope your mom will see reason and apologise sometime soon. You're great and you don't deserve this. ",
            "I just cant believe how some parents can say to their child: You owe us money for giving you shelter, food and education.  \nThat is just straight up evil. Im not ranting on OP's mom (well maybe a little), just had to say this because its not the first time i've seen this kind of bullshit. ",
            "This is a shame. Of course you're not responsible for the other members of your family and you shouldn't feel otherwise. Everyone that is an adult is responsible for themselves. Is it nice to help out? Of course it is but that doesn't mean your life should be on hold while you do it. If it were me I would still try to have a relationship of some sorts with my mum and the rest of the family because the longer your time is spent without it the harder its going to be to get it back and reading what you have typed it seems like you do still want that. How you have that relationship I don't know. By the sounds of it your mum isn't normally like she has been of late and by the sounds of it a lot of that could be put down to stress. Less sleep, more work = a grumpy mum. Maybe she will have called down a bit after a while and things may get easier. Good luck.",
            "Your mom is a controlling person. Mine is the same way. Negativity in your life will harm you more than you know. \n\nIf you need a mother figure, there are a TON of us on here.\n\nWe care about you and your wellbeing ",
            "Your mom is a horrible person.  Be thankful that you go out of there when you did.  You know what happened and why it happened.  You are an adult and so is your mother. It is here responsibility to keep her own house clean. \n",
            "She's going to regret treating you so poorly, I'm sorry OP. Your mom truly does love you, but she seems to not have ever developed a manageable way of handling her emotions. This is a huge change for her, and she's frantically grasping at straws because she's drowning; but it's not your responsibility to help her, she needs to adjust. You're doing the right thing, she won't learn until forced to do it on her own. You didn't tell her to have more children, nor did you ask to be born, she chose to create this situation and it falls on her shoulders completely. This isn't your fault sweetheart. Stay strong! Hopefully she comes to her senses sooner rather than later.",
            "It's hard but continue staying away. It's a cycle of abuse and you need to break the cycle. And unfortunately they should you that they don't in fact love you or care for you. Know that this is not the norm. Once you readjust you'll find out that the world is full of people who want to and will genuinely love and care about you. Go find them instead of wasting your life going back to people who is only using you",
            "Mamas be crazy, seriously. I am one. There's just something about your kids that makes a screw go loose. Your mom seems very hurt that you'd reject her this way (but what you did was the right thing!!) and she's handling it with out any grace or wisdom whatsoever. I hope she comes around at some point. For the time being, you can keep in touch with your siblings and just be their cool big sister. Don't let them miss out on that because of your mom. ",
            "So there are seven other people in the house, three kids and four adults. Between them they should be able to learn to vacuum the floors, do the dishes, help with dinner and keep the rooms clean. \n\nIt's too bad that your mom is treating you like you're the ungrateful one. A lot of parents would be proud that their daughter graduated and is able to support herself. You're an adult now. She can't control you any more, so it's not surprising that she's so frustrated. Hang in there. Like others said, she might stop trying to hurt you once she realizes this kind of behavior doesn't work. \n\nThere is one thing that people haven't mentioned. In some cultures, people are expected to help their extended family for much longer. Not sure if that's something that applies here, but even if that's part of it, she still isn't treating you fairly.",
            "Tell her to take all the money you owe her out of your paycheck from all the work you did at home. Should break about even. Also ask how much she gets in rent from the other kids. I cut my family out for the most part as well and only really see them twice a year on holidays. I was just getting dragged down by them and enabling their issues. The best way in my opinion to deal with this is to just keep trucking. Improve your life become better and better without them in it. So no matter how much she tells herself she raised you well and blah blah, she'll know deep down you raised yourself, and are continuing to do so now. Your other siblings and their current selves are the better reflection of \"How she raised her kids.\"",
            "Wow. I wondered whether you were me for a few seconds. I have three younger siblings, -2 boys and 1 girl and I am 5-6 years older than my first sibling. I also clean and some help around the house.\nIt's so fascinating to see someone who also feels what I used to go through ( and still do).  ",
            "My mom was horribly abusive to me too when I lived with her. She once spent like 3 hours yelling at me when I told her I wanted to be on my own car insurance. She had this need to control me and my life choices under the guise of \"You do what you want, but I'll say I told you so when you fuck up.\" Then go on to call me stupid to my sisters. \n\nI haven't lived at home for a year and a half now. I can honestly say we have a good relationship now. I love my mom, but being away from her has almost stopped any guilt trip. Any guilt trip she tries now I just ignore or laugh off. \n\nI promise it will get better. Your mom might not change, but the distance from her will definitely change you for the better.",
            ">She instantly starting gulit tripping me -- how she had raised me, how family was everything, how I was being selfish and abandoning her\n\nYou never asked to be born. It hurts, but stay strong I'm certain she'll come to her senses. If anything she should be proud that she raised a better human being than herself. ",
            "I think it's time your mother starts growing up a bit. I'm sorry you have to go through this. I was in a similar situation with my family and it does get easier. Focus on building a strong network of friends. We don't get to choose our biological family but you can choose your friends. ",
            "You gotta unfriend her on facebook!",
            "Should have told her that all the cleaning and other housework you did was how you paid for your rent. Should also figure up how much a main makes and send her a bill for how much she owes you.",
            "I just read your original post, and I can't understand how she NEVER noticed you did everything at your house. Was she so distracted or not around that she didn't realize you were doing everything. Unless you did everything in the dead of the night then there she is totally lying that she \"just realized now\" how much you did. What bullshit. She just wants you and your free labor. If you talk to her again tell her that you can negotiate how much \"you owe her\" against how much she owes you for doing all that shit. Cost of cleaning and child care is extremely expensive and she did not compensate you for any of that. I'm so sorry you are going through this.",
            "Who cares. Most people know that she is a bitch-let them come to you without your mother around. \n\nMy mom kicked me out at one point then asked me back. I kindly said HELL NO and never looked back (well, years later I moved in for like 5 seconds but then realized what I had gotten myself into and moved out again).\n\n",
            "Please go to /r/aisedbynarcissistics/ and read.\n\nPlease read the website \"Out of the FOG\": meaning Fear, Obligation and Guilt. \n\nPlease Google \"Toxic Family Dynamics\" and read everything to understand your siblings reactions. Please remember your leaving is setting a VERY GOOD example to your siblings, they can escape the emotional abuse too.\n\nTo repeat what redrosebeetle said:\n\n*She's going through an extinction burst - stepping up the behaviors that have worked in the past in order to make you bend to her will. Stay strong.\n\nWhen you doubt yourself, just remember that your mother doesn't care about YOU, she cares about what you can do for her. If she remotely cared about you, she wouldn't be acting this way*",
            "Keep us posted on how you're doing.",
            "Little late to the party, but did you ever ask her to show you the canceled check from her repaying her own parents?  Stay strong.\n\n\nPlease check out r/raisedbynarcissists if it hasn't been mentioned yet on here.  I think you'll find a lot of interesting info.",
            "I'm sure your family would've noticed the difference \"huh, it was all so nice and clean when OP was here, but as soon as she's gone it's a disaster and mom is angry\". Just explain if they ask. I'm sure they'll understand. You may also want to warn them abou how your mother ACTUALLY is.\n\nShe may also be going through a bit of menopause/separation anxiety. My mom went semi off the deep end from when I (the oldest) left for school until my littlest sister moved out. That 6 year period she was nuts (actually. bi polar before but going through violent swings over that period). Then all of the sudden she was fine. ",
            "Sounds almost like an Asian family...",
            "She did you a favor.  She's disgusting.",
            "It sounds like there's something you're not telling us.",
            "Your mother doesn't hate you, and contrary to what everyone else is saying, I would tell you not to cut her off and brood in silence - family is everything, she is your mother at the end of the day.\n\nYou have to realise a lot of people on this sub-reddit in particular have a different family dynamic; you know, the type to only call their parents at Christmas.\n\nI think you should go to your mother and talk out - I think she's more hurt about the outright rejection you gave her. She probably wants to see you more. \n\n\n"
        ]
    },
    {
        "post_id": "507dgm",
        "author": "mykidisnotfat",
        "title": "UPDATE: My [32F] mom [72F] kept saying my kid was obese. The crazy ran even deeper than I thought.",
        "url": "https://www.reddit.com/r/relationships/comments/507dgm/update_my_32f_mom_72f_kept_saying_my_kid_was/",
        "score": 2369,
        "num_comments": 135,
        "created_utc": 1472505238.0,
        "selftext": "Hi Reddit. I'm back with an update. Here's the original post. https://redd.it/4zn8ly\n\nThanks for all the responses you gave me on my first post. I think I needed a dose of reality, and that's what I got. \n\nAfter reading all the comments I realized I needed to talk to my mom. So when she came over, before she had a chance to say anything about Leah's eating habits, I took her aside and said \"enough. Leah is healthy and happy, and your weight comments are inappropriate. They stress me out and they're bad for Leah. If you keep making them, we're just not going to see you anymore.\" She sputtered a bit, but ultimately agreed to my terms. I was hopeful that maybe she would actually stop making the comments so we could have a somewhat normal relationship and she could continue to see Leah.\n\nHahaha.\n\nI work a part-time schedule of two days per week and every other weekend. This was my working weekend, so my husband was home with Leah. When I got home after work on Sunday, I could tell something was up. Leah was already in bed, and my husband looked really tense. He's usually a pretty laid back guy, so this was weird. \n\nWhen I asked what was up, he said we needed to talk about my mother. I had told him that I had spoken with her and that she had been warned not to make any more comments about Leah's weight. Well, apparently she just couldn't do it, because she called him (knowing I was at work) that day and told him that I was blind to Leah's problem and that he needed to get involved because I had confided in her that Leah's pediatrician told me she was at serious risk of obesity and Type 2 diabetes and that we needed to change her diet so she would lose weight.\n\nWhat?!?\n\nFor the record, Leah's pediatrician has never said anything like that. In fact, as I mentioned in my last post, he has told me that she is underweight. Fortunately, my husband a) attends all Leah's doctor appointments and b) has the sense to realize that a rail-thin child isn't edging toward obesity, so he knew it was bunk. He told my mom that she wasn't to call again until she heard from me.\n\nWell, I was livid. It was like after years and years of weight-related crap from my mom something finally snapped. I called her and the minute she said \"hello\" I just lit into her. I told her that based on her behavior she was either delusional or a manipulative sociopath, and that either way she wasn't allowed around me or my kid again. I told her she was not welcome to call, e-mail, come over or send cards. Basically, we were going to pretend like she didn't exist. I hung up before she had a chance to get a word in edgewise.\n\nShe called fifteen times that night. I finally blocked her number on my cell and my husband's (we don't have a landline so this means she can't call us at all). I had three emails in my inbox the next morning, which I deleted without reading before blocking her email address as well. Finally, we had given her a key to our house for emergency purposes so first thing yesterday I had the locks changed then took Leah out for the day. Lo and behold, when we came home my neighbor said that my mom (she recognizes her because she used to come over a lot) had been banging on the door for almost half an hour earlier that day before storming off in a huff. I can only imagine how angry she was when she realized her key didn't work anymore.\n\nI feel better than I have in years, which makes me think I did the right thing. The only thing I'm still struggling with is how to break the news to Leah. She really does love grandma. My husband and I are going to sit down with her tonight, so I guess I have until then to figure out what to say.\n  ---   \n  **tl;dr**: Confronted mom, who was even crazier than I expected.",
        "permalink": "/r/relationships/comments/507dgm/update_my_32f_mom_72f_kept_saying_my_kid_was/",
        "comments": [
            "Wow, that's bonkers. I don't know how I'd break it to my child. I'm glad you cut her out. Also, let Leah's school know that grandma is NOT allowed to contact her and that you've cut contact. I could see her trying to get to Leah that way. Good job protecting your daughter from her crazy grandmother. ",
            "You absolutely did the right thing. Your mom abused you and she was abusing Leah. Thank you SO MUCH for protecting your daughter. Your mom is likely to escalate, so it's important that you talk to her school and any other caregivers, to make clear that she is not allowed to have contact with your daughter.\n\nYour daughter, at 5, is old enough to understand the concept of a time out. So you might tell her that grandma behaved badly and is in time out right now. You could also tell her that grandma is sick, the kind of sick that changes how people act, and so she cannot be around Leah until she gets well and acts nice again. But it might be a long time before Leah asks about your mom again; kids can be very \"out of sight, out of mind\" and they also pick up on tension and being picked on.\n\nWhen I was a kid, my mom constantly harassed me about my weight, much like your mom did. My mom didn't teach me healthy eating habits (she mostly fed me junk, and rewarded good behavior with sweets) but she constantly harassed me about being \"fat\" and \"out of shape\". As a result I spent my childhood and young adulthood convinced that I was fat, when I really wasn't fat at all. As a young woman I had a 24\" waist, weighed 115 pounds, but I thought I was fat and gross! My mom really warped my sense of what a normal body should look like, and of what *I* looked like, because of her constant harassment and weight-related abuse. \n\nLike your mom, my mom even lied to try to lend authority to her abuse. She told me that my dance teacher had taken her aside and said that I was getting \"too heavy\" and needed to lose some weight. I felt so, so awful about that, and it turned out that my dance teacher had said no such thing.\n\nMy mother kept harping on my weight and size until I was in my early 20s, at which point I told her \"I am not interested in your opinion on my weight or any aspect of my appearance. I did not ask for your input, so shut the fuck up.\" That felt really good :) \n\nMy endocrinologist told me that young people, especially women, who are abused this way are actually *more* likely to become obese as adults than are women who are allowed to just grow and be kids. He said that this kind of abuse makes women unable to make good food choices (because every choice involves anxiety) and it also makes them likely to eat too little, and then binge when their blood sugar gets low. This see-saw of blood sugar eventually causes insulin resistance, and *that* leads to obesity. Then obesity makes people *more* insulin-resistant- at that point it's a self-perpetuating cycle that becomes hard to break out of. So, your mom's abuse may have had long-term consequences for you, and you saved your daughter from that same fate.\n",
            "She will probably get even worse, so prepare yourself. You need to start documenting all these contact attempts for when you need to get a restraining order. \n\nYou did the right thing, for Leah, and for you. I'm so glad you and your husband are protecting your daughter from your mother. Please take care of yourself - you were your mother's victim too. ",
            "Contact Leah's school as well and notify them that she is NOT to be released to her grandmother!! best of luck to you",
            "Don't delete future emails. Document every single one.",
            "[deleted]",
            "Please make sure to let your daughter's school know (including giving them a photo of her) that your mum is not to be allowed anywhere near your daughter and is not allowed to take her with her under any circumstances. If trying to get into your house was her first first line of offence after realising that she couldn't contact you, then getting to your daughter in school might well be the second.",
            "Well done!  Especially good catch wrt changing the locks.",
            "\"Grandma refuses to respect our boundaries so we're not spending time with her anymore, because people who don't respect boundaries are unsafe.\"",
            "When she can't get to you through her usual channels and a lawn tantrum doesn't work, prepare yourself for the health scare. She'll either end up at the emergency room with \"heart issues\" because she's so stressed by the situation and how you're treating her or she will turn some kind of routine health test into a cancer scare. It's generally the next move in the repertoire of people like your mom.",
            "GO MAMA BEAR GO!!!!! You just saved your child from abuse. So so glad to see this update. When no contact is a relief you know you did the right thing!!",
            "Scorched earth policy!!! Well done!!! You should be proud of yourself, it can take most people years of escalating events to cut someone off. Be prepared though, your mom isn't done. Not by a long shot. But based on your actions you are well prepared to hold your ground. Document everything. ",
            "First off great for you,  as dinnertime who had gone no contact with well meaning but ultimately abusive parents this is one of the best things you could have done for yourself. \n\nAs for breaking the news to your daughter.  I would suggest not telling her exactly why.  Maybe say something along the lines of \"grandma has done some bad things and really hurt mom and dad and we feel that right now she needs time away to realize that\". I say this because you don't want to put this on her.  You don't want your daughter, who loves her grandma, to feel like she is responsible for making her go away.  At the same time by laying her know that grandma had hurt you,  you give her the opportunity to commiserate with you. She might see that mom and dad are hurt and be able to let you know that she also may have felt that way.  \n\nI would be careful because your mom does sound crazy and she might reach our to cps to try something.  Maybe get a note from your doctor as to your child's health and start documenting your interactions with your mother.\n\nAnyways good luck with everything and good for you for putting your foot down.  ",
            "Be prepared for a CPS visit when your loony mother calls them with a tip about child abuse.",
            "If this is not typical behavior I suggest you consider Alzheimer's or the beginnings of dementia.  Point is at 72 these things can start happening.  ",
            "Has she pulled something like this before? Like is her believing your daughter is obese just the newest thing she is obsessing/being crazy about? Or is this behavior new? Im honestly a little concerned something could be wrong with your mom if she doesn't have a history of being delusional and went off the deep end so suddenly.",
            "Make sure your daughter's school knows she's not allowed to see or take your daughter anywhere.  That only you or your husband will pick her up for things like doctors appointments.  Same goes for any places or friend's parents your daughter might be hanging out with.  Grandmother is persona non grata unless specifically told otherwise.\n\nHopefully she won't go full batshit crazy, but you never know\n",
            "In my mother's side of the family many have the habit of commenting about other people's weight.   In a rude way usually.    I once had my obese aunt telling me how I looked fat and not healthy.    At a family reunion.    I told her that I admired her and was struggling to be just like her.    Biatch hasn't spoken to me since. ",
            "r/raisedbynarcisists ",
            "Honestly, this situation is just all around sad. As much as it is a good thing to get Leah and yourself away from the stress of your mother's comments, I hope that she realises the negative effects of her behaviour and you are able to reconcile with her some day.",
            "That escalated quickly. I hope your mom lets go soon. She needs to breathe and eat a cookie ",
            "OP you did the right thing.\n\nI was a short, skinny kid. But people's obsession with my size gave me huge issues. When I was eight I became bulimic. I was plagued with EDs until I was 19 and recovering from dropping to 95lbs and becoming suicidal. Kid's pick this stuff up from young age. You're doing the right thing protecting your daughter. ",
            "My mom harassed me about it too when I was a kid.  I already prepared myself for when/if I have a kid.  ",
            "Wowwww, it's unfortunate that you had to deal with it. That said, you're making the healthy choice for your daughter and yourself. Way to go! Stay strong, she's likely to escalate.",
            "Good god. I'm so sorry you have to deal with this shit, OP. But man, you really did a fantastic job. I'm so glad you really stood up to your mom. I've suffered with ED & stuff like this makes me sick with worry. She had to be stopped.\n\nMaybe one day in the not-near future, you can talk to her again & tell her if she seeks out help, she can possibly gain back supervised visits with your daughter. Or not! Sorry, I've never dealt with anything like this. But I'm really proud of you. <3",
            "Well done for cutting her out before she had a chance to damage Leah's self-perception. You made a really good call and though telling her will be hard, trying to battle your mum's convoluted messages later on would be infinitely worse. As you know. Take care!",
            "Holy crap!  Good on you for protecting your daughter, OP.",
            "Beware a Grandparents Rights threat. Check your state (if your are in the US) to see of she has any hope of visitation. I can only imagine she thinks you are over feeding your child and in her delusion she would be better able to control your daughters eating habits. At all costs you have to stop her ever having a chance to do this. I could see her not feeding your child at all. She is nuts.",
            "/r/raisedbynarcissists/ can help you.",
            "Make sure your house is CPS ready- stocked with food and clean.  I would also make sure that you are very careful when you are out and about with your daughter.   In the long run, this is a good thing for your daughter.  She doesn't need granny in her ear telling her she's fat- that's what leads to eating disorders.  I would also think about getting a camera installed, so that when she comes and acts a fool, you have her on video to document, so when you have to go for a restraining order, you have proof she's acting crazy.",
            "Good job! My grandmother has been obsessed with my sisters weight since she was a little chubby as a preteen. She harassed my sisters eating habits and made her feel worthless. She told her that any man she ever dated couldn't really love her because \"look at her\" (in my eyes my sister is beautiful big or skinny). My sister ended up becoming morbidly obese for several years due to stress eating and binging. When she was about 23, she decided to start a diet and exercise regimen. We all encouraged her, went on walks with her, ate her home cooked meals, cooked with her, but grandma still pointed out every flaw. My sister became anorexic and made herself throw up. To this day, my sister struggles with her eating disorder and body dysmorphia. She is now a healthy weight, sees a psychiatrist regularly, and exercises about three hours a week. My grandmother continues to make comments like \"wow your face has really filled out this month\" or \"it looks like you've gained some weight\" to this 5'4 130 lb former anorexic. It kills us. My mom tried so hard to focus on healthy eating and never mention weight when we were kids, but because my grandma was such a huge influence in my sister's life, it didn't matter.\n\nOne thing I am thankful for is that when my sister had her daughter (now 5) she vowed to never talk about losing weight and only speak of being healthy. It is really what pushed her to see a psychiatrist regularly because she never wants her little girl to go through what she goes through on a daily basis.",
            "This is an awesome update. That kind of insanity is NOT something you need in your life.",
            "Bravo to you!! As someone who has had lifelong issues with food because of awful parenting, I thank you on behalf of your daughter for cutting that nastiness off. Not sure what her motivation is, but your mother is delusional. You and your husband are handling this perfectly. Tell your daughter grandmother is ill. It's true. She has a highly contagious and destructive disease. \n\nAnd, btw, if you haven't already, check out /r/justnomil for support. Great bunch of people there who will listen and give great advice. ",
            "Good for you, keep the NC going. Have you checked out /r/raisedbynarcissists? This woman sounds so manipulative and my narc senses are tingling.",
            "r/justnomil might be a good place to get advice for how to handle the situation with your daughter, this kind of stuff is right at home there. ",
            "Oh man, this is hitting home.   I love my mother to pieces, but my weight - and now my daughters' weight - is something she obsesses over.    My girls are both knockouts, but one is much more slender than the other, and Mum is always making these snide little comments.   So far I pretend I don't hear her, but if she ever says anything within my girls' hearing, it won't be pretty.",
            "So proud of you, OP. I know this was hard but good on you for protecting your kid. I'm sorry but she will likely never change.",
            "It's good to put your foot down!  Sometimes people forget how irrational their own parents are, so when they have their own children,  they allow the crazy relatives to also affect their kids too!\nIf you absolutely need to discuss this with your daughter,  and I didn't catch her age, I'd simply say \"I know that we both love Grandma very much,  but Grandma and your father and I just had a disagreement.  Although you may not understand right now why we aren't talking to her as much as we were, one day we can visit grandma again,  just not for a little while.\" If she wants an explanation,  I'd use this chance as a lesson in having good self esteem,  and avoid bad mouthing Grandma - crazy people usually can't be blamed for their crazy...",
            "Good for you. Protect her from that nut. ",
            "You did well. You couldn't leave your child with such a psycho, even supervised.",
            "Don't delete emails - they can be used to get a ppo against her if things escalate. Just don't read them.",
            "I didn't see your last post,  I agree with what you did here.  Also,  if you do contact your mother again,  I think it's best she see someone.  Her mental health doesn't seem to be in the right place.  ",
            "Good for you protecting your daughter.  Remember when talking to your daughter she doesn't understand alll that has gone on.  Just keep simple \"Grandma is in grown up time out right now, she disobeyed mommy & daddy.  We won't get to see her until she is done with time out.\"",
            "Good for you! I'm happy to hear that you committed 100% to your ultimatum and didn't waffle, because I'm sure that is what she was banking on. It's always good to hear that someone is cutting negativity out of their life =]",
            "Tell Leah her grandma is in time-out for bad behaviour.",
            "You need r/justnomil. If you need support and help maintaining no contact, they can help! Make sure the school knows, and also make sure that all the doctors know as well that your mom is not authorized to receive any medical information nor to call and ask about things. \n\nAlso also make sure any coaches, neighbors, pastors, and so on know the deal as well. \n\nBest of luck! ",
            "You're making a strong stand and I hope it works out! \n\nIt's probably obvious but be careful not to let Leah think that this in any way is because of her (or you). \"Grandma is on a really long holiday\" is better than \"Grandma thinks you're unhealthy so she can't come round any more\" (Leahs fault - guilt) or \"Grandma and mummy had a fight\" (your fault - resentment). \n\n\n\n",
            "[If] you ever consider letting her back into your lives set up a visit with your pediatrician  (without daughter in attendance) to take her to talk to and also ask if (s)he can refer you and your mom to a nutritionist who can corroborate their advice.\n\nAlso family therapy for the three of you, find a therapist who's versed in eating disorders.  Those should be absolute terms, no ifs, ands, or butts, for possible reconciliation.\n\nIn her eyes, or what she will claim at least, is that she's only concerned and worried and wants the best for daughter (I'd almost want to hear back from you when she uses these exact words because I'd bet my whole pay check on you hearing this exact excuse).  All well and fine that she cares but she's misguided and disrespectful in her execution and this should be addressed and remedied if she truly does come from a concerned point of view.",
            "Oh man, that is some proper nutnut crazy behaviour from your mom there, I'm so sorry!\n\nI think telling your daughter a relatable and age appropriate version of the truth is probably the best way to address this. I think that kids are capable of understanding a lot of things and, while they don't have the experience and the emotional skills of an adult, they're still able to process and consider things.\n\nI also feel like lying to kids sets them up for anger and recriminations later on. Trust is important.\n\nI think maybe you could sit her down and explain that it's a shame, but grandma won't be coming over anymore and we won't be going to visit. Because while we love grandma, she'd been saying some very unkind things and she'd been making up unkind stories and, sadly, wasn't listening to mom and dad when they asked her to stop. Even though they'd asked her a lot she just wouldn't try and wouldn't talk about it. So until grandma can learn to behave better and be kinder and more truthful, she's not allowed to come over anymore.\n\nI think it delivers the message that you're not taking revenge and you're not being spiteful, but that you as a family have rules and grandma was refusing to follow the rules so she doesn't get to spend time with the family. It also means that your daughter can see that nobody is excluded from the family for no reason, and that she herself doesn't need to worry about being excluded, or about other people vanishing from her life. I feel like it also tells her that it's ok for you, and for her, to set boundaries when necessary and that's a useful thing to see in action.\n\nI think she'll probably be upset, but this kind of approach lets her ask questions and come back to it in her own time.\n\n(I say these things as a person who grew up in a home where people just vanished out of our lives (neighbors died, family members stopped talking to us) and I was never allowed to ask why or what had happened. It was very upsetting because A) children are self-centered and naturally wonder if it was something *they* did, especially when the adults seem to be angry about something and B) it taught me that when there is conflict, you just immediately dump the person out of your life and never talk about it ever again, which I'm still un-learning in my mid 30s)",
            "Oh man, that is some proper nutnut crazy behaviour from your mom there, I'm so sorry!\n\nI think telling your daughter a relatable and age appropriate version of the truth is probably the best way to address this. I think that kids are capable of understanding a lot of things and, while they don't have the experience and the emotional skills of an adult, they're still able to process and consider things.\n\nI also feel like lying to kids sets them up for anger and recriminations later on. Trust is important.\n\nI think maybe you could sit her down and explain that it's a shame, but grandma won't be coming over anymore and we won't be going to visit. Because while we love grandma, she'd been saying some very unkind things and she'd been making up unkind stories and, sadly, wasn't listening to mom and dad when they asked her to stop. Even though they'd asked her a lot she just wouldn't try and wouldn't talk about it. So until grandma can learn to behave better and be kinder and more truthful, she's not allowed to come over anymore.\n\nI think it delivers the message that you're not taking revenge and you're not being spiteful, but that you as a family have rules and grandma was refusing to follow the rules so she doesn't get to spend time with the family. It also means that your daughter can see that nobody is excluded from the family for no reason, and that she herself doesn't need to worry about being excluded, or about other people vanishing from her life. I feel like it also tells her that it's ok for you, and for her, to set boundaries when necessary and that's a useful thing to see in action.\n\nI think she'll probably be upset, but this kind of approach lets her ask questions and come back to it in her own time.\n\n(I say these things as a person who grew up in a home where people just vanished out of our lives (neighbors died, family members stopped talking to us) and I was never allowed to ask why or what had happened. It was very upsetting because A) children are self-centered and naturally wonder if it was something *they* did, especially when the adults seem to be angry about something and B) it taught me that when there is conflict, you just immediately dump the person out of your life and never talk about it ever again, which I'm still un-learning in my mid 30s)",
            ">I feel better than I have in years, which makes me think I did the right thing.\n\nRock on! ",
            "Good for you! My grandmother was obsessed with my weight throughout my teenage years and it really messed me up. I wish my parents would have intervened and protected me from her nuttiness. She still (at 85) is trying to get me on the same crash diets as she is on. ",
            "I wouldn't worry too much about your daughter's reaction. Your mum could be my grandma's twin sister - my mum developed an eating disorder because of her. I could always sense that she thought I wasn't up to her standards, even at your daughter's age - I was just too polite to articulate it to anyone (because little girls are meant to love their grandmas, right?)",
            "Good. Stay away from the toxic crazy lady. Protect yourself and your kid. ",
            "If you want a place where you can vent and get some good advice, try /r/JustnoMIL ",
            "Could this be Alzheimer's related? Just a thought.\n\nYou are doing a good job protecting yourself and your daughter from the nutcase.  You should be proud of yourself. \n\nYou are an excellent Mom!  \n\nYou take care and I wish you and your family all the best!\n\n\n*Nana internet hug* ",
            "Ok, here's the thing.  I'm wondering if she might deserve one final chance now that she knows that you are serious.  This is Reddit and people like to sever relationships fairly quickly, but think it through because she is your Mom and Leah's Grandmother.  Let this sink in over the next two weeks so that she calms down and realizes that her crazy actions have real, severe consequences.  Go to visit her and talk to her.  Don't give her your new number for you and your husband, don't give her a key.  I think occasional supervised visits with your Mom and Leah (with you present) are perfectly ok.  If she starts acting up, respond accordingly by taking Leah away.  You basically need to be the buffer between positive Grandma/Leah time and negative Grandma/Leah time.  I wouldn't ever leave them alone together, but I think that it sounds like there is still a lot of love there.",
            "Typical boomer generation, lie to you have and then blame you for any problems..."
        ]
    },
    {
        "post_id": "caj12k",
        "author": "Yes_I_Would_Kent",
        "title": "UPDATE - Fred didn't turn up to the stag do, today I will uninvite him to the wedding.",
        "url": "https://www.reddit.com/r/relationships/comments/caj12k/update_fred_didnt_turn_up_to_the_stag_do_today_i/",
        "score": 2371,
        "num_comments": 170,
        "created_utc": 1562579404.0,
        "selftext": "Original Post - https://www.reddit.com/r/relationships/comments/buei18/i_25m_asked_a_friend_29m_to_my_stag_do_wedding/\n\nMy original post got a handful of really helpful comments & wanted to start by thanking each of them for taking the time to help me realise the problem & how to make the best of the situation.\n\nSo I returned from my stag do yesterday. Absolutely quality weekend with great company, voice has gone a little & had the odd tipple. Wouldn't have changed anything about it, exactly what I was hoping for.\n\nSince the last post, I got a call from Fred last week while I was at work. At a time of day that is inconvenient for almost everyone with a 9-5 job, so I couldn't answer.\n\nI sent him a text message that evening, I decided to strip away anything that didn't get to the point: \"Hey dude, what's up?\", taking elements of the grey rock method which I've since learnt about. He replied two days later saying that he just wanted a catch up, I simply said I was looking forward to catching up on the stag do. I sent him a happy birthday message in the week, no response. That was it until the weekend.\n\nWhat I didn't know until we were on the stag do was he had been messaging my best man separately, and within the space of the week before had told him the following:\n\n- He wouldn't be able to arrive on the Friday, but would join on Saturday. (He ended up going out on Friday evening for birthday drinks with his partner & posted a picture onto Instagram)\n- He wouldn't be able to make the Saturday morning activity, but would join in the afternoon.\n- He wouldn't be able to make the Saturday afternoon activity, but would be around in the evening.\n\nFred had only been messaging because some of the activities required deposits & my best man had been chasing him. I'm told he hadn't contributed any ideas or messages into the group while it was being planned.\n\nSaturday rolled around & I finally got a message from Fred saying he won't be coming. He said a family member had an operation in the week & had returned home yesterday.\n\nFirstly, I wish that family member a speedy recovery. To me, it doesn't matter the reasoning but more the fact that Fred waited until the last possible moment before once again letting me down. This has now happened dozens of times where Fred cancels, delays or says yes until the day & then ghosts us until we are all travelling home, this is far from the first time.\n\nCoupled with his Instagram picture the night before, which was presumably taken the day his family member got home, I've decided to uninvite him from the wedding, and will respond to his message today. \n\nIf Fred had messaged me last week saying he may not be able to come because reasons, I may have given him the benefit of the doubt. Waiting until the day to drop the news is normal for him.\n\nThe main reason alongside a poor communicator being I don't know this person anymore. He doesn't show any interest in keeping this friendship going and I am sure that if I dropped the rope we'd go to zero contact instantly. I've seen Fred once in 3 years & I was hoping inviting him to the stag do would kick him into gear, he's had 10 months to back out or tell me he may not have been able to. He was a big part of my enjoyment during university & I wanted to give him that chance.\n\nI already expected the stag do & wedding to be the last time I saw Fred as I was putting too much effort into the relationship for zero reward. It is such a shame that it happened how it did.\n\nI had the best group of guys with me all weekend & we had a blast the entire time, and am really looking forward to the wedding where I can get my family & friends together to celebrate with my  future wife & I. \n\nNo more negativity or stress over a friendship that finished a long time ago.\n\nTl;dr - Friend decided to let me know at the last moment he wouldn't be turning up, after dozens of similar instances I've decided to uninvite him from the wedding.",
        "permalink": "/r/relationships/comments/caj12k/update_fred_didnt_turn_up_to_the_stag_do_today_i/",
        "comments": [
            "This happened to my best friend by one of her bridesmaids (one of three very close friends acting as bridesmaids too so had a larger impact than one of like ten). She claimed she’d love to be a bridesmaid but then took zero interest in helping the bride or even checking in to see how plans were going, didn’t attend the hen do (cancelled literally a week before and asked for her money back after I’d booked and paid for everything, also claimed it was too anxiety inducing but went to a different event with different friends the same day), then cancelled being a bridesmaid (4 weeks before the wedding after her dress had been bought etc). We’d all been friends for over a decade but she had depression and anxiety for years that she’d not done much to treat, and she kind of just expected us to accept when she bailed/couldn’t keep commitments. Which is manageable if you didn’t rely on her/didn’t expect anything from her friendship but not acceptable when she’d accepted being part of a wedding party. I think you’re also more forgiving of things like that when you’re 17 but by late 20s... not so much.\n\nAfter she cancelled on the hen do and asked me for the money back from the hen do, I said no as didn’t want to be out of pocket and she text me asking if there was a problem because she was ‘so fucking upset’ about the situation. I was really honest and said the way she’d treated the bride made me reassess the way she’d treat me when I needed her, and that it was disappointing she was cancelling so late and had chosen to spend time with other friends over her oldest friend’s hen do. She took that to mean I hated her and that I judged her for being mentally ill, swore at me and that was it - 4 text messages ended a 13-year friendship. She has now cut off the bride and groom too.\n\nShe needed a lot of emotional energy, patience and support but couldn’t give it to others. What was really telling to me was that there was zero empathy for the bride or like ‘I’m so sorry I can’t make it, I feel awful for bride but I just can’t face it, I’ll do something else nice for her that I can manage’, it was just ‘I’M so upset about this situation’. Also got her boyfriend to ring bride to cancel being a bridesmaid, she was ‘too upset’ to have that conversation herself.\n\nShe thinks I hate her but I don’t - I’m just honest with friends and she outright asked me if there was a ‘problem’ (and I’d hope they are with me too) and she couldn’t acknowledge her own behaviour, and instead jumped to me ‘hating her’ and ‘thinking she’s a bitch’. And then cut everyone off.\n\nSo yeah idk, it sucks but honestly man it’s not a loss to lose someone who doesn’t want to/can’t give you time or care about things important to you. They aren’t really a friend to begin with.",
            "Been in this situation before. Honestly dude Fred doesn't give a shit about you, he has no sympathy or empathy for you and your other friends. You have been far beyond patient and reasonable with him. I cut my \"friend\" out of my life lonnnnnng before it got to this stage that you did with Fred. It sucks that someone you consider a friend is being so shitty towards you but you deserve better than this.",
            "TIL in the UK they call a bachelor party \"stag do\" and the bachelorette party the \"hen do\"\n\n&#x200B;\n\nOP - Best of luck on the wedding mate! Don't sweat Fred. He's not a real friend and he will eb a long distant memory once you start making new great memories with your soon to be bride.",
            "I read your last post and think you're doing the right thing dropping this friendship.\n\n&#x200B;\n\nHonest question, though: why bother uninviting him? He probably won't go to the wedding anyway. You've already spent so much energy on this guy. Is this for \"closure\"? Do you have a specific way you hope this will go? Because I don't think you will get anything out of a confrontation from him either. He won't see he was being a bad friend to you. He probably won't give you the reaction you are hoping for. If you think it will be cathartic to text him \"Don't come to my wedding\" and block him, so be it. But I wouldn't recommend pouring yourself onto a \"break up\" message to him because it does exactly what you said you don't want to do, which is to prolong stress and negativity.\n\n&#x200B;\n\nAnyway, I wish you luck with whatever you decide to do. And congrats, I hope your day goes great!",
            "Fred clearly has something going on, and despite your efforts to be inclusive, he has opted to keep you out of the loop. Maybe he has crippling depression, maybe he is on drugs, maybe his wife is insanely jealous and has him just beaten down, maybe he has some kind of history with your fiancee and hates her,maybe he has social anxiety, maybe he found religion, who knows, at the end of the day, he hasnt included you, nor reached out to you, nor followed through on any commitments he has made. He hasnt even taken the time to go to a stag party, which is universally understood to be a big deal, the kind of thing that reminds you why old friends are old friends. It is disappointing, it leaves unanswered questions, but, people fade in and out of your life, and honestly, you never know who is going to stick around, and who wont. There are people I have known for 30+ years that were initially very periphery, but somehow ended up being where I was year after year, and others who were like brothers to me, real honest deep friends who went through a lot with me, that have faded out of view, occasionally due to bad blood, but usually just circumstance and time and luck.\n\nSorry Fred seems to have bailed, if it is important to you, you could send him an email saying that you are sorry he cant seem to make any of the commitments he makes, and that you dont know what is going on, but that you would prefer a no, to being blown off. If you are so inclined, offer to be there if he is in trouble and needs someone to talk to, or if you are just too emotionally caught up in getting married at the moment, dont. You arent going to believe me, but you are getting married and your whole life is about to change. Society treats a married man different than a 25 year old single guy, your friends will change, your lifestyle will change. I wouldnt spend too much more time on Fred. If you need to cut him loose do it, otherwise, you know he isnt coming, but he might send a gift.\n\nBest wishes to you and your Bride to be!",
            "I think Fred might be dealing with something like depression or anxiety. That’s what it was for me when I was at my flakiest. It’s not an excuse; he should decline your invitations and avoid making promises about social things. But it does mean it’s not personal. Whatever he’s going through isn’t about you. His actions are disrespectful and hurtful, but it’s likely he values your friendship as much as he can right now. That doesn’t mean you shouldn’t drop the friendship. It just means you shouldn’t feel bad about yourself because of his actions.",
            "Yeah Fred hasn't been your friend for years tbh. Anyone who would treat someone this badly is trash. And surely it would have been so much easier to just say he couldn't make the stag rather than all these stupid games.\n\n&#x200B;\n\nHis behaviour makes no sense and I can only guess (i) you aren't the same importance to him as he is to you, which means you are the friend he cancels if something else comes up (including tying his shoes apparently) (ii) its something to do with his girlfriend, controlling etc perhaps or (iii) he's mentally unwell and doesn't see bailing last minute as anything other than a manifestation of that (which should be fine, right, he can't help it /s).\n\n&#x200B;\n\nNot sure it really matters, even if both the last two were true, there's no need for you to keep putting your feelings last to accomodate him. Enjoy your wedding, bye Fred!\n\nps I'd also tell him why he's uninvited, I can't quite tell if you ever articulated how much all of this was upsetting/annoying you. Now's as good a time as any!",
            "I'm glad everything else went so well.\nUnfortunately there are people who choose to end their social lives as soon as they're partnered up. Having friends was just a means to distract thenselves from the loneliness of being single. Now he doesn't need that anymore.\nI hope you can appreciate the good times you guys had but you're very right to cut this guy off. He WANTS dumped, he just doesn't have the balls to be direct about it.",
            "Is he perhaps depressed? Some people go no show or make 100s of execuses when they fall into a rut of depression but they don't admit it even to themselves. They only do the necessary social events and even so don't use his social media photos as a yardstick for his happiness. \n\nThen again maybe he is just an ass. I just thought to put it out there because I went through a phase like that without realising it. I couldn't say no because I didn't want to hurt anyone's feelings even though I really I didn't want to go. So you leave it for the last minute and come up with a lame excuse when it's too late for anyone to try convince you. \n\nAll the best to you and your wife to be OP.",
            "Sometimes friends out grow each other and they don't really need to meet that much anymore .  I have a ex coworker who always whenever we meet up randomly, says hey contact me again and let's do something.  I did tell him that's fine contact me, but then he throws it back on me and says, oh why don't you contact me about it? and of course I just ignore it because the last time we plan to do something he backed out on the day of, and seeing him make no effort to be the one to contact me after being the one who suggested to get together , shows me that he would just do the same thing again \n\nlike you said it's okay to interact and communicate as long as we don't have any expectations and as far as Mike ex-coworker and I,  I have no expectations for him.  Seems like your friend is this way too.",
            "I read both your posts, it doesn’t seem clear whether you’ve actually confronted him about being so flaky...? Have you ever don’t that?",
            "Read the original and what Fred has done is not far off how I have behaved these last few years. I appreciate the experience from the other side. Thanks for sharing man. I really need to get my shit together.",
            "I had a friend like this. We worked together for years and always texted each other when we weren’t at work. I’d always invite her to things outside of work  and she just never showed. Didn’t matter what it was, even low key stuff with only a couple people she would bail after saying she would be there. I wouldn’t even have invited her to my wedding but she was so excited to come! So I did. She said she bought a dress and I even saw on my registry she bought a gift for us. To be honest, As soon as I saw that I added another one of those gifts to the registry hoping someone else would buy it for us. \n\nYea, she didn’t show.... I never heard from her again. I sometimes wonder what she did with the gift she bought us... I guess just kept it for herself?\n\nLong story short... people are like this and no matter what you can’t change them. You did the right thing.",
            "From reading your previous post I gather a couple things.\nEither he's really inconsiderate, and bad at communicating, or he has major depression and anxiety issues.\nIn the last couple years I developed major depression, but my life couldn't come to a hault. I still needed to work, make money and live, but it's exhausting and I didn't often have the energy to reach out or get back to people (which gave me even more anxiety and made me feel like a shitty person)\nOne thing to note is that even though you may see someone smiling or posting a picture doing something fun, doesn't mean they aren't depressed or don't go home and cry themselves to sleep. Just something to think about.\n\nThat being said, his mental health, or whatever the problem may be, isn't YOUR problem. You already tried your best, so time to let the friendship run its course and die out. I definitely think you should let him know how much you've disappointed him though, and bring up his pattern of procrastination and ghosting. Just because you have problems or are busy isn't a free get out of jail card for treating people poorly and not having to deal with your own flaws",
            "Your \"friend\" might might be having money problems which may be triggering anxiety. \n\nAll the meetups and events you posted in both your posts involve spending money. Sometimes even just going out for a drink can be costly to someone struggling with money. \n\nSometimes someone might look good on paper or social media but behind that is someone in a financial mess. \n\nYou didn't do anything wrong. But your friend isn't telling you the whole story. It could be shame, it could be a control thing from his partner, it could be he is really bad with money and makes plans but when it comes down to it he's broke and makes up an excuse to blow you off instead of telling the truth. \n\nIf he doesn't want to tell you what is going on then there is not much you can do. \n\nHave a great wedding with the people who love and support you!",
            "I recently had to say no to a bachelorette party for a wedding I was a bridesmaid in. I was about 9 weeks pregnant at the time and puking multiple times a day, not really able to eat much, and exhausted. I explained this to the bride and she was completely understanding. \n\nIf you need to not attend something, have a good reason and just say you can’t come. There’s nothing I hate more than people who string you a long with a series of maybes.",
            "Awww dude!!! One of my husband's groomsmen bailed via text during the rehearsal dinner the night before bc his \"father in law was in town and couldn't get away\"... Boy, did he get a justified earful!!\n\nScrolling down the comments, I don't really understand the people defending Fred - yeah, there might be something going on like depression, but that's not an excuse to be an asshole... They might think you're petty for un-inviting your \"friend\", but my husband's \"buddy\" owns a coffee franchise, and I've been boycotting the entire chain for years, so yeah, you're not petty 😅\n\nGood on you for standing up for yourself - I hope you're wedding is beautiful and your marriage even more so!!",
            "Not to be rude, but maybe Fred doesn't like you anymore.  That would suck, but it could happen.  Maybe he's bummed you won't leave him alone and he's just trying to be nice.\n\nWhen y'all meet face to face he has to keep up appearances but he really wishes you would leave him alone.\n\nMaybe it's time to move on.\n\nI hope this doesn't come across as mean or rude. I just read everything and had to wonder if maybe that is the answer.",
            "I have a strong feeling that something is going on with Fred's mental health. I have lost interest in friendships, and slowly ghosted people I'm not interested in being friends with before, and the one thing I would never do is call them, or make any attempt at initiating a conversation with them. The fact that he does, even if he stops communicating very quickly, shows that he still cares about you. I'm not sure what advice to give you, as it is hard to get a friend you rarely have contact with to open up about what is going on in their lives, but I would suggest you not do anything as harsh as disinviting him from the wedding. If he doesn't show, so be it, it sounds like that's what is likely to happen anyways. And it doesn't risk further harm to whatever his mental state may be.",
            "it sounds like something is very wrong in his world and doesn't know how to talk about it. My brother in law is majorly depressed right now and skipped his best friend's wedding because of it. it was last minute and I was disappointed in him but it was 250 miles away and the day after my niece's graduation. so I kinda get it. \nhave you told him you are worried about him? have you asked why he's canceling so much? it doesn't sound like any of you are really communicating your frustrations and disappointments. \nI lost a dear friend after not communicating that her new bff (that hated me and wasn't shy about it) made me uncomfortable and anxious to be around. I should have just told her but didn't and I wasn't invited to the wedding and she doesn't speak to me anymore.",
            "Sounds like what happened to my husband's first choice of best man. Dude didn't even show up to our wedding even though he and his gf had rsvp'd. Neither did a mutual friend of theirs. Mutual friend is moving out of state. They sent my husband a Facebook invite to going out on the town to say goodbye. They didn't send me one. \n\nThey sent my husband a text asking if he was coming. My husband responded saying he doesn't go out barhopping anymore (cause we don't. It's expensive and neither of us enjoy drinking) but of they would like to come over to our place (a 5 minute walk from many bars) and smoke a bowl, they were welcome to. Obviously they didn't actually care about the friendship, unless it got them free drinks or someone else to enable their shitty behavior (the white guy of the group frequently used the n word and they are both generally mysoginistic). And since my husband does brother of things and hasn't for a while, they didn't care anymore. And that sucks. But now we know we don't have to waste any time, energy, or thought on them outside of a cautionary tale.",
            "I don't want to jump to conclusions but just from personal experience is it possible that your friend is using drugs? I ask because as someone who use to be very out going and would attend all parties/get-togethers but when I started to become addicted to my pain medication ( back issues) all those things about me changed. I became very introverted and didn't believe it when friends and family would mention it. Looking back now they were absolutely right the deeper my addiction became the more introverted in became. I had 3 wedding to attend in a months time and I was so late to all of them that I missed the ceremony to all of them and showed up after the reception had already started. Worst part was one of those was my older brother's wedding and our younger brother had just passed away just months before. I didn't see the big deal at the time but now I realize what me being there meant to him. You know your friend and maybe this is way off base( I was someone who didn't even drink and would have never become addicted to drugs) but I just wanted to bring to your attention that this can also the behavior of an addict. On another note..  Congratulations to the bride and groom to be.",
            "I dated a Fred. We got along famously when we actually hung out, but he was so flaky and when we weren't in the same room together I felt like he had absolutely no interest in me. It made me crazy. Some people are just like this, and whether he's dealing with debilitating anxiety or something, or is just an asshole who doesn't give a shit about your feelings, the outcome is the same-- an unfair amount of stress and disappointment on your part. It's hard to let go of someone like this when you have so much fun with them in person, but ultimately it's for the best.",
            "I had a similar friend. It's a weird sort of conflict avoidance. They simply don't have it in them to say \"no\", instead finding it easier to apologize and offer a weak excuse. I was actually with my friend a few times when she ghosted other people.\n\n&#x200B;\n\nLife is much less stressful when you don't have expectations of flaky people.",
            "Friendships are actually like many other things in your life. You need to periodically review their continuing utility in your life, and don't be afraid to have a cull once in a while. Fred sounds like he was overdue for the cut if anything.",
            "He's been flakey \"dozens of times\" and you were surprised he was flakey this time? That's on you at this point",
            "[deleted]",
            "Similar thing happened to me too. My best friend of 8 years, we've been through a lot over the years in school, and after that life had thrown us in different directions. Literally. I tried to keep up with her through social media, but no dice. Every single time I would text her, she would be either extremely busy, or about to hang out with friends, so our conversations stopped after 3 sentences. She would always reassure me that She is often online, yet she never, not even once reached out to me. It has been 9 years since we went separate years, we met up once about a month or so after that happened. Even then I was invited, and I still remember it clearly, because \"I'm meeting up with a friend, you might as well join us\". I religiously tried to keep up our friendship for years, but I only saw her again once, in passing 4 years after (we waved from different sides of the road, and that was that), and after that I noticed that she stopped doing the only thing She did, which was writing happy birthday on fb. I still did for a couple years, but her bd two days ago was the third one where i didn't, because why bother?\n\nShe obviously dropped me like hot coals the moment we didn't see each other out of necessity,  and I don't want to spend energy on useless things. She may have been going through something ( which I highly doubt), but even so, She could have at least said something. Same with your friend. If he doesn't want to keep up with you, then it's a good thing that you stopped carrying this burden on yourself.",
            "I had something. Opposite? Happen before. \n\nA friend was getting married and wanted me in her wedding party. She made zero effort telling me what was going on even when i asked. \n\nEventually she messaged me saying i was out of the wedding party for not partaking in any of the activities they were doing. Apparently she was annoucing said activities in a facebook group that she hadn't added me to. And never bothered answering my messages. (But for whatever reason had a fit and told all her wedding party that i simply saw and ignored posts in a group i wasnt part of)\n\nI mean she never made much effort before then to hang out on the rare occasions I'd be coming home either. So theres that. \n\nIt sucks to have to cut off a friendship. But if they were really your friend, it wouldnt be like pulling hens teeth to get an answer. Its awful to have to put all the effort into a friendship. What happened here was honestly just him not caring enough to make an effort. And its good that you decided to cut him off. He's never going to bother putting an effort in. So you shouldnt have to either.",
            "I know that it is a hard thing to process considering you lost a friendship that you cherish a lot. But, I am happy that you've realized the value that Fred brings to your friendship (or lack thereof) and that you're treating it in a mature manner. You don't want any negativity for your big day (for example if he bails on your wedding last minute). The fact that he valued his partner's birthday over an event that you had been planning for 10 months, shows that he's just an acquaintance and not a friend and he doesn't value your friendship nearly as much as you do.",
            "My wedding has shown me that a couple of my friendships are dead. It's a real bummer and it hurts my heart, but I am also glad that I won't have people at my wedding that don't give a shit about me. And Fred's behavior says he doesn't give a shit about you. Good on you for being done with someone like that. \n\nEnjoy getting married!!",
            "This sucks.  I’m going through this same thing with one of my own college friends and we just decided last week to stop trying with the guy.  \n\nYour friend is most likely not coming to your wedding anyway, so need to be the one to burn the bridge.  Actively uninviting him will just prolong the drama.  Just stop worrying about him and go on with your life.  I hope that one day he realizes what he is losing and comes back.  But until then, stop wasting energy on him and live a stress free live with those who want to be there with you.",
            "My husbands best man did not come to his stag do. He also hasnt seen us since our wedding 4 years ago. Good choice hubs.",
            "I used to have a buddy who would flake out of things too. It’s never easy to decide to drop a friend but you’ll feel better for it in the long run. The mental energy required to deal with these sorts of people can be intense and it often seems like they don’t appreciate that effort. \n\nAt the end of the day I decided that I wouldn’t go out of my way for the dude if he wouldn’t for me. Not sure if he ever noticed that we don’t hang out any more but I’m happier having a small but quality group of friends than chasing people around who just aren’t worth the effort.",
            "Why uninvite him? Sounds like he won't show up anyway.",
            "My sister did something similar to my daughter when my daughter was getting married. She waited until three days before the wedding to say she wasn't coming, citing finances, which would have been fine if she wasn't a bridesmaid and had messaged her sooner. Thankfully my niece was still able to come even though my sister refused to take her shopping for a dress and her father (they're divorced) finally did about two weeks before the wedding.   \n\n\nThe kicker was when I messaged my sister the day after the wedding to let her know how gorgeous my niece was and she snapped and said, \"I wouldn't know, nobody sent me any pictures.\" Instead of saying what I wanted to say which was, \"You chose not to come, you were invited and included\", I said \"I hardly used my phone all night (which was true, I took one video of the first dance). Mom has some up on her FB page if you care to look.\" We haven't spoken since.  \n\n\nAnd she wonders why I don't talk to her anymore. It's just one of many, many, many, many, many reasons. Sometimes cutting the toxic out of your life is the best thing you can do.",
            "Kinda late to throw my two cents in, but I'll do it anyway.\n\nI definitely think you're doing the right thing by uninviting Fred, he's not putting the work into your relarionship that you've made it clear that you need, and is negatively impacting your life because of it. And, dude, you're getting married! That's awesome! Definitely not the time you need unneccessary drama.\n\nI actually disagree with the people jumping to the \"he lacks empathy, doesn't care about you\" conclusion, tho. It's definitely a possibility, but as someone who's done similar things as what Fred is doing (never when deposits were involved, tho, or I still paid what I agreed to before), I wanted to say that there's a really good chance he's struggling with something right now. This doesn't justify his actions - I still feel terrible for how I behaved and how it impacted my relationships - but I've found that looking through that kind of scope rather than \"he's such an asshole\" makes it easier not to take it personally.\n\nRegardless of the reason, you don't owe it to him to keep him around, and his behavior DEFINITELY doesn't reflect on you. So please, focus on you and your soon-to-be spouse, and live your life to the fullest!",
            "What a petty, bitter note to start your marriage on. Good luck.",
            "It doesn't matter if you uninvite him or not, he's not showing up either way.",
            "I can't help but feel you are taking this way too personally. This happens. People come and go. It seems you are very bitter about Fred having other priorities and you should have stopped nagging him a very long time ago. I don't know why you are bothering to un-invite someone you know isn't coming to the wedding. This just feels spiteful.\n\nI suggest you take a moment to consider if you are doing this because you feel you need to, or if you just feel slighted/rejected. Be grateful for your time with Fred, but understand that he just doesn't have the same commitment to the relationship as you do. He'll pass by the wayside. Other people will stick around. This will be a theme throughout your twenties and thirties as people settle into new lifestyles.",
            "Something is going on with Fred and his SO. I'm going to provide a different point of view to the rest Of thread here: I'm guessing she's not invited to this wedding? She was also not invited to any of the meet ups beforehand? And the stag do was on her birthday (the second birthday of hers that they've spent together)? It's not as though they've spent a dozen birthdays together. From that alone, I'd confidently guess that there is a lot of pressure from the SO to not go to your wedding or stag do. It's common to not see someone as often when they are in the honeymoon phase - was Fred supportive when you started your relationship with your SO? Did Fred include her or did he insist on lots of 'boys only' events?",
            "Something you mentioned in your first post was about Fred getting a girlfriend and disappearing off the face of the earth, the making plans and pushing them off or flaking altogether.\n\nThis post, you mention Instagram photos of him out on the town with said girlfriend? \n\nThe texts from your best man. \n\nSounds like Fred has a lot of learning to do about the importance for himself, let alone anyone else, of keeping in touch with his friends over choosing to be convenient for his girl. May or may not be an abusive situation. It's just interesting that this girl shows up and he poofs. \n\nI think uninviting him is a good move because it's less stress on you and your fiance. If he did come, with her, things may get hectic.\n\nI only say all that because I know someone who had me doing the same thing to MY friends. His friends, we were there. Anything for me got gaslighted, rug-swept, and belittled. I wouldn't write him off entirely but I also wouldn't be the first to reach out.\n\nJust something to keep in mind.",
            "Did he end up saying anything in response to your message?",
            "This is a situation I've been in before. What will you say to him? I'm always curious how people will word something like being uninvited to a wedding.",
            "People come and go. I have come to realization that it is inevitable. I don't blame your friend. I blame life....",
            "Would like to hear Fred's response to being uninvited from the wedding.  Sucks you have to do it but I think most in your situation would do the same thing. Congrats on getting married!",
            "Kinda off topic but I was like what the fuck is a “stag do”? Bachelor party, okay. That’s a weird thing to call it.",
            "Everyone has to move on sometime.  I have moved on from people that were my best friend we just didn't have anything in common anymore and it was too much energy to keep it going.  Focus on your immediate family first then others.  It is the most important thing in your life.",
            "Jesus OP, take a hint.\n\nHe’s moved on to another part of his life and doesn’t really want you as more than an internet friend at best.\n\nStop being so creepy. You invited him and wanted to stay friends, he didn’t. It sounds like you’re in love with him or something. You have a great girl and many other friends. Who cares why he doesn’t want to be friends. It’s his loss. MOVE ON",
            "So what did Fred say when you uninvited him!",
            "I think you're being too sensitive honestly. If he doesn't show up, he doesn't show up. No need to start confrontation and break up with a friend because he cancelled plans a few times.",
            "You know no family member got an operation, right?\n\nStop spending one ounce of emotional energy on this guy. Tell him that he’s off the invite list and have a nice life.",
            "I am Fred. (Not literally.)\n\nAlthough I don’t think I ever have or would ever allow things to get to this point, I am ashamed to say that I have done miniature versions of this to people.\n\nIt usually happens when I still love the person and value them, but (for whatever reason: time, distance, unexpressed feelings that have been affecting the friendship) feel that I’ve outgrown the degree of closeness we once shared. I don’t want to have a conversation about how the friendship is effectively “over,” because ...it’s not. I still feel affection and want to honor the bond. But, by “honor the bond,” I mean allow it to rest in peace and dignity where it currently sits.\n\nYou and Fred don’t sound like you were *actually* a close part of one another’s lives anymore, although you do sound very important to one another. This can be a very difficult thing for the person in Fred’s position, too.  How do you say that to someone who keeps pushing to maintain a formal friendship? It makes it sound like the basis for a friendship is over, when it isn’t. It has just shifted.\n\nIt sucks that he wasn’t straightforward about it, and that he let it grow into “I’m showing up to your wedding” only to ghost. But...he’d been pretty clear in every other way that he wasn’t prioritizing smaller hang outs or attempts at communication, so I am not that surprised that he would fail to prioritize a much larger one. He had been trying to downgrade into a much more casual friendship for a long time. This is not someone you pick for your wedding party. \n\nIf his friendship was once important in your life, the way to honor that with a person who is (albeit passively) begging you for a less formal friendship is A. allow for a less formal friendship and B. keep casually circulating in that person’s life when it’s convenient for both of you to do so. That’s it. “Hey man, I’m in town for a day. Wanna grab a beer?” NOT “Will you take on the responsibility of being in my wedding?” Not to come down hard on you, but it is clear (because you guys weren’t really talking or hanging out) that you have *no idea* the ins and outs of this person’s life anymore. This fact alone makes it kind of treacherous to ask him to take on the stag-do. \n\nPeople grow apart and they get busy, distracted, and tired as they grow up. He has a different life now, one with a job, an apartment, a partner, and who knows what else. It’s clear that those things are his priority now. \n\nI guess I’m saying this in the hopes that you won’t internalize this as something that’s “about you,” or write off the whole thing as “never really a friendship.” The end result of this was very shitty and probably not forgivable, but you can learn from the experience rather than just writing it off as something that’s completely “on him.” It’s not. It’s on you, too.\n\nEdit: spelling",
            "You did the right thing. The ways he acts (minus making promises and appointments only to cancel), is similar how someone would act when they had no interest in staying in touch. You basically became acquaintances and then strangers.\n\nI never quite can understand how people can make promises and constantly renegade on it. Normally people would feel apologetic and bad / ashamed about it. And they would certainly not keep making promises and cancelling it at the last minute. \n\nPeople change. Fred clearly has. I would not make any attempt to stay in touch with him. Delete his contact info and if he sends a message, you can always reply out of politeness, but seen he had no problem constantly ghosting, I would not feel that sorry about doing the same. You're not friends anymore after all. And it is a pointless exercise to stay in touch with someone who could care less.",
            "Well done, I think you're making the right decision here. Can I ask how you phrased the uninvitation message?",
            "Weddings really stress me out. I'm super happy for the couple and support their marriage, I will send a gift but I do not want to go to the wedding let alone participate in a full weekend of events. I'm sorry I'm not going to be able to make it. Doesn't mean I don't want to end our friendship. I can communicate this now but it's taken me a long time. Fred is a busy guy and he failed you by not communicating. I'm sorry it stressed you out. Maybe one day you guys can be friends again but he may have burned the bridge.",
            "...sounds petty to me. a stag and doe is a just another cash grab from friends and family...then there is the wedding which is another big gift.",
            "Fred's SO is controlling as fuck and throws a fit whenever he wants to do something without her. He makes up excuses to not poison the well.  You will probably find out about all the details in about 5 years but by then the friendship is pretty much done.",
            "OK, what is a stag do and hen do? this the bachelor and bachelor party? Similar experience, if you need to put 100% of the effort then its probably a one way friendship street. Just uninvite and move on with your real friends.",
            "Are you a fucking woman?",
            "I've been in this situation before, but with a boyfriend - he was a decent guy, but simply did not prioritize me. I could write pages about how he treated me but in the end I'll just say that several years after I broke with him we ran into each other at an event and he wholeheartedly apologized for how much of a jerk he'd been.\n\nGood on you for respecting yourself - a friend who acts like that is no friend at all.",
            "What a shitty friend. I’m glad you’re not inviting him to wedding anymore. This should be the last straw on this one sided relationship. Cheers to getting married and enjoy it with all of your true mates!",
            "People have their own shit going on dudes probably depressed, addicted to drugs? Busy with more important shit? Probably thinks your a wanker but dosnt want to hurt your feelings or just can't be fucked and that's ok. People change life goes on!",
            "You sound like a woman."
        ]
    }
]