[
    {
        "post_id": "7hnm60",
        "author": "killuaBeta",
        "title": "[UPDATE]Me [21 F] engaged after 2 months of knowing each other and dating with my boyfriend [20 M] duration, short-description",
        "url": "https://www.reddit.com/r/relationships/comments/7hnm60/updateme_21_f_engaged_after_2_months_of_knowing/",
        "score": 2375,
        "num_comments": 183,
        "created_utc": 1512451827.0,
        "selftext": "Link to Original post: https://www.reddit.com/r/relationships/comments/7gtlr5/me_21_f_engaged_after_2_months_of_knowing_each/\nOriginal tl;dr He was dating someone for 4 months before me and started dating me after 2 months of that breakup...is this a red flag?\nEDIT: After reading all the replies, I have come to the conclusion that I need to have a serious talk to him to slow things down( he set the wedding for April next year) I m thinking of giving back the ring\n\nSo I talked to him Saturday night, it took everything I got and I was scared. I eased him by starting to talk about what we each wanted in terms of career path, where we want to live, kids etc...found out that he wants four and I only want one lol.After the light talk, I expressed my concerns that we might be rushing things, and I gave him his ring back...he started to cry and at first I was starting to feel really guilty, he was going nuts and I was a little scared but I was able to calm him down. I told him that we should call off the wedding and that didn't go down well, he called me names and claimed that I didn't really love him. I told him I want to work things out, that we can be together but not married for now, not engaged. He said that he needs space and time to think, it has been almost 3 days now and he won't talk to me, won't answer my text and he won't see me. His mom has been posting stuff on his facebook wall about relationships and stuff. I reached out to the girl he was dating for 4 months before we started dating 2 months later and she told me that he had proposed to her and that is why the broke up, with the same ring he claimed to have bought for me using his savings...needless to say, I feel gutted, should have probably contacted the ex-first but I didn't want to be that guy and I was in love. I still have feelings for him, just can't turn them off but I now know that being with him will bring me tears, I am tempted to try to salvage the relationship but I won't be, going to take time for myself away from everything.Thank you so much to everyone who answered on my post, this has been a very sobering experience and I hope to grow from it. I really appreciate all the replies, it made me feel like I was not crazy for all the concerns I had been having.\n  ---   \n  **tl;dr**: Gave back the ring, told him I still wanted a relationship, he hasn't talked to me in almost 3 days and I found out he had proposed to the ex which is why they broke up.Going to take time for myself",
        "permalink": "/r/relationships/comments/7hnm60/updateme_21_f_engaged_after_2_months_of_knowing/",
        "comments": [
            "You did the right thing, and his reaction shows that he definitely wasn't ready for marriage either. You dodged a bullet. ",
            "[removed]",
            "You did the right thing, and you know it. Break-ups suck, but if you're not already be proud for not falling into something that was bound to have a (more-dramatic!) end date. Imagine if you had children with this person and then had to deal with custody..! The horror.\n\nGlad to hear you're taking time for yourself, OP. Best of luck!",
            "Bullet dodged. You're 21, you'll have plenty of time to meet and develop relationships with other guys.",
            "If you haven't, yet, OP, since it's clear you've now checked out of this relationship, I suggest removing both your now-ex and his family from all social media and blocking them. The best way to work on yourself is to distance yourself as much as possible.",
            "His reaction suggests to me that he just wants to be married for its own sake, and whom he's married to is only a minor consideration. Not a very solid foundation to build a life upon. \n\nOf course you are grieving the loss of the relationship, but I think you'd be wise to stick to your guns on this one. I'm sorry this happened to you.",
            "Don’t take this the wrong way, but the red flag in this situation isn’t that he was dating someone 2 months before you... it’s that he proposed after 2 months. That is waaaaaay too rushed, and 2 months isn’t nearly enough time to know you want to spend your life with somebody (shit, it should be a couple years at a minimum). I really don’t mean this in a judgmental way, but honestly saying yes in the first place was a really bad idea. His response to your very reasonable request to take things a bit slower certainly confirms that he has some emotional dependency issues of his own to work out. I don’t doubt your feelings for the dude, but you definitely dodged a bullet there. ",
            "Jesus christ this guy is a train wreck. Definitely good call on not marrying him, but how does that even work, you meet someone hey let's get married and have a future!, it's like... I don't even know you bruh. ",
            "I had a feeling that the ring was originally meant for someone else when I read your first post. Who knows, maybe he's used that ring with girls before her too. Anything is possible and I wouldn't put it past someone like that. You learned a valuable lesson from all this, it's to trust your instincts no matter what. I feel that his family is kind of strange to keep watching him do this, but maybe they're used to it or they're hoping someone else will take care of him.\n\nIt's a huge red flag when someone tries to rush into major life events like this. Sure, there's an exception to the rule, but it's rare. We normally see posts about someone marrying or moving in too fast and now they're stuck in an abusive situation. Guys (or even girls) like him will rush to pin someone down so that way the other person has a harder time leaving when things do start to get out of hand. Of course they're not going to be abusive at the start, how would they keep someone that way? You got lucky that you saw his true colors when you had that talk with him.\n\nI predict that he'll be proposing to another girl in a few months and hopefully that one is smart not to do it also, then his mom can post more inspirational relationship stuff on his Facebook wall.\n\nAnyway, he's gone now. He may come back or he may not. If he does, ignore him. Actually, block him on everything now for your own sake. I know it's hard right now, but he wasn't who you thought he was. Also, please use what you've learned when it comes to your next relationship.",
            "Bullet dodged op,  bullet dodged. \n\nGood on you and the ex gf who also knew to run when faced with a proposal after four (and two on your part!) months. \n\nYour ex sounds deranged,  mentally unstable and potentially violent.  You're seriously better off as far from him as possible. ",
            "Also you dodged the JustNOMIL trainwreck as well. ",
            "This guy is not ready for marriage with *anyone,* evidenced by the fact that he's consecutively proposed to girlfriends after only knowing them a few months.\n\nHe clearly has some issues.",
            "[deleted]",
            "This is all so scary, OP... I know you feel something very strong for him, but every hair on that guy's body is a red flag... \n\nI hope you stay away from him, and I hope you let yourself move on from him. Grieve, and move on. Jedi hugs.",
            "*Huge* credit goes to you, OP, for making a tough call and doing what needs to be done - even though it was painful and you still have feelings for the guy. I think that future you is thanking you massively. This guy is *not* mentally stable, and is *not* ready for a relationship. Write that down for yourself, and take a look at it whenever you consider getting back together with him.",
            "OP, I don’t want to be mean but you should really hear me out.\nIt is very worrying that you would even be open to savaging that relationship before you spoke to the ex. He showed you who he is, a childish, immature, manipulative, emotionally unstable guy with no sense of responsibility when he proposed to you. You still wanted to be with him. Then he went nuts because you confronted him with your reasonable doubts in the kindest way, and he called you names and gave you the silent treatment. And you still wanted to salvage that relationship? You need to reevaluate what you want from a guy. Think long and hard about why the hell you would want to stay with a guy who showed you that he is an unstable asshole. \nI wish you the best and I am glad that you got out of this relationship :) ",
            "So his last relationship broke up because he proposed after 4 months, so he proposed to you after ... 2? \n\nDude doesn’t learn does he? I wonder how many proposals his family have to fake cheer at every year.",
            "If you were unsure what to do before, at least now you know from his reactions that you did the right thing. \n\nYou did great!",
            "This dude is fucking nuts. Run, don't walk.",
            "Yeah impulsive people who try to jump the gun like that scare the shit out of me. I had an ex who tried to ask me to marry her when she was tipsy and I shook it off because we were like a brand new relationship. Turns out you can be impulsive in other aspects also and she was caught shoplifting multiple times and lied without regrets.",
            "Congrats on getting out of that. \n\nBut, please be cautious in the future. Being ready for a lifelong commitment after two months, then setting the wedding for six months later is a giant red flag that should have sent you *running*.\n\nAlso:\n\n> he called me names and claimed that I didn't really love him. I told him I want to work things out, that we can be together \n\nWhy in the hell would you tell him that after he's called you names and tried to further manipulate you?!\n",
            "Pro tip: when someone asks you to marry them after only a few weeks/couple months, 99% of the time it is NOT romantic/fate/kismet. Rather it's a giant flashing red sign of immaturity/instability/unhealthiness ",
            "I’ve called off an engagement and wedding before. You’ll be fine. When your gut says “don’t do it”, don’t do it. You did the right thing for the both of you. ",
            "Holy shit, he also proposed to the other girl.. WITH THE SAME RING! You dodged a bullet, woman. Be glad.",
            "What's the definition of insanity? Doing the same thing again and again and expecting a different result. What's the definition of insanity? Doing the same thing again and again and expecting a different result.",
            "Yeah, run like Forrest freaking Gump. You dodged a bullet train, never mind a bullet!",
            "Is this guy a legal citizen?\n\nHis desire to get married seems to be motivated by something else",
            "One of my friends is in like the exact same situation as you (I was honestly hoping that you might be her lol) they met and were engaged after like a month and he’s such a piece of skit ",
            "Run, don’t walk, out of that relationship. ",
            "Holy smokes you dodged a bullet! He obviously has some need to get married so soon! Your both so young enjoy life don’t get tied down after such a short relationship!  ",
            "Creeped me out, because I actually had a boyfriend in 10th grade who gave me a promise ring and I accepted it. At the time, I thought \"How romantic,\" but he was a total manipulative creep-o. He took the ring from his mom, apparently, and turned around to do the same thing w/ the girl he cheated on me with. Different ring, at least. Total red flag. Not the first ring I'd received from a boy for the same reason at that point in my life, either! Now that I'm married, I realize how bad things could have gone if I'd honestly expected them to follow through on the promise.",
            "There are a few red flags and strange items.  The biggest being that it seems he is desperate to get married.  I am just guessing that he hasn't had much experience dating long-term.  Is he or you \"saving yourself for marriage\"?   I don't understand his motivation to quickly marry someone so quickly.  All relationships in the beginning are intense and with the added euphoric feelings it can cause you to have thoughts and impulses. Maybe he is a very impulsive person.  If you have feelings for him and he doesn't change after you declining the engagement, let the relationship mature.  Although i have a feeling he will be a little bitter.  You are young so you have options....many options.   ",
            "You both are still very young. What is his rush to get married so soon? ",
            "He’s looking for someone to marry because he thinks that’ll make him happy, but he isn’t too bothered with who it is. He doesn’t even know you.",
            "You seem like you have a good head on your shoulders. Not only that, you’re kind and were willing to explore your feelings with him more. He threw that in your face and called you names. That’s abusive behavior. \n\nPeople show you who they really are when they are put in a position of letting go. The people that are worth your time will express how much they care, but loosen their grip and understand. \n\nI just want to say that you don’t have to get married young or even have a romantic relationship to have a life.\n\nI think that it’s really good that you are taking some time for yourself. You are still a kid pretty much. You’re just now able to drink legally! Have some fun. Think about all of the things that you want to do and the places that you want to see.\n\nTo put things in perspective, I’m a guy in my early 30’s. I’ve never been in a long term relationship. I have dated here and there, but I refuse to settle. I’ve learned a hell of a lot and I still continue to learn about life and people.\n\nJust don’t worry at all. My love life was a mess at 21 and it still is! Seriously, those feelings will pass and there will be other people that are worthy of your time.\n\nFind your passion(s) in life. It’s the one thing that makes life worth it to me. Not just a degree or a career that will “net you an income”. Something that you really get geared up about. \n\nMost importantly, love yourself! As cheesy and cliché as that sounds, it’s absolutely true. Take care of yourself, be kind to yourself, even spoil yourself a bit sometimes. As we get older, friends and family come and go. \n\nIn the end, you’re all you have and hopefully you have a good relationship with yourself. Nobody ever told me when I was growing up that you either become your best friend or your biggest enemy. \n\nBe open to other people and don’t have any expectations. You’ll be just fine. 😊",
            "That’s crazy. 2 months and he gave a ring? There’s some serious issues here to be explored. Run, do not walk.",
            "Children shouldn't get married.",
            "Girl leave this the fuck alone. He called you names when you said “hey babe, let’s slow this down, get to know each other etc” that’s a problem.\n\nHe proposed after 2 months, that’s a problem.\n\nHe sounds unstable and (probably) manipulative. Just delete and block and thank God you escaped ",
            "You dodged a bullet. It seems like this guy has issues, both based on his reactions to your decision and his desperate need for validation. 2 months is nowhere near long enough to get to know someone well enough to marry them, let alone truly love them. Seems to me like you both experienced extreme infatuation, but thought it was love. He needs to learn to calm down and stop taking things so fast. \n\nThis is not a stab at you btw, but it sounds to me like he has a habit of being desperate. It’s as if he can’t bear being single and he feels the need to rush into long term commitment in order to feel validated. Again, that isn’t anything to do with you, and the proof is in his relationship history. He needs to learn some self love and appreciation in order to stop feeling worthless unless he’s in a relationship, which is why he tries to tie his dates down by rushing marriage. That’s his own problem, and it shouldn’t be yours too. ",
            "Wow. Youve dodged a bullet. Now focus on cutting him out of your life, he's not stable. ",
            "So he called you names just because you wanted to take things slower? You weren't even breaking up with him... Yeah, he sounds legitimately psychotic and you definitely dodged a bullet. Block him on everything.",
            "> he called me names and claimed that I didn't really love him.\n\nThis is not something good people EVER do in a relationship.\n\n>  she told me that he had proposed to her\n\nChrist almighty this dude has major, major issues.\n\n> with the same ring \n\nHAHAHAHA\n\nGood! bullet seriously dodged, well done.\n",
            "Any chance he's an immigrant who's about to lose his status or something? ",
            "[deleted]",
            "It sounds to me like he proposes because he is afraid of being alone. It is a normal fear but a person is not going to fill a void in his life. He needs to be a whole person, not a person with a hole if he wants to be in a healthy relationship. You did the right thing. It's clear you care about him more than he cares about himself but in the end you also look out for you, which you did. Good luck OP!",
            "This guy  is red flag central and is not ready for a relationship or marriage. You did real good OP. He honestly needs some sort of therapy. 2 months and wants to get married at 20? Holy hell. ",
            "Wow. He responded like a child. I wouldn't try to salvage it. I don't think he has a true idea of what adult relationships are like. ",
            "For your own sake, do not reconnect with him. There are better fish to catch than that sickly one. ",
            "Everything about this guy is scummy and you are still wasting time.  It’s sad really.",
            "Good on you. I don’t understand how people get engaged so quickly, and at such a young age, and expect it to work. Wait till you’re much older, and date for a while. ",
            "Whewww.  Thank goodness.  Eventually you will look back on this with **such relief**, I promise you.",
            "Let this serve as an example for the rest of your life. \n\nPeople can be crazy. Take your time.",
            "Good job, you did everything right.",
            "You were brave to end it. And he showed his true colors when  you did. Good for you. ",
            "Good job!\n\nAnd whenever you think that this break up was hard, be consoled by the thought that the (inevitable) divorce would have been much harder.",
            "My friend is in a similar situation that you were in right now. I hope she wakes up to her situation like you did.\n\nGood call!",
            "This boy is incredibly immature, any wise person understands that it's a good idea to get to know someone for a long time before you get married. I've been in relationship that have lasted years before things went south; personally I would never get engaged without dating for at least 2 years, preferably 5 plus. I had a similar issue when I was 18 and my boyfriend proposed to me (after 4 months), and when I told him I wasn't ready to make that decision, he accused me of not loving him. ",
            "Do not rush or be engaged. It sounds like he has a dependence with having to be with a girl, that is his attempt to be filling an emotional void, something from his childhood could’ve created that which deep down is a fear of abandonment.... use your head, not your heart!! Don’t be reluctant to be without him!!!",
            "You're so young to jump right to marriage and the guy sounds like a Level 5 Clinger so you'll do better than him here.  I hope he can learn to have some self-awareness and see that this kind of shit doesn't fly and even if it does it's flying shit and no one wants that either.",
            "You did the right thing. A guy like this cost me a 10 year friendship. His Timeline was slightly slower, (moved in with her 3 months in, engaged in 6, married around a year) My friend was a late bloomer in the dating world, he was her first boyfriend and she really clung tight. \n\nI was suspicious of him hitting her (long sleeves in dead ass heat of summer) but We parted ways due to him doing some illegal activities and her not thinking it was a big deal, 2 years into their marriage I read in the paper thag he went ballistic, choked her and attempted to pull a gun on somebody. ",
            "Gahh! Girl you definitely did the right thing!\n\nMy hubby and I decided during our first week of dating that we were both looking for marriage, but then we spent the next 2.5 years really getting to know each other before we finally tied the knot. Heck, we discussed personal finances before we even officially became a couple. You barely knew this guy when you accepted the ring. Not a good idea, ever!",
            "Is he religious? Is his mother religious? Are his mother and father still married? \n\nHis mother sounds like a narcissist (posting relationship shit to his FB) and has drilled it into his head that if he doesn't marry like soon, he'll be undesirable (male spinster) and if he doesn't have many children, he'll have been a waste of oxygen.\n\n\nI may be in the minority on this, but I would just let it pass and move on. There is so much baggage he's carrying and all signs point to something not so good within his family. \nWhen you told him that you wanted to slow down, he had a tantrum like a child would with their mother. \n\nI won't discount how you feel about him because some people love fast, and some take a long time, but while it hurts, there's a huge chance his impulsive nature will be a huge road block or even danger later on in your lives. He's too unpredictable, OP.",
            "Why is this guy so desperate to get married, and how does his family support this desperation. Like if any of my friends or family decided to get engaged after only two months I would think they were out of their mind and be concerned. ",
            "Just throwing this out there. My parents married after dating for 3 months. Been together for a solid 40 years. "
        ]
    },
    {
        "post_id": "1c6v4fm",
        "author": "No-Faithlessness7067",
        "title": "My husband is in love with his student. I have no fucking idea what to do. ",
        "url": "https://www.reddit.com/r/relationships/comments/1c6v4fm/my_husband_is_in_love_with_his_student_i_have_no/",
        "score": 2363,
        "num_comments": 319,
        "created_utc": 1713416584.0,
        "selftext": "Edit; I’ve decided to talk to him. I know I’ve been avoiding this since months but after reading all the responses, I feel it’s time I rip that bandaid out. I’m going over to our house. I’ll update on what happens. \n\nMy husband and I (both 35 rn) met in college. We fell in love and got married 8 years back. I gave birth to our daughter in 2020. My husband is a professor at this med school (he’s a doctor himself). My friend, Sarah, also works in the same college and she’s in the same department as my husband. \n\nFew months back(in December), Sarah took me out for lunch and told me that she suspected something’s going on between my husband and this med student (25f). She claimed she’d seen both of them give ‘yearning looks’ to each other. She said that she’s known my husband for so long, and she’d never seen him talk to any other woman like this, that he’d been so aloof around women all these years, but it’s just different with this one girl. \n\nIn that moment, I had laughed at her face. I remember telling her that she’s jumping to conclusions based on these supposed ‘yearning looks’.  \n\n“That’s why I didn't tell you before\", she had said,\"I was confused too. It's not like he goes out of his way to talk to her but whenever they do talk, it’s like watching a slow burn romance movie. She looks at him like he’s Brad Pitt and he looks at her the way he used to look at you.”  I remember the exact word’s because they stung. Internally I was breaking down, externally I just smiled and told her that she’s probably overthinking. \n\nThat night, I casually mentioned this my husband. I was laughing at the absurdity, and I expected him to join in. And deny the wild possibility that he’s in love with a student. But he didn’t. Instead he looked at me, all teary eyed, and said ‘I’m sorry’.  \n\n“ I can’t get her out of my mind. I’ve tried, trust me. I should’ve told you sooner. But I thought I could save our relationship, I really wanted to.” \n\nI asked him if he’d cheated on me. He said no. He said he didn’t even talk to her, nor did they have any contact outside of college and that he completely understood how morally depraved it is to try and pursue a relationship with a student. She wrote him a letter about an year back, confessing her love for him  and he had told her that even tho he was into her, nothing would come out of it. Aparently that was when the ‘yearning looks’ had started.  \n\nI honestly don’t remember how I reacted then. I think I just started packing and came to live with my parents along with my daughter. I’ve been living with my parents since then. Half of me wanted him to come and beg for forgiveness. But he never did. He comes by sometimes to spend time with our daughter but that’s it. He never talks about the elephant in the room nor do I bring it up. \n\nI keep checking that girl’s social media. She’s insanely beautiful, almost doll like, and intelligent. I can’t help but think that someone like him should be with someone like her. He’s always been very good looking and I’m more of a plain Jane. She’s the Meredith to his Derek. \n\nI don’t know what to do. What do I even tell people? I don’t even know who I am without him. Some part of me still wants him to come back. \n\nTL;DR husband just admitted that he’s in love with this young woman who also his student. She loves him too. \n",
        "permalink": "/r/relationships/comments/1c6v4fm/my_husband_is_in_love_with_his_student_i_have_no/",
        "comments": [
            "I hope you thanked Sarah, good friends like that are rare!!!",
            "Jeez. He’s flattered and infatuated (and so is she). What a dumbass.",
            "Bruh if she’s Meredith to his Derek that makes you Addison, I’d be happy with that",
            "Let's say he comes back and asks for forgiveness and do all that you want. Then what? Will you accept him and start something new with him knowing that he did this?\n\nThink about your time and you happiness. What prevents you from finding the right person? Don't let the fear of the unknown ruin your future of being with someone perfect for you. And try to maintain a respectful relationship for the sake of your daughter. You deserve better than this. Let the past go and move on to see where it takes you. Holding on to this feeling will only make you bitter and close many doors.",
            "Assuming he told you the truth and nothing happened besides that letter and these \"looks\". It is not love. On either side. It is infatuation. \n\nImo you cannot truly love anyone until you have actually been with them, and even lived with them. It is very normal that a 25-y-o girl would believe infatuation is love, but at 35, your hubby supposedly knows better. He does not love her.\n\nHowever, and that is going to hurt, that does not mean he still loves you. He told you \"I thought I could save our relationship, I really wanted to\" PAST TENSE. He did not beg for forgiveness, as you said. It honestly sounds like he does not love you anymore and will not make the effort for you.\n\nYour problem is not that he fell in love with anyone else, it is that he does not love you anymore. Your husband, like many men, did not have the courage to tell you just that and instead waited for you to find a reason to leave him, this way he will be the wronged party, because after all he \"did not do anything\".\n\nYou need to have a talk with him, and try to be as civil and respectful as possible. Tell him that even though nothing happened with the girl, you feel like he wants out of this relationship. Tell him that you deserve to be loved, truly, 100% loved, and he is not giving you that. I would also tell him that if he wanted to leave you he should have done just that instead of exchanging looks with a 25 y-o.",
            "The fact that he never came to talk to you to fix your marriage means he's checked out.",
            "Damn, it’s stuff like this that makes me never want to love someone *too much*. Just enough to be happy with them, but not so much that I’d be crushed if they do what your husband has done - so I can just walk away and say ‘thank you, next’",
            ">He said no. He said he didn’t even talk to her, nor did they have any contact outside of college and that he completely understood how morally depraved it is to try and pursue a relationship with a student. She wrote him a letter about an year back, confessing her love for him and he had told her that even tho he was into her, nothing would come out of it. Aparently that was when the ‘yearning looks’ had started.\n\nHonestly, I don't know that this makes sense. That she could get to the point of writing a letter that confesses love off what he claimed was such limited contact just seems kind of absurd. Worse, when she did choose to confess he chose the most cruel and self indulgent response possible. In that moment he chose to ruin his life, that's the sad reality of it, and whether it ever manifested as anything more intense he did enough damage there that things would never go back. He failed as a husband, adult, and educator.\n\nDon't idealise his dynamic with her. The reason people frown on teachers hitting on students is because the power discrepancy makes any emotional connection compromised. She was enamoured with him but part of that means ignoring the dissonance of all the bad things he did to humour it. In the end she's just naive. As for him, well, he's a creep.\n\nTime to find out who you are. Part of that will involve stop putting yourself down. Even if he came back it wouldn't undo the things he has done and that's the sad reality. He will understand what he lost with increasing clarity but that's his burden to face.",
            "There’s a part of me (the drama king in me) that wants me to advise you to ask him point blank: “are you gonna start the divorce or me?” But the pragmatic side would advise you to contact a lawyer and have them handle it from here, starting with working on a visitation and custody arrangement. Start getting that shit done. Grieve when it’s finalized.",
            "I got divorced 10+ years ago, and it was the best thing i've ever done. My sister told me something, and i'll tell you the same thing - because it helped me. \n\nLive in the truth\n\nWhatever the truth is, that's where you should be. The truth here is, he's checked out and lost your trust. That's it. Now at least you know. Start a new chapter in your life, he isn't the one for you, it's painful now - but years from now WHEN you're with the right one, it'll all make sense. \n\nGood luck, stay strong.",
            "I suspect part of the reason he doesn’t want to talk about the elephant in the room, or push for a divorce is that “My wife is divorcing me because I’m hot for one of my students” generally doesn’t go over well with the med school. It’s not just “morally depraved” as he put it - it can be grounds for disciplinary action all the way through to getting fired. Even just the appearance of impropriety or favouritism is enough.",
            "Read your comment about you living with your parents for 5 months & he hasn’t come to fight for the marriage but to see his daughter….I’m sorry but it looks like hes done with the marriage & probably been in contact with the student! \n\nYour friend works with your husband is she still giving you updates about him?",
            "I truly believe that in the best interests of your mental health, you really need to walk away permanently from this. It’s unfortunate that it happened but there is nothing both of you can say or do to come back from this. To want him back or to try to fix things is simply delaying the inevitable and you have a child in the middle of all this.\n\nYou also really need to sit down with him and have that serious conversation about the big elephant in the room that you are both trying to ignore. No one is winning points here for procrastination. You have a child and your mental health to think about here.",
            "I remember that a psychologist friend of mine at some point told me that it’s normal to have crushes on someone else even if you are married. \nThe important thing is whether you act on it or not. If you don’t they will fade in time.\nDon’t know whether it’s true or not, but it seems your husband had chosen you and your marriage until you moved out. \nPerhaps it’s worth exploring couples therapy?\nMost people think having a child will strengthen their relationship, when most times it’ll put a strain on it and especially the first years it’s easy to grow apart. And I would guess that makes it easier to fall for someone else. But sometimes you can work through that and rekindle.",
            "I'm sorry you've had to go through this and this really sucks, but it's baffling to me that your husband would jeopardize his job for this considering that this just seems like limerance.  They don't know each other and are only seeing (or imagining) idealized versions of each other.  This reveals a lot about your husband's character - it's incredibly inappropriate for him to involve himself with a student like this.\n\nI think you should only tell people the truth - this is his mess.",
            "I think if you haven't already you need to file for divorce.  You need closure on this relationship so you can move on.",
            "When he tells you he is in love with someone else, believe him. \n\nPretty obvious.. But hearing yourself say this out loud makes it less complicated to make decisions that are best for you and your daughter. You can't make him love you or be with you. The only thing you can do is work on yourself and be the best parent you can be for your daughter.  This is your opportunity to be able to show her how you can overcome something so heartbreaking by being able to dedicate more time loving yourself and growing to be a better person while still respecting her father and his decisions. \n\nIs what he did and said painful? Yes\nIs what all he said true? Yes\nDo you want to stay with someone who is in love with someone else? I assume not.\nDoes a part of you want him back? Yes... But you probably miss the idea of him.\n\nIf you're asking what to do... I would say divorce him amicably, learn to live your life without ever having to find yourself asking, \"I don't know who I am without him,\" and enjoy the journey of self discovery without having a partner to fulfill the void.",
            "He hasn't even come to try to win you back which tells me it was over before you said anything it just was going to be a slow death had you not mentioned it. People don't usually end a relationship when it's dead they wait till it starts rotting and although you weren't aware that the relationship was dead probably because you were so focused on child rearing in your own career doesn't mean it wasn't dead. I think it's best that you choose radical acceptance and move forward through your life knowing that this man is not going to be anything but a co-parent to you. \n\n\nWhy would you want to be with somebody who you're always going to wonder when he's gonna cheat on you again and who hasn't even tried to fight for your relationship? You might be a plain Jane but I think that that's the wrong way to look at this because are looks really that important? Does good looks make up for somebody being a liar cheater a thief a murderer? A deadbeat Dad? A man who doesn't love his wife and then let's her leave and doesn't even fight for her or his family? \n\n\nI mean the relationship is dead but I still think you need to work on how you're framing this because it seems like you're making it about yourself worth when it has absolutely nothing to do with that. Go see a therapist and get your head straight call a divorce lawyer and move forward.",
            "I think I can weigh in on this a little. I developped a tiny crush on a coworker a few months back, for about a week. He's really nice and intelligent and all that. You know what I did about it? Absolutely nothing. I have a partner that I love more than myself, that I would never cheat on. And I would also not sabbotage my professional relationship with my coworker. So what if he's attractive, he's my coworker, I'm a lot younger than him and it's inapropriate. End of story. \n\nThis is what you do when something like that happens. You can't control your emotions, but you can control how you react to them, and the moral thing is to do absolutely nothing about them and move the fuck on. Not to destroy the lives of everybody around you because your lizard brain wants something.",
            "Just go to therapy for yourself to help to figure this out. His lack of action says everything. Start to focus on yourself that’s where you will find your healing and start to look for a divorce lawyer. If he would want to save your relationship he would do everything to cut her off. (Changing jobs etc.)",
            "This is so hard. I don’t have an answer besides therapy for yourself, and maybe suggesting couples therapy to your partner if you’re both interested in saving your marriage.",
            "I highly recommend you also consider posting this on AskWomenOver30, you’ll get a lot of mature advice and probably hear from people who’ve been through similar experiences",
            "I think the fact that your friend was able to sense it despite not having enough info is pretty telling. That means other people can sense it, too. Idk I have some suspicions about him being completely honest especially considering he supposedly said this:\n\n>But I thought I could save our relationship, I really wanted to.\n\nI mean clearly he does feel something strong for her. The fact that he hasn't really tried to contact you since you left makes me wonder if he's kinda checked out at this point. I was wondering if he was maybe waiting for you to contact him when you were ready, but the fact that he doesn't really take the time to talk to you while he's visiting kinda just makes me wonder if there's anything left of your relationship to savage at this point....\n\nI'm sorry OP. I wish you luck and hope that you find someone who truly just wants to be with only you.",
            "It just takes that \"ONE\". Maybe he didn't cheat physically but emotional cheating is also a thing. I wonder what would have happened if your friend never brought it up and you never mentioned it to him? Maybe the emotional cheating could progress to something physical someday with you being unaware of it. \n\nThe most surprising thing is he hasn't done anything to apologise to you. Maybe you should address the elephant in the room. If you think time will sort this out, trust me it won't. Both of you speaking about it might sort it out. Don't put this under the carpet and forgive him, is all I would like to say. This was a huge breach of trust, even though it wasn't physical. All I understand is when it comes to any kind of cheating nobody gets the right to say \"I don't know how it happened.\" \"I don't know what I was thinking\". Cheating is a choice not an accident. Always remember that. Also you deserve better than someone who thinks a new fling triumphs marriage vows. Excitement fades in all relationships, that doesn't justify what your husband did. \n\nSorry you are going through this OP! Good luck to you.",
            "Hire a divorce attorney and tell them about this student and his claim to be in love with her.  He will either wake up and try to fight for you and your marriage, or not. But you can't stay in limbo and if he is infatuated with this student, he should report himself to his hr so that they are aware before any aligations of inappropriate behaviour or special treatment is reported by other students.\n\nUpdateme!",
            "It don’t fit. People don’t fall in love with and make declarations after nothing but work-appropriate conversation and longing looks. Either he crossed a bunch of lines and cheated, or he is a nitwit indulging in a career and family threatening fantasy with a much younger woman. Either way, he was in a position to put a stop to it, and instead chose to groom her and lie to you.",
            "This can’t be real 😂.\n\nThey’re “in love” but they hardly know each other? And at that big grown age? \n\nFake or they’re both ridiculous.",
            "He has a huge crush on her. He is in love with the idea of her, not with her actually. I´m in a long termin relationship and I´ve beent through crushes myself. It´s salvageable.",
            "It’s been months, he just let you leave and comes to visit his child, while never even mentioning what happened. He’s done and so should you. I’m sorry this is happening but he’s taken no steps and shown no willingness whatsoever to repair anything. Obviously you’re never going to beg because self esteem so maybe someone should file for divorce, settle assets and above all, establish custody of your young child. I’m glad you have your parents to count on, I can’t imagine what you’re going through.",
            "I don't believe your story. It's too smoothed around the edges. You say you \"don't know what to do\" but all your replies are saying that you've already come to terms with it. Your story reads like a piece of fan fiction. You walked out 5 months ago because he has a crush? Marriages are built of much much stronger stuff than this. People talk and work things out. It's completely ridiculous to not have talked about this in all that time. It's laughable that people on here believe that.\n\nNot sure why you are fantasizing about this. Using the relationships sub as a place for fantasy fiction isn't a new thing, but it never gets less weird when I come across it.",
            "I'm sorry, you feelings are valid. You feel inferior because the you love, choose love another. And he even want try with you, is a punch on ego, and self-esteem. Focus in yourself, in heal in do thing for you, discover who you are without him. Try to be happy without him. Focus on that an everything will be fine.",
            "He checked out. Sorry. \n\nIt's time to move on. It will only get worse",
            "I’d say this is something you could get past if you both wanted to continue the relationship. It sounds like he’s blown it out of proportion tbh, I find it hard to believe he’s fallen in love it’s more likely a crush and if they actually got into a relationship it would be short lived as it’s all based on fantasy. Anyone can develop feelings for others even in a relationship. If you could work past it then you could get to a stronger place after. If there’s any chance this could work I’d consider trying to have a really honest conversation with him. Is he really willing to give up your marriage for this? He hasn’t actually done anything, so it wouldn’t be impossible to change the narrative around it. \n\nBut if he believes he’s in love and you can’t trust him the relationship is unfortunately over. Take time to grieve and get the practicalities sorted out. Don’t feel like you have to rush, focus on what you and your daughter need now and you will get through this and heal. Please don’t blame yourself for this situation, it’s nothing to do with you at all. There is nothing wrong with you, it’s all on him.",
            "That’s not love from either of them lol. That’s lust, and the only thing potentially saving this marriage is because he loves his job more than you to be caught cheating with a student.",
            "Maybe Im young and naive but isnt it quite possible that people have crushes a lot? This got correctly stopped before anything really happened, actuall at the first sign of stuff getting out of hand, and there was honest confession and now he's keeping minimal contact to noto to bother his wife who is probably done with him and also he seems to know there's no point in talking/begging about it since it's all over. All of that simply due to strong emotions which he was not able to stop at the time.\n\nI'm not sure I would have been a better person and stop myself entirely from having a crush.",
            "I'm sorry but your husband is not in live with his student. He's in lust with her. He doesn't even know her. He knows nothing about her except for what he's seen at school. \n\nWhat a flocking idiot your hubs is. \n\nYou're better off. I know it hurts, but you are way wayyyyy better off.",
            "But he didn't cheat on you... It wasn't even an emotional affair. He shot her down. What am I missing here?",
            "What's most depressing about this is that it was so obvious that someone else (your friend) noticed and knew something much deeper was happening, and you needed to know. The husband should've told you. The 25 year old knew about you. She's a home wrecker doesn't matter if it didn't go beyond she should've backed away when she saw a ring ? Does your husband  have social media? He should've actually never let it go beyond attraction. You deserve better. Being a parent is hard why isn't he focusing on that rather than some random 25y/o?",
            "Time to talk to a divorce lawyer and serve him papers",
            "You file for divorce. You do not want someone who does not want you. You ALSO do not want someone who as a physician has the incredibly awful judgment of getting entangled with a *student* for crying out loud.",
            "She has an infatuation with an older guy in a position of power. Chances are once they're actually able to pursue a relationship the sheen will wear off for this 25 year old and it'll end pretty quickly.\n\nYour friend was really kind to you to come and tell you. I'm sure that was really hard. I know it hurts now, but you're still young and you can start over. \n\nJust don't take him back when the young girl comes to her senses and drops him.",
            "I’m trying to understand how people are downplaying her husband’s crush on this woman. The woman wrote him a letter professing her feelings. He responded that he feels the same way. The moment he did that, he crossed a line in his marriage. Full stop. Following up with nothing will ever come of it doesn’t absolve him from crossing that line. Why didn’t he talk to his wife about this? Why is he trading yearning looks with this other woman in public so obvious that other people notice? How are they having no contact yet still looking at each other like that?  Even his verbal response of not getting the other woman out of his head and trying to save his marriage speaks to him be farther gone than some fleeting crush. Her husband did not do enough to squash this. \n\nHe’s didn’t cheat physically but his actions are a betrayal of trust and his marriage. Some people may be able to move on from this but OP is under no obligation to do that. At the end of the day OP needs to have a conversation with her husband about next steps. Is it simply separation and maybe some couples counseling? Or is it completely done and they both need to seek out divorce attorneys? Maybe move back into the family home and work out out from there? But there needs to say least be a conversation about the elephant in the room.",
            "Figure out what you actually want - to fight for the relationship or divorce - then rip the band aid off and have that conversation. That’s really all you can do.",
            "You will eventually get past this. It's hard to sit with negative emotions and wait for them to lift. You deserve to have a partner who cherishes you.",
            "Wow this one hurts, I'm really sorry. \nHe had an emotional affair\nI'd divorce him the relationship is already over, in his mind y'all are done. Rip off the bandage and get the hard part over with. \nNext lots of therapy, this is a a huge life change and it's very sudden too. Also you're gonna need to learn how to co parent with him.",
            "OP, I think you guys really need to have a talk about this. Even just to speak about the things you claim to already know through his behavior. It‘s tough but it will make it easier for you to seriously come to terms with it, be better co parents and to let go. Your assumptions sound right, but you guys need to communicate your feelings and intentions. You‘ve been together for so long and have a child after all. Sending you all the strength and courage needed to close this chapter ❤️",
            ">he had told her that even tho he was into her, nothing would come out of it.     \n\nThat is emotional cheating.  He wants her to keep pursuing him and is giving her hope by saying he also is into her. ",
            "If he acts on it, notify the college that he's abusing his position of authority by sleeping with students. ",
            "I'm not sure I agree with the community consensus on this.  People in close proximity often develop feelings over a period of time, and it's what we do with them that matters.  It sounds like he's not pursuing her at all and is not interested, despite his feelings, in anything.  The places he could have handled this better is 1. Being up front with you so you heard it from him, and 2. Not confessing anything to the student.\n\n\nHe doesn't go out of his way to se her. He isn't trying to hide it or play it off. He's acknowledged it and is taking steps to avoid it.  Short of quitting his job, I'm not sure of what he could be doing more to stay faithful to you.  Correct me if I'm wrong, but, isn't that exactly what you want in a partner?  Yes this situation hurts all three of you. But he's not even indulging in an emotional affair.  He's shut her down and is keeping his distance.   If we're taking the passion out of the conversation, that's a damn dedicated and dependable life partner.\n\n\nI think you two should have a ling, hard chat about this, probably in the presence of a therapist, and sort out why he only *used* to look at you that way.  I can almost guarantee it's not just because of this latest distraction.  The answer to that question will be key in determining your best path forward.",
            "OP, how long have you been living at your parents, the entire \"few months\" since you met with Sarah for lunch?",
            "Report it to the medical school and subsequently to any hospital they both work at or intern at.",
            "[deleted]",
            "Tell the university he works for. How could he said to her that he was into her instead of telling her off. What kind of professor so unprofessional getting involved with his student 10yrs younger.. what an AH.. its hard to believe that he really tried to stop his feeling.",
            "And why did you leave the family home, instead of him? I am so sorry that you are going through this, OP. This state of limbo is probably going to remain untenable for you and your daughter in the long term. Your daughter’s life has been completely capsized and she will need a long term stable routine to feel secure. She needs to know that you will be ok without him, so she can relax and know that she will be ok. \n\nI advise speaking to an attorney pronto. You may be forfeiting valuable rights that you may not even know about, such as abandonment of the family home, interim child support if you need it. Toys, books, your daughter’s access to beloved items and friends. I screwed myself into future generations by being intimidated into not pursuing an equitable division of marital assets and have forever regretted that choice. \n\nRight now your husband is living in a romantic bubble of inconsequence. Choosing when and how he sees his daughter, without worry for her emotional wellbeing? A visitation schedule could help visits to be more consistent and your daughter will know what and when to expect it. A 25? Year old student and a Professor with an abandoned wife and child is a terrible look. It is obvious his concern has more to do with his employment, based on his current sporadic time with his child. \n\nDepression is not only expected, it is more alarming if you weren’t! Make sure you are talking to professionals and not just us crackpot Redditors. \n\nApathy will neither win back your husband, bring him back to cold reality or help the future for you two *”I couldn’t heeeeeeelpppp it”* refugees. \n\nEither get that girl back in her home, or get your own and you two really make it your own. She can’t see you as being fragile and pining. I’m sorry, OP. Kids need us to show them the way back to emotional health and happiness. That does not include withering and hope is not a viable strategy for the future. Good luck, OP. You’re going to be ok.",
            "Please report it to his workplace. This is very unprofessional",
            "I was the young student in a similar situation. I also did not cross the line, but did mention my feelings in a very long text. We all worked together - he was our manager and I was hers.\n\nIn retrospective, I was groomed. It started innocently with forehead kisses from him and lunches together, then we all got drunk and he tried to sleep with us both.\n\nShe divorced him, and left the company. I left the company too, around the same time and cut contact with him. Also moved to another country. Her and I are now close friends.\n\nYour husband seems more innocent than the 'gentleman' in my story, but his heart is already gone. Never compare yourself, I'm sure you're an amazing woman yourself.\n\nIf he gets with her, he'll likely fall in love with another younger version in 10-15y. \n\nImo: leave the man - reconcilliation will come at a very huge cost for both of you that's only going to turn into resentment over time. This is all an excellent opportunity for growth, for both of you. You can still coparent like civilized adults and in time have a great non-romatic relationship with him.",
            "Derek and Alison had problems and then a Meredith was okay. Mer didn't know initially that he was married. In your case you didn't have problems. She probs knew he was married. This whole thing really scares me. Does it mean we should never marry good looking meb if we are plain Janes cz someone younger and good looking will come to wreck it? I feel so sorry for you and scared in general for myself.",
            "> I honestly don’t remember how I reacted then.\n\nThis is a BIG gap in this story, and may be missing context to his behaviour afterwards.",
            "I’m sure you’re an amazing beautiful person and If he fell in love with someone else so can you, if that’s what you want. At least go out have fun with someone maybe it will ignite a spark in you.",
            "Wait a min. He didn’t cheat on you physically. I think you should not have just left. Tried some counseling first since you have a kid.",
            "Op i am a bit worried too cause a guy who is willing to pretty much give up his whole family for a person he’s barely known is reminding me of cases similar to Chris Watts. It just sounds like a lack of empathy.  Please be careful.",
            "Many people are calling out OPs husband for not coming over to talk to her.  I think this may be a misread of his intentions.\n\nMy thought to his behavior isn't a lack of wanting to try -- rather, he may be respecting her choice to be alone.  He could be waiting for her to be ready to talk. \n\nI say this because this is exactly how my husband would react. In his head, he'd think he was doing the right thing by giving me space.  In my head, I'm waiting for him to make a move.  When one of us finally comes up and says something, we realize we wanted the same thing all along.\n\nOP, this is painful... of course it is.  But I don't know if I'd say your marriage is over.  Crushes happen. It sucks, but it happens.  Your husband should have been able to talk to you about it, but I'm sure you can appreciate how embarrassing it is for him.  You can also understand why he would want to hide it from you in the hopes he would deal with it himself and spare you any hurt feelings.\n\nIt seems to me like OP's husband has chosen his wife, but is struggling on how to move past this crush.  He needs to completely remove the crush from his life.  Whatever that takes needs to happen NOW.  You need to both work to rebuild your relationship.  I highly recommend the book by Dr. Gottman, \"The Seven Principles for Making Marriage Work\".\n\nThis will be a shit time but I do not see this being a marriage ender.  He could have handled it a lot better, for sure. But unless he is telling you outright that he is choosing her (or you decide for certain you cannot reconcile), then your marriage can survive this.\n\nWhat I know for sure is that you don't have to make those hard decisions now.  In fact, you shouldn't make such huge life impacting choices when your emotions are a battlefield.\n\nFirst and foremost, you need to talk to your husband.  You need to figure out if both of you want to try and make it work (this is a \"both in\" type of situation-- all of marriage is).  If you both do, counseling (couples and individual) is a good idea.  I suggest the Gottman method again because it is excellent at reminding us why we fell in love with our partner in the first place.  I can see how this would benefit both of you currently -- him to move past his crush, and you to forgive (in time).",
            "So he didn't actually cheat? He has a crush,? If I'm understanding that right he hasn't betrayed you yet. Crushes sometimes happen that doesn't mean the relationship is over. Get therapy with him.",
            "What’s wrong with ppl? Can’t they just stick to the one person they married? It’s becoming disgusting",
            "Talk to a lawyer to explore your options. \n\nI'd bet money this will be a fling where she plays with him for a bit then moves on so then he will try coming back. \n\nDo not take him back.",
            "idk man somethin is making my nose sting. how is there no prior contact but they’re in love with one another? you have to know someone in order to love them that’s kinda how it works… on the flip side though OP, learn to spend time with yourself because in all reality, that’s what most of life is. spending time with your SELF. you seem pretty stable, and at the end of the day this will all pass. wishing you happy healing my dude, people suck",
            "He is infatuated. He will have a hard wake up time when or if he pursues something with the student. They are in very different points in life, and unless the student shuts herself out, that’s not going to last.",
            "Fucking christ this just kept getting worse. Please focus on stabilizing your mental state along with caring for your daughter. I'm not saying you re unstable but working on self soothing not going down spirals is a good start. You got this, I'm sorry this happened.",
            "He’s not in love with a person he doesn’t talk to. That’s not what happens. She stroked his ego. First with the letter, then with the lingering looks. He got caught up. Not enough to cheat, but enough to catch feelings. That’s all. She made him feel wanted. Where you just left. With no discussion. So how much could you care. You say he didn’t chase you. Maybe he’s upset you didn’t chase him. Which confirms in his mind that the love is gone.  But Is it gone? No. \n\nWhat good is pride in love? What good is pride if you’re sad and lonely? Better to lose your pride and try. Then to lose your love because you were too prideful to try.  Be vulnerable, you don’t have anything to lose. \n\nDon’t let your man go without a fight. Especially if he didn’t cheat. If you still lose in the end you will not regret having tried. That’s the only thing you need to learn from this girl. Sometimes you gotta shoot your shot.",
            "*young teacher, the subject of -*\n\nSTING IF YOU DON'T SHUT UP I SWEAR TO GOD....",
            "My god! Your husband and his student are completely ridiculous. How are you going to be in love with someone when you haven't spent any time together dating etc.? How pathetic! They have to have a physical relationship, otherwise they wouldn't feel this way. He's waiting on you to file for divorce honey. Go ahead and call a lawyer. It's over, there's no point in dragging it out. I'm sorry this happened to you, but it's probably for the best.",
            "People don't choose their emotions. But they do choose how they act on them.\n\nHere are the facts as you've laid them out:\n\n- Your husband has a crush.\n\n- The crush is crushing back, and made it known. \n\n- He never acted on it.\n\n- He explicitly told this crush that nothing would come of it.\n\n- Nothing has happened for a year, despite the emotions still being there.\n\n\n\nDo you have any curiosity about his experience? What made this so different if you've been able to laugh about it before? Maybe this situation could be really confusing for him? If it's his student he's literally forced to be around her. Removing himself / acting against having her as a student would, in effect, validate the fact that she is a threat and something wrong happened when nothing has!   \n  \nOP, you can stop here and focus on the preceding content -- what follows is definitely judgy, it could be completely off and not at all helpful, I include as it may be relevant to his experience -- but it's up to you to find out.   \nWhen writing the above, I wrote 'What made him keep this from you?' yet removed it because by your own admission when you found out about him HAVING A FEELING -- you responded by leaving",
            "He's in love with the idea of this girl. She's hot and young and smart. He doesn't actually love her. He will learn that sooner or later. I actually think this is saveable. You have to try to save it or you will regret it for a very long time. I didn't try to save mine and still regret it. I was in his position though. He's lost his way, obviously, and he doesn't see you as his person anymore, but it doesn't mean he can't come back. It's a fked up situation OP and I feel for you truly. I just think the risk to reward ratio is very positive for trying to fix it. You will move on in much more peace knowing you did what you could",
            "Couples therapy. You can’t save the marriage if you’re not talking to him and if you’re both not fighting to save it.",
            "This is so sad! i hope god gives you the power you deal with this. It will only make you stronger. Lots of love ❤️",
            "I think maybe you should just have some communication with him. Tell him how you’re feeling and ask him where he is at…has he pursued anything with the girl as of yet or does he want to? Is he ready to abandon his family (you and his child) permanently? Perhaps his answers will surprise you. And you needn’t do anything but listen and think about what you learn. And you should take all the time you need with the information you glean and plan your next steps from there. \n\nI will say that I admire that your husband fessed up immediately. He did make mistakes but he also appears to have tried to do the right thing despite his wandering eye.  I’m not saying he is worthy of taking back if he would have you, but you do have a child together. And if you had a happy marriage prior to all this, it might be worth saving…it’s at least worth the discussion. Maybe there was something he wasn’t getting from you that will enlighten you (accolades, words of affirmation, etc.) that will help clarify how you guys got here and that can help you fix it. Some marriages have survived worse.\n\nSeems to me like you are both in a Mexican standstill where  no one is taking the reins to broach the subject so you are letting fate decide for itself rather than deciding your own fate.",
            "My god Reddit screams \"divorce\" for everything. \n\nChill. As per OP story this guy has NOT cheated - he is, as is human nature, attracted to someone he met and this attraction happened to be mutual. This sort of stuff happens DOZEN of times over the course of a 40+ years marriage. Chill down, folk. He has NOT cheated & probably he is in emotional pain. Marriages are not like in movies, marriages and satying in a marriage is a CHOICE.  And also one that requires a fair amount of work. IF op's story is correct this is not a divorce situation, not even by far. This is a \"we need more family time\" kinda situation.",
            "If you are absolutely 100% certain that he did not pursue the relationship with her, I think your HB did the best he could do. He didnt pursue it, even though this supposedly young, intelligent and beautiful girl was in love with him, and he was in love with her, he did not do anything. It is extremely powerful when a man has physical and emotional feelings for someone. It shows he has chosen to stay with you, even though he had such feelings for this girl. It also shows he has morals and seems to be a good father/husband.\n\nQuestions you may want to ask yourself. \n\nWhere does it say in Marriage that one must stay in love? \n\nHave you maintained yourself in the last 8 years so that you are still attractive to him? a lof of married couples expect this sort of loyalty and do not put in any effort to their appearance. \n\nIt is normal to have crushes on ppl, regardless of whether you are married or not. mostly this happens after the passionate/romantic stage has passed, typically 1-several years. The crucial point is whether that person acts on it. But he chose to stay with you, by all acounts.\n\nYou chose to leave him because he was honest about how he felt. \n\nOf course its upsetting for you, and im sure he does not want to hurt you either. You need to consider all possibilities.",
            "I'm not sure what he actually did wrong. He has feelings for another woman, not uncommon for people in relationships. He does not spend time with her and shut the notion of a relationship with her down already. Then he went on with his life until you brought it up. At which point he told you the truth. \n\nYou were hurt, and that's natural, but he didn't hurt you. You can't help feeling the way you do any more than he could. You acted on those feelings, he did not. Honestly, he sounds like a decent guy. But I think the relationship is over. \n\nI feel like your need to talk about it is for your own closure. Talk to him and tell him that. You deserve to get that closure.",
            "There is the possiblity that he actually would like to save the marriage but he is just too ashamed to even mention it. \nOr, he has given up on it. But both scenarios seem likely to me. \n\nIt's important to recognize that, if nothing really happened between them, then there's really no harm done. These things happen. Happily married people will sometimes get infatuated with other people. That's just how humans work.\nHowever, getting that and still deciding not to pursue it is admirable.\n\nI would simply ask him if he has any interest in salvaging this or not. If he does, and nothing really happened between them, then this seems pretty salvageable.",
            "Why did you move out so quickly?  If my wife packed up and moved out, I would take that as a bigger sign that our marriage was ending than me having a crush on another person at my job.",
            "I actually think hes not been as bad as you think. He has been trying to control his feelings. Obviously this hurts but it sounds more like an infatuation than anything and it will probably pass. You are his wife and family, I think maybe this could be saved",
            "I’m sorry your husband is an absolute idiot. He is in lust with this person not love. I am guessing g your husband has no idea what you do to keep your family together and take of the kids and house.  Stop letting him come over. He needs to take the kid (s). \nIf you want to work on this you have to know if he wants to as well. If he does he can’t stay at that job with this person around.\nIf you feel it’s over then be over. It’s time for you to go off on him. Let your feelings out. Say your peace. Oh and report him and her to the college. Home wrecker should pay. But only do this if you feel it’s over.",
            "This sounds like a good book in the other girls perspective, but in yours it sucks complete ass . Ik he didn’t physically cheat but he should’ve been honest about his feelings and told u the truth… I think u guys need to talk about it maybe try therapy",
            "Some people have crush but don't act on it. How was your relationship before that ? If it was bad that might explain why he didn't come with the 'love letter' story.\n\nHe didn't REALLY do something bad but the fact he is not actively avoiding the feelings mean there may be something more (wrong) to YOUR OWN relationship.\n\nWere not you somehow checked out yourself ? I get a weird vibe from this story. Not to say it would be your fault or something, but that it's not just 'he had a crush and hid it if you guys were unhappy for month / year'\n\nAlso you need to decide what you want. Going to your parents is only temporary if you have any plan of rebuilding the relationship. Otherwise he'll get with the student as long as it's legal for him to do so",
            "It sounds, to me, like your husband is a pretty passive fella. You, I'm guessing, are not.\n\nIt seems like you confronted your husband, aggressively, with \"showdown\" scenarios and you anticipated specific responses, but he's not quite wired to respond in ways that align precisely with your expectations.\n\nHe didn't cheat on you. He's aware and ashamed of the immorality of the situation. Had he pursued you, after you left, you would probably still be together.\n\nHe's just a man - fallible and full of flaws, just like any other and, sure, you're free to demand perfection from him, but where has that gotten you thus far?\n\nDo you still love him? Is this the storm that sunk your marriage? He feels a lot of guilt and, as I said earlier, he seems pretty passive. He'll probably go down with the ship without much protest.\n\nAre you content simply to watch?",
            "This is a heart breaking situation, to me it would even be worse than cheating with a random etc etc, but I honestly don't understand those who call your husband a dumbass and judge him so hard over this. \n\nThinking that you'll go through life without possibly meeting someone you have special chemistry with, however much you love your spouse is naive in my eyes. Not saying it happens to everyone, but come on. And with that, I'd say your husbands way of dealing with it, while not perfect at all, seems to at least have been trying to do the right things.\n\nTo me it sounds like this has been hard for both of you. You have to address it, though. \n\nAnd regardless, you should figure out who you are without him.",
            "You have been living with your parents since mid-December, during which time it was Christmas and New Year. \nEven if you are not a believer, it is a time when the family is together. Where was he when you were with your daughter at your parents' house? \n\nMaybe the affair became physical when you moved away and that's why he's avoiding the conversation? Your friend Sarah still works with him, has she noticed any changes in their relationship? \nOr better yet, did she try to talk to him?",
            "I can't even imagine how you must have felt when you realized your friend's suspicions were right. You have every right to be mad at him. I honestly think that you made it easier for him to start something with that girl by moving out, that's why he is not saying or doing anything. Honestly I think you are a very strong & resilient person. Your feelings are very valid. \n\nHe might try to come back later when he realizes what he has lost, you know once the honeymoon phase with that girl is over. Believe me, he will.  What will you do then?  You have enough time to think about it. It's very often like this with this kind of relationship. \n\nUse this time wisely, try to heal and focus on your little one. You deserve happiness and I am so sorry this happened to you.",
            "If he really wanted this marriage to work, he\n would change his job and not feed this crush.\n\nIs he in a relationship with her now? Are you divorcing? Talk to him.",
            "You’ve been gone 5 months and no talking about anything? Have you gone to a lawyer yet? You should have never left the marital home, he should have. Please snap out of this, your marriage is over, and start protecting you and your daughters interests. Get a lawyer.\nEdit: adding, with your lawyers permission, I would maybe consider maybe filing a complaint with the university. Food for thought. Oh, and I would file for divorce. I’m sorry OP.",
            "My heart breaks for you. I’m so sorry. He’s definitely TA!",
            "Join support for the betrayed subgroup you’ll get better responses from people who have actually experienced something like you",
            "She needs to meet your daughter and see you with the heartbreak showing in your eyes. Why did you move out instead of him. You’ve made it too easy for him. The hospital needs to learn about it too.",
            "So what it this guy do wrong exactly?",
            "Love ebbs and flows. When it ebbs do loving acts for one another. It uses your body to trigger your emotions.\n\nLet me tell you how to pick up a man, any man. \n\nIt’s called the “look, look away”\n\nYou look at a man you find attractive and he catches you looking, you look away. You look back at the man he catches you looking, you look away. Now you wait longer before you look the next time and you look again, he’s already looking at you, he looks away. You look back again he’s already looking, you smile, he looks away. Next time you look around guess who’s beside you? The guy you liked in the first place. I can tell you from experience it has a 100% success rate. I can tell you from watching my friends experience (who would not be considered conventionally attractive) it has a 100% success rate. \n\nYou let her flirt you out of your own marriage. You didn’t even fight. \n\nI found your post so upsetting. I kept thinking about it all night. \n\nShe pulled a look, look away on your husband. It’s not love. It’s psychological warfare. I loved psychology in school and as a doctor I’m sure she used psychology to her benefit. \n\nDon’t give up because you’re sad. Now is not the time for sadness. \n\nI hope you can work it out with your husband and find your way back to love. When he comes over look, look away. Start going out together. Do not let him start a relationship with this sneaky snake.",
            "Start dating an extremely good looking guy and watch him lose interest in his meredith. He’s just going crazy because she expresses her feelings first and probably makes him feel young and in love again. No matter what happens don’t get back with him. Be Addison literally",
            "wtff!!! thsiis heartbreaking. i am so sorry. just think that you are a professional, successful and show him that you are independent, matured, and already empowered. plus you have a kid with that fckr. Typical example of a guy that you've been with from the start and then just replace you later with someone younger and \"nicer\"",
            "I dont see grounds for moving out. Anyone can crush on someone else while being in a relationship. It usually means a need isnt met and he should have communicated that but in most cases the person isnt quite aware of the fact that this need exists or they knew and thought it will resolve after a while. \n\nIf he is to be believed he never acted on it and judging from your reaction it seems he was right in not telling you about it although i strongly believe a relationship should allow for crushes to be confessed and the underlying desire to be worked on. \n\nIt would require a lot of work on his part though and i feel like thats what the future of that relationship should actually hinge on",
            "So hé is human. He can fall in love. You can fall in love.\nWhat matters it how he deals with it. \nBy Your reaction by packing right away I understand him,  he didn't talk to you about this.\nHis only crime is that he is attracted to another human! \nYou're not a forgiving person. And why is that? \nI was long ago in this same situation. Head over heels in love with another women.\nI had to make a tough decision. And a did. But we did overcome it, even when she betrayed me in that period.\nWe still are together. I still love the other wome. She's till  has a warm place in my heart.",
            "Why did you walk out on him? He wasn't unfaithful, clearly he had a lot of respect for you hence not cheating.",
            "[removed]",
            "He can’t be in love with her if he doesn’t know her. He’s in love with what he has made her out to be in his mind… which is just everything you aren’t. I’m not saying that to hurt you - if he is smart, he’ll\nRealize he’ll be way happier with you. Hell realize she’s just beautiful and he’s starting to feel his age- so when a girl like that shows interest, the way he acted is almost commendable. He is going against his nature being monogamous and loyal to you. His brain is telling him on the most innate level to go procreate with that perfect physical specimen. Ironically. If you just let him have sex with her once, she’d likely be disappointed, he’d get some post nut clarity. And he’d be more sure than ever that you are his future!",
            "The root of your current problem isn’t him being infatuated with her, but him being checked out of your relationship for a while now. He has not emotionally cheated, however he would not have been infatuated with her with had his relationship with you have been stronger in recent years.\n\nIf you want him to come back, I think you need to recognize that he’s not the only person who has messed up this relationship.",
            "Oh sweetheart, you know your relationship is done and you need to move on with divorce.\n\nYou need to confront the elephant in the room and you need to find out if he has pursued her since you moved out.\n\nPresumably she knew he was married when she gave him that letter. I would be contacting her telling her what a POS she is and possibly the hospital too.\n \nEdit Change college to hospital\n\nETA if they get together she will be his AP I know not in the traditional sense, but she's the reason you've broken up.",
            "He probably wasn't in love with her until he read her love letter. You have to talk to him, it's taking too long.\nWhat do your parents say, and if your daughter doesn't ask why you don't live with dad anymore",
            "Send him a [link](http://evaapp.ai) to Eva AI sexting bot, just for a hint, and leave. You shouldn't be living in hell",
            "Your husband should have lied to you, become more conscious about his yearning looks, and you should forgive him."
        ]
    },
    {
        "post_id": "niaytx",
        "author": "jrkong",
        "title": "My [26m]'s girlfriend [24f] wants to break up because of my disability",
        "url": "https://www.reddit.com/r/relationships/comments/niaytx/my_26ms_girlfriend_24f_wants_to_break_up_because/",
        "score": 2366,
        "num_comments": 330,
        "created_utc": 1621658824.0,
        "selftext": "Hi all, honestly I know how this is probably going to go but I wanted to make this post to get other people's opinions and maybe get some help so I know what I can personally do better to avoid something similar in the future.\n\nObligatory I'm on mobile so please be lenient.\n\nI've got cerebral palsy that affects both my legs and one arm. That's my official diagnosis but what you really see is I walk with a limp. I'm a software developer so job wise, I don't have any issues. I knew when I was a kid that using my brain is the best way for me to survive on my own without relying on other people. I haven't had the chance to get my driver's license but according to therapists and doctors that shouldn't be an issue. That's the background about me.\n\nMy girlfriend and I have been together for a year. We met back in April 2020 of last year and we decided to get together in May 2020. I told her about my disability before then but she wanted to try and make it work. We video call on discord every day almost always when we're awake and recently we've been going on dates. She's more then happy to lend me an arm and she notices things about me that even I miss myself. Outside of my family she's the most loving and caring person I know and she's my motivation to do better and improve myself. Honestly, I never thought I could find someone I trusted enough to share my more negative thoughts and problems. I always tried to seem happy so I don't worry others. The emotional support she gives me is really irreplaceable.\n\nThe problem is is scared that, in the future she will have to take care of me or most of the work will fall onto her. To make matters worse her mom has been telling her for the past few weeks to break up with me because she can find better and she doesn't want her to have the burden of caring for me. She's also really afraid that I will get arthritis early due to my cerebral palsy and if that happens, a lot is going to be on her.\n\nI've tried doing things like stretches and exercises to maintain and improve my muscle tone but she is still afraid I'll get worse. \n\nReddit, please help. I'm an introvert I don't know a lot of people and honestly I don't even know the options I've got to look at. I want to prove that I can be independent and that if things do go wrong, it won't just be on her. I'm in Ontario Canada. Are there things I can look into and do to assist with my disability or things I can look into so if things do go wrong, I won't be a burden on her?\n\nPlease Reddit, I'm at the end of my wits. I've never really hated my disability but I've always kept myself going by being tempering my expectations and thinking, \"my disability is going to make it really hard to find someone\" and she's the first person to make me feel like \"ya, it doesn't matter\". I want to do anything to show her that I won't hold her back in the future but I'm out of ideas. Is there anything I can do?\n\nI don't want to worry anyone I'm with with these issues but I'm at the end of my wits. Please Reddit, I need ideas. I don't even know if my relationship is lost but I don't want this to happen again and I want to know what I can do myself so I can reassure my partner so they know I won't hold them back in the future.\n\nHas anyone had similar experiences? Maybe there are resources that I can tap into? I don't know if there are things I can look into to better plan my future so it's not a concern \nfor my partner. I really need help. \n\nThe worst part is, I've always thought my disability doesn't matter. But with all of this happening it's really hard to convince myself otherwise. \n\nTL;DR I've got a permanent disability and I don't know how to reassure my girlfriend that I can handle myself in the future.",
        "permalink": "/r/relationships/comments/niaytx/my_26ms_girlfriend_24f_wants_to_break_up_because/",
        "comments": [
            "Ok I can see I'm gonna be the outlier here but I'm not sure this is actually about your disability at all, at least at the core of it. I'm reading a lot of things that tell me you are overly dependent on her emotionally. \n\n\n>Outside of my family she's the most loving and caring person I know and she's my motivation to do better and improve myself. Honestly, I never thought I could find someone I trusted enough to share my more negative thoughts and problems. I always tried to seem happy so I don't worry others. The emotional support she gives me is really irreplaceable.\n\n\nThis can be great but if she's the only person you are sharing your negativity with it can also be a lot, and just because she's a caring person doesn't mean it doesn't affect her. You have said stuff like you don't have your license (why not? Who drove you places before? Does she drive you now?) And that she's the reason you smile (being responsible for someone else's happiness is a huge burden). I suspect that she's already feeling some caregiver fatigue from the emotional stuff and having her mom whisper in her ear that you may someday need physical help as well is just a bridge too far for her. Hypothetically getting arthritis early because you have mild cerebral palsy which manifests as a limp just doesn't sound like a serious deal breaker to me if someone is really into you. \n\n\nI would say that in addition to being proactive about your condition, you need to get a larger support network so she's not your only emotional outlet. If you can't talk to anyone else about your problems, hire a therapist. I also think more independence (getting your license, moving ahead on buying that house, etc) will show that you are and will be capable of handling your own shit when the time comes more than taking her to talk to a specialist or something like that.  Besides my gut feeling is that this particular girl is probably not worth chasing after (not that she's not worth it but that chasing after someone who isn't into it anymore is a losing game). These lifestyle changes will make you much more attractive to the next person that comes along and less desperate to keep them.",
            "Are her fears valid? If these are real possibilities, and she is unwilling to take that on, then there is nothing you can do.\n\nIf you think her fears are unfounded or unlikely, then maybe sit down with your OT or SW and have them explain prognosis, occupational potential, etc. \n\nI also wonder if your negativity might be giving her doubts. If you unload on her a lot, cool it. You might be making her feel like more of a nurse maid than a gf, which may be priming her anxiety about looking after you. If she sees that you are independent and resourceful in having your emotional and physical needs met, then she might be less anxious about it all falling on her. Otherwise you are making it impossible to see your disability as anything but limiting.",
            "My husband is 28 and has mild cerebral palsy, all four limbs are affected but like you, he just has a limp and can do pretty much every thing I do except from running and climbing ladders. He drives, swims, works out, goes on walks and takes care of the house... His disability doesn't affect me at all. \nI would say, the first thing I would do would be getting the help of a stroke specialist to make sure you're getting cared for. Husband is getting supportive care to minimize the effects of his posture on his joints : physical therapy to stretch the muscles he doesn't use, and he's going to get botox soon. If you can, swimming is probably one of the best things you can do. Cerebral palsy itself is not going to get worse as it is not a progressive disease but the joints might be painful as time passes.\nHonestly caretaker burnout is a real thing but I'm not sure this is the scenario here. I'm guessing you were born with it, and from what you're describing you sound absolutely functional and not relying on her for anything as of now. I had some disability related anxieties before marrying husband and maybe I'm naive but it seems like the worst case scenarios for the future were just that, worst case scenarios. I'd rather spend my time now with somebody I love.\nIt's not because you have a disability that you aren't capable of being a great, valued life partner. I would be cautious of anyone who would make you feel like you are less than...",
            "Specialists are great and all, but I would also look for support groups for people with cerebral palsy (and maybe see if there is one for partners of people with cerebral palsy). Specialists can give you an opinion based on the literature but other people with your condition can give you actual lived experience, and that may be even more valuable.",
            "Hi, fellow disabled person here who has been through their fair share of relationships. So trust me when I say that there are plenty of people who see your disability and love you anyway. And I say see your disability and love you anyway because it is a big part of your life and it should matter to you and to your partner. You are still so young, there’s a lot of people you haven’t even met yet who will love you platonically and romantically, if you allow them in. As for your situation, it’s complex to answer so I’ll do my best to be succinct.\n\nThere’s a lot more to consider other than developing/maintaining independence as a disabled person. I always say everyone has their shit. Anyone you get into a relationship with has some kind of baggage whether it’s health related or not. The sooner you (and maybe your girlfriend) accept that a caring role is part of all relationships, the better. Everyone needs help sometimes whether it’s because of a disability or just because life is hard. \n\nA good starting conversation might be about why she is so concerned about the potential decline in your healthy right now and the potential of taking on a heavier load of caring. And more important than that, what can both of you do to keep a balance in your relationship. For example, you are a software developer, you said job wise you’re fine. Long term, should your health decline, would you be able to hire a personal/care assistant to remove that pressure of requiring care from your girlfriend? Or are there other areas of the relationship you could take on larger responsibilities to “even it out”?\n\nRelationships are difficult to navigate on a good day, but the added complexities of a disability are not things that people necessarily consider when getting into a relationship. You said you met in April and got together in May. Having done that same really fast turnaround from meeting someone to being in a relationship, it’s really hard to know someone well and to know the intricacies of a disability and what it entails. Also, a lot of research says it takes 2-3 years in a relationship to really know someone, and I imagine it’s the same with someone’s disability and how that is going to affect life and the future.\n\nThere are a lot of questions you need to ask yourself as well, and it’s really hard to look at your own situation through an objective lender and take a pragmatic approach, but sometimes it’s necessary. Why are you clinging to this relationship? Fear of never being loved again? That only happens if you allow it to. Where do you stand on loving and accepting yourself fully? How does the future look if you remain in this relationship? Consider how it would look if your health/independence declines. Would you be happy to be with someone who is so focused on your disability and potential long term health issues? Would you be happy to be with someone who may resent you for needing care?\n\nMaybe a therapist or local support group for other people with cerebral palsy would be a good place to start. I think the support group would be the best place to start, make some friends, hear from people in similar situations, hear from their friends, families and partners about how they’ve worked through issues. There may be some online resources if you search hard enough but I know myself that disability and relationships are a hard topic to find information on. A starting point might be a local hospital, they may have resources or specialists that can help.\n\nI wish you luck on the journey of figuring this out, it can be a lot to unpack, so I hope any of this resonates or helps.",
            "It’s a bit of a cliché that men find their sole source of emotional support in their partner. You’re experiencing why that’s a bad idea: you’re terrified to lose her, you put her on a pedestal, you seem to think she’s the only one capable of giving you that support. \n\nIt’s one thing to be an introvert, it’s quite another to be “terrified of meeting people”, as you mention in the comments. I’m an introvert myself, but I’ve got plenty of friends whom I can rely on for all kinds of support, and I actually like to go out and meet people. Is it possible there’s some social anxiety there?\n\nYou’re thinking about ways you can manage your disability in the future in a medical sense, and it’s great to be informed, but imo it’s equally important that you widen your support network in other ways. It’s a lot to put on just one person and it’s going to be tough to maintain a balanced relationship if one party always bends over backwards to prevent losing the other. \n\nI’m speaking from experience - I used to date someone who was incredibly clingy, because apparently I was the first person he felt he could really be himself around. He claimed he’d been to therapy but that it “didn’t work”, then proceeded to treat me as a therapist! It was exhausting. Try not to be like that.",
            "Heya, I'm normally not a quote loving type of lady, but I read this one last month, and it really stuck with me:\n\"You'll never have to negotiate your way into a heart that wants you there.\"\n\nIf she feels like breaking up, break up. Try to investigate why you want her so badly, is it because she is truly an awesome person, or is there a part of you that is afraid to never be in such a relationship again? And try to be critical on both reasons too! Are they really true?\n\nI truly believe you are deserving of a partner that chooses you 100% No doubts, no \"I love you, but...\"s\nShe is not and will never be the only girl that will want to be with you and provide emotional support. That's a girls thing.\nHer breaking up with you also does not mean you are worth any less, it says something about her, not you.\n\nSo good luck. I hope you will keep on taking care of yourself, and realize you deserve the best. X",
            "Would it be possible, or worthwhile, visiting a Dr/specialist with her who can explain better your disability and what is/is-not likely to happen as you get older? It sounds like a lot of this is coming from her Mother who is almost certainly ignorant and has no idea what she's talking about yet is influencing your daughter with worst case scenarios.",
            "I'm so sorry you're going through all of this. You should let her go if she wants to go. Being a carer is... draining, in not ways than one. \n\nBecause this is a you thing, you NEED to be 150+% proactive in your care. You can't coast this. You have to think if this will impact you 10, 20,, whatever years down the line. If you have kids, to you wan them to be your carers? Do you want your partner to be your carer? \n\nI know you're worried about her right now, but I'll counter that you need to worry about yourself instead. Take steps now, be fucking proactive in your healthcare, right now, to make sure you are comfortable in the future. And that hopefully that your (future) partner will also be comfortable.",
            "There is a lot going on here. Just some basic things to establish first:\n\n1.) Having a disability does not make someone any less \"valuable\" a human or a partner. It is not something that needs to be forgiven or excused or made up for. Sometimes it needs to be worked around or can block certain paths, but doing so should not imbalance a relationship.\n\n2.) Some people are not up for the work of navigating disabilities. Or they will not accept the closing of certain paths. That is okay and does not mean that they are assholes. There are millions of different configurations of disabilities and work-arounds, however, so part of the work can actually be figuring out what the work-arounds are and if there are acceptable options.\n\nIt seems to me like, on the surface, your girlfriend is increasingly aware of the work of navigating the disability and taking on the burden of figuring out possible future work-arounds. Simplistically I could tell you that you should take over the work of figuring things out for her. You can research care options where professionals would care for you should you become more severely disabled later, etc. You could provide clear instructions for her in terms of what she should do to help you and to not worry about the rest. \n\nHowever, I suspect that the issue is not just the logistic/care problems that do/might result for your disability. It sounds like you have had ample opportunity to bond without the relationship being very serious yet. You are now meeting and moving the relationship to the next stage of seriousness while your girlfriend simultaneously encounters the reality of your disability for the first time (from my understanding you just started seeing each other in person). My interpretation is that she already cares for you a lot, which is why she is so frightened. She feels pain when she sees you struggle now and is afraid of increasing her commitment to you and committing herself to pain for life. She is researching your future because she is thinking about what her future will be like by your side. And she is imagining caring for you because she does already care for you. However, the reality is that everyone grows old. And men usually die before women. Many men go suddenly with a heart attack. But any partner she has could get cancer or Alzheimer's or even be in a disabling car accident. She cannot opt out of that type of pain by choosing a partner who is seemingly healthy when young. This is the pain of commitment, and your disability is simply making her confront it earlier on. While it is totally valid for her to not be up for the day-to-day reality of your disability, I would personally want to talk with her about the idea that her anxieties actually stem more from fear of commitment than from a specific aspect of your relationship. If she feels that is possible then she should explore the subject further with self-help books, a therapist, TED Talks, her religious council, or whatever else she uses to make sense of herself/the world.\n\nOn your side, I see a lot of language that suggests to me that you have self-esteem issues with your disability/discomfort with it. The phrases that jumped out at me were:\n\n> I knew when I was a kid that using my brain is the best way for **me to survive on my own without relying on other people.**\n\nBut everyone needs to rely on other people. It is okay. It does not make you weak or a burden. No man is an island and all of that. And accommodations do not have to be other people, and even when they do, it does not have to be in a social context. Deaf people sometimes hire interpreters. Are they a burden to those interpreters? Certainly not. They are their employers. Do they rely on them? Yes. Does that make them any less valuable as human beings or any less worthy of love? Heck no! But even if you have to rely on your friends or family or coworkers in some way it is okay. Do you look down on people who rely on you? I doubt it. My guess is that you are holding yourself to a different standard.\n\n> I told her about my disability before then **but she wanted to try and make it work.**\n\nThis sounds like the default assumption is that the relationship could not work because of your disability. It also suggests that the mere fact of the disability would be a satisfactory reason for anyone to not want to have a relationship with you. Again, it is totally fine for someone to not be up for the work that comes along with a given disability, but the mere existence of a disability is a shitty reason to nix a relationship.\n\n> She's more then happy to lend me an arm and **she notices things about me that even I miss myself.**\n\nShe has only seen you in person a couple of times, right? You have been living in your body for 26 years. Do you try to distance yourself from your body/the world around you? You should be well-integrated with your body and the physical world. Physical, social and emotional pain might have all encouraged you to live inside of your head and avoid your body, your disability, and the world around you. But that is not being a healthy/well-adjusted adult. It is probably time to start doing some hard work getting to know your body and disability and loving yourself with your disability/body as an integrated part of your identity.\n\n> Outside of my family she's the most loving and caring person I know and **she's my motivation to do better and improve myself.**\n\nIt seems to me like you care for her and she cares for you, and that is what is enabling you to care for yourself. You should work with a therapist who specializes in self-esteem and disability issues to figure out how you can love yourself for yourself instead of for someone else.\n\n> Honestly, I never thought I could find someone I trusted enough to share my more negative thoughts and problems.\n\nI don't know how negative your thoughts and problems are, but if they are very bad, then you should be working on them with a therapist. If they are not very bad, then you should be working with a therapist on trust issues. A girlfriend is not a mental health professional (even if that is her job, because her relationship with you would mean that she should not treat you). If you have emotional baggage that you have been carrying around then you need to bring it to someone who has training and whose job it is to help you unpack it.\n\n> I always tried to seem happy so I don't worry others. \n\nStop doing that. Go watch Inside Out and see what sadness is for.  You deserve actually happiness as much as anyone else. And the people who love you *want* to worry about you when they need to.\n\n> The emotional support she gives me is really irreplaceable.\n\nIt is actually replaceable. It might be unprecedented in your life, but even if your relationship continues it needs to be replaced/augmented. You were trying to be your own support system before, and you have now found someone else who you are willing to let support you. But that is still not enough for you, and it is not fair to her. What happens if you break up? Is she not allowed to break up with you or you collapse? Or what if she dies? It is okay to rely on other people, but it is not okay to only rely on one person. Replace her support by 1.) stopping pretending you are happy and let other people in your life know when you struggle and 2.) working with a mental health professional on letting go of emotional baggage 3.) trying to love yourself so that no matter where you go or what happens to you you will have someone who is in your corner (bonus! People who love you don't have to fight against you to take care of you!)\n\n>  To make matters worse her mom has been telling her for the past few weeks to break up with me because **she can find better** and she doesn't want her to have the burden of caring for me.\n\nDid your girlfriend tell you this wording, or did you supply it? Whoever created that phrasing is being very shitty about your disability, and if your girlfriend repeated that phrasing to you then that was very shitty of her. What does \"better\" even mean? Your girlfriend could probably find a boyfriend who does not have CP, but that does not mean he would be \"better\". You should do a quick sanity check in terms of who believes that, including yourself. Try to avoid having people in your life who believe that, and if you, yourself believe that a boyfriend without CP is synonymous with \"better\" then I again point you to therapy.\n\n> \"my disability is going to make it really hard to find someone\" \n\nJust a word of encouragement here - Lot of things make it harder to find someone, including being gay, having a high IQ, living in a rural area, being into kinky stuff, not wanting kids, wanting 15 kids, and on and on. You are a unique person just like everyone else. It is hard for EVERYONE to find that one special person. If what you are in the market for is a committed monogamous relationship then it does not matter if 75/100 would be viable candidates or 1/100, you would only be in a relationship with one of them anyway. If you have a smaller potential pool of matches it just might take more time or online dating etc. So, you are a little bit late getting started with dating compared to your peers? It is not a race. Most of them are still sorting through a bunch of bad matches that only seemed good on the surface. Maybe you are lucky that the surface stuff weeds out a lot of shitty people from your life.\n\n> I don't know if there are things I can look into to better **plan my future so it's not a concern for my partner. **\n\nYou should plan your future for yourself. You owe yourself good healthy, safety and security. Whether or not you have a partner. I am sure that there are many resources for disability support in Canada, but r/relationships can't help you with that directly. You should look up forums specific to that or community groups near you.",
            "Do you take care of yourself and your surroundings without any help? Would you be able to take care of a child without help?\nIf she has marriage and children in her vision for the future, then she may need to see that you can contribute fully.\n(The reason I ask is that you state that you don't have a driver's license, so I assume you get some help from others)",
            "Hey OP, my mom has cerebral palsy and it affected the left side of her body. Her muscles would tighten on that side constantly. She walked until she was 33 and then she wasn’t able to walk anymore. The cartridge in her hip had wore away and she was in a lot of pain. For 2 years she suffered (US health care) and she finally found someone who would be willing to take her hip out. She is in a wheelchair but still really independent. \n\nI don’t say this is worry you, but more to show you that stuff can change. I know people with CP can have varying degrees so I can’t compare yours and my moms. Also, I’m sure medicine/treatment has changed too. This was 15+ years ago when she had her hip taken out. \n\nSomeone commented above about finding someone who accepts you for you-no doubts and I find myself wanting to agree. I married my husband in October. In December he was diagnosed with Psoriatic Arthritis. I was like shit, that sucks. What do we do? I didn’t think oh F and bail.",
            "Maybe I'm a little callous, but if someone is threatening to leave then you let them go. There are other fish in the sea. You sound kinda desperate to make her stay, that kind of imbalance in a relationship can never be healthy in my eyes. Also why don't you have your license at 26, and why is your gf trying to leave you over a limp? Sounds like you have a lot of things to work on, focus on yourself and not someone else. You should be working on building yourself up, not worrying about someone who doesn't see your worth.",
            "I voted so someone more qualified than me gets to read your post. At least you re a super sweet person man i hope you can find a solution",
            "[deleted]",
            "Wow dude, reading through your responses is terrifying. You seem to know next to nothing about your condition, are not seeing any kind of doctor or specialist, are not in any kind of treatment or management program like physical therapy  .... that's terrifying. \n\nThat's a red flag the size of Seattle with the words printed on it \"I don't take care of myself, guess you'll have to wipe my butt for me in a decade or two.\"\n\nYou need to take some responsibility and show some maturity here. It sounds like you haven't even seen a doctor since you were a kid, that's just ... wow. Reckless and irresponsible.",
            "My father is disabled (blind) and has been his entire life. This means that my mother has had to do a lot for him and us, including the very significant task of being the only driver in the family until my sister and I grew of age. \n\nIt will change her life to be married to someone who is disabled. If I were you, I would go to a specialist and ask all of these questions to them. Sit down and really understand what the next 10, 15, 50 years are going to look like. Then, you can start to prepare now, as well as prepare any future partners about what this will mean.\n\nThis will set you up for better success dating, because you'll be able to explain to them and help answer questions or quell their fears. At the same time, you are giving them the option to not date you if they are not okay with this. Your girlfriend might not be okay with this, and that's fine. It's heartbreaking, but it's reality.\n\nListen. My mother has had to sacrifice a lot being married to someone who is disabled -- but guess what? My sister married someone who is an alcoholic and I married someone who has Major Depression. Nobody's perfect. You'll find someone who's down with the whole package. Don't worry.",
            "I know I one day have to take care of my bf, since he has a progressive disease and I will lose him on an early age. (Unless life really hates us and one of us dies before that)\nI knew what I was in for when I started dating him, and I choose every day to love him and stay with him. Ofcourse it's a hard choice, and she has every right to decide if she can handle it or not. But if yours  is not progressive, and you can stay self reliant, maybe get the two of you to talk to a doctor to really understand your disease and prognosis, and the possibilities of help from others if you do get more sick. Let her first really know the chances/options, and show how much you want to make things as easy as possible for both of you. At least, that's what i'd do and im currenly working on with my situation.",
            "[deleted]",
            "I dated a woman with cerebral palsy for about 6 months. We broke up for reasons unrelated to that particular disability (she later told me she was dealing with undiagnosed and untreated bipolar disorder at the time I knew her and that was why we had so many arguments/why she treated me the way she did). \n\nShe was about your age, used a wheelchair most of the time, and occasionally would use crutches. She could not walk without support. Her mobility aids allowed her to be completely self-sufficient. I didn’t manage her disability and she didn’t involve me in discussions about her medical history or appointments outside of teaching me how to break down and reassemble her chair. Quite frankly, it never concerned me, outside of things like making sure to consider accessibility whenever I took her on a date.\n\nShe was more physically fit than me and got around faster than me. She was extremely intelligent and a talented writer. She had the most beautiful smile I’ve ever seen. She laughed at my stupid jokes and watched my silly superhero movies and shows even though she couldn’t have cared less. Those are the things I admired and cared about her, not the fact that she had a physical disability.\n\nYou deserve to be with someone who loves you as you are. Who when they think of you, they think about your charming personality and how they love spending time with you and how handsome they think you are. Who doesn’t look at you like a looming burden. Who admires you and loves your body and your mind. Who is prepared to go through whatever challenges the future may or may not bring.\n\nYou’re not going to want to hear this, but you need to distance yourself from her and probably end the relationship altogether. It’s not working for either of you and your level of codependency is unhealthy. You should not be using a girlfriend for the emotional support you should be getting from a therapist. I’m not saying you have to hide your problems and be fake, but if you’re talking for hours a day and unloading all your negative thoughts on someone else, that’s too much. Get some talk therapy.\n\nAnd don’t use other people to make yourself feel motivated. You need to cultivate some intrinsic motivation. My goodness man, you are important! The only person in life that you are guaranteed to spend the entire rest of your life with is YOU. That is by far the most important relationship you will EVER have. Develop it!! Learn how to be okay emotionally and mentally outside of a relationship. Make other friends. Don’t tell me you’re an introvert so it’s too hard. I’m an introvert too. I put myself out there and got uncomfortable and let myself get hurt sometimes in my vulnerability and eventually over the years I met a couple of really amazing people that are as close as family. You have discord and internet access and can leave the house too, so no excuses. \n\nTake care of yourself for you. Engage in hobbies. Go to meetups. Get an education (there are free classes online on places like edX and Coursera). Work. Volunteer. Exercise. Eat food that makes your body feel good. Get fresh air. Get a therapist. Stop faking happiness and learn how to improve your mindset. If you have a mental health issue, like depression, see a psychiatrist. \n\nWhen you are in a good place, you will be more able to discern what relationships to keep and which to ditch. You will no longer cling to unhealthy or toxic situations out of fear. You will know that if someone isn’t enhancing your already fulfilling life, you don’t actually need them. You will be able to choose people to be around out of a place of love and joy, and not desperation or loneliness.\n\nYou seem like a really good guy who just needs to prioritize himself more, disentangle from what looks on the outside like a codependent relationship, and seek out new people who don’t see his disability as a burden. Those people are out there. Don’t waste your life clinging to someone who wants to leave.",
            "Hey, maybe try asking your treating doctor for some resources to a social worker for stuff in your area. Perhaps joining groups for your specific disability can help you connect with others. Take care, you got this.",
            "Hi OP, I'm really sorry to hear you're in this situation. One thing that occurred to me is that you're only in your mid twenties, and this is your first girlfriend.   \n\n\nIf she wants to break up with you because she's worried about having to become your carer in later years, there's not really a lot you can do about that. I agree with the poster who talked about 'finding your way into a heart that wants you there'. When (not if) you meet somebody who loves you, they won't let anything stand in the way of the two of you being together. That's what we do when we love somebody, we accept them alongside whatever else they come with - whether that's the fact that they have an ex-wife, children living with them, or a disability. I'm not denying that it may be harder to meet someone in you have a disabiilty, and I think that's part of what's driving your fear here. You're worried that if she leaves, you may never meet anybody again, right? But you've already had love once, so why wouldn't you be able to meet somebody again? That's the thing about relationships: relationships teach us to have relationships. Sounds weird, I know. Now that you've had a good relationship once, and have experienced what it can add to your life, I think that when you have your next relationship you'll have learned how to open up, and what that adds to your life.   \n\n\nYou sound like a great guy and a good catch for anybody. I think you deserve somebody that will accept you as you are. I think in a relationship, if you're seeking a lasting relationship that is, you want somebody who's 100% in for it, not somebody who's maybe 60-70% in for it and who has quite significant reservations about you or what the future may hold.   \n\n\nWishing you all the best OP.",
            "My ex was deathly allergic to all nuts. We broke up for unrelated reasons and since then I have realized how much responsibility for his life I was internalizing. To the point where the mental load was so taxing and affecting my overall well being that I sought mental health treatment.\n\nMeanwhile he was all non-chalant and whatever about it.\n\nI'm not sure how this helps you other than seeing it from the other side.",
            "> I've always thought my disability doesn't matter\n\nYou thought or are you sure? You don't seem sure. I'd suggest learning more about the condition and future possibilities. Do the research.\n\nAs for your girlfriend, she deserves to know the full picture. And if she decides to leave, it's okay. I am leaving my partner because he wouldn't get therapy despite existing trauma that doesn't let him open up to me. I know I don't wish to handle the secretiveness and lack of communication in my life ahead and similarly, she might be realising that taking on the role of a caretaker is not what she wants down the road. You are probably the love of her life but she gets to choose what she wants. If this was after years of marriage, my views would've been different. Considering both of yours age and relationship period, it's okay. You focus on yourself for now. She'll stay when she sees you're capable of ensuring her peace of mind.\n\nYou can look into buying a health care plan that will ensure homecare in the future. And also, talk to her about how you'll be responsible for yourself. Better, show you're responsible by - doing your research, saving up for future health care, being there for her the way a man who respects her should and would.",
            "Okay, so while I am disabled too, feel I can’t really speak to that aspect here because our situations are so different, but there is another thing that struck me. \n\nHer mother is pushing her to break up with you. That really seems to be the bigger issue here. While she may have adopted her mother’s concerns for now, that’s not necessarily forever. \n\nAbout eleven years ago I was dumped by my now spouse because their mother was pushing so hard for it. They succumbed, and then regretted it. I forgave, and now I have no regrets (but some sizable MiL-problems). \n\nNot saying it will play out like this for you, of course, just reminding you that mothers have the power to be temporarily very, very convincing, even about things we disagree with.\n\nLots of people gets arthritis early. That is probably not the real issue here - it looks a lot more like a MiL-problem.",
            "Might I suggest finding a support group of people with cerebral palsy that includes members who are in mixed (abled/with disability) relationships or marriages? It would do you both some good to have friendships with people who understand what you are experiencing. They would be able to inform you of the challenges and successes of being married with a disability.  You can’t imagine a future that you haven’t seen.",
            "> We video call on discord every day\n\nDo you not meet in person?",
            "So there is a lot going on here. You sound as if you have room to improve:\n\n1. Your motivation and disease maintenance. (Muscles atrophy if they aren't worked.)\n\n2. Your plan for life/success with or without a partner.\n\n3. More friends. You can game and meet more people on line. Join groups.\n\n4. With all due respect, are you holding on to hard? Clingy?\n\nYour girlfriend:\n\n1. Her mom sounds like a big issue. Is this person toxic?\n\n2. Her age/place in life. Is she ready to settle down?",
            "Everyone is giving you great advice, but there is one thing I see that’s missing and that’s you getting a clear understanding of your prognosis, that is the likelihood of different scenarios when it comes to your disability. For example, what are the odds of getting arthrites early? Is it manageable through medication? What are the odds of you losing mobility? At what age? Does lifting things and standing for long periods of time feel painful? Will it become so over time? Your neurologist should have approximations or at least ideas on these different likelihoods. \n\nHaving this kind of knowledge and understanding how much care you will need from a care taker in the future is very important, because otherwise you’re leaving it to the future caretaker to figure it out. For example, not knowing that you are likely to get early arthritis or what that means for you and only finding out because she did that work is a sign that you’re already letting her carry the invisible labour around caretaking for a disability. Even though she doesn’t have to do anything now, planning for the future is part of the work, and if you had already done it it would be proof that in the future when bigger care-taking tasks are needed, she won’t be the one doing all of them. \n\nAnother point I want to bring up is that in the large large majority of heterosexual couples women do more chores than men, I think it was 90min on average every day or something like that, even when they both work a day job. If the man has a physical disability,  I imagine odds are that this becomes compounded and the women have a bunch more chores and care-taking duties to do instead of enjoying their free time. Maybe this won’t be the case for you, but maybe she’s worried about that. Maybe she already has to do all the mental labour of planning dates, and figuring out when to chat, and finding new food places and it’s showing her that she’ll be “carrying the team” disability or not. I don’t know if that’s the case but for this or future relationships, I implore you to keep this in mind.",
            "First off, I wanted to say I hope you can get a group of specialists to help you with this disability. I wish you the best of luck.\n\nRegarding the relationship, I have always believed that any couple that truly loves each other can make it work between them. She may go through hardships of taking care of you for the rest of her life but if she can find enjoyments in other aspects of the relationship who is to say that it won't work out? There is no one else other than you two that can say it won't work. If you work hard on yourself to improve your capabilities, do your stretches everyday, provide some income for her, make her smile and laugh to lessen her burden. I think she will be okay with that. I don't know her personally so I can't judge. If she sees the effort you are putting in to make this work, there will be a much higher chance that this can work out. You both have to be prepared with the physical and mental limitations that come with this but I believe that you two can make it work. Granted, you have only been together for less than a month. Show her that you are taking this relationship seriously and prove that you won't be a burden!",
            "Does she and her mother know that cerebral palsy is non-progressive? Are they somehow confusing it with motor neurone disease? Do they know it's not hereditary? It sounds like her mother found out your have a disability and has been nagging her to leave you since.\n\n\nBut also coming from it the other end. Are you so desperate for her to be 'the one' that you're holding on too tightly? Are you putting pressure on her to stay because it's going to be hard to find someone else. Rather than her staying simply because you are actually a good boyfriend?\n\n\nIf you fall into the oh my god don't leave me, frame of mind, she won't want to stay.\n\n\nYeah, I don't know man. Maybe some expert can tell you what to expect for your future, whether that's early onset arthritis. Or maybe things you could be doing to maintain or improve your condition. But it seems pretty clear it's something you can't just ignore.",
            "Ok she has a valid-ish concern. You need to set up your finances so you can hire any help you may need in the future(home health aids, transportation, cleaners, etc) in case insurance doesn't cover. You need to have a willingness to utilize these services. You should work on getting your driver's license, now.\nHer concern is valid because even the most able bodied of men dump as much responsibility as they can onto their wife/gf (cleaning, errands, child care, house hold mangement,etc)",
            "As fellow cerebral palsy affected person who developed arthritis at the ripe age of 14, who’s main tell is “a cute little accent” and a semi crooked leg, it’s no big deal. Exercise and yoga have kept my mobility up and naproxen and ibuprofen keep the arthritis at bay. \n\n  \nYour girlfriend is being worked up by others and freaking herself out. Being with a disabled partner of any degree just isn’t for everyone. Some relationships end when a partner is in a severe accident and the caregiver is their s/o. There is nothing wrong with you, nor her for not being able to cope.",
            "*“To make matters worse her mom has been telling her for the past few weeks to break up with me because she can find better”*\n\nI’m having a hard time understanding why a loving & caring person would tell you that, OP. That her Mom is concerned about her future is understandable, misguided or not, but relaying the better comment seems unnecessarily cruel & that you’re not valued for you.\n\nOther than that, ditto to u/GoldendoodlesFTW.  Your comments about not having  a chance yet to get a license, GF is your motivation to better yourself,  your  emotional support, etc., imply you may have been putting a lot on her shoulders already, especially for such a new relationship.  \n\nDon’t ever try to convince someone to stay with you, OP. Let her use her Mom’s advice as her out if she wants. The transition from an online relationship to real world doesn’t always work out. And walking away from your first love is tough. But even considering yourself an introvert, you found someone, & you will again. Your first relationships will help you get to know yourself better, identify what you want for your future. You were smart job wise, continue working on yourself. Don’t improve yourself out of spite, or for a SO, do it for yourself.",
            "The comments in this thread make me think back to when I wrote a 12 page paper and did a 10 minute presentation on cerebral palsy and why it needs more public awareness about what it entails.",
            "I'm married to a man who is paraplegic and in a wheelchair. He is independent and the only help he needed around the house was changing light bulbs and air filters. Some of my extended family has voiced concerns that they worry I will have to take care of him later in life. I don't really see that being the case because I am small (5'4) and he is a large person (6'2). If he ever needed physical help we would probably just hire someone. \n\nSo if truly the only thing she is worried about is the physical aspect I think you can plan and prepare for that possible future. \n\nWhen you say she is your irreplaceable emotional support I worry for you. A partner should not be your everything, it can feel suffocating to them. I had a relationship like that and I felt so alone when he didn't give me attention or support. Now, I have my family and a handful of friends who I can talk about different things so that everything doesn't fall on my husband. And he is the same way, he has family and friends he can talk to. \n\nIf you're able to have a conversation with your gf about the physical and emotional aspects of your relationship I think you will have a better idea of why she would want to stay or go.",
            "I work in mental health and I listen to peoples problems all day everyday, and I have a beacon on my head for friends and also people I don’t know telling me there problems in my personal life also. This constantly can become incredibly draining, I used to feel friends in my personal life talking to me about there problems not to be a burden when it was not my job also, now when this constantly happens I feel trapped and like I need some time out and I’m much more tolerant than the average person I would say. I could imagine if you are offloading all your negative thoughts and emotions on a regular basis to your girlfriend, it would also become draining and perhaps you are forgetting to check on her and be there for her problems too. It’s called compassion fatigue. \n\nThe only things in life you can control are your own actions and your own reactions. Trying to control anything other than those two things is futile. You are responsible for your own happiness, no one else and putting that burden on someone else also is unpleasant. I’d recommend placing the focus of your happiness on something within your own control; meaning not another person of which you have no control.",
            "Yeah it sounds like she’s exhausted being your emotional dumping ground and is already experiencing care giver fatigue just from being responsible for your happiness alone. That’s what’s exhausting her.",
            "I think it would really help for her to go to therapy or speak to a specialist about this. Caregiver burnout is a real thing, so I think she just wants to know that she’ll have some help/support in the future if and when you decline. I also think having a plan would help ease her anxiety over this. I imagine you’re receiving some form of physiotherapy and staying as mobile/independent as possible, so that’s all you can do. The rest is on her whether she’s open to seeking more clarity and resources regarding this or whether she just can’t handle it. \n\nYou’re also both very young and this concept is likely a lot for her to take in. Offer to talk about it and be open with any concerns she may have. Rooting for you bud!",
            "Cerebral palsy does not tend to get worse with age in my experience (I have cared for many people with more severe cerebral palsy) so I don't think your girlfriend really has anything to worry about. Other than general decline as any person getting older would experience. She isn't going to need to become your carer or anything, she won't need to give you any more help than she does now. Hope this reassures you both :)",
            "It sounds like her mom is telling her to break up with you, and then she comes to you with all the negative stuff her mom says. Maybe you could say something like, \"you keep telling me about the negative stuff your mom says about me, it hurts and it makes me feel our relationship is in limbo. I need you to make a decision if you want to stay or go. If you want to stay, please ask your mom to respect our relationship, and stop telling me all the nasty stuff she says about me. If you need more info on my health and my long term prognosis, I can provide that for you.\"",
            "Anything can happen to any one of us on this earth that can affect the way we use our bodies and/or the level of care we need. I hope your gf's mom never needs elder care or has an accident or develops arthritis or gets very sick.",
            "Let me tell you something OP, both my parents have CP and they did just fine raising my siblings and I. My mother raised twins with one working hand. My father works out all the time, he has CP all over his body, he can take care of himself, and he is almost 50. The thing doctors tell you, that as you get older you'll become even more disabled, is a myth. I know a 70 year old woman with CP and she can take care of herself still yet. It's all going to be okay in the end, I promise you.",
            "Hi, firstly, I’m very sorry to hear this. I agree with most of the things that others have said - it does seem that perhaps therapy would be useful, etc. However, I just wanted to add that I just got out of a relationship with someone with cerebral palsy, and his sounds relatively similar to yours. It didn’t bother me even one tiny bit - the way I see it, everyone has something, everyone has their shit. He told me about it right before our second date, and that was that. I loved all of him, which definitely included his cerebral palsy. So, I hope you know that this kind of love is possible for you. Furthermore, I (22F) have several chronic illnesses that amount to a disability (including arthritis!) and ultimately he ended the relationship at least partially due to my illnesses. So, I know how absolutely devastating it can feel to have somebody say that they cannot love you and have that be linked to your disability. This was also my first real relationship post-disability, so I understand feeling like you won’t find someone again. I guess I’m here to say that 1) I can relate and 2) you deserve somebody who loves and celebrates all of you, including your disability.",
            "You can’t force someone to stay with you.",
            "Do you make a good living? Could you tell her that you’d be quite willing to hire a housekeeper if you can no longer do half the work in keeping your home clean? Do you both want kids? If so, could you promise to hire at least a part time nanny if you’re unable to contribute to the physical care of a baby?",
            "I never dated anyone with cerebral palsy but I just wanted to chip in that I met a girl who was born like that at the CrossFit gym who had trouble with one arm and that never stopped her. She followed all the classes and altered any exercise she needed but she was so strong, I got paired with her sometimes and she could easily kick my ass. I stopped going to that gym but last I heard she had a baby. The right partner won't care at all about your disability.\n\nI will say tho, for myself, I struggled dating guys who didn't drive and I had to be the sole driver. I think getting your license could be an actionable item you could do.",
            "Ontario specific advice: Contact your local LIHNs and see what they can do for you, if you haven’t already. They will probably need to do some kind of assessment, gait assessment, home assessment, etc. They can get you different mobility aids too, but Canadian Tire might be faster if needed. \n\nOn the website you can see community support in your area, like a support group. They can also put you in touch with an occupational therapist/PSW as needed. I’m not sure what they offer in terms of talk therapy but that’s something you can inquire about with them. I also don’t know much about wait times unfortunately!",
            "Dude, it doesn't really matter what her reasons are. If she wants to break up with you, you can't fight her. That's not a healthy way to view relationships. If she's nervous and unsure, talk through your fears together, but if she is saying that she wants to break up, that's something she doesn't need your agreement on. Breaking up is not a unilateral decision.\n\nIt also seems like you really need to see a therapist because from what you're saying, you are requiring a lot of emotional support from her and whether you can work this out or not, you are putting too much on her and not taking care of yourself and your own mental health properly.",
            "She doesn't need a reason to leave a relationship so it's a moot point to try to validate anything or down play her concerns. If I were you, I'd give her space to think/make a decision on her own and let her know that you'll respect her choice. It's out of your control anyway, might as well focus on things you can control to make yourself a more desirable partner.",
            "Can I chip in here? I have BPD 1 and it is a real bastard. The toll of my family, my work, my friends and my extraordinary husband is overwhelming. I manage, drug, therapy all I like and pretty much have done since I was 15 ( ground zero). \n\nIn situation like this support for the support is vital.",
            "Are you sure that you love her? It is pretty selfish of you to expect a 24 year old young woman that is at the peak of her life spend the rest of her life taking care of you. That is your parents and the government’s job. She is so young and deserves to enjoy her life. If relationship is in the cards for you, I think you should wait until a mature, older lady with a career and good income is in your life. Then she will have the resources to have someone take care of you while enjoying her life with you minus the resentment. You should not be tying down young women in their 20s into a relationship that is very difficult and time consuming. People are insane for thinking a 24 year old should be a care giver.",
            "I have a chronic illness. I know that it can get worse suddenly, or not. It flares up randomly, for instance the last two days I was completely incompacitated and it was a bummer.  I felt a bit like a burden. But I hung out with kids, did homework with them, watched movies, napped, have conversations with them. When I was dating I told my now husband very early on how it would be to be with me. There's no promise it won't get worse. And he accepted that. The thing is, there's no magic thing I can do or say that will make him more willing other than doing what I can.  Just like in any relationship, things happen and change and we hope to grow together but what it requires is for us to just keep growing as individuals. \n\nYou are right that your disability isn't that big of a deal for a relationship, as long as the other person is ok with it. You need a neurologist. From what you've described, your physical limitations are going to have a minimal impact in your life as long as you stay on to of it. As for your gfs mother, why are so many mom's such idiots?  It seems you're living in a bit of fear of the 'what if'.  No time for that my friend. Talk to a neurologist, work with a physical therapist so you can be as strong as possible. Be educated on your disability and take control of the things you can control.",
            "I don't understand why, at age 26, you don't have a driver's license.  You haven't gotten around to it?  Does she have to drive you around?  If so, she may already be feeling like more of a caretaker than she's comfortable with.",
            "You need to sit down and have a chat about this. I have a disabled partner, and although I do know their condition could get worse, we've had discussions so I'm not concerned. Like you, they are a software developer, so even when they're having bad days they can still work, and even if their condition did end up affecting their hands, they are skilled enough and technology is developing fast enough that I know they would probably be able to keep on supporting themselves. I would imagine things would be similar for you - it sounds like barring external events, you'll be able to support yourself for a long time!\n\nThe thing is, if people live long enough, they will eventually become disabled. Yes, you have a preexisting disability, which makes things a bit more obvious, but it doesn't sound like you have particularly high care needs. Even if she had an abled bodied partner, they could get hit by a bus and develop locked-in syndrome - we never know what's going to happen! Yes, it is fair for her to consider the long term care implications, but honestly it sounds more like scaremongering from her mother than genuine concerns.\n\nI do agree with you that you should look into what state support you can get - it might also be worth looking into insurance, there are types of insurance that can support you if you lose your income (although it may be quite expensive for you). I would also research people in your field who use assistive technologies such as speech to text for programming - she will probably be reassured to know that even if your condition does get worse  there's a high chance you'll still be able to support yourself at least somewhat.\n\nFinally - everyone has care needs, even non-disabled people. Yes, she might need to care for you - but you might also need to care for her! I do small physical care tasks for my partner all the time (just stuff like fetching them food or drinks etc - mostly just because I like to show my affection like that, but sometimes because they're having a tough day), but they do a HELL of a lot of emotional care for me (I'm also disabled, I have chronic mental health issues). Our care needs don't always look the same, but they're both super important.",
            "So is she breaking up with you or not as your title says?",
            "The driver’s license thing really struck me, because you described it as “not had a chance” to get it done. In ten years you’ve had thousands of chances to get it done. There’s something holding you back from completing this important step  (and I imagine there are probably other things too) to become more independent, and whatever that thing is you aren’t taking responsibility for it.",
            "Meeting April 2020 and get together may 2020... this already is a red flag!🚩\nEither she was in for your money or she got bored when the pandemic started! Either way something happened. And did you saw those messages with her mum telling her to break-up? If it's something she told you just like that... that's another red flag!🚩\nIf you don't want to get hurt in the future take your time to get to know the person and maybe at least minimum 6months then you can get together.",
            "Sounds to me like she still has growing up to do and is a little immature. There are no guarantees in life, and to play the “what if” game is pointless. She can leave you and marry some super fit and healthy person, only for them to get paralyzed on a car accident. What’s she going to do then, leave? At some point you have to look beyond all that and ask yourself if this person (you) is the one she wants to be with. \nThat said, knowing you have a disability and making sure you manage it and lessen the burden on her is something you should do. I’m disabled as well and I never make it an issue in my relationship that she has to work around frequently.",
            "Rip the bandaid if and end it yourself, if she’s worried about taking care of you because of your disability what would happen in the future or tomorrow if you got hit by a car or had something else happen? \n\nDon’t settle",
            "Maybe you should ask her how she would feel if the situations were reversed and she was the one with a controllable lifelong disability and your mother was telling you that you could do better than her. Would she be willing to never get involved with anyone for their sake, or would she want companionship too?\n\nI would consider looking for local support groups to help as well. There is likely a group nearby that can help you both with some of the questions and options ahead.",
            "The fact that she cares so much about that, forgetting you're a whole ass human being with feelings and just sees you as your disability and a potential burden says a lot about her, she doesn't sound so wonderful as you're trying to portray her. It shouldn't matter and I'm sorry you have to deal with this now.",
            "The sad fact of the matter is that you might find the right woman who will love you and when needed care for you, but your disability puts a majority of them off, I have an intrusive disability and it shrinks the dating pool by a lot\n\nTough shit better luck next life eh pal?",
            "Frankly I’m astonished anyone is giving advice to “get her back”. She’s made it clear she doesn’t want a burden and could even resent you in old age. Let her go, she sucks lol.",
            "All people are disabled. You are disabled in your body. Other people are disabled in Their brain or heart. Let her go. Be thankful for the time you had with her. She will come back when she discover that other people are disabled in their heart or brain.",
            "I in no way have experience on this but I wish you the best!",
            "[deleted]",
            "I think that if she loves you, breaking up wouldn't be an option even if your situation worsens. \nThroughout your life you will meet people who you can connect with, I've achieved that many times. Take this as a lesson that you can form such connections. There are many amazing people out there. Love is a weird thing as it must be unconditional, no matter what, people who love you will always stay by your side.",
            "Anyone can break up with anyone for any reason. But I hope you can find someone who loves you for what you are.",
            "Hey, i can understand that having a disability might be difficult for some people to care for, and that they feel that they need to have someone next to them that's 'competent'.   \nI believe this is utter shit. If she wanted to be there for you and loved you this would not be up for discussion and should never be.   \nYou have a genetic disability, there is nothing you can do about it, apart for being positive doing your excercises, maybe seeing a physiotherapist. You do these things for you, to help yourself and your situation, not so that your gf or anyone for that matter is convinced to stay.   \nThe fear of being alone is horrible. I hope you do not find it insulting for me to say that I understand as it is a great fear of mine. I am mentally unstable sometimes. This is something my partner has to understand and know. This doesnt give me a free pass to act however I like, however there are some things he does have to deal with, which he wouldn't have to if he was with a more 'competent person'.  \nYou do not deserve this treatment, i think it is noemal for you to have low self esteem and this is the reason why you are contemplating her behaviour.   \nI hope things work out and you are young. Know that there will be someone for you wich you do not have to 'convince' you are not going to be a burden.   \nFurthermore, let's face it as you grow older, maybe you will need more help with certain things, this should never be labelled as a 'burden' of all things. This is life and if someone loves you they will not view your disability as a burden. thats horrible.",
            "My husband is 19 years older than me (together 7 years) and was disabled by heart attack and stroke (and then chronic vertigo) before we even met.\n\nPart of being together means being honest about future care taking needs. He knows that I don't really have any intention of being his primary caretaker should he become completely incapacitated. It sounds harsh, but what does that mean in real life? \n\nI'm **physically** not freaking strong enough to lift him in any meaningful way. I don't feel comfortable changing his future diapers (and he doesn't want that either; when he had the heart attack, his gf at the time insisted on playing nurse and cleaning his shit despite him saying **NO** and really mortifying him). Whether a nursing home or in home care, we'll play it by ear, but I don't plan to be his primary care giver.\n\nIn an emergency, though? I'll do whatever needs to be done. If he's in a nursing home, I'll be as moved in with him as possible. I'm not going anywhere because til death do us part. \n\nWe've already gone through a couple medical issues (diabetes diagnosis, defibrillator change) where he's had to depend on me to translate his wishes and make sure he gets the care he wants. I'm currently pregnant and severely constipated and he's literally on his way to the store to buy me fiber rich foods and Dulcolax tablets. I hope we don't have to go the suppository route, but I know he'll do whatever he needs to do to ease my suffering.\n\nBeing in a committed relationship *always* involves care taking. Whether it's a major amount necessary of a person with someone permanently in a wheelchair or just running to the store to buy pads/tampons, you both will always be caring for each other.\n\n**Young and healthy people DON'T stay young and healthy forever.** So, both of you need to talk about the absolute worst case scenario. A car accident that leaves you quadriplegic through no fault of your own. What are your expectations? Compromises? When it comes to your actual disability, what are things likely to look like when you're 85? Any different from a normal 85 year old? Is there dementia in your family? Guess what **I** have to look forward to!",
            "Does hiring a maid solve most of the problems you mentioned?",
            "You are a whole package. If she can't accept the whole thing it isn't meant to be",
            "Your girlfriend is having doubts because of her mum constantly dripping doubts in her ear. You need to have a serious discussion with her about what your future health prospects really are compared to what her mum *thinks* they are and then leave the decision on how she wants to proceed *and* how to handle her mother to her.\n\nFate is fickle. She could leave you, meet someone who is a Poster Boy for physical fitness and then he has an accident or develops cancer or has an aneurysm and still end up being a carer for him while you are still living a healthy and productive life. *Nobody can see into the future!*  My mum and stepdad were both fit and healthy when they met. Neither of them could have anticipated that he'd have a series of strokes that would leave him completely bed bound or that his appendix would literally disintergrate to the point where the surgeons would be scooping it out in handfuls or that the strokes would trigger dementia. But she adored him to the end and never felt that the bad outweighed the good. My own SO is a brittle T1 diabetic (meaning he can go high or low without warning even though he's vigilant with his diet/meds), has a whole host of associated complications and sleep apnea. During a particularly bad spell I got to be on first name terms with the paramedics! But I wouldn't trade him for the world because the good outweighs the bad a thousand fold.\n\nI guess what I'm saying is that nobody knows what life is going to throw at us and trying to borrow what ifs and trouble from an unknown future is only going to bar us from living and loving in the here and now.",
            "Let her go. Her fears are valid, even if you think she's wrong. You never know where life is going to take you and what your health will be like next year or five years down the line.\n\n\nMy mom married my dad when his disease was progressively getting worse. He had MS. By then, he could no longer walk. His first wife divorced him because she didn't want to spend the rest of her life taking care of him.\n\n\nMany of my mom's friends and even family tried to discourage her from marrying him due to his condition and that she would have to take care of him for the rest of his life. They had a very happy marriage and loved each other very much. There are women out there who are going to see past the disability and not care.",
            "U broke up with my ex because his family was telling him i was damaged goods and i could never make him happy and that i probably can't have kids. I was on dialysis then and we were in love and wanted to be together. But ultimately, I knew he couldn't pick me over his family so I ended it. I got a transplant a year after breakup. Now 6 years later, my husband adores me even with all my medical baggage, his family is so supportive and we are trying for our first baby. \n You haven't met the right one yet .",
            "There should be NGOs for people with your disability - contact them and ask to speak to someone about possible long-term health issues. You should first know yourself. Also, ask if there are support groups for partners.",
            "After reading through everything, OP you need to go to a therapist.",
            "First of all, I'm so sorry you're going through this. It sounds like her mom has gotten in her head and made her question things. But honestly, it's better that she's realizing these things now than later. Unfortunately, not everyone is cut out to love someone with a disability. These things may never be issues for you two, but if she's feeling put off by the **idea** of it, then it may be best for you two to see other people. You should never be with someone who looks at the future with you or the possible future with you as a burden, in any way.",
            "From reading this, you need to let this relationship go and focus on therapy both mental and physical, until you love yourself.",
            "So my brother has the exact same diagnosis as you and similar issues.  He had girlfriends that left him because of his disability and now he is happily married.    Here would be my advice:\n\nYou have 2 separate issues:  \n\nA) being the best version of yourself with the cards you were dealt with \n\nB) have a good relationship with a girl (whether it be your current girlfriend or a new one).\n\n\nSo based on my experience don’t let the disability bring you down, your still offer someone a lot, however yes you must work out every day and eat very healthy and more then the average person.  Be the best version of yourself.  Have hobbies, go out, join clubs and be interesting.  \n\nIf she wants to leave you, then she will and no point and trying to have her stay.  If she she’s you get desperate and try and convince her to stay, it will make it worse.  She either wants to be with you or not.  Honestly you are better off by yourself then with someone who doesn’t truly love you for you.  \n\nShould she break up with you, just focus on being the best version of yourself.  Don’t let the disability define you or limit you.  Also make sure you can talk to people and have personally as that’s important in a relationship and out of one.",
            "The truth is one day she may have to care for you, but you may also have to care for her. There’s a reason that wedding vows say “in sickness and in health”. When you’re committed to someone part of that commitment means being there for your partner no matter what happens. You are actively trying to maintain your disability, but you or her could get in to a disabling car wreck next week or develop Parkinson’s or Alzheimer’s disease 50 years from now. No one knows. Not everyone is willing to do it but when you truly love someone you do what you have to do. What if you had kids and one was special needs? Would she just leave you to deal with them yourself when it gets hard? The answer to your question is there is nothing you could do differently. One day something might take a turn for the worse, but it might not. You need someone who is willing to be in a relationship through all the bad parts and this girl isn’t. There are so many people who won’t care about the what ifs and will love you through and through no matter what, and you the same.",
            "OP, it sounds like part of the problem here isn’t your disability — it’s that you aren’t taking care of yourself. If you don’t have a regular doctor who you visit annually, who is familiar with your condition and is monitoring you and advising you on health developments as you age, then there are lots of things that could get missed. You say that you’re not aware of your disease prognosis or what aging would look like; that’s something I would definitely look into if I were you. \n\nFor most chronic health conditions, the choices you make throughout your life will effect the severity of deterioration later in, and can improve your overall life expectancy. Medicines and therapies are continually being developed. Diseases are being researched and understood. \n\nYour disability does not have to define you, but it most certainly does matter. The quality and length of your life may depend on you catching developments early and preventative measures, all of which need the guidance of a knowledgable physician and medical care team. \n\nIf you were more knowledgable about your own health and could show that you’re serious about your body and taking care of it by being able to point to your relationships with your doctors, then potential partners would be less likely to need the Internet to explain your condition to them. You could explain it. You could guide their understanding, so that they aren’t just falling into horror stories and worst case scenarios on web forums and cooypasta medical articles that may not apply to you at all. \n\nI think that’s the real issue here. It may be that this woman is not the right one for you, and I’m sure it’s super painful to go through a breakup like this. Welcome to the world of dating. You are not alone, most of us have had similar experiences - and it always sucks being broken up with. I’m sorry you have to go through this. Your disability doesn’t make you un-dateable, it sounds like you’re a great partner. \n\nTo avoid this particular concern in the future, I think you need to take more control of your healthcare and be proactive about your disease. Understand your prognosis fully. Be ready to help others understand what life with you would be like, and makes sure you’re planning adequately for your future by setting enough money aside, eating right and exercising, and just generally taking care of your body and mind.",
            "Oh OP. I have a lot of physical problems at the moment so I totally feel you. I'm afraid to date because I don't know why someone would bother with me.\n\nThat said, I think you are putting far too much pressure on yourself to be ok. You can't promise your gf or anyone that you won't get worse. Even able-bodied people could become disabled at any time. Either she can deal with it or she can't. You obviously need to do sensible things to take care of yourself, but it's not on you to magically become less disabled in order to make things easier. \n\nIf you are going to be a couple you both need to be prepared to learn and adapt.\n\nCheck out vlogs on YouTube with couples where one or both is disabled. You might find Squirmy & Grubs (Hannah & Shane) interesting because he is severely disabled and she does all of his care and sees it as a normal, even enjoyable part of their relationship. There are other couples where the disabled partner hires carers, as they feel it would negatively impact their relationship if the partner did the care. Both approaches are totally valid and workable, and it just depends on the couple. The point is that they have all figured out ways of making it work that don't result in burnout or resentment. The right person will work with you to find solutions. \n\nYou can't make her stay if that's not what she wants. And you don't deserve to feel under constant pressure to be well – no-one can live under that type of pressure long term.\n\nI hope there is someone out there for me – who can handle my physical limitations. But I'd rather be single than dependent on someone who doesn't want to be there. We all deserve better than that.",
            "Well, shit....that sucks. Is it her or her mother that wants the breakup?\n\n43/m here. I have CP too. I walk with a limp and have limited use of my right hand, but other than that I get along and get around as well as everyone else does. As far as I know it's one of those things that doesn't get better but doesn't get WORSE; it's just, for lack of a better term, there. I never thought about the arthritis coming early, but that could very well be a thing. Physically speaking, other than the arthritis, if you've managed to get this far with life at 26, you oughta be fine. If you have any questions or whatever feel free to reach out and I'll be happy to answer.",
            "I am sorry to have to say this but it is possible that she is looking long term down the road say 20-30 years and considering the possibilities. I know one couple where his condition went down over time to where he was almost an invalid by the time he was in his 40's.\n\nI hope your doctors can talk to her and give her realistic outlook.",
            "[deleted]",
            "I always known that with my bf being an addict that it was going to be harder than with someone who isn't one. \n\nThe thing is I care for him enough that it doesn't matter to me. \n\nYou will find someone worthy of you.",
            "> My [26m]'s girlfriend [24f] wants to break up because of my disability\n\nI'm confused. Nothing in your post suggests that your girlfriend wants to break up with you?",
            "Something she might want to consider is whether if she met someone else who was not currently disabled who then became disabled, would she consider that adequate grounds to break up with them.\n\nMight help clarify if her concerns are founded in a desire not to help care for a partner ever, or if she is allowing the reality of already being in the above situation to obscure the fact that if she were to find herself in it in future, with someone else who she had bonded with before they became disabled, that she may be comfortable that this is just part of being a partner and the reality of life is that most of us in couples will have to care for the other person in some way at some point.\n\nOf course, it is up to her what kind of relationship she can commit to, everyone is entitled to make that choice, but being with someone who is not outwardly disabled is no guarantee of a burden free existence. (In fact in my case the worst relationship I ever had was with someone with deep depression who refused to get help.)",
            "On the bright side, she is seriously considering what a long-term future with her might look like. You should also consider your future. If your cp gets worse, what happens? Have you talked to a professional about this? Can it get worse?\n\nThere are a lot of people out there in the world who are happy to fall in love with someone who has a disability. Very, very few people want to sign up to be a care taker forever. If you don't have a plan or have illustrated an over-reliance on her, she might be worried about this.\n\nOn the other hand, there's nothing you can do if she decides she no longer wants to date you except move on. I'm sorry you are going through this.",
            "i don't blame her, looking at your tldr, she wnats a better future, assuing shes hot she can date a richer older guy",
            "Part of me thinks that her mom has been telling her more about your disability than she’s letting on. Her mom clearly is not a fan of yours and at your girlfriends age, mom is starting to think/worry about grandkids and has potentially been trying to convince your GF that you’re likely to pass your disability on to your kids should you have them some day. Which again is incredibly wrong and untrue.\n\nIf I were you, I would take some of the other advice I’ve seen on here and ask if she would have a conversation with you and your doctor. It probably doesn’t need to be a specialist tbh. Then once that has happened you can leave her with a choice “now you know all the facts, if the risk that I might be more of a burden than I am now is too much for you then I will respect that, but if you love me, and 10-15 years down the line see me living a halfway normal life, will you regret it?” And leave it at that.",
            "Can you bring her with to a doctors appointment to have the doctor discuss her concerns?",
            "I’d say let her find a new person. I know this is scary, but you can’t make someone commit if they don’t want to, and I understand both of your positions. A good online support group will help, maybe a good therapist, and lots of new friends. That can mean counting on places like Reddit to find the support and answers, like youve just done. I am a partner of a person with a chronic disease, and it was a very hard decision to marry because I was worried I simply wouldn’t be up to the caregiving task. It’s terrifying, and I’m still terrified. I’m older but choosing him wasn’t a default, or a fear of what if. I had a fear of what if he’s not in my life? I choose this everyday, and sometimes I feel like I suck at empathy and care. He works out so that helps. You don’t need help, you don’t need a caregiver, who knows what’s coming for any of us in the future? Find someone who doesn’t want to just think about the what if’s, not just that, but factor it in to see if not being with you outweighs the rest. You sound like an amazingly smart, proactive, sensitive and loving person. That’s who you are, not CP. good luck to you, much love e your way in this tough place. You’ll get through this, and I’m rooting for you all the way to find the person who sees YOU.",
            "My mom has epilepsy and cerebral palsy. She was born in the 60s and was told she would never walk, go to school, drive a car, have kids, etc. She has done all of those things. She has right sided weakness on both her leg and her arm, but otherwise is normal. She needs help with certain things like opening jars, shaving under her unaffected arm, carrying heavy things. But it’s really not a huge issue. \n\nYou need to find someone willing to help but that knows you aren’t completely helpless. I would move on. \n\nAnd regarding driving, she has a left foot accelerator put in every car she drives. It’s super convenient. \n\nI wish you all the luck!",
            "Many people have pointed out good valid things. I just want to mention that her staying is a long shot at this point. Even if you manage to change her mind, who is to say she won't start feeling the same a year from now. You will live with a constant fear of her changing her mind.",
            "More than anything else, the main issue is that you need emotional growth to the point where you can be comfortable with the idea of your romantic partner leaving.\n\nYou’re approaching this situation as a crisis management problem, but actually it’s ok to just give your girlfriend space to do whatever she decides to do. You don’t need to convince people to stay, and that wouldn’t be a good approach either.",
            "A year isn’t a long time. In the beginning of a relationship, anyone can appear loving and caring. That is normal. It takes  time to decide whether you are connected to somebody enough to commit to them. She doesn’t want to stick around to find out. That may be fear of your disability, or just not feeling enough connectedness (as another poster pointed out). This kind of breakup happens to almost everyone at some point. To most of us, it happens several times, whether we are on the breaking up side, or the being broken up with side. Guess what? That’s part of what makes you normal and independent.\n\nYou sound desperate in a way that is common to young people in early relationships. You said “Help me, I’m an introvert,” but the underlying fear is often “Ohmygod thisistheonlydeeplove I have ever experienced; I will never find it again. I must get this person back because there is no one else for me and never will be.”\n\nThat is a false feeling. You will get over it if you allow yourself to, and you will meet other people.  The opportunity to pursue love will come up again.\n\nRegarding the disability and independent living, this girl & her mother aren’t your judge and jury. You don’t have anything to prove to them. You and your doctors work out whether you are to be independent or not.",
            "Perhaps it would be best to look into therapy and to see if you can get medical assistance at home. If you have medical and mental support you won't be unloading so much onto another person. I have a daughter with disabilities and it can be exhausting without help. With help it is much more manageable. I'd check into government services for your disability so you don't have to worry so much about managing it. I didn't have a support network for my daughter while I raised her and it kind of ruined me in some ways. I'm still trying to recover. \n\nIt is okay if your current girlfriend feels like this is more than she can handle and wants to end things. I know you worry you'll never find another because you have CP but I can assure you that if you sought proper therapy you will learn not only how to manage your condition, but also how to manage relationships.",
            "Contact your Local Health Integration Network, they handle home care and assistance for disabled and elderly people in the province of Ontario. They can connect you with OT's, Physical Therapists, other community assistance and answer questions regarding concerns.",
            "I don't have much to add, most people have said all I would. But I am noticing that most people are suggesting ways to include her in your medical support apparatus and it seems like you might not have one. Is this reasonable? It seems like your CP hasny impacted your life as much, but does that mean you shouldn't have a medical support network setup? Typically if someone afflicted with a life altering medical issue doesn't take it seriously enough to go to doctors regularly and make a primary focus of their life the abatement of their affliction, it will be a red flag to potential spouses. I know doctors are expensive and I don't like spending tons of money on their services, but if I don't then I'm just kicking the problem down the road and it's just going to get bigger. If it gets bigger, my wife will be the one who has to pick up the slack.",
            "You should qualify for some policies through work that would provide assistance care if you need it. That might alleviate her fears a big. But wow that is so hurtful. I’m so sorry.",
            "I live abroad, and moved away from my birth country when I was 24. At 22, I already had a solid plan I wanted to move one day, and was trying to plan ahead. Then I got a boyfriend in my birth country, and I worried about our future. He didn't really want to move, I knew I would one day. I questioned if it even made sense to date anyone in that moment. \n\nWe broke up after 3 months for completely unrelated reasons and I didn't move until 2 years later. \n\nPlanning ahead is good, but planning too far ahead can be a bit too much sometimes. Yeah, maybe she will take care of you one day. Maybe not. Even if it's a great and committed relationship, you could date, live together, get married, and eventually divorce after 10 years. Before any of it gets so bad you will need help. \n\nThe real thing to focus on is the immediate future, the next 5 years or so. When the moment comes when you do need looking after, you deal with it then. Single people with CP still manage. You can get a carer to help you so it doesn't all fall on her. Get tools to make life easier. Maybe her career will be in a place then where she can easily work from home. Maybe medical knowledge has improved by then to actually have a cure for this stuff. \n\nWhat happens in 20 years you deal with then. Don't throw something away now based solely on the future. You can't predict these things.",
            "Being a caregiver is scary and draining, obviously in a different way than being the person who might need care, so it’s probably hard to see all the angles in an unemotional way.\n\nI think there are valid concerns on both sides. It’s not unheard of or horrible to realize a little down the line that an aspect of a relationship might not be the best for you or something you can handle...that’s sort of what dating is about.\n\nTrying out people and situations to see what fits well. It’s also (arguably) better to figure out how that this might not work than years down the line.\n\nI don’t think there is a way to convince her otherwise, and it’s okay if this relationship doesn’t work out. It won’t set a measurement for all future relationships, I promise you it won’t.",
            "Her mom is the problem and thats not a problem thats easily maneuvered around. It's too bad she has a mother like that, with such a small minded view of the world. C'est la vie. Good luck man.",
            "I  would suggest thinking about your disability and relationships in a different perspective. Your cerebral palsy acts as a filter to future partners. Everyone, disability or no, has the potential to require extra care from a partner whether due to aging, injury, illness or disability. Laying out the fact that you have cerebral palsy from the get go helps to filter out potential partners who would not be around for difficult times anyway. \n\nDoes your girlfriend have the right to worry about this? Sure. She can worry about anything she wants and anything can be a deal breaker for her the same way that someone not willing to risk the possibility you might require extra care can be a deal breaker for you. All in all, I would suggest having a very candid conversation with your health care team about what you might expect to happen as you age. I would then have that conversation with your girlfriend. \n\nIt would also likely help to find a therapist to help provide tools to manage your feelings about your disability. At the end of the day your are much more then your disability and a good partner will see that.",
            "Since I know just about nothing about cerebral palsy, I’m going to assume there is a realistic chance that you might become dependent on her, or at least that she sincerely believes that.\n\nThe first observation I’ll make is that, if you’re dating someone who is healthy and able-bodied, it’s quite easy to sincerely think you’ll be willing and able to care for your partner *one day.* But it’s a much more intimidating prospect when your partner is already suffering from a life-altering and incurable disease. Especially if the information she found tend to focus on more severe cases without giving a reasonable idea of how common those are.\n\nI would suggest talking it out with her to really understand what her fears are focused on. Find out what it would take to address her concerns and make her feel comfortable about what lies ahead.\n\nI would also suggest looking for a cerebral palsy support group in your area where you can meet some older people and see how they live and cope.\n\nLastly, you say you’re a software developer. I assume that means you earn reasonably well. I would strongly suggest you pursue financial independence seriously. Work out how how much you need to be able to continue living comfortably and come your medical/related expenses, include paying for a carer. Then save and invest life depends on it. /r/financialindependence and /r/fire has some good info (i think there are CA specific ones too). Show her that you’re making sure that you’re both taken care of should your condition worsen, and that you won’t become dependent on her. Even if she ultimately leaves you, you’ll be glad you did this.",
            "In addition to what others are saying about finding more outlets of support (to reduce your dependence on your girlfriend), you may want to investigate social service options should your disability get worse. Your gf is really young and the idea of having to take on so much is overwhelming. If you can tell her that it won't all fall on her because, if your situation degrades, you can get help/support from people who are paid to assist, she may feel less pressure. I don't know if such agencies exist in Canada, but they do in the U.S. \n\nYou may find it hard to do this, but I would look at it from a pragmatic point of view. And, if you need any assistance now, get it if it is available. This isn't just about your current girlfriend, but about your whole life ahead of you. My mother is blind and gets a ton of supportive services. It's not her fault that she lost her sight (she has retinitis pigmentosa - a genetic condition) and it's not your fault that you have CP. People pay taxes to help people in your very situation.",
            "Dood i would think about it the other way , say you get married and have kids but she dies in a freak car accident , what would you do to raise those kids? Have a group of friends that help out? Pay for everything if you are rich enough?",
            "If she wants to leave, let her leave.  Join online dating and put yourself out there.  You will find someone who accepts you without reservations.",
            "I also have cerebral palsy. I got very very luck to where it only affects my left arm. I do a very physical job, but I've never let my arm slow me down. \n\nIf a woman wants to leave you over something that you have overcome to the best of your ability. You're better off. My ex would lean into me a little for it because my shoulders give me back pain Due to my left shoulder muscles being slightly under developed . She'd say she doesn't want to be with someone who will be in a wheelchair later in life etc.etc.\n\nYou just keep doing the best that you can. You'll be alright.",
            "How about you just talk to her about all this instead of crying to a bunch of strangers. She is the only person that can tell u what is going on in her head.",
            "Hello OP, I’m sorry you’re having a hard time right now. \n\nSo, my husband and I both have invisible disabilities. We love each other and care for one another and enjoy each other’s company more than anyone else’s (we do have outside support, do not worry). But there are days that it is HARD. For me as a person with a disability, I think we have to accept that there are days that things are going to be hard and there are days that you are going to have to go to other people for help. When I have those days, my husband does his best to support me. When he has his, I do my best to support him. Care taking is part of a partnership and is especially important in a relationship involving disabilities. \n\nThat being said, I do not think everyone is cut out for it. Looking back on past relationships, I can see that my issues were overwhelming for some at times. The way I see it, if they don’t feel like they can handle that then they need to be free to leave. They deserve to feel comfortable in their relationship and you deserve someone who is willing to provide what you need in a relationship. If the relationship isn’t a fit and your needs are not in alignment, it’s best to let it go. We are overwhelming for some people. I’m not saying that it’s right, but it’s true. It’s part of our experience as disabled people and we deserve people in our lives that don’t see us that way. \n\nThere are other people who will want to be in a relationship with you. Be patient and work on yourself in the meantime. As others have mentioned, it can be very overwhelming if you feel like you are all your partner has. It sounds like you might be putting a lot on her emotionally and she may not be equipped for that or be comfortable with it. I was previously in a relationship with someone with a physical disability. He wasn’t the most independent, much less than what you’ve described for yourself. While I was able to manage that part of the relationship, it was the emotional pressure he put on me that I couldn’t deal with. I was his one and only friend, support person, and emotional outlet, and every negative feeling he had was mine to deal with (not saying you are that way but just to explain). I was his first real girlfriend, so he tried elderly hard to cling on when there really wasn’t much of a relationship left to cling to. It was too much and I was too young to navigate it at the time. So, while you look for a partner, make sure you are keeping your emotional expectations in check and try to cast a wider support net. \n\nSorry to continue rambling but I also want to add that the mom being so concerned and so involved is a huge red flag. I’m not saying that can’t be overcome but you’re in for a rough time with that. You deserve someone whose feelings about you are not changed by other people’s opinions of your disability. \n\nRemember that true partnerships are not found and clung to. They are built with intention by two people who deeply value one another. Do not look for someone you feel like you have to hold on to for dear life. Find someone you can build with. Good luck, friend!",
            "Codependency can be caused by dysfunctional parents but can also be caused in situations of childhood illness and disability. The way you talk about her makes me think you're engaging in some codependent behaviors - if you google \"patterns of codependency\" and go to the CoDA website and read them, does it sound like it applies to you? Things pointed out in the top comment makes me think they might.\n\nI have no physical disability, but you sound a lot like I did back when I had very low self esteem. I have really benefitted from coda meetings and a lot of inward looking and self work. \n\nI'm sorry you're going through this, man. I hear that you are hurting a lot right now and I hope the best for you.",
            "The right person for you wouldn't want to break up at all. Find someone else.",
            ">her mom has been telling her for the past few weeks to break up with me because she can find better\n\nWhat the fuck OP? What a fucking toxic thing to say! I'd be livid.",
            "You gotta let her go. It’s tough, but you’ll get through it.",
            "So I was with my ex for 9 years and even though sometimes I was bothered by his disability because he couldn't do stuff (he limped and his left arm didnt work) most of the time I forgot about him being disabled. Sometimes I did worry about my future because he was on disability and trying to become a streamer (but you sound like you are really trying and you have a good job), so I think honestly it might be that perhaps she is not attracted to you? Or something emotionally. I don't think it necessarily has to do with your disability.",
            "Honestly, save her the trouble of wondering if you're worth it and dump her. Whether it's a disability or whatever, there will always be people who you just *almost* tick off enough boxes for them, but they can't stop wondering if they can grab more candy if they let this handful go and try the jar again. Find someone who doesn't make you hate yourself for not being what they think they need.",
            "This may not be exactly relationship advice but if your disability does deteriorate she doesn’t have to become your carer. \n\nYou can have a health care worker that is able to do “the heavy lifting” which can be beneficial for both you and your partner as there is then no burden on her and you’re also receiving care from a trained professional.\n\nThere’s no hiding away from the ifs and maybes of disability - all’s you can do is have an honest talk with her and what are her limits and how you can propose working around them",
            "So I met my partner when I was more far functional with my disability. He knew about it from the get go. He knew it could get worse or it could not. He didn't run or doubt me or hint at breaking up if it did. Then it did get worse. He didn't run or say he was going to leave me because we love each other. It's tough on us both and I still do as much as possible for myself. I'd honestly be an anxious mess afraid to admit anything was wrong with me if my partner hinted at leaving me if my disability got worse. That would be a source of constant fear and anxiety in the relationship which isn't healthy for either person. \n\nAlso does she understand CP isn't degenerative and most people with arthritis lead functional lives? It's also rare that you get arthritis as a morbidity and that's what fully disables you. Plus there are a lot of arthritis treatments these days. \n\nI would explain this about CP and arthritis and if she's still acting like this, then I'm sorry but she isn't the right fit for you. Marriage vows (I know you're not married) is in sickness and in health for a reason. Do you want to be with someone who you fear will leave you at any moment due to your health or do you want to find someone who loves you for you and will stick with you?",
            "While Cerebral Palsy is not a hereditary condition, researchers have discovered that hereditary factors can predispose an individual to Cerebral Palsy. Although a specific genetic disorder does not directly cause Cerebral Palsy, genetic influences can cause small effects on many genes.\n\nso... this would mean her future may include taking care of a small child who may be health impaired, AND you. \n\nvs. let's say, having a fully healthy male partner that would not need help himself, and so would help with a HEALTHY baby. \n\nshe is a young woman. if you truly want the best life for her, I'm sure you would have figured some of these things out yourself. Your post doesn't reflect anything remotely akin to concern for her future, and how you plan to alleviate her difficulties if she chooses the much harder path of life involving starting a family with you. let a lone, alleviate the unborn future child/ren's difficulties. \n\nI understand you did not chose to be born with CP, and this is deeply painful and unfair to you. however, she is in a position to not have CP as part of her life, nor her children's lives. I'm sure that had life been less cruel, and you would have been in a position similar to hers, you would not have chosen to have CP as part of your life. \n\nBe thankful for the love and support she had given you, be understanding towards her choice of her own future  and LET HER GO. REMAIN FRIENDS.",
            "This is too long so not reading it \n\nBut lemme answer according to the title \n\nListen I'm sorry about ur disability I hope things were better for u but ur gf have all the right to leave",
            "I'm married to a man with CP who is mobile but has balance issues. He's been through arthritis, orthopedic surgery, injuries, workplace discrimination, just a whole bunch of crap related to his condition. Also, when we were first dating, my mom tried to get me to break up with him because she was afraid I would end up being my husband's caretaker instead of his life partner. None of these things matter in the least as far as whether I want to stay with him. He is a great guy and I'm not going to break up with him because of anything related to his CP.\n\nHere's the thing: a woman who loves you for you won't care that you have CP. But it's also important to acknowledge that your CP may affect your ability to do stuff -- not just what you are personally capable of doing but also the things you can do as a couple, because of distance, accessibility, etc. Communication is key. Talk about how you both feel. A medical condition can affect all aspects of your life but your partner can be your greatest ally in finding ways to live your best possible life.",
            "I'm really sorry you had to go through this. I have Ehlers Danlos Syndrome, and if I have learned anything from my relationships, personal illness can get in the way especially if the person doesn't see you as a serious option. I know it's really hard and it hurts, but the right person will see past your disabilities and not see being a support to you long term as a bad thing or a burden. I wish you the best! Also, I'm a software developer too! I just have had to focus on my health after my Bootcamp and would like to freelance or start my own business.",
            "So I have chronic health conditions and was diagnosed with allergies. I'm in support groups, people who live with the conditions or have other conditions. My ex was very supportive in the beginning but towards the end there was a shift and he kept commenting on future hypothetical situations that may or may not ever happen or how his family would feel about my health. It got to the point where he said something very mean and hurtful about my health and we broke up. Recently he reached out and told me that he was feeling stressed and overwhelmed by other things, and lashed out at me about my health but the problem wasn't my health. The problem was he couldn't talk about his emotions and he didn't want to talk about his problems. My advice to you is for your girlfriend to join a support group for family members and friends and for you to join a support group too. Sit down and talk about what the actual issues are. And remember, sometimes people can say they are really caring, but can't put the effort in to actually be caring. So if you do breakup, it's not because there is something wrong with you.",
            "OP I've got cerebral palsy. Same diagnosis as yours. I've never heard of us having magically being handicapped in our later years unless we get into an accident. Arthritis etc  is an age thing which most ppl do get. Your gf is projecting insecurities. Nobody is perfect and companions are for better or worse. You've got this. You seem like a great guy. I hope u find a way to be happy with or without her.",
            "Someone who actually cares about you would stand by you regardless of disability.\n\nLet her go. You deserve better.",
            "Brother I don't even have a disability and i find it impossible to hold a relationship and im almost 40.  Women are independent these days and it makes holding a relationship tough. Youre young. If she doesnt love you for who you are then let it end now vrs later when it can really be complicated for you. Find somone who appreciates you for who you are and not what they want you to be. Try online dating at some point. That seems to be the way people date now of days. Facebook has always worked for me too.",
            "I'm so sorry you are going through this. Remember when you thought you couldn't find someone? And then you did? Keep that in mind and apply to the future. There's really nothing you can say to convince her and you shouldn't have to do that. Do not drive yourself crazy over cruel people please. I know it's hard but this is about them not you.",
            "It's going to be okay, so try not to let your anxieties overwhelm you. \n\nIt sounds like you are very capable, and that is awesome. That means you are capable of paying for and arranging home support work should you need it in your later life. In Canada there are many programs to help you receive care in your home privately if you need help with some tasks as you get older. You could pay for private home support for only a few tasks a day if you like, like helping you get up out of bed and helping you get dressed. We do that for a family member, he is independant so we pay for 2 hours of support a day, to help him get up, and to help him get to bed. He can handle the in between stuff with devices like those chairs that stand you up with a motor, and we are just a call away if he needs!\n\nMaybe start a fund specifically for your medicle needs that won't be covered entirely by ON Health, like private home support and medicle devices that may be able to help you if you reach the point of needing them. Your doctor should be able to give you the best advice for your individual situation since CP is such a variable disorder. You could be this same level of ability into your 60s, there is not telling exactly how it will play out as you age. Your doctor will be the best help there.\n\nI know a woman with CP,  her case is more sevear than yours it sounds like, with needing a speech device and a motorized chair to get around and communicate effectively. She has home care and family help. She is a university graduate, has a boyfriend, goes shopping with her girlfriends (both regular and differently abled), goes out to restaurants, and has a taste for expensive champagne lol! \n\nPut yourself out there and make some more friends while you are at it, if you can. Your girlfriend sounds like she loves and cares about you, her mother sounds like she might have some problematic biases against people with disabilities. Having more friends around is always a blessing and helps with the loneliness. Also it may alleviate some pressure on your GF if she is feeling like she is entirely responsible for your emotional care. Not saying that she dose, just if you are concerned about burdening her too much that could be a consideration. \n\nAlso a therapist is not a bad idea. Someone who can help you work through your darker thoughts in a constructive way, someone that understands the burden of living with CP. It might help. \n\nHave a think on these things and I hope it helps in some way! Good luck!",
            "Ugh...dude. Solidarity. It's a fear I've never said out loud. I don't have advice, but I sure AF know how you feel.",
            "That's her choice, move on with your life."
        ]
    },
    {
        "post_id": "ccti94",
        "author": "little_blue_fishie",
        "title": "My (35F) boyfriend (33M) of 5 years secretly took a cab to take \"a walk\" at night while out of town.",
        "url": "https://www.reddit.com/r/relationships/comments/ccti94/my_35f_boyfriend_33m_of_5_years_secretly_took_a/",
        "score": 2369,
        "num_comments": 576,
        "created_utc": 1563046907.0,
        "selftext": "My 33M boyfriend is in San Fran for an interview. We were video chatting w/ our 3 year old after the interview yesterday. Saying he missed us etc. All normal happy stuff.\n\nHe left NJ at 3am for the flight there, told us he was exhausted and headed to bed.\n\nI messaged him at 2:10am my time (11:10pm his) that I was up bc our 3 yo wet the bed again. He responded with 'poor girl' and nothing else.\n\nThis morning we video call him as was planned during breakfast for our kid to say hello to daddy. He answers without video which is not normal. We call frequently with video. I asked when did you get home and he kinda hesitated before saying 3am. He offered nothing else.\n\nI found this morning he took a lyft to Chinatown at 1120pm PST and didn't cab back to his hotel til 3am.\n\nHe messages me nothing, says nothing so I message him after breakfast about being out all night and he says he needed to take a walk. Says no cheating happened.\n\nThis man has a terrible sense of direction. Cant read a map etc. But went for a walk in a city he doesnt know from 1130pm-3am... Huh?\n\nAnd mentioned nothing about it even though he knew I was awake here at the same time changing sheets on the east coast. Why not mention that he cant sleep and am headed out? No pictures or comments about his walk. Says he was going to mention it in the morning.\n\nThoughts? My nerves are shot. He has a major history of being dishonest. This was our time to be transparent and open to rebuild trust for our family. Why leave his hotel (which is already on the water with a fantastic view) in the middle of the night?\n\nI'm ready to pack up and leave him.\n\n**Edited to add (after suggestions from commenters): He started living sober in December but also has a deep history with gambling and prostitution.  I made some serious and stupid concessions to forgive and rebuild because of history, hope, having not many options of my own and a small child. Seems he is possibly making the same choices and traveling the same path anyway.  He makes a lot of promises and I wanted to believe we were building but is apparently allergic to truth and loyalty. **\n\nTL;DR Boyfriend out 1130pm-3am when he said was going to bed. Has history of lies, says didnt cheat. Says couldnt sleep, took a 20 dollar cab to Chinatown to \"go for a walk\". Sees no issue with what he did. I feel gaslighted.",
        "permalink": "/r/relationships/comments/ccti94/my_35f_boyfriend_33m_of_5_years_secretly_took_a/",
        "comments": [
            "He loves gambling and hookers and now he’s out taking 3-4 hour walks at 2 am? We all know he wasn’t taking a walk.",
            "Last time my friends and I were walking around that part of San Francisco at 3 am we were all on drugs and looking for more drugs.",
            "Yeah that whole story stinks of abnormal. Why take a cab to walk? Surely you’d just walk out of your hotel. 4 hours is a pretty long walk as well. I don’t think you’re being unreasonable for questioning that story",
            "> I message him after breakfast about being out all night and he says he needed to take a walk. Says no cheating happened.\n\nSo you asked him, \"hey, how come you were out all night,\" and his answer was \"I just went for a walk, I didn't cheat on you\"?\n\nHe cheated on you.",
            "I was going to ask if he cheated on you before but then I saw you mentioned him being sober, which to me implied he had an alcohol problem in the past. This was interesting to me because when I was reading your post, everything you said sounds like a guy who went out and got drunk. Especially if he has a history of it and that would also explain the secretiveness. \n\nYou have to look out for you and your child so Im not trying to be an apologist for this guy. Im just saying substance abuse is mental health issue. Its not some moral failing on his part, whereas cheating would have been\n\nMaybe him going off and getting drunk is worth leaving him over to you as well, I dont know anything about yall besides this post. Just wanted to say my reading of this sounded just as much like a guy who went out drinking as it sounded like a guy who cheated. What matters is how different the two are regarding your trust in him",
            "Your trust in him seems shot regardless of this issue. If you can't come to a resolution with yourself, he's obviously not going to change. Just leave and find someone you can trust.",
            "Im so sorry OP,\n\nI know my comment is going to be lost at the bottom, & you prob wont see it, but I still wanted to add my voice to the chorus of others trying to be honest & supportive of you....\n\nI wish I could say something that would help alleviate your pain - im sorry i cant 😔\n\nIve notices lots of ppl focusing on the fact he was out so long at night, taking a lyft, 'walking' pondering on drug/alcohol / cheating behaviour- & that is *all* important stuff-....\n\n BUT- the thing that ***really*** stood out for me , was the fact he didnt answer your videocall with your child... im a mom & a step mom, so i understand complex family dynamics- but i also understand how big /important video calls with a parent are- especially to very young kids.... *especially* when that parent is usually around, but isn't home tonight.... \n\nThat set off like- the fireworks of red flags for me,  coupled with his \"poor girl\" reply- .... Im so sorry he has treated you/your family with such callous disrespect. ....\n\nIf he was having trouble sleeping, & knew you were awake, why not just lay in his hotel bed alone, talking to you until he was tired enough ti drop off to sleep?? \n\nI know if i was away from my family overnight,  for any reason- i would have trouble sleeping too- but the thing that would bring me the most comfort, would be talking to / seeing them in a video call. .... (esp if thats already an established thing within your family!)\n....\n\nIdk what his past indescretions were, but if this was meant to be the time for your family to rebuild trust- i believe it was serious stuff- & he is not taking it seriously enough.... ..\n\nI dont knkw you or your family, but I do know what it is like to be up all night with your nerves & anxiety in hyperdrive,  while your oartner is off fucking around, & not even bothering to videocall the kids.... at a minimum, thats some serious selfishness.... but i feel like you already know what was *really* going on.... -& now its time to work out what you want your next step to be, for you & your child....\n\nThis is heavy, serious stuff, & he needs to treat it as such, bot gaslight you &make you feel like you're being unreasonable - i promise- you are not....\n\nYou need to taje care of your child, & sometimes what is best fir the child, is for the parents to seperate, rather than trying to keep a relationship together 'for the kids' - \n\nTheres - so much wrong here....\n\nI couldnt recommend seeing a counseller high enough- having an outside, objective person who you can be completely honest with, is absolutely a huge help..... sometimes it can take seeing a few ppl till you find someone you 'click' with,  but when you do, it is totally worth it!!\n\n(& if he suggests couples counselling, thats great! Go along if you feel you want to, just make sure its not your personal counseller that he wants to come see.... if he shows *any* sign of not wanting you to see a therapist on your own, that is another huge red flag.... )\n\n....\nIm sorry if i have written too much, or spoken out of place, if you've read this far down, thank you-\n\n(I promise i didnt take time out of my day to write all this just to waste your time, or for no reason- I did it because i have been in some really shitty relationships, & I simply didnt know just how bad they were until i was out of them, ... -& because i want you to have a happy, safe, peaceful, honest home to raise your child in)\n\nOnce kids are involved, everythimg becomes a billion times more complicated - but as a mom- I know you will do the right thing by your child, even if it's incredibly hard & painful for you - being a mom gives you super powers! Dont be afraid to use them!!\n\nI wish you all the very best - with much love & hugs!\n\n❤💖💜💙💚💛",
            "Sex or drugs are the only reasons he'd be in that neighborhood at that time.\n\nHe's being dishonest again.",
            "Hi nobody really walks around that area especially at 3am. Bars in general ar closed. I'm from SF. At the edge of China Town between there and North Beach, near Broadway ther are a lot of strip clubs. Is it possible he went to one and didn't know ant to say anything? There are a few bars but not too many things you'd actually want to do in Chinatown. It's a pretty empty area that early in the morning. I've done it with friends when I was in college. We walked through all the way near the pier to skinny dip.  But yeah my best bet is strip clubs.",
            "There’s a ton of strip clubs on Broadway right by that area. Maybe he spent some time over there. Idk if that’s considered cheating on your end, but definitely a possibility.",
            "Did he offer an explanation about no video?",
            "Seriously, terrible liar. Say you went for a cocktail. Went out for snacks because you couldn't sleep. But took a cab to go for a walk? In the middle of the night in a strange city, for four hours? Highly unlikely.",
            "> He has a major history of being dishonest.   \n>  \n>  \n>  \n>  \n>  \n> Has history of lies, says didnt cheat.",
            "> He has a major history of being dishonest. \n\nTogether with\n\n> Says no cheating happened\n\n...tells you that he cheated.\n\nHe gave you the Unasked For Reassurance, which always indicates that fucking took place.  Sounds like he visited a prostitute?\n\nBefore you dump him, look up DARVO, because he is going to do that with a vengeance.  He will also cry, a lot, and demand comfort.  He will lovebomb.  Hell, he may threaten to take full custody of your child if you leave him.\n\nWhat I'm saying is, he's probably not going to take it well when he realizes that his manipulation isn't working anymore.\n\nSo.  See a lawyer.  You need to understand what your rights and obligations are according to your state law.  Do NOT allow yourself to be cajoled into settling custody issues outside the court:    you might as well start wearing a sign that says, \"Kick me!\"  It doesn't matter how congenial the separation may be, the two of you are temporarily adversaries--and believe me, he *will* get a lawyer, not matter what arguments he makes against *you* getting one.\n\nStrike first.  Get a lawyer.  Get armed with actual information.  *Listen* to your lawyer.  In fact, have your ex communicate to you only through your lawyer, at least until the custody agreement/division of goods/child support has been ratified by the courts.\n\nStart making your plans:  where are you going to live, for example?  How are you going to divide finances?  What joint items are you planning on keeping, etc.  Gather up Team You and ask them for help:  you will need your social network more than ever.  Ask not only for practical help, but for distraction as well.\n\nKick him to the curb.  Don't listen when he sobs that he'll change, don't fall for the easy delusion:  liars gonna lie, and cheaters gonna cheat.",
            "I live in San Francisco and sorry to break this to you but nobody walks around Chinatown at night. Everything is closed and it is sketchy.",
            "Leave him. Find someone who's honest and cares about you and your child. This behavior is bizzare. Combined with his history, he definitely isn't a good person to help raise your child. People can change, but it doesn't look like he's trying hard enough.",
            "Check his Google dashboard. It tracks your every move, see if he was \"walking\".",
            "Lol....im glad you finished with I know, I know.....\n\nBUT I lived and breathed following my ex on Google maps, for way longer than i should have (a year) and it was NEVER  more than less than 100 ft off, which is about 5 normal length cars, bumper to bumper....and that was rare. Google wouldn't be in business if that was the case, right? That's a perfect example of him trying to manipulate the situation hun.....and I know the cliche response to what I'm about to say is but I say don't ask, just look, Google has no reason to lie to you, he does. I had a need to know the truth, I couldn't get right until I knew for certain and Google gave that to me.....sgain I know people will say \"you should of just left\" \"there was no trust in the first place\" but until ones faced with that situation, can they even speak on it and even then, to each his own.....I choose to get the facts by any means necessary and I don't regret doing it at all......\n\nI also checked the bank statement for large amounts withdrawn and where those atms where located. I discovered my ex taking out $200 @ a time, late night and discovered he had a regular escort he hired while away on business. That put my health at risk and I had a right to know this info and he surely wasn't going to tell me.....im a normal female, not crazy or a lunatic, I have a real grip on reality, have normal healthy relationships but I had a need to know and the guts (because it was nerve racking to \"snoop\") to find the truth for myself. \n\nSo yes, you basically know what he was doing but you deserve to know exactly what and by any means necessary.....\n\nI know what you're feeling and basically it is the worst, it's so consuming to wonder, once I knew the truth then I confidently left him.\n\nBut only you know what you need to be at peace so be comfortable in whatever it is you decide ...xoxo",
            "Um, he most definitely cheated. Also he's a *terrible* liar... if he's going to make up stories he should at least make them somewhat believable. Ffs.",
            "He was paying for sex.",
            "So, he lied to you about going for a walk. You know that. With his history, I'd just sit down and tell him \n\n\"You have one chance to tell me the truth about where you were that night.\"\n\nBut no matter what he says, I think you know you can't keep up with these breaks in trust. Small lies are still a huge betrayal. Even more so if there is no reason for them.",
            "Having lived there I can say that out “walking” alone at that time of night without having destination in mind means he’s looking for sex or drugs. Getting a taxi and paying 20 just to walk makes his story even more ridiculous.",
            "Who says no cheating other than a cheater? That’s never my first thought. It is the first response of a cheater I have found though...",
            "He went for a massage with happy ending in China town.",
            "He has cheated on you before, and you have to ask? He cheated.",
            "I think you know what happened already.\n\nSomeone who isn’t cheating doesn’t just bring up that “no cheating happened”.\n\nHis story stinks.\n\nHe answered without video which is out of the norm.\n\nHe has been dishonest in the past.\n\nYou didn’t mention it but I assume dishonest in the past means he has cheated on you in the past but maybe you didn’t want to color our opinion of the situation.\n\nIt seems like there is a phycological phenomenon with a good percentage of people that if they are far from home then cheating isn’t really cheating which of course is BS but that is what I’ve heard.\n\nI don’t think this guy will ever change so if you have issues with him cheating on you I would end it.",
            "Why did you post this thread? You know what's going on.",
            "When someone you know does things that are you of character it going to make your intuition rise up. You can’t fight what your body is saying.\nWhy wouldn’t he mention he can’t sleep and treat he was going for a walk. We are all entitled to peace and quiet and if we have a busy mind, to find things that will help.\n\nI don’t even know you and it feels fucky.\nHe didn’t even talk about how and why other than a fob off.\nI’m not sure what you can do from here.\nUnless you can see where he went exactly.\nHe might have been totally innocent but again- why wouldn’t he say something.\nIf guilty then you have to sit and talk about things.",
            "Already sounded iffy, then I got to the part of him being repeatedly dishonest in the past...",
            "Yeah he was in a tourist trap area bars restaurants and rich people drugs.",
            "Perhaps he was out at a rub and tug or a strip club? Could be that he asked a cabbie \"Where do I find some action?\" and the guy brought him to that area...",
            "Not to discredit your suspicions but it sounds like he relapsed and is maybe ashamed. Who knows what he may have gotten into during that time but the bigger issue is he's not being forthright with you at all.",
            "Sounds like my ex. Caught her in so many lies (including cheating), and she would continue to do shady shit exactly like this. It's so hard to deal with because you have no proof of anything yet it's undeniably atypical and extremely shady behavior from the person. Makes you go insane. Which for me meant that I just waited until something provable happened and broke up. Of course you know there's no future with that guy.",
            "Chinatown in San Francisco is across the street from the strip clubs in town, just in case that might have been where he actually walked to.",
            "He's lying & hiding something. Probably cheated but, it's possible it was something else like drugs.  When it comes down to it, it doesn't matter what it was. He lied and hid something. He has shown you his true character. Believe it! Now dump his ass ASAP. This relationship isn't going to work long term anyway. Don't waste any more time on this fucktard! End it now!",
            "On the other hand, I can see how the situation could also be that you’re somewhat very concerned and overbearing. You seem to be interpreting a lot based on nothing **but** what you snooped. Question: Did you just happen to see that he took a cab, or did you keep digging and interpreting until you found something to be concerned about? \n\nI’m just voicing the other possibility because reddit defaults withbeing on OPs side and and the usual “end it right now!” Replies. Maybe that’s not enough context here to come to that conclusion just yet...",
            "Always trust your gut. If it walks like a duck, sounds like a duck, *looks* like a duck, it's a mother effing duck. \n\nHes lying and stumbling and racking his brain because he did something he wasnt suppose to. I love this quote, \"it's not the crime, it's the cover up\" that gives it up. Using basic logic, he was very obviously not on a walk. Even if he wasnt cheating, he was doing something that he shouldnt be. I wish you the best of luck!",
            ">  I made some serious and stupid concessions to forgive\n\nBottom line - you going to be stupid again? At this point, stupid is an active choice.",
            "Oh I am so sorry, OP. I was in a very similar situation. My now-ex-fiancé went to see his parents to North England by train and took a little  Uber detour in Birmingham where he was only supposed to change trains. I accidentally found out about it. And he lied, also said that he went “for a walk” in residential area away from central? Long story short - I found out everything few months later when discovered his bank statements with dodgy withdrawals. Paying for sex, I figured. He would deny everything. Only admitted after I got really angry and told him that I refuse to be lied to and *I just know know*. I forgave him. We started building our relationship again, but guess what? His first trip away to Spain - and I went through his phone on his return (I know, it’s wrong, but it’s not the first time he lied) and found Spanish hookers numbers in “blocked” contacts. Now I know that cheaters gonna cheat, liars gonna lie. \n\nWhenever I would doubt myself I would ask, if a very close friend of mine would come to me and told me this story, what would my advice be to them? \n\nYour situation is dodgy and he is most definitely being dishonest. Don’t let him gaslight you and try to normalise this behaviour. I don’t know what you will decide to do, but lying is most likely going to stay with him. He will just get better at hiding it (eg will not take cabs, won’t leave traces). I would leave and wouldn’t look back. Do it for yourself and do it for your daughter",
            "I used to take business trips to SF once or twice a year, every year, for \\~8 or 9 years.  \n\n\nAnd I frequently couldn't sleep and went out for random walks thru the city after midnight.   No cheating, no drugs involved, just walking around a random city late late at night.    \n\n\nPretty cool space to be in.  \n\n\nNot 100% safe, mind you, but I escaped unscathed.  Of course, I also dressed pretty much like a random wandering hippie at the time, so I kinda blended right in.  \n\n\nI have no idea what your boyfriend was up to.  Just tossing out that, yes, in fact, wandering about SF in the middle of the night for no reason but to wander really does happen.",
            "Maybe there is a perfectly innocent explanation for this. Maybe he is a Russian spy and he is meeting with his contact?",
            "If you decide to take him back, MAKE SURE YOU GET TESTED FOR STDs IN 5-6 WEEKS!",
            "You have already left, and know one could blame you with his record, the biggest fear for me would be STD ! BE SAFE TRUST YOU INSTINCT, so sorry for you and your baby but you need piece of mind, and I feel you will never have that with him...good luck and be safe...",
            "Did i miss  something....why the automatic thoight hat he is cheating.  Previous history?",
            "It's cheating or drugs.\n\nAnd I say that as someone who likes night walks. A 4 hr one is just weird.",
            "Just north of Chinatown on Broadway are a bunch of strip clubs",
            "Chinatown and the surrounding areas also has a lot of strip clubs. He could have gone there. While embarrassing and probably not something you'd want him to do, it's not necessarily that he went there for a booty call with a tinder hookup.",
            "Regardless of the truth, this would haunt me for the rest of our relationship.",
            "He may not have cheated, but, he could have been looking for drugs?",
            "I’ll be the odd one here and say that I love going exploring at night. I generally don’t tell my husband what I did other than went and explored.\n\nThat said... I wouldn’t lie either. You were adult enough to have sex and have a kid, you are adult enough to ask him point blank what he did. \n\nIt took my husband a long time to understand that I actually do go explore some times at night - but, like I said, I am not a normal case.",
            "I live in Nob Hill near Union Square/Chinatown and the prostitute problem is out of control. That said, he was probably just high.",
            "Although it is definitely not okay for him to deceive you, consider it might not be cheating, but something else he's ashamed about doesn't want you to know (drugs, gambling...)\n\nAll that said, now that doubt has been raised, you need to talk to him about it and ask him to come clean. If what he discloses crosses a hard line for you, then you know and can make a decision. \n\nI'm sorry, that's a really shitty thing and if that's his pattern, you and your child may be better without him. I hope for the best!",
            "Regardlsss of what he was doing - you’ve said that he has a history of dishonesty, that this was meant to be a time of utter transparency and he is not being transparent or clear. That in itself speaks volumes. He might have been walking around, he might have gone to meet people on the trip with him and got totally lost... or he might have been up to something seriously sketchy. In a way - it almost doesn’t matter. You’re looking for clarity, honesty and a reason to trust him and he’s not giving you it. Do you want to live your life this way?",
            "I've heard this exact excuse before. Guess what? He cheated. Be careful.",
            "Drugs? Needed weed to help sleep. Or more",
            "I'm thinking there might've been a brothel trip involved",
            "As I was reading your post, I was very *\"uh oh!\"* and then I got to this:\n\n> He has a major history of being dishonest.\n\nYou need to make a life for yourself and your child without this cheating liar. Pack up and leave him. Clearly honesty, faithfulness, and respect mean something to you, and just as clearly mean nothing to him.",
            "I used to live in SF, Chinatown is essentially the red light district there (North Beach has strip clubs & the Tenderloin has streetwalkers, but Chinatown is where people go to find brothels & massage parlors). Going to Chinatown at 3am & then acting sketchy as fuck about it...that does not bode well.",
            "[deleted]",
            "People like that will never change.  Old habits die hard.",
            "I live in San Francisco. I can tell you that’s a GREAT area for prostitution (“massages”). He probably wasn’t gambling if that makes you feel any better...",
            "Whenever your headline includes the word \"secretly\", it just about telegraphs bad news to follow.  And it did.\n\nTrouble with honesty. Your not talking simply about a quality for a person to have, it's a cornerstone for every successful marriage. Lying cannot be part of the modus operandi of one of the spouses. Can't be,  I'm sorry. \n\nBetter than a good chance he's lying, you know that. What exactly he was lying about becomes almost immaterial. Probably wasn't shopping for a gift to bring home to you.\n\nIt's the lying that's the big deal,  the clincher, the decider, the breaking point. Were not talking he went to a topless joint with a few fellas after work and didn't immediately own up to it. Hell, most wives overlook like like a child grabbing the last piece of fudge earmarked for his little sister. Harmless, mostly.  No, he is hiding something bad, and he has history to go with it. \nI'd tell you you're headed for a lousy place, but I'd rather tell you to let this be the final confirmation of what you've known for a long time. It is a lousy place, but the good news is that it's also a temporary one. Don't let it drag out, or, more to the point, don't let him drag you farther down this path.\n\nYou know what to do. It's difficult but for only a short time, as the world turns. Don't let too many more spins on it's axis to pass.  And let it all pass.\n\nNext time--and there will be a next time, and soon--solve the honesty equation first. Generally, unless there are big hidden surprises, everything else falls into place. \n\nNo more time to waste, sweet one. Get the hard stuff over with; you have a promising date with a magic man. He's waiting for you to meet him. Go find which table he's sitting at. He'll be the one with the easy smile and soft eyes, and he will be watching you cross the room. You'll see him. I promise he's there.",
            "You have way too little trust in this person to have a child with them.  Too bad you can't unring that bell.  You should make better decisions in the future.",
            "Has he cheated before?",
            "Monitor his credit card bill. The best scenario is that he went out for prostitutes. Many Asians brining infamous models to the west coast for that.  (But in that case he may pay cash instead of credit cards so also check if he withdrew cash over 200 around that day)",
            "What is his history of lies been about?",
            "A bit odd. A lot of the grocery stores shut down around 7-8pm here, specifically in Chinatown. (I live in SF.) The only thing I could think of that late and still being open are bars. Chinatown is kind of sketchy in a grimy way. Unless he’s there often, most people avoid the area that late.",
            "To be completely honest, yes, this looks pretty dodgy. If he has a history of lying and you don't trust him, that probably needs to tell you something about the relationship, regardless of whether this incident was legit or not. I would typically be prone to calling BS based on his pattern of deceit the same way MY friends would believe the opposite if it had been me based on my patterns of doing random weird shit.\n\n\nI have personally, on more than one occasion, taken a cab/uber at ~1am to a semi random destination in a city I wasn't familiar with, just to wander around that area for a couple of hours as a bullet list item and/or to clear my head. SF Chinatown was a 10 minute walk from one of those and was almost added to the route.",
            "So your SO has a history of cheating, visiting prostitutes, gambling, substance use issues, and lying...\n\nWhatever he was up to last night does not bode well for your relationship. If he cannot do the bare minimum of being honest with you then there is not much you can do to salvage this",
            "Someone said something about Grindr but maybe you can check his recently downloads and see if Tinder, Bumble, Grindr, Hinge, etc. are in recent? If he didn’t know anyone beforehand I’d imagine that or strip club.",
            "OP, no one is psychic online. Your guess is as good as mine. The first idea - if one could call it an idea - is he went out for a bj or hookup. Sorry but you asked. Drug, sex and alcohol (possible mental diseases) are the most likely reasons. Nothing good comes to my mind.",
            "Google Maps save location history by default. Actually wandering for four hours would look pretty different from going to some place and staying there.",
            "Before I divorced my lying, cheating ex husband, I felt confused a lot.\nI now know that when I feel confused, its because I havent been given all the facts.",
            "Watch out for STDs. You don't know what happened there, or should I say, what he did while he was there.",
            "Perhaps he can't sleep\n\nPerhaps he didn't bother to tell you that\n\nI know you accuse him cheating, but not enough evidence",
            "I came here to say you know you deserve someone way better and you don’t have to put up with this. You are strong. You will continue to be a strong person. Don’t let someone continue to disrespect you. Once you leave for the better you will realize how much better life is not having to worry....",
            "Have you tried telling him you know he was out.. And asking \"what you were really doing\" I've come from a relationship of honesty not beating around the bush if I'm uncomfortable with what he does I let him know.. Maybe try to be stern like video chat\" ask him to show you just so you feel comfortable.. I mean you are home with his child that's the least he can do.. Being a mother also I know it gets frustrating when your significant other is on work trips or just out in general.. Jealous hits the mind.. Your like, what's he doing? Why hasn't he called? So on so forth.. But all you have to be is up forth about things.. Trust me if he's hiding something you'll know..",
            "My theory (while giving him the benefit of the doubt) is that he was away from home and decided to grab a drink and maybe he overdid it a little and wound up staying out at a bar until closing.  Probably went to an after-party at someone's house to drink more and then went back to hotel at 3...\n\nHe didn't answer the video call because he didn't want you to see his face.  Obviously you would know what he looks like hungover and could spot it immediately.  \n\nI'm guessing he didn't make the choice to get sober on his own?  Something happened that made him getting sober a necessity for your family to stay together?  Maybe this is the first time he's had an overnight away from home that he could let loose?  \n\nI know that alcoholics have to hit rock bottom and decide they want to change their life for their sobreity to stick.  Was he working the 12 steps and going to meetings?",
            "Honestly sounds more like a quick drug run instead of infidelity. Let the guy have fun if it’s not a problem",
            "OP, context from your thread comments should be present in the main post. If your boyfriend has a history with alcohol and prostitutes, then you already know the answer to this one.",
            "your husband is a terrible liar... also he does drugs.",
            "\"He has a major history of being dishonest\" thats your answer, leave him. That is a huge red flag imo.",
            "He has a major history of being dishonest?\n\nListen to your instincts. You know he's full of shit.",
            "Sounds like he was looking for sex... Maybe with prostitutes. Use protection.",
            "There are a bunch of strip clubs just outside of Chinatown in SF, just FYI. Sorry you’re dealing with this, OP. Hope it turns out to be nothing.",
            "Story is sketch. Was there cheating? Maybe not. Maybe drugs or booze. Or a strip club. Who knows. But definitely sketch.",
            "Wait isn’t he also massively jet lagged? When I visit SF from NYC I’m like in bed by 10 every night",
            "My heart says he cheated. You don’t have to trust that, you don’t know me. If your heart says he cheated, you have to decide if it’s something you both can recover from or something you should move on from.",
            "Girl get out of here. It was sketchy BEFORE I read your comments OP. Baby girl he’s cheated before and likes prostitution?? And now he’s on the town alone in a different city by himself with FREE REIGN? And goes “for a walk”. And then can’t face you on video chat? He definitely 100% cheated. Get out. Dump his ass, his story makes absolutely no sense even before all of the background. I’m really sorry love :(",
            "The thing that I have trouble getting past is the transparency. If he truly went for a walk then I would think he should recognize how sketchy that sounds and give you details. He went and saw this area or landmark or tourist thing. He should have a story to share for being out that long. Even if he sat on a bench and played games on his phone because he couldn’t sleep. Walking around for 3 hrs in the early morning is strange at best. Maybe it was all innocent, but if he has a history it’s hard not to judge.",
            "He is up to something likely..",
            "How long since you began trusting him again? Had you been trusting each other the past year and he gets a job across the country and this just came up out of nowhere, or did you see this coming when he told you about his new job? Were you skeptical before he left that something like this might happen or were both of you in total trust mode?",
            "Pressure him until he says the truth.\n\nMayne no cheating but drugs or alcohol",
            "[deleted]",
            "Your situation sounds so much like mine. I had an ex boyfriend for 5 years and we had a kid together. After being caught so many times doing dishonest cheater things by the way he was also an alcoholic, all his attempts to prove to me that he was actually doing what you supposed to be doing he was once again caught doing things that were detrimental to our relationship. The final straw was he said he was going to be somewhere and like a stalker girlfriend I went to the place he said he was going to be and he wasn't there. He didn't show up to that place for three more hours. he gave me some wild story about having been to a restaurant alone refuse to show me his phone. I realized at that point I didn't care if he was telling the truth or was lying anymore. Either way I never believed him again. I ended the relationship that night. It kind of sounds like this is where you're at. at this point it doesn't matter if he's lying or telling the truth. You're not going to believe it either way. And I think it's a good idea that you don't believe him. It's always that point were you realize they pushed you too far.",
            "Sounds like he's doing his same old things, question will be well be a doormat or stand up for yourself? Best of luck.",
            "If you're out in San Francisco after 9pm you're up  to no good.",
            "Why would you trust someone like that let alone have a kid with?",
            "\"Has history of lies, says didnt cheat.\"  so what you're saying is that you enjoy being lied to?  Nice.",
            "Hey OP, please please get a full STI check! If he has a history of prostitution and cheating, you could have been exposed to something!",
            "Why are you still with this man?",
            "It’s hell trying to have a relationship with someone you can’t trust.",
            "OP this is probably not the case in your situation but sometimes I feel self conscious and embarrassed having to tell my girlfriend that I'm playing Pokémon Go as a 26 year old. So if I can't sleep, I'll grab my phone to go play a little and just tell my gf I'm going for a walk.",
            "I'll add that in SF there are some rough areas and I could see a scenario where I'd cab to somewhere else to safely walk. However, Chinatown is not that place at midnight.",
            "He has a history of alcohol abuse, gambling and prostitution? And you're wondering if he \"took a walk\" in San Francisco's China Town from 11pm-3am? \n\nHe's using drugs, drinking, visiting prositutes and gambling. At least 3 of the 4, minimum. \n\nVery sorry you're going through this. Your instincts are 100% spot on. \n\nSource: former alcoholic and former problem gambler with 7 years clean.",
            "Maybe he just wanted to walk through China Town",
            "Communication, respect, and trust are necessary for a healthy relationship. When one is damaged and needs to be rebuilt, the other two become even more vital. Rebuilding trust takes complete honesty.\n\nAddiction is like having a third person in the relationship. For the sake of accountability, it makes transparency doubly important.",
            "Lived in San Francisco for 8 years. Chinatown shuts down roughly about 8pm every night. No lights, no shops open, nothing. However; Broadway street intersects with Chinatown, which is where all the strip clubs line up. Trashy ones at that. Im certain thats what he was doing.",
            "Controlling much? Ever just wanted to get out and explore a new place alone?",
            "\\>  He makes a lot of promises \n\n&#x200B;\n\nThat means nothing from a liar.",
            "[deleted]",
            "Hi hi Bay Area native here; you do not just go to chinatown for a walk. Maybe the warfs at the VERY most. The City is not somewhere I'd imagine a non-local to feel comfortable walkin' around particularly somewhere with no night life like chinatown. I'm sorry this is so fishy.",
            "Wow you really buried the lede there.\n\nIt's obvious you don't trust him, and for good reason. I believe when trust is dead, a relationship is over.",
            "Please don't listen to the people who are incredulous that you have children together and imply it's some sort of moral failing on your end.  Your relationship sounds abusive.  If you have tried to leave yet can't seem to find a way out, it is likely an intentional cycle he has created.  If he makes you feel trapped, he can escalate the cycle of abuse by doing whatever he wants and knowing you can't leave.\n\nNow comes the hard part: leaving.  There are several concrete steps to take.\n\n1) First, you need an order of protection. Contact the local courthouse.  State you are pregnant and being abused and you need an emergency order of protection.\n\nYou will likely qualify for a free attorney. Explain that your husband is gambling away the money you would use to leave him, mocking you when you try to leave him, using drugs, and exposing you to STDs through prostitutes.  You are afraid of him and his lies are escalating.  You fear leaving him.\n\nIf you are (very likely) granted an order of protection, he will not be able to enter the house.  This will give you time to pack and safely plan your escape.\n\n2) Go to the social security office.  Tell them your entire situation.  You will likely qualify for several benefits that can help with food and housing costs.\n\nPM me if there's anything I can do to assist.",
            "Even if he didn’t cheat. Even if he didn’t gamble. Even if he was going to tell you in the morning.\n\nEven if all of those things are true, its still okay for you to not be okay with the things that he says are actually true:\n\nNot mentioning it even though he would have known you were awake.\nGoing out for four hours in a new town in the middle of the night.\nA total lack of transparency.\nHe admittedly took all of these actions knowing that he has a history of lying - and there are probably agreements between you guys for no sneaking around.\n\nIt’s okay for just the bottom list to be true, and for that to be too much to stay in this relationship. You tried to make it work and gave him a second (or more) chance. He failed it.",
            "I understand your feelings, but damn! Can't a dude just go out and explore and do things without having to log and check-in with someone else? It sucks how we lose all of our individuality in a relationship and can't simply do things out on a whim. I can see why you're upset, but i can also see why he just wanted to do his own thing for a night on his own before he goes home to his monotonous life.",
            "My immediate thought was- Sex Addiction, and that was before I saw the edit about his history with prostitution. OP, please get yourself tested for STD's and prioritize your own physical and mental health above anyone else's. You deserve it.",
            "I think your edit is crucial, because otherwise it just reads like he had a night out and got drunk.",
            "I live in SF bay area and vices he likes are available in that area but could be said for many places.  7 months sobriety, sole (?) support of family with 2nd baby on the way, obvious relapse, considering a major geographic move - recipe for a spectacular failure or success for you both.  It requires planning and preparing for any and all situations, whether together or not.   Seek legal advice, consultations are free.  If you move you have to establish residency before you can file for divorce, usually 6 months, that's a lot of time he doesn't have to give you a penny, pay rent, buy food, etc., if you're not together.   Prepare to get a job, go back to school - childcare is expensive especially for infants although there are daycare centers and low-cost programs for this situation.  Get help for you both - individual AND couples counseling, AA, NA meetings for him and ala-non for you.  Seek programs for low-cost and no-cost help, food, clothing, shelter, child-care, health insurance, legal help -  there may be  residency requirements before you're eligible and waiting lists for some programs.  SF has great resources.  I've been where you are, and with brutally honesty towards myself and the  situation I picked myself up, weathered the shitstorm and succeeded to build a great life with my 2nd husband (22 years now) and 3 kids but I researched, found help, built my self-esteem and set boundaries. Good luck!",
            "Ask to see the fitness tracker/step tracker app on his phone for that night. Ask for it as soon as he gets home with no prior warning. Walking four hours would produce a tremendous amount of steps. Even light intensity walking at 60 steps per minute would yield 14000 plus steps over a four hour window.",
            ">has a deep history with gambling and prostitution\n\nSo yeah, he wasn't walking around late at night looking for a church.",
            "NTA. Was his hotel by the airport? Trying to think why would you need a cab from most the usual hotel neighborhoods, since SF is so tiny and walkable.",
            "Chinatown in SF is peppered with infamous \"massage parlors\" that get busted left and right for prostitution.\n\nWhat are you waiting for?",
            "He’s banging other dudes",
            "Just puttingbut out there....I'll share how I found my truth....one at a time....not proud but successful. \n\nCall the cap company, act like theres a discrepancy on your statement and you need the ride details,  they let him off at a destination most likely not just a curb. Cab info is on debit card transactions. You just call his bank customer service automated system, you can usually substitute the account number with ss# then you just listen to trans history.",
            "You had me at history of lies. You know what he was doing. I’m sorry.",
            "I saw you left a couple of days ago. I hope it's beginning to give you clarity. It hasn't been long, but the longer the better. Best of luck ❤",
            "Shady as hell...he's definitely lying to you. And if he's really not then he should come clean about exactly what he was doing that night. If he wanted to go out and have a beer maybe explore the city and stuff then cool but why lie about it? I would be checking phone records and everything.. I would even go as far to check the lyft app contact the driver and ask him what your boyfriend was up to (make up a story of course) but that's just me being petty and wanting to slam it in their face before I leave and go make a better life for myself. Good luck I'm sorry this is happening",
            "I lived in the bay area for awhile and if you're not familiar with SF it's easy to just keep walking and then lyft back to where you're staying.\n\nI read your post twice and I feel like we're missing something... My initial thoughts were that maybe you're overreacting to him going out? But then you mention 'history of dishonesty' and now, I'm not sure how you got to wanting to leave him",
            "None of the activity you described is particularly guilty looking in and of itself. SF is a great city with a lot of shit to do at night and a wonderful place to just wander in. I've done the same in those areas of town. The problem isn't what he did, it's that you don't trust him, and he isn't giving you reasons to trust him.\n\nFrom what you've said in other responses, the guy has a history if being a louse. And if he's really, truly reformed, he needs to be working his ass off at helping you trust him. And he clearly isn't doing that.\n\nEven under a best case scenario, if he isn't doing anything wrong on his side, he's still being evasive and that's leading you to have trust issues, which leads him to feel hen-pecked, which leads to him being more evasive and it's just one giant spiral down the toilet.\n\nSo yeah, even in a best case scenario, there's a lot of severe obstacles here with regards to not having enough trust and open communication, and you've gotta evaluate for yourself if that's something you want to keep dealing with, or keep turning a blind eye to as things spiral out of control. And that's a best case scenario.",
            "Im so sorry OP,\n\nI know my comment is going to be lost at the bottom, & you prob wont see it, but I still wanted to add my voice to the chorus of others trying to be honest & supportive of you....\n\nI wish I could say something that would help alleviate your pain - im sorry i cant 😔\n\nIve notices lots of ppl focusing on the fact he was out so long at night, taking a lyft, 'walking' pondering on drug/alcohol / cheating behaviour- & that is *all* important stuff-....\n\n BUT- the thing that ***really*** stood out for me , was the fact he didnt answer your videocall with your child... im a mom & a step mom, so i understand complex family dynamics- but i also understand how big /important video calls with a parent are- especially to very young kids.... *especially* when that parent is usually around, but isn't home tonight.... \n\nThat set off like- the fireworks of red flags for me,  coupled with his \"poor girl\" reply- .... Im so sorry he has treated you/your family with such callous disrespect. ....\n\nIf he was having trouble sleeping, & knew you were awake, why not just lay in his hotel bed alone, talking to you until he was tired enough ti drop off to sleep?? \n\nI know if i was away from my family overnight,  for any reason- i would have trouble sleeping too- but the thing that would bring me the most comfort, would be talking to / seeing them in a video call. .... (esp if thats already an established thing within your family!)\n....\n\nIdk what his past indescretions were, but if this was meant to be the time for your family to rebuild trust- i believe it was serious stuff- & he is not taking it seriously enough.... ..\n\nI dont knkw you or your family, but I do know what it is like to be up all night with your nerves & anxiety in hyperdrive,  while your oartner is off fucking around, & not even bothering to videocall the kids.... at a minimum, thats some serious selfishness.... but i feel like you already know what was *really* going on.... -& now its time to work out what you want your next step to be, for you & your child....\n\nThis is heavy, serious stuff, & he needs to treat it as such, bot gaslight you &make you feel like you're being unreasonable - i promise- you are not....\n\nYou need to taje care of your child, & sometimes what is best fir the child, is for the parents to seperate, rather than trying to keep a relationship together 'for the kids' - \n\nTheres - so much wrong here....\n\nI couldnt recommend seeing a counseller high enough- having an outside, objective person who you can be completely honest with, is absolutely a huge help..... sometimes it can take seeing a few ppl till you find someone you 'click' with,  but when you do, it is totally worth it!!\n\n(& if he suggests couples counselling, thats great! Go along if you feel you want to, just make sure its not your personal counseller that he wants to come see.... if he shows *any* sign of not wanting you to see a therapist on your own, that is another huge red flag.... )\n\n....\nIm sorry if i have written too much, or spoken out of place, if you've read this far down, thank you-\n\n(I promise i didnt take time out of my day to write all this just to waste your time, or for no reason- I did it because i have been in some really shitty relationships, & I simply didnt know just how bad they were until i was out of them, ... -& because i want you to have a happy, safe, peaceful, honest home to raise your child in)\n\nOnce kids are involved, everythimg becomes a billion times more complicated - but as a mom- I know you will do the right thing by your child, even if it's incredibly hard & painful for you - being a mom gives you super powers! Dont be afraid to use them!!\n\nI wish you all the very best - with much love & hugs!\n\n❤💖💜💙💚💛",
            "[deleted]",
            "You really have nothing firm but your suspicions.  If he has a history then he needs to placate your fears but it could be lots of things that you probably haven't thought of.",
            ">He has a major history of being dishonest. \n\nYet your dumbass had a baby with him? Congratulations, you played yourself."
        ]
    },
    {
        "post_id": "46oj2x",
        "author": "ebhanv",
        "title": "UPDATE: My [26 F] awful ex's [26 M] new girlfriend [20s? F] messaged me asking for advice on their relationship.",
        "url": "https://www.reddit.com/r/relationships/comments/46oj2x/update_my_26_f_awful_exs_26_m_new_girlfriend_20s/",
        "score": 2368,
        "num_comments": 93,
        "created_utc": 1455941072.0,
        "selftext": "[Previous Post](https://www.reddit.com/r/relationships/comments/45u5mw/my_26_f_awful_exs_26_m_new_girlfriend_20s_f/)\n\n\nTrying again to submit this as the one I did this morning was removed and never showed up after.\n\n\nNobody specifically asked for an update but I know readers of this sub like to see them and my post got a lot more comments and upvotes than I expected so here I am. I'm sorry I didn't reply to any of the comments on the original post, it blew up a bit and you guys seemed to cover all the bases. I read all the comments two or three times, thanks Reddit. The only question I remember seeing is how did she get my contact information, the answer is that while I have my ex blocked on Facebook due to repeated attempts to contact me a couple of years ago, I am still easily searchable by others and have an uncommon name. Also, a couple people thought that she was only 20 years old, but what I meant in the title was that I assumed she was in her 20s but wasn't sure of her age. She was not that young.\n\n\nI did write the girl back and essentially said that I was sorry she was going through such a hard time, that my relationship with my ex was a really hard time in my life, that she must be in a rough spot to reach out to me of all people, and that I'd be happy to talk with her any way she was comfortable if she needed.\n\n\nShe wrote me back and asked to meet in person. My SO (like some of you) was a little paranoid that it was some kind of set up or that my ex would show up so I made sure it was in a public place and he was nearby in case I needed help. Nothing dramatic like that happened, sorry /r/relationships :P\n\n\nWithout going in to too much detail of her personal life.. The short story is from what she has said, he hasn't changed a bit. Some of the manipulation tactics he used he must have found from a script somewhere or something, it was word for word. He had been gaslighting her BIG TIME and that is essentially why she reached out to me, to see if she was really crazy and a bad girlfriend or if he was like this to me too. I tried to keep it to the facts, told some stories that I felt like she needed to hear to compare our situations. I had no intentions of telling her what I thought she should do, just to give her the information I had and let her make her decision, but that kind of went to the wayside. When she told me that things had started to get slightly physical, I told her in no uncertain terms that she needed to get out as soon as possible and that it would probably get worse. I told her that if one of my girlfriends came to me with something like this we wouldn't be sitting there anymore, that I'd be packing her shit for her. She admitted that he had isolated her from a lot of her friends and that none of them knew how bad it really was.\n\n\nShe seemed resolved to get out of the situation. I know it's easy to say these things in the heat of the moment but she must have known that the prognosis of their relationship wasn't good considering it had already reached a point where she was sitting across from his ex from three years ago. I told her how relieved I was when we finally broke up for good, that aside from some initial anxiety about running into him I felt really free and that the relationships I've pursued since then have been night and day and made me embarrassed that I put up with him for so long. She asked me what she could expect when she leaves him, which I thought was very smart of her to ask, and I told her what he had been like for me. I advised her to use her support system to get out safely, and to go no contact immediately. I told her some of the things he used to say to me to get me to think he was going to change and not to believe a word of it.\n\n\nMy SO was extremely sweet, while he initially raised an eyebrow at the situation and said he wondered why I'd get involved, he supported me once I said that if there was a chance I could help someone who might really be in a bad situation I should do it. \n\n\nI hope she can get out of this situation and never look back.\n\n\n**tl;dr**: I met with my asshole ex's current girlfriend and got her version of the events. We shared similar experiences and I advised her to RUN.",
        "permalink": "/r/relationships/comments/46oj2x/update_my_26_f_awful_exs_26_m_new_girlfriend_20s/",
        "comments": [
            "You did good OP. Fuck that guy.",
            "I would like to nominate this post for the \"most reasonable people\" award for both your and her behavior in this situation. ",
            "Good on you. It must have been difficult, but it really helped someone.\n\nJust you and your SO keep your guard up for the next month. She may need help getting out, or the ex may come for vengeance. \n\nAlso, and I hope this doesn't happen, know that she might go back to him. If so, be there for her until she is ready to get out again. \n\nI hope you all the best.",
            "You are a classy and wonderful lady. You did a really good thing when you could have easily ignored her. Thank you.",
            "Congratulations, you may have just helped save what sounds like a sweet girl from a serial abuser.\n\nAlthough I think she knew her relationship was dead the second she was resorting to contacting an ex to ask if she's crazy or is he an abusive asshole.  She probably already knew the breakup was coming but felt like she needed to find someone that she could feel was in her corner, so to speak, before doing the deed.\n\nAlso great job in giving her forewarning on the bullshit he might try to get her back so she can see it ahead of time and know to not fall for it.\n\n",
            "*raises a glass to you*",
            "That's really awesome of you to be willing to dredge up all those bad memories to help someone you barely know. Kudos (and upvotes)  to you for being a good person and I hope she gets the hell out of there",
            "Wow.  Good for you, OP, you've got a good heart.",
            "I'm so glad. And proud of you, OP, for doing a hard thing.",
            "[deleted]",
            "[deleted]",
            "Did she tell you who was going to help her get out?\nShe may have, inadvertently been looking for someone to actually physically help her out of the situation.\n\nThings could be fine, but I worry that she might still be afraid to get help from her current friends and family if she has already been withdrawing from them.",
            "MVP of the month",
            "You did the right thing.",
            "Top drawer.",
            "Brava, OP. I really think you did the right thing. I'm always of the mind that if you can help, do. The rest of the world is too dark for any alternative. I hope she takes everything you said to heart. ",
            "OP, what you did was girl code done **exactly** right. I never read your original post, so getting this out late, but a similar thing happened to me in my early 20's. I ended up doing the same thing you did and the girl broke it off with my ex-asshole, making sure she had a support system in place. So 25 years later and this girl and I are still friends! \n\nYou did the right thing. Good on you, OP.",
            "I did this once for a girl who ended up dating my abusive ex. Good on you for giving her the perspective she needed.",
            "It seems... that you are a good person. Nice work.",
            "Thank you for posting this. I am considering to reach out to an ex for similar reasons. You handled this really well. Like I hope it would happen to me.",
            "You are a very kind person to reach out to her and help her so much. I hope she gets away from this monster eventually, just as you did!",
            "Thank you for doing this for her. My ex went to jail for stabbing a cop responding to a domestic dispute with his most recent girlfriend - there was an article about it in our local paper and I was like \"holy shit I hope she's okay.\" \n\nI managed to find her (which is a long story, I didn't seek her out on purpose) and she really needed me to tell her that she wasn't crazy, that he's always been like this, and that it wasn't her fault. I gave that girl some serious closure and managed to help her through a really traumatizing time in her life. If I hadn't found her, I'd still be wondering if she is okay. It helped both of us.\n\nOne of her friends thanked me so much for doing what I did and said that none of them knew how to help her and they don't know what would've happened without me in the picture. I want you to know that you just played the same role :) where would she be without you.\n\nThank you for helping a girl in need. We all (men and women) need to stick together in the face of abusive others.",
            "You're a good person OP. You really did that girl a solid. She was smart to contact you. ",
            "You are amazing, OP. ",
            "Recent ex was a gaslighter.  I hated it.  And the worst part is that it really does make you feel like the crazy one or that you are the one who is in a wrong all of the time.  It must have been nerve wracking talking to her at first but cheers to being a good person despite the fact.  It shows a lot of humility and that you care that she, as a person, should be happy.",
            "Gooooo OP!",
            "You did the right thing by giving her the information and encouraging her to make the decision for herself. ",
            "What is gaslighting op? Sorry for my lack of terminology.",
            "I did something like this a few years ago. Visited an ex of mine who I thought I wanted again, he told me he was single, we slept together, then I discovered he had a girlfriend. I reached out to her and told her everything. Poor girl had been pining over him for years. Broke her heart, she was devastated for a while, but she got out and she's so much better for it. \n\nI wondered if other people did what I did, and it warms my heart to know there are good people out there. Thank you. ",
            "Yay!!! You're awesome. I wish I had someone to talk to when it came to my abusive ex. You did great!",
            "I think it's so incredibly mature and kind of you to have done this. Good one OP :) ",
            "Fucking topnotch sisterhood there OP, i hope she follows your lead",
            "That was very kind of you to meet with her. You did a good thing for a stranger. Hopefully she takes your advice.",
            "You are an awesome woman. You may have just saved her life.",
            "Good for you for being there for her. She clearly felt really trapped. Do you think there's any chance of him finding out she went to you and him getting pissed about it and it falling back on you? Also your boyfriend sounds like a really good understanding guy.",
            "You did a really good thing. ",
            "yay happy endings!",
            "OP, out of curiosity, did you at all trade contact info? Or might you guys ever stay in touch, just so you know whether or not she got out safely or if ever had another question? This isn't something that's your responsibility at all, but personally, I'd wonder if she made it out safely. ",
            "When it comes right down to it, women have to have each other's backs. I'm a woman, I utterly adore men and cherish my relationships with them (romantic and otherwise), but at some point I finally realized that lifting up other women gives me such a richer experience of life. Not just women I'm friends with, either, but just making sure that in any given situation I support women in general. ",
            "Gj op",
            "You are a good person.",
            "Eh, you saw the signs and you warned her. Good. ",
            "I'm proud of you. Women need to help each other like this. 👏",
            "you OP......you are an awesome person. ",
            "My mom's done that to a few of my dad's new girlfriends. One of them was planning to have children with him, meaning he never told her about his vasectomy. Luckily she had an uncle in the police force who corroborated some of my mom's stories about his history of sexual harassment and assault. \n\nHis fiancé tried to get me to reconcile with him recently. I told her about how his neglect put me in the hospital 5 or 6 times in my childhood, and that he faked having cancer. I don't think she believed me, but hopefully it planted a seed of doubt so she'll leave sooner when he becomes abusive. It's really all I could do.",
            "keep us updated",
            "[deleted]"
        ]
    }
]