[
    {
        "post_id": "79oei1",
        "author": "heartbreakagain",
        "title": "[UPDATE]: Should I [24F] go to a halloween party I was supposed to go with my ex [29M]?",
        "url": "https://www.reddit.com/r/relationships/comments/79oei1/update_should_i_24f_go_to_a_halloween_party_i_was/",
        "score": 2363,
        "num_comments": 25,
        "created_utc": 1509376978.0,
        "selftext": "Link to original post: https://redd.it/787q83\n\nI asked about going to a halloween party last week, that I was supposed to go to with my ex. I was getting social anxiety about the whole thing. I was scared of being surrounded by couples and being reminded of him.\n\nAnyways, I went. The friend who invited me actually went with me. Even though it was her boyfriend's party, she told me, if I wanted to leave anytime I could. We agreed to go and see how we feel and if I wasn't feeling it, we'd go back to her place for a chill night of scary movies and junk food. We went and I had a blast! No social anxiety whatsoever. I didn't even have to drink a lot to calm my nerves. I made new friends. Became closer to people I met in the past once or twice.\n\nBest part is, I didn't think about my ex even once at the party. I was too busy having a good time. Thanks to everyone who advised me to go and try to have fun. So glad I did :) \n\nEDIT: I wish I could respond to everyone, but sincerely, thank you so much :) I was having a tough few days but you guys have put a smile on my face. And yes, my friend is an amazing human and I am so grateful to have her.\n  \n  ---   \n  **tl;dr**: Was scared and having social anxiety about going to a party I was supposed to go to with my ex. Took everyone's advice and just went to feel it out and ended up having a wonderful time. I guess YOLO is right!",
        "permalink": "/r/relationships/comments/79oei1/update_should_i_24f_go_to_a_halloween_party_i_was/",
        "comments": [
            "Good for you! I'm glad you had a blast. :)",
            "Now THAT is a friend",
            "I like this update, good for you I'm glad you enjoyed it! :)",
            "Yay, well done! I’m happy you had a nice time",
            "YAY! Congrats and good job. ",
            "Love the update ! do you girl, be happy and enjoy life ",
            "Didn't see your original post, but your friend sounds like a keeper. :)",
            "This is how healthy people deal with anxiety, YOU wanted to go and see how it went moment by moment.\n\nYou didn't run away with the story anxiety was telling you ",
            "Good job, shouldn't impede you own life just because your ex, you made the correct decision. 10/10 would party again.",
            "Can I steal your friend? She's the best. \n\nAnyway, I just want to share something I realized after I left an abusive ex years ago and they had introduced me to something I ended up liking. After we broke up I felt like I couldn't like that thing anymore because it would either remind me of my ex or feel tainted somehow. \n\nI decided that I can like or do anything I want. That by letting my ex determine what I can or cannot do or like that in a sense he was still controlling me, I decided to rise above that. That realization set me free of him. \n\nDon't let your ex stop you from living your life. Be free, be happy, move on. That chapter in your life has ended, no point in re-reading those same pages over and over. Focus on the current page and be excited for the next chapter. ",
            "Biggest question left unanswered.\n\nWhat was your costume?",
            "This was sweet. You go glen coco! :)",
            "YES! you can overcome it all =|",
            "Good you go to the party and your friends was there.  glad you enjoyed :) ",
            "Glad you had a good time.\n\nPSA: if you are drinking to calm your nerves, you probably shouldn’t be drinking. ",
            "Yay, now we can move on from this high school drama!"
        ]
    },
    {
        "post_id": "43js42",
        "author": "confused167",
        "title": "***[UPDATE]*** So many red flags you could see them from space...? Please read - desperate for help.",
        "url": "https://www.reddit.com/r/relationships/comments/43js42/update_so_many_red_flags_you_could_see_them_from/",
        "score": 2359,
        "num_comments": 348,
        "created_utc": 1454259310.0,
        "selftext": "**UPDATE - I'M HOME!**\n\n&nbsp;\n\n**I had a lot of people asking me to post that I got home safely so I just wanted to take the time to let you know that I am home, safe with my wonderful Mum.**\n\n&nbsp;\n\n**To everyone that has responded, thank you from the bottom of my heart. You showed me compassion when I needed it the most and, at the end of it all, your advice was the wake-up call I needed and gave me more strength than you will know. Thank you a thousand times (from me and my mum!)**\n\n&nbsp;\n\nLink to Original Post: https://www.reddit.com/r/relationships/comments/43f57y/so_many_red_flags_you_could_see_them_from_space/\n\n&nbsp;\n\nSo he came home last night and I pretended to be asleep. I didn’t know what else to do, I felt paralysed. Then very early this morning he was looking at me suspiciously, telling me I seem very nervous which made me feel even more unnerved because I wondered if he knew what was going on. I was shaking and he asked “Why are you being like this? It’s like you think I’m going to hit you or something.” That triggered something in me. I thought ‘this is it, I’m trapped’ and I broke down crying, leading him to storm into the bedroom, slamming the door.   \n\n&nbsp;\n\nBut then a little while later he opened the door and asked me to come in. His mood had done a complete 180 and he was almost too calm…possibly even sad? Out of the blue he says we couldn’t go on like this anymore, he says I’m crying all the time, too negative, and ‘discussing’ too much (read: questioning his behaviour too much.) He said that he realised two days ago, in a meditation, that it isn’t our destiny to be together. He said I’m not the person he had created in his brain when he met me. His exact words were “I created an angel and then you opened your mouth.” He said he’s losing more patience with me every second and even though I’ve done a lot for him, it’s not enough because he says he loves himself and is happy all the time so he needs someone who is the same, as well as a “real woman” (cooking and cleaning every day.) He said his brain is crazy around me and he can’t deal with it anymore. His parting words were “Believe in yourself. Love yourself.” I found myself getting more upset and more confused but instead of following my inclination to bargain with him (I know, I truly can’t explain it) I tried to remember the things I had read on here and played along just in case this was some kind of test or manipulative behaviour. \n\n&nbsp;\n\nI packed as quickly as I could, though it was in a daze so I’m pretty sure I’ve left things behind. The whole time I was packing he stayed sitting on the bed just staring at the wall, the same position, not moving once… and then I left. No fight. No struggle. No words. Nothing. I felt paranoid waiting for something to happen, for him to react, I don’t know, for some kind of trap, but no. I simply walked away. I was thinking all night about which exit strategy to use but he made it so easy? He, in essence, was the one to let me go? I’m not complaining but Jesus, has it confused me all the more.\n\n&nbsp;\n\nMy mum knows everything (I sent the link to this post as suggested.) She’s absolutely mortified but just wants to get me home. She has booked me on a flight back to England for this evening and stayed with me on the phone while I found a taxi to get me to the airport. I have a long time to wait but my mum said she’d rather know that I’m at an airport surrounded by people rather than being anywhere near him. So I thought I’d use this opportunity to update you all because you’ve all been so supportive, **I’m really overwhelmed by all the messages and advice, I wasn't expecting it. Really, thank you for your kindness.**\n\n&nbsp;\n\nRight now I am just sitting in the airport, shell-shocked, wondering what the hell just happened. I read my original post again and know I haven’t exaggerated a thing. Everything happened exactly as I said. Actually, more than those 26 things happened. If anything I omitted detail in an attempt to keep the post short.  But the way he acted this morning wasn’t what I was expecting and from reading your replies, it’s not what you were expecting either and so it has completely thrown me off guard. Honestly, I feel almost ashamed to tell you all what happened in case you also find it odd and question me, like I am questioning myself right now. I know it doesn’t excuse everything he has done but does it give you a different perspective on things? Does this say more about me than it does him? Or is it manipulation to put the blame on me? I know he cannot bear the thought of anyone thinking badly of him, he wants to be idolised too much. Maybe it’s from speaking to his friend. Or maybe I really am at fault and have been all along, because I keep thinking that if he is that controlling then why wouldn’t he try to keep me there? Unless he realised he couldn’t control me the way he expected.\n\n&nbsp;\n\nPlease don’t shoot me down for saying these things, I’m just…I don’t know!? I don’t understand the way this has panned out, and I’m desperately trying to make sense out of it. I feel like a TV crew are going to walk out at any moment telling me this has all been some kind of sick joke. I’m not purposefully trying to sound like a naïve idiot, I’m just finding it extremely hard to think logically or think at all for that matter. **I mean his last words to me were that he wants me to believe in myself and love myself for Christ sake.** I feel so confused and ashamed. My brain has whiplash from being on the rollercoaster of his multifaceted personality and feels even more scrambled right now. Nothing is really sinking in. \n\n&nbsp;\n\n**tl;dr: I'm at the airport waiting to fly home.**",
        "permalink": "/r/relationships/comments/43js42/update_so_many_red_flags_you_could_see_them_from/",
        "comments": [
            "YES. GOOD JOB. OMG. I'm over here screaming. I have legit never been so scared for an internet stranger in my life. I am so glad for this update. \n\nAlso excellent telling your mom. You absolutely need good people in your life to help you. Notice how your mom didn't shame you, all she said was \"come home!\" She gets it. Everybody on here got it too. We can't all be wrong, right? \n\nDon't be ashamed. Listen, you've been in a war. You're going to question yourself right now and worry it's your fault. That's textbook of abuse. When you get home, look into therapy with a licensed professional who specializes in domestic violence and personality disorders.\n\nSounds like your ex devalued you because you couldn't live up to his lofty expectations. It's a mindfuck. He said it to make you think there's something wrong with you, a parting jab to get at you. He's a lunatic asshole. He lied to you about so many things, why would you believe him on this?",
            "He has no idea your mom is flying you back. In his mind you're out wandering the streets lost without him. He's expecting you to come crawling back when you realize how perfect he is. \n\nHe WILL contact you again.  Just ignore him.",
            "He has you exactly where he wants you. Upset, questioning, doubting yourself, second guessing everything. He knew the game was up, and he got in a few last digs. He'd got everything he could get from you, without pushing you over the edge. Run like hell, never look back, block him on every form of contact, hug your mum, and try your best never to think of him again.",
            "He's a manipulator. He wants you to continue thinking that you were always the person doing something wrong and the relationship ended because you aren't good enough. It's going to take a long time to get over this relationship. That's normal. Take the time to take care of you! Do the things you want to do and explore hobbies/ things that make you happy. I'm glad you're away from him and your mother sounds wonderful. Good luck. ",
            "This is how he wants the story to go: \n\nHe just played the savvy, soulful boyfriend who can't control himself around you because he loves you too much. Now he's \"let you go\" as a show of his incredible spirit and love. He's left you with inspiring words so that you think of yourself as bad for leaving someone with such a good heart--even as he's letting you go, he STILL tells you to love yourself. How selfless!\n\nHe expects you to leave and feel terrible about it. How could you leave someone so selfless? And so, in a moment of realization, you'll spring up from the airport and run back to him. \"I don't want someone good for me,\" you'll say. \"I don't want someone healthy. I want you.\" \n\nHe wants you to choose his abuse. He wants you to think of him as a heartbreakingly selfless and good person who just can't help himself around you because he wanted you to be an angel and if only you just hadn't opened your mouth you might have filled his heart with pure love forever.\n\nWhen you instead choose to cut all contact and never speak to him again, he will get anxious and upset. He will freak out because the story isn't going his way. He will try to contact you again and will continue the story by telling you that he can't live without you, he's tried so hard to leave you alone because he KNOWS that would be beset for you, but he can't help himself. He'll try so much harder next time because he really is a good person, he just can't control himself, he promises he'll try so hard to control himself!\n\nDon't give in. Write your own story: a woman is lured in by an abusive man, but her spirit doesn't break. She gets herself out and lives her life. He tries to tempt her back in but she holds strong because she knows that he won't take care of her, SHE will take care of herself. And she becomes stronger in the end because of it, even if it scares her how much she used to love that scary, awful person. ",
            "Whatever you do, stay in the airport and get on that plane. It will take a long time for you to sort through your feelings, but you will heal with time.",
            "[deleted]",
            "Just remember...when \"what ifs\" creep in, when good memories linger, when he comes crawling back (yes, when)...\n\n\n\n\nRemember. \n\n\n\n\n\"I escaped a psycho unscathed.\"\n\n\n\n\n\nAnd don't you EVER take that lightly.\n\n\n\n\n\nHe could have really hurt you. You were isolated, vulnerable, manipulated like a marionette. There are people who have been in that exact place that have died. \n\n\n\n\nBe gentle with yourself in the coming weeks and months. Be smart, protect yourself, surround yourself with the best people you can find. **Block. Him. Everywhere.** **Change. Passwords. Everywhere.** Be proactive in squashing future attempts at contact, and involve the police if need be.\n\n\n\n\nRejoice and be glad, even when you don't feel like it. Remind yourself as often as you need to that you deserve all the good things in the world, and all those things are yours for the taking. \n\n\n\n\nWhy?\n\n\n\n\nYou escaped a psycho unscathed. \n\n\n\n\nEdit: a typo and a final thought",
            "I'm glad to hear that you got out OP. There's a few things you need to do now: \n\n1. Self Care. Go see your doctor and get a full check.\n\n2. Therapy. This guy has been messing with your head for months, and you may be surprised at the things you believe about the relationship. \n\n3. Change your passwords. As mentioned in the comments for your previous post, he may have been key logging your internet activity. That includes passwords. Change all of them, even if you didn't log into that account while there. You never know what he might have gotten access to. \n\n4. Block him. On everything. He may try to guilt you into coming back. \n\n5. Hug your mum. ",
            "I'm so relieved to read your update.  Regardless of why his behaviour changed so rapidly and led to you being able to leave without incident, you are safe now and well on your way out of this situation.  I hope, through the confusion, you are able to feel a sense of peace and relief.    \n\n> Honestly, I feel almost ashamed to tell you all what happened in case you also find it odd and question me, like I am questioning myself right now. I know it doesn’t excuse everything he has done but does it give you a different perspective on things? Does this say more about me than it does him? Or is it manipulation to put the blame on me? I know he cannot bear the thought of anyone thinking badly of him, he wants to be idolised too much. Maybe it’s from speaking to his friend. Or maybe I really am at fault and have been all along, because I keep thinking that if he is that controlling then why wouldn’t he try to keep me there? Unless he realised he couldn’t control me the way he expected.\n\nNo, it doesn't change what he did or how he treated you.  You have nothing to feel ashamed for.  Perhaps he felt a moment of guilt, perhaps he knew you posted this and realised you weren't going to roll over and play dead for him, perhaps this was another attempt at manipulation.  Whatever the case, nothing excuses the treatment and manipulation you suffered at his hands.     \n\nYou've experienced emotional and sexual abuse.  He toyed with your mind and attempted to break you down.  You didn't let that happen.  You are going home now, to people who love and care for you.  Give yourself time and space to breathe and recover.  You are safe and you are out.  That's all that matters.  Well done, and don't look back.\n\n",
            "It's good that you got out. It doesn't matter how it happened. It sounds like he is trying to gaslight you by making it feel like it was your fault for \"crying\" or being \"negative.\" It's not. You just went through a hard time in your life, but now it is in the past. Take the time you need to recover and move on. I believe great stuff will happen to you in your future and this will just be a strange memory of a bad time you went through in your past.",
            "Sweetheart, you've been emotionally and sexually abused for weeks, your head is going to be all over the place for months, if not longer. You're probably in shock, you might have PTSD, these are all things that will take time to come to the surface and they will take work to resolve.\n\nRepeat to yourself that you have nothing to be ashamed or embarrassed about. He did this to you. You did nothing to deserve any of it. You will get through this. \n\nWhen you get home you need to see your GP immediately and ask for referral to a counsellor, let him/her know you were in an abusive situation and you need help. \n\nI am so pleased that you are out of there, I was so worried about you. Make sure all of your social networks are locked down, change all of your passwords and email passwords, make sure you've blocked him on your phone.\n\nGo home, cry and have many hugs and take care of yourself. ",
            "Hey OP.  I'm so glad that you're out of there, and I have a word of warning for you.  The danger about experiencing a manipulative and toxic relationship like this doesn't end when the relationship does.  You will always need to be mindful of the scars it will leave.  I speak from experience from growing up in a manipulative home.  You have a wound that needs to heal, and unfortunately manipulative people will be able to spot it and try to open it again...whether that's your horrible ex or someone else.  Protect yourself and build up your strength.  \n\nI want to share something that happened to me that I've tried to always carry in my mind.  One of the most easily-exploited traits that I have is that I am a people-pleaser (no matter how much I hate that side of myself, it'll always be there a little).  I'm a graduate student and once caught a student who had cheated on an assignment after I helped her and gave her an extension.  The student met with my advisor and me and tried to insinuate that it was my fault for not helping her enough.  After the meeting, my advisor checked in with me to tell me I had done just fine.  I told her I was trying not to second-guess myself, but that it kind of hurt when the student blamed me even though I had been trying to help her.  My advisor looked at me and said, \"Yeah, well... she *meant for it to hurt you*.\"\n\nI don't know why but that was such a crystal clear moment for me.  Like...somehow I can scrutinize my own actions down to the molecular level and imagine all this responsibility, but that when someone else hurts me deeply *they somehow didn't realize it??*\n\n**Your ex knew exactly what he was doing** and how to get into your head.  Leave him to spin his wheels alone.  Remember the JADE trick to dealing with manipulators - don't justify, argue, defend, or explain.  If he contacts you, he'll make you feel like you owe him one of those things.  You are under no obligation to explain yourself or say one more thing to him, but he will make you think you *want* to explain yourself.  That's a tactic too.\n\n**Edit:**  I want you to promise yourself something.  If he contacts you somehow (directly, through a friend, etc), and you feel the need to argue/respond/justify yourself, *come here to do it instead.*  Make another update.  Don't respond to him, but say whatever you feel like you need to say to him *to us instead.*  You can get it off your chest and be heard without feeding this emotional vampire of a person, and we'll back you up.",
            "I've never so anxiously awaited an update before. I'm really glad you're going to be okay, OP. ",
            "My ex narcissist said he was \"Happy all the time\" too. Truth told he was the most miserable person I've ever met. \n\nAngry all the time, insecure, criticizing, insulting, and nitpicking me and EVERYONE else, always feeling slighted, short changed, and overlooked, never satisfied or happy with anything anyone did at any time ever.\n\nHe was the literal opposite of \"Happy all the time\"\n\nA narcissists ideal relationship is with a doormat. Someone who never questions and always takes the fall. They cannot function in any way in a relationship with a normal person, in which BOTH people sometimes make mistakes, there are sometimes outside stresses, and the other person has wants, needs, limits, and boundaries of their own *like a healthy person should*.\n\nThey just want a yes woman. \n\nAnd they are NOT \"Happy all the time\". They're miserable and use others to try to make them happy but that only makes it worse when that other person turns out to have a mind of their own.",
            "I have no clue what's up with your ex but I'm SO GLAD you got out and you're going to be safe! Remember, he's the crazy one. All of this is his fault, not yours.",
            "This has to be the most perfectly executed abuse cycle I've ever heard of on this sub. Like... wow.\n\nHe's thinking you're alone, wandering the streets and feelling lost, abandoned and worthless without him. That's what you're thinking now, *because he wants you too*. \n\nHe isn't expecting you to have a place to go, except back to him. The fact you're leaving and going to your mom will have him backtracking within hours, once you don't come crawling back to him. He will cry, beg and make promises, all of which will be lies.\n\nTell everything to your mom and never ever ever meet this person again.",
            "This does not change my perception at all, other than making it clearer that he has some serious mental issues going on in addition to his abusive and controlling behaviour.\n\nYou got extremely lucky that he had this swing and let you go. Now, the important thing is to vow that you will *never* have contact with this person again. That you will *not* respond to him if he tries to contact you, to visit you, to get you back. \n\nBecause I almost guarantee he will. It will not be any better.",
            "Thank you for updating, it's such a relief to hear that you're safe.\n\n>I mean his last words to me were that he wants me to believe in myself and love myself for Christ sake. \n\nAnd the words before that were all insulting you and putting you down. But he saved the tiny little scrap of questionable praise for the end so that the recency effect would keep you desperate for his approval even though he's a trash person. He wants you to question yourself. He expects you to come back begging for him.\n\nYou've done such a great job. Please look into therapy when you return home. ",
            ">Or is it manipulation to put the blame on me? \n\nDing ding ding ding ding",
            "I'd just like to make a quick note to your mom. You said she was \"mortified\". \n\nMom, I am a survivor of domestic violence and abuse. It can reach anyone, no matter how smart, how rich, and how wise one can be. It reaches over all socioeconomic class, races, and genders. Please hug your daughter tight. In my domestic abuse group, we had a Dr, a couple of PhD's, teacher, students, housewives, and we allowed a gentleman in who was mindfucked by his wife for years. This isn't something that just happens to the lowly or stupid. Your daughter did everything right and a whole slew of Internet strangers are immensely proud of her. And you should be, too. Getting out isn't easy or for the faint of heart. Her tendency to stay is a testament to her forgiving and empathetic character, not some personality flaw. Please take care of yourself and your daughter at this time. Help her repair the damage this monster has done to her,  and you by proxy. Thank you for being there for her when she needs you the most. ",
            "I am so happy to hear you're out of there. There's a lot of healing that will need to be done, but I know you can do it.\n\nI'm leaving a comment just to say that, and to give the warning that once you're away it's very likely he'll change his mind and turn the sweetness and charm right back on. Please block all methods he might use to contact you, and ignore him if he gets through anyway.  It sounds like you're in a vulnerable place - we all would be after the horrorshow you just went through - so it's important to do everything you can to keep him from exploiting that.\n\nAll my best wishes go out to you, OP.",
            "Fuck, I'm crying over someone I've never met, but your story was so similar to mine and I am so happy for you and PROUD of you for getting out when you could.\n\nYou are so strong. Thank you for the update, you were on my mind all of yesterday.",
            "After reading your story yesterday I was searching frantically today hoping there was a positive update and BAM! I am soso happy you got away... please dont blame yourself for anything... and dont let him entice you back either. It might feel hard now but you are 100% doing the right thing and saving yourself from a horrible situation.",
            "Congrats OP! I'd guess maybe he did realize that you weren't 'breaking' the way he wanted, but really, who cares. The important thing is you got out safe",
            "I am so glad you left!! \nThe guy realized you were seeing through his manipulations and he tried to turn them around to put tve blame on you. Do not feel bad about it, he probably has a lot of experience in this. People like him take advantage of the fact that most people are not used to deal with abuse.\nYou made it out,  and this is all that matters.\nWhen you are finally back home, take care of yourself and take time to heal.",
            ">Out of the blue he says we couldn’t go on like this anymore, he says I’m crying all the time, too negative, and ‘discussing’ too much (read: questioning his behaviour too much.) He said that he realised two days ago, in a meditation, that it isn’t our destiny to be together. He said I’m not the person he had created in his brain when he met me. His exact words were “I created an angel and then you opened your mouth.” He said he’s losing more patience with me every second and even though I’ve done a lot for him, it’s not enough because he says he loves himself and is happy all the time so he needs someone who is the same, as well as a “real woman” (cooking and cleaning every day.) \n\nLook how up to the last minute this abuser blamed everything on you. He deserves this perfect woman because he is a perfect man, and you just couldn't live up to what he needed! :/\n\nUgh. He sounds like a cult leader. What an awful human. OP, the right man won't make you feel sad, confused, dependent, lost, scared, and ashamed. He will make you feel strong, powerful, brave, assured, confident, beautiful, and like you have something to offer him.\n\nBecause you are, and you do.\n\nWait for that man.\n\nGo home and recover from the abuse.",
            "What he did was simply one more manipulation in a long line of manipulations. Make sure you get on that plane. He played into your doubts and fears to reinforce his massive ego and entitlement. He is trying to convince himself that he is not at fault and you are the source of all of his problems. He will succeed, because narcissists do not change. \n\nMake sure you get on that plane. You need the support of people who care about you and your well-being. Therapy would help if you can afford it. You are in the position of an abused child, confused, afraid that you deserved all of the abuse because there is something inherently wrong with you. It will take time but you can heal.\n\nWhatever you do, never read, talk, text, email or see this man again. You are exceptionally vulnerable right now and will be for some time. He may try to lie his way back into your life and, for the sake of your future happiness and safety, that cannot happen.",
            "OP, you are amazing!!! You saw an opportunity and took it. Please don't minimize what you have accomplished. Abuse victims typically miss multiple opportunities to leave their abusers, and for those who finally get away, they look back as are are now with great regret that they didn't leave sooner. \n\nPlease don't blame yourself for anything that happened. Stay focused on getting on that plane, getting your body away from this hell, and in the months ahead, cleaning your mind of the lies and twisted thinking that he implanted in you. \n\nPlease understand that human beings are hackable. Abusers know how to manipulate every natural and good human instinct to love, bond and care for others into their exclusive and depraved service. \n\nIn other words, you would have to be a very unusual person indeed not to have been under this man's spell. \n\nWhen you get home, find the best therapist you can who specializes in helping abuse victims recover. Don't delay--the faster you heal, the easier it is. \n\nThis is fantastic news and I know that everybody who reads this is doing a happy dance! You were in a horrifying situation, and you saved yourself with your intelligent instincts. Also, your mom deserves a party for stepping up and being awesome! \n\nDearest OP, everything is going up from here. It won't always be easy, but you have a wonderful life ahead of you, even if you can't see it yet. \n\nEdit: I didn't mention anything he said, but every single phrase out of that man's mouth could have constituted its own post. This man is truly a demonic being. Bring these posts to your therapist so that he or she can see what you were up against. ",
            "He's manipulative to the end, OP. Working you, controlling you, keeping you off balance, not love, was always the point. He thought his abuse would keep you docile and eager to please him but your sense of self and right and wrong was strong enough that his abuse had you anxious and in tears, as is appropriate. \n\nWhen you've settled in at home, you might google signs of abuse and the cycle of abuse. You'll see so many familiar things and you'll be able to recognize them in the future.\n\nPut one foot in front of the other, don't look back. You're doing everything right, keep moving.",
            "You are going to be okay. One day this whole affair will seem like a bad dream. With time and distance all of your doubt and confusion will fall away. The most important thing is to block him and never let him get his claws back in you. Let your mother take care of you, rest, comfort yourself and don't start dating again until you've gotten some therapy and worked through what happened in this relationship.",
            "My heart was fucking pounding all the way until I read the word \"Airport\". Thank god you got out. You got lucky, I hope you realise that he has no idea that you're on your way home and you just dodged a god damn nuclear missile (fuck bullets, bullets are nothing compared to this shit). He's expecting you to come crawling back to him, feeling guilty like he trained you to. Go home, don't look back, block him everywhere and get in contact with a therapist, it will take months to get over what happened to you, better start as soon as possible. Don't let this destroy you, don't let him win. Get help, stay safe. ",
            "No, this doesn't say anything about you. If anything I'm even more convinced that he's a religious psycho who's using some weird philosophy to justify his fucked-up behavior. Seriously unstable; he seems to see himself as some sort of protector and mentor. But in reality he's only trying to benefit himself. \n\nYou've been very strong. You didn't bargain. You overcame his brainwashing. I'm glad you're on your way to safety.",
            "Come home to England, and know, in the deepest heart of you, really know, you are worth a million more than that manipulative bar steward. Let your mum give you comforting hugs, feel the love and support of those who care for you. This scuz is without a doubt a vile piece of poo. He absolutely trapped you into a Web of sorrow, making you doubt everything. His parting shot was yet another stab at your self belief. Take the time to recover from this nightmare. Block him from every social media, change your phone number, possibly change your phone, get every electronic device he had access to scanned in case he has installed keyloggers and do not open any attachments unless you are on a public access computer  for example the library's. They have security that will make sure anything troublesome will not infect your home network. Take care, and welcome back home. Loving supportive hugs. If you need to talk then please message me, I have been in an abusive relationship and I live in the South East. (Kent to be exact) ",
            "Holy shit, i am a peer specialist (training) and this threw me in such a confusing loop of disgust at the guy. just get home, you've done nothing wrong and make sure to hug your mom, she really cares about you.",
            "Not much to be confused about- he's batshit crazy, and it sounds a lot like he's gaslit you to believe you're the crazy one. You're not, and you will be just fine :)",
            "DO. NOT. LOOK. BACK. Just get home. Get home and cut ALL ties you had to him. I read your update and out of curiosity I went to check your original post....I got to number seven before I couldn't read anymore. You did not deserve anything that happened to you with him, you have done no wrong, you are not dirty or wrong or abnormal. You are a wonderful human who happened to get caught in a trap which was disguised as love and promise. \nDo not analyze the situation right now, just focus on getting back home. Get something to drink or eat. Once you are home the you can find a therapist and then begin to work through the questions and such you are taking away from this. \n\nMy heart goes out to you. Be safe.",
            "So glad to hear you left. You made the right choice.\n\nHis \"180\" is nothing but manipulation. He could see you were starting to realize the situation, and it was a tactic. Make sure you block him on everything, and never speak to him again.\n\nBe proud of yourself!",
            "Get back to England, safely and block him from any way of contacting you. Change your number, email, whatever you have to do in order to have no contact with him. Put it in your memory of stupid shit you did when you were young and never look back! ",
            "He created an angel? Dear lord op, I'm so happy you're out of there!!\n\nI do not think any less of you for falling for that manipulative creep. It's easy to be manipulated, you shouldn't feel ashamed. He is the one who should feel ashamed. I'm sure after this experience you'll see red flags sooner.\n\nAs others have said, do not ever respond to him if he tries to contact you again. YOU OWE HIM ABSOLUTELY NOTHING.",
            "You gotta stop trying to make sense out of his behavior. You're out and it's time to look forward. \n\nRead all the Harry Potters or something to get your mind off of it.\n\nThere is no excuse for anything on that list you gave us. He doesn't deserve any more of your emotional/mental energy.\n\n",
            "I am so, so proud of you for calling your mum! I'm even prouder that you didn't try and bargain with him and instead took the opportunity he gave you to run the hell away from him. Well done!\n\nWhen you get back to England, spend a bit of time readjusting and go see your GP to get a referral for counselling! I know it might not feel like you need it but trust me when I say that you do. \n\nAlso ask for an STD test. I know it's mortifying but I'm worried that apart from manipulating you, he'll have left you a rather icky parting gift. \n\nIf you're ever in Leeds, please send me a PM and I'd be happy to meet up for a coffee so I can hug you in person. \n\nFinally, go hug the shit out of your mum when you get home. You deserve it and she'll need it as much as you. ",
            "He manipulated you and put you down up until the very moment you walked out the door.\n\nSure, I am surprised that he did not become violent when you tried to leave, but he CONTINUED TO EMOTIONALLY ABUSE YOU UNTIL THE MOMENT YOU LEFT. Telling you to 'love yourself' was not him telling you that he genuinely cared, it was 1) an attempt to save face, coupled with 2) an attempt to make you feel like such an idiotic piece of crap that you would change your mind and stay. Telling you to love yourself in that way implies that you are a weak, feeble person who just can't seem to pull yourself together. He knew his words would hurt you and that was his goal.\n\nYou did the right thing. Please please please, don't doubt that. It is wise of you to take the time to try to figure out what the hell was wrong with him, but don't doubt that this man was a manipulative abuser. \n\nI am so grateful that you are on your way home! I know I don't know you at all, but I so worried about you!! I can see that you have already learned a lot from this experience and hope you carry your new found strength with you as you build a new chapter in your life. Very best wishes to you.\n",
            "Never been so thankful for the security checkpoint at the airport.",
            "I'm so happy to hear that you're going home. Please take care of yourself. Have you considered personal counseling? They can help you recover from trauma like this. They can also help you recognize the warning signs of an abuser before things progress. From your original post:\n\n>He was full of grand proclamations of undying love, saying I am his everything and that I’m his reason for living, he said I’m his soulmate, that he wants to marry me, have children, the works.\n\nThat was actually your first red flag. \"Love bombing\" and coming on too strong too fast in a dizzying tornado of over the top affection is very common among abusers. They sweep you up in this whirlwind romance to get you hooked. \n\nTake care of yourself. You will need time to heal. Seek out people who truly care about you. ",
            "It is manipulation through and through. I'm not surprised you're even thinking this could be generosity, or a glimmer of good will ... You are still in the middle of this, and you've been on a fucking rollercoaster. \n\nYou will see it too, soon. You will see it for the disgusting manipulation it is. It is actually supposed to put blame on you. But right now? Don't try to untangle this horrible mess. Don't think about what it all meant or what sense to make out of it. Try to relax, and get back, and keep safe. But put off all that. You need to focus on healing right now. There will be time to wreck your brain if you will still feel like you need to do it. \n\nAnd if you ever feel like he spoke those words about loving yourself honestly, please don't forget that he used those same words when humiliating and pressuring you like you used to do to yourself in front of the mirror. Those words mean nothing from his mouth. Nothing. Do not listen to anything from his mouth ever again. Set up filters for his number, so that you can save evidence in case it's necessary but don't have to read it. It's very likely he'll try to throw some hooks into you if he ever feels like maybe he'd like to try and subdue you again.",
            "I'm so happy to read this I was scared you were going to say with him. I'm so glad that you got out save. You have done one of the hardest things you will do in your life, even though I don't know you I'm proud that you did. ",
            "I'm late to the party, so I don't know if you'll ever see this, but I truly hope you stay single for a little while and see a therapist to help you avoid guys like this in the future.\n\nMy first boyfriend was like this. He messed up my head so bad I was chronically dating emotionally manipulative people. I always felt like they were doing me a favour by spending time with me.\n\nGet help back home and rebuild your self confidence. Don't give your energy to people like him.",
            "He knew you were thinking of breaking up with him, so he wanted to dump you before you could dump him. He thought that breaking up with you first, would make you fight even harder to be with him. It's just another manipulation tactic. As others have said, he will probably try to contact you when he realizes you won't come crawling back to him. \n\nDon't do it. Don't believe anything he says to try to get you back. Things won't get better, they'll be *worse* since now he believes he has the upper hand. ",
            "I'm so glad you're out. <3",
            "This is great.\n\nA lot of the reason that abusers turn to stalkers, is that they can't stand the idea that they were rejected, or that they lost the game. THe fact that he beleives he dumped you on his own terms may mean that he will let you go in peace. ",
            "He idealized you to an extreme, which you interpreted as \"love\" until the two of you actual started getting to know each other.  This degree of idealization is not normal.\n\nWhat you just went through is a departure from regular reality - he created a bubble of his crazy thoughts and behaviors, and I'm sure that's what he always does.  You are lucky to get out.\n\nBon voyage!  Once you're home and around familiar places and people, you'll feel much, much better.  Proud of you for getting out.",
            "I was in a less extreme version of your situation 6 years ago. Please cut off all contact with him, and I am sure it will only get better from here. My ex still kept trying to contact me and would go back and forth between begging me to come back and making crazy accusations. Don't let it get to you and erase him from your memory. ",
            "OP, please let us know when you've arrived home safely. I am so glad your mom is there for you. \n\nStay strong and remember your team of anonymous internet strangers rooting for you!",
            "You have a wonderful mother who came through for you in a pinch. I'm so glad to hear you are at the airport.\n\nNow get some counselling to get past this, to get it explained by a professional. If the first counsellor is not a good fit, get another. Get past feelings of shame and confusion. *It's not you, it's all him.* ",
            "This guy is a pro. I have worked with women who have been abused and the abusers follow basic steps. \n\nStep 1. Be the sweetest, most caring man you have ever met. He declares his love for you and tells you he can't be without you. \n\nStep 2. Isolation! Gets you away from friends and family. \n\nStep 3. Is control. This starts with little things such as how to do your hair or what to wear and then leads to full on abuse. \n\nTake whatever opportunity you have to get out. He could be manipulating you or be serious but either way you are lucky to have an exit. This happens to a lot of women (poor, rich, educated, uneducated...) and many of them don't have a safe exit like this so take it. ",
            "First I just want to say how relieved, happy, and proud I am! I woke up thinking about this and have been checking for the update. Secondly, despite how he may have seemed today his handling of the situation is still very unstable. It was manipulative and a way to protect his own ego. Some things that stood out to me...\n\nYou didn't mention him being empathetic towards you at all. You said he acted differently and acknowledged some of the problems you had been having but it wasn't because they upset you it was because he was annoyed with you expressing your feelings and you not wanting to roll over and do everything his way.\n\n\"I created an angel and then you opened your mouth\". Uhhhhh wtf? Soooo many things messed up about that but one I'll point out is that he doesn't take responsibility for building a false version of you. He instead words it to blame you. It also sounds so misogynistic as if you should have been seen and not heard (idk maybe just me).\n\nHe's always happy? He made it sound like he was miserable around you because you were questioning things and you were constantly not complying with his \"needs\" and wants. You said yourself you guys had spent little time apart so idk how he was always happy when he was throwing temper tantrums a lot. \n\nHe said his last words as one last mind fuck. \n\nTo be honest those type of people usually prey on more weak and easily manipulated people. He may have thought he could do that to you and groom you to be his \"angel\". He got impatient with you because you were messing up his plan by being a strong person. He didn't try to stop you because it will be easier for him to find someone else that is weak and easily broken than for him to try to \"break\" you. Please don't look back or question leaving. Not only would you have been incredibly unhappy but I can guarantee the abuse would have gotten worse and if you had gotten pregnant you would have brought s child into a dangerous situation and made it harder for you to get out of. ",
            "Yay! So glad you're on your way home, i was waiting for this update. The thoughts you are having are completely normal for someone who has been through what you have. The way he did this was to ensure that you would feel this way; doubting yourself and blaming yourself. Whatever you do, do not go back to him. Do not contact him and ignore him if he contacts you. In fact block him before this happens. Go home to your mum and forget about this nightmare. Be proud of yourself for getting out, no matter how it happened. It feels awful now but I promise you will forget about him, and the pain and confusion will all go with time. Sending you good thoughts from a fellow Brit! ",
            "I am surprised by the update, I didn't think he'd let go like that but man am I ever glad he did! The top comment makes more sense of it, probably his last digs or even ground work in case he wants to lower your self esteem to pull you back at some point. Keep the no contact in place and get some counselling, this relationship was completely toxic and you need to start working through it. I'm so glad things turned out this way, keep your chin up beautiful and keep moving forward, you have a fresh start and are very lucky.",
            "I am so glad you're safe op! I was really worried for you when you stopped replying last night. Please never contact him again. Like everyone else said, block him everywhere. \n\nHug your mom. It's okay to cry it out as well. You might be in a state of shock right now but just remember that you didn't do anything wrong. Surround yourself with people that love you and just focus on healing for now. \n\n",
            "I'm so glad you got out. Never look back and get help for yourself. This psycho has seriously messed with your head.",
            "I'm so relieved for you, honestly. I have thought about you multiple times over the course of the day and have been checking for updates.\n\nLike everyone else said, it sounds like he decided to play one last mind game with you - and maybe he felt defeated as well. \n\nJust keep looking forwards, get yourself home to your mum and never ever look back! ",
            "Hey, I'm proud of you. Like everyone else said get home, hug your mom, block all contact with him - then take a nap. You can talk to your mom later and she might be a little frantic but take a little time for yourself before you talk about it. I don't know about you, but this always helps me. If you ask for a little space (assuming you need it) I'm sure she will oblige you.\n\nI didn't go through quite the same ordeal you did but I did spend ~3 years trapped in an apartment with an abusive person and I thought he'd kill me before he'd let me leave. I had some wonderful friends help me out of my situation. \n\nEverything you're feeling right now... like you did something wrong/ could've been better/ wondering if he's right? It's okay to feel that way. All of those thoughts work themselves out but it takes time. As for you not loving yourself... you do. Or you never would've left. He doesn't get to make you doubt that about yourself.\n\nI would say that the hard part is over, but it's just one hard part. The hardest part for me was the months of anger at myself for \"allowing\" myself to be in that situation in the first place. This went back and forth with anger toward him for being a shitty person and not treating me the way I deserve to be treated. Some days are still hard, I still have nightmares sometimes. But other days I forget he ever happened or the memories are just a passing whisper. I'm so sorry... it really does take time. In the meantime focus on setting goals and getting your life back in order. It would not have served me to have stayed in bed, shellshocked from the experience. He wasted enough of my time, I wasn't going to waste more of it. Especially not on him. He didn't deserve the time he got out of you, give him now as little of your thoughts as possible while still making an effort to work out your feelings.\n\nYou're going to be okay.",
            "Hugs. Thank fuck almighty you are away from him. Get home block everything find yourself a counsellor and have yourself a damn beer. ",
            "Abusers never want to be in the wrong. They believe they are incapable of it. Fact is, he knew you wanted to leave. What would he tell everyone if you left him? No, now he can tell everyone \"I told her to believe in herself and love herself, we just weren't meant to be.\" He gets to absolve himself of any blame and you get to question everything about yourself. You were abused, and reading your story brought back memories of my abusive relationship. I can tell you that distance and time makes you aware of how messed up everything was, even though you feel crazy right now. I questioned everything when I left him, too. He told all his friends and family that he did and gave up everything for me, while I was an unappreciative, cheating bitch. None of it was true, but that's how he took the blame off himself and made it seem like he was the victim. You are lucky that his pride was more important to him than you were, or else it could have gone very differently. You're safe now, I would suggest seeing a counsellor to fully understand how abusers operate and to realize that this isn't your fault. You're not crazy for knowing how crazy he is.",
            "Get therapy. You'll have to learn to think normal again.",
            "OP, I'm so glad you're safe and out of that relationship.  Your ex-BF sounds straight up mentally ill.  For real, clinically diagnosable mental illness.  \n\nWhen you get back, surround yourself with love and take the time you need to unwind after all this.  But then seriously consider exploring how you found yourself in that situation.  I worry that those things are still there, and though you've learned a valuable lesson from this experience, there are abusers and crazy people far more subtle than your ex that may lead you into the same trap.  Don't let that happen.  Try therapy if you feel up to it.  You've been through some potentially traumatic stuff, so please take care of yourself.",
            "So glad that you're safe.  You said that he was like a different person in public than in private, and that his mother was in his life - I would consider sending your original post to his mother so that she can be on the lookout for this sort of thing in the future.  You won't be the last girl that he abuses.  ",
            "Sounds like he knew he was getting dumped so he tried to beat you to the punch",
            "THANK GOD! you got out unharmed- (physically as that Jerk maniupulated the living daylights out of the situation). As soon as he said that you are not what he created, it really made me think of my narcissistic mother. You might want to check out /r/raisedbynarcissists to help you process what you went through and gain a better understanding of his faults. I hope that you blossom from this horrible situation. An old saying goes something like \"Roses best grow out of \"animal waste\"\" Keep your chin up and move forward. ",
            "Typical abuser behaviour right here: my ex did something similar while blaming me to everyone. Pretty disgusting. \n\nJust work on recovery. ",
            "He made you sick. It will take some time away from his disease to be well again.  Let yourself grieve for the good parts of the relationship, allow yourself to get ANGRY for the bad things.  Don't doubt that you never asked or wanted the bad things. Don't doubt that nobody (not even you) deserves to be treated in that manner, and only a truly deranged person could behave that way.\n\nGive it time.  You were given an opportunity to leave and you took it. That was very good luck and you were very brave to use the opportunity.\n\nI think a good metaphor to think over here is \"Frog in the pot\".. It means that you can't throw a frog into a boiling pot of water; it will jump out, but if you put it in a pot of cold water and heat it up over time the frog won't notice.  A lot of abusive relationships don't start that way.",
            "I read your original post, and goddamn. The dude is a basket case.\n\nIt's almost some fucked up father/daughter relationship or some sort of master/servant thing going on in his mind. That guy needs a therapist.\n\nGood on you on getting out. Don't look back and run forward.",
            "Good girl! You did the right thing and got out. Thank god your mum is helping.  Whatever you do, don't turn back. Get on that plane. Do not tell him where you are either. \n\nPlease tell us when you are back in the UK xx",
            "This experience has left you emotionally fucked, rightly so. GET HOME, Never talk to this man again and get yourself into some therapy to work through it. Don't let it sit in your head. I'm really glad you got out of that situation, now it's time to give yourself space and forgiveness.",
            "If you go back to him it will end up being much worse for you.  Even worse than it was before you left.",
            "I'm so glad that you got out and are going home.  When I read your first post, I literally felt ill, and girl, let me tell you, I have seen some shit.  \n\nYou're off the rollercoaster now.  Stay off it.  Don't talk to him again.  ",
            "Your having trouble understanding this because your are (seemingly) a normal person, expecting normal things to happen. What really happened is he was a whack-a-doodle. Nutso. Living in a fantasy dream land. Some of it is cultural, but most of it is he is crazy. Don't get down on yourself. You learned a lot. If it was me when I am in the right headspace after things calm down, if probably send him a quick text. \"You are %#}*^^ crazy\". Then end. He's crazy. Not you. But I think you need to work on your assertiveness and self worth. He really beat you down. He is emotionally abusive/manipulative which would have probably led to physical abuse. ",
            "I am so happy about this update not to many posts actually bug me but OP's original made me genuinely care for another human bean who doesn't know I exist. Well done OP",
            "You know, for as long as I've been lurking on this sub, this post has stuck with me the most. My mind has been wandering back to you since I read your original post, hoping so hard that you got out okay. I know there's a lot you need to unpack. I know you're feeling a lot right now. I know there's so much you'll need to sort out when you're finally home with a support system.\n\nBut you're safe. You. Are. Safe. You took the first chance you had to get out and you got out. I'm unclenching for you. Everyone else who's saying he only let you go because he thought you'd be back is  **absolutely right.** Unpack what you need to unpack as long as you need to, girl, but know this: you did exactly what you needed to do. *Internet hug*",
            "This is absolutely a test.  Stay strong.  NO CONTACT.  AT ALL.  Good riddance to bad rubbish.  ",
            "Please post an update when you are home and safe. We care about you and want to make sure you are safe.",
            "I've never been so relieved to see an update like this. I'm glad you got out, good luck!",
            "Bloody fookin' hell.  I just read the original post.  Jesus, you're doing the right thing.  Run like Satan is chasing your ass, because you just left him.",
            "You should never speak to this person again. Change addresses, phone number, facebook, what the fuck ever. This person is a psycho.\n\nHim \"letting his angel go\" is just him having a brief moment of clarity, knowing he will end up killing you for not meeting his standards. Those standards will change daily, because he believes his way of thinking is absolute. And the fact that you aren't able to meet the ever-changing angel standard without him even communicating what they are makes you inferior. In his mind of course. He's insane, good job getting out of there. \n\n\nThe fact that he said \"I created an angel and then you opened your mouth\", clearly means he believes he is a god. He needs help, but you do not need help him. In fact you can't because you are his object, you literally aren't even a person to him. \n\nSorry.",
            "Please let us know when you're home safe! What an intense couple of posts. My husband and I are so glad you made it out!!",
            "Awesome update, glad you were able to get help and get out of there.\n\n> He said I’m not the person he had created in his brain when he met me. His exact words were “I created an angel and then you opened your mouth.”\n\nListed to what he's really saying, OP. He loved *the idea of you that he created in his mind*, not the *actual you*. \n\nWhen he told you that you were doing something wrong, it wasn't *actually* wrong, it was simply *failing to match the (delusional) picture in his head*. This is not how good relationships work. \n\nI know there is so much about this moment that is difficult, but I hope you can hold on to this hope: **you deserve someone who knows and loves the ACTUAL YOU for who you are**.",
            "Get on that plane and have a drink, girly. Congrats for getting out. I agree him telling you to leave is another manipulation tactic. Block his ass. Oh, except for maybe send him emails with photos showing how awesome you're doing without his bullshit. ",
            "OP, I am so PROUD of you for telling your mom and for leaving him. Let me assure you that his behavior is right in line with typical controllers and abusers. He is trying to make you doubt himself, trying to paint himself as the good guy, and he has either found a new target to abuse or is going to try to get you to come back to him. STAY STRONG and keep reading your posts and your replies if you ever feel doubt. ",
            "Good job, OP. You're very brave and you did the right thing. \n\nLeave and never look back on that asshole. He just wanted to manipulate you one last time, make you feel like shit before you left, just so he could feel control. Block him out. ",
            "Change all of you're passwords. Change you're number. Change you're locks at home. Contact you're police at home and let them have a record of the situation. He is a psychopath he will try to come back more than likely like you said he has you're address. He thinks you're going to come back. He's honestly waiting for you to come back. Do everything you can to protect yourself back home. And for goodness sakes get some therapy!",
            "so pleased to hear you're safe ",
            "I know this is hard and it's going to take work to rebuild yourself inside and out. This is a blessing in disguise. There are resources online for recovering from a person like this - letmereach.com is a good one.\n\n\nIt really, really hurts to be pushed off of that pedestal. I know it does. There might be a huge hole - that hole might have been there already. Mine was! It helped me to do a lot of research on the pathology of Narcissists (yours sounds exactly like a narcissist) and the classic Idealize, Devalue, Discard relationship model that they follow. \n\n\nThe most alone that I have ever felt was after being discarded. It is possible to rebuild from this, and to come back better than before. I'm really glad you're going home. Feel free to pm me if you need to talk or need some solidarity. ",
            "He is trying to win your back with his \"look how much I care about you and your happiness\" act. Don't let him. Stay safe until you're in the plane and then block him permanently of your life. Good luck!",
            "I just read your original post. I am so happy you are moving back home. What a psycho! \n\nBlock him in every shape and form, then go get some meat and pig the hell out! ",
            "Safe flight to you and THANK GOODNESS you are getting out. \n\nGet home, get some sleep and then worry about processing all of this!",
            "You're doing the right thing. I wish you the best of luck, and no matter what you do, DON\"T GO BACK.",
            "> I feel almost ashamed to tell you all what happened in case you also find it odd and question me, like I am questioning myself right now.\n>Does this say more about me than it does him?\n>I’m just finding it extremely hard to think logically\n>I feel so confused and ashamed.\n\nThis was the purpose of his behavior. All of these thoughts and feelings you have are normal. His behavior was cruel and unhealthy and intended to bring about these exact reactions in you, all the way down to the way he left you feeling like it was all in your head.\n\nWill you be able to seek counselling, even if just for a few sessions, when you get back home? It will be tremendously helpful to have someone who's trained in this kind of behavior help you sort it out and move on.",
            "Please don't tell me your ex boyfriend was Italian...it would really makes me so ashamed of my country...I'm sorry you had to go through this",
            "None of his fuckboy bullshit matters at all.  The only thing that matters is that by tomorrow, you will be out of his reach.",
            "I'm glad you're okay. I hope you can get some professional help with processing and healing. Good luck! ",
            "I am so glad you are going home.  His reaction doesn't really surprise  me honestly.  He has deliberately put the blame on you for his \"disappointment\" in the relationship so that he doesn't have to look at himself and his actions.  They know the relationship is over but \"let you go\" is one last power and control over you and it doesn't feel good.  He may never ever contact you again, even though yes it is possible he will suck you back in.  His lack of sincere feelings of regret for how this relationship went shows you that the real you means nothing to him.  Disgusting.  You may never really figure out what happened to you because he is not a normal person and does not think like normal people.  I am glad that I got to dump my ex who was somewhat like yours though I still yearned for the sincere love that he was never able to give me.  ",
            "[deleted]",
            "Crazy people make you feel crazy. They make you question your own sanity because the way they act is so unpredictable and doesn't make any sense. \n\nWhen you're home, look up sociopaths or traits of abusive partners. They act very weird. They don't do things that make sense, because there is something wrong with them. \n\nI'm glad you got away. I don't know why it happened that way. You just had an encounter with something that is more like a creature than a human being. Think of him as a wild animal. Good news is that you saw it was unsafe, and you got away. \n\nGood job. Don't beat yourself up, then you're just doing his work for him. ",
            "Wow, this is crazy. You're dodging a bullet. Don't look back!",
            "Honestly, you need to let us know when you're back home. ",
            "This might be the first /r/relationships thread where everyone agrees. \n\nGood job OP. You brought the sub together.",
            "Honestly Ive never been so proud of a stranger before. Im so glad you're safe now.",
            "Girl, I have been worried about you! I'm so glad you updated and even happier that you got away from that sorry SOB. I'm so relieved that he just let you go- that could have gone sideways SO fast. I can't know what kind of bullshit he was trying to pull- but maybe it was some kind of divine intervention- or pure luck. Feel how you're gonna feel and then put this shit behind you. Don't look back. And don't believe for a second that any of his trip had anything to do with you, because I don't think it did. That man is broken, and no good to anyone. ",
            "This will be buried but all I care is that you see it. \n\nFirst: I am SO HAPPY that you are ok. I was seriously worried that he might have done you physical harm.\n\nSecond: Breathe. You are NOT to blame for this. Do you hear me? Nothing is wrong with you. This is how emotional manipulation works, in this case, it's like a bait and switch. He wants you to think that something is wrong, that you might be broken or that you are to blame for everything. Don't buy into it for a goddamn second. Every time your mind goes to that place, read that list you made. \n \n\nThird: Please please please be careful. I don't know if you know how lucky you are to be in one piece. Abusive relationships at this level generally don't end well and I'm almost certain things would have escalated to a physical. \n\nAll in all, happy you're ok, try to avoid the raving lunatics next time. ",
            "People like him can pick out people they can affect, very easily. Manipulate, mold, shape... control.  They propel you up (telling you you're gorgeous, the One, marry you, haven't ever felt this way before, etc) only to be able to pull you down that much farther and faster with belittling insults, manipulation, control.\n\nHe was grooming you to be something to him, who knows if telling you to leave was one of his tactics or if something changed for him - maybe he could tell you wouldn't totally bend to his will. \n\nThank the world you are free. Next time, take things slower, listen to your gut, listen to the red flags. They are there for a reason. ",
            "Hope you get home safe OP. Focus on your mother and getting to her. The people here have said everything- fear is healthy, it keeps us alive. Your instincts have been screaming at you this entire time. You have finally listened and so don't stop now. He will definitely try to contact you but never forget how he made you feel. Distance is your best friend here and I really hope you get home safe.",
            "Please let us know you got home safe",
            "What a closure! Just felt like I was watching Sleeping With The  Enemy...",
            "OH THANK GOODNESS.\n\nI almost never comment, just lurk - but I was so worried after reading your 1st post, I kept checking back for updates - it's such a wave of relief to know you're OK.\n\nThe vibe I get from the way things end is: he recognised he was doing something wrong, but instead of acknowledging this openly (where he'd be open to criticism/blame), he instead made it your problem (you were perfect until you opened your mouth. Thus, your fault. UGH! Gross!), so he doesn't have to think badly about his own frightening behaviour.\n\nThe final blow of 'believe in & love yourself' - what a delusional jerk! You already do believe in and love yourself - you saw you were in a shit situation and made steps to change that. \n\nWow, I'm so happy you're going back to the UK. I hope when you get home you have the most fabulous cup of tea & spend some days treating yourself kindly. It sounds like you had a super awful experience, and I genuinely hope you're able to bounce back from this with strength and wisdom. 100% positive wishes for your future!\n\n",
            "I'm not surprised you're feeling confused -- you've been on a month long mind-fuck. Seriously, the guy is obviously mentally ill in a dangerous way. You'll be home with your mum soon and you don't ever have to see him again. ",
            "Oh no I'm so late to this! But holy crow OP I had a boyfriend that was JUST like this, and coincidentally I'd temporarily moved to his country after a short period of time dating him as well. He was just so manipulative about the weirdest things (e.g. forcing me to finish all the food on my plate because if I didn't eat it all, I wouldn't be strong enough to bare his children someday). Just wild and yelling and craziness over petty things.\n\nThen when I'd break down and was at my most vulnerable, he'd totally flip a 180 and suddenly be the calm and rational adult one and talk to me as though I were a child and he was granting me his almighty wisdom. Things about how I didn't know or love myself, telling me how I should be acting and provided outlandish psychological analysis about why I acted a certain way, yada yada yada. Absolutely bizarre. I'd start questioning my own sanity, like.. This guy's obviously crazy, but now I'm crazy? Am I crazy?\n\nDO NOT QUESTION YOUR SANITY. Trust me. Just be grateful it ended calmly and don't look back. Ever. EVER. This is all an elaborate ruse so he can have the last word, leaving you with empty feelings and questioning whether or not you were the nutter in the relationship. He's trying to come out of this like he's the one in the right, but oh god.. after that list, trust me. He's not. He's bonkers. \n\nSo glad you're going home!!",
            "Jesus you got off easy. Then tried to bargain for more?! Then he ended it himself??\n\nBut a lottery ticket when you get home because it's your lucky day",
            "From both your posts, I don't mean to write this to offend you in ANY way, but the alarming rate in which you let this creepy weird guy lead you down this awful path, I would say you need to talk to your mum and seek therapy. You say you saw red flags everywhere but you still continued, you still went along and as much as its good you got yourself out the red flags also lie with you too. Something is wrong inside you if you can't wait to really know someone before being taken to their country. I mean, there are stories everywhere of people who have done this and ended up captive and miserable. You were with an unstable crazy person, and the reason you are here now thinking \"wtf\" is because his behaviour doesn't make sense. So your mind is trying to figure him out. You can't figure him out though, he doesn't have a sound mind. He is not stable. But you also are doing some unstable foolish things that could really hurt your future! It's takes just one bad relationship to mess you up for a long time! Please seek therapy, be more vigilant with who you allow yourself to get involved with.\nWhether it comes from you thinking you aren't worthy of a good partner, or deep rooted insecurities, feeling unloved, unlovable, etc whatever it is, fix those things first then you won't tolerate this crazy stuff. ",
            "I have been a divorce lawyer for over a decade and your original post makes my top 5 list of all time! Scary - sad - and thankfully over! Best of luck OP",
            "> He says that in order for him to trust me I need to do everything he says without question, that he and I need to “be one.” He said for this relationship to work, I need to be “his shadow.”\n\nIs he a Sith Lord?",
            "Thank you for posting an update. I've been worried about you. So relieved you're at the airport on your way home. You were very smart! Honey, you were there for about 4 weeks. It takes some ppl a lifetime to leave, if ever. Don't feel embarrassed or beat yourself up over this. That was some crazy shit he was laying on you. I can finally stop checking Reddit now that I know you're ok. Peace. ",
            "So relieved to read this update! Please consider a few sessions of therapy when you get home so someone professional can help you see you were lucky to survive. ",
            "Holy mother of fuck I just read your first post.\n\nI'm so, so glad you got away from him. ",
            "Thank goodness you are out and you are safe. Do not for a second doubt yourself. Read and re-read you original post if you start to question it. Don't be embarrassed, people like that are extremely good at selling an image of themselves that is appealing. BLOCK HIM BLOCK HIM BLOCK HIM. He will try to keep you on his hook and you really just don't need that stress. Nobody does. Get home safe and focus on you- find a job and/or career that you actually enjoy and then save up to travel on your own! \n\nGood for you for getting out. Hold your head high and keep moving forward! ",
            "I'm so glad you ran. I don't think you're stupid or naïve for feeling confused, but you did a smart thing, and I think you should be congratulated for that. I wish you all the best!",
            "Do not return to him. Do not ever talk to him again.\n\nReading your previous post it disturbed me how similar my ex is to your now-ex. Even the age was the same. Your ex is a cruel, manipulative, misogynistic, abusive asshole.\n\nThe last thing my ex said to me after he dumped me was \"You'll be a rich a famous artist some day. I believe in you.\"\nTotal mindfuck. That's how abusive people work. \n\nI'm sorry you're going through this, but consider him giving you an easy out a blessing, and change your number!",
            "Please let us know when you're home safe. And I have a feeling there will be every attempt on his end to contact you. Don't respond. Good luck. Please keep us posted. And don't question the turn of events. Just consider it a blessing from the Universe and just go. ",
            "Yeah, he's a controlling sociopath. He's put you up on a pedestal (one which you could never possibly fill) and then acted personally hurt when you didn't like how he tried to sculpt you into some 50s-housewife fantasy of him.\n\nGood riddance. Don't look back and for heavens sake don't let him bullshit you anymore",
            "Holy shit! I didn't read your first post but the way he acted here alone is just so manipulative, awful and just so shitty. \n\nThat whole \"you're not the angel I created in my head\"? Bullshit. That is so stupidly cruel. He's trying to tear you down and make you feel at fault for everything and that he's completely  without fault and above you, but I assure you OP, he's not. \n\nI know you're confused and feeling guilty (I went through a similar shitty breakup with a guy who also disliked how much I cried in response to how shitty he was treating me) but please stay strong and go no contact. Don't go back. It will be so hard at first but you're free and you're in a much better place without him. ",
            "He's going to contact you when you don't come back to him. He's going to say he's worried about you, just checking in, are you okay, he'll either \"let you\" come back or when he finds out you're not, he's going to wheedle you a little and then...\n\nBe prepared for a torrent of abuse if you don't hang up the phone or if you read the whole email. He'll call you every name in the book and then some. He'll threaten you and everyone you love with horrible things. And then when that doesn't work he'll be sweet again, so sorry, he just *loves you so much he can't control himself.* \n\nThis is because he's a psycho who doesn't take responsibility for his own actions. \n\nAnd then he'll be shitty again...\n\nDon't let him have enough contact with you for you to hear all that.\n\nYou may not feel like you have power, but you do. It's very simple: all you have to do to not be treated that way ever again is to leave anybody who does these things, or who starts to treat you the way he did. It's not always that easy -- sometimes, especially when they're this psychotic this early, they'll physically come to where you are -- but it is that simple.\n\nDocument and keep everything he sends you, just don't read or listen to it.\n\nIf he comes to you, don't let him in. Let your next employer know (after you're hired) that you have a crazy ex who lives far away but might be crazy enough to show up. (And don't tell a lot of people where you work, either, just in case.) Call the police and let them handle it, and press charges if you can. Your documentation will help the authorities take you seriously and possibly get him out away where he can't harm you until he has had a chance to calm down.",
            "Unbelievable amounts of manipulation. I'm so glad you're on your way home. Over time, youre going to gain perspective on this whole situation, and you'll stop thinking you're wrong or bad or crazy. ",
            "Go home. I'm so relieved to see this. Once you are there, block his number, block everything. In fact, create new accounts and block him on those. Get a new number. Trust me. Don't give him any room to suck you back in when you're still weak and recovering. Take care of yourself, take only what you cannot replace, and write him off. And please, when you are able, talk to someone. You don't have to get through this alone.\n\n",
            "You're not done, he'll be back!  Don't fall into the trap of talking with him or trying to reason, it's important to accept that he's better at manipulating you than you are at resisting.\nJust go no contact, pretend that he's a wild animal trying to charge at you.  Don't answer the phone, don't respond to emails or texts, don't argue or sympathize or anything.\nNo contact no contact no contact.",
            "I'm glad you got out safely! I've never been so worried about a complete stranger before... All the best",
            "My first thought is that this man has the emotional maturity of an infant.  I have never heard of anyone so incredibly immature.  I mean there are a host of other issues but the overwhelming one for me is that he really is, no exaggeration, a little child in an adult body.  And people say this a lot but...  No, really.",
            "OP, I'm so delighted you got out of that horrific situation.\n\nYour first post was... Chilling.\n\nI'm so glad you reached out to your mother, you need all the love and support you can get right now.\n\nYou said in your first post that his mother chastised him over the thrush thing (and rightly so!) do you have a way of contacting her to let her know the full extent of her sons abuse?\n\nCall her on a burner phone, create a new email address even write a letter & leave off your home address?\n\nObviously when you're ready and not immediately, but based on her reaction to the thrush thing in your first post I was going to suggest you go to her for support if you had nobody else.\n\nAt least from a distance nothing can happen to you and it just might keep him from abusing someone else.\n\nI'm so so sorry you went through all that, I can't even imagine. I'm so glad you're safe!!",
            " ive only just seen the posts but I want to say you've done the right thing. Dont worry about why he let you go itll no doubt be a mind game he will no doubt get in contact with you but id just block him. I just want to say you will get through this and learn how strong and beautiful a person you really are and I hope you have a safe flight journey home! Make sure when you get home you have a good group of support around you and theres no shame in seeing someone to talk to about what happened. I send good wishes your way x",
            "He was expecting you to cave in and beg him to take you back when he said he wanted to end it.\n\nInstead, you called him on his bullshit and left. Well done.\n\nNow just stay strong and keep this scumbag out of your life completely. That's all you need to do from this point on and this whole sorry episode will be over.",
            "I didn't realise I was holding my breath until I read you were going home. I was so worried you were going to have kids with him.. ",
            "If he knows any of your passwords for social media, please change them. If he knows your phone account password also change that or he could look you up (on GPS) vis the find my phone feature.",
            "Im glad you're okay. Thank you for the update. ",
            "Make sure this guy has no way to contact ou.  take him off any social media.  block his phone #.  Hide girl.",
            "I'm shocked he let you leave, great job you in immediately asking your mother for help and getting out of there, otherwise you might not have gotten another chance. ",
            "> I mean his last words to me were that he wants me to believe in myself and love myself for Christ sake.\n\nIt was the weirdest, most manipulative way of saying, \"It's not me, it's you\" that I've ever heard.\n\n> I found myself getting more upset and more confused but [had an] inclination to bargain with him\n\nJesus, this guy really did a number on you!  He had your personality pegged.  This was just what he wanted, for you to beg to stay after having been humiliated and belittled and told you weren't doing enough, for you to promise to do more and try harder.  He almost got what he wanted.  Good for you; thank God you kept enough wits about you to instead pack up and get out.\n\nSome serious Stockholm Syndrome stuff going on there!",
            "I haven't been in a relationship that was at this level of abusive, but I have dealt with one nonetheless. They think they have power over you, every time you let them think the way they're behaving is okay and you just let it go. I'm so happy you got out of that situation and that your mom is helping take care of you. Family is the number one thing in life, and most of the time as long as you have your family, I believe everything will be okay.\nHe WILL contact you again, because as others have said, he probably believes you're out there on your own scared, and unsure of what to do and eventually you'll need him again. \nYou do not.\nEver.\nYou are strong, and you are worthy of so much more in this life.\nYou are going to get through this. And I know you're questioning yourself now, because it's been three years since I got out of my abusive relationship and I am currently dating an amazing man and I still constantly question myself and every move I make. \nYou. Will. Get. Through. This.\nIf you ever need anything, please don't hesitate to message me. I don't really know the protocol for this kind of thing but I have a kik.\nI am beyond proud of you for making this post and actually taking control of your life.",
            "Omg seriously congrats on getting away from him. You're doing the right thing!!",
            "IMO: he thought of you like a pet. He saw you, thought you were cute and wanted to adopt you. Then he found out you weren't just an adorable, perpetually happy companion that could be left at home all day until he showed up, then be so so so glad to see him and love him so much. So he decided he wanted to return you. \n\nExcept, uh-oh you're a person, not a puppy.\n\nHe's not ready to adopt a pet, much less be in a relationship. You were irresponsible to move in with him and he was irresponsible and an ass to treat you as he did. \n\nLive, learn, move on. ",
            "Thank the stars you left him.  Let us know when you back.\n\nNever speak to, look up, or think of this piece of shit again.  So happy that you got out of there.  ",
            "I was in a relationship like this, too, last year. Controlling and terrifying, makes you blame yourself, etc. The most important thing right now is for you to get out. Just because it ended calmly doesn't mean all of the other abuse didn't happen. He may have realised how abusive he was, or he may have been using a manipulation tactic - none of us can be sure. (My ex would often break up with me and then 'take me back' to remind me that he was in control and I had to do what he said.) It's important that you don't go back if he comes and says he made a mistake, as then it's a manipulation tactic. It's likely that this is what will happen, as he didn't know you would leave the country. Take this oppurtunity to get out safely and rebuild yourself. Be strong. Sometimes, the aftermath can be the worst part of an emotionally abusive relationship. You might feel like a shell of a person and want to go back. Don't listen to the voice telling you to do that. You may feel empty, but soon you will be filled back up as you form new friendships and get back to your freedom. You can do this. Take it one day at a time. ",
            "Good job for getting out of that terrible situation, OP! But please take care of yourself, and go see a therapist for your own mental wellbeing. It sounds like his emotional manipulation and gaslighting have hurt you deeply.",
            "OMG I AM SO GLAD!!!!! Thank you so much for letting us know you are okay!! I had a hard time sleeping last night...you've been on my mind a lot today. \n\n\nYour mom is a smart lady. Go home and get centered again...get back to who you are. Maybe get some therapy about this, if nothing else, to find out how to avoid manipulative, abusive relationships in the future. But even if you decide not to, I think you are VERY, very lucky here to have such an opportunity to learn from this without too much expense (the lessons get more expensive as we grow...and at least this time, you didn't have a kid in the mix, no pets even...he could have drained your bank account...could be far more expensive). Congratulations!!! Now go out into the world with your new perspective and BE AWESOME! *Super Big HUGS*",
            "I'm crying here OP, so happy for you. Don't go back, please, for the love of all that is good in this world. He thinks you're still stuck in the cycle, but you have your out! Your mum, listen to her. You're not thinking clearly right now, but if you give it some time and hang around normal people it'll resolve.\n\nDon't drink the kook aid! Manipulators are great at being so nice every once in awhile to suck you back in.",
            "Comment Deleted",
            "I am late to this one. After reading the first post and the update....what the fuck? This seems like someone who will eventually kill you for overcooking the spaghetti one day.",
            "Oh dear god, OP!! I'm so glad you are on your way home. I totally agree with other posters about how he's thinking you're wandering out there lost without him. Please do not respond to him ever again. I'm so glad you're safe. Please get some therapy and take care of you. ((hugs))\n",
            "Oh honey, I am so happy for you. I read  your post yesterday and I've been rooting for you in the back of my mind all day, hoping you'd make it out ok. What everyone is telling you sounds dead on. He really thinks he has you now. He thinks you're out there wandering around, cold, broke, hungry, scared. All that shit he said when he \"let\" you go was a really deep, really sick attempt a messing with your mind even more, making you feel worthless and rejected. He is a predator. And you are smart, you realized what he was, and you got out!!! And don't be afraid to ask for help when you get out. Psychologically, this seems like a tough situation to overcome. But you've done the hardest part, you're free. ",
            "Always check with the internet before dating anyone",
            "I know there isn't much I could say that others haven't already said. \n\nBut you have done a very brave and strong thing and I am so glad your mom is paying your ticket home. Do not change your mind. Do not go back. Go home and follow everyone else's advice. \n\n1. Delete or change social media and all your passwords. \n2. Remove and block him on all areas and change your number. \n3. Please go to a doctor and possibly get help or therapy.\n\nThis man is incredibly dangerous. I hope that nobody else falls for his spell, because someone else will get hurt if he gets his hands on them. He sounds a bit like a sociopath. \n\nGod this makes my skin crawl. \n\nYou are an incredibly strong and brave woman for leaving and I'm so happy that you're going home. Everyone is. Thank you for reaching out for help. \n\nEdit: I hope you can update us again when you're home. ",
            "I'm glad you're safe out of this situation. read your post earlier and tbh, I wasn't sure it was even true but if it is, you're out and instead of trying to make sense out of things and wondering this or that, just be glad it's over and spend some time with family and friends back home.\n\nI was expecting a sneaky escape but the fact he made it so easy makes me believe he won't be contacting you ever again. just to be safe though, you really should just change all he knows. well, except for your house, but phone numbers, social media, all that jazz, make new ones. good luck to you and try to focus on enjoying life instead of worrying about wtf all that was, just be grateful it's over",
            "I'm not quite so sure this guy has let you go so much as he's expecting you to come back. However, having been in an abusive relationship before, I can confirm that the nicest thing that particular ex did for me was \"let me go.\" He didn't really let go - he stalked me and attempted to harass me for months afterwards, and he threatened me up and down after he broke up with me. That's the kind of thing abusive people do. I would be very surprised if this is the last you hear from this guy - which is why it is SO important that you get home to people who love and care about you and NEVER contact this guy again.\n\nThis guy's behavior is textbook abusive behavior. He targeted you, preyed on you, and he's been gaslighting you since the beginning. He said those things when you left as a way of furthering the charade he's putting on - he said them to make you doubt your own sanity even further, to make you feel like you're the crazy one, and he's just some great guy that you screwed over. He wants you to come back of your own accord, completely unsure of yourself, and beg him to take you back. He wants a slave, someone he can control, not a girlfriend.\n\nI am so, so happy you told your mother about this. PLEASE get home safely. After you are home, it would be a good idea to find a therapist to help you work this and to keep you from any temptation you may have to go back to this monster. Block him on everything you can, and consider speaking to the police about this guy, just so he's on their radar if he tries to come after you in your home country. IF he ever goes as far as showing up at your door, DO NOT OPEN THE DOOR. Call the police. Don't let him in, and don't let him anywhere near you or your family members. \nTime will help here. I promise.",
            "he was fucking crazy...\nI think your better off.\n\n",
            "OP, do NOT doubt your decision to leave. Abusive people (he very clearly fits that description) know how to manipulate their victims to make them doubt themselves, feel powerless, and think all the problems are their fault instead of their abuser's. Your instincts told you something was wrong, and you left. Trust your instincts.\n\nI'll share a truth I've used before:\nAn abusive person will say they love you, but a person who loves you won't abuse you.",
            "I just read your original post........ \n\nHoly shit......\n\nIs this the norm for his country? For women to be the man's shadow, to listen to and obey what the man says? \n\nGirl I'm glad your getting out of there. \nThis is on of those stories that Dr Phil will do. \n\nIt is absolutley not okay for him to talk to you like he does. It's so eeire and weird and freaky and controlling and manipulative and did I say eerie? I could write a psychological horror story about that guy. \n\nGet far away. Block contact, I wouldn't be surprised if he tries to find out where you are. Keep us updated, PLEASE.",
            "I'm so happy OP posted an update. I was very worried for her. Whatever you do DO NOT go back to him. I still see things in your post that hint that it's your fault. None of this is your fault. Get home and ignore this creep.",
            "Thank God you're safe <3 Even if it is scary and confusing. It will sink in eventually. I know it's hard, but I'm so happy that you're free!",
            "> It's like you think I'm going to hit you or something\n\nI wonder what could possibly have given you that impression. Oh, I know - when he barricaded you in the bedroom with a hammer *to protect you*! Of course that must be it. What a whacky misunderstanding!\n\nYou escaped an abusive psychopath who fits the description of abusive psychopaths so perfectly that if abusive psychopaths were toys made in factories they'd have his face on the packaging.\n\nDo not go back, do not contact him, do not allow him to contact you, block him in every possible way and take some time to heal. I'm rooting for you.",
            "Please let us know when you're back home safe. ",
            "Look... There are toxic relationships, and then there is this! It's good you're going home. I too am in a foreign country and I started dating a man 16 years older than me! We are still together, but there was a time when we broke up where I felt, \"wtf did I do?! This isn't what I wanted for this year at all!\" \n\n\nI think you might be beating yourself up for what happened for a mix of reasons -- *why weren't you good enough?* *am I crazy for having tried to love this man?* *what did I let him do to me?* Please don't blame yourself. I hope that you will take this time, now that you're returning home, to focus on being calm, erasing this, moving forward. Don't blame yourself for this happening. You just wanted love. We all do.\n\n\nTake care.",
            "Look... There are toxic relationships, and then there is this! It's good you're going home. I too am in a foreign country and I started dating a man 16 years older than me! We are still together, but there was a time when we broke up where I felt, \"wtf did I do?! This isn't what I wanted for this year at all!\" \n\n\nI think you might be beating yourself up for what happened for a mix of reasons -- *why weren't you good enough?* *am I crazy for having tried to love this man?* *what did I let him do to me?* Please don't blame yourself. I hope that you will take this time, now that you're returning home, to focus on being calm, erasing this, moving forward. Don't blame yourself for this happening. You just wanted love. We all do.\n\n\nTake care.",
            "Best of luck and a big hug. I hope you're OK.",
            "Wow! So great that you got off so easy!\n\nYes, abusive people have a habit of being able to do the unexpected. I guess this is an extreme version of it. Don't let it confuse you. It cannot be understood. It's crazy. If it was possible to understand it, it wouldn't be crazy. You will never have closure from his end, you'll have to settle with that.\n\nMaybe he has a borderline personality disorder. When those people start noticing someone wants to leave them, they will break up first because they fear abandonment too much. Take a look at /r/bpdlovedones, maybe you will find yourself there.\n\nNow, you're saying you're shell-shocked. I don't know if you realize, but that's probably *literally* true. You should make sure to get help, professional if possible. This will follow you forever if you don't take care of it now, and you can't do that alone.",
            "I once dated a guy very similar to this. Well. not as scary, but equally as narcissistic and trying to play it off as concerned for how I \"loved myself\". If I can predict anything from that experience, it's that he's delusionally (it's a word now, ok?) trying to test your commitment to him. He expects you to fight back. To do just what your first reaction was and to bargain for him. To give up yourself and what you love to keep him. So he can mold you into who he wants you to be. \n\nHe was probably staring at the wall because you didn't immediately jump to his desires, but he's now consoling himself with the possibility (in his mind only possibility) that you will come back to him after being alone and scared in a foreign country. Or worst case scenario, after awhile you'll come to your senses and know that he was the best thing that could ever happen to anyone and you were so lucky to be chosen by him. Either way, you'll come crawling back eventually. Having learned your lesson.\n\nWhen this doesn't happen, OP, there will be hell to pay. He will go bat shit insane on you. He will leave you 10 minute voice messages, he will call your parents, he will threaten/come to where you are, no matter if it's in a foreign country or not (yup, that happened). When that doesn't work, he will send you ridiculously long emails from 40 different accounts oscillating between telling you how much he loves you, and then how you are the most horrible person alive (using all your fears that you told him in confidence).\n\nSo. Block him. from everything. Get a new email address, a new number, make sure your mom's house is secure. Become your own witness protection program. Maybe invest in a security system. Luckily, nothing really dangerous happened to me, just hints of it. I think his mom held him under control from doing anything truly damaging, but from what you've said, that doesn't seem to be something you can assume will be your case. \n\n Just go about this assuming he is going to try to hurt you. And prepare for whatever scenario you can imagine. If they don't end up happening, AWESOME. Better to be prepared though.\n\nStay safe!",
            "What an awful, sick, twisted, backwords man. Sometimes the people who seem the most perfect are the ones who are the least perfect when you get to know them. I know you said he was a real prince charming when you first met him. More like the devil now....its very easy to charm someone before youve met them in person :/\n\nAnd thats what he did. He charmed you, then he gaslit you. From Wikipedia:\n\n>Gaslighting or gas-lighting is a form of mental abuse in which information is twisted or spun, selectively omitted to favor the abuser, or false information is presented with the intent of making victims doubt their own memory, perception, and sanity.[1][2] Instances may range simply from the denial by an abuser that previous abusive incidents ever occurred, up to the staging of bizarre events by the abuser with the intention of disorienting the victim.\n\nBasically they start making you doubt yourself in small ways..then more and more and more until the situation has gotten ridiculous but because you have grown used to their antics it becomes very hard to tell exactly HOW abusive they are being. He did this. He knew he was doing this. Its not your fault that it escalated so much. He was the one with selfish intentions.\n\nAll to make you into some *imaginary princess*. He idealized you in his mind because he is deranged and he wanted to do ANYTHING to force you to fit that idea he had.\n\nHe is living in a fantasy world, OP. He will someday find that out. Most importantly I hope YOU understand that he lives in a fantasy, idealized world that he is desperate for. That reflects badly on him, not you. You ARE normal. Your not wrong for not being a literal barbie housewife princess! Deep down I truly hope you know that. Its ok to be you. \n\nIts going to be very important to spend all your time with people who know its ok for you to be you, from here on out, but especially during the healing process. I think hanging out with people who genuinely care about you and DONT make you feel confused will open your eyes a lot to whats really going on. I grew up in an abusive home...I definitely saw first hand that you cant get out of that fog of confusion until your OUT of the situation 100% and around GOOD people.\n\nI really wish you the best. Im really glad you got out. Please please never talk to that guy again. Theres a good chance he will try to message/call you again. Dont give him that chance. Dont even ignore him. You dont need any conflicting thoughts right now. Just block him. Whatever place you met him on, delete that account. Its not worth keeping.\n\n\n\n",
            "So glad you got out of there, OP. What a scary situation.\n\nI think maybe you should look into some counselling. Not only has this been an extremely traumatic experience but there were quite a few things in your first post that led me to believe you might struggle with self-esteem issues and present an easy target for manipulative creeps like this one. It's especially easy to fall for lovey-dovey bullshit so quickly when you're already struggling internally.\n\nKeep safe! x",
            ">Does this say more about me than it does him? Or is it manipulation to put the blame on me? \n\nIt's the latter, he's manipulative as fuck and blaming everything wrong on you. I am *so glad* you got out of there safely, OP. Stay safe. ",
            "The concern in these comments are amazing. ",
            "I think that writing that down was half of the battle, so now you see clearly exactly what was going on. I'd say the guy was mentally ill, borderline personality disorder or some such.\n\nHaving read the first post, I'm really relieved things are turning out like this and you're getting home. Good luck for the future!",
            "Please reply to say that you got your flight ok...",
            "Keep running girl. I have no idea how you got this lucky break, but take it. Your OP reads like a textbook of how to isolate and break down an abuse victim. GTFO as fast as you can and don't look back. And maybe get a therapist as soon as you get back.",
            "This is gonna sound so inappropriate given the circumstances but the point system had me genuinely laughing out loud.\n\nThat said OP jesus christ your SO (ex by now hopefully) is a massive bag of crazy. Hell I think he has crossed the normal definition of crazy.\n\nGood luck with the future and go see a therapist if you feel you need it.",
            "I know is sounds weird, but when I read your OP I thought 'this is how cults start'. I wouldn't have been surprised if he'd introduced another woman a bit down the line.\n\nHe had you under his thumb. I recommend you get some counselling and get looked after by people with no agenda now. Just remember NONE of this was your fault. You were alone in a foreign country with someone you trusted. You were vulnerable and he took advantage of you. Take care!",
            "Though I never commented on your first post (I think it had all been said!) it's important to know that you have 100% made the right decision. Now you can go home and be with those who love you. Good luck for the future and stay strong!",
            "i said it in your last post as well, gas lighting. he tried to manipulate you into believing YOU were the bad guy. you're not, OP. I am SOOO happy to see an update from you and sooooo glad you're going home. seriously, that couldn't have worked out better for you. he was a piece of shit and you sound like a strong woman. safe travels :)",
            "I usually don't post in things I see on here, but it sounds like you are a good person that just found the wrong person, maybe its the Texan in me.  But, I wanted to wish you good luck and tell you I'm glad that you got out of that toxic situation and if you ever want guys that will treat you right; there are a lot of guys on this side of the pond with common sense!",
            "I hope from the bottom of my being that your life is a lot better and happier from this time on. Xx",
            "Just curious, you said you moved to another country. May I ask which you moved from and what country you moved to?",
            "Honestly OP the guy sounds like he has narcissistic personality disorder. Read about it and some things might make more sense to you. ",
            "I'm so glad you're home safe, OP. Now go get lots of hugs from your momma :)",
            "This thread was locked due to crossposting.",
            "I'm so happy you told your mom and you are on your way home. He is a narcissist everything was all about him. His last words mean nothing. It's how he treated you. Get on the plane and don't look back. Go no contact with him. Learn from this. You deserve to be loved and respected. Don't ever settle for less.",
            "(((hugs)))\n\nI'm so happy that your mom is supportive of your return!  And that you have realized that yes - this was an abusive relationship.\n\nPlease, when you get home - get counseling to learn the lessons you need to learn from this relationship.  Number 1 being - feelings aren't everything.  Number 2 being - anyone can fake it for  a while, sometimes up to a couple of years.  Number 3 - don't move so fast.  If the emotions are great and it's worth having, it's worth waiting for.\n\nAnd those are just from a quick glance at your initial posts.\n\nWhen you get home - hit the gym - get those endorphins flowing!\n\nLearn something new - get a masters degree, take up SCUBA, learn guitar, etc.\n\nVolunteer - make the world a better place.\n\nAnd keep moving forward, being thankful that this is in the rear view mirror.",
            "Glad you're leaving. Dude's a grade A narcissist. ",
            "He sounds like a classic example of someone with borderline personality disorder. Don't let the shifts in his persona mess with you, the parts you saw of him that were bat shit crazy aren't likely to go away. ",
            "Argh (to put it mildly). Textbook narcissist. They never let go, so you need to. Run. Then:\n\n1. Block him everywhere.\n2. Read up on \"narcisstic personality disorder\" and arm yourself with the wisdom for when you feel you cannot get over it. Also see /r/narcissisticabuse\n3. Therapy. This will help you unwind your brain, and ensure you don't get involved with another narc. \n4. Stay with your mum and get family support in getting through this.",
            "Please, what country was this? ",
            "I'm ready for downvotes....\nYou are the sane one, yet moved to another country after literally just meeting a guy 3 months ago?  You weren't \"happy with where life was going\" so you just up and leave?  He is probably mentally ill, considering his need for control and flip flopping emotions about you and your relationship, but how are literally ANY of your actions the ones of a person who's not also mentally ill?  And judging from your description, it would be informative to know what country he lives in.  The truth is, there are many countries where a man having the controlling upper hand in the relationship and expecting his wife/girlfriend to cook and clean is very normal.  This is not a judgement of whether that is right or wrong, it is only an observation of many (I want to say most) countries, out of all the countries that exist.  At what point is something culturally expected of him and indoctrinated versus him being a monster who only lives to tear your world apart?\n\nI'm not trying to make you feel bad, but everyone on here is saying \"thank god you SURVIVED this,\" like you were held captive.  The truth is, you weren't abducted, you weren't born into a caste system or pressured financially, sexually, or physically to move in with him.  It wasn't a guy at work badgering you constantly and wearing you down, it wasn't a tinder fling, it was you saying \"i hate my life, maybe this guy who says i'm the one after knowing me for 2 seconds will fix my life, i'll MOVE TO ANOTHER COUNTRY.\"  Your fear about not knowing the language when he tried to kick you out?  Classic first world shit, expecting travel to always work out because how people not speak english??? Come on, you were going to travel all over as some adventuring backpacker and hadn't even sort of brushed up on a few words, and couldn't think of any plans to get out of this, when a fucking cell phone and your bank account is sitting right there?  You were not destined to be an adventuring backpacker then.  Please stop saying \"oh i was thrown into this crazy storm of being an outsider who doesn't know anything, it's so fucked\"  Why you?  Because....you fucking moved there, you literally bought and paid for a ticket to be there.  And didn't leave til you got kicked out.  This is about to sound hella mean, but based on your info, the facts are that you dated a dick, you didn't enjoy sex but also didn't actually get up and end intercourse (based on a fear of physical abuse that never happened??), then got dumped, and everyone's like \"omg you're such a warrior you've been through so much you brave woman.\"   He just sounds like a straight up idiot, but he's not fucking satan.  Life in general is like him, it will walk all over you if you just sit there wondering how you feel about it.\n\n  You can do what everyone tells you to, which is pat yourself on the back every day for blocking him on social media and talking to a therapist about how awful he was, but you should also take into consideration that your actions were that of a person who makes really fucking big decisions spontaneously based on little knowledge, and then is surprised when it goes to shit.  You sound like you were trying to outrun depression and wanted a lot of validation, and you might find yourself in a similar predicament if you don't stop and talk to a therapist about your severe lack of self confidence and the dangerous places you've chosen to go to to fill that void.",
            "[deleted]",
            "Throwaway here, I just had to respond. I'm happy for you and I think I could answer your questions differently than most people that have so far. \n\n\nYour ex reminds me of an extreme version of myself. I am jealous, controlling, and manipulative. I am a broken person. Many things that he did were extreme and he took it too far. The advice you received was great and I'm happy that you're safe. \n\nMost people thought that he was a complete psychopath, and that might very well be true, but to me he just wanted what he wanted and that mattered to him a lot. He lives a lie, he wants everyone to like him and he wants to love himself but the truth is he's not happy with himself and has a very poor self esteem. How would he react if someone said someone bad mouthed him? It sounds like he wants you to be perfect, because he doesn't feel he can be, but he believes you have the potential to be the perfection that he'll never have. If you only work on yourself a little bit more. His intentions are not malicious, though his actions definitely are and he crosses the line. It sounds like he's been thinking about this, and he blames you for everything that goes wrong because you'll never be the perfection that he wants. He doesn't hate you or want to mistreat you, he's a broken person. I think he'll never figure out what he did wrong. I think he's a bit shocked at how you're reacting at what he believes to be perfectly reasonable requests. I think he's feeling bad that things didn't work out and thought the right thing to do would be just to let you go. \n\n\nAgain, these are all assumptions based on my own reflection and thoughts, to me they are accurate. I struggle with my own personality almost every day.",
            "Please don't think that this should reflect negatively on you by any means OP. You made an impulsive choice, but that's okay making impulsive choices is part of the fun of life. Unfortunately you made this choice while only have an ideal of this person in your head instead of who they actually were. I'm so sorry that you had to go through that, but just think of it as a learning experience and an interesting story to tell at parties. Be grateful that you were able to get out easily and with (what seems like) relatively few scars.",
            "Just throwing this at the wall to see if it sticks; perhaps he was introspectively disgusted with his own behavior as well. ",
            "Where is he from?",
            "What country was this where this is normal behavior for him?  I'm guessing somewhere hispanic.",
            ">I know he cannot bear the thought of anyone thinking badly of him, he wants to be idolised too much.\n\nWould be interesting if you unblocked him, sent him the first thread, then blocked him again. Maybe it'll prevent him from doing this to someone else.",
            "He probably just realized that you aren't who he wants. ",
            "My instincts tell me Italian??",
            "[removed]",
            "[deleted]"
        ]
    },
    {
        "post_id": "4p7t7x",
        "author": "girlscoutthief",
        "title": "[UPDATE] My [32F] Girl Scout Leader [32F] stole all of the cookie money.",
        "url": "https://www.reddit.com/r/relationships/comments/4p7t7x/update_my_32f_girl_scout_leader_32f_stole_all_of/",
        "score": 2360,
        "num_comments": 109,
        "created_utc": 1466553822.0,
        "selftext": "It has been just about a month and I have an update for all of you. Thank you so much to everyone who offered advice and their stories. It really helped!  [original post](https://www.reddit.com/r/relationships/comments/4l093t/my_32f_girl_scout_leader_32f_stole_all_of_the/)\n\nMost of you urged me to go to the police and file a report. Well I did, but the officer that talked with me said I shouldn't file a police report yet and should contact Candie and try to procure the money from her to show that when I do file a police report I can show them that I made every attempt to get it from her and that she is aware of the theft. So, I messaged her:\n\n\"Candie, in the month of March our Girl Scouts' bank account was drained. I went to the bank and have account statements and withdrawal slips showing that you made unauthorized withdrawals from the account. If you do not restore the account I will be filing a police report on June 1st to protect myself and the girls\"\n\nHer response:\n\n\"I will be restoring it no worries. It was not all me but I will be replacing it because I am the one who lost the information. But thank you. I am putting in a certain amount each month towards both girl scouts and the bank. But thank you, I got what you are saying.\"\n\nMy response:\n\n\"I spoke with the branch manager at the bank. They have evidence that it was you. I have had a bank account there for over a decade, they require you to show proper ID when you withdraw money from the account. Also, there are cameras outside and inside the building.\"\n\nCandie's response:\n\n\"Well without going into my personal information, I do not remember it, but I am being treated for it. Acknowledged my mistake and will take care of it. It will all be paid to the GS council before August 1st and the remainder of the money is accounted for between my trip to the council shop and the stuff I will be purchasing for the water park. My first payment to them is June first  because that is my first check for my new job. That is all I'm saying on any of this.\"\n\nAfter that, I talked with the GS council again and sent them the messages. I told them that if they didn't resolve this I would. They had a meeting about it the next day and decided to remove Candie as a volunteer (obviously) and that they would be going after her for the full amount of what they owe the Girl Scouts and what she stole from our troop. They also agreed to deposit the money right back into our account as soon as she was removed from the bank account. I was super happy about this resolution! There is a catch though... they didn't want me to tell the parents at our last meeting that this was going on. They had to officially send Candie a letter of removal before it was official. Also my contact at the GS council said they still wanted me to pass out flyers for Candie's water park event that she promised. I was pissed about that, because this lady might have a drug problem or something, how in hell can you trust that she will go buy anything for the water park or even show up? AND if she does what if she uses it as an opportunity to scam them out of more money? They had Candie drop off the troop meeting information on my porch so I didn't have to talk to her.\n\nWell, I went to the meeting and no one ended turning up because Candie had conveniently scheduled it the day before they had the day off of school, which I wasn't aware of since I don't have a child in the school. So no one thought there was a meeting. I was actually really happy about that, because I didn't want to encourage them to go to this supposed water park event hosted by criminal Candie. \n\nAfter that, the Girl Scout Council agreed to send a representative to have a meeting with the parents and go over our options for next year and having a new troop leader. Candie sent me a message this morning (I guess one of the parents clued her in about our meeting):\n\n\"The only thing that needs to be discussed at tonight's meeting, is the fact that I will not be returning as troop leader for Troop \nxxxxxx, my family is moving and will no longer be in the school district or nearby to be able to continue with the truth. I wish you the best of luck.\"\n\n\nYes, screw her for trying to cover her own ass. Even though I would love to tell everyone how terrible she is, I decided not to tell the parents about Candie. I thought about it a lot, and if I did, one of the parents will tell their daughter and then everyone will be gossiping about Candie's daughter. It is not this poor girl's fault that her step mom is a crook and I don't want her to get bullied because of it. I also think it would turn a lot of the parents away from the troop and I don't want to ruin everyone's girl scout experience because of me. Candie is gone and can't be a part of the troop anymore, so good riddance. Girl Scouts are going after her for all of the money so she will have to face the legal consequences as well. Me telling the parents wouldn't help anything.\n\nAlso, on a positive note, at the meeting one of the parents said they will step up and be troop leader, yay! I have decided to stay on and help them as much as possible. I want to have a good experience volunteering and I shouldn't give up because of one jerk. \n\n\n**edit** Just wanted to add to those that are worried that Candie can do this to another troop, she has been black listed from the Girl Scouts organization nationally, she is not allowed to be in any leadership role. As far as her doing something shady somewhere else otherwise... there's not a whole lot I can do about that. I can't let everyone in my state know she is a scumbag, so it is what it is. \n   \ntl;dr: Candie was kicked out of the troop and the Girl Scouts are legally pursuing her for the money stolen from both the Girl Scouts and the troop. We're moving on! ",
        "permalink": "/r/relationships/comments/4p7t7x/update_my_32f_girl_scout_leader_32f_stole_all_of/",
        "comments": [
            "[deleted]",
            "You probably should tell the council that Candie is going to be skipping town... ",
            "I'm amazed at the balls on this woman to admit to her crime via text and not even be apologetic about it. She's her own defense attorney's worst nightmare.\n\nSo, the GS are going after Candie now? Will the cops be involved? I don't know what's more frustrating, the GS covering this up or Candie's total lack of remorse.",
            "This is a great update! You've acted like a fantastic role model and, even though the kids and parents won't know about this incident, I'm sure that they'll get so much out of what you can teach them. I was in Girl Scouts as a kid and it really made a difference when we had a leader who really cared about the troop. Thank you for sticking it out for another year.\n\nCongrats on the new leader situation and best wishes towards another year of campfires and cookies! Eat a sleeve of Trefoils for me!",
            "So, did I interpret that correctly?  Is Candie suggesting she has some sort of condition that caused her to forget each time she went to the back and stole money from children?  Really?\n\nBut it is good that you didn't tell the parents or that it isn't on the news.  When I was in high school, the treasurer for the band boosters stole nearly $40,000 from the savings account.  His daughter was definitely treated differently by other students: her dad was made fun of, people made assumptions about drugs or other things he may have been into to lead him to steal the money, things that she had, people would ask if the band boosters bought it for her, etc, just getting harassed by other students for something she didn't do and didn't know about.  And I'm not sure if younger kids or teenagers would treat someone worse if their parent was caught stealing from an organization they volunteer for, to be honest.  So even though it would be super tempting to show people Candie's true colors, I'm sure you spared her stepdaughter a lot of anguish.  ",
            "Good, you've got a new leader, happy to hear.\n\nDon't worry about Candie anymore, the Girl Scouts are dealing with it, you don't have to. \n\nlol, that last message, \"I won't be able to deal with the truth.\", I think she may be comprehending what's happening. ",
            "Sadly this happens a little too often. I've seen parents never show up with hundreds of dollars in cookie money and have to be reported to council. Cookie moms with missing money. Parents running unsanctioned booths getting robbed. Parents running unsanctioned booths getting \"robbed\". And lastly scout leaders with fuzzy accounting practices \"one for you, one, two, three for me...\" At the end of the day they're all just people just as inclined to do bad things as any other part of the population.  ",
            "This happened in my troop when I was a kid! The troop leader stole our cookie money and went to Atlantic City. The council refused to do anything about it, and our parents made up the difference. I think Girl Scouts of America discouraged publicity for their own benefit, not ours.\n\nCandie won't have a record now, and will be able to repeat her crime in another town. You should publicize what happened so that it comes up in a Google search of her name.",
            "Do not say anything about Candie, you may face legal action. As crazy as that sounds . You need to protect yourself too. Good job!",
            "[deleted]",
            "\"Continue with the truth\"\n\nAhahha that's one Freudian slip, huh?",
            "Ah...my troop mom stole our dues to buy clothes..in 1965. Still remember how bad her daughter felt about her mom's behavior.\nIt was really disappointing. The 60's were rough years in lots of ways.\n6 year old learns about mis-laid trust.",
            "Eh no justice. That being said, she's not very bright in making all those admissions. \n\nAs a civil practitioner, the GS aren't gonna get a dime out of Candie.",
            "Congrats, I think you handled this really well. You definitely did the right thing. \n\nOne thing that might be good to put in place going forward is requiring two signatures to withdraw funds from the troop account or for writing a cheque. In this case, your signature and the new troop leader. \n\nI was treasurer for a voluntary community based group for over two years. We never had any issues like this, especially because of the the 2 signatures rule. But I saw several other voluntary groups have these issues.\n\nIts a shame because it could definitely turn people off volunteering. I'm glad you have decided to stick it out :)",
            "All this really did was reinforce in Candie's mind that she is above the law and can do what ever she wants (like felony theft), blame it on mental illness and get away with it. Her only consequence is that she was \"fired\" as a volunteer but still got to keep her reputation as an upstanding citizen. Oooh yeah they will send her collections, big deal! I'd be willing to bed her credit is crap anyway. \nI know OP had didn't have the final say in all that but it just seemed like the GSOA were more interested in keeping it quiet than righting a wrong. Which I think would be a good lesson for the kids that they would probably never forget...you steal, you go to jail. \nGood for you OP for not letting this make you stop volunteering.",
            "Good on you for taking the high road to spare both additional drama within the troop and for her daughter, that takes a lot of strength and humility to do. You said it perfectly, she's gone and has to face what she did on her own, and you all can move on without any more interference from her. A happy update. Good luck!",
            "Excellent foresight on not telling the parents. A lesser person (probably me, haha) would have just gone scorched earth without thinking of the repercussions, but that was a very smart move that will definitely pay dividends, or at least minimize losses. Glad it all worked out!",
            "Ahh .. but who stole the cookie  from the cookie jar?",
            "You should still go to the police and tell all the parents from the troop. Sounds like Candie is just going to do this again wherever she goes and the GSC is being weak for not dealing with this head on.",
            "Good for you, stay on the high road. You handled this whole situation like a boss.",
            "Candie sounds a lot like my ex coworker that just got fired for stealing from our cash drawer and tips! Drugs and medical conditions make people do weird shit. Hope her daughter is ok.",
            "The old \"I don't remember it\"...\n\nIt might work for the men in her life but don't cross the Girl Scouts.",
            "Criminal Candie. Steals from the defenseless who trust her, and when caught plays it off. Is this how memes are born?",
            "You've handled this tremendously and in doing so got a best case scenario outcome! Kudos! Best of luck!",
            "Sounds like Candie may have had a drug problem",
            "Good lord,  no wonder she gets away with this crap.  There's no negative outcome for her! Very disappointing ending.  (Minus of course that she's gone)",
            "You did the right thing protecting her child. ",
            "I feel her husband has a right to know about her behavior and the influence he's brought around his daughter. There is no way she would tell him on her own. ",
            "Easy way to notify the whole troop about Candie without a public display is to tell one or two troop parent and let the gossip tree do the work for you.  ",
            "I just want to thank you for thinking about the girls in the troop first and foremost, and not letting the actions of one scummy adult ruin it for them.",
            "[deleted]",
            "I am happy to read this update and know that your troop will continue. The story is particularly annoying because it is women like Candie who make doing troop financials so picky and detailed. I just sent mine in and I hate doing them! ",
            "This is like some Joanne the Scammer style shit lmao Candie has some fucking nerve.",
            "You do know that is how people are able to continue screwing people over and over.  Silence!",
            "I am so sorry you had to go through this. As a Girl Scout leader, I understand the leaps and bounds that we go through to make sure that the girls are having a great experience. The fact that your co-leader is someone that you AND your girls were supposed to trust and the fact that she stole troop money is abhorrent.\n\nI'm glad the council is going after her for all of that missing money and I'm glad that you and your troop will be moving on from this.\n\nGood luck!",
            "I hope the GS Council blacklists Candie in case she decides to become a troop leader somewhere else. She is so unfit to participate much less lead a troop it isn't even funny.\n\n",
            "If there is indeed a risk of a defamation suit, I doubt the GS Council will say anything.",
            "I don't know if you still check this but I saw this and thought of you.\n\nhttp://www.nbcmiami.com/news/local/Florida-Woman-Steals-Nearly-85000-From-Girl-Scouts-Police-391933661.html?_osource=SocialFlowFB_MIBrand",
            "I know this is not legal and not the kind of advice we should be sharing in this sub **but** if it was happening in my community, some tires would have been slit (at least).",
            "[deleted]",
            "Wait you're 32 and you're still a Girl Scout? Is that a thing. Seriously no kidding I'm seriously asking. "
        ]
    },
    {
        "post_id": "w4h0mk",
        "author": "None",
        "title": "I (23F) broke up with my boyfriend (33M) and moved out, and he’s still acting like we’re together",
        "url": "https://www.reddit.com/r/relationships/comments/w4h0mk/i_23f_broke_up_with_my_boyfriend_33m_and_moved/",
        "score": 2354,
        "num_comments": 294,
        "created_utc": 1658410892.0,
        "selftext": "I ended things the other day. Packed my stuff, told him bc of his drinking, and being treated constantly like sh*t I was done and gone. I moved out the same night. I told him that bc I love him and care about him I’d like to remain friends and check in on him. I even agreed to go to a movie this weekend that we were originally planning on seeing. The thing is, he is still texting me constantly starting it with “babe” and ending it with “I love you” I feel obligated to tell him I love him back, (bc I do, but not romantically anymore, which he knows). When I was leaving he asked if it was forever and I didn’t want to say yes and hurt him more so I said something like “I can’t say what the future holds” \nAdvice?\n\n\nTLDR; ex bf still acts like we’re together\n\n\nEdit to add: okay guys, I get it. I’m at fault here. This is my first breakup and first relationship, I have no idea what I’m doing. I will talk to him. Thanks for the comments.\n\nEdit #2: I phoned him. I cancelled the movie, set clear boundaries and was upfront and honest with him. He hung up on me just as I was about finished, so I’ll take that as him understanding. Thanks again for the comments. Hope you all have a good day.",
        "permalink": "/r/relationships/comments/w4h0mk/i_23f_broke_up_with_my_boyfriend_33m_and_moved/",
        "comments": [
            "[removed]",
            "> told him that bc I love him and care about him I’d like to remain friends and check in on him.\n\nThis is your mistake.\n\n>I even agreed to go to a movie this weekend that we were originally planning on seeing. \n\nThis is another mistake.\n\n>I didn’t want to say yes and hurt him more so I said something like “I can’t say what the future holds” \n\nThis is a very big mistake.\n\n>Advice?\n\nStop talking to him. At least for a while.",
            "You're BOTH acting like you're still together. You reply \"I love you\" to his texts, you're going to a movie with him this weekend and when he asks if it's permanent you give him the impression it's only a break.\n\nI know you're doing all these things because you still care for him as a friend and don't want to hurt him, but you've got to reread what you just wrote and realise you're giving him the wrong impression at best, or stringing him along at worst.\n\nDo the right thing and communicate clearly to him that it's over. It's NOT a break, you're NOT getting back together, the relationship is over and it's final. Don't expect him to \"read between the lines\". Be crystal clear. And then go no contact. Let him know you're going no contact not because you hate him but because it's the only way the two of you can get over this break up.",
            "> I told him that bc I love him and care about him I’d like to remain friends and check in on him... I feel obligated to tell him I love him back... I said something like “I can’t say what the future holds”\n\nStop doing all of this immediately. Whatever your good intentions, you can see that the result is to enable his self-delusion. Send him one last message saying that, on reflection, you don't want to remain friends and think it's better to make a clean break, that you won't be contacting him again. Then block him.\n\nTalk to a trusted friend or family member, let them know you're doing this, and contact *them* in the future if you feel yourself about to try to talk to this guy again. Get a journal or just your phone's Notes and write down some reminders of why you broke up with him, and refer to that in future moments of weakness.",
            "By telling him you love him back, makes him think you're still in a relationship. Quit while you're ahead. There are better things waiting for you.",
            "Um...you're doing that too, so...",
            "You need to make a clean break. You aren't helping him by letting him cling to hope and he clearly is still trying to pursue you and not be an actual friend.",
            "No contact is always best and doesn't have to be forever.",
            "> I told him that bc I love him and care about him I’d like to remain friends and check in on him. I even agreed to go to a movie this weekend that we were originally planning on seeing.\n\nYou're sending mixed signals to him. \n\nBreak all contact for at least 6 months, then see if there can be a friendship.",
            ">I told him that bc I love him and care about him I’d like to remain friends\n\nThis is not going to work with this guy. He doesn't care that you've decided to break up with him, he thinks he can manipulate you in to staying with him. You need to go cold turkey and block him entirely from your phone and socials. Don't tell him where you moved to either.\n\n>check in on him\n\nHe's **10 years** older than you. He doesn't need you to take care of him. It was weird and kinda predatory that he was with someone your age to begin with. How long were you together?\n\n>When I was leaving he asked if it was forever and I didn’t want to say yes and hurt him more so I said something like “I can’t say what the future holds”\n\nSay it's forever or he'll never take you seriously. Altho tbh, it doesn't sound like he'll take you seriously even if you do tell him it's forever.\n\nIt sounds like this guy treated you like shit, maybe was even abusive. The last thing he deserves is for you to continue coddling him like this. Please stop.\n\nClean break, move on. Do NOT look back.\n\nedit: felt the need to bold the age gap, which many other comments seem to be ignoring and seems very relevant here.",
            "Why do you want to have a friend that has a drinking problem and constantly treats you like shit? I know there are feelings there but it's times like these where reason needs to prevail over emotion because yes, you care about him but no, you should not keep a person like this in your life. It's not healthy. Also the age gap is concerning.",
            "You literally are going on a date to the movies.  Stop confusing him and block him on everything. Unless children are involved there is no reason to be friends with an ex",
            "he acts like you are together because you let him.\n\nCancel the date night you have with your ex, then go low contact",
            "It's not appropriate to be friends with him. He won't accept friendship, you'll be leading him on with every breath.",
            "You seem to think that leading him on and making him believe there's still a chance and you two are just on a temporary break isn't crueler than the temporary discomfort of ripping off the band-aid and being the \"bad guy\" for breaking up with him.\n\nStop jerking him around. Stop telling him you love him and justifying it in your head that it's okay because it's only platonically. Stop sending him mixed signals about \"what the future holds.\" You know he wants more, and you know you don't want to get back with him.\n\nFor these kinds of break ups you can't remain friends or in his life at all. Maybe in a couple of years if he's gotten his shit together and you both have moved on you two can reestablish a platonic friendship. Trying to stay \"friends\" is just prolonging the break up and makes things messy, complicated, and painful for both people, especially to the one who still wants to be in the relationship.",
            "I'm physically recoiling at all the horrible mistakes you've managed to accumulate in such a short span of time.",
            "My advice is to break up with him, which is not what you have described in this post.",
            "First, this man is not only a grown 33 year old, he is 10 years older. There’s a reason why women closer to his age ain’t messing with him. \n\nSecond, he abuses alcohol and treats you like shit. You need to block this man and continue on. \n\nThird, you need to block this man and continue on. You making plans to hang out with him “platonically” and telling him that you love him isn’t healthy for you. \n\nLastly, you both are acting like you are still in a relationship. \n\nThis man is trash, sis. You are too worthy to be treated like this. You already recognized this when you became fed up with it and broke up. There’s so much better out there for you.",
            "You're giving him mixed messages.\n\nThis is understandable, bc most of us are raised not to hurt men's feelings for a variety of reasons, including safety. We have to be nice. We can't be direct. We need to waffle and make them feel okay about us.\n\nYour actions leaving him say one thing and your *continued interactions* with him say another.\n\nThe point of breaking up is that you are no longer enmeshed.\n\n>I feel obligated to tell him I love him back\n\nNo. You are not obligated to go on dates, \"friendship dates\", answer his texts, call him, answer his calls, have sex, tell him you love him, or manage his feelings.\n\n\"Letting him down easy\" is not what you are doing, and it's not doing him or you a favor.\n\nIf you're really done being in the intimate relationship, it won't work to have the relationship minus the sex/living together, call it \"friendship\" and act like everything is fine. He is confused. Maybe you aren't ready to lose the emotional aspect of being with him, so you're holding on to staying connected by being foggy and vague about your future together. It's a mistake. \n\nPeople *can* regain friendships after dating, when both people are extremely clear about what that means. But mostly, it's often just booty calls, entanglements with their new partners (this is my best friend who is my ex and sometimes we go do date type stuff or cuddle), and leads to on-again, off-again whatever-this-is.\n\nIf you want to break up, use clear, direct sentences and repeat them as needed. Stop engaging with him emotionally.\n\n\"I'm sorry I was so unclear before. We are broken up now.\n\nWe don't go places together now. We don't go out to movies or dinner or clubs or the lake.\n\nDon't text me and I won't text you \n\nDon't tell me you love me or call me babe, bc we aren't together. I won't call you or text you or tell you I love you or \"check in on you\" because we aren't together.\n\nYes I said I want to be your friend, but that means continuing some emotional entanglement which I realized I'm not going to do. We're not together anymore. So those lines are really blurry. I'm taking a step way back and that doesn't mean you take a step forward. We are done.\"\n\n:Think about what you want, OP. And be clear, strong and direct about it, verbally.\n\nGive this separation a chance to stick.",
            "I’m sorry to be blunt but you have to grow a spine and say the things you actually mean.",
            "The problem is as much the way he is acting like you’re still together and that YOU are still acting the same. If you can’t refrain from telling him you love him by text, do stuff that awfully look like dates with him and overall can’t put a single boundary in place then you cannot be friends with him, at least not for now.",
            "You both act like you're still together.\n\nI really feel the need to mention, though- he is 33 years old. He does not need to be checked on or coddled. He is using your kind nature to manipulate you back in to a relationship. \n\nPlease cut ties with him and be done with it. The more you continue to talk to him, the more he will pressure you in to getting back together.",
            ">Advice?\n\nHe's not the only one who is acting like you're still together. I think you should break up, for real this time.",
            "Ouf no no no. Time to go no contact.\nThis sub might help : r/ExNoContact",
            "Well first of all stop trying to maintain a friendship with an alcoholic who's a decade older than you and treated you poorly, what exactly are you getting out of that \"friendship\"? Telling him you love him and aren't sure you want to stay broken up is.. not exactly standing firm in your decision or communicating clearly to him. Block his number, you both need space. If you really want to be friends with an ex it takes months or years of not communicating to truly get over your feelings and be able to come back together in a platonic way, you can't go from dating to besties overnight and then be confused about his reactions to you keeping plans for date night and saying you love him.",
            "The age gap, the drinking and the mistreatment. Really break up with him, stop texting and going on dates with him. You’re not his mom or therapist. You’re only 22, so much life to be lived. Have you ever wondered why he’s with you instead of a woman his age?",
            "He knows he's in control because you're still responding.",
            "you cant tell him you love him back. you’re either crazy, stupid, or not thinking.",
            "You aren’t safe. Use the buddy system from now on. Stop contacting him. Don’t be alone with him. Stop contacting. Stop responding. You are still being manipulated.",
            "lol what the hell are you doing? cut him off. you wanting “to remain friends” with him is a baffling, absurd decision to begin with considering the circumstances, and you’re still acting like his girlfriend.\n\nYou both need space from each other considering you both are not mature enough to maintain a platonic relationship. You as a younger person, I get, you’re afraid of conflict. But you need to cut him off.",
            "This is why he’s dating someone 10 years younger. He knows you’re very naive and think you need to be a people pleaser and a caretaker. It’s time you cut him off completely because you’re still his girlfriend, you’re just to naive to realize it. He’s a grown ass man who doesn’t need a young woman checking in on him. It’s always a bad idea getting into a relationship with an alcoholic, once again something your age makes you naive about. Break up with him because in a few years you’ll laugh at yourself over how stupid you were with this breakup.",
            "He is 10 years older than you and treats you like shit and is a drunk. He is pretty comfortable with who he is and the reason he's dating a 23 y/o and not someone his age is because no one his age will put up with his loser shit.  \n\n\nYou shouldn't either.",
            "Go no contact. That’s the only way",
            "You ALWAYS go no contact for a while after a breakup. Even if it ended well.\n\nBecause you're enmeshed in each other, and any connection is a lifeline for the relationship.\nHe needs to know it's serious. But instead you're showing it's not so serious, and that he will still get the same things.\nYou need to stop communication and let both of you get used to what a life on your own is now\n\nWhich is probably going to be hard for him, and he might throw tantrums and lash out when that happens. Be prepared to block him. It's not rude or awful, it's following through.\n\nBeing friends after a breakup can happen after a time of getting yourself back, getting your own routines and being free from the relationship.\nThen you can build a different kind of relationship on a different ground. \nBut frankly, he needs to see what he is like without you, and if he isn't changing what hurt you and made you leave, I wouldn't want to end up becoming friends again and ending up enabling anything. \n\nFocus on you.",
            "YOU need to draw the Boundaries. YOU are leaving. YOU don't want to be friends with an alcoholic. HE has to make decisions for himself. \n\n**STOP SAYING I LOVE YOU TO SOMEONE YOU BROKE UP WITH!**\n\nDon't be friends with ex's. If they treated you badly as a partner, they will treat you badly as a friend. STOP listening. HE IS MANIPULATING YOU TO STAY AND BE NICE TO HIM! He is 10 years older than you, he knows what he is doing.....**STOP BEING NICE!**",
            "Please just block him and move on.  He will continue this until you lay out a clear boundary.",
            "You’re not at fault for anything. He’s not respecting you and the fact that the relationship is over. \nYou should look up what a narcissist is, because it could take you years to shake him. You should honestly just go no contact after giving him clear closure. \n\nNo contact and stick with it. Respect yourself.",
            "He is TEN YEARS OLDER THAN YOU. He has a problem drinking, he clearly cannot understand your boundaries, and he's actively trying to wheedle his way back into your life. This is partly your fault, as you keep indulging this behaviour instead of shutting it down, but you are very young and that was precisely why he targeted you instead of date a woman his own age- because the age dynamic and your inexperience will make you easy to manipulate. And he's right - look how you can't get away from him. You need to put down harder boundaries and stop talking to him. I also recommend therapy - you are clearly in need of some self esteem and pointers in recognising someone who is toxic because I guarantee there's a million red flags you couldn't see",
            ">TLDR; ex bf still acts like we’re together\n\nbecause YOU are still acting like you are together.    Stop doing couply things with someone if you dont want to be a couple with that person.",
            "Girl, you gotta cut him off. You’re being very sweet by trying to offer him friendship but he wants to have a romantic relationship with you, not a platonic friendship. I don’t think you’re leading him on necessarily but I do think you need to give this man some space to move on. More importantly, you need this time to focus on you! It’s possible to be friends with him in the future but right now there’s way too many feelings involved. Spending time with him will probably only make him more clingy and hopeful that you’ll take him back 😕",
            "[deleted]",
            "By trying to be nice you're giving him hope. Stop it. Don't tell him you love him, don't hang out with him, and remind him the relationship is over. Honestly I think you should consider blocking him.",
            "Of course he’s acting like you’re still together - look at what you’re saying to him. Why are you surprised??",
            "Do not be wishy washy when breaking up. There is no way to not hurt someone when you break up with them so always do it decisively and make a clean break.",
            "Clean breaks are almost always the best. No contact for about a year is good.",
            "Staying friends with an ex (immediately after you break up, at least) is a myth perpetuated by teenagers who haven’t learned how to set boundaries yet, and by TV shows with an ensemble cast where the writers want to break 2 characters up but keep both actors on the show. It isn’t a thing IRL to be able to suddenly flip a switch and go from partners to friends.\n\nYou need to cut contact with him for the time being so that both of you can get over each other. That isn’t to say that you couldn’t ever be friends at some point in the future, but you both have to heal from this breakup and be in a good place first. He clearly is not anywhere near ready for that now.",
            ">TLDR; ex bf still acts like we’re together\n\nYou're the one acting like you're still together.",
            "I literally went through this a few months ago.... and I am the dude.  Just cut him off completely.",
            "> I told him that bc I love him and care about him I’d like to remain friends and check in on him. I even agreed to go to a movie this weekend that we were originally planning on seeing.\n\nThat's why",
            "You're being nice when you should be kind. \n\nNice in that you don't want to hurt his feelings or make him feel bad. But it's unkind to keep someone in this ambiguity. \n\nKind is telling someone the truth. No, there is no future. No, I don't love you. While hard to hear, it is more kind because the person knows where they stand and can move on.\\*\n\nBe kind, not nice.\n\n\\*the caveat here is if you feel unsafe, do what you need to do to be safe.",
            "I'll be honest, you're sending signals that you're still together too. And your last sentence does not match the conviction and reasoning for writing this post in any way.",
            "He’s your ex for multiple good reasons. Block him on everything and stop interacting with him. \n\nYou ended things, so let them end.",
            "If he's treated you like shit he doesn't deserve your friendship, or ANY of your attention.",
            "You mean well, I get it. But it’s no longer your job to check in with him or make sure he is ok. Cut your losses and move on with your life- he will just make it more miserable and continue to cause problems. \nI’ve been there, I 100% do not recommend.",
            "I was in a very similar situation a few years ago, except I was him. I was the one who broke it off with my girlfriend of six years, and it absolutely shattered me. There was a short period of time where we hung out, lived together while she was moving out, even went to a concert together, and I couldn't not treat her like my girlfriend. I'd actually inadvertently do boyfriend things like put my hand on the small of her back as I would pass by just completely out of habit. She wasn't ever a platonic friend even though she was my best friend ever, so I didn't know how to treat her as someone who wasn't part of me. I don't know how he feels, so I can't speak for him, I can only speak anecdotally.\n\nThinking about what she must have been going through, and knowing how I acted, you have to just cut it off completely. It's not your fault he's acting that way, and he might be extremely in pain, but there's nothing else you can do. I actually wish that my ex would have shut me out 100% from the first day because it would have made things so much easier in the long run. I can see that now, but it's very difficult to have that foresight without having gone through it. Be direct. Tell him yes it's forever. Don't try to let him down gently because that ultimately ends up giving some sense of false hope prolonging both of your pain. It might break you, it might break him... but that's why they call it a break up.",
            "Haha great Edit, don't worry about it.\n\nI wish you luck in life, you'll be fine kiddo.",
            "to \"remain friends\" after a breaking up a serious relationship is next to impossible, what's more possible is to \"become friends again\" after both parties have had time to move on. If you go through breakups in the future and want to keep the person in your life, you generally have to wait a healthy amount of time.",
            "I’m someone who fully believes exes can be friends. That being said, for that to happen, you do still need to become exes. You two need space away from each other. Give it a month or three if no or limited contact. After that, grab a coffee if you want but know that you might just feel better not.",
            "Sending lots of love and healing your way🤎",
            "[New Rules](https://youtu.be/k2qgadSvNyU)",
            "You figured it out, real fast!\n\nSorry, it usually is like this ... really clean breaks are difficult.",
            "Feel free to **stop** saying \"I love you\" and **stop** going on dates with him after you break up.",
            "Men cannot handle change. They want you to stay the same forever.",
            "Whenever I've had a serious relationship successfully transition into a true friendship, it's always required a separation period of not talking. In my opinion, I would recommend at least about 6 months.  That way you both can heal properly and go through the process of recalibrating and getting used to being your own people. I've learned this because whenever me and an ex tried to be friends, it would never work until we had pushed each other to the point where we had to take time off from each other. It's hard, but just tell him that it's not the end, but you feel in order to be healthy, you both need to spend some time apart to deal with things on your own. You guys will have the chance to reconnect as friends later, but first you gotta do what needs to be done.",
            "If he ever abused you and did not self correct immediately, apologize on his knees, and go to therapy, write him a note saying he needs help, he is not ready, and goodbye. Period! Adios! Perhaps later if you have feelings for him and he agrees to go together to a therapist then perhaps reconsider. But only if he is doing the work to mature into a functioning healthy human being on his own prerogative. \n\n Ive read mens brains are not fully developed until age 27 so take that into consideration when making commitments with any of them. And those who stunt themselves with drugs and alcohol may never be fully developed. Perhaps get a stable foundation of your own and enter into a relationship from a position of strength.",
            "You can't be friends with someone that doesn't care about your perspective. He doesn't care that you broke up, because from his end what you think about him and your boundaries around him dont matter. So its up to you to assert the boundary, by not giving him an opportunity to play pretend.\n\nJust block him.",
            "Time for clear boundaries. \n\nHe’s not confused. You moved out. You said why. He figures he can just convince you that never really happened. \n\nYou’re 23; of course you suggested remaining friends. He’s 33 and clearly extremely unhealthy and unkind; he figures that’s his “in”. \n\nBut you can’t be friends with someone who doesn’t respect you. \n\nDrop contact. “It’s no longer healthy to continue to communicate. I wish you all the best”. \n\nBlock. \n\nThis takes strength. You have it.",
            "He's kinda old for you. Woman his age probably nope out faster due to this behavior.",
            "Oh honey.  If you text “I love you” then of course he’s going to act like you’re still a couple.  Stop that.  Stop acting like this breakup isnt forever.  Stop stringing him along and make it a clean break.",
            "Well in his defense you barely broke up with him",
            "I honestly blame you for this OP, you're both just taking a break as far as he's concerned. You never stay friends with an ex PERIOD. That's only for TV. It doesn't matter if the relationship ended on good or bad terms, that's a recipe for a disaster OP! NEVER. EVER. STAY. FRIENDS. WITH. AN. EX. I don't even bother dating Women that are \"friends\" with exes, like why? So you can keep him on the back burner just in case? You're not suppose be in contact with anyone you use to sleep with.",
            "Yeah this is on you lol",
            "I would recommend zero contact, forever. He won't be able to ever see you as anything but his g/f. He's always going to hold onto the hope that you'll go back to him someday, and when you start dating other guys he'll begin to get jealous and resentful. Unfortunately, you can't really remain friends with an ex when either one of you still harbors romantic feelings for the other. It's just not possible.",
            "Of course he still thinks you’re together you’re acting like it, you need to set boundaries and take some space away from each other before trying to be friends because this situation is just going to confuse both of you more.",
            "i think there's a typo in your title, I think you're the one that still acting like your together",
            "OP I see a lot of comments accusing you of not being over him, or leading him on. YOU MOVED OUT LOL and these posters are still trying to tell you that you're not serious. I don't think you should listen to any of that and this kind of attitude really pisses me off. To those posters I want to say, NOT EVERYONE IS LIKE YOU. Can you try to actually believe people when they talk? How crazy would I be if a bf broke up with me, MOVED OUT, and saw a movie with me as a friend, and I was thinking, \"oh he's seeing a movie with me, this is something that romantic partners do sometimes together, so therefore the only reasonable explanation is that HE IS LYING about wanting to break up\". These people can't help but project their own ugly territorial/jealousy-based/normie culture onto everyone. You say clearly what you mean and because it doesn't fit into their worldview and social culture, they don't believe you and invalidate you.  \n\n\nYou care about this person, which is a good thing about you. You didn't do anything wrong by saying you want to stay friends. You didn't do anything wrong by wanting to leave him in a more gentle, tapered way. Maybe he is not the kind of person who can handle that, and you need to cut him off cold-turkey. But you didn't do anything wrong for trying.",
            "NTA stop leading him on. Cut all ties",
            "He's trying to negate the breakup. He's an alcoholic, you broke up with him and moved out, and he's countering with planning a date and constant texting of 'babe' and 'I love you'. The date this weekend will end with his attempt to have sex and suggest you move back in. As Admiral Ackbar would say, \"It's a trap!\" Please cancel the date and think about not talking for a couple of months to get him out of your system.",
            "My ex is doing this to me too",
            "Another age gap relationship on this subreddit. How shocking",
            "Yeah, so you have all of the control here.   \nBlock him.",
            "you need some boundaries",
            "Rip the band-aid off and end contact.  He isn't getting it.",
            "You’re supposed to cut this kind of toxic person out of your life. Staying friends just gives him hope.",
            "You need to break it clean. Your \"trying to be nice about it\" is just sending him mixed signals and all he's hearing is he has a chance or is still with you.  Stop stringing him along, this is terrible.",
            "Stop telling you love him when you want to end things. It just gives him false hope.",
            "Stand firm in your decision. He has no reason to believe you. Break contact. Block him & move on.",
            "You are leaving him hope that you will get back together. Unless you actually want to get back together you need to stop talking to him. You don't have to ghost him, you can call him or text him and say\n\n\"I thought we could stay friends but I'm now starting to see that this is a bad idea. It would be best for the both of us if we just make a clean break so we can both move on.\n\nI wish you the best in you life and I hope you find happiness. \n\nGoodbye\"\n\nThen block him and any mutual friends who might spy for him and begin the grieving process for your relationship.",
            "You’re gonna get sucked back in. Cut the cord. Be done. You can love him and set him free. Start thinking about YOUR future!",
            "The kindest thing you could do for him is tell him you need space right now and not to contact you until he hears from you. Then go fully no contact with him for at least 6 months. Do not respond if he contacts you. The whole \"let's be friends\" thing won't work until he's over you; he'll just be hoping you'll change your mind the whole time.\n\nI know it feels like you're being mean to cut him off, but if you don't, you're just prolonging the process of him getting over you. That's way more cruel than a clean break.",
            "Eugh is he my ex? This is all to familiar. You need to stop talking to him. You want to be friends but it’s leaving the door open for this behavior. Block him and move on with your life.",
            "That’s your mistake is lingering even though you said “done”. He’s taking that false hope and running with it. When you cut off from someone whose not taking it seriously you need to just cold cut it off. No “friends” or “checking in”. \n\nUnless you’re hoping he’ll change, which he won’t because he hasn’t done it in the time you were together. He’s not gonna change at all. Maybe you like that he still wants you, but in reality he’s just playing and never plans to do a thing to fix his problem, you’re not gonna make him change either. \n\nSo what’s it gonna be? Stay or not stay? Whichever it is needs to be white or black, not in between.",
            ">I told him that bc I love him and care about him I’d like to remain friends and check in on him. I even agreed to go to a movie this weekend that we were originally planning on seeing.\n\nAll relationships need a no-contact period after a break-up, even the ones you want to hold onto as friends. It's the only way to break the pattern. My ex and I were NC for about two years before we could be friends again. In that time we tried to be friends a couple of times, but found it was too soon.\n\nDon't check in with him, don't go to the movies. He is not your responsibility. Set yourselves a decently long NC period (at least a year) before you even think about rebuilding a platonic friendship.",
            "Are you sure you’re not together? From your post I would probably act like that too.",
            "You probably need to tell him that it is forever and block him.",
            "You can’t break up and be friends immediately. I stayed very good friends with two of my exes. One stood up in my wedding, and one I will always worry about. But in both cases before we were able to have a genuine friendship we had to go no contact for a while. It was hard, the second time I didn’t want to do it and could barely control my emotions, but he kept texting me saying “Eve, we said we wouldn’t do this. Please take some time.” Eventually he stopped texting me back. Afterwards we started chatting again when he wished me happy birthday and we were both in a better place. \n\nYou can’t go from a relationship straight to friends, you both need to take some time. I’d recommend 6 months (about the time I had with both my exes).",
            "Yeah echoing what others have said here and it’s not only him that’s acting like you’re still together. You are as well. I think you need a clean break from him and perhaps even  giving time with no contact will make it possible for you both to be friends in the future. \n\nYou’re still sacrificing your boundaries for him. This isn’t good for you.",
            "You have to draw some lines.\n\n'I still care about you, but we are broken up and  I need you to stop calling me babe and saying ILY.' and you need to stop saying it back.\n\nYou can try going to a movie with him, or texting sometimes, but if he treated you badly, you don't have to coddle his feelings here. He survived without you before you were in his life, and he can do it again.\n\nYou need to redirect your social energy elsewhere. And so does he. You don't have to text back right away. You don't have to be close friends. It will only drag out the pain of healing and mourning the relationship.\n\nCall it forever. Set that expectation. It is kinder to do that and change for the better in future if he pulls himself together, than to have him hold hope and then have to experience breakup all over again WHEN you start seeing someone else.",
            "Don’t feed his boundary-breaking. Let him cool down a bit, and then maybe if he’s ready to reassess the situation you guys can be friends. But for now, definitely leave him be.",
            "Break it to him honestly. He’s not going to get it if you don’t.",
            "You can't be friends with him right now.  You have to let him grieve and get over it, and you have to get over him as well.\n\nAs it is you are giving him mixed signals, telling him you love him and going out on dates with him.  You are giving him hope that this is temporary and you'll move back in any day.  \n\nTell him you need some distance and not to call you.   Give yourself and him some time to stop loving each other.  I have a feeling once you've stopped loving him and it's safe to actually be around him again, you probably won't want to be friends.",
            "He doesn’t take you seriously. With you still being contact with him he is still gonna think you are involved with him . Stop texting him until he gets the hint that he has messed up . Until he can stop doing what he’s doing to you you guys have nothing to talk about . Don’t go to the movies instead plan something with friends or stay in and enjoy your space. ❤️",
            "BLOCK! Cut him off completely until both of you have completely moved on or never talk to each other again",
            "You gotta be clear cut. Don't tell him you love him back, say \"yes\" when he asks if it is forever. You are both acting like you are still together. Take a break from seeing each other for a few months",
            "You are young so the mistakes are probably due to that and the fact that you are probably a nice person and want to end this nicely. \n\nStop it! No movies, no I love you texts. Just please stop and step away. He is well in his 30’s and does not need you to check in on him.",
            "OP, you are literally the last person on the planet to console him during the breakup. It won’t work. No hanging around. No movies. No calls. No texts. No contact. It’s a breakup . It’s supposed to hurt. You need distance from each other to move on",
            "You have to sit him down and have a serious detailed conversation about why he cant call you babe or tell you ‘I love you’ anymore. He will try to argue in the beginning but dont stop. Calm him down and continue the convo. Tell him that you still care about him but its best for a break (up) for your and his sake. I tried keeping contact with my ex and i never truly moved on until we cut contact. \n\nIf you dont fully convince him that its over, he’ll think you ‘cheated’ on him if you find someone else now, even though it…isnt, you know? \n\nSo its best you explain this to him, he’ll understand but he’ll need some time.",
            "You need some space away from him. I get that you care about him, and maybe you'd like to be friends someday, but this is not working. You don't want to be with him - not just because of romantic incompatibility, but because he has a drinking problem and treats you badly. He's not going to treat you better as a friend than he did as a girlfriend. \n\nStep one, tell him that you changed your mind and you don't want to see a movie with him. His response to this will inform a lot of what you do next. He may try to guilt you into going, he may throw a huge temper tantrum and call you names, he may claim that you \"promised.\" Stay firm. \"Hey I need to cancel going to (movie) this weekend.\" Don't go to the movie, or if you do go, go to a different theater and showtime than you were originally planning. Don't see him in person. \n\nStep two, tell him that you need to end the relationship and take some distance from him. \"I know that I originally said that we would stay friends, but that's not working for me. I need us to go no-contact, and I'm asking you to respect that. Please don't contact me again unless I reach out to you first.\" \n\nHe will not like this. Once you have said \"please don't contact me again\" you need to stand firm and not respond to any of his attempts to contact you. Block him if you have to. \n\nGive yourself six months, minimum, of being completely away from his influence. Do not tell him about the six months. That way, you're not putting him on hold or making him wait, you're just taking space for yourself. In six months, check in with yourself. Do you miss him? Do you want to start talking to him again? If you don't feel an enthusiastic \"yes!\" about being his friend, just...don't.",
            "> Advice?\n\nIf you want him to understand you're broken up, then: Stop remaining friends with him and going on dates with him and telling him you love him and that maybe there's a chance when he asks if you can get back together.\n\nJesus woman.",
            "You’re hurting him further by giving him false hope. this is on you. if you’re done, be done. You’re delaying both of your healing processes.",
            "Yep. 30 days minimum so you can both get your footing living in a world without each other. As humans, we are a slave to the chemical rush we receive from routine and love. Him texting you and including loving phrases is his way of easing into the loss or perhaps to avoid the reality of it entirely, grasping or holding on to a world he felt was accepting of him as he was. It’s hard to learn that while love can be unconditional attachment and romance are not. \n\nShow him some grace through mercy by going no contact. Let him know exactly why you are doing it. That way there is no mistaking that the relationship is over but your love for him continues. That little bit of reassurance as you both go your separate ways is in a way a beautiful thing. It’s just hard for some people to see in the moment.",
            "You need to have an actual boundary. Not a soft “I’ll still hang out with you sometimes but we are not together unless I feel like having sex or being intimate” bullshit boundary. It’s “you can choose alcohol or me.”",
            "You are hurting hjm more by giving him false hope. Rip the band-aid. You will both be happier in the long run.",
            "He's probably just thinking \"she is just mad at me, if she was proper mad she wouldn't be going to the movies this weekend\".",
            "There’s no easy way of breaking up with someone. In my humble experience, cutting him off clean and not pandering to him is the best thing you can do to avoid hurting him more in the long run. It will also be better for you, you can move on.\n\nYou can’t be what he wants you to be anymore, so do him a favour and stop pretending you might be.",
            "You are allowing him to act like this by continuing to see him, continuing to tell him you love him, and being vague about your breakup intent.",
            "You need to cut off the relationship for a few months. She will never tell you the truth if she’s seeing another guy. Dont be that gullible. Don’t text or call her. Go to the gym, go fishing, get a dog, but you will never fully get over her if your still communicating with her. 6 months down the road you can then re-establish communications if you desire but at this stage, you should be fully moved on. You need to get out there and start testing the waters with other girls. Don’t willow in your misery by yourself. It’s tough, but you have to not communicate with her.",
            "You need to stop enabling this situation.  Don't hang out  too much or keep in touch as much.  Break free some.  Unless of course, You like this ongoing \"Future Plan\" he has still in mind.  Back off a bit.",
            "My advice is to grow a spine and cut him off. I don't say this to be rude, but because you need a wake up call. He's an abusive alcoholic. You cannot keep the door cracked open for people who hurt you, let alone people who *abuse* you. They will push and push until they can get back in and *keep* hurting you.\n\nDo Not go to the movies with him.\n\nDo Not keep texting/talking to him\n\nDo Not allow him or yourself to believe there is a future for the two of you.\n\nLet the last thing you say to him be, \"I cannot and do not want to be your friend. There is no future for us.\" and then block him. Block his phone number. Block his social media accounts. Block him out of your thoughts and out of your life.",
            "I'm pro \"Scorched Earth\" when it comes to exes and I think this is one of the cases where you should consider it too. This guy sounds like a total dud and I'm sorry you spent your warly 20s on him. That being said..... stop coddling him. He's an adult man with shitty behavior. Move on and move up. It'll take time but you're not helping yourself at all here.",
            "You can’t be close immediately after you have to adjust to the relationship change if you continue talking and hanging out nothing will feel different. You need to break up then later you can try friendship",
            "Dude every one of your problems could be solve by just having a backbone, and saying NO.",
            "Advice just be blunt and stop worrying about hurting him if you don't tell him the truth no matter how painful it is you'll allow the narrative in his head of him believing there's a chance and he wonr leave you alone just tell him to move on that you broke you broke up with him already and would appreciate that he leaves you alone",
            "You need to stop the wishy washy nonsense here. This person isn’t good for you, you’ve decided that. Why are you going back on what’s best for you, for a 33 year old who can’t get his shit together. Do not stay friends with this person, I watched my friend go through this same thing and it took her literal YEARS to get rid of her loser ex. Don’t be sucked in by the manipulative bs and put your foot down. Edit: no your not listening!!! This man is shaping up to be someone who may do something abusive in the future, if he already treats you badly, HE is the problem here, YOU need to get away. Your only mistake here was not being firm, other then that he’s the one who bombed this relationship, do NOT take ownership that you don’t need to take.",
            "You broke up with him. Act like it for fucks sake.\n\nStep 1: Break Up\nStep 2: Don't go on dates with him\nStep 3: Don't say I love you.",
            "Stop responding.  ‘We’re broken up, I wish you nothing but the best, but it’s not going to work for me.’  Then you block.",
            "How long ya been together and why couldn’t you find somebody your own age range and why couldn’t he do the same ? This was ur first relationship and he’s way older than you ? 🤔",
            "You can't just go to being friends, that's stupid. Cut him off. He's way too old for you, and I say that as a woman who dated older men in my late teens and early 20's.",
            "You love him but not romantically?",
            "Miss you gotta give him the high hat",
            "Cut him off. He’s taking advantage of you. Am don’t talk to him just block him on everything",
            "OP, this is not an accident. Your actions and words is what led to his response. \n\nCut him off. Stop talking to him, seeing him, or texting him.",
            "You are not helping him move on, or yourself by refusing to rip the band-aid off cleanly. \n\nMake a clean break and go no contact. Let him work on himself. Let you figure out who you are apart from him. In six months, a year, two years, if he has gone to counseling, worked on his issues, quit drinking, been attending meetings, and you have the necessary emotional strength, then maybe you can try to become friends. \n\nIf you make ambiguous statements then you are leading him on and extending the amount of time you will need to heal.\n\nYou're not wrong or a bad guy here. You're trying to do the right thing and not hurt him more by telling white lies.\n\nLike after a first date and you don't want a second, you don't insult them but you say you're super busy at work and now's not a good time. But he's not receptive to those white lies. Willfully so. Because he doesn't want the break up and he thinks if he just ignores it he can undo it. Don't let him. You said he treated you like shit. This is another example of him treating you like shit \n\nGive yourself the space to heal.\n\nGood luck!!!",
            "Try “I’ve thought things over and I think it’s best right now if we are no contact or very low contact.  It will help both of us move on.   I refuse to be with a non sober alcoholic.  I’m sorry if I gave you hope but it’s over.  You need to work on yourself and you aren’t going to do that if I’m around.  So no movie and I’ll stop by with a friend to pick up my stuff. “",
            "Not trying to be the bad man here. But date someone your own age, it’ll definitely change your perspective",
            "Usually you just stop talking to your ex completely. No contact is best and please learn this. Or else mistakes happen.",
            "Do not say i love you. You broke up with him. You aren't together. You left because you needed to.  He drinks and treats you bad.  That is not a boyfriend.",
            ">This is my first breakup and first relationship, I have no idea what I’m doing.\n\nFor future reference it's probably not a great idea to date someone a decade older than you if you don't have much relationship experience.",
            "A drinker, who is way older than you and treats you like crap.....\n\nCould the reason you are so wishy-washy in your communications be because he's abusive and dangerous? I've acted the way you do in the past, and it's because I was afraid for my safety if I full on flat out ended it. Sometimes men don't take rejection well, and it sounds like he has some unhealthy coping mechanisms anyway. \n\nSo while I agree with everyone else here, please know that the most dangerous time for an abuse victim is after they leave. Make sure you are treating your safety as your #1 priority, even if it feels over the top. It isn't.",
            "> This is my first breakup and first relationship, I have no idea what I’m doing.\n\nI get it, a lot of us get it. We’ve been there. You hate the fact you’re hurting him and wanted to do something that would make it hurt less. Your actions are *exactly* what many of us have done in the past so we know why it won’t work.\n\nI want you to know it’s very normal to miss him a lot over the next few months, even doubt you made the right decision to end things, especially when you’re lonely or think about the good times. If thoughts about contacting him start to creep back in please make a list of the bad stuff instead of picking up the phone. Keep adding to the list as you remember things he did or said that upset you, and read it every time you get a strong urge to call him. At some point you’ll know it’s OK to trash the list because you don’t need it.",
            "Dam that age gap I know love is blind but shit you could’ve got ur self a younger guy around ur age",
            "You need to stop hanging out with him it's that simple. He won't just be your friend and imagine how he's going to be when you start dating. Seen this happen before multiple times. \nStaying friends can work but you both need to be on the same page and want the same thing, it will not work if he wants you but can't have you but you're always hanging out and talking. \nUnfortunately you need to let him go fully.",
            "Clean break. \nYou can't continue to text him and say I love you or go to movies together. Of course he thinks you're still his girlfriend!\n\nIf you want to break up? Then break up. Wipe him from all social media and do not text him or go places with him.",
            "Yeah nah you gotta sever ties.",
            "I understand your need to be nice to him and try to spare his feelings, so don't feel too bad about it, but like others have said (and seeing your edit you already took the advice as well) it does no good in this situation. Ripping the band-aid and all that. \n\nThe thing I've noticed with exes is that even though they've played a big role in your life at one point, many don't even really want to be friends if there's not a chance to reel you back in – and that's okay, staying friends is a nice thought but it just doesn't always work. Especially if they're not the kind of people you'd really be friends with without that past connection. He treated you like shit when you were together, so it's worth considering whether *you* want someone like that in your life as a friend, or do you just feel obligated to keep taking care of him because he acts like he can't do it himself.",
            "You can’t be friends with such a recent ex.",
            "Find new friends. You don’t need to be friends with an ex",
            "When things like this happen this is when you need to cut things off with ex.\n\nI totally agree that you don't have to be hostile and don't have to block the ex but when they're doing stuff like this not respecting the fact that you're broken up that's when you need to deal with it",
            "You need to stop talking to him for a while until he understands fully the breakup and your boundaries",
            "I’m friends with my first bf from high school that I dated for two years. We’re both 30 now, and it took a lot of time and space to be able to get to a friend place.\n\nYou need to completely end it, guillotine style. Tell him you need to completely go no contact for awhile. He needs to face shit on his own. His life is no longer your responsibility. If you’re seriously worried for his life is you leave, you can reach out to family or friends of his to let them know, or call 911, but it’s not on you anymore.",
            "Stick to it.  Own it. Or don't bother.\n\nIt can't be even at all wishy washy.  He will hear what he wants to.",
            "You could change your username to something he doesn’t know, if he’s on Reddit. These things keep people thinking they will get back together. I know because I’ve made a username for someone and they keep using it. I don’t know why after breaking up I feel they would change it but it’s been almost more time after we’ve split than we’ve been together and it’s still being used by them. Weird.",
            "Time to block him everywhere from his response",
            "Weird and disgusting that your first relationship was with a guy 10 years older than you, thank you for listening to the advices and also be careful of groomers altho you're already an adult.",
            "Clear is kind.\n\nYou are sending very mixed messages.  You want to be kind, but if you care for this person take a total break From them for at least 2 weeks.  Keep any communication after the two weeks within clear boundaries.  “I hope you do well. “. Avoid use of affectionate names, or I love you.  Instead say have a great day.  \n\nClear is kind.  The more clear, the kinder.",
            "You might think you’re replying like you are not to hurt him, but your actions and words at the moment, while not hurting right now, it will be much worse for him in the long run. \n\nHe got hurt. You tried softening the blow, thus extending the hurt over a much longer period of time. He’s living on hope right now. He thinks it’s still you. In his mind this is just temporary, because that is what you’ve told him. So he’s still hurting, and he’ll be hurt much worse down the line when he finally understands what you did mean. \n\nIf you wish to remain friends the only solution is to really break it off now. Be clear that you both need a cool off period, and if you both wish to remain friends in x months time, you can talk about that then.\n\nGood luck. Breaking up sucks. Realizing that you need to hurt someone deeply to actually save them a lot of hurt and grief sometimes even more so.",
            "Girlfriend you're doing it too",
            "That age gap is very troubling. I can’t believe you were with this guy for three years. I would just go no contact and never speak to this guy again. Maybe try dating someone your age. You need to figure out what you like and dislike.",
            "Lol that's not him being understanding, that's him being a passive agressive little baby, and that's an insult to babies? You're better off without him",
            "Great job taking people's advice,  it's not easy.",
            "The advice of no contact is good, but you also need to express, in clear terms, that there is no future relationship.\n\n\"As I said the other night, I can't and won't remain in this relationship. I don't want to hurt you, because there is a part of me that cares for you. But you also need to understand there is no \"us\". There is \"you\". There is \"me\". There is no \"us\"; not now and not in the future. There may come a time when we can be friends, but for the foreseeable future, I will not call, text or otherwise try to contact you and I want and expect for you to not call, text or otherwise try to contact me.\"\n\nOr something similar in your own words that conveys that this is not temporary and sets a firm boundary of no communications.",
            "You can’t be “friends” a week after seeing movies etc.\n\nYou need to create a space between you two and go no contact for a while.",
            "Lady. You seemed to be groomed. Being friends with your groomer? Bad idea.",
            "He might still b Jan love with you",
            "Been in a similar situation. Hate to say it, but if you've made your boundaries clear and they're still being pushed, you need to force distance and space with that person. that is a person that does not respect your needs.",
            "Seems like he’s completely disrespecting your boundaries and taking advantage of you because he knows you’re relatively inexperienced. The age gap is telling. The fact that he literally ignored that you had broken up with him and then tried to guilt you into staying even after things were over is also telling. As is the way he fully hung up the phone on you as you were trying to set boundaries. He’s basically flat out saying that he doesn’t care what you want. I’m sorry he’s like this, OP. Stay away, because as long as you’re giving him the time of day, he’s never going to stop trying to manipulate you.",
            "\\> I told him that bc I love him and care about him I’d like to remain friends and check in on him. \n\nYeah, because of this. He probably doesn't realise you intended an actual breakup.",
            "Don’t be hard on yourself, no matter what people say,\nBreak ups are very hard at anytime and your young and trying to navigate through it for the first time,it’s going to be difficult, try not think about the what if’s, you’ve given him chances and it hasn’t mattered to him, put yourself first follow your gut, it does help to cut contact completely off especially at first for your own peace and to be able to think straight, (they don’t change) but it does get easier and you won’t feel like this forever, your young so enjoy your life before settling down, you deserve way better and to be treated well, you matter put yourself first & stay strong",
            "If you want to have any form of future relationship, you at least need a BIT of space. Texting again only a mere few days later isn't helping anyone, and you responding is giving him hope. Which is unfair on you both.\n\nTell him you're blocking his number for now as you need time apart, and you'll check up on him in a few months to see how he is doing. Leave it at that. No more \"maybe in future, let's meet up and do this and that, I still love you in this way.\" It's all confusing and although it's painful for you, it's also not helping him one bit. If he gets in touch any other way, ignore him and block him on that too.\n\n2-3 months no contact isn't a long time, and will do you both a world of good.",
            "OOF. Do NOT befriend that man. The age gap is frightening to say the least and it was a huge power imbalance.",
            "my last date was horrible so much because he was cheating on me that is why we are not together caught him with my friend having an secret affair and he even got pregnant for her and ever since i knows all about it i made up my mind and vow not to be with him and we both divorced after one son together, Regarding what I am seeking is a man as laid out in Proverbs 31. A man who is strong(but not overbearing), loyal, respectful, kind and sweet. That carry himself like the king he is in all situations",
            "I need a serious relationship that will lead to marriage",
            "U are not at fault here. He has 10 years on you, thats a major red flag! U broke up with him but he still wants to be with you, he has to undeserving that!",
            "Forget him, I will provide you care love, marriage life, and babies ❤️. So, come in my life",
            "Just wondering... Because that story may or might be the same for me but in the opposite. There's any possibility to getting back? Like, I know there's nothing impossible and things like this are hard but at least the minimum possibility? Any chance? Whatever.",
            "I’m late to the party, but as someone who has at least a bit of experience being on the receiving end of the breakups (woe is me or something), o think you’re struggling to fully understand where his mind may be at the moment. \n\nEvery slight or subtle sentence or phrase the he can warp in his mind into believing this will be temporary, his mind is probably going to run with. Assuming he’s hurting and not wanting the breakup that you’re putting forth, he’s unfortunately going to read too deeply into the potentially “subtle” meanings of everything you say, even if he’s banking on your meanings being subconscious (and most likely incorrect).\n\nDon’t beat yourself up about it. There’s no perfect method or playbook to consult for breaking up with the person you were once closest to. There’s always at least slight differences in circumstances or nuances that you have to deal with and improvise as they occur. I will suggest, however, you try your best to put yourself in his position and (assuming you know him well enough) try and anticipate the path and connecting of dots his reeling and potentially deluded mind may take/make before you say anything else to him. \n\nBreakups suck, but good for you for pulling the trigger and hopefully being honest about things with him sooner rather than later. The longer you wait, the harder it always is for both parties. You got this.",
            "You need to cut loose for a while i think",
            "It’s not your job to protect his feelings. Being nice doesn’t have to mean you are his doormat. I had to learn that the hard way. My advice cut him off for a while or forever til he understands.",
            "They are devastated reading this…. I wish I never met I am so crushed this morning"
        ]
    },
    {
        "post_id": "586nc8",
        "author": "pupurroni",
        "title": "My [27F] mother [56F] wants me to take care of my grandma, who just had surgery. I'm recovering from my own surgery. We got into an argument and she sent an extremely hurtful text.",
        "url": "https://www.reddit.com/r/relationships/comments/586nc8/my_27f_mother_56f_wants_me_to_take_care_of_my/",
        "score": 2356,
        "num_comments": 161,
        "created_utc": 1476827812.0,
        "selftext": "**NOTE: My mother and I usually get along well. However, she is probably the most passive-aggression person I've ever known and has a history of throwing me under the bus if it means helping someone else. She isn't a bad person, she's just not considerate of me sometimes. For example, my laptop which I use for work (graphic design) broke and I couldn't afford another one, and she knew that, and she knew I was struggling to save up for another; my uncle died and she took his new $1800 Macbook and gave it away to someone who just needed something basic for Facebook and job applications. Mom knows about laptops so it wasn't like she thought it was cheap.**\n\n\nI had a mastectomy about two weeks ago (didn't actually have cancer, so chemo etc. isn't a factor in this). I'm still recovering and need to be taking it easy. Right now I'm trying to keep swelling at bay as I don't want yet another surgery and potential disfigurement, so I need to stay sedentary. I do go out for a couple of hours here and there, but I'm careful.\n\nMy grandma (66), who is my dad's mom and lives an hour away, had hand surgery today (repairing a trigger finger). My mother called me after and told me that my grandma needs help and needs someone to take care of her and basically do everything for her. My grandma is very independent, no signs of dementia or anything, and is an active person, so this was surprising to me and kind of came out of the blue. If I'd known recovery would be a big deal, I would've put surgery off until after she had recovered, but she decided to have it with almost no advance warning, and when I researched it to see if I did need to reschedule my surgery, it seemed like hers was pretty minor.\n\nThe problem is, Mom told me that she told my grandma I could take care of her (Mom and Dad work full-time, and I'm not working right now so I guess that was her logic, but I'm not working BECAUSE I JUST HAD SURGERY). I asked her why she would put me in that position and she said she had no idea what I was talking about. I said she knows I'm recovering from my own surgery and she said I \"seemed fine\"... I said I was, as long as I stayed home and kept ice on my chest and took it easy, and that she should've checked with me first. I pulled a childish move when she started berating me and hung up on her.\n\nShe texted me almost immediately and said, word for word: \"I guess Gram knows you better than I do! Maybe she thought you would \"feel pressured\" so didn't include you [in the group text] when asking for help. I didn't expect that at all!\"\n\nNeedless to say I'm crushed. I would LOVE to take care of her, but I can't. Now I feel like everyone thinks I'm a selfish monster and am depressed to the point of feeling sick. I wrote back and told her not to talk to me right now, and I know she's going to call me when she gets out of work but I don't know what to say. :(\n  \n  ---   \n  **tl;dr**: I had a mastectomy two weeks ago and my grandma had a trigger finger repaired today. Mom told Gram I would take care of her. But I can't. I'm recovering from my own surgery. Mom sent a really mean text that crushed me and I don't know how to handle this.\n\n ---\n\nUPDATE!!!!!\n\nI just got off the phone with Gram!\n\nShe burst into laughter when I told her all the things Mom had said. Apparently Mom had been planning to \"surprise\" her with a $200 bidet because she was convinced Gram would have trouble cleaning herself. Gram said she found out about it accidentally and has been making fun of my mother since.\n\nShe said she doesn't need anything outside of opening fresh water bottles (she refuses to drink anything but Poland Springs) and said her neighbor already pre-loosened a bunch of them. Mom had talked to Gram's doctor and went worst-case-scenario, basically. Which is... typical, so I don't know why I didn't see that coming. Gram specifically said \"YOU KNOW YOUR MOTHER. You know what she's like. Don't let her work you up. Jesus Christ, if I was going to have that much trouble I would've stayed in the goddamn hospital.\"\n\nShe also said she didn't include me in the group text because I'm not a worrier and wouldn't be losing my shit wondering if she made it through surgery. She said she just updated Mom and my aunt (her daughter) and said she was fine, and that Mom was the one that went off about how she needed help. She also said \"for crying out loud, you just had surgery, you need to take care of yourself\" so she wasn't expecting me to help at all.\n\nGram said she'd love if we could talk more over the next few days since she'll be a little bored and asked if we could play Scrabble Online. All's good.\n\nNow Gram and I have an inside joke about \"surprise bidets\" and I'm waiting for my mother to call in about an hour. I've gotten some awesome advice and really appreciate it; I have an idea of what to say now. (I don't want to ignore the call as that'll cause more problems. I KNOW she's going to call me, it's not a question lol)\n",
        "permalink": "/r/relationships/comments/586nc8/my_27f_mother_56f_wants_me_to_take_care_of_my/",
        "comments": [
            "> Needless to say I'm crushed. I would LOVE to take care of her, but I can't. Now I feel like everyone thinks I'm a selfish monster and am depressed to the point of feeling sick. \n\nThat's what your mom wants you to feel.\n\nIt's possible your gram didn't include you in the text because she knew about your surgery and knew you would be in no condition to help her.\n\nIt's also possible - and I think more likely - that *there was no text from Gram*. Gram might not even need help at all. ",
            "> \"I guess Gram knows you better than I do! Maybe she thought you would \"feel pressured\" so didn't include you [in the group text] when asking for help. I didn't expect that at all!\"\n\n\"Yes, Gram recognizes the importance of my own recovery, so she asked people who were PHYSICALLY CAPABLE.\"",
            "The only one being childish here is your mom.  Try to forget what she said, as it is basically just her throwing a tantrum like a toddler.   Don't even dignify it with a response.  \n\nSend well wishes to your Grandma directly, and try to keep in touch so that you know your mom isn't whispering BS into her ear as well.  ",
            "[deleted]",
            "> She isn't a bad person\n\n>has a history of throwing me under the bus\n\n>she's just not considerate of me\n\nShe sure sounds like a bad person. You are recovering from surgery and she is treating you like this... and it's apparently a pattern of behavior for her to be completely shitty to you. No one deserves to be treated the way your mother is treating you. ",
            "Sounds like your mum sees you as an extension of herself and wants to reap thanks and praise for herself by throwing you under the bus.\n\nThat sucks, sorry. Try telling her that you're really shocked she could be so inconsiderate and selfish but you'll forgive her this time. It probably won't be terribly effective but it might be fun to steal her script. Do a broken record thing, whatever she says on this topic just turn it back to how she was awful and really hurt you but you're willing to let it go.\n\nAnd contact your gran and make sure she's ok, if she's a reasonable person you'll probably feel better about things after hearing from her. You could send an apology to her that you can't do it, and mention that you think your mom forgot about your mastectomy when she volunteered you! \n\nIf you want to detonate a passive aggressive nuclear weapon, send that same apology to all the people who were in the group text. Your mum goes from the woman who saved the day to the woman who forgot about her daughter's major surgery. Might put her off playing these games with you in future.",
            "You tell her to fuck off.  You mom is waaay out of line here.  ",
            "> I pulled a childish move when she started berating me and hung up on her.\n\nThere's nothing childish about refusing to let yourself be abused. \n\nThis is absurd. Nobody who knows why you're off work would blame you for being unable to take care of someone else who's recovering from surgery. If she needs care so badly, your mother can take some time off to do it.",
            "You need to talk to your Grandma directly here. If I got a finger surgery, I wouldn't expect someone who has a mastectomy to come a help me. You Grandma probably doesn't expect you to help her (hence why you were excluded from the group text). Just call your Grandma and touch base so you know that you're mom's not spreading lies about you and then focous on recovery. ",
            "A trigger finger release isn't really a big surgery. I mean the other 4 fingers are still functional....what kind of help does she need? A mastectomy on the other hand can be pretty painful.",
            "> \"I guess Gram knows you better than I do! Maybe she thought you would \"feel pressured\" so didn't include you [in the group text] when asking for help. I didn't expect that at all!\"\n\nThat's because your gran isn't a self-centered asshole like your mum is. Your gran knew that you would sacrifice yourself to help her if you could, but she doesn't want you to. That's why you weren't included in the assistance request. \n\nIf you want to help your grandmother and yourself, just give her a call during your recoveries to check in mentally and see how you're each going. I'm sure giving emotional support to each other is doable, even just so your gran has a chance to vent over whoever else is taking care of her.\n\n> Now I feel like everyone thinks I'm a selfish monster and am depressed to the point of feeling sick.\n\nOnly your mother thinks this, everyone else is clever enough to know that 2 x sick people taking care of each other does not equal one healthy person.",
            "\"Maybe she didn't include me in the group text because she's a considerate human who gives a shit that I just had surgery. Pity I can't say the same about my nasty mother, who, as far as I know, has done nothing to help me except berate me, and hey, doesn't plan on taking care of Gram, either!\"",
            "Call your Gram.  Tell her that *there must be a big misunderstanding because apparently your mother volunteered your assistance without checking with you and that you would normally love to help out, but can't right now because you're recovering from your surgery.  Ask how she is doing and tell her how badly you feel because your mother told you she can't do any basic household tasks without help.*",
            "I am so sorry. I know she's got you brainwashed into thinking she's \"not that bad\" but your mom is really awful. I strongly recommend you hop over to /r/raisedbynarcissists and see if what you read there strikes a too-familiar chord. \n\nTo reiterate what others have said - it was not at all childish to hang up on your mother rather than continue to be abused by her. I'm proud of you for taking that step toward standing up for yourself. I know how tough it is. Now you just have to keep it up. \n\nI don't think you're ready to hear this yet but in case I'm wrong - you may need to consider going low- or no-contact with your mother. She sounds toxic and abusive. I'll bet you have way more stories than you shared here which would back that up. ",
            "Your mom does kind of sound like a bad person. At the very least she is objectively mean and selfish. ",
            "Hey dude don't beat yourself up. Even if your mom is cool most of the time, that wasnt, you know it. Whatever her intentions where, she completely disregarded your health to volunteer you for something you can't do. Your mom fucked up, not you.",
            "Fuck that. Send out your own group text to grandma saying, hey gram, mom told me how upset you are that I can't help you since I'm still recovering from the mastectomy two weeks ago. Please call me so we can talk! \n\nThen take no calls from your mother. None.",
            ">I pulled a childish move when she started berating me and hung up on her.\n\nThat was very adult of you. Well done. \n\n>I know she's going to call me when she gets out of work but I don't know what to say. :(\n\nYou're recovering from surgery. My advice is that you turn your phone off as you don't need the stress. \n\nOnce you're better, I suggest when you next talk to your mum you request she apologise for her treatment of you. If she berates you or tries guilt-tripping again, hang up (or leave). And repeat.",
            "Oh fuck her sideways. You do you. ",
            "Your mother is manipulative and her reaction here is totally inappropriate. But you already knew that. \n\nSomething to think about for the future: in this kind of situation, always remove the middleman. Your mom is the middleman between you and grandma. If you could go back and do it again, you would be best served by not discussing this at all with your mom and instead calling grandma directly. I'm not saying that you have to hang up on your mom. I'm saying that you should listen to her and then when she starts pressuring you to commit to something, you tell her you're going to call grandma. You can divert the conversation by expressing your feelings instead of agreeing to take action. For example,\n\nMom: So can you help grandma? She needs you!\n\nYou: Oh my goodness! This is really serious! I'm so worried about her. \n\nMom: So you'll go stay with her?\n\nYou: Oh dear! Poor grandma. I'm so worried about her. I better let you go so I can call grandma and talk with her. I'll update you later. Bye!\n\nThen you call your grandma and find out whether she even needs help, explain your situation, etc. Once you know grandma is fine with your choice, it doesn't matter what rude things your mom says. ",
            "[removed]",
            "I can't remember the name for it but your mother is one of....those people. The people who love to get attention and kudos by offering everyone the world on someone else's dime. And when you don't play along with her \"generosity\" she, as you say, throws you under the bus. Not because you are actually doing anything  A couple percent increase in mortgage rates and the whole house of cards crumbles, but you're making her look bad. And not thinking of you with the computer illustrates that she prefers to use your dime. I bet if she'd been generous to you, your conflict would be more of the 'what could I have done differently to be there for gram'. But she's not. She's generous with you.\n\nSo, use this as the jump off point to change the dynamic. \n\nCall your mother when you are ready and apologize for your outburst, and tell her you are going to use this opportunity to get to this fixed. Tell her that she is never to volunteer your service to anyone for any reason without your consent ever again. If she thinks it's important she can bring you her ask and you can decide, but if she volunteers you again you will be forced to tell the giftee you've had to have a talk with mother about volunteering your time or whatever without asking, so you're sorry, but it will not be possible for you to do whatever it was she promised them. Let her know you love her and appreciate that she likes to be a loving and generous person, and that you'll do what you can for gran, but you will throw her under the bus if she pulls that stunt again.\n\nThis is a her problem, make it her problem. \n\nAnd good luck. It took my mother twice. She was Not Happy. ",
            "\"what a thing to say,\"\n\nreply",
            "Oh my goodness, no NORMAL person would EVER think that you were a selfish monster. For heaven's sake, you just had surgery! Your mother is being insanely manipulative. Why doesn't she take care of your grandmother? Doesn't that make her selfish, too?\n\nDon't be crushed, be mad. Your mother sounds really manipulative and possibly narcissistic. Maybe consider checking out /r/raisedbynarcissists  to see if anything relates to you. ",
            "OR your grandma knew you just had major surgery and (unlike your mom) knew you wouldn't be able to help.",
            "[deleted]",
            "OMFG your post just gave me serious PTSD flashbacks to conversations I've had with my own mother. Everything from her freaking out over things, then making it my problem, then guilting me and making me feel like a terrible person. Holy crap. I struggled for years as I knew she was a good person and most of the time we had a great relationship, but the bad times had me hysterical, panic attacks and feeling horrible (emails disowning me because of how horrible I'd been, how I was hurting my family and so on) \n\nI had therapists at time telling me I shout cut her out if my life because of how bad she could make me feel, and I was already struggling with anxiety and depression. I resisted because she's a lovely human being and tries her best. \n\nI had a come to Jesus moment beginning of this year that sounds a lot like your above scenario (I was wasting my life and hurting my brother because of money I had borrowed off him). Realised I cared so much about her that I let her get under my skin rather than being able to brush her off when she did or said whacko things. Part of me thought I would turn out like her, and if I could help her and be there for her, it was like helping my future self (I really don't want to be like her in 30 years - she never sought treatment for anxiety and depression like I did). \n\nI have now given up on wishing for the ideal mother daughter relationship where we're best friends and confide in each other. I've stopped feeling guilty about that, I'm still a good daughter, I just keep her at half an arms length. I'm closer to my dad. Anyone who knows my mum knows how emotionally draining she can be. Anyone who doesn't know doesn't need to know details. I'll never be able to always please her, she'll always have moments with me like your scenario, and I mentally do better expecting that than being blindsided and then emotionally killing myself trying to sort out the situation. \n\nI got a lot of inspiration from r/raisedbynarcassists, not because I think she is one, but because it's a place where you can talk about having a toxic relationship with someone who is supposed to love you and accept you unconditionally, and how to deal with interactions like what you've outlined. \n\nBTW my mother in law is fucking awesome and everything my mother is not, so I know it's not me. My mother is the r/JUSTNOMIL in our relationship. When someone who knows your mother well has to make you feel better about her, that's a real red flag to me. My dad made excuses for my mum my whole life (she's just tired, she just really loves you and is scared for you and doesn't express it well, etc). Be careful in the future with taking what she says to heart. She's your mum so of course you listen to her and care about what she has to say, but not all of us have the kind of mum you should be listening to... \n\nRelax, and focus on looking after yourself with your surgery! Kick butt in scrabble and enjoy chatting to your gram, she sounds awesome!!!!",
            "Hon, I am sorry, but your mom doesn't have you first in her heart, and probably never has. When you realize that, that's when you can go forward.",
            "Take it easy. Seriously, don't let this stress you out. You need to focus on getting better right now.",
            "You should call your grandma and ask about her surgery. Don't give any indication that you've had a fight with your mom about it. Just call her and bullshit about surgeries, how you're feeling, how she is feeling,  and let her know that you love her and that you really wish that you could be there for her. Tell her that you wish that she would've consulted you about when she was going to have her surgery done so that you could've put your surgery off until after hers. I'm sure the conversation will go well and your mom doesn't need to be any wiser. ",
            "If you choose to pick up the phone when she calls:  perhaps, \"Right now I could use someone myself to run errands for me, but I can get by as long as I'm careful.  You haven't volunteered to help me, and you haven't volunteered to help grandma, either.  You certainly don't get to volunteer my help when I am supposed to take it easy.  Please feel free to get off your ass and help either of us.\"  OK I didn't mean that last sentence, but seriously, your mother is the opposite of saint here.  The selfish monster is your mother.  The lack of care and respect she has for you is appalling.  Please continue standing up for yourself and don't feel a bit of guilt about it!  If anything it's very adult of you, not childish.  \n\nLike the others say, reach out to your grandma directly.  ",
            "I was about to say. When i had my breast reduction surgery, it took me weeks to regain my arm strength. Stayed with my then-80 something grandparents (now 90s!) and it was very humbling to have to ask my papa to pour me a glass of milk because i couldn't pick up the jug. \n\nYour Gram sounds awesome :)",
            "Would love to hear what your mothers response is. Definitely put your foot down about offering your services without your knowledge.",
            "Your gran sounds awesome. ",
            "Can I join in on online scrabble your gram sounds awesome sauce. ",
            "Actually, there is nothing childish with hanging up the phone when somebody starts berating you.\n\n Maybe next time just give her a warning: \"If you can't speak to me civilly, I will hang up\" and then follow through. Either your mother will eventually get the message and start behaving or she'll keep it up but you will remove yourself from the situation.",
            "I just read that after your update and I have to say: your gran is fucking cool :D ",
            "Your mom is mean and manipulative and enjoys making you feel bad and guilty and selfish. I hate reading you put yourself down for responding to her appropriately. She's trained you to blame yourself and be embarrassed for having reasonable reactions to her bullshit. ",
            "OP, your mom isn't a good person. Stop telling yourself that. Repeatedly slighting her own daughter is not something good people do. ",
            "You do realize you now have to find a way to get \"bidet\" as one of your Scrabble words, right?",
            "Your mother wants to pretend to be a good caring person without actuallg being a good and caring person. Then when she makes you suffer and go through to do things, she will feel like its her that was the actual reason things got better, and knows that people would thank her instead of you, the person who does all the work. She throws you under the bus whenever she can to make herself look better in the eyes of other people. Your mother is not a good woman, she is a narcissist. I wouls read /r/raisedbynarcissists to see if any of those stories fit you.",
            "So I see that you updated and your grandma is fine, so yay!\n\nAs for your mom... I don't want to be \"that girl\" but she doesn't sound like a good person. More like a self-centered asshole.\n\nSorry.",
            "Glad you were able to talk it out with your Grandma - she sounds awesome!",
            "Your Gram needs to squirt your mom with the bidet.\n\nBut seriously, your mom is being manipulative and actively tried to mmmake you feel bad.",
            "/r/raisedbynarcissists",
            "Your mom's \"not a bad person\" who decides to berate and guilt you after you've had a mastectomy? I'd reexamine that belief.\n\nYou were not being immature. Start standing up for yourself and drawing boundaries more often.",
            "My parents are both 65 going on 66. The thought of them needing help after minor surgery like that is hilarious. 66 is not 'old and hopeless' a lot of the time. ",
            "Your Gram is awesome.",
            "I want to make something clear to you. You are not childish for hanging up when someone is berating you. My mother, a supreme narcissist, has told me ever since I went to college that hanging up on her when she is screaming at/insulting me is \"childish\" and \"incredibly rude.\" No. That is what a narcissist thinks. Healthy adults are not required to just sit and listen while they are being berated on the phone. Adults can simply hang up if the other person is being unreasonable. I beg you to start seeing a therapist and help you reorder in your mind what a healthy relationship with your mother would look like. If you are anything like me, you have been raised to think exactly what your mother wants you to think of \"what a responsible adult should be like.\" \nIn my thirties now, and drawing boundaries with my mom is exhausting, but I feel much more confident about myself than I did in college or my mid-twenties. Hilariously, now my mother herself is the one who hangs up if I draw a boundary (telling her \"no\" is a huge insult to her).",
            "Just read your update. Can you maybe swap your mom out for your gram??",
            "Hey, OP, glad you and your Gram are on the same page.  Just...mentally laugh at your mom for a while.  Even if she starts in, mention that you talked to Gram, everything's fine, and...mentally laugh at her some more.",
            "Gram sounds great! Get some rest and play some scrabble with her! Hope both of your recoveries go well... \n\nAnd tell your mom I could use a $200 bidet. I have a cheap $40 one. Have to shoot my ass with cold water, like some kind of savage. ",
            "Your mom is a beeyotch of the turbo variety, I'm sorry to say. She isn't just \"not very considerate\" of you sometimes; she is outright cruel to you on purpose. She deliberately slights you and does things to make you feel shitty. Ask yourself if that's the kind of thing a nice person does. My husband has a saying...\"There's nothing so bad as something that is not so bad.\" I think that applies to people too, or at least to your mom. Yeesh. ",
            "Before I read the update, I was going to suggest talking to grandmother about the whole situation and let her know what was happening.",
            "It's always difficult to see your mother clearly. But from an Internet stranger, what I see, is yes, your mother IS a bad person, (or should we be kind and say a person who behaves badly): she is manipulative, untruthful and unkind. ",
            "Glad to hear you and your gran had a talk, and that she's doing well! \n\nWas in a similar situation regarding my boyfriends grandma and the rest of his family. I didn't mind going over to her house to help, she was like family at this point But it seemed  like ever since he and I started to help all of the family relied on us to do everything.\n\n On days we didn't go over there his mom made it seem like we were neglecting her (she was very indedependent, just needed small stuff done like laundry. Not like she wasnt eating or anything) even though the mom worked no less than half a block away... Idk, some people like making others feel bad so they look like the better person. ",
            "Regarding your update: Aren't grandmothers just the best?",
            "The bit about the MacBook made me feel irrationally angry :)",
            "So I'm a little late to the party, but if something like this ever happens again, I'd just take a few really graphic pictures of the goriest parts of your post-op wounds/swelling and send it to mom. Bonus points for redness, puss, bleeding, and stitches. Put an instagram filter on it of it makes it look more painful. It'll shut her up right quick hahaha",
            "Ok can i just clarify that your gram is only 66 and your mom is 56??? why can't your mom take care of her if she's fairly able bodied and given they are in a similar age bracket thus having the same interests possibly?? They may both work full time but there's evenings and weekends.",
            "It sounds like your mother has a history of being really selfish and inconsiderate. Your mom doesnt get to volunteer your time. She can ask that you help but she doesnt get to demand that you do, which is what shes doing when she signs you up for tasks without your knowledge. Your mom also doesnt get to decide the state of your health. Again, she can ask and you can share that with her but thats it. \n\nI would suggest being direct with her, \"Mom, its incredibly rude for you to assume you have the right to assign my time and effort to ANY task without talking to me. It shows just how little respect you have for me as a person. Its also extremely inconsiderate for you to assume about my health without talking to me about it. It shows you werent concerned for my health or me, only what I could do for you. If you need my help, ask before you commit me to doing something.\" ",
            "This entire situation including the update mirrors my mother-grandmother-me relationship perfectly. <3",
            "Your gram is awesome, I legit burst out laughing when I read how she burst out laughing. She's one of those cool old people that are just so chill. Your mom should learn from her. Your mom seems like such a worrier. It looks like all this is more about her than it is about you or your grandma. One thing about parents that are emotionally hungry is that they seek their sense of self-value externally from their role as a parent. To validate themselves they act out what's expected of that role, and if that is resisted by others then they feel very offended. The way you define that role depends on a lot of factors, such as personality type, anxiety levels, upbringing, etc. Some parents think their role as a parent is to make all the major decisions for their children and protect them from the world. But that has less to do with the child's well being as it does with the parent's own sense of validation. ",
            "Love the edit.  A bidet.....I'm going to have to add that to my list of comfort gifts to give to friends and family post-surgery.  Haha, your poor grandma.  I'm sure the last thing she wants while she heals is a plumber tearing up her bathroom to add a bidet.  \n\nI'm so glad you spoke to Grandma directly.  And now, y'all have such a funny inside joke to share.  \n\nBe well, take good care of yourself and may you heal quickly.  ",
            "Your mom's an ass. Your grandma is awesome. \n\nIgnore your mom. Listen to Gram.\n\nI hope the rest of your recovery continues to go well.",
            "Your mom is trying to gain favor with your grandmother by having you take care of her. So, you do the work and she takes the credit then your grandmother feels like she owes your mom \"a favor\". ",
            "Volunteer her for stuff",
            "Hey, I think I've found you on Reddit before! You're BRCA2, right? I'm BRCA1 and had a bilateral mastectomy (prophylactic, like yours) in January. If I can help with anything, please let me know! I got a lot of helpful advice from other people. I had DIEP reconstruction and it was a huge amount of time before I could really do anything; two weeks afterward and I was still basically useless. Sending my best wishes and fast-healing vibes!",
            "You are very easily manipulated by your abusive mother, who has narcissistic tendencies.\n\nTime to learn how to set proper boundaries.  Hanging up was a great start.",
            "You're doing nothing wrong and your mum sounds wonderful.",
            "I'm more pissed about the MacBook.",
            "As a total sidenote... Bidets are awesome. Best $25 I ever spent. I get super annoyed using toilet paper now. ",
            "After seeing that edit I just wanted to say that I like your grandma. ",
            "Hi, I just want to say, your Gram sounds AWESOME",
            "No advice as you got it sorted but your grandma sounds awesome.",
            "I kinda want to party with Gram.",
            "keep the Bidet. I'm guessing it's a hand held sprayer? Those things are awesome!",
            "Your Gram sounds great",
            "Well I'm glad you have support from your grandma.  When your mom calls you can say something like, \"I've talked to Gram and we're good.  I feel hurt that your are not considering my health or well being and I think I need some time to recover before we talk about this again.\" ",
            "Your grandma sounds baller and this update makes me happy ",
            "Just tell them all to fuck off! \n\nWow your mother is a horrible and terrible human being. Please don't feel bad!",
            "Your grandma is cool as fuck, just like mine. Nice",
            "Your mother is a vile person. Please stop communicating with her. You had major surgery. Your grandma is a cool lady, I like her, but please avoid your mother at all costs. Your mother is really a piece of work. ",
            "Hi OP. Why did you have your breast removed? (OK 5o PM if it is too public.) I had a partial mastectomy 3 weeks ago. I ambok but today I got a strange pillow to tuck under my arm and it is the best. It helps a lot because it still hurts. Finally I can wear my backpack, carefully.",
            "She is being a gentleman at the expense of someone else. That very \"British\" of her. \n\nTell her, \"Sweetheart, you are so silly. You know I can't. Bless you heart. You are too precious...\""
        ]
    }
]