[
    {
        "post_id": "otf3wb",
        "author": "Smooth_Milk7100",
        "title": "Update : My(24F) boyfriend (23M) sometimes make self deprecating jokes about me not being his 'type' .",
        "url": "https://www.reddit.com/r/relationships/comments/otf3wb/update_my24f_boyfriend_23m_sometimes_make_self/",
        "score": 2356,
        "num_comments": 77,
        "created_utc": 1627494628.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/ohktt5/my24f_boyfriend_23m_sometimes_make_self/)\n\nI just decided to tell him to stop making those jokes. He listened to me apologized for making them and said he would stop. He wrote me a sweet letter telling me that I was his type.  He hasn't made one that particular joke once but he started to make a lot more jokes calling himself an idiot. \n\nI again asked him why he was doing it and he said it was just jokes but it didn't feel like it. I finally sat him down asked if he felt okay and happy? I remember one of the commenter saying that he may have been unhappy in the relationship and that had gotten to me. He said he happy with our relationship but he was not happy with himself and he felt deeply lost and he constantly keeps critiquing himself. He said everything he did comes back to haunt him. \n\nI have realized that he has a very low opinion of himself which I find tragic as he has so much to offer to the world. so many people look up at him and love him but he probably feels like he doesn't deserve it. He is going to get a referral to a therapist. \n\nI feel a bit insecure because I feel like I contributed to his problems. I am sometimes critical of him but apparently he doesn't mind that because he feels relived when he knows what exactly he has done wrong? I don't understand this completely but I think I will just try to be there for him. I hope he feels better about himself. He is the person that makes me the happiest and I want him to be happy too.  \n\nTLDR : My boyfriend corrected his behavior but continued to make other self deprecating jokes. He seems to have sever self esteem issues. He is planning to go therapy.",
        "permalink": "/r/relationships/comments/otf3wb/update_my24f_boyfriend_23m_sometimes_make_self/",
        "comments": [
            ">I feel a bit insecure because I feel like I contributed to his problems. I am sometimes critical of him but apparently he doesn't mind that because he feels relived when he knows what exactly he has done wrong?\n\n\nOne of the worst parts about having low self-esteem is that it's easy to assume that everyone around you is mad about every single thing you do, and your imagination can get pretty creative at coming up with plausible scenarios where it makes sense that they would be mad. When that happens, it can feel like waking up from a nightmare when they say \"It's kind of frustrating that you haven't taken the trash out yet\" and you realize that the only problem was actually very minor and easy to handle.",
            "It sounds like you identified the problem(s), communicated about it, and you're on the right paths to sorting them out. Hold him accountable about his promise to go to therapy and help him with it if you can. Nowadays more therapists are working remotely, personally I find it much easier to just have a one hour phone call once a month. Some of them will take payment over Venmo etc if you dont have insurance.\n\nThe deeply low opinion of himself thing is a serious issue but if he handles it well he will be deeply grateful that you stuck with him.",
            "I'm glad that this had a positive outcome. I can, somewhat relate to the problem of thinking my partner is way more better than me in every possible angle, and that helps to projects some insecurities how we think our partners think about us, wich might hurt some healty relationships, sometimes.\n\nThat thing about criticizing him, if he says that he's relived, then you have nothing to worry about i guess. If someone is always critizing himself in every manner, when other person makes that critique it might help him differenciate of what is real critiques and what is just impostors syndrome.\n\n So, good luck, congrats for the open talking.",
            "It sounds like you did the right things to get him to seek help for the underlying issue. That's the important part of this. You didn't let it go.",
            "He has taken on board what you said, realised he has a real problem and is ready and willing to get professional help to deal with it. He is on the right track. \n\nSo are you. You spotted that his self-deprecating habit was not just humour, were able to bring up the subject with him, and in such a way he felt comfortable to open up to you about his true feelings. And you listened and are willing to support him to get better.\n\nHope you both make it.",
            "not that you have to be thinking about marriage at 24, but this is why my wife and I are together. what works isn't indicated by the \"good times\" because most people can have fun together when doing something fun, what works shows itself by how you resolve conflict. We hash it out, find the \"real\" reason why something came up, and then address the \"why\" instead of just the behavior.\n\nwe're not into \"old people\" territory yet but we're 11 years and going strong. gl to you and your SO!",
            "My guess, is that he thinks you are out of his league. I had that issue once. I was dating someone who was incredibly beautiful, smart, and funny. For the life of me, I couldn't see why she would date someone like me. And it really began to eat at my self confidence. \n\nYour Bf's jokes may have been an attempt to guage your reaction. To see if there is any truth in what he fears. He may worry that you will eventually \"come to your senses\" and leave him. At least that's how I viewed my situation.",
            "My husband is the same way about jokes.  It used to be every once in a while, especially when stressed, but when the pandemic started he was constantly putting himself down multiple times a day.  For example, I was working one day and called a work project a piece of shit, he responded with \"I know I am, I'm sorry.\" Shit like that isn't okay.  It made me feel like an abuser.  It felt made me feel complicit in his depression.  He was weaponizing my negative emotions to harm himself.\n\nOne day I snapped and asked him why the hell he thought it was okay to speak about my husband that way to me.  That I don't allow anyone to disparage my husband and I wasn't sure why he thought he was different.   It shocked my husband.  He took some time and thought about everything that had been going on, then he apologized to me.  I accepted that and told him if it's not okay to say to other people it's not okay to say it about yourself.",
            "Within the last few years my husband has made headway in this process. He described a turning point for him was realizing that he didn't like himself because of the depression, not that his dislike for himself caused the depression. It really helped him to see those thoughts as a symptom rather than the cause. \n\nThose things still sneak in, but that's now his cue to look around for the other triggers he has (medication, not enough sleep, too much going on) and adjust.\n\nThen key was finding a therapist he clicked with who asked him the harder followup questions that he needed to work through things.\n\nHope your SO finds someone he clicks with.",
            "the most helpful thing for me has been to repeat \"I choose not to self harm\" over and over. I realised I was mentally torturing myself hundreds or thousands of times in a day, to an extent I had no idea. Trying  to \"be better\" was just doubling down on the self hate. So the only thing that has helped is to start reinforcing over and over again that \"I choose not to engage in self-harm\" without putting a definition of what that would look like attached. A lot of the time its just to stop replaying social interactions or critiqueing myself for not doing something the \"proper\" way. I deserve to be able to relax in my own home, and feel comfortable in my body even if my idealised self wants to bully me into being ashamed of anything less than perfection at all times.",
            "I realized that I was self loathing and all around just a negative person towards myself and the people I love or should love. It was a big wake up call for me when I realized that life wasn't miserable and that I don't have to feel these feelings of self hate which then gets spread around everyone else. My best defense mechanism was laughter but I would make fun of others and myself most of the time. My perspective on life was so bad it's like that was the only way I knew how to act. It took someone I really cared about to tell me things I've said to them and how it hurt them. Basically without that person keeping it real with me and putting up with my bs for so long I would never of changed my perspective and I hope your bf comes to the same resolution. I hope he never stops with just the one sweet thing, but continues to better himself and his outlook on life each and everyday. You'll know if he's changed for real by his words demeanor and actions improving on a consistent basis. Best of luck!",
            "Planning to go to therapy and actually making a plan, calling a doctor, making an appointment, and then going to that appointment... are very different things.",
            "If you are giving criticism in a healthy constructive way and he is able to see it as constructive/solution oriented, it helps him because it 1. helps him stop catastrophizing (imagining worst case scenarios, exaggerating his self hatred based on those what ifs, etc) and 2. it gives him an actionable item to do and once it’s done he has a tangible Thing tell his self hatred goblin to shut the fuck up. This isn’t a long term solution - the self hatred goblin shouldn’t be so loud in the first place - but it is an effective coping mechanism in the meantime while he is working on the volume and insistence of said brain goblin in therapy.\n\nIf you are giving feedback in the way he best receives it but he’s beating himself up still or twisting it in a way to use it as a weapon against himself/to confirm the catastrophizing and what the self hatred brain goblin says - that’s nothing to feel guilty about. therapy will help him. you can feel bad for him that he’s in pain, but it’s not your fault.\n\nNow if your feedback is not being given in the way he best receives it (and it might be worth trying it different ways; some people like a “compliment sandwich”, I like to be told in order “you’re doing x wrong, do y to fix it, and i did like how you did z-related-thing so keep that up” which results in crit, solution, and reassurance - there are other ways, as well), or if you are being abusive or cruel, then sure, you can help by changing how you give criticism.\n\nmore than likely it has to do with his internal processing. which the therapy can help with.",
            "That ‘relief’ he feels when you tell him what he’s done wrong? That’s his self dating thoughts getting validation. Do not listen to that. That’s his brain going ‘see, she thinks it too, so it must be true. You’re worthless’\n\nStop being so harsh and critical of him, you say yourself he’s amazing and offers so much. Do you praise him like that, even when he’s not going through problems? Because that can be a big help to people who feel worthless",
            "Remind him that people in general are self centered. Not in a bad way, it's just our self preservation wiring. But we do grow up and learn that it isn't all about us anymore at some point. So everybody isn't sitting around thinking about what a bad person he is, or what kind of person he is at all. They don't really care, and I mean that in a good way. Developmentally as babies we had to think it was all about us because that's how we got our needs met, by focusing on that. But as we grow, we think of others and realize nobody but ourselves can determine what kind of person we are and it is up to us to define and become that which we want to be.",
            "Sounds like a great bit of self awareness on your bf’s part. He sounds like some therapy will help his inner dialogue become more positive",
            "By the way, judging from this tiny glance at your situation, your boyfriend sounds a lot like my mother. Constantly doubting herself. In her case it's the upbringing and years of an abusive relationship with my father. So I think I get in a roundabout way how those types of comments can be hurtful even though they have everything to do with him and nothing with you.\n\nI hope he gets the help he needs while he's young, before he truly internalizes this low trust of himself. Thank you for being a conscientious person and helping him with this task.",
            "I just wanted to say when me or my fiancé make these kinds of self-deprecating comments, the other immediately says “hey don’t talk about my friend that way!” It snaps us right out of it. I don’t know y’all’s sense of humor and if this will work for you guys but I thought I’d mention it!",
            "Self-deprecating humor, when done right, can be a great way to endear yourself to others, and lighten the mood at your own expense. However, going too far with it ends up having the opposite effect, and it sounds like you found that going on here. \n\nI think it's great that you both communicated about this openly and worked to determine a path to try and get him, and your relationship, back on solid footing. Know that it may not happen quickly, and it may take him time to work through these self-image issues. What I would say is give him space, and don't overcompensate. It will probably be instinctive for you to try and build him up, compliment him more so than usual, to strengthen his confidence. I wouldn't do that as he will likely see through it and it may backfire. Be selective, and thoughtful, in your compliments and appreciation. Trust that he'll get there.\n\nFinally, you mentioned insecurity due to sometimes being critical of him. I may be over-interpreting this, but I would just caution in how you approach him about these things. It sounds like it's not an issue for him, which is great, but just be careful to approach him about these things in way towards solving the issue, rather than observing it and \"complaining\" about it. Again, this may be something you're already doing, but I find it's very helpful if someone says to me (or I say to others) something like \"Hey, this is bothering/concerning/worrying me, and I was hoping we could talk through it together.\" \n\nThe key I find for this is to not jump on it in the moment when it happens. Let some time pass, and come back to it later. It won't be so fresh and hot in your mind, and lets you approach it more collaboratively, if that makes sense.\n\nYou may already be there on a lot of this, but the way you phrased that concern of yours made me want to mention it. Best of luck!",
            "IMHO it is great that you two are talking to each other so honestly--like real grown-ups!  Communication is always challenging, and it's beneficial to keep practicing.",
            "I'm proud of him for looking into therapy. It personally helped me immensely when I was in a very *very* bad place in terms of depression and general well being. Please tell him it takes time, and it might be hard to come forward. But after all it's their job to make you your best possible self.",
            "Dude's got depression. It's cool, it's treatable, but don't just ignore it or try to tough it out. Depression is a disease, and there's no shame in getting professional help for it, any more than there would be for getting a cast on a broken leg or insulin for your diabetes.\n\nIt sounds like you two love each other a lot and have good communication, which is an excellent base to work from. I know therapy and antidepressants can seem intimidating, but they're much better than living with untreated depression. Take it from someone who knows!",
            "Reading this made me tear up. He's really lucky to have you. Anytime you feel the urge to tell him how awesome you think he is, in general or specifics, tell him.",
            "The subconscious cannot take a joke. It takes everything being said seriously. Him saying those things about himself is putting himself down. Really glad he’s able and choosing to get therapy :)",
            "I'm dealing with depression, anxiety and a very low self esteem myself for years, and him seeking out therapy is the best thing he can do. It would be awesome if you could help him find a therapist he can work well with, even if it takes some time, becaus he has severe issues that need to be worked on. \n\n\n> He said he happy with our relationship but he was not happy with himself and he felt deeply lost and he constantly keeps critiquing himself. He said everything he did comes back to haunt him. \n\n\nThis is exactly me, hence my response. I hope he can find a way to be happy with himself again. Best of luck to you two.",
            "Most men (like myself) really just need to know specifically what we did wrong. I don’t do well with clues.",
            "The way I am reading this is less of you not being his type and more so that he is insecure that he is not YOUR type. It could be he has some insecurities that you may be out (“above”) of his league. I would give him a lot of reassurance, maybe that he isn’t your type, he is the only one of him and he is all you WANT or something to give him some reassurance.",
            "I think what he means is it's refreshing to have someone communicate their thoughts and feelings, instead of bottling them up and becoming resentful or exploding. It's also less passive aggressive and generally a sign of good communication when you can point to the action that was problematic instead of making general accusations/ attacks on character. \n\nFor example: \n\nwhy didn't you take the trash out like we talked about?\n\nVs.\n\nYou are lazy and you never help around the house/ do what you say you will.",
            "These are two of the most wholesome posts I've ever read on this sub",
            "Try leaving little sticky notes around his home that boost his self esteem: Things he is good at, what you like about him, his accomplishments.",
            "My SO and I both struggle with depression and anxiety, so I totally get where it can feel like you're 'contributing to his low self-esteem'. \n\nBut addressing the problem in a healthy, constructive way is exactly what you should have done. +20 good communication points for you. You can't control how he feels about it, or how he feels about himself, because all of those feelings are valid. But you can support him, reassure him, create safe spaces for him to talk to you (we try to go to bed early once a week and spend some time talking, no phones, no TV, just some cuddling and emotional intimacy)\n\nMy SO often asks no-brainer questions, like 'you still find me attractive, right?' or 'you think I'm a good person, right?' just because he needs to hear those things out loud sometimes. I try to respond by doing more unsolicited compliments, and saying those things out loud more often do he knows that I mean them all the time, not just when he asks, and sometimes that helps with his depressive episodes. \n\nTherapy is not overrated- I love therapy. It's like having a best friend who lust let's your talk about yourself for an hour. I'm glad he's getting help, and I'm glad you were as aware as you were to know something was going on. You guys seem like a great couple, and I wish y'all many happy years.",
            "Thanks Henny Youngman and every boomer for the \"Take my wife... Please!\" trope that permeated borscht belt comedy routines (and therefore most entertainment since it was written by either the same comedians or fans of those comedians) until... well forever?  At *least* Andrew Dice Clay?",
            "I'd next someone over something like this.",
            "Men in their 20s can’t really pick their girlfriend. The girl does the picking at that age bracket. So basically you’re his only option at the moment.\n\nNow you know this principle you cant act on that as you see please.",
            "Or he just has a terrible sense of humor. He may think you are that perfect.  How can she want me???  Work on his low self-esteem by pointing out why you love/want him.  I've wondered myself...only cute, but I remember how wonderful I am and all is good in the world",
            "I have had this problem my whole life because of a mix of PTSD and anxiety. The negative self talk really sucks. CBT therapy is probably the one and only good way to deal with it, along with meditation and other relaxation techniques.",
            "This is a lovely update. As a couple, you faced a problem. You talked it out. You are pursuing a path to resolution. Hugs and kisses to both of you. I hope you have a long and happy future together.",
            "I just want to reiterate how his low opinions of himself have little to nothing to do with you. As a partner, it’s helpful to call each other out on their bullshit and laziness. People need that kind of accountability. As long as you aren’t criticizing him in a degrading or negative way, you have done nothing wrong. His issues are his to solve and deal with. You have done a lot by starting this conversation and getting his issues out on the table. He must have felt so relieved. Keep doing what you’re doing and supporting him through this healing process.",
            "the truth are always in repetitive jokes.",
            "being honest, this sounds like a one sided relationship. You are literally doing all the troubleshooting and his feelings/needs are still coming before yours. Just be careful you aren't giving more than you are getting on the long run.",
            "This is all about him thinking you are too good for him and looking for reassurance. Talk to him about that.",
            "I get this. \n\nI’m very insecure, and am really struggling with my anxiety. I make jokes similar to what he’s doing now, and sometimes they’re intentional and other times they just seem to come out. \n\nThe fact he wants to go to therapy is a good thing. Supporting him and maintaining honest, open communication, is the best way. \n\nAlso, don’t forget yourself in all of this. My partner seeks support for her, because of the emotional stress I place her under. Looking after yourself is just as important.",
            "This sounds like anxiety to me.  You might want to suggest counseling or medication or both.  I will say that I used to feel this way all the time and a low dose of an antidepressant made an amazing difference.",
            "I’d say start to be very uplifting towards him with small things like you look really good today small things like saying I love you at random times be his hype girl but if there is something that upsets you tell him clearly and make it a point that you still love him it was just you communicating to straighten the relationship. And it’s jot your fault lots of people struggle with things like that and usually when you put energy (definitely not saying you have to be 100% responsible for others or how they feel these are just small suggestions that worked for me with my partner) into hyping them up and bringing them up they will start bot only feel that but also reflect that back onto you making a good partnership of support",
            "I recognize the part with \"when he knows what exactly he has done wrong\".",
            " >I don't understand this completely but I think I will just try to be there for him.\n\nI just wanted to compliment you on your line of thinking. People are often so inclined to jump to conclusions when they do not understand something. Usually the negative kind of conclusion involving themselves in some sort of way and even introduce a whole set of new problems to the relationship at the same time.\n\nSo \"high five\" internet stranger. You are showing some emotional intelligence right there.",
            "Something you might be able to point out is that you asked him to stop making a joke that made you uncomfortable and he broke the habit right away. Which isn't something an idiot does, it's something someone who is worthy of love does.",
            ">  I am sometimes critical of him but apparently he doesn't mind that because he feels relived when he knows what exactly he has done wrong? I don't understand this completely but I think I will just try to be there for him. \n\nThink of it this way.  Let's say you cook a nice meal for someone, then when they try it they notice that it seems a bit under-spiced, leaving the flavor a bit bland.  Some people, upon hearing feedback like \"you know, some cumin would have deepened the flavor\" will get very resentful, because what they perceive is that the person isn't appreciating the time they put into the meal.  Other people will be happy to hear the feedback, as it allows them to prepare a better mean next time.  It sounds like your boyfriend is the latter sort of personality."
        ]
    },
    {
        "post_id": "4qvzt0",
        "author": "Brotherissuesfd",
        "title": "UPDATE: Our [23F&22F] brother [26M] has publicly humiliated our little brother [16M] after he went to him for advice about turning down sex because he did not have a condom.",
        "url": "https://www.reddit.com/r/relationships/comments/4qvzt0/update_our_23f22f_brother_26m_has_publicly/",
        "score": 2355,
        "num_comments": 85,
        "created_utc": 1467437809.0,
        "selftext": "OG Post: https://www.reddit.com/r/relationships/comments/4pzlmo/our_23f22f_brother_26m_has_publicly_humiliated/\n\nHi everyone, so this more of a thank you more than anything. This is a really happy update. \n\nOur mother returned to Michigan yesterday and we informed her of the whole situation. We told her that Micheal (older/Vegas brother) had embarrassed Nick (little brother) on Facebook. We told her what was said and all about the situation. She gave Mike the biggest lecture of all time. She basically told him he can run around and get STI until he has them all, she can't control him. But he will not influence Nick to follow his poor example and endanger himself. She told him they teach safe sex for a reason and don't make condoms for shits and giggles. \n\nMy sister and I went out and bought our brother some condoms. It was not as awkward as we thought it was going to be, but we had a conversation with us about them. We told him that we are proud of him and we told him girls would like him alot more for his actions. \n\nSuper happy about this Dayna, the girl who he almost had sex with/his crush. Dayna asked him out on a date and they are going on a date tonight. So he is super happy about that and he is feeling good about his decision to stop. Nick is taking Dayna out on  date to the movies tonight so that's good. \n\ntl;dr: Mom gave older brother a lecture of a lifetime, got the younger bro some condoms. Brother is taking out the girl he almost had sex/ his crush on a date to the movies \n\n",
        "permalink": "/r/relationships/comments/4qvzt0/update_our_23f22f_brother_26m_has_publicly/",
        "comments": [
            "Yay! Super happy for the update. I'm glad your brother has you to talk to him rather than rely on Michael's awful \"advice\". Btw, your mom sounds badass!",
            "[removed]",
            "Yay! Make sure he doesn't put the condom in his Wallet 😉",
            "[deleted]",
            "Thank you for being proud and supportive of him and drowning out your older brothers (and his friends) crap. \n\nOut of curiousity has your (younger) brother gone back on social media?",
            "You and your sister are AWESOME. Props to you!",
            "Glad to hear it! One thing to note, it's not a bad idea for your bro to practice putting on condoms and inspecting them before he has sex. That way he'll be used to the sensation and won't lose his erection, or he'll be able to tell if he needs a different size. Glad it all worked out!",
            "Glad that this is a happy update :) It's awesome of your mom to defend Nick. \n\n\n",
            "you are awesome, and your brother is lucky to have you.\n\nOn the other hand your little brother is a gentleman! I hope he scores tonight haha",
            "Glad it's working out for you guys. Still think you should've bought condoms for the asshole brother",
            "Op, make sure he knows how to properly use his shiny new condoms! Show him on a banana if he doesn't. Make sure he knows to pinch the tip, and hold the base of it afterwards. Make sure he knows not to flush them! Make sure he knows not to lube up with anything that can damage the latex!! Buy him some water or silicone based lube if you need to.\n\nIt would be sad to have to have gone through all this turmoil just for the condom to fail because of improper use.",
            "Props to your brother for being a good human. I truly hope something happens between him and Dayna!",
            "Did she do the lecture publicly in Facebook? Please be this ",
            "You are still awesome sisters, your Mom sounds pretty cool and hopefully your bro plays it cool and let's any possible sex happen naturally. ",
            "Good. Your older bro is a dick. Your younger bro is going places. :)",
            "Yay! Happy ending! I just read the first post too and I have to say that is one of the stories I keep hearing about how some wankers think they know women better than women themselves. \"You turn down sex so you'll never get laid\"?? Your little brother is sensible and reliable, so that makes him extremely attractive. He is going to be so popular with the ladies! He even now has a date who likes him for who he is! With condom, he will be able to have sex, too! Suck it, STI-ridden Vegas brother!",
            "Kudos to the mom for understanding that blowing up or telling your kids not to have sex isn't going to stop them it's just going to stop them from telling you.\n\n",
            "Your brother's gonna get laid!",
            "The older brother will likely have a child of his own at this rate real soon!",
            "YEAH! GO Big Sisters! GO Mom! GO Little Bro! GO Dayna!! Everyone wins!! (except douchebag Michael, lol, but he brought that on himself...) \n\nI hope little bro and Dayna have a spectacular first date!!",
            "Jeez. At 26 I was married 7 years with 2 kids age 5 and 3.5. I can't even begin to imagine being that immature at that age. \n\nAlso, aren't the first born usually the most mature?",
            "Great update! Love that you and your mom took this seriously and were supportive of your brother. Congrats to Nick :)",
            "That is a happy happy update. How does older douchebag brother feel about being lectured by your mom?",
            "Mod , I hope u also gave him reference to a website on how it should be properly used and also info on diseases that can be contracted (herpes etc.) that condoms can't really 100% protect him from ",
            "Hooray for standing up for responsibility. Birth control does not make you a wimp and being responsible is nothing to be embarrassed about. ",
            "Get your younger brother a sex ed book as well!  Something easy to read.  I don't know what's currently available, but I bet Dan Savage's is great.  Just leave it under his pillow or something.  ",
            "Great update. Kudos to all of you (aside from the asshole brother) for how you guys handled everything. ",
            "Glad that he got with Dayna!",
            "> Dayna asked him out on a date and they are going on a date tonight. So he is super happy about that and he is feeling good about his decision to stop. Nick is taking Dayna out on date to the movies tonight so that's good.\n\nYay! Go Nate!!! ",
            "Woot Woot younger brother! Love these kind of updates. Still feel'n other brother needs humbling playback though. ",
            "Nick is a stud.  A man amongst boys.  That he is using his intellect is a great indicator of the type of person he is.  He is a catch for all girls and he needs to know that.   Also, guys who act like Nick are serious magnets for woman. That confidence is palpable to good people. He will fine. ",
            "For the number of permanent diseases I saw people have at the homeless shelter when I worked there I am sincerely glad you were able to advocate and support your brother. Also I'm proud of him for making a wise decision. Your other brother needs his head examined for humiliating family pub locally like that. Not cool. \n\nGreat post OP. ",
            "Makes me think of all those young boys og girls who get wrong advice & fall for wrong practices & get heart break, bad reputation, mental problems or even pregnancy.",
            "Why is your younger brother going around telling that story to all his siblings anyways? Isnt that weird as fuck to anyone else?"
        ]
    },
    {
        "post_id": "1mkqnc",
        "author": "ThrowawayPinkLover",
        "title": "(UPDATE) I'm a waitress and I (F24) have a HUGE crush on a regular customer. Help?",
        "url": "https://www.reddit.com/r/relationships/comments/1mkqnc/update_im_a_waitress_and_i_f24_have_a_huge_crush/",
        "score": 2356,
        "num_comments": 224,
        "created_utc": 1379430419.0,
        "selftext": "[Original Post](http://iy.reddit.com/r/relationships/comments/1m4ub6/im_a_waitress_and_i_f24_have_a_huge_crush_on_a/)\n\nI have good news!\n\nAs I mentioned in my original post, I normally work Friday mornings and he comes in for breakfast at the same time every Friday. Well, I had the day off and decided to show up for breakfast at the same time as him. It worked out perfectly!\n\nI sat down in the area where he always sits and waited. About 10 minutes later, he walked in the door and saw me sitting down ordering breakfast. He came up to me and looked a little puzzled because I wasn't wearing my uniform. He asked if I had the day off and I said yes. He said, \"That sucks, you're my favorite waitress!\"\n\nI also did my hair and put on some cute clothes that morning and he noticed because he complimented me and said I looked, \"really pretty.\" I could feel my face getting hot. I probably turned 10 shades of red. lol. \n\nNext thing I know, he asked if he could sit at my table with me! I was so nervous. Guys never give me butterflies but he gives them to me all the time. But I acted totally normal and tried not to be a dork. haha! \n\nNormally, I'm very shy around him but he made me feel comfortable and was super easy to talk to. We sat and talked for awhile before our breakfast came. It was so much fun. My manager was the one waiting on us, which she NEVER does but she's been encouraging me to make a move on him for quite awhile. She was so happy for me!\n\nAnyway, I felt like he was giving me signals the entire time, which made me a lot more confident. So I finally worked up the courage and asked if he'd like to hang out some time and he agreed! We swapped numbers and he's been texting/flirting with me a few times a day ever since! \n\nSince we've been texting, I've learned that we both enjoy hiking, so I suggested that we go hiking and check out an old lighthouse, which isn't too far from where we live. He just moved here, so he's never seen it before. (We live on the great lakes, Northern Michigan.) So that's what we're planning on doing this weekend!\n\nWhen we were texting last night, he mentioned that he'd like to go to this fall festival, which is coming up in a couple of weeks and wanted to know if I'd go with him. So I playfully said, \"Are you asking me out on a date? hehe\" and he said, \"Yes.. Will you please go with me? :)\"  I'm so excited!!!\n\nThank you all for your help on my original post! You guys gave me a ton of great advice. I can't believe how easy this whole thing was. Now I see what men have to go through when it comes to asking women out! Anyway, thank you Reddit!\n\nTl;Dr: Success! We're hanging out and going out on a date! [Original Post](http://iy.reddit.com/r/relationships/comments/1m4ub6/im_a_waitress_and_i_f24_have_a_huge_crush_on_a/) ",
        "permalink": "/r/relationships/comments/1mkqnc/update_im_a_waitress_and_i_f24_have_a_huge_crush/",
        "comments": [
            "[deleted]",
            "[removed]",
            "I still remember the butterflies the day I finally asked my pretty waitress for her phone number and she rolled her eyes and laughed and said \"finally!\" Still have the blank ticket she wrote it on and a million happy memories that followed. Best of luck, OP, your story warms the cockles of this heart. Enjoy your dates and may they be the first of many. ",
            "I've been waiting for this one!  Such awesome news, happy for you both.",
            "Northern Michigan is so beautiful right now! What area are you in? It's perfect fall date weather. ",
            "You are too cute.  I'm happy it worked out so well :) Have fun!!!",
            "YAY! Thanks for the update. Enjoy what will hopefully be only the first of many dates for you two. :)",
            "Hey everyone! This is how you do it! Should I ask him or her out? Damn right you should. Good for you.",
            "This is like a fucking movie. Good for you! This is so cute ^-^",
            "That's EXACTLY how I met my last boyfriend. He was a regular at a coffee shop where I worked, I went there on my day off with the intention of \"accidentally\" running into him...sure enough he showed up and we ended up going on a date that night. \n\nGood luck to you! (as it turned out *my* favorite customer ended up being a little crazy!)",
            "Hahaha, such a great story.  Congratulations!",
            "Oh how fun! After a while, when you are completely together, you'll be lying in bed and he'll confess he's been coming in to see you forever... these are the sweet moments in life, enjoy!",
            "> 10 shades of red\n\nName of the next female novel of success!\n\n\"ThrowawayPinkLover is a waitress who can't hide her lust for a certain customer. Will things play out well when she goes on a date with him? Find out on **10 Shades of Red**!\"",
            "Awesome! :)\n\nThanks for the update. ",
            "Congratulations!! Thanks for the update. :D",
            "Great to see a happy update post. \n\nGood luck, and try to have fun :) ",
            "Awwwwwwwwwwwwwwwwwwwwwwwww I like happy endings, or beginnings =)",
            "Remember that time he fully intimidated the old man who was mean to you?  \n\nI knew then that it was love.\n\nI rarely intimidate old men, but when I do, it's to impress women.\n\n\n**women love the whole \"hey look I can torment the infirm\" thing! ;p",
            "Is it weird that I butterflies and blushed as I read this?\n\nWoohoo! Way to go, OP! Congrats :).",
            "And the question remains: Does he drive a sports car?",
            "Awwwww this is cute! Congrats, OP! I actually had a similar experience. I had had a crush on a regular for a long time and finally worked up the nerve to ask him out. He agreed. I was ecstatic! \n\nHe turned out to be a giant douche who wore tap out pants on our date and did nothing but talk about himself the entire time. But that's a whole other story. But I know that feeling of working up the courage and getting a yes answer :) \n\nI hope your date goes better than mine. Good luck :D",
            "I hate post like this because no waitresses secretly like me and I'm all alone. :(",
            "YAY!",
            "I was really hoping to see a happy update to this particular scenario. Glad to see it worked out for you two! So adorable. <3",
            "We did it again, reddit. ",
            "Good for you! I love that your manager was your wingwoman for this :)",
            "This sounds like the intro to a beautiful love story, or a horror film about a girl who is being chased in woods by a murderer. She tries to escape to the light house but only ends up trapping her self at the top with the former love interest cornering her. Her only option was to jump...never to be seen again. ",
            "Stories like this make me miss dating.  Good luck!",
            "This is so sweet I might get diabetes. Ugh. Could this be any more stereotypical?",
            "didn't realize how much i'd been waiting for this update until i saw it. best of luck!",
            "feel good post of the year. I laughed and got a little teary eyed reading it. That's so exciting, and I hope things work out wonderfully for you two. :)",
            "This made me feel all warm and fuzzy inside.  I hope all goes well for you!  This is the reason I hang around this sub. ",
            "Aww I got butterflies just reading this! Congrats!",
            "Eeeee. So cute. Have fun! :)",
            "this is great! So very happy for you! I am a fellow Michigander...if you don't mind me asking, what lighthouse are you going to checkout? I live on the east side so am a bit envious of your beaches and such!",
            "im so clueless i would have said hi to you and gone and sat at the bar alone....... :(",
            "This is so awesome, OP!\n\nHow cool and cute is that, you sitting at his table; that was an exceptional ice breaker, my friend.\n\nYour post has made me giddy. I can't wait to give my SO a hug, meow!\n\nI hope you two have many dates incoming, the best to both of you :)",
            "This is so cute it's almost making me angry.",
            "This made me smile, which is saying something because I've basically been crying for the last 24 hours. Please update us again when you've been dating a little while - I love happy endings :)",
            "Your manager is awesome.  Read the original post and I like how she makes sure you're the one that waits on him since she knows about your crush.  She also never waits on customers herself, but did it for you.  She's like the cool older sister/young mom that every girl wishes she had.  ",
            "I guess I shouldn't have to remind you, but just to be sure (because as far as my cursory search went, nobody told you) be careful when going somewhere isolated with someone you don't really know. Maybe I've just been watching too many cheesy horror movies where they go somewhere alone then the guy gets possessed and stuff.\n\nJust a friendly reminder to stay safe and have fun! ",
            "This is so darn cute.",
            "After you playfully said \"are you asking me out?\" I was like \"wow well played\"\n\nAnyway good luck in future, your story was really cool to read.",
            "All I can think of is that Alicia Keys video..",
            "That's adorable. C: good luck!",
            "AWWWWWWWWWWW I'm so happy for you!!",
            "Yay! Happiness! Have fun!",
            "Thanks for the update! Y'all sound so cute and rom-com!",
            "Holy hell that is adorable. I'm glad you when with it.",
            "Keep us updated ! Good luck!! My husband and I live in MI - lower MI though. We get up to the UP though!  It's beautiful there! :)",
            "I'm so happy this had a good outcome! Nicely done OP. :)",
            "Cute",
            "This is so cute. I hope it works out!",
            "just reading your original post and the update afterwards made me so happy for you! :)",
            "[deleted]",
            "Ah, that's so great, OP! Congrats! Heartwarming! I wish for many, many happy updates to come:D",
            "All that I can say to this is, \"Daaaaaaawwwwwww~\"",
            "Yay! This brought a smile to my face, and I'm so happy for you. I hope that all goes well. ",
            "Congrats! Cue guys around the globe awkwardly hitting on waitresses in the coming hours and days.",
            "This made me really happy! Congrats!! :) ",
            "Yay! Have fun! :)",
            "This is the most precious thing I've ever seen on Reddit. Good for you!!! \n\nI'm gonna need an update after every major development in your relationship now.\n\n",
            "Good job! :D",
            "Oh yay! I was hoping this would turn out happy",
            "I am tickled pink by this story. Good luck!",
            "Staring Zooey Deschanel",
            "I see you already followed through, but I would just like to state that, for the record, I married the cocktail waitress at my favorite lunch spot.",
            "So many mental \"d'awwwwwwwwwwwwww\"s happened. Congratulations :)",
            "That's great! Please also post the trails you're going on just before you get there...you know just incase one of us has to tell the authorities if you one or both of you get \"lost\"",
            "Yay! A happy update! Reading your post reminded me of all those giddy moments I had when I started dating my SO. ",
            "This is adorable and I'm so excited to hear the good news!! Thanks so much for the update! !",
            "D'aaww! I'm such a sucker for these types of stories. Made me blush... congrats! :)",
            "You gave me a happy. haha\n\nCongrats and good luck and good job!",
            "Sounds just like a movie, congratulations!",
            "i feel somehwt bittersweet. sweet for u, bitter cuz it doesnt happen for alot of guys lol",
            "Ahhh, dressing up, not working but being at work the day he comes in...you totally surprised dated him lol, I should try this on someone hahaha",
            "If I see another update after you go for your hike that it turns out that this person was just trying to seduce you and make you pursue him, then hike to an isolated location and pull the big reveal that he's the loch ness monster trying to get his tree fiddy, I am going to absolutely lose my shit.",
            "More women should go after what they want, like you did. If they did, there'd be a lot more happy couples in this world. ",
            "Beyond happy for you! Glad you had a positive ending :)",
            "I'm so happy to see this! \n\nAlso, I've been very happily in a relationship with one of my regulars for almost 6 months. It CAN be done! :)",
            "Aw, jeez!! I wish I could see you guys but right now you're a dainty brunette with sparkly brown eyes and he's a tall, rangy cowboy with a plaid shirt and tousled blonde hair.",
            "I love reading about a woman taking the lead sometimes. So happy to hear it worked out. ",
            "This is wonderful proof that the old guy-code is wrong. Waitresses are NOT off limits. They may be nice for the tips but they turn cherry red for the ones they like.",
            "This is like one of those movies...\nDamn girl, good luck, and CONGRATS!!!! :)\nI'm so happy for you :)",
            "Yay! Congrats! Hope it works out for you guys!",
            "I love a happy beginning :D Sounds like you have a lot of fun ahead for you!",
            "This is like a Redditor's fantasy. Kudos!",
            "This is too fucking cute. Well done. ",
            "That is awesome. I will say that is how I met my soon to be wife, you just never know when and where you will meet the person that will change your life. ",
            "This is so cute. Thanks for sharing!!! So happy for you. ",
            "Holy shit a story on reddit from the up. What restaurant was this?\n",
            "Oh my goodness. This update was so cute. I can just picture you two at breakfast. I hope that this turns into a long and happy relationship!",
            "So nice to hear good news for a change! Best thing ive read today!",
            "YAY!!!",
            "I just wanted to say that this is fucking adorable. That is all. ",
            "Congrats!! ",
            "This makes up for all the sad stories we usually get in here.  Congrats OP!",
            "Aww go you good thing OP!",
            "Always nice to read stories where managers are not complete assholes.  Good luck!",
            "I was waiting for the update!  YAY!  ",
            "Good for you:)",
            "Ok, cutest happy ending ever.",
            "AMAZING :)\nHappy for you guys!",
            "Yay!!!! I've been waiting for this update! Kudos and congrats!!",
            "D'awww.  Congratulations, OP!  So glad you sucked it up and gave it a shot. :)  Just focus on having fun and enjoying each others company.",
            "Yooper girls are so hot. If he is a dud i will make the trip!",
            "http://www.youtube.com/watch?v=_ST6ZRbhGiA",
            "The amount of squeals that came out of me while reading this was obnoxious. Congrats! :)",
            "See, reddit.\n\nThis is why we can have nice things!",
            "yay for you OP!! I'm very happy for you, I remember reading your original post too.\n\nI think things are gonna work out for you two, maybe down the road you should update us all again!",
            "Congrats! I'm super happy for you!",
            "It is so nice to see things like this, thank you for posting!",
            "Traverse?",
            "Oh my god I have a smile from ear to ear. I love reading about stuff like this. Congrats to you and great job making the first move!",
            "i'm glad you'll be dating through the fall. cos you're going to need a winter buddy that far up north. ",
            "So happy for you! Good luck!",
            "\"You come in every Wednesday on your lunch break I think.  On your lunch break I think...\"\n\nhttp://www.youtube.com/watch?v=_ST6ZRbhGiA&feature=youtu.be&t=3m34s",
            "I'm taking notes of this for when I ask out the girl I'm interested in lol",
            "I'm very happy for you.  Good luck and good for you for taking a chance.",
            "I feel like such i dork i was smiling the entire time i read this! so happy it worked out! :)",
            "D'AWWWW YAY!",
            "OMG, I'm so happy right now. I'm seriously grinning from ear to ear :P I love to hear stuff like this!",
            "This made me really happy and I don't even know you :') I wish you the best!",
            "Oh my lord I am so damn happy for you. I read the original post weeks ago and loved it! AWWWW I'm so happy! congrats. ",
            "Aww yay! Good luck to the both of you!",
            "I really like when stuff on reddit works out like this.",
            "Yay! This is so cool :) PS Michigan is awesome ;)",
            "I feel like this guy looks like ryan gosling and you look like rachel mcadams.  That dude is too smooth although then again, its a lot easier when the girl is into the guy.  Good luck you two!",
            "yaaayyyy!!! good luck :)",
            "I'm glad you didn't do what Alicia keys did in that one music video. It was creepy.",
            "I had a shitty day and this brought a smile to my face!  I hope there's an update a few years from now that includes a birth announcement.  :)",
            "This is beginning to sound like a kid rock song lol. \"All summer long\"",
            "Yaayayaayya! Sooo excited :) I'm literally \"Squee\"ing with joy for you. Rock on, ladyfriend!",
            "Yay!!! Reading this made me so happy. Good luck :D",
            "you could have done this...\nhttp://www.youtube.com/watch?v=_ST6ZRbhGiA",
            "OP you put such a smile on my face. I hope the two of you have a blissful time; you sound so cute.",
            "Please, leave him, move on, hit the gym... oh wait !",
            "Whoo! Go you :)",
            "OH GAHD THIS IS SO CUTE. I love this!!",
            "Omg stop acting so cute I'm vomiting. Lol jk. Nice Job! ",
            "This is too sweet. Good on you for going for it. ",
            "so cute and lovely, I am waiting for  my turn now, to be man up and approach beautiful girls... ",
            "YEEEEEE!!! I'm happy for you OP! This is like Alicia Key's song, You Don't Know My Name",
            "That's sweet. Hope things work out between the two of you. If,  or should I say when you start going out this guy and things get tough, just remember all those feelings you have now. Good luck",
            "I am glad you took the plunge. Nothing ventured, nothing gained.\n\nHope it goes well! ",
            "Awe that's cool!  Great update",
            "Congratulations! On two fronts even! Good on you for creating the opportunity and for the success.:) ",
            "This is absolutely cute! ",
            "Make sure he wears a rubber",
            "Just the tip, please. "
        ]
    },
    {
        "post_id": "43a3xg",
        "author": "licewife",
        "title": "[UPDATE]My (25m) wife (26f) has had lice for almost a year. How to handle this?",
        "url": "https://www.reddit.com/r/relationships/comments/43a3xg/updatemy_25m_wife_26f_has_had_lice_for_almost_a/",
        "score": 2346,
        "num_comments": 240,
        "created_utc": 1454092260.0,
        "selftext": "OP: https://www.reddit.com/r/relationships/comments/42lbdj/my_25m_wife_26f_has_had_lice_for_almost_a_year/\n\nHello. After several months of absolutely no progress, I really wasn't expecting to have an update for you all after just a few days but here it is!\n\nI talked to her when I got home and managed to find a few minutes alone without distractions and asked her for a status update on the lice removal. Long story short, I was met with another excuse as to why it would have to wait until next week and my foot came down. I don't think she took it seriously until later on in the night when we went to bed. I slept on our futon instead of with her and also turned her down for sex, which is something that I am pretty sure has happened only like twice in our entire relationship.\n\nThe very next day she called and made an appointment to get professionally de-loused. I went with to the appointment and they were able to check me as well. The woman did not find anything in my hair even with a magnifying glass and a UV light that apparently makes the nits glow. My wife was treated and is now lice free.\n\nWe talked afterwards about why it took so long for her to get it taken care of. Many of you were right; she was embarrassed, broke, discouraged from the hours we wasted trying to treat it ourselves in the beginning, and it was just easier for her to not think about it. Also, once we moved into my parent's house, she was even more embarrased and did not want them to know about it. Pretty much all of the at-home treatments would be a dead giveaway. She apologized, vacuumed, did all of our laundry and bedding, and we have put this annoyance behind us. We also checked our son when he got home from school and he's in the clear too.\n\nSo that's that! Still have to get to the bottom of why someone would think it's preferable to have lice than to deal with the embarrasment of people knowing you have lice, but I think that's one of those pesky communication things that we have to work on. \n\nThanks very much to those of you that responded with legitimate advice. I got over 100 PM's after my post was locked regarding lice treatments that you found successful lol. Since the last post got a ton more attention than I was expecting and the comments were like 60% misinformation about lice, I'll clear a few things up with info that I learned from the professionals at the delousing clinic (I hope this isn't against the rules):\n\nLice can't live anywhere except on a human head and they die about 24 hours if they are away. \n\nSince they die so quickly, it's not possible to have a \"lice infestation\" in your home or on your furniture. All we were told to do to make sure she doesn't get re-infected from a stray lice was to either stay away from unwashed pillows/hats/bedding for a couple days or to wash it in hot water.\n\nSome people are immune to lice and differen't \"families\" (the word the delouser used) of lice only like certain types of hair. In other words, it's entirely possible to live with someone with lice and not get lice.\n   \n**tl;dr**: Good talk, no more lice, still unresolved root issues, progress!",
        "permalink": "/r/relationships/comments/43a3xg/updatemy_25m_wife_26f_has_had_lice_for_almost_a/",
        "comments": [
            "[deleted]",
            "My mother used to say, \"If you ever come home with lice...just don't come home.\" There was so much disgust toward people who got lice, I really thought it was the most shameful thing that could happen to a person. I never got lice.\nI moved to California as an adult, where pretty much every child gets lice at some point in their school career, and my kids got it. I truly lost my mind. On top of that, they had it during a time when the Bay Area had a particularly virulent \"Superlice\" epidemic, so home treatments just weren't getting rid of it. It took a long time and many visits to doctors and after a few weeks, even a woman we hired to come to our home to professionally delouse the kids and home. \n\nLice do die fairly quickly when not on a host, and as long as the professional service got all the nits when she treated her, I think you're in the clear. ",
            "I had lice when I was a child. I'm actually kind of embarrassed to admit that it was a pretty traumatic experience for me. I had insane itching of the scalp and my doctor (who checked my head) gave me a \"shampoo\" for eczema. As a 10 year old that nobody was taking seriously, I was pretty frustrated. I was positive that what I had was lice - I could feel them running around on my scalp! When I would itch, I would also pick and finally the day came where I picked out a bug itself.\n\nTook a few weeks to get it taken care of... Never wished I could go to school that badly as during those two weeks. All this to say, I cannot imagine how it was easier for your wife to ignore it.. the itching is god damn unbearable.. Glad to hear she took you seriously, though.",
            ">differen't \"families\" (the word the delouser used) of lice only like certain types of hair\n\nLice have feet that are shaped to grip the hair shaft, and the ones that are shaped to hold onto straight hair (which is round) don't work with curly hair (which is oval) or kinky hair (which is almost flat) and visa versa all the way around.\n\n",
            "Excellent news!  I know this was really bugging you.  <cough>  Health and hygiene are more important than pride.  Now that they're gone, please reward her good decision with a full salon treatment, if you can.\n\nedit: they're.  Sheesh.",
            "A few years ago I was having some issues with my scalp itching and bleeding in places, so I went to a dermatologist. One of the first things he did was check for lice, and immediately said \"it's nothing to be embarrassed about, you'd be surprised by how many people live with lice and don't seek treatment because there's a stigma associated with having lice.\" \n\nMy issue was actually due to psoriasis, but how quickly the dermatologist brought up lice makes me think it's not uncommon for people to just kind of suffer through having that problem. ",
            "Well, this turned out better than I expected. Good on you for finally putting your foot down.\n\nMy only suggestion would be to keep an eye out for any lice in weeks to come. It's pretty easy to miss something when you have to wash *everything*. \n\n",
            "So, I live in a state that is very lice-prone.  My daughter (9) has gotten it 3 times and given it to me twice.  Please.  Please.  Please.  For the love of all that is holy - get a take home treatment and treat with the shampoo 7-10 days after her initial treatment.  If they missed two nits which happen to birth a male and a female, they may mate and cause reinfestation.  The life cycle is such that the nits hatch within the first 7 days of being laid, but don't become sexually mature adults until 10 days after hatching.  So if you kill them after they are all hatched, but before they reproduce - BOOM.  Done.  Forever.  Try to convince her to do this.  Don't listen if she said the place gave a guarantee that they got them all.  They only guarantee if you follow the aftercare!",
            "> Still have to get to the bottom of why someone would think it's preferable to have lice than to deal with the embarrasment of people knowing you have lice, but I think that's one of those pesky communication things that we have to work on.\n\nJust don't expect a *rational* reason. Her fear of embarrassment trumped her fear of lice, and her mind learned to shy away from even thinking about them. It's something people's brains just do, sometimes.",
            "Good work OP :). Glad you put your foot down and pressed for further communication. ",
            "I have had lice several times in my life and always got rid of them as soon as possible. My primary school (elementary school for you Americans) was really bad for lice because there was one family that would not treat their children so these massive lice were going about from peoples hair. I can remember having lice so many times as a kid. \n\nAnd my mum never caught them once. She's worked with patients (she's a nurse) and they have been 'crawling' with lice, her words not mine, and she would do a check and find she didn't have any at all. Some people just don't get them, whether it's their hair they don't like or what. Lice don't like hair products like gel, they don't like hair that gets treated regularly or straightened/curled (too hot) and some people have blood that they don't like. \n\nI'm glad to hear this actually got sorted OP as I was horrified in your original post that someone could go 8 months with lice in their hair. I think you definitely need to speak to your wife about why she thought that was OK and think about some sort of therapy. But nonetheless, well done on the progress made!",
            ">So that's that! Still have to get to the bottom of why someone would think it's preferable to have lice than to deal with the embarrasment of people knowing you have lice, but I think that's one of those pesky communication things that we have to work on. \n\nStigma is real, and hurts people by driving them away from seeking care.  Fortunately, this wasn't something that could really hurt her (though it was gross).",
            "Get a lice comb (you can also use a nice metal flea comb for pets) around and periodically run it through everyone's hair to just check.\n\nGet your own UV light so that you can continue to be vigilant.  You can get them for under $5 many places online.\n\nIt's very easy to get lice again, all you need to do is just miss one egg.  It took us 3 attempts when my son had them.\n",
            "I just don't buy this. I treated headlice professionally with a very reputable company and there is no way untreated lice for a full year wouldn't be totally obvious. Either she did try intermittently to treat it and that kept the louse population down, or this is a troll post. Also...lice nits do not glow, not in any light.",
            "You must feel so relieved. Thank god its over with. ",
            "I wasn't able to comment in the other thread, but I feel you. My daughter brought it home from a girl scout camp out and it took a while to get rid of. \n\nLots of people commented about how you do the shampoo and it's done. They're wrong - those treatments rarely work anymore. They also think that with your wife having it for so long that everyone will get it which is also wrong. One of the main reasons is that lice only survive off of the initial blood type that they were \"born\" into. \n\nGetting my daughter professionally treated was some of the best money I ever spent, even though it was so expensive. The woman who treated her was awesome and made her feel so much more at ease, plus she gave us a tutorial and showed me how to check her now. Seeing my daughter brighten up at having the issue gone made me mad that I didn't do it much, much sooner. ",
            "Wow, well glad it's resolved! Just for future potential outbreaks for anyone reading this, go out and pick up a 'Robi comb' as it is amazeballs. It's a lice comb that basically electrocutes them as you run  it through your hair; lice and eggs and it beeps when there's a 'hit.' My kids got lice a few times and the robi comb handled things 100%; easy, no poisons and damn effective!",
            "everyone who keeps saying you need to delouse the entire house.. that's for bed bugs, not head lice",
            "I don't think lice like black people hair. I dated this girl who was white and she had two mixed sons and a white one. The white one got lice, we didn't. We laughed. Apparently our hair they can't stick to or something. I'm winning at something at least 😁",
            "The jail (correctional facility) in our town had a year long lice infestation amongst the inmates. The lice were said to be like \"super lice\", so big you could see them crawling around in their hair. I was\nhorrified for their inmate population. It just seems so neglectful and inhumane to put them into a situation where they would be exposed to that (where they can't get away) and then not treat it properly. ",
            "Great update.  Suggestions about hats and laundry do not run counter to what you say. Lice obviously can crawl for up to 24 hours so things that are near a head need to be taken care of.  They do not live on like bedbugs, in colonies in beds, but even bedbugs need to eat frequently.  \n\nI never thought about it but what exactly do live eat???   Anyone know?\n\nGlad your wife got treated and that you are so understanding.   ",
            "Good to hear a happy ending and get some fun facts about lice.",
            "Congrats!\n\n&nbsp;\n\nOn a similar note, I kinda know your wife's pain.  When I was in my early 30's, my kids brought home lice.  I'd never had it before and nothing worked.  Instead of going the route your wife did, tho, I went in the opposite direction.  I was bound and determined that I was going to get rid of them and make those little fuckers pay.\n\n&nbsp;\n\nWhat I found was an electric comb.  It's battery powered and it electrocutes every one of the little fuckers, killing them.  It killed every thing: eggs, larvae and adult.  It also makes a very satisfying squeal every time it hit one, allowing me to imagine them screaming as I electrocuted those little bastards.",
            "\"So that's that! Still have to get to the bottom of why someone would think it's preferable to have lice than to deal with the embarrasment of people knowing you have lice, but I think that's one of those pesky communication things that we have to work on.\"\n\nThat isn't \"pesky communication\".  This will come up again in some other form.  You need to get to the bottom of it while there isn't something else going on",
            "Once time has passed and you guys can laugh about this, can you please make a joke about the time she was a \"lousy wife\"?",
            "I think a lot of people conflate lice with other nefarious pests (such as scabies for example, which can infest an area and require a fairly serious intervention).  Thanks for bringing the information as well as the happy news!",
            "I lived with a roommate that had a child and she got lice on many occasions. I never once got it. People can definitely be immune.",
            "if it happens again, try hair straighteners! ",
            "Good on you, sir, for getting that done, and good luck with everything.",
            "I'd still keep up post-treatment, precautionary measures. Try the 'nitty gritty' comb, use with conditioner once or two a week to prevent further outbreaks.",
            "Once you've tried everything that has worked for everyone else, and it doesn't work, you feel like there is something wrong with you. That you are a terrible failure and especially gross since regular treatments didn't work.\n\nEventually you feel that you deserve to live with the pain and torment, so you do.",
            "It's great that the lice issue has been resolved, but I'm with you on this:\n\n>Still have to get to the bottom of why someone would think it's preferable to have lice than to deal with the embarrasment of people knowing you have lice\n\nYeah.  This is strange behavior, especially considering that she knew *you* knew about the lice.  Even if nothing like this has ever occurred before with your wife, she might want to talk to someone.  Perhaps you guys could try couples counseling, since she's unlikely to speak to anyone on her own?\n\nI'm not sure if therapy is an overreaction, but I would be ***so*** weirded out by my partner behaving in this way.",
            "I am so glad you got it taken care off! I had a friend who actually cut her hair short all the way, and then applied mayonnaise for them to go away. She used wigs for a while, but now she is completely fine, and beautiful long hair. I would post a picture of her back then and now, but she would hate me forever. ",
            "Could you comb her hair for her, massage her head, make her feel beautiful the other thing is a hot iron, depending on her hair flat ironing her hair daily will not only look beautiful it will break the cycle by killing the lice and scorching the eggs ",
            "This seems like an example of \"catastrophizing\".\n\nShe's blown up something in her mind until a small issue seems insurmountable. So the question is, have you observed this reaction to any other issues?",
            "Make sure you wash and/or get new combs/brushes/elastics etc and put anything that can't be washed in a bag for ten days :) \n\nI'm glad that you guys were able to sort things out, keep up that communication going forward! ",
            "Think you for the info about lice, TIL! I'm happy for you and your wife that you can finally put this behind you.",
            "So, so glad to hear that you got a good update.   I hope you never have this stress again!",
            "Nice man, glad you got it worked out, have a good weekend.",
            ">Some people are immune to lice\n\nYes, in our family the kids had lice two or three times and my wife also had trouble, but my thick hair (thanks African ancestor) was apparently too unattractive.",
            "I'm glad it worked out! Thanks for the lice info too",
            "Let it be known. It's rare that withholding sex to get what you want would actually be justified.",
            "Yay! Ok now take her out to dinner and give her a card saying how much it meant to you.  Reward the good behavior",
            "I'm glad this turned out well, OP.\n\nHey everyone else, general life protip here: if you can afford it, call a professional the first time. It'll save you so much headache.\n\nAnd for other pests, hassle your landlord! Get other tenants on your side too. They take your rent every month, they can afford to pay an exterminator.\n\nThat's it. Sorry to post off topic.",
            "dont forget to spray your car!  ",
            "Glad it worked out!",
            "I'm glad you got it resolved.  At 18 years old as  as a senior in high school, I got them from my sister's inlaws.  One of the young 3-4 year old was sitting on my lap and my waist-length hair was down.  A few days later I'm taking a shower and can feel it on my scalp.  I screamed and my mom thought I fell.  Long story short, we got rid of them and the most embarrassing moment in my life was having my high school principle check my scalp with gloves so i could go back.  ",
            "I'm so so very happy things worked out for you two! ",
            "The issue your wife is having is that she has a low self-worth and values your family's financial success over her own welfare.",
            "I'm surprised anyone could live comfortably for that long with lice, I remember when I was a kid I would scratch enough to cause minor bleeding sometimes. I'm glad she finally got it taken care of, I hope this doesn't happen again.",
            "Great update! After reading the OP, I was concerned that your wife may be suffering from a possibly undiagnosed depression. I'm glad that the issue is now resolved, but I don't know either of you personally (obviously), so I don't know if that is something worth pursuing with a therapist. ",
            "Damnit man!\n\njust the topic makes me all sorts of itchy! Good on ya for getting this straightened out. ",
            "That's totally awesome. Good for both of you.",
            "I lived with my foster sister for a while and she had a family she took in with us as well. That family constantly had lice. Every month was a infestation on terrible levels. The oldest child had thick, curly red hair and was the worst (he was patient zero). \n  \nAfter 5 months of lice I managed to talk him into shaving his hair off. It was disgusting. With every run of the clippers hundreds of bugs fell onto the floor. Every male in the house got buzz cuts and patient zero was the worst. The girls got a bob cut and I spent hours combing through their hair and tossing the nits and lice into boiling water. My foster sister opted to get a buzz cut as well. \n  \nI was the only one not infected during this ordeal and I still don't know how.",
            "My kids got lice a few times and the first time, I was full panic mode, could not sleep, itchy all over, chemical treatments, fine comb w/ picking out the nits. \n\nThen I read an article that blow dryers kill lice and their eggs. Basically I blow dried the roots of my hair and my kid's hair every day for a few weeks and went through our hair with a flat iron, and then they all died. Lice don't really live on clothes and sheets so if you wash your sheets regularly anyway, they won't come back.\n\nLice is one of those things that really do more psychological damage than having it. I can see why she was embarrassed and didn't get professional help - it's not threatening to your health, it's just gross. Freaking out about it can make you go into denial.",
            "I mean... Congrats on getting it fixed. I still can't believe she lived with it for so long.",
            "When I was a kid, I got lice a few times and my family was never affected. The only thing that ever worked was olive oil. ",
            "I had lice like a billion times when I was a kid and if my mom had only known we didn't have to go into full on quarantine (bagging clothes and toys, bleaching linens, etc.) several mini-breakdowns could have been avoided. Thanks for the delousing pro tips. ",
            "So glad everything's taken care of and she's clean. I also learned some new info I didn't think I needed to know but maybe it will help in the future!\n\nHopefully she can talk to you or a counselor about the root of her reasoning. \n\nHappy Update!",
            "OP, I'm glad the issue was resolved, but damn. I somehow got lice twice in my high school years and it was the most excruciating thing. The itching was almost unbearable the first time when I didn't know I had it and I had peak infestation. \n\nI have no clue how she lasted so long. ",
            "Don't they make shampoos?  I got lice as a kid 20 years ago and that's what we did.  \n\nSeriously, it takes a half hour at most.  Far cheaper than going to a doctor.",
            "Thank you for the update and glad to hear it was pleasantly resolved. You should do something really nice for your wife and let her know how much you love her and that you only want her and your family to be healthy, wealthy and wise. Best wishes to you.",
            "Glad it worked out, OP.\n\nI've had live a handful of times (why meeee?!) and I've found that the thing that works for me, of all things, is dog shampoo.",
            "Boil some beer, wait until it cools off a bit, pour it slowly on her head and watch those fuckers slowly die. ",
            "When i was a kid I think I ate a louse... No lie... It was in my hair and i picked it out and ate it.. I was a strange 5 year old. ",
            "[deleted]",
            "I can't believe how ridiculous this whole situation was. I'm glad she got it taken care of but I think she still has a lot to work out on why she thought it was acceptable to neglect herself to the point where she had lice for a YEAR. That shows some serious mental instability.\n\n And I know it wasn't your responsibility, but I'm also a little bit concerned for your own mental stability that you let it go on for that long when you have children, family, and pretty much anyone you come into contact with. I don't agree with you making excuses like, \"well some people don't get it.\" Let me just tell you that I have gotten lice as an adult and it freaking sucks. I either got it from an airplane, movie theatre, or nail salon. So fuck the person who came in with lice and gave it to me. Luckily I took care of it right away so no one else would be subjected to that madness.  ",
            "People can be embarrassed about a lot of health issues, sometimes it's even the fear of getting \"treatment\" you don't want. For example when I was a child, I had grown-in nails on my big toes. NOBODY was allowed to see my feet for 7 years, because it looked really disgusting, and when I finally asked a doctor she said that it's most likely untreatable and surgery(cutting half of the toe away) would probably be the only way to do it. Welp. I asked my mom to do a quick Google and she told me the chance of the toe really being \"good\" after that procedure was not that big, and tbh I didn't want to lose half of my big toes. Well fast forward a year and after putting 80%-ish alcohol on it every day it's gone.",
            "I had lice when I was a freshman in high school. I could feel those things crawling around me and they wouldnt leave no matter how many treatments I had. It drove me insane to the point where i was breaking down every day about it. \n\nI was ashamed so I tried to do it myself, but like how the fuck does someone be so ashamed they have it for YEARS. And i'm sorry, but even if the lice die within 24 hours it's so easy to pass on. I lay my head down on the pillow, there is nits and lice on it. All it takes is someone else within those 24 hours to lay down on the pillow as well. Not to mention when I would scratch those buggers would come off as well. A lice \"infestation\" no, but when you have someone who has them moving around all day in a house it's really surprising how you guys never got any. \n\nLice do love clean hair, though and I wish people wouldn't assume that just because I had lice didn't mean I was dirty. ",
            "FWIW, over the counter lice treatments are not 100% effective.\n\nEven prescription remedies can lose their effectiveness if the population getting treated are not wiped out completely: any that escape alive are apt to be resistant, a trait usually passed to offspring.\n\nGlad you got it squared away- it is indeed worrisome that it took so long.",
            "Uh, gross. You better hope she never gets scabies.",
            "nasty"
        ]
    },
    {
        "post_id": "4ndk3q",
        "author": "Jwu28jsl",
        "title": "[Update] Boyfriend [25M] and his sister-in-law [28F?] sneaked out to the beach at 3am.",
        "url": "https://www.reddit.com/r/relationships/comments/4ndk3q/update_boyfriend_25m_and_his_sisterinlaw_28f/",
        "score": 2345,
        "num_comments": 199,
        "created_utc": 1465514828.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/4mo80h/boyfriend_25m_and_his_sisterinlaw_28f_sneaked_out/\n\nHey again.\n\nAs much as I wanted to tell you all that it was over nothing, that they just wanted to get some air or smoke some weed or something, not the case. They were indeed fucking.\n\nI asked my boyfriend about it. Didn't mention that I saw him go out with her, just that I saw him leave the bed and come back later. He told me that he just went to pee and then saw his dad in the kitchen who couldn't sleep and they had a chat for a while. Liar.\n\nI asked his sister in law immediately after that, said that I saw her from the window for a second. Was I just imagining it since I was half sleep or did she go out \"alone\" that time of night? She said that she enjoys midnight breaths and alone walks on the beach. Liar again.\n\nI told his brother that I saw them leave. He told me that they enjoy long walks on the beach. He couldn't be bothered to go with them. I thought liar.\n\nSo apparently they gave each other the heads up since my boyfriend came to me and told me everything an hour later. Him and his brother like sharing their girlfriends and SOs. He's been fucking his sister in law for years now. That night was just another moment. He told me that he wanted to tell me when the time is right or when he thought I'm prepared so that I can join in and sleep with his brother so they don't even need to sneak around.\n\nHe wasn't even admitting that it was cheating, saying that it doesn't count since it's his sister in law not some random girl. I don't even know what to say to that. He called me traditional for thinking it was cheating. Yeah. I consider having sex with anyone else cheating, call me traditional.\n\nSo I broke up with him and left him to deal with his weird shit with his brother and I'm actually happier now. The thought of what he was up to all those times grosses me out completely. He can fuck himself. We wanted to go on a holiday together, now I'm gonna go have fun with my cousins instead. \n   \n**tl;dr**: They were fucking. His brother knew. It was their thing. They wanted me involved too. No way. We broke up. Fuck them all. ",
        "permalink": "/r/relationships/comments/4ndk3q/update_boyfriend_25m_and_his_sisterinlaw_28f/",
        "comments": [
            "Holy shit, well that didn't even go close to the way I thought it was.  I figured maybe a surprise for you for a year's anniversary or something. \n\nGood on you.  This is hard, I know, but remember this is a good thing.  Better you find out now, than years from now after further investment. \n\nGood luck to him finding someone that isn't so 'traditional' to be upset at finding out your monogamous partner is fucking someone else, what a skeeze. ",
            "It would take all my power not to warn his next ex-girlfriend.\n\nBut seriously, for fuck's sake, date swingers if you're gonna pull that shit.",
            "Do take the time to go get checked out for STDs. ",
            "innate books friendly plants doll teeny uppity cooperative dime angle ` this message was mass deleted/edited with redact.dev `",
            "Ew, what? No!  \n\nYou sound very detached, which is good-ish, you know? Feel your feelings, though. You're gonna have a lot of feelings. Let them come, feel them fully, and let them go.  \n\nHonestly, this is the wildest possible outcome, really. It's awful now, but in 10 years this will be your back pocket story when someone asks you \"who's the worst boyfriend you ever had?\" People will buy you a goddamn beer for this story, girl.",
            "Nooooooooooooooooooooooooooo!\n\nI was so hopeful for a non creepy innocent outcome! Why did it have to be so weird and wrong?  Why Reddit?? WHY??",
            ">now I'm gonna go have fun with my cousins instead.\n\nGiven the weird sexual shenanigans of your post, I don't think this sounds the way you meant it to sound.",
            "I'm in a \"non-traditional\" relationship (polyamorous). What he did is definitely cheating, he can't hide behind that \"traditional\" bullshit. Cheating derives from braking rules, he broke the rules of your relationship, therefore he cheated. SIL is not cheating because the rules she has with her husband state she's allowed to do that. She is however a dick for not checking with you what rules you had with your (hopefully now ex) boyfriend.",
            "Alright. If he's into that shit fine, why couldn't he just be honest about that from day one? Sounds like he and his brother get off on convincing the sort of girls to do this who otherwise wouldn't have. Pretty sick. You dodged a bullet.",
            "If he's looking for someone whose into partner sharing then I think that should be made clear before any sex happens between him and the new SO. ",
            ">He told me that he wanted to tell me when the time is right\n\nHAHAHAHAhahahah..... nooooooooooooooooo. Trying to make himself look better? looool. Good on ya, OP!",
            "> He told me that he wanted to tell me when the time is right or when he thought I'm prepared so that I can join in and sleep with his brother so they don't even need to sneak around.\n\nWhat the fuck, it's still cheating! That is not how polyamory works, all parties involved need to be informed and consent. That family is messed up.",
            "That is so horribly gross, wrong and disrespectful. I'm happy you're out of there. I hope things improve for you soon.",
            "*now I'm gonna go have fun with my cousins instead.*\n\nDon't have too much fun. That's how things got started for your ex and his bro",
            "The very very vindictive side of me would want to somehow let their parents find out about the brother's \"little arrangement. \"\n",
            "Well that was unexpected. \n\nDodged a bullet there OP",
            "> He wasn't even admitting that it was cheating, saying that it doesn't count since it's his sister in law not some random girl. I don't even know what to say to that.\n\nPeople make up all kinds of crazy in their own minds to absolve themselves of responsibility.\n\nIts really a simple equation. Was it agreed? Yes / No.\n",
            "Although granted this is not the weirdest sexual relationship I've heard of, the fact that this whole arrangement wasn't laid out plainly from the get go is rather appalling. \n\nThere are plenty of people who are into this sort of thing. He could have dated any one of them ",
            "I get that sharing is caring... but he had his cake and was eating it too and didn't share it. \n\nFucking behind someone's back without their knowledge = cheating\nFucking behind/in front of someone's back with their knowledge= kink",
            ">now I'm gonna go have fun with my cousins instead.\n\nNot the best phrasing after typing up a post about a weird semi-incestual relationship.\n\nAnyway OP, you did good leaving that jackass. I really hope you find someone who actually deserves you, good luck.",
            "You know, maybe I could see this as acceptable if all 4 people involved agreed to it before anyone fucked anyone (still messed up sharing SO IMO), but oh my god this is fucking disgusting that he was \"prepping\" you for this. This is cheating. Straight up cheating. Tell this guy good luck finding someone who would be okay with this. Oh my god. Wtf!!",
            "My mouth literally dropped open reading this. Holy shit. I am so sorry.\nBut good for you getting out of that whole mess. Can't believe he wasn't even apologetic about it.",
            "[deleted]",
            "Told ya, at least you get a new life, good luck and keep your head up. It'd be nice if relationships didn't down vote to high hell for being frank.",
            "It's cheating on you because you were unaware of it and not a party to their arrangement. There's nothing wrong with non-monogamy as long as all parties are fully aware and consenting.\n\nYou were not, and he knew you were not, so of course it's fucking cheating. Asshole. This  is the kind of thing that you let someone in on at the beginning of the relationship. ",
            "What a bunch of fucking assholes liars. Your ex can't even accept responsibility like an adult. Glad you dumped him.",
            "Wow. Just wow. Do the brothers get into it with each other as well? I'm pretty speechless. You dodged a ballistic missile of drama on this one.",
            "[deleted]",
            "That's some weird shit. He should have definitely disclosed that he was sleeping with another woman, not to mention who, considering he was also sleeping with you. I would get tested, just because they seem very lax and even weirded out that you didn't think it was the norm for brothers to \"share women\". ",
            "Well that escalated quickly!!",
            "I wonder what would happen if you told the parents.",
            "I would never shag a girl my brother(s) had been with. Call me traditional but that is straight up gross.",
            "That's...really weird. Sorry to hear that.\n\nOn the bright side, it'll make for a hilarious story to tell your girlfriends over cocktail a few years down the road, when you're in a relationship with someone \"traditional\" like you.",
            "I...did not see that coming, gotta say. I feel sharing SO's is really something you should clue your SO into before your relationship gets serious. Sorry about the shitshow OP, have an excellent time with your cousins.",
            "Well that took a hard left into Borderline Incestville. \n\nGood on you for dumping the skeeze. ",
            ">Fuck them all.  \n\nOr not, rather. (Sorry - had to.)",
            "Well, at least you got to date a Lannister.",
            "That's fucking creepy.  Good thing you found out when you did.",
            "In my book, there's nothing wrong with group relationships, or open relationship, or anything like that - so long as everyone knows! It's cheating because he lied to you, simple as that.",
            "Jesus fucking christ, good on you, find yourself a nice man with adequate levels of fucking sanity",
            "Every time I think I've read it all on this sub...",
            ">Him and his brother like sharing their girlfriends and SOs.\n\nGahhh.  Glad that you found out now.  Sorry that you're going through this.",
            "Ew, ew, ew, ew, ew, ew, ew, ew, ew. So very much ew. :( No advice beyond STD testing, sorry. The ew portion of my brain has overtaken all other cognitive functions. ",
            "WTF? Wtf? OMG. \n\nOkay- OP, happy you tossed that loser to the curb. What arseholes.",
            "If I were you I'd have told his parents",
            "Creepy update! A straight up affair probably would've sounded better tbh.\n\nGood luck moving on OP!",
            "what. the. fuck. \n\nWhat a skewed perspective. He's still sleeping with other people without the consent of a partner, how is that not cheating? What a scumbag. Good for you for telling them all to kick rocks. Feel sorry for the rest of the girls he's ever with.",
            "Lol he was lying to you about it so clearly he knew that what he was doing was wrong.\n\nGet checked for STDs please",
            "I wasn't expecting a happy update cause I thought you had talked to him, he admitted cheating and you dumped him... But wtf, that escalated quickly!\n\nEdit: Add info.",
            "I'm just picturing the McPoyles from Always Sunny in my head. You definitely dodged a very, very weird bullet here OP. I know you're upset but at least you will have a great story to tell in years to come.",
            "I think your ex and ex-in-laws misunderstood the meaning of when you marry someone you marry their family. \n\nThat said I'm glad you found out the truth and sorry you had to dig for it.",
            ">So apparently they gave each other the heads up since my boyfriend came to me and told me everything an hour later. Him and his brother like sharing their girlfriends and SOs. He's been fucking his sister in law for years now. \n\nI feel like that should have been something that was rolled out earlier.",
            "I just physically had to shut my own mouth.  ",
            "I would be vindictive  and send his parents a thank you note for the weekend at the beach - say goodbye and then mention the weird arrangement their sons have.  ",
            "well that's enough Internet for me today.\n\nGood for you OP, what a weird fucking situation.",
            "...last I checked it still counts if you cheat with YOUR BROTHER'S GODDAMN WIFE. \n\nSwinging's only okay if everybody's okay with swingin'.\n\nWhat even is this world. ",
            "You win for the best, most awkward update ever.  Wow.  ",
            "I know this is hindsight bias, but I honestly didn't get the people in the last post who thought they were just planning a surprise or whatever. There are less sketchy ways to plan a surprise for someone than to sneak out to the beach at 3 AM. That said, so incredibly sorry. What kind of insanely bullshit \"justification\" is that? They are sad creeps denying the reality of their actions.\n\nI'm sure their little arrangement will work out super well, btw. No chance anyone will catch feelings or anything /s",
            "Nothing wrong with wanting to play Sister Wives, but usually you tell the person you are dating. Also, awkward if SIL ever gets pregnant. This is too cult for me, personally. Glad you got out.",
            "He used the weird traditional, as in insult \n\nSo sleeping around has gotten to be that normal now?! \n\nThe euros needs to be flooded again, geez",
            "Wow that is gross glad you found this out now before it got more serious.",
            "All people cheat! \nMentally fucking someone else is cheating...\nFlirting with friends is technically cheating...\nHaving random thoughts of other people you are friends with rather sexually or not... is technically cheating...\n\nYou dodged a bullet, because of a lifestyle you did not want. \n\nBut don't  act all high and mighty about the sexual situation, because you don't care for it. \n\nYou said girlfriend not fiance.?.? \nChances are you are nearly just a toy for his brother...\nWouldn't get a big head about the situation, seems like you might have been just part of the fun that weekend. \n\n\n\n",
            "Waiting until later to mention something so important is also traditional. A traditional way of being an apathetic cheater only looking to post pone responsibility, and in this case enjoy a relationship that never would have began if you had known this.",
            "Well that took a turn.",
            "What in the holy God fuck ",
            "Wow. If that works for them, fine. But he clearly knew you wouldn't like it or else he would have been upfront about it. Fuck that noise. I'm all for the polyamory thing, but only when it's honest and *everyone* is OK with it.",
            "Well, sheeeit.  I was thinking they were heading out to watch turtles lay eggs in the sand or something.  The real story is a lot more creepy.  Yuck.",
            "Better get yourself tested.",
            "Oh damn. I was expecting an innocent explanation. I'm really sorry it happened like this :(",
            "Oh my. I was among those thinking there was an innocent explanation for it. This ..well. I have no words. Enjoy your freedom & vacation OP",
            "Ok so that was about a 1000 times worse than I thought.  \n  Good for you for dodging that bullet.",
            "Ugh. And what's worse is that he expected you to happily join in with the 'family fun'. That's like grooming.",
            "Eww, that's just gross. If sharing is their thing, sure, but you don't just try to \"ease\" an unwilling/knowing partner into it.  That's the sort of shit you advertise upfront so you can attract someone of similar interests.\n\nThey're all skeevy as hell for treating you that way.",
            "What did I just read. Is this even real?  Someone tell me this is a troll post because otherwiss that's just horrible for you. I mean,  to each their own but you might want to give a person a heads up earlier about this instead of being so shady and wasting people's time because he was already cheating the moment you guys became a couple.  ",
            "I really wasn't expecting this to be the outcome. ",
            "Whaaaaaat the fuck? That's some crazy shit right there.",
            "OMFG.  That is just icky.",
            "Ew\n\nEeeeeeeeeeeeewwwwwwwwww D:",
            "Wow, it was unexpected. Strange things happen. We always want to assume the best of humanity and then things like this happen.",
            "Holy shit I thought they were just getting high. ",
            "I'm calling fake.\n\n\"His brother said they like to go on walks. I thought 'liar'\". So you instinctively thought his brother was in on their cheating, rather than being in the dark? Who assumes that? Your first instinct should be that his brother doesn't know, not that he is also lying to you.\n\nYou fucked up the timeline. This is fake.\n\nEDIT: Seriously? Mass down-votes with no explanation? Did I miss something, or are you people just desperate to believe any and every story that you shoot down anyone with an ounce of reasoning?  Because if I really did miss something and someone points it out to me, I'll gladly recant. But as of now, this is fake as fuck.",
            "[removed]",
            "[removed]"
        ]
    }
]