[
    {
        "post_id": "4ynx3a",
        "author": "reasonihate",
        "title": "I [24F] found out my best friend [24F] had sex with my boyfriend [26F]; I'm upset and can't believe it",
        "url": "https://www.reddit.com/r/relationships/comments/4ynx3a/i_24f_found_out_my_best_friend_24f_had_sex_with/",
        "score": 2333,
        "num_comments": 172,
        "created_utc": 1471679173.0,
        "selftext": "I don't where to begin. I feel so embarrassed coming here and asking for advice.\n\nMy boyfriend Steve and I have been dating for over a year in a half. I met him in one of my upper level classes two years ago. At the time he was finishing up his degree, before moving on and working on his masters. Since we started talking, seeing each other, and dating casually; I really loved our entire relationship. Steve and I had a lot of similar interests, which included traveling. We did a small trip to South America a couple months ago for a few weeks (Peru and Chile). We had an amazing time! It was once we got back form our trip that I saw our relationship in a  whole different way. We travelled well together, and bonded in a new way. I knew I was in a great relationship! \n\nI thought we had a great relationship, until I got some news a few days ago.\n\nThree days ago, I went over to drop a macbook charger over at my best friends house, Chenelle. Chenelle and I have been best friend since we were in high school from the age of 16 years old. I have always considered her to be my number one, and closest person in my life. I have noticed that the past 6 months we haven't hangout in the same capacity that we usually have. Both of us have been busy with our lives (school, work, relationships, etc). But, I kinda got the feeling after this past year of university around April, that she was starting to drift. She had a shitty relationship with her ex that lasted under a year. He cheated on her with a coworker, and the rest is history. They broke \"officially\" around the end of January.\n\nAs I went over to drop off her extra charger that she borrowed, I talked with her mom for a bit. Chenelle ended up getting called in to pick up an extra serving shift at the restaurant she has worked at during her degree. Her mom wanted to talk to me about a few things. I was puzzled.. Chenelle's mom was always really outgoing and funny. We had known each other for over 8 years at least. But, she wanted to have a serous talk.\n\nChenelle's mom, \"Karen\", went on to tell me that she saw Steve and Chenille sneak around the back of the house about a month or so ago. Karen went on to explain that she noticed this happening two other times. At first, she thought we were all hanging out. But, Karen told me that she got a weird gut feeling on this situation. She told me that I should talk to Steve and Chenelle ASAP. \n\nSteve and I were supposed to go out for dinner last night. He picked me up, and off we went. I felt really gross and humiliated the entire time we were out. We ate dinner, had a couple drinks, but we didn't talk much. Steve kept asking me all night what was the matter. I told him \"nothing\".\n\nFinally, when we got back to my place, we sat in my room and I asked him. I asked him, and told him what Chenelle's mom (Karen) told me. He didn't answer. In fact, he went pale white. That gave me the answer I needed. I broke down and Steve tried to comfort me. I didn't want him touching me. I didn't even want to hear it! I told him to leave, but I basically had to force him to leave. I tried calling Chenelle and texted her that I needed to talk to her. I got no response. Not one. Basically, two of the closest people I have had in my life betrayed me. This is so terrible and I feel so shitty. I have like no one right now.\n\nSorry for all of the grammar and title mistakes.\n\n  ---   \n  **tl;dr**: I [24F] found out from my best friends mom Karen [late 40ish] that my best friend Chenelle [24F] had sex with my boyfriend Steve [26M]. I am so upset, and I can't believe it. There is more detailed information in the post - sorry. I really don't know how to move forward and proceed in this situation. ",
        "permalink": "/r/relationships/comments/4ynx3a/i_24f_found_out_my_best_friend_24f_had_sex_with/",
        "comments": [
            "Wow, Chenille's mom did you a solid beyond what any normal person would do.  She's the hero in this story.... but I think that this story might have a very shitty middle... but a happy ending.\n\nDump Steve.. and your ex-bestfriend.  These two people betrayed your trust and showed their true colours.  You will NEVER have self respect if you let these two people stay in your life.  You didn't do anything to deserve what happened and you deserved a lot more from both of them.\n\nSo... in short... start over.  This is your chance to find two better people in your life.  I would personally make sure Steve came and got his stuff.. or... you got your stuff and moved out before Monday... and I would block all contact from him.  I would simply never speak to Chenille again and send Karen flowers thanking her for saving you from her daughter and a horrible relationship.",
            "[deleted]",
            "Count your blessings that you found out at 24 and not later on in life that your friends a home wrecker. Cut them out.",
            "I would ghost Steve, to be honest. He doesn't deserve any sort of closure.\n\nI'm sorry this happened to you, OP. Cut them both out of your life. Let mutual friends know what happened, so that they know who they're dealing with.",
            "1.  Cut all contact with both of them right now. Don't tell them you're cutting contact, just do it. They need no explanation from you. \n\n2. Buy Karen flowers or a thank you card, or even a bottle of wine or beer. You know her best. She really did you a favor that not many people would have done. You owe her that. \n\n3. You need to tell mutual friends what happened. As many as you can, but confide to them from a place of hurt and friendship. You need to do this because I would not put it past your ex-best friend and ex-boyfriend to lie, but you'll also find from your friends support and empathy (if they don't, then you know they're not your friends). But tell people your side of the story. It will help to talk about it and you'll find friends who support you. You're not alone in this. Also tell your family. You need all the support you can get right now. \n\n4. Focus on yourself. Cry all you want. Eat what ever you want. Binge watch sappy movies on Netflix. Whatever. And when you're done and feeling a little better (you won't feel much better, but you'll feel a little better) start hanging out with friends and family. Start FORCING yourself to get out of the house. You'll literally have to force yourself, I've been in your situation. Go to the gym, go shopping, volunteer at the humane society with kitties and puppies, hang out with friends at every opportunity and at the end of the day...it's okay to just cry. Day by day you'll start to feel a tiny bit better. \n\n5. Absolutely. Never. Talk. To these two people again. Never. Ever. \n\nLots of hugs. And you're not alone. Absolutely do not feel embarrassed. Feel angry, feel upset, feel hurt. But do not feel embarrassed. You have no reason to. You did nothing wrong. Absolutely nothing wrong. The embarrassment is on them. 100%. \n\nYou've got this, lady! You can do this. ",
            "Karen is the true friend here. She could have covered for her daughter and said nothing, instead she did the right thing. Unload your friend and your BF there is no coming back from this. I am very sorry this happened to you.",
            "I was in a very similar situation many years ago and I tried to forgive everyone involved because I thought it was the right thing to do.  It didn't work.  My former best friend and I became very competitive about everything.  I never trusted my ex again.  And I was miserable until my life situation changed enough where I didn't have to see either of them on a regular basis.\n\nLeave them behind and move on.  You deserve better.  And consider traveling on your own if you feel comfortable doing so - it was a very liberating experience for me.",
            "You've got to be a real scumbag to bang your best friends SO.  Good riddance. ",
            "My boyfriend of seven years cheated on me with one of my best friends  and all I can say is leaving them and cutting them out of my life has been the best thing for me ever! I am a million times happier than I ever thought possible. It so sucks that people so close did that. But don't worry your life will be so much better. Keep busy and work on doing things you love.  Go out with other friends and make new ones! If you ever need to talk PM me. ",
            "First of all, her mom awesome.\n\nSecond, I would ghost him so he gets no closure. Since he doesn't even deserve it.\n\nAlso *Hugs* ",
            "Hugs. Sounds like he already gave her a heads up and she's too scared to face you right now.\n\nGive yourself some space. You've only just found out about this and it's going to take a while to process this. Perhaps talk it over with a therapist if you're having trouble moving past the hurt of it. For now, talk it over with someone you can trust.\n\n",
            "Don't let this experience cloud your views going forward.  This is a grotesque betrayal beyond the norms but there are still good friends out there and you deserve them.",
            "Karen is a model human being. I hope her daughter learns her damn lesson from this: when your own family won't defend your shit deductions, it's time to make better deductions.",
            ">Basically, two of the closest people I have had in my life betrayed me. This is so terrible and I feel so shitty. I have like no one right now.\n\nBut Chenelle's mom did the opposite of betray you in fact she stuck her neck out even though it went against her own daughter.\n\nI'm so sorry you are in this situation because it is truly fucked up and awful. And it is a huge betrayal. It absolutely sucks. People do betray us and act shitty and it can really fuck with us.\n\nI just wanted to point out the one ray of hope here. ",
            "Karen is a true girl friend. Sadly, her daughter is not. Chenelle is a coward for ignoring your calls.\n\nCut Chenelle and Steve out completely and start fresh.\n\nI hope you don't lose faith in people after this, though. Karen showed you that there are good people out there.",
            "Step#1 Cut out Steve and Chenelle\n\nStep#2 Buy Steve's mom a bottle of wine or a six pack\n\nSteve's Mom was awesome and didn't hesitate to tell you her suspicions. As for your \"friend\" and your bf: they both decide that their temporary pleasure trumped their relationship with you. They had absolutely no problem lying, cheating behind your back and potentially exposing you to STD's (you should get tested). And they would have continued to do that if they didn't get caught.\n\n I know that doesn't make the here and now better, but if you ever get an inkling to bring them back in your life you should remember that. They aren't looking out for your best interests, just their own, and that's what you should be doing now. Focus on yourself, drop the trash, and work on moving past this all. That includes blocking them both on everything (facebook, emails, texts/phone). No need to listen to their lies and rationalizations for betraying you. ",
            "I would ghost Steve, too.  No way can you ever trust him again.",
            "Listen OP, this is a shitty situation. I understand how upsetting it is to feel like you've lost very close people.\n\n However, that being said, you are 24 years of age. Not sure why the universe works this way but I know a lot of individuals who have to do a complete reset of friends around this point. I think that this time is when people change and grow up to bigger things, or stay steadfast in that early 20s mindset.\n\nDo yourself a favor, pick your head up and move on. Don't look for explanations or reasons why this happened. There aren't any. Don't hold grudges. Move on. Make choices that empower you and make you happy. \n\nYou only have this life to live and you should do it the best possible.",
            "Karen is a fucking legend, fair play to her. \nI'd get rid of the other two and be glad that you found out now rather than investing any more time and feeling into your pos,  fuck nugget bf.",
            "i had a similar situation. i know its hard to let go, just do the best you can to let go.",
            "Tell her mom thank you because she didn't have to tell you this. She saved you a lot of time wasted on this cheater. Ditch the guy and your friend, there's no going back from this",
            "I had a similar situation with my ex. We got along on so many levels and I really thought I'd found my other half. But I was so very wrong. It took me taking him back many times and all of the same betrayals to happen many times before I finally realized that he really didn't respect me enough to keep his dick in his pants. I blocked the friend on every social media and any other way possible. \n\nI strongly suggest cutting both him and the friend loose from your life. A real friend wouldn't ever do that and as for your BF- you have to think in terms of trust. Can you ever really trust him again? Probably not. There will always be a nagging little part in the back of your mind running what ifs when he takes too long to call you back or goes places without you. If you can't trust him, then there's nothing left for you two. \n\nYou deserve better than someone who would so blatantly disrespect and betray you like that. Someone once told me to learn to accept the apology you'll never get. If you never talk to either of them again, at least you'll come out knowing it wasn't you who did wrong in the situation. \n\nA word of advice: always try to keep an open line of communication about everything regarding the relationship and ask them to do the same. A hurtful truth at the beginning is always better than a gift wrapped lie after the fact. ",
            "My now ex friend hooked up with my now ex boyfriend. It sucks at first OP not gonna lie. I spent a few months in bed not wanting to do anything but time heals all wounds. In the end it'll be a blessing that the trash took itself out. Sending you all my love and hugs",
            "I have been exactly where you are. If your \"friends\" are anything like mine, they will come back with excuses and \"i love you\"s and your history together. Do not fall for any of their shit. There is no going forward with either of them, because that would require them no longer being fucking terrible people. That doesn't happen over night. It will also never happen if you let them think this behaviour is okay. You need support, but not from them. Call your parents or any other friends you have. You maybe think you don't have other friends because you've spent all your time focused on Chenelle. There are lots of people you know or will meet who would love to build up a friendship with you. You will get through this. ",
            "(((hugs))) Something similar happened to me. It was earth shattering. I went for years without any friends at all. \n\nMy advice to get counseling if you can. Being able to talk to someone about it, for hours if you need to, will help you a lot. \n\nTry to stay busy. Make some memories that don't include either of them. There are people out there that aren't that shitty and selfish, and you deserve to be friends with them. \n\n(((hugs)))",
            "I am so sorry that you got caught up with such a pair of vipers. \n\nHonestly,  just take care of yourself. Consider them as dead if it helps, but do lots of nice things for yourself, if you stop taking care of yourself it will compound the bad feelings so go to the gym, watch movies you like, buy a few pieces of nice clothing, get a massage, spend time with people who really love you.",
            "It wasn't meant to be. Trust me when I tell you : once the trust is gone, it does not come back. How could you ever trust either of those two again? I hate to say this, but you need to get rid of both. So sorry. There are better people out there. ",
            "I've known people who got this kind of news when they were further into the relationship, with marriage and kids! It still *sucks*. Dump both of them out of your life, OP. Not friendship OR boyfriend material.",
            "This happened to me about 5 years ago... I still will get stray feelings of horrified anger on occasion... what they did is unfair and heartbreaking, but it will get better after some time. Try to focus on yourself and obviously dump them both and don't give them the benefit of ever being able to talk to you again. Give yourself a good few months of \"mourning\" and then pick yourself up and go do good things with and for yourself. I'm sorry this happened to you. \n",
            "welp time to cut out your best friend and current bf and buy that mom Karen Dinner!",
            "Everything you do now, you do to better yourself and for yourself. These two people, however good to you they were in the past, have done something they can't take back or repair. AND they did it more than once. You didn't deserve any of it. It sounds to me like your bestie was so broken by her last relationship, she needed to watch the world burn. If all that shit could happen to her, why does anyone else get some perfect relationship? Fuck this perfect relationship. Anyway, that's how I see it. I'd go no contact and not allow them to see you for closure. They will want to apologize and explain. They will want to do that to alleviate themselves of guilt. So ask yourself, will that help you or them? Is it even worth helping them alleviate their guilt?\n\nTo best punish them, you go live a wonderful life. You get your own place that you set up just how you like. You join clubs, teams, whatever hobby makes you smile and feel proud of yourself. You heal and move on. You find a new best friend who treats you how you deserve to be treated.\n\nThen, when the pain is mostly gone and you look around and realize that life is pretty good without people like them, you date. Now you know what things you value in a relationship (travel etc.) and that will help you find someone else who is compatible and loyal. They exist. \n\nThank Karen. Send her a letter when you are settled and happy and thank her for the life she gave you. She did a wonderful, selfless thing. She set you free to find a better life. She cared about you more than your \"best friend\" and your boyfriend. \n\nIn the immediate future, get some ice cream and watch the movie that makes you feel most like yourself, for me that's Star Wars, or Empire Records, but I'm old. If you don't have one of those movies, maybe watch How to be Single? It's good for a few laughs and is somewhat relevant... \n\nIn a decade you'll be my age and this will be a blip on the radar of your life. Looking back, you'll want to be able to say to yourself, \"I handled that super well and look at me now! Fuck those people!\" Imagine how many more places you'll have been in a decade! Make a list of where you want to go, and if you can, start tackling that list on your own. Now think back to ten years ago when you were 14. Back then, did you think your best friends were the most important people in the world? They were then. How many still are now? And if the answer is one or none, is that fine? That's how you'll feel about these two people in ten years. You'll have others in the future who mean just as much to you, if not more. \n\nYou've got this. \n\n",
            "cut ties with bf and friend. they are shitty people and you dont need them around",
            "Cut them off completely--this is not forgivable. If anyone asks you why you broke up/are no longer friends, calmly tell the truth of their actions. You don't owe them to lie for them and their cheating is NOT a reflection on you--you have no reason to be ashamed. I understand the feeling of being betrayed as well as the sense that you can't trust other people but most people are not like them. ",
            "Ugh. And your former best \"friend\" knows how it feels to be cheated on! \n\nKeep your head held high, lady. You will get over this. It's painful, but just know those two cheating jerks will feel the wrath of karma eventually. All you can do now is start fresh, with your chin up and show them you're better off.I'm so sorry tho. This sucks.\n\nEdit: and do the flower thing OP. That's a great gesture. How long would they have kept it up if she hadn't told you. She's amazing.",
            "Revenge sex. Bang Chenelle's mom, she seems awesome",
            "Holy shit. I'm so sorry. Just sending hugs and good thoughts OP, I was just broken up with too but I can't imagine this situation.",
            "Dump both of them, they don't deserve you.",
            "keep in touch with Karen, drop steve and chenelle, they are dead weight to your happiness. Move on get your life how you like it and be happy you found out sooner rather than later. You sound level headed so I know good things are bound to happen for you. ",
            "A similar situation happened to me when I was your age as well. I'm not trying to say that I know exactly what you're feeling, but I have a good idea. Betrayal, rejection, insecurity, anger...I felt all of those things. It was awful. For me, the visceral pain lasted for months and months. But even for a year or two afterwards, I still felt psychologically fucked up. I dated a girl after and was convinced she was going to do the same thing (we broke up but she didn't and we still remain friends).\n\nThat was eight years ago now. Since then, I've made great friends who I know would never do that to me. I realized that the life I was living with my ex and my former \"friends\" (I lost my two closest friends in the process) was not a healthy friendship or relationship. I've grown much more than I ever did with them and not attached any of my internal self-worth to their actions. As weird as it may be to hear, I am kind of happy it all happened.\n\nDespite ruminating every day for months on what happened, I now hardly even think about it at all. That's what will happen to you, too, I'm sure. I am deeply sorry for everything that happened, but know that you can take this event and make it into a turning point in your life. You have the ability to meet new friends, start new relationships, and in the end you will see everything that happened as just another bump in the road.\n\nI hope that helps. ",
            "Seriously, these two can go to hell. U don't owe them shit. That being said I agree with everyone else. Don't speak to them again. Send a little thank you to Karen and move on. When someone asks what happened to Steve \"Oh Steve, yeah he screwed my best friend so I moved on from both of them\"",
            "I believe you should cut them out if your lives. I had a similar situation a few years ago. My best friend and one of my exes apparently were cheating on me for quite some time before I found out. It was a horrible feeling and it personally took me more than a year to heal from that wound. I cut them both out of my life right away and looking back, I think it was the best thing that I could have done. After blocking then out, I hung out with friends more and joined some clubs and that helped keep it off of my mind. I hope you can figure something out to distract you or move on to. Just remember, don't rush yourself into any relationship anytime soon. Good luck, I hope you can recover.",
            "I really can't imagine what you must be going through, but it feels so terrible to even read. I hope you find a way to cope with this and move forward sooner than later and develop into a stronger person as a result.",
            "listen, you could have married this guy, had kids with him, but now you are out. lets say it was not your friend that did this with him right now, he would have cheated anyway later. that is the type of person he is. your friend would have been happy to fuck ur future bfs or spouses. take this as a blessing",
            "They're both disgusting, they deserve each other. Cut them out of your life, text Karen a thank-you, and move on with your life. Focus on yourself, your work, your hobbies, making new friends. It gets easier with time. I'm sorry, OP.",
            "Sorry for you.  All you can do is move on from these awful people.  It will take time.  ",
            "It's tough.  I moved away from my old home town and I now have better opportunities and don't have that betrayal weighing me down anymore.  Hopefully, you'll still keep in touch with her mom.  I wouldn't forgive her daughter, either and hope she doesn't guilt you to forgiving her just because you are close with her mom.  Stay strong and don't let either Steve or your so-called \"best friend\" back into your lives.",
            "Screw them. Block them and don't look back. They are both assholes. \nKaren is a good person. Send her a thank you card. ",
            "This is messed up, but it will be okay. You often find out in university who your friends are and some of them become friends for life and others just aren't there for you in the way you deserve them to be. Boyfriends in university rarely last forever, too. \nLook, this is a pretty extreme case of betrayal. The girl you thought was your best friend turned out to be selfish and vile. She was probably jealous of you or messed up over her own failed relationship, but what she did was inexcusable. But it could be ten more years down the line and she could be sleeping with your husband. Be grateful you found out whilst you're still young and have your whole life to make real friends and find someone who truly deserves you. I'm not trying to take away from your pain right now, but every cloud, right? \nIt's natural to be angry, to want revenge or to allow yourself to crumble, but the best thing you can do is to pick yourself up, thank your lucky stars that her mum has a moral compass and get out with some other friends and move on. Happiness is the best revenge after all! \nI really am sorry though- I can't imagine how it feels and I get that it's all too easy for us to sit here and dish out advice. It's understandable to be devastated, but this isn't going to break you. You can and will get through this and at the end,you'll be rid of two toxic people who ultimately didn't deserve your love. \nXxx",
            "Did Karen talk to her daughter, Chenelle, before disclosing to you?  As a mother I would care first about my daughter's ethics and her loyalties as a friend, before disclosing to said friend that my daughter was cheating on her.\n\nIt's this omission that does not track right for me in the story.",
            "Steve's just an asshole, no excuses there, but on your part a year and half into a relationship is about when guards start to come down. You thought Steve was a great guy because he was an asshole, but one who was good at covering it up, but after a year and half it slipped. That's not on you, that's on him, you have to trust people in relationships even if there is the possibility that they are abusing your trust from the start. If you don't trust your partner, you doom the relationship. I'm sorry this happened to you, but don't let it affect the way you approach relationships in the future.\n\nBut for Chenelle I'll play devil's advocate for her. Depression does funny things to people. I had some serious issues with depression earlier in my life, and looking back on it the one thing that really stands out to me is how selfish depression made me. I had this attitude of 'my life is so much worse than everyone elses, nobody should mind if I do this one thing for myself at their expense'. The scary thing is that while that looks like pure selfish insanity to me now, it seemed OBVIOUS to me at the time, like there was no other possible conclusion that even warranted consideration.\n\nWhat Chenelle did to you was bad, real bad. But two things stand out to me, a) sounds like she was going through a tough time in her life, b) from the mom specifically seeking you out to tell you about it, this sounds like she's had a good upbringing, has been a good person for most of her life, and this is really completely out of character for her.\n\nShe could just be going through a really rough phase in her life, and while what she did to you was beyond not okay, even in that context, it might be worth thinking about if she comes to you in the future with an earnest apology, that she isn't all that bad of a person at heart.",
            "I'm sorry that you now have two exes in your life -- an ex-friend and an ex-boyfriend.",
            "God that sucks. I'm really sorry. You don't have anyone near you that you can talk to? This is definitely a huge betrayal and you are going to have a hard time, but I promise you, you will get through it. Don't let this jade you. There are good people out there...you just happened to get caught up with two very shitty people. But Karen is one of the good ones. I can't imagine how hard it must be to \"tell\" on your own daughter, but she did you a huge favor in doing so. ",
            "I'm so sorry this happened to you. I know it will be terribly painful to excise two people from your life, but the alternative will only lend itself to more pain. Remember that crisis always leads to opportunity. It sucks right now, and it will for a while, but ultimately you will come out stronger and better on the other side.",
            "I'm so sorry, you deserve so many hugs! You seem like a wonderful person and you deserve wonderful people around you. This sucks but it may have been a blessing in disguise. Down the line you'll realize how you were lucky to get away from both of them. You'll find a better boyfriend and make other friends! ",
            "Either burn the bridges with the both of them (albeit I'd advise to do it in an extravagant way) or repair your relationships into friendships. It's really up to you. I recommend simply saying farewell to the both of them, it gives it a finality for all parties to accept. ",
            "You should be angry with both of them.",
            "well my first thought is damn \ni lost a best friend and a boyfriend all at once .. time to move on .........lesson learned  ",
            "I may get some hate for this, but am I the only one here who realizes you have absolutely no concrete proof that anyone had any sex here? You say the following:\n\n> she saw Steve and Chenille sneak around the back of the house about a month or so ago. Karen went on to explain that she noticed this happening two other times. At first, she thought we were all hanging out. But, Karen told me that she got a weird gut feeling on this situation. \n\nAnd then\n\n>He didn't answer. In fact, he went pale white.\n\nAnd that's it. You have absolutely no confirmation of what went on between them. They could have been talking. They could have been making out. Yes, they could have been having sex. But *you have no idea and you're jumping to the worst possible conclusion.*",
            "In the beginning of your op, you stated that you and Steve were dating casually and that it wasn't until you took the trip to Peru and Chile that you decided that it was something else. When did this cheating happen? Was it before or after the Peru trip? If it was before, would have it been that big a deal if you found out before the trip? I mean it would be for me, but then I don't get the \"dating casually\" thing, which sounds more like a FWB thing. Also, you stated that after the trip you realized you were in a great relationship - did you discuss that with Steve? Did he feel the same way? Or was this still just a 'dating casually' thing to him.",
            "Your post title is a little odd. You made your friend the active subject of the sentence, and your boyfriend the passive object.\n\nI would have thought the title should have been \"My boyfriend cheated on me with my best friend.\"\n\nIt almost sounds like you're trying to give your boyfriend a pass and putting this all on your friend. In reality, although they're both assholes, it's your boyfriend who gets most of the blame here.\n\nI would dump them both if I were you. You're young; plenty of time to find a boyfriend who isn't cheating scum.",
            "As much as I agree that you don't own them closure, you own it to yourself. So you need the opportunity of lash out on them and let them feel awful themselves. Just cutting them out allows them to get the easy way out. Taking yourself from their lives is not punishment enough since you're not that valuable to them to begin with (if you were they  wouldn't have done what they did). Either personally, or in a text or email, let them know not that they hurt you, but the shity kind of people they are. Them cut them out and start fresh. One thing I've learned is that nobody is irreplaceable. And they obviously agree since they thought that of you. So give them the same treatment, get the closure you deserve and walk out. You will walk out a stronger person out of it.",
            "Most people are saying ghost them both and the others are getting down voted. Although ghosting may definitely be the right way to go. I feel like it's unfair to say that's your only option. \n\n\nLife is never simple. There is likely somewhere in between ghosting and forgiving. If you're not 100% sure you want to cut them out entirely, I'm sure there are different ways to go about this that still take into account the severity of their actions. \n\n\nPersonally, I don't break communication unless the communication itself is the problem. I think it's always better to have more knowledge than less and I never think covering your ears doesn't help unless your ears are in fact the problem. This doesn't mean you need to actively talk with them, just means you don't ignore them. That way you can stay informed about anything else you may need/want to find out from them, such as logistics unrelated to your relationship.\n\n\nFrom your post it's clear, you're extremely upset about this. So, I'm sure you won't be taking this lightly. I hope you manage to get through this without too much pain. I know that burning this bridge may be for the best. But, I think it's perfectly reasonable for you to leave the bridge in tact and just take another road.",
            "You kind of sold out Karen who did you a very huge solid at the expense of her relationship with her own daughter.  ",
            "You didnt have to throw Chanelle's mom under the bus imo",
            "[removed]",
            "While i feel like everyone gave some solid advice, there is one big thing no one mentioned\n\n>told him what Chenelle's mom (Karen) told me.\n\nYou should not have done this. You may have forever destroyed the relationship between Chenelle and Karen. Chanelle might be a horrible human being that you should never see again, but she is still Karen's daughter, and i am confident Karen will continue to love her daughter no matter what. \n\nWile you don't know the \"Behind the Scenes\", you may have hurt Karen very badly. You dont throw the people who helped you under the bus like that. You where clearly told this information in discretion. In the future, say something along the lines of \"My friend X was driving by and saw you\" or \"It came up in a conversation with Chanelle's neighbour i casually ran into\"\n\nAs everyone else mentioned, cut those 2 out of your life. I would get something for Karen, but do apologise for dragging her name into it.",
            "[deleted]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "5s8fh8",
        "author": "simplystephj",
        "title": "UPDATE SO [28M] of 9 years called off our wedding, implying we were over. Is this something I [26F] could make work for us?",
        "url": "https://www.reddit.com/r/relationships/comments/5s8fh8/update_so_28m_of_9_years_called_off_our_wedding/",
        "score": 2332,
        "num_comments": 75,
        "created_utc": 1486313819.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/5r01hl/so_28m_of_9_years_called_off_our_wedding_implying/\n\n**Tl;dr he called off the (big) wedding because we were both stressed and originally wanted to elope. Can we work through it?**\n\nNo, we couldn't because he cheated. I found out this morning through anonymous Facebook message that he wasn't loyal and there was more to the breakup than I knew. I called him twice with no response. So I sent him a text about the message. Still no response. So I decide to check his phone records. Lo and behold, a mysterious number popped up like the day things started to go downhill for us. He'd call the number on nights I was working and text it throughout the day. \n\nSoon after I saw that I checked Find My iPhone (he got his first iPhone and I helped him set it up like 2 weeks ago). His GPS showed at a random house near downtown that I know none of his friends lived at. Soon after that he called me. He denied it all and was trying to be all supportive. The moment I said I had proof he was hiding things from his phone records, his entire demeanor changed. He specifically stated \"I didn't sleep with anyone.\" Which was odd since I never brought up cheating. \n\nAs he was talking I checked find my iPhone again and from the distance, it looked like he left wherever he was and called as soon as he was in the car. I asked where he was and he said driving. I asked from where and he got very defensive saying it wasn't my business since we weren't together. I reiterated I knew he was hiding things from me (I still never brought up accusations of cheating yet). He called me creepy and stalkerish. I asked who the specific phone number belonged to and he refused to answer saying I was crazy. So I said I deserve to know and he said a friend from work (for the next few minutes he refused to assign it gender pronouns). A little bit later I pushed it it was a woman and he admitted it. So I asked who it was and said if it were the few women I know, then I get maybe he was venting to them. He refused to answer. \n\nSo yeah. We can't work it out. \n\nAlso prior to this he was already acting like a hot and cold jerk for the week after he  left me on the day of my bridal shower. Either acting like he didn't care one bit about me or that he wanted me back because his life was falling apart. Needless to say, I became more relieved that the relationship was over and was more mourning the fact I was in the position I was in (cancelling a wedding after a failed engagement). I realized he was very selfish and I took on every responsibility in wedding planning and our relationship while he had nothing to do but work and come home to play video games. For the record, I like video games but only when I have the time. Basically this was the icing on the shit cake and any bit I had left hanging onto the relationship went right out the window. \n\nI honestly feel relieved. I don't feel sad. I feel... free. And happy. I'm not sad being in the apartment we shared anymore. My sister had helped me two nights ago set up a new bed that help change the entire look of the bedroom. \n\nAlso Monday I'm going to a theme park with a coworker. While I'm not exactly trying to jump right into anything, he's a great guy and we have the same interests. It's just nice to have attention from someone I get along with. \n\nTl;dr ex-fiancé cheated. I moved on. \n\nEdit: Yes, I'm getting tested ASAP",
        "permalink": "/r/relationships/comments/5s8fh8/update_so_28m_of_9_years_called_off_our_wedding/",
        "comments": [
            "[deleted]",
            "Unbelievable after 9 years together he would do this to you and not even be honest. Good thing you guys didn't get married, major bullet dodged.",
            "Thank goodness for your ingenuity. You just saved yourself a costly divorce and future heartbreak. Bravo! You are free to find your real soul mate. \n\nBeware of his crying calls that are sure to follow now that you are single and free. He will call you blubbering about his stress, and if you really loved him you would give him a second chance. \n\nBe strong. Say no, and enjoy your new life. ",
            "Girl, you are incredibly lucky to be out and away from this dead weight. Enjoy your outing and never speak to the ex again.",
            "> Also Monday I'm going to a theme park with a coworker. He's been subtly flirting with me (to the point I had to get second opinions). While I'm not exactly trying to jump right into anything, he's a great guy and we have the same interests. It's just nice to have attention from someone I get along with, even if it turns out he's really just oblivious and wasn't flirting after all.\n\nCountdown to your ex turning up after it doesn't work out with his cheating partner and whining because you've moved on so quickly in 10...",
            "Damn, I'm so sorry you had to go through all this. But it's good to see that you're feeling happier and free to move on with your life! I wish you all the best.",
            "Read your first post and it seems really ironic (and hypocritical) of him that you guys rekindled your relationship by discussing his parent's infidelity and you guys end up breaking up because of *his* infidelity. \n\nBut good for you though. You found out before you guys got married. ",
            "Props to your sister, she sounds like a good influence.",
            "Fuck that guy. He went about that in like the worst way possible and showed his true colors at the end. \n\n> said it wasn't my business since we weren't together anymore\n\nI sincerely would enjoy punching this guy. Please please don't go back to him when he inevitably comes crawling back. You deserve better! ",
            "You go girl. You seem to have your head on straight about this. Good luck! ",
            "Good job, he made things easier for you, amazing how things work out sometimes!",
            "Damn, I wish I had your attitude when breakups go into a downward spiral. You're amazing; keep it up and enjoy your freedom from that **massive dump of human garbage**.",
            "Sucks that he would do that after 9 years.  Just remind yourself you're lucky it wasn't after you got married and had kids 20 years later.  And learn the warning signs of an immature selfish guy.  I'll bet there were plenty even before this happened.",
            "Excellent use of ingenuity & technology! \n\nBest thing I ever did was end a 6+ year relationship. It allowed me to be open to finding my soulmate which happened only a couple months later. Happily married to someone amazing that I trust ever since!\n\nYou'll find someone a million times more perfect for you :) Go with your instincts.",
            "That's not what bipolar means.",
            "I had a hunch reading your first post that there could be something more to it. Wow. He's somethin.",
            "I remember reading your story and thinking \"there's definitely more to this, run.\" But of course the top comment was trying to convince you to elope. Just goes to show Reddit rarely seems to get it right. You go girl, enjoy your freedom!",
            "I'm late to the party here as far as this thread goes, but I just wanted to say that I worked with my husband for a year and we never hung out, though we always got along well. He broke up with his ex and we were dating within two weeks. We will be married three years soon. \n\nSometimes you're done with a relationship well before the words are spoken, so keep an open mind about this new guy. He might be cool, he might not, but worth getting to know maybe! \n\n",
            "He did you a favour. Now you have a clean break from all of this. It's painful, but for the best. ",
            "He's a damn cheater just like his father!",
            "Ugh! I had an ex that accused me of being \"stalkerish\" for calling once a day when we lived together and he was visiting a friend. He was cheating on me too. It's so horrible how they try to throw it back at you to make it seem like you're the problem. ",
            "Sounds like a piece of shit. Glad you're rid of him. ",
            "Be sure to thank your sister, she freaking called it.",
            "Glad it's working out. A suggestion given you have a date - go have fun. But you'd want to give yourself some time to decompress and heal before getting involved in another relationship.",
            "You just saved yourself from years of misery down the line. \n\nGood you, OP! Glad to hear your moving quickly from you cheating SO.\n\nJust heads up though, I feel like your ex is going to come crawling back to you if something happens between him and his SO. Just remember to stand your guard up against him (as you always do) and you should be fine! :) \n\nHave fun at the theme park with your coworker!",
            "Oh noes. But im. Glad you are happy. What I don't get is why do they try to hide it? Like  if they are cheating is clear that they don't want anything formal so why being defensive. Is something I can't understand. ",
            "I'm so glad you mention the feeling of freedom! It took me quite a bit of time to get to that point after my divorce but there's nothing better than when you realize you are the one in charge of your life and you can do whatever the hell you want! It's truly the most amazing feeling. Good luck and just remember that EVERYTHING gets better from here! Have fun at the theme park!",
            "You may not get to my comment, but I'm glad you're seeing this devastating time as a dodged bullet, so to speak. While I'm glad you got to the bottom of it, I'm still sorry you've had to go all this way to damn near the wedding date to find out this guy is trash. I'm a MOH for my best friend this summer and if I find out the groom is hanky panking someone else, she'll have to push me out of the way for the totally not premeditated murder that'd happen.\n\nIt sounds like you're a really well grounded individual, OP, and that's amazing and great. Use this time to have fun! ",
            "What a serious jerk!\n\nAnd yes, get tested again in about 6 months for HIV. It takes time to show up sometimes. \n\nSeriously, what a jerk. 9 years, getting married, and he cheats. I wish you the best of luck. I know you'll do well. You're 26, you're my age. Trust me, that's young. There are so many good guys out there, even if you maybe want to start looking at the hotties who are around 23, 24 :p \n\nI'm not sure if dating/flirting so soon is good, but I like a palette cleanser after a relationship sometimes.. Maybe not healthy, Idk, but it's a nice distraction as you said. ",
            "Well fuck. I for one misread your situation spectacularly.\n\nThank goodness you found out before the wedding.\n\nGood luck getting bak on your feet, and my apologies for my wrong advice ('elope, it'll be fine')- thank god you didnt follow it",
            "You're handling this so well. I'm confident your life will only get better from here. I can't say the same for your ex.",
            "\"I didn't sleep with anyone.\" Wow.\n\nMy best friend and her ex also just called off their wedding and she said she had a feeling something was going on between him and a co-worker. This weekend, said co-worker tagged him in a post that they were seeing a movie together.\n\nGood for you for not trying to \"work it out\". Even if he didn't sleep with anyone doesn't mean he wasn't cheating. At least you found out before the wedding. I'm going to suggest my friend change her bedroom up like you did. She is have a tough time.",
            "I may not feel like it but you will thank God or whatever you believe in every day that you avoided that bullet to the head.  That A-hole would have ruined your entire life.  Your kid's life, your family's life.  \n\nJust give it time but trust me one day you will be SO glad you found out before you were married.   ",
            "> He called me creepy and stalkerish. I asked who the specific phone number belonged to and he refused to answer saying I was craz\n\nJust want to say that you mentioned on the first post that he came out of an \"emotionally abusive\" relationship the same as you had come out of your own abusive relationship... This might sound cold (towards him not you), but I don't think I'd be shocked if he now went forward to a new relationship and said his \"last two\" relationships were emotionally abusive.....(I.E. he's not been the greatest partner and blaming his partner's reaction to his wrong-doings as \"emotional abuse\")\n\n\nSo glad that the truth has come out and that you were strong enough to let this make up your mind for you! Best of luck to you in the future!",
            "The issue here is if you are both in love with each other or not. You don't have to have a wedding or a marriage to be a couple. It should be based on what your hearts are telling you. I don't know how each of you viewed your relationship status after the wedding was cancelled. Did your SO still view the two of you as a couple and then he went out with another girl? That would be cheating; if he thought that you also felt you were both still a couple. This needs to be further defined. Then there's the cheating. Sometimes people might have a very brief, non-sexual bit of flirtation after a breakup and then change their mind right back where their heart was before. If your SO visited a girl and changed his mind right away; before anything happened, it is possible to work around this. If you are still happy and relieved in a week, then maybe you will want to move on. My point is that sometimes the shock of a change like a cancelled wedding could bring on TEMPORARY thoughts, behaviors and soul-searching and that a couple of weeks might be needed for both of you to work things out and make lasting decisions. "
        ]
    },
    {
        "post_id": "3gqp3y",
        "author": "throwbabyjim",
        "title": "I [22M] fucked up and told my gf [23F] that my sister [32F] used to be a sugar baby/escort and my gf is now threatening to tell her bosses about it.",
        "url": "https://www.reddit.com/r/relationships/comments/3gqp3y/i_22m_fucked_up_and_told_my_gf_23f_that_my_sister/",
        "score": 2333,
        "num_comments": 425,
        "created_utc": 1439398098.0,
        "selftext": "Background: My sister and I were born into a terribly abusive, poverty-stricken family. Because our parents were either always drunk or high or never around, my sister basically had to raise me by herself. The minute she turned 18, she took me with her and we ran. We were homeless for a short while but my sister always took care of me. She worked wherever she could, always made sure I was fed and clothed, even made sure I went to school! I owe her more than you can imagine. Unfortunately, she wasn't able to go to college and a high school diploma doesn't open many doors. When she turned 20, she started working as an escort. A client of hers was really taken with her and proposed they start a sugar daddy/baby relationship. She continued on with this relationship until she was 24, pretty long for a relationship like that but my sister and this guy really liked each other and continue to be friends. My sister has always been upfront with me, and while it did take me a while to work over my feelings about my sister being a sex worker I realised that it didn't change her as a person at all. I felt guilty that she had to do all of this for me, but she always insisted that being a sugar baby was great for both of us. Her sugar daddy was this nice middle-aged Japanese man that taught her the language, got her to take the JLPT and later certified to teach Japanese (which is her current job at a local college). It seemed like for the first time in a long time my sister was able to breathe. We got an apartment, I got to continue my schooling, everything was great. \n\nCurrent issue: My sister and I still live together. My girlfriend, who I've been with for a little over a year now, was over at our apartment two months ago. We came from a party so we were both pretty drunk. When we got there, I noticed my sister wasn't home. My girlfriend asks if she can go into my sister's bathroom and use her makeup remover, and because I was wasted and not thinking (and because I trusted her) I let her go. She comes out after a few minutes with a photo she said she found in the drawer of my sister's vanity as she was looking for the makeup remover. It was an old photo of my sister and her sugar daddy hugging and looking pretty intimate. And this is where I fucked up, Reddit. At the time, I guess it wasn't just the alcohol that influenced me but the fact that I thought I knew and trusted this girl. I got giddy seeing the picture, told her this dude was the guy that helped my sister turn our lives around. I told her the whole fucking story. When I woke up in the morning, my girlfriend didn't say anything about it and I thought that was that. Fast forward to last Monday - I found out that while I had been running around getting a surprise ready for her birthday, she was fucking a friend of mine. I told her it was over, and she came over with all the excuses and begged me to take her back. Today, she messaged me with a picture she took of the photo my sister had on her vanity, and a screenshot of the guy's LinkedIn. She told me I either take her back or she'll tell my sister's bosses about how she used to be \"a filthy whore\".\n\nI'm scared Reddit and I don't know what to do. I know that sugaring isn't illegal, and that that photo can't really prove anything, but rumours like that could potentially kill my sister's career in the academia. I haven't told my sister yet and I haven't messaged her back yet. What do I do? I can't believe I've fucked this up for my sister. I'm in college because of her; I'm going to MED SCHOOL because of her. If she weren't here, if she didn't decide to do whatever she could for me, I'd probably be dead in a ditch somewhere.\n\nTL;DR In order to save us from homelessness my sister chose to be a sugar baby/escort for a time. My girlfriend found out, cheated on my months later and is now threatening me with the information unless I take her back.",
        "permalink": "/r/relationships/comments/3gqp3y/i_22m_fucked_up_and_told_my_gf_23f_that_my_sister/",
        "comments": [
            "Your gf is a piece of shit. That photo is private property. I'm pretty sure she has a weak case anyway as she's operating on what you said and not what she saw. The photo proves nothing except that your sister had a relationship with an older guy. But tell your sister what happened. She might want to get a lawyer to send gf a cease and desist as this is harassment. ",
            "tell her you have no idea why anyone would be interested in a picture of your sister and her language teacher\n\n\nthen block her on everything\n",
            "This is a very difficult situation but blackmailing is a crime. I'd contact a lawyer, let your ex know you're doing so (the threat of prosecution is sometimes enough), and let them take it from there. Also, obviously, let your sister know so she can see if she can work damage control and take precautions if need be. I'm sure she knew that there was always a risk that *someone* would find out and this could happen, so there's the potential that she has a plan for something like this.",
            "So a random person is going to call up and say \"your employee is a whore\".\n\nYou know what I would do if someone did that and started talking about someone I manage? \"Who the fuck are you and why should I care?  fuck off.  click.\"\n\nas would most people.\n\n",
            "It sounds like all your ex has is a harmless photo of your sister with a random guy, a story that you told her that she could have just as easily made up, and no other evidence. Tell your ex to go fuck herself. I doubt she can do much real damage. If she tries, talk to a lawyer and threaten legal action (which is probably a good idea anyway). What a piece of trash. How do delusional morons like this even think this scenario is going to play out? \"I'm just going to blackmail him into loving me again, and everything will be sunshine and roses forever.\"",
            "Tell your sister what happened. Then file a restraining order and get help from a lawyer to see what else can be done. Block her on all social media and don't respond to her text messages and phone calls. ",
            "I would laugh in your ex's face and tell her to stuff it. She has a pic of a pic of 2 people hugging. Even if she told your sis's boss a)how does he know it's your sis b)how does he know your ex is yelling the truth and c)even if it's your boss believes her is this really grounds to be terminated on?",
            "I'm sure blackmail is a criminal offence so perhaps you ought to consult a lawyer.",
            "[deleted]",
            "This touched my heart, your sister is such a strong human being. I admire her strength. She did what she had to do, to make sure the both of you survived and she succeeded. She is truly an inspiration and i hope that she(and you) are having a good life now. I hope that one day i have the resolve as she had :)",
            "Other folks have given you the good advice that your shitty ex is committing a crime.\n\nConsider this: if your sister didn't work as an escort or a sugar baby, your ex could do the exact same thing. Would you be worried? It might be unpleasant, but most people when confronted with rumors spread by their employee/coworker's brother's shitty ex would prefer to just ignore and not deal with it, and I don't think she's as \"vulnerable\" as you think. Your shitty ex has no credibility and although I think you should deal with the situation (by involving the police) I don't think you or your sister should worry that much about consequences.",
            "[deleted]",
            "Inform your girlfriend that if she blackmails you, you will be going to the cops and your sister will sue her.\n\nAlso, from what I know of academia, I somehow don't think they would be too bothered by this, unless you're sister's working at Bob Jones or Brigham Young University.",
            "I think she has been fucking that guy for awhile and is now trying to use this new info against you to try to make it ok.",
            "Eh, fuck her. It's like revenge porn or blackmail. She could get into a lot more trouble than she thinks she'd be starting. \n\nAnd fuck her too for finding that photo!  Looking for makeup remover, my ass.  She's a snoop. Even if the photo was *right next to* the makeup remover (and I don't believe it was), all she had to do was pick up the makeup remover,not the photo.\n\nWhy would she even want to be with you if she has to blackmail you into taking her back?  She's some twisted shit. \n\nStand your ground, don't let her scare you, she's a cheater and a snoop and a piece of shit, and controlling,  and she could get into some real legal trouble (which is never cheap) if she pursues this threat. Which also makes her stupid.",
            "I don't have any suggestions for you except that you and your sister probably want to get out ahead of this story by controlling the narrative.\n\nLet the relevant parties know you have a \"crazy ex girlfriend\" who is fucking with your life.  The picture proves nothing.  Everything she says is bullshit.  Who would believe and angry vindictive person?  The phrase \"disgruntled employee\" was invented for these situations.\n\nJust wanted to say sorry this low life is messing with you and your sister.",
            "This is blackmail.  It's very illegal.  Contact an attorney and go from there.  Update us once this horrible human being has been properly shamed and punished for this.",
            "She texted you a blackmail threat.  Bright. ",
            "She has shown her hand.  \n\nStrike first and strike hard.  \n\nShe is the enemy now and you take nothing but total surrender.\n\nCall her job first and let them know, call her friends, her parents, her siblings, and her pets.  \n\nYou go full nuclear and you won't have to worry about anything.  \n\nOr just do what other people are saying.  That works also.",
            "Tell your sister. Sister sounds smart, and odds are she and her former MENTOR (which is how you should always refer to Mr Sugar Daddy from now on) have probably talked about the \"what if's\" if their relationship was found out. For all you know your sister openly talks about him as an ex. \n\nI'm positive your sister will calm you down. Don't reply to the ex girlfriend until you've talked to your sister. \n\nIf the worst happens (and I don't think it will) you guys will make it, and you're going to freaking MED SCHOOL. It might take a while, but stick with it and then you will be able to take care of your sister. ",
            "Will her employer care?\nBut if I were you call the police.\nBlackmail and extortion is a crime. Save the messages. \n\nEdit: also your sister could be like \"oh he was my boyfriend from a while ago....why are you accusing me of being an escort?\"",
            "You didn't fuck up - your GF just sucks. Why the hell does she care? You confided in her, and she threatens this? What an immature POS.",
            "Tell her to fuck off. You back your sister who took care of you. Don't fall for blackmail. ",
            "Piggy backing on what everyone said. Also keep all the messages and emails and anything you get from your ex. Print them and save the screen shots. If something happens later on you can use the info as proof. ",
            "Are you in Texas? You may be able to shoot her. ",
            "That title should say ex-girlfriend. \n\nSomething like that would be unforgivable to me especially after everything your sister did for you.",
            "She's on meth, right? And was getting violent before you broke up with her, and is now threatening to damage your sister's reputation. \n\nYou should call her parents and friends, and show them the text she sent you.",
            "She knows nothing. She's delusional and making stories up for attention. Do you understand?",
            "Well, she *messaged* you her blackmail note over taking her back after she cheated?  I'd hold onto that!  I'd also point out that you have undeniable proof right there of how shitty *she* is and wouldn't all her co-workers and facebook friends and family just love to know that about her.",
            "Everyone else already gave the advice I was going to give, but I still want to say this:\n\nYou're an awesome brother.  So many people - *so many people* - would shun a friend or family member who was a sex worker.  And yeah, there can be a lot of filth surrounding the sex industry.  But you trusted your sister's judgement, and she didn't take that in vain.  She found what seems like a nice man who didn't want to find a relationship through the \"traditional\" way, they had a consensual, mutually beneficial, and intimate friendship and it sounds like he was respectful and truly valued what she provided in his life and fulfilled his end of the bargain.  That's what should matter, not that she was ZOMG TEH SEX WURKER.  It's a job.  And just like any job, it's not something everyone wants to do.  \n\nGood on you for keeping a clear head and an open mind and I'm sorry your GF was such trash.  ",
            "Ask your gf if you can have 3 days to think before she acts. Tell her you love her and you just need to process your feelings. In the meantime, talk to your sister, go to the police. Tell them of the harassment, take proof of her threats (this is harassment, blackmail and slander) gather a case number. The police will offer to pay ex a visit and tell her to fuck off. Accept that offer. Meanwhile, have your sister take your case number and the situation to her employer as other commenters have suggested, to prepare the situation. If your ex starts threatening to hurt herself or anyone else, 51/50 that bitch. You need a case number to prevent her further making shit up that could ruin both yours and your sister's futures.  As far as the rumors (if ex has the photo), the sugar daddy is just someone your sister had a relationship with years ago. ",
            "How was your gf able to find the guy's linkedin? You told her his full name? ",
            "So not only is she calling your (basically) *mother* a 'filthy whore' because she did what she had to to raise you and give you the opportunities she never had, but she's further threatening to *ruin her life* with this knowledge that she received in confidence. (Why would she have taken a picture of her and her benefactor? She must have had ideas to do this almost right away.) Shame. *Shame*. SHAME on your ex. \n\nGo on the defensive, start letting everyone know how crazy and awful and A LIAR she is. You both will be fine, but pick your confidants more carefully from now on. My thoughts go out to you and your amazing sister. (If nothing else comes out of this, let it be that you look her in the eye and tell her how grateful you are, because she may not know it, and might still be grappling with mixed feelings about her past.) Let her know how much she means to you and everything you've said here. Your sister did nothing wrong - quite the opposite. It would have been way easier to leave you to your parents and only have one person to think about, but she didn't do that - she essentially sacrificed herself in order to protect you - which is what a (good) mom does. You're so lucky to have her, and it seems like you're taking the opportunities provided by her to build a great life. Just ... try not to pick skanky girls who would do this to you going forward. \n\nThis is one of those times where it would be appropriate to hire that nun woman from Game of Thrones to follow your ex around ringing her bell and intermittently shouting \"SHAME\". Like, why isn't that a service I can order from Amazon yet? ",
            "wow, your ex is a fucking asshole. ",
            "You didn't fuck up at all. You are supposed to be able to trust your partner and tell them anything. She's a terrible person. She's not going to be able to do anything with that picture. People will just see your ex as the nut she is. Tell your sister about the photo and then go back to ignoring the crazy ex. ",
            "Ask her is that how she wants things to be?\n\n  Does she want to be in a relationship with a guy purely due to blackmail?\n  Does she think she can ever feel truly loved or safe in a relationship where she needs 'leverage' to keep you around?\n\nAsk her how could she live with herself if she tried to ruin another woman's reputation, and possibly her life, purely to get back at a man? Does she think a good person would do that?\n\nDon't get mad or accusatory, act sad and disappointing. Say things like \"I thought you were better than that\". \n\nYour GF is lashing out in fear and desperation, don't fuel that. \n\nYou want her to feel bad, but if you just tell her to feel bad she will get defensive. \nShe needs to see how disappointing you are in her behaviour. She needs to think about what she's doing.\n\n",
            "The irony of this winds me up. Your sister was in a beneficial relationship to support her younger sibling which ended up enabling her to do more with her life where as your ex was just sleeping around because shes a terrible person",
            "Pretend you take her back and try to get back the photo. Try to dig around and looking for some really embarrassing stuffs of that gf, Tell she if even say  anything about your sister, you will tell people about her embarrassing stuffs.\nI don't know if as girl I should say this, pretend to take her back and sleep with her. Tell her you want to have a video of her sucking your cock because she owes you. \nThen, your weapson against her.\n",
            "Have you ever spoken to a therapist about your life? I think you telling your exgirlfriend everything after a few drinks really shows that you need a safe, non judgmental place to talk. I know everything worked out for the best for you and your sister, but I think there is some part of you that really wants to share this part of your life freely. I think that's your right but also that sharing has the potential to hurt your sister (as you've found out).\n\nI think you deserve to talk about this part of you without worrying about bad people with bad intentions.\n\nSorry that this comment doesn't address your actual issue.",
            "The anger I get while reading OP's text has fucked up what is so far a pleasant afternoon, but i'll get over it. Fuck your ex-gf, yes EX. What's with her going around calling people whore while she was cheating on you. You should let your sister know and hopefully you guys can prepare to do what Snorebaby had suggested with the cease and desist. ",
            "I agree with most of the top comments. Don't take the ultimatum.  Additionally, say something like this to your ex: \"I'm really disappointed you're trying to bring my sister into this. I know you didn't want to break up and you're hurt and might regret being unfaithful, but that was between you and me. It was a little bit about my friend, but only partially. My sister is completely out of this equation. You shouldn't have to ruin her life to get back at me. She did nothing to you.\" \nI would think this would all be easiest to say in writing, personally. Probably in an email.\nIt's true. It's really unfair for her to get at your sister when she doesn't *want* to get at her, she wants to get at YOU. If she wanted to be more diabolical, she would be more direct. (Not that she should be diabolical). But yes, lawyer up if need be.\nAlso, I don't know if cases where college faculty getting fired for being an ex-sex worker is as common as ones with grade school teachers in the same situations. They've also mostly been porn stars in the situations I've heard, not escorts. Though seriously, don't quote me on that. Look up similar cases. Learn from them. If they ended well, use similar methods.\nBut I think it's different with teachers who work with children. When it's at an adult institution, everyone's innocence is already corrupted.",
            "Being an escort or having people buy you things is not illegal, but blackmail is. Perhaps you should mention that to her right before you go and get a restraining order forbidding her to contact you or your family or any employers. If that's possible. ",
            "Preemptive strike.\n\nYour sister should tell her boss that her younger brother (YOU) recently broke up with his girlfriend because she was working part time as an escort without him knowing.   Once he ended things with her, she has been harassing both of you by spreading a lot of rumors.   If her boss should hear anything, he is more than welcome to come to your sister with questions, otherwise he should just ignore her harassment.\n\nthis way when she goes public with this story, people wont believe her.\n\n\nIf i were you, i would even post a message on facebook how you broke up with her since she was cheating on you with multiple people and may even have been working part time as an escort.    This way when she tries to spread the story, people wont take her seriously.\n\n",
            "I agree with other posters who have recommended that you tell your sister, and get her to tell her employers that they could be contacted with some rumors about her.\n\n\"My brother recently broke up with his girlfriend, and apparently she threatened to spread rumors about me in an effort to get him back.  I wanted to give you a heads up in case she follows through.\"\n\nIf she gets approached anyways regarding the picture (if they're not sent the picture, she can just disregard them as rumors), which I think is unlikely, she could just say it was a man she dated--a bit strange, but something I doubt she'd get in trouble for.  She could also say he was like a father figure through some tough times, and that he taught her Japanese; their relationship is similar to that of a dear friend (assuming the picture doesn't have a clearly romantic connotation).\n\nYou/your sister could also seek legal action against her.  I don't know too much about the details regarding that, but you could post on /r/legaladvice and/or contact a lawyer yourself to see what could be done.",
            "Lawyer up. Record the conversations, and do not reply.\nAlso have your sister tell your employer that a deranged ex-girl friend of her brother is attempting to stir up shit as revenge. right now your sister's PR is the first priority, listen to [this](https://www.reddit.com/r/relationships/comments/3gqp3y/i_22m_fucked_up_and_told_my_gf_23f_that_my_sister/cu0pgop).\n\nIn the future, please don't give your girlfriends ammo in the case of a break up.",
            "So she's going to go on the word of a drunk third party to publicly accuse someone of a crime in a way that's definitely going to cause damages, and will be an open and shut case of slander? Tell her to be your guest, and that you'll enjoy the new car she's buying your entire family. ",
            "Consult a lawyer about this blackmail attempt. Do this ASAP. Seriously. \n\nI am sorry this is happening to you. Your gf is a despicable human being and I hope she doesn't cause more harm.\n\nYou take care.\n\n\n*Nana internet hug*",
            "I would recommend not responding at all. With people like this, ANY attention (no matter how negative) from the person they're trying to control will be fuel to the fire. Ignore her, block her, and give your sister a heads up. If she DOES try to blackmail you, then she has committed a crime.\n\nBut my guess is she will crazy herself out trying to get your attention, and if you just don't give it to her (at all) she will eventually just run out of steam.",
            "Sorry man I don't really have any good advice for you, besides, tell your sister ASAP. Apologize, tell her you made the mistake of trusting this girl. Your sister needs the heads up so she can protect herself. \n\nWTF is wrong this girl... what does she think, you would accept her back and everything will move along like it was before.... \"Yes I fucked your friend and threatened to ruin your sisters life to get back together, but now we can move past all that cause we love each other, right?\" Fuck her.\n\nIs there anything you have on her you can use as back up? Like tell my sisters boss and I will tell your boss about that time we did anal on his desk? Or something along those lines. \n\nGood luck my friend. You sound like you have an amazing sister.",
            "[deleted]",
            "Wait, isn't this blackmail or extortion? And you should have proof since your idiot gf messaged you. What she's doing is illegal.",
            "Go to the police \n\nBlackmail is very much illegal, and your swine of an ex is doing exactly that.  ",
            "What I found really jarring about all of this is that she knowingly took a picture of said picture, while you two were still going out/happy. And she kept it saved and even went so far as to hunt for information about the guy. \n\nEveryone else has solid advice, I'm just appalled not just that she would resort to extortion, but took the picture in the first place. ",
            "just get even and tell everyone show she cheated",
            "Luckily for your sister, nobody in academia will care- they may even ask her to write a book about her unique life experiences. If your ex tells, that will only make her look more crazy. I know if I had some random chick come into my office at the university and make these claims about a coworker, I'd be like, \"OK,\" and call security. Coworker would get total benefit of the doubt. Chances are, the ex won't go through with it. Just give your sister a heads-up.  Tell your ex to do what she thinks she needs to do and tell her in writing that you cannot have contact with her any more. Document everything she does after you go No Contact. The sooner, the better. Do not give her the attention she is so desperate for. She will eventually go find some other poor bastard to torture. ",
            "No matter what happens be proud of how far you and your sister have gone, Never should you or your ister be ashamed.\n\nAfter reading this I have so much respect for your sister and you for taking advantage of the future she gave you.\n\nYour ex is no where near the level of your sister of being a good person",
            "First of all, tell her to go fuck herself. Second, just lie. Your sister wasn't a sex worker, she was in a relationship with that guy. He's an old boyfriend. Apologize to her boss, explain that your ex is trying to get back at you for not taking her back after she cheated. That will be the end of that. It's the simplest and easiest way to handle this. She has ZERO credibility.",
            "[deleted]",
            "She has committed several crimes here. Call the police. File a report about the blackmail at the very least.\n\nWhat a disgusting person.",
            "Your girlfriend is a thundercunt.\n\nYour sister survived and allowed you to do so too. There is no shame in that.",
            "Call the Police and make a report of threats and harassment.  Even if they tell you there is nothing they can do you have documentation.  ",
            "I can't see why she would do this. \"I'm going to blackmail you and your family unless you take me back and pretend to love me, even though we both know you'll silently hate me for the rest of the relationship as you try to figure out how to get rid of me.\"\n\nOh wait, she's crazy. Right.",
            "Wow, she's *really* grasping at straws here with that small piece of \"blackmail\". I would just block her on everything and put it out of mind.\n\nRealistically, a photo of your sister hugging her friend isn't going to jeopardize her career in the slightest, and no one is going to believe your girlfriend's story once you explain that, \"Oh man, I'm sorry.. My girlfriend and I recently parted ways and she has just been making some over-the-top efforts to rekindle our relationship.\"\n\nIf anything, people are just going to think your girlfriend is crazy.",
            "1) I hope you kept/recorded her. What she is doing is a crime. 2) Tell all your friends that she screwed so and so 3) If your sister and this guy are still friends then no one can prove shit 4) Call her a liar and/or say you made the whole thing up because you were drunk and thought it would be funny. To be honest this girl sounds like the real WHORE. DO NOT take this girl back that would honestly be insane.",
            "Echoing what almost everyone has been saying. It's just a picture of two people being intimate. Let's say even if they weren't just hugging, but in bed naked or something. It's still a picture of two people being together. What, your sister can't date older men? It doesn't prove anything that would back up her threat.. While she is the one taking a picture of someone else's personal item.",
            "1. Talk to your sister  \n2. Perhaps go to the police and accuse your gf of blackmail  \n3. Inform your sister's bosses that your ex gf is a lunatic and is spreading rumours and stories  \nor  \n3. Your sister confesses the truth about her shameful, shameful past to her bosses and pleads for their understanding, before your ex gf can make a move  \n  \nIn any case, fuck your ex gf, taking her back surely won't solve any of the issues, she's crazy, a cheater, a liar and did I mention crazy? Also, you really owe your sis, don't be so fucking stupid again ;) I hope you will repay her in kind when the time comes.",
            "The best defense is a great offense. As the other folks have stated, tell the employers your ex is crazy and wants to ruin your family's reputation. Contact your mitual friends and make it publically know your ex is crazy and is slandering you. ",
            "Did anyone address the issue of his ex fucking his friend? I know it wasn't the issue here, but I'm sure we are all wondering what happened.",
            "This is extortion/blackmail and it's illegal. Let her know that.",
            "You take a copy of that email and go straight to a lawyer. Tell your sister upfront what happened. You cut contact with that scummy cheating bitch and you tell her to fuck off. What can she price anyways? It's just a picture of a sister and her man. ",
            "I don't have any advice on how to protect yourselves but your ex is a complete piece of shit and I hope bad things happen to her.  Your sister on the other hand is a wonderful person, no matter what anyone might ever say.  Good luck to both of you OP, please give us an update as soon as you can.  ",
            "Whatever you do, talk to your sister before contacting anyone, especially police or your psycho ex.  I know that's going to be a horrible conversation, but you've got to bite the bullet and tell her.",
            "Tell her to stop contacting you and that you will ask the police for a restraining order next time she contacts you.\n\nAlso save screenshots of the messages/linkedin clearly showing her phone number. ",
            "Just tell your sister right away. She'll probably be a lot more calm about it than you.\n\nIt's not really a big deal. She can't really harm your sister with this information. You may want to file a police report (that she is threatening to spread false rumors if you don't have sex with her) and seek a protective order if you think she's crazy enough to do other things too. ",
            "You can call the police for that. Or your sister at least. You'll have to tell her. She can call then for her privacy and you can call for the treathening ",
            "Just deny everything. If she follows through with it get a restraining order and tell everyone she's crazy. ",
            "I know this pretty irrelevant to your problem, but your sister must be wicked smart to have mastered enough Japanese to teach it in such a short amount of time.  That's in addition to being a pretty stellar human being.",
            "First, tell your sister. You need to come up with a plan together. She may want to tell this man as well, so you can all have a cohesive story. \n\nYour ex has nothing on your sister. She has a story and a photo, and you just need to think of a better story, which will require you putting your heads together. How intimate is the photo? Could it be a Halloween photo? \n\nThe only one who really has anything lose is the sugar daddy (assuming he's married), so if he knows he may be willing to throw some (more) money at the situation to help resolve it. Ie. hiring a lawyer to threaten the ex.\n\nIf that's not an option, you may want to make an offensive strike, perhaps with a bit of gaslighting. Tell your ex if she continues to harass you, you will send her written blackmail to her family, her boss, and file a complaint with the police. Or don't bother warning her, just do it. It will seem clear to them that she is mentally deranged and made this story up to get back at your sister, who has been advising you to break up with her since you got together. Because she's mentally ill. \n\nYour sister should tell her employer that her brother's mentally ill ex-girlfriend may contact them. That way she has set the stage to make your ex appear crazy (although she would appear that way anyway). No serious employer would listen to anything like that, especially because she is not in a profession that is related to this topic in any way. Like, if she had stolen from a previous employer, that might be worth investigating, but this will be ignored. Depending on where you live, it might be illegal for them to look into it (researching the sex lives of employees is not acceptable!)\n\nNeedless to say, you sister should be dressing very conservatively at work for the next few months, just to make the story completely not believable if it does come out.\n\nAnd apologize to your sister. The reason you told your ex is because you trusted her, and you were wrong. But make sure your sister knows that you weren't telling your ex in a way that was belittling your sister, but rather, that you were commending her. Sex work is nothing to look down on, especially if it gets you and your little bro out of a bad situation. ",
            "You're a very innocent and gullible young man, and she's taking full advantage of this. The photo proves nothing, call your EX!! girlfriend bluff (I do hope she's your ex-girlfriend and you're not still in a relationship with someone like this)  . Telling your sister would be a good idea so she knows whats happening and can prepare a story that counteracts allegations made against her. ",
            "Like everyone sane says here, i just hope you didn't dig your grave any further by confirming your ex's allegations with texts/mails/whatever.  \nIf there are no other proofs than the picture, tell her to go fuck herself because nobody will believe her.  \n  \nIf you did write some stupid shit and leave a written record, try making them disappear.  \n  \nAnd no matter what, talk about all of this to your sister, the sooner the better. She's now a part of this regardless of what happens, she has the right to know.  \n  \nBeside, given the portrait you made of her, she'll probably help you making the right decision way better than Reddit, she seems like a badass and wonderful girl. =)",
            "Wow, a cheater and a blackmailing POS. She sounds horrible, OP. Hope it works out for you :/ your sister seems like a really wonderful person and she definitely doesn't deserve that.",
            "This is considered blackmailing, right? Blackmail is illegal.",
            "If you're in the US, blackmail is a federal crime.",
            "1)take her back 2)snatch up all the evidence 3)break up with her",
            "Blackmail is illegal in most places. I'd speak to a lawyer and perhaps consider going to the police. \n",
            "\"I'm willing to overlook this embarrassingly desperate move, but blackmail is a felony and if me or my sister get even a whiff of some bullshit gossip being spread about us I'll be showing this threat of yours to the police\"",
            "Isn't this blackmail?",
            "Take her back and then ask her to destroy all the evidence she had of your sister. Make sure you watch her delete it. Then get \"distant\" on her. \n\nAlternatively, talk to her on the phone about it and have her say exactly what she wants to do. Record it. Bam! That's extortion. It's illegal. She can go to jail for a long time. A lot longer than your sister would (in fact, your sister can't go to jail at all because what she did was not illegal - sugar baby relationships aren't really prostitution under the law). ",
            "Dated an older gentleman, sugar daddy. Who is to say it was one and not the other?? From the outside there's not a lot of difference, especially this long after it's over. \n\nYour sister dated an older guy for a few years, your ex is a lying psycho. Close enough!",
            "Maybe threaten to call her parents/family and expose to all her friends that:\n\na) she cheated on you with a friend\n\nb) she threatened to harm your sister with negative intentions if you didn't take her back\n\n\nor something.\n\n\nI don't know but she is a piece of shit.",
            "what the fuck are you talking about man. Your girlfriends clearly making up lies so that you'll take her back. Who's going to believe a girl that's been cheating on you when she goes in to your sisters work and lies to her boss. I mean unless you posted something about it on the internet. ",
            "Ya. Your gf sucks. Get rid of her. ",
            "I Highly doubt she would contact your sister's coworkers or management, especially because the picture is just her and a guy hugging.  It would be VERY easy to deny because it isn't evidence of a relationship in the first place, and you and your sister are probably the only other ones that know.  \n\nYour ex has gone off the deep end and wants to blackmail you to getting back with her.  her only weapon to do this is the threat of (not so) damaging photograph and a story.  Do not call her out and say \"You wouldn't do it\", just say \"I really wish you wouldn't because that would hurt my sister\".  \n\nBring her shit down to a first grade level and tell her that she hurt you by cheating on you, and that you were just as upset as she is when you found out.  Tell her that you can't bear to be with her because of her betrayal of trust and that you couldn't love her again because your trust is gone.  \n\nTry to always convey a disappointed appearance and maintain yourself as quiet and stable.  If she's yelling, do not yell back, do not say angry things or cut her down.  You already have everything you need to doubt continuing a relationship. she's just trying to make this situation go nuclear so that she can overcome the ethical barrier of blackmail and feel justified trying to fuck someone's life up.  \n\nIf you're calm and tell her that you cannot be with her anymore because of what she did and that you really hope she won't try to ruin your sister's life, then i highly doubt she would be able to do it.  After you say this to her, try to cut contact, even though she'll threaten to do it all the time.  If she gives an ultimatim, like she'll do it if you don't take her back that day, just don't respond.  She won't do it, and you can refute it.\n\nGive your sister a head's up though about how you're handling it so she can be prepared and have her story straight.",
            "It's none of her business. What a bitch, honestly.",
            "There is entirely too much indentifying information in here for anyone who knows you or your sister, you might want to think about switching out some details if you haven't already. On to your case; tell your sister right away what a piece of shit your ex GF is and maybe talk to a lawyer. A cease-and-desist letter on official lawyer letterhead may be enough to scare her off.",
            "Have you got any good blackmail material on the ex-gf? If you do, threaten her with Mutually Assured Destruction.",
            "This is shitty but I dont think this photo and rumor(as far as other people are concerned) is enough to ruin your sister's career.  I understand why you are worried but worst case she sends the photo and an anon email, your sister's supervisors will likely ignore it.  If they dont, sis can just deny it.  \n\nI would tell your sister about what is happening though. ",
            "You have her tell her side of the story with as much detail as is verifiable: she dated an older Japanese man when she was younger. He helped with her rent/groceries on occasion. Nothing further. If she explains that everything else is the fantasy of a crazy manipulative cheater, they probably won't fire her on rumors alone.",
            "Can't she just deny it?",
            "IF she does anything, blackmail is illegal so she'll get fucked royally. But I would said talk to your sister and lawyer up.",
            "Let her tell the boss, and have your sister deny it. Whose word wins? The jealous, petty GF or the boss's hardworking employee?",
            "she can't harm your sister, it is her word against your sisters. At worst your sister had a boyfriend that bought her nice things.",
            "Your ex has zero proof the story you told her is true. You could be nuts and have made the entire thing up. Th guy in the photo could be anyone from your sisters ex boyfriend to  her ski instructor, for all your ex gf *really* knows.\n\nYour ex is a shit bag. Please don't reveal any details, about your sister to *anyone* again. \n\nGo to med school and make your sister proud, she sounds like a fucking awesome sister.\n\n",
            "I don't get the thinking of the GF.....\"Take me back after I just cheated on you or I'll out your sister\" ?!? And if OP went along with it, what did the GF think was going to happen? Everything was going to be fine? OP was still going to show her the same level of love and affection he did before this whole mess?!? Maybe I am too sane to figure out the mind of a crazy person. ",
            "I need someone to confirm this, but I'm pretty confident this is blackmail, which is illegal. What your sister did is not illegal (I'm assuming if your jurisdiction). Bring this to the police/a lawyer.",
            "You already got great advice. I just wanted to say I'm so sorry you're going through this.",
            "1) Tell your sister the whole story, if she wants she can call the dude to make sure he will corroborate a story about them having a relationship but nothing more.\n\n\n2) congratulate yourself on your freedom from a crazy asshole like her\n\n\n3) tell ex GF to go ahead and do what she wants because she'll only make herself look foolish -- you exaggerated your story to make an impact because you were drunk and feeling reckless. Tell her that any attempt to bring your sister down is only going to backfire because none of it is actually true.  They had a brief relationship and nothing more.  Also point out that if you have to blackmail someone into a relationship, you must be a REAL catch. Now congratulate her.\n\n\n4) construct an effigy of ex and BURN IT\n\n\nedit: advice from others about getting ahead of the narrative is a good idea, if your sister dropped to some coworkers that you have a psycho ex trying to fuck up your life that could be a good base to work from if she did decide to go nuclear.",
            "You should tell your sister right away, and the two of you should contact a lawyer.  Your ex girlfriend (and she is your ex, because you are not going to give in to her demands) is committing a crime.  I'm not actually sure what the legal difference is between blackmail and extortion, but that is what she is doing.  She is threatening harm against a member of your family if you do not perform a desired action.\n\nYou and your sister have worked very hard for everything you both have.  Please contact a lawyer to help you protect it.  He or she will be able to instruct you in what, if anything, your sister should say to her employer.  He or she will also be able to take steps to prevent future harassment from your ex girlfriend.\n\nYour ex probably does not realize the seriousness of what she's doing.  Getting a letter from the lawyer's office will probably be enough to scare her into silence.  But if it isn't, then you'll be very, very glad you have a lawyer to help you with whatever comes next.",
            "What exactly does your ex expect to get out a relationship where you likely hate her for cheating, she's threatening your family, you likely hate her for doing so, and all the other reasons it won't work?\n\nYou won't be in love with her over this, you won't like her, she doesn't appear to want to be with you because she already started looking for something more interesting..\n\nUnless she somehow thinks you're going to become her sugar daddy, she's being pretty irrational about trying to hold on to the relationship.\n\nTake the advice to prepare, and then when satisfied she can't do shit you can show her just what sort of relationship she's in for. Spiteful, angry, rude, just generally crappy. But that's if you're being vengeful, which isn't good for you as a person, but satisfying as a thought experiment. Perhaps it's better left as a thought experiment for how absolutely shit you could be as a boyfriend to someone blackmailing you without actually being able to do shit.\n\nIt could get to all levels of absolutely horrid behavior, and she likely doesn't understand that. This relationship will not work.",
            "Hit her right back with her own medicine. Save the messages she sent you and threaten to expose her psychotic ass to her friends, family, coworkers, whoever.",
            "Why is it any of her fucking business?",
            "I guess you have no choice but to get back together with her, marry her and love her forever. Seriously, what a shitty plan. Bitch is delusional. Go to the police. File a report for extortion and pick up a restraining order if you have time.",
            "OP, there's some really good advice on here. Listen to them. ",
            "Sounds like blackmail. Show her threats to the authorities. ",
            "Lawyer. Lawyer today. Lawyer yesterday.",
            "It's defamation and blackmail. Get police involved. And tell your sister NOW.",
            "first of all, I am sorry this is your situation. It is a tough one. In my opinion, which should be taken with a grain of salt, if you sister has a good relationship with her employer, a 23 year old approaching them with unsubstantiated claims (a photo of a photo is flimsy and hearsay) and no paper trail, it would hopefully be also taken with a large grain of salt. I understand you position that scandal alone can ruin a career in academia, but it is also a field in which claims like that are not uncommon. I know you situation financially is probably limited but if you lawyer up, with a decent attorney, it will probably stop her 'suite' in its tracks. Only an ambulance chaser would take her case based on her evidence, and they will abandon a case if the chances of winning are not in their favor and you have decent representation. If your post is accurate she has no hard evidence to prove her allegations and don't delete that message she sent you, blackmail is blackmail. She also sounds like a shit person so you can probably come up with proof that her allegations are unfounded and vindictive You have gotten a lot of great advice already but I couldn't help but chime in with my 2 cents. I wish you and you sister the best and fuck assholes for being assholes.",
            "Time to return the favor bud, fuck for your sissy. ",
            "All great advice. Next time don't share details about your sisters life or anyone else's.",
            "I don't have advice, I just want to point out that your ex sounds like a sociopath.",
            "Break up with her and let her sound like a crazy ex gf. I don't see your sister suffering any repercussions",
            "UPDATE!",
            "I don't like your ex girlfriend. :( You and your sister are okay if the girlfriend goes to the sister's workplace, I can't imagine she'd even figure out a specific boss to talk to, let alone anyone who'd listen to a brother's girlfriend about their employee.",
            "Why would someone want to black mail some body into a relationship? How could you date some one knowing they don't want to date you?\n\nEx should just leave op alone.\n",
            "Well ...never  shtup crazy they say. You better run mate. She will ruin your life.",
            "Don't answer",
            "You have received some very good advice here and I think you should listen to it. I think at some point you should talk to your sister about, she should know. You did fuck up, but you can take responsility for that, she may get pissed but she obviously loves you and will forgive you in time.  But going forward you dont need to tell future girlfriends of your sisters past, its not your business to say anything, she did what she had to do so that both of you could get on with your life, if she didnt you would be worse off.  Its not like when you get close to a girl you have to tell her, its not your job. If you sister wants others to know then thats down to her ad she should bring it if and when she wants too. ",
            "Your ex has just given you documented evidence of a blackmail attempt. Stall your girlfriend and talk to an IRL lawyer as soon as you can. ",
            "Isn't blackmail illegal?",
            "If you lawyer up remember this is defamation, not blackmail. Blackmail would assume that your ex-girlfriend is telling the truth. Defamation assumes your ex is a lying bitch.",
            "I would tell the the sister and the boss.  If the boss isn't super strict and serious, be hinest. If not, just tell him you have a crazy ex that is out to get your sister. \n\nBetter than leave him surprised by information that he will interpret however ones mind can go. Surprised, he may even think his sister gave that information herself as an invitation. \n\nWith a crazy ex story warned beforehand, he will just think it is made up. Or just not care if he isn't strict.",
            "The picture only proves this dude and your sister were in a relationship plain and simple.  Now go tell her to fuck off.  ",
            "If you're going to take legal action I would recommend deleting this post before you do, there's a lot of discussion here about spinning your story/lying and I imagine you'd know who this was if you were involved in the situation. ",
            "Just say the guy has links to gangs in Japan, and if she decides to tell your sister's work, you will tell him the names and addresses of all her family.",
            "Tell your sister. Don't reply to ex and go from there ",
            "This is blackmail and it's totally illegal. I recommend googling laws wherever you are and linking her to them. Tell her if she doesn't drop it, you'll press charges because what your sister has done is not illegal, and even if it was your ex has no proof other than a picture. Also, people date other people of different ages all the time, so the picture could easily just be her and her man. ",
            "Meet up with her, ask to see the photo.\n\nGrab the phone and delete it.  I doubt very much that she made backups.",
            "Coming from a recently-barred lawyer with no experience in an actual courtroom, the libel/slander route wouldn't work if you or your sister wanted to pursue legal action. Intentional infliction of emotional distress might work though. The other advice people have provided that your sister should warn her bosses is probably wise as well, there are enough mitigating circumstance to any story your ex could spin that people might just ignore her outright. ",
            "This is the worst fucking thing I have ever read. I feel sick with anger just reading this. \n\nAny update OP?",
            "Look, a picture of a guy! That means she's a hobag! Nobody in their right will give it even a second thought.\n\nLol. Just ignore her, it'll make her that much more pissed off.",
            "u/throwbabyjim did everything turn out OK for your sister?",
            "What she is doing is called extortion.  Record it and take it the authorities.",
            "I'd tell her you will go to the police because what she's doing is blackmail.",
            "Talk to your sister, get legal advice. Gl dude",
            "Blackmail is illegal.  Get her to threaten you over email.  Go to the police.",
            "I'm pretty sure blackmail is illegal. Seems pretty obvious what the easiest solution would be",
            "I like what others are saying in regards to telling your sister and getting her to let her bosses know of the situation first...  But you could also say to your ex 'haha go ahead,  you'll look like a fool - I can't believe you thought that sob story was true. Haha so retarded.' ",
            "Tell your x that she should be very careful about what she says because these yakuza guys have anger issues.",
            "Mafia-style intimidation might be called for in this case. ",
            "Why would you share that with her in the first place? If I were your older sister I would feel very disrespected and betrayed. Especially after all she has done for you. That is something your sister should be the one to tell people if she chooses. Not you.\n\nYou need to let her know ASAP so she can tell her friend. He can lose his job and social standing if your ex knows his LinkedIn. \n\nYour actions are a splash and ripples in a pond. Those ripples spread and touch the lives of others. Not matter how small the splash those ripples still spread and affect other people. Think before you speak.",
            "This story is ridiculous and fake.  Why would your ex GF take a picture of the photo?  That makes no goddamn sense.",
            "Drug her, take some nudes of her and post them everywhere if she carries on with her current course of action.\n\nOne good turn deserves another.",
            "r/humblebrag drop lol",
            "Seems like some roleplaying/creative fiction here. Too many holes in the story. It plays on very primal emotions in the reader and elicits a strong reaction in just about everyone who reads it. There is so much of this on reddit anymore that I'm starting to wonder if it's not just some bored Redditor desperate for attention but rather writers hired by Reddit itself in order to generate hype and draw in readers/users.",
            "[deleted]",
            "Wouldn't her peers hold her in just as a high regard or higher if word got out about her past?  I mean it's 2015 and being a sex worker should hold as much respect as any other profession right? Right?"
        ]
    },
    {
        "post_id": "ak3ysq",
        "author": "PixelCurls",
        "title": "My(25f) mom(72f) and sister(32f) are mad because I wont help them commit fraud.",
        "url": "https://www.reddit.com/r/relationships/comments/ak3ysq/my25f_mom72f_and_sister32f_are_mad_because_i_wont/",
        "score": 2321,
        "num_comments": 199,
        "created_utc": 1548530079.0,
        "selftext": "My sister owns a house and is currently in the process of losing it. She wants me to help her out by saying I live there and pay rent to help her refinance her mortgage. I however do not live there. I moved out a year or so ago and had a baby. I am currently living with my boyfriend in a different city. My mom is really mad at me shes saying that she doesnt understand why I dont just do it and that they could lose the house if I dont do it. She told a close relative that I have until Monday in a threatening way.My sister told me it'll be my fault if they end up homeless and she tried to throw in my nieces being homeless as well.\n\nThe thing is they use to do fraud all the time like it was no big deal and they want me to i guess follow blindly. They never learned their lesson from committing fraud because they havent been caught. They would take money out of my dad's account(somewhere around 15 thousand in total) and open credit card and phones under his name. My dad was from another country and sadly didnt know how any of those things worked or how to check on them. My mother is evil. I wont go into the things that she did to him or I or the rest of her children but shes bad enough to the point where I wont trust her alone with my daughter.\n\nmy father passed away last year. . I knew what they were doing was wrong and begged them not to do it and even got yelled at and scolded for trying to make them stop on several occasions. I never went to my dad though to let him know what was going on. I was scared he would leave us and now I know that was selfish and I should have just told him. Although I wasnt the one to take his money I have a lot of guilt for not speaking up I was around 17 at the time. I regret my silence to the fullest.\n\nAnyways here we are in the present and I'm made out to be the bad guy because I wont cooperate. For some reason they cant get it through their head that I dont want to chance getting fraud on my record. I can't do that to my daughter. I cant do that to my boyfriend. I cant do that that to myself. I feel like this is it. This is what's going to end our (mom and sister)relationship. I should also throw in that they both are pill poppers. It's a touchy subject with them. I get yelled at anytime I mention them and pills In the same sentence even when it's in a concerning heartfelt way. I'm hoping they dont try to forge the paper work or my signature. Part of me thinks they will if they somehow convince themselves that they can get away with it. I love my family I do...but I've realized they dont love me or at least not in a sincere way. Not if they treat me like shit for not wanting to commit fraud. They cant even try to look at it from my perspective.\n\nI tried to decline doing the refinance for the mortgage thing in a nice proper way but that didnt go over too well... Anyone have any suggestions on maybe how to end this on proper terms? Or is this good enough reason to go no contact with family?\n\nUpdate:  I just found out my work  didnt update my change my address when I put the forms in and now my w2's were sent to my old address (there's) I'm scared they can use these instead of my pay stubs and come my signature.  Everyone at work says they recieved theirs.  My mom said mine arent there yet idk if I believe her\n\n\nTl;dr sister and mom want me to say that I'm living with them and contributing to the household so she can refinance her mortgage. I'm not doing either of those things and dont feel comfortable with the idea of committing fraud. Mom keeps persisting and wont take no as an answer. Shes trying everything in her power to get me to go along with it. How do I make it clear that the answer is no???",
        "permalink": "/r/relationships/comments/ak3ysq/my25f_mom72f_and_sister32f_are_mad_because_i_wont/",
        "comments": [
            "If you haven't, already, you need to check your credit report to make sure they haven't used your information for identity theft.  And then put a freeze on your credit so they can't fraudulently use your credit.",
            "Put a freeze on your credit.  They probably know your social security number and this will limit the damage they can do to you.     \n\nStay firm.  You're in a horrible spot, but just realize that they needed to learn how to manage finances properly and that this house of cards will all eventually come crashing down around them.  And that you are not responsible for any of it.  And give yourself a break for when you were 17, you were a minor and didn't know what to do in a complex situation.",
            "u/PixelCurls about your W-2, you said that every other employee you asked had received your W-2? But you said that you Mom told you they didn't get it yet? That is very important... They probably DID receive your W-2 but, with their penchant for fraud, are probably going to use it to fraudulently receive your tax returns. First thing I would do is IMMEDIATELY call your employer and have them update your mailing address. Then go to your mother's house unannounced to get your W-2. \n\nAlso, call the police. Or at least their lender. What they're trying to do is illegal. ",
            "You are like 2 inches away from disaster. Stop talking to them.",
            "Stop talking to your mom and sister about this if they can't respect your \"no\". Walk away/hang up from any conversation where they mention this. They clearly don't respect you and your boundaries, so make your boundaries even more clear by getting some distance.\n\nBtw, I would highly recommend getting therapy to learn to set better boundaries with these people or even get the strength to go low or no contact with them. They sound like horrible people and just because you share DNA with them doesn't mean that you're obligated to keep a relationship with them.",
            "I am a lender at a mortgage company and I can tell you right now the chances of any underwriter using “boarder income” are very slim. Very very few lending programs allow this and as far as I have ever seen it’s only allowable when the mortgage holder is disabled. Further, if she claims you are contributing to the cost of the mortgage, they are going to ask for 12 month payment history to prove such. And it would have to be paid directly to your sisters lender, not to her. AND it would be a huge red flag that she has no history of claiming rental income on her tax returns and again most lenders don’t allow rental income if there’s no history of such. In conclusion, from a mortgage professional, please let your sister and mother know this is a moot argument because the “rental income” she would be claiming to receive from you would never be considered a qualified  source of income.",
            "[deleted]",
            "I would call your bank and freeze your credit first, then call the IRS (Taxpayer Assistance Center) for potential fraud on your W-2 as it was sent to the wrong address and you are not able to get it back. You learned your co-workers all received yours but when you called your mother said it wasn't there but you do not believe her.\n\n I would call her and tell her that if you don't get your W-2 by Monday that you will report her plan to use you in fraudulent behavior and it will win her a one way to ticket to a jail cell, because if there is anything the IRS hates is being tricked out of money. Treat her like the criminal she is and take her threats seriously. If she goes through with taking your tax refund, report her ass and have her sent to jail, along with your sister. Sorry, but they are taking advantage of a system and are being financially irresponsible and taking other peoples money, not just your own. \n\nIf you receive the W-2 and she still tries and threatens you, make it clear you have no qualms with going to the IRS for fraudulent claims. Then after that, go no contact and make sure to check your credit constantly. ",
            "I think you know the answer to this one - yes, this is a completely fair reason to go no-contact. Do you feel like your mother and sister respect you, or think affectionately of you? Does your relationship with them bring you moments of joy, or just worry? Only you know the answer, but your post definitely sounds like it would be a no. Force and threats are pretty much the opposite of love and respect.\n\nIt sounds like you have very good reason to be worried that they might try to forge your signature, so get legal advice on that (a free legal clinic near you, or a cheap short consult with a lawyer).\n\nGood for you for protecting yourself and your family and saying no to their plan.",
            "Are you serious about protecting yourself, your boyfriend and your daughter? If so, you will go to the police TODAY. They are going to put your name on this whether you agree or not. It's also very likely that this is not the first time they've used your name illegally. ",
            "Tell them no, I will not participate in financial fraud.  Stop discussing it with them.  If they persist in discussing it do not reply to texts, emails, social media, hang up the phone.  If they persist in harassing you cut contact, block them on social media and move on with your life.\n\nAnd make sure to lock down your credit with all three agencies and check your report for any funny business.  Since Mom and Sister are so entitled and prone to committing fraud you may be their next target.  Lock down everything in your life with security and passwords, make sure medical and school do not have mom or sister as people who can acces your information.  Make sure you do not have them on any bank accounts, credit cards, shared insurance, phone plans, Netflix or anything else.  Total financial separation is required.\n\nBest of luck with this.",
            "I know you may not want to hear this...but you should report them to the police. It will stop any form of them forging your signature or destroying your life, your nieces will be put into child services instead of on the streets, and they MAY learn their lesson. Edit: i see alot of people saying put a hold on your credit and they may know your social. I’m not sure what a hold/freeze on your credit does but you can get a new social security number at certain government offices if it has been or could be easily compromised. Two of my friends have had theirs compromised in the past year",
            ">\"Or is this good enough reason to go no contact with family?\"\n\nlol! Hell yeah! How much more of a reason do you need?  \n\nI know they're faaaamily but that doesn't mean they get to destroy your life.  They might not have been caught so far but one day they will. And you do not want to be involved. Your number one priority is you, your child and your boyfriend. Not your criminal mother and sister. It won't be YOUR fault the house is lost. Not one bit. Don't fall for that guilt tripping manipulation BS.  Stop talking to them, go no contact. And definitely lock down your credit. Now.",
            "Check your credit report and probably freeze it if you're not currently in the process of opening a new important loan. It's probably in your best interest to watch your credit report like a hawk. They may have your information to use for identity theft.\n\nKeep an eye on the proceeding events with the current situation. You indicated yourself that they may try to drag you in, even if you say no. Don't let them ruin your future.",
            "If you think your mother is witholding your mail, contact the US Postal Inspection Service (Google USPIS). The police might not care much about stolen mail, but USPIS will, and they have federal authority equivalent to the FBI.\n\nGood luck!",
            "[removed]",
            "You're doing the right thing. Just stick to saying no. I'm sorry that your family is putting you in this situation, but you're right. You have your own family to look after now, and you can't get caught up in their schemes and financial mismanagement. They can't make you do this. I would also keep an eye on (or freeze) my credit report if I were you; your mom sounds untrustworthy.",
            "You need to monitor the shit out of your credit to watch for them stealing your identity. This is plenty of reason to go no contact. ",
            "Honestly, go to the police. This needs to stop - your niece is going to grow up in a house just like you did unless _you_ can stop it. Are you able to offer yourself as a guardian should your niece need a guardian when your sister and mother end up being prosecuted?\n\nThis isn't something you can hide and ignore and just say \"well it won't get any worse\", because _there are going to be children growing up in this mess_. If you want to help them, you're going to have to talk to the police and do this the legal way.",
            "Freeze your credit and file a police report that they intend to commit fraud. Create a paper trail to protect yourself. They sound like psychos who will drag you down in a heartbeat if given the chance. ",
            "I'd also keep anything in writing with you saying no to this plan. Just in case they do forge your signature. I'd leave them to fend for themselves since they wanna do it illegally. You're right, you've got people (your child and bf) counting on you to be there. Let them worry about themselves cause that's all they care about. ",
            "Make sure your employer updates your address. Tell then you did not receive your W2, they should be able to get you new copies. File your taxes. If your family fraudulantly filed for your refund the IRS will take care of them for you. \n\nYou should check your credit report and freeze your credit. As to the threats? No is a complete sentence. I would simply not answer their calls or messages. What is the worse they can do? Stop talking to you?",
            "r/raisedbynarcissist will help you with this, because from reading this your mom is a narcissist, and your sister is a narcissist/goldenchild. And I also suggest you go NC with them, and ask r/legaladvice, because they have great advice, and helpful tools on this matter. You might have to contact a lawyer that specializes in fraud, and also hire a private investigator, and get the evidence you need.",
            "I haven't seen this commentted yet, but I feel like you should report them. They think this is okay because 'it's family'. What happens when they run out of family members to use? They might get bold enough to try this on someone else. ",
            "Make sure someone knows they may commit fraud under your name. I’m so sorry you are being gaslit and mistreated.",
            "I'm sorry, this is a hard way to find out who your mom and sister really are. Their definition of family includes \"family will commit fraud to bail out each other\", and they think love means unhealthy sacrifice.\n\nWhat's really unhealthy here is that by saying no to their absurd request is they are feeling like you don't love them, and that you don't love them as family because you won't rescue them - so they are feeling rejected and seeing you as the bad guy. It's easier for them to blame you for not saving them than face the consequences of their choices and make new healthier choices.\n\nYou make it clear the answer is no by cutting contact with them if they won't stop asking you to become a criminal and risk your life and your family to rescue them from their choices. If you feel guilt or shame or pressure, then I want you to imagine sitting in a jail cell missing your daughter while she grows up without you as your love is a single parent.",
            "I have been in this spot. Don't believe anything you here from your mom. She can't be trusted, they will ruin you. ",
            "Hi op, I am an underwriter for a mortgage company, and like one person said, the chances of them being able to use \"renter income\" from you is not high at all as this will be considered boarder income. If your sister's mortgage is fnma, she would need to prove you're disabled to use your income. She would also need to prove you have been living there, ie your paystubs, utility bills, driver's license, or in this case your w-2. But they also need to prove you've been paying them, ie they would need to see 12 months proof of money coming out of you and going to your sister's bank accounts. \n\nLike the other commenter said, unless they'd also forge disability documentation, and fake 12 months bank statements of her receiving rent from you, there's really nothing your sister can do. I think everyone else in the comments is making a much bigger deal out of this. What I mean is, no one from the mortgage company is going to be looking at your credit reports, or your finances or anything. They cannot fake your identity in this way - maybe in a different fraudulent event, but not just by claiming you've been living there. Believe me, underwriting goes into the actual borrower's life, but not really the boarder. But if you do feel like they will in the future use your identity to get a different kind of loan ( ie not a mortgage), you might feel safer freezing your credit report and putting a flag on your bank accounts. \n\nTrust me, underwriting will be able to tell you're not actually renting there and their plans will be foiled. Feel free to pm me if you have more questions. ",
            "Hi there. Sorry you're going through this. Seems like you are getting some good advice here but I wanted to offer my perspective as a former Mortgage Loan Officer for over 3 years. I have handled a lot of refinance and purchase applications. \n\nFirst of all, the amount of paperwork required to even qualify rental income is significant. Typically a lender would need 12 months of bank statements and cancelled checks showing the money coming into her account. Some would require the lease agreement. Additionally, rental income is only qualified at 75% of what is actually coming in. Lenders strip off 25% to account for potential vacancies, should the tenant decide to move out and it takes time to get someone else in. \n\nMy point: Not only is it fraudulent, it's also incredibly stupid. It's never going to work. Hit her in the face with the facts. Does this wizard of fraud expect to come up with 12 months of doctored bank statements showing money coming in that doesn't exist? It's laughable. She had better be damn good at Photoshop. \n\nIn the spirit of coming up with a solution for both parties, she needs to apply for something called a MODIFICATION or a hardship modification that allows her to lower her payments without refinancing. It sucks, it basically adds on years to the mortgage and ultimately you pay more interest but it does present the solution of lowering her payments which I assume is what she needs. \n\nDon't let her bully or threaten you, it's never going to work. I've had some people try to pull off fraud as I was just the first line of defense. SO many people look at the documents, I can't believe she even thinks it's possible, much less ask you to get involved. \n\nFeel free to message me. I think showing her she's stupid and telling her to apply for a modification should hopefully do the trick. ",
            "Call the police, you're going to end up in jail because of them.\n\nFreeze your credit too.",
            "I think you should tell your boyfriend. And as others already said, don't help them with their fraud, maybe go no contact. ",
            "Check out r/raisedbynarcissists ",
            "Even if you did go along with this (which you absolutely should not), unless you are actually giving them money, a loan modification/refinance based on income they aren't receiving *still* isn't going to be affordable! It may delay the process further, but they are likely to lose the house anyway if they cannot afford it. *Do not* let them guilt you into doing this. It likely won't save the house and it draws you into their toxic and criminal behavior. There's already a lot of good advice in this thread about protecting your credit/finances, but I do think you should consider low or no contact.",
            "If they need a renter to save their house then why can’t they rent out a room? \n\nSteer clear and get copies to file your tax returns asap before they do. \n\nKeep going in a better direction.",
            "Can't you anonymously tip the police? Or you can tell me their names and I'll do it for you.",
            "I haven't seen this mentioned, but it likely wouldn't work anyway. They'll want to see the actual deposits into her bank account for several months, as well as where the rent was accounted for on her taxes.",
            "Now that they have received your tax form I highly recommend looking into some sort of identity theft protection service. You need to protect yourself frpm these people and your mom could have copies of ss card/ birth certificate.  They could do to you what they did to your father.",
            "That's mortgage fraud, its serious.",
            "It might be hard and scary but it sounds like you need to get away from your mom and sister. Think of what would happen if you catch a fraud charge. Or worse. They are drug users. Their addiction will drain you spritually and probably financially. Your friends are your family now. 100% no contact.",
            "In addition to everyone advise on freezing your credit, you may also want to go to the Social Security office and attempt to have your social security number changed, it’s a pain but if your mother has your SSN, chances are she will attempt to use it in the future. My long time partner’s mother used her SSN to claim food stamps in a county we didn’t live in, and her tax return got redirected to the county’s government assistance office as a result. My partner lost over $2000 she was supposed to get back on a tax return as a result, no way to recover it. A massive blow to my partner, especially since we had hopes to use that towards a house down payment. Don’t let that happen to you please.",
            "call the bank they are trying to get a loan through and tell them confidentially. I am 100% certain the bank will be more than happy to deny the refi and keep your confidence. Also get Lifelock or something for your credit. Good luck",
            "Password protect your credit/freeze and inform your bank, your sister’s mortgage bank and anyone else that anything with your name on they need to call you and get a password from you before moving forward.\n\nI don’t know what you would do in the states, in the UK you can file this with help from CIFAS and action fraud but get all that shit locked down so you get alerted if anyone tries to get credit in your name \n\nThen block your mum/sister at least until after the deadline (personally I’d block them forever, they seem awful)",
            "I would get a pin getting the IRS immediately! They will file your taxes for a refund fraudulently. You can get an IP PIN and that will prevent that. But you must do it like now. ",
            "You call the Bank they want to refinance with and tell her that if they try to claim that you live there, it’s not true. That way they can’t just forge your signature. And then you go to therapy. ",
            "Girl, cut them out. They're family, but they are toxic people and will drag you down with them.",
            "Maybe you should apply for a different social security number at this point. ",
            "If they stole your W2's that's a Federal Crime. It's a felony that could result in prison time, the loss of the right to vote or hold public office, and significant fines. ",
            "I faced a similar situation after divorce and asked my sister to do the same as yours is. Difference was, i don't commit fraud and i wasn't asking because i was defaulting. i was only asking as a temporary measure until my divorce was finalized and my money was no longer tied up. Had my sister of not done it, i wouldn't have been angry because i get why it can be scary to do this. But she knew and i knew this was just a tehnicality on paperwork and for a short period of time. My bank actually told me to do this so they could approve.\n\nYour family has a history of fraud. They sound like liars, irresponsible with credit and money, and unreasonable. If they won't take no for an answer, go no contact for a while. Let them lose their house. They created this mess and they need to hit rock bottom to learn anything. Chances are, they want to refinance to take the equity out and be irresponsible with that, too.\n\nI also agree to contact your credit bureau and make sure you have no flags. \n\n",
            "I’m pretty sure there are companies that monitor your credit and ensure you are very aware of anything that happens with it. I would say this is your first step.\n\nI want to say that family is a wonderful thing to have but I really can’t. Not all people in your family deserve to be a part of your life. It may be very difficult but cutting people out of your life, even if they are family, is necessary. You have a little baby to worry about as well. The pressures and stress of toxic families members just isn’t worth it. Let them go. ",
            "Pull your credit reports to make sure they haven't used your info already, then FREEZE YOUR CREDIT. Very important to do this!",
            "Put a freeze on your credit ASAP. Make sure they haven't opened anything in your name already!",
            "I dunno of it will help or not, but go to the Social Security office and place a fraud alert on your name and contact all 3 credit bureaus and do the same. Ask your employer to reissue your W2's and let your family know you WILL press charges if they attempt to forge your information!",
            "They are trying to cause you emotional harm to get what they want. And what they want is for you to commit fraud. That's fucked ",
            "File your taxes at the soonest possible moment. You had a baby so you may qualify for the earned income tax credit and you don’t want them stealing it. Also, google VITA locations for free tax prep if you make under a certain income. ",
            "Go to the post office and forward your mail fron your old address to your new address ASAP.",
            "Cut them out. My mother did the exact same thing. She also tended to copy insurance forms and change them. You don't need this in your life. ",
            "Call the lender and let them know if the receive any paperwork with your name on it, to call the police.  ",
            "Once you get the financial and tax process under your control again, I hope you’ll visit r/raisedbynarcissists as sadly, others (including myself) have had financial problems because of parents like this. ",
            "They're drug addicts. Don't underestimate the damage a drug addict can do to themselves and others. Remove them out of your life. It's not a healthy environment for you and your child.",
            "There's lots of great advice about freezing credit etc. on this thread, and I can't really contribute as I'm in the uk and we have a completely different tax system here. I just wanted to say that despite what your mum and sister may make you feel, you are a good person. You know right from wrong, and you are setting a great example for your daughter by refusing to go along with their scam. ",
            "I’d report them for the fraud. Anonymously if it’s possible. You don’t want to get caught up in their schemes down the track by association. ",
            "[removed]",
            "Good for you for not following in their footsteps. So many people follow blindly instead of doing what’s right. ",
            "Freeze your credit and then tell your mother and sister to go fuck themselves",
            "In terms of checking your credit, I use both Credit Scorecard through Discover and Credit Karma. Both of these are free services.  Credit Scorecard will give you an accurate credit score, Fico, the one that is most likely used by landlords when you are getting an apartment. Credit Karma shows you your Transunion score, but it also shows all of your open credit cards and accounts. Additionally, it sends you an email when anything new is opened. I would definitely go through and check that every account is one that you opened. I would also get the updates sent to my email and check the account every week. Your social security number and other identifiable info will be on your W2, if your mother doesn't already have it. If they haven't already stolen from you, which I suspect they have, it is likely that they will start once you go no-contact. You should go no-contact though, as this behavior is manipulative and abusive. ",
            "First off, good on you. I know that holding onto your integrity when it can harm loved ones is difficult, but refusing to be complicit in their schemes is absolutely the right thing to do. \n\nHonestly, my advice is to report them. Don't let them drag you into this and potentially ruin your life. Contact the authorities, let them know what's going on, and cut all contact from them. These aren't the kind of people you want to invest your life in, and you don't owe them anything just because you are related. Turn them in, sever all ties, and continue to make your life the best it can be without them. ",
            "Plenty of people have covered everything else so I'll just say this - presumably they need you to say you're living there and paying rent because they can't afford the rates otherwise - doing this for them won't help them do anything other than dig themselves a deeper hole. You wouldn't be doing them a favour in the long run, so don't feel guilty.",
            "Report them to the police and IRS, everything you can to force an audit. Cut all ties to these toxic people",
            "Its overwhelming as for the toxicity your mom and sister carry with such ease. If they're willing to commit fraud and your W2s were sent there I'd put a freeze on my credit report. I'd also monitor ChexSystems given the chance they could or have opened accounts using your information. Also, I'd find the lender they need to prove this to and provide documentation and be sure to annotate it on that address. There's no way in hell they'd accept anything from a third party if you come in advance. By the way a person that has their mind up doesn't care about you saying no until you say yes.  It's unfortunate but you've gone above and beyond. Good luck and let us know how it goes.",
            "Like others have said put a freeze on your credit, and also cut those two psychos right out of your life and keep it that way for good. It is on no way your fault, their decisions leading up to that are all on them not you.",
            "I'm an attorney and you are wise to not want to get involved in this. The risk may be low,  but the consequences could ruin your life. You could go to jail, you could be labeled a felon, you could have trouble getting a professional license or security clearance, etc. Once you go down that path it just gets easier and easier until you get caught. It also gives your unscrupulous family members leverage over you since now they can implicate you in a crime. \n \nNo contact is certainly an option but you could also just end any conversation whenever they bring this up. That may wind up being the same thing, but that would be there choice. \n\nI'd also suggest freeze your credit reports and sign up for some kind of monitoring service. Many credit cards offer some form of the latter for free. Or there are plenty of low cost options. If they take out something in your name call the police. Don't let them ruin your financial life. ",
            "Put a hold on your credit / cards as soon as you can. I know you love your family, but they obviously don’t care too much about your financial outcome in all of this. ",
            "You're getting a lot of good advice here, so I'm not going to try to top that. \n\nIf you need to vent to people who really get it,  then r/justnomil (for mom) and r/justnofamily (for both of them) can help with a really great support system. ",
            "Just for fun suggest your mom claim it as her residence where she’s renting. ",
            "Basically Listen to all of this great advice ! Contact your employer to change your address. Call the IRS and tell them that your W-2 was sent to the wrong address. Freeze your credit and get one of apps or something through your bank where you can keep a close eye on your credit. Tell your Mother all of this, that you have contacted the IRS, and all three credit places and had your credit froze, and then tell her you are done. That you will not risk going to jail for them , that you have a family that you are responsible for taking care of. The current off all contact. I'm sorry but just because they are your family doesn't mean they deserve to be in your life.",
            "Freeze your credit asap. Even if they do have your w2s it would all be useless to them.",
            "Be very very careful, it is much easier than you think to get documentation on someone’s behalf without their presence ",
            ">My mother is evil.\n\nThen why are you even in contact with her?",
            "My advice to you would be to walk away from those relationships because they will drag you to the ground with them. That’s very very sad 😞 ",
            "Drop them like a bad habit.  They say you cant but you really can choose your family. Choose for them not to be a part of.  ",
            "You sound like a sweet hard working gal from an old timey tale with witchy mum /sis and in your quest for doing right the good lord blesses you with a handsome prince and you live happily ever after.",
            "Why doesn't your mom do it?",
            "You're family sounds horrible. I would notify the authorities, I wouldn't be surprised if they do your taxes so they can get the refund. ",
            "Lol. I wish I knew all this earlier. My parents screwed my credit up. Student loans, started weird businesses. But, despite all, i still love them. I wont snitch on them either. \n\nWhat comes around goes around though.",
            "I would keep any evidence you have of them asking and you saying no in case they do something behind your back. Save copies in multiple places. ",
            "My family is pretty similar to yours, and my moral stance on it is a little different from yours but I really don’t feel like that is what matters here. The issue is BOUNDARIES, your boundaries, that you have clearly put forth. Your family is pushing back in really unfair and manipulative ways. It doesn’t even matter what the reason is, if you are not comfortable with doing something and say so, you deserve to have that boundary respected. \n\nThe only advice I can really give is to stand firm. No one should be pushed or manipulated in to compromising out their boundaries. ",
            "If they don’t know your SS#, then there really isn’t anything to worry about. They file without it.It’s going to be ok, just talk to your company and get your documents. File and be rid of all this crap. \n\nIt sounds like you don’t want to be apart of them, so don’t and you do t need strangers for confirmation. If things get really bad, to mitigate it, get a restraining order. \n\nIt sounds like you already know what to do. Which is the right decision for you, your daughter and boyfriend. Sadly, your mom and sister cannot see what they are doing is wrong, but are now just desperate to continue the life that they always had. You’re not that life. You have your own! 😊\n\nThree things are always sure to happen: the sun, the moon and the truth. Let them figure it out while you live an honest life. ",
            "Do a change of address at The USPS website. It will redirect your mail to your new address for up to a year and it should go into effect on Monday. This will keep any more things from getting to them.\n\nYou can also tell your mom that all of your coworkers got their W-2 and that you will let the US Postal Inspector know that critical mail is not reaching their address. You can probably find out from work when they were sent as well. Most people know that US Postal Inspectors do not fuck around.  Might scare her straight.",
            "Holy shit. Do these lovely relatives of yours have ANY access to your social security numbers, credit cards, bank accounts etc? You need to not only tell them where to stuff their empty threats and their fraud plans, you need to make sure all of your sensitive information, as well as your baby's, are NOT accessible to them in any way. As for making it clear, you tell them \"My final answer is NO and this will be the last time I will discuss it.\" Then you block them. For good, because these people are criminals and they won't change. You do not want them around yourself or your new family.",
            "I don't understand why your mom can't say she lives there and pays rent. Why can't they do that and just leave you out of it?",
            "Other people are covering the financial/legal aspect, but I want to touch on the interpersonal aspect, because I get the sense that's what's  sticking in your craw.  TL; DR at the bottom. \n\nI experienced your situation a lot when I was younger.  I would say no to someone, and they would talk about how I was a bad person for saying no to them.  Oh no, I would think, I’m not a bad person!  If they said that I was a bad person, there obviously must be some misunderstanding.  If I could convince them *why* I was saying no, if I could get them to agree with me, they would see I wasn’t a bad person.  And if they kept pushing, it was because I hadn’t explained my no clearly enough, or nicely enough, or in the right tone.  And so I’d explain it again, and again, and again, sweeter each time, clearer, spending hours thinking of exactly the right turn of phrase, thinking that this time would be the magical time when they’d say “Wow, I get it now!  Thanks, striga331!” and leave me alone, and then I wouldn’t be a bad person, because they agreed I wasn't.  But they never did.  They always kept pushing.  \n\nYou’ve said your mom isn’t taking no for an answer.  But here’s the thing: you don’t need her to “take” no for an answer.  Your no doesn’t \"take effect\" when she agrees with it.  It “takes effect” when you say it.   Here’s another thing: you’re never going to get her to take no for an answer, no matter how clearly or nicely you explain it.  You’ve told her what your answer is.  It isn’t that she doesn’t understand your “no\", it’s that she doesn’t respect it.  To her, your “no\" isn’t the end of the discussion, it’s the start of a negotiation (props to Gavin de Becker for saying this in The Gift of Fear).  \n\nEvery time you engage with her, every time you explain or defend your decision, she is not hearing “no.”  She is hearing, “I can change her mind if I push hard enough, if I keep trying different angles of attack.  I just need the winning strategy.”   To her, as long as she can keep you talking, as long as you are still standing there and engaging with her, then you haven’t *really* said no.  So the solution is to stop talking.  \n\nYou need to make clear that “no” is your final decision, end of story.  If she persists, you cut the discussion off, period, and *do not engage*. Report her to the authorities if necessary (absolutely don't do what your family is asking, but that's a whole other can of worms that's been pretty well covered by others).  \n\nI can tell you from experience that putting your foot down will feel scary, and awkward, and weird.   She may say that your sister's homelessness is your fault (spoilers, it's not), or badmouth you to friends or family.  Here’s thing # 3: the fact that someone *calls* you a bad person does not mean that you *are* a bad person.   She’s not saying the homelessness will be your fault because it’s true.  She’s saying it will be your fault because she thinks that blaming you is a way to control you.  And if you do what she wants because she blames you, you are proving her right.  And, frankly, she’s going to *keep* doing it, because now she’s found the winning strategy. \n\nTL;DR: Stop trying to convince your family to accept your no, because they're never going to.  They're trying to manipulate you into committing a crime, but the only way to win this game is not to play.\n\nEdit: Phrasing in last paragraph",
            "Contact the police. Also contact the IRS and ask them how to proceed regarding taxes. And most definitely break contact. Think of it this way....if you weren't related to them, would you have anything to do with them? Proceed accordingly. Toxic relatives are dangerous",
            "I see zero reason to spare a relationship here. Cut contact and run far, far away. Everyone has given you great advice. Freeze credit, call your employer, and -maybe- call the IRS and see what can be done. \n\nIf they lose the house, it's on them. Don't fall into their ways or traps. You have your family (husband and child) to put first.",
            "Don't feel bad for doing the right thing, it's them that have the problem not you. You should be proud of yourself x",
            "Go to FTC dot gov and you can freeze your credit with the three major agencies and get copies of your reports. If they’ve done anything with your info you can also report stolen identity. Please protect yourself and don’t let them use you!!!",
            "You also might take a look at the r/narcissist subreddit and post there for advice on handling your family.  ",
            "You have a partner and have moved away from them, seems to me you are better off without them.",
            "Really check if they have stolen your Identity while maybe destroying much for you, it will only get worse if not, secondly go to the company that has the contract and make clear to them that you don´t live there and since when and ask again after they had to renew or change the contract as to know if they have forged your signature which if they did so would be ground for a lawsuit and penalty for them.\n\nIf they become threatening to you you should take all the messages including the conspiracy to commit fraud which you denied and the threats to the police.",
            "I would cut the bridges with them, it is poison for your familly",
            "Yeah, absolutely not. Stay far away from these manipulative people. Monitor your credit and finances. I would cut ties completely. Nothing good will come out of this ",
            "I work as a mortgage processor. If they haven’t already started the application process you should definitely freeze your credit. If they can’t pull your credit they can’t put you on the loan. Also, they would have to show proof that you have been paying rent. All additional income has to be documented and verified with bank statements to match. ",
            "You can't just tell a mortgage company someone is paying rent. They are going to look for regular payments coming in. They examine months of bank records. This stupid plan isn't even going to work. ",
            "Cancelled checks and deposits is just the tip of the iceberg. But yes, my point exactly. If you want to quickly diffuse the situation, blaming the mortgage industry is the way to go. It became exhaustingly more difficult to get a mortgage, specifically refinance, after the market crash. ",
            "This is emotional blackmail.  If you do this for them, you will be complicit in an illegal act, have no illusions, if you relent & do this, they will use this against you in future to get you to do worse things because they will then have this over you to threaten you to go along with them.  It sounds like both have addictions, so one day they will forget to cross their t's & dot their i's  ...& the law will come calling, when a person is arrested, everything in life is put on hold, you don't get to go home & pack everything away for after prison because the landlord throws everything out, your babies are taken off you & society makes it exponentially harder to get a foothold back into normality, few people will employ you nor want to give you housing let alone trust you, especially with money & a life of struggle is the end result, you need to set boundaries & tell them in no uncertain terms, you love them but you refuse to break the law for anyone, make sure your partner supports you in this too, as for your poor dad, if they can so easily take advantage of him - someone they were supposed to love & honour, they can do it to you too, they're putting their own wants before you & your family, maybe it's best to cut these toxic ties until they both come to their senses, if they can't or won't, focus on living your best life with your own partner & daughter. Good luck hun.",
            "Sorry to hear you're going through this. You really have to stand your ground and cut ties if need be. You are a great mother for protecting your little girl like this!!",
            "What ethnicity are you??",
            "Wow, your mom was 57 when she had you. Congrats",
            "So I take it you're not a fan of Walter White?",
            "[removed]",
            "[deleted]"
        ]
    },
    {
        "post_id": "9c9gd4",
        "author": "clearlyimawitch",
        "title": "Update: My BF[21M] is not handling me [22F] going to Law School Well",
        "url": "https://www.reddit.com/r/relationships/comments/9c9gd4/update_my_bf21m_is_not_handling_me_22f_going_to/",
        "score": 2316,
        "num_comments": 280,
        "created_utc": 1535862017.0,
        "selftext": "Hey everyone,\n\nIf I missed your comment on my last post i'm really sorry and I've just been super busy with law school as well as my relationship. I decided to take a week to let things settle in even further. I made it explicitly clear that his behavior wasn't ok and we needed a change if this relationship was going to survive. Verbally he was on board, but after 24 hours it really fell apart.\n\nTonight, I pulled the plug. It was hard, and awful because I do love him and I will always love him but we are no longer in love. He asked me what I wanted, and I said I wanted him to be ok with less communication and be confident in our relationship, so that I could be at school guilt free. I asked him what he wanted, and he said he wanted more of my time, communication and energy.\n\nHis wants had nothing to do with what was best for me, or would make me happiest.\n\nThat was really hard to hear and we both cried for awhile when I pointed that out. He understood, he saw it coming and he didn't beg or fight it. We just cried.\n\nSo anyway, I wanted to say thank you to EVERYONE who reached out to me. Seriously, it made me feel like I was actually in control of the situation and not crazy for walking away. Thank you for being a community that validates others feelings and is honest and truthful.\n\nNow, I'm gonna go shower and watch stupid shows on netflix.\n\n**TL:DR Broke up with my boyfriend when he couldn't adjust to the lack of free time I now had in law school.**\n\n[Original Post](https://www.reddit.com/r/relationships/comments/9a0ylv/bf_21m_not_handling_me_22f_going_to_law_school/)\n\nEdit 1: Wow. I never thought this post was going to explode like this - in fact, it was locked originally by a mod.\n\nWith that being said, I’m going to ask the mods to lock it again. For everyone, this has been an incredible discussion and I have read all of it. For those who are supportive, thank you!\n\nFor those who are on the team that I’m a hypocrite - sure! Fine! I’m completely ok with that. If I had the time and energy to argue how badly phrased I wrote last night, I probably wouldn’t be single right now.\n\nAny way, thank you reddit! You guys are wonderful.\n\nEdit 2: Still waiting for the post to be locked, but trying to respond to as many comments as I can. \n\n&#x200B;",
        "permalink": "/r/relationships/comments/9c9gd4/update_my_bf21m_is_not_handling_me_22f_going_to/",
        "comments": [
            "Sounds like the right result, law school is no joke. Especially if you’re interested in corporate/big law/ white shoe firms. The fact he didn’t fight it actually shows that maybe he wasn’t so immature, you guys just had different needs from a relationship, which is fair.\n\nI’m not a text all day person when I’m busy either, whereas some people do it to keep them sane. Incompatible, best to both move on and be happier ",
            "~~I feel like I should point out that your wants didn’t have much to do with what was best for him or would make him happiest either.~~\n\n~~I’m not saying this to be combative or to shift the blame over to you or make you feel guilty or anything like that. The point I’m trying to illustrate is that this is neither of your faults, and neither of you did anything wrong. You both just want different things in life and have conflicting expectations for your relationship that can’t be reconciled.~~\n\n~~The fact that you still care for each other and cried for each other is proof that this is the case. You’re being pulled apart not because either of you are bad people to each other, but because your lives and your ambitions have different trajectories.~~\n\n~~So please don’t hold his expectations for a relationship against him, in the same way that you wouldn’t want him to hold your decision to leave for law school against you. That animosity doesn’t have to exist. You can still be friends without blame.~~\n\n**Edit:** HaHAAA, BOY did I fuck up.\n\nSeveral commenters have pointed out to me that he was obnoxiously clingy and downright codependent, with some examples cited from OP’s first post. Admittedly I neglected to read the original, and did not have a full context of the situation. That is my fault, and I apologize. Now that I have read it, I completely agree that he was exceptionally needy and has an *enormous* amount of growing up to do. He is immature, overly-dependent, and not really making much meaningful effort to be better.\n\nIn normal circumstances, my original comment would apply, and I wholeheartedly encourage people to examine their relationships to see if it may be the case. I've seen best friends tragically morph into bitter enemies because they were simply looking for different things in relationships and didn't realize it until after they had committed and let it create a rift between them and the one they once loved more than anyone else in the world.\n\nOP's situation is **not** one of those circumstances.\n\nAdmittedly, my experiences are what made me leap to the conclusion I did. It was presumptuous of me, and I'm starting to realize that my assumption has likely led to a lot of heartache, criticism, and accusations of hypocrisy on OP's part. \n\nThis is absolutely unacceptable. I made an awful mistake, and I take full responsibility for it. I would implore everyone reading this not to do what I did, but since it's becoming abundantly clear that I'm not the only fool who neglected to read her original post, I'm going to highlight a few things from it that further clarifies the situation:\n\n> He can't manage to show up in a timely fashion for anything, can't keep a part time job and whines the moment he isn't entertained\n\n> He is also whole heartedly way too reliant on me. Stupid shit like \"Should I go grocery shopping right now or go to the gym?\" And i'm like, \"Why does my opinion matter? This isn't something I should have an opinion in.\" Because it's really not. **What would happen whenever I refused to answer is he just wouldn't do either option and just lay around all day.**\n\n> **In a 36 hour period, he texted me \"What are you doing\" 17 times. 17 bloody times**. I ended up face timing him and was like this is unreasonable, unhealthy and needs to stop immediately. He seemed to hear it but a few days later, he's back at texting me several times a day to ask what i'm doing.\n\n> Every time i've talked to him in the last 10 days we've gotten into a fight. **Everything from a full blown fight to passive aggressive squabbles**. It's reached the point that the moment he starts being passive aggressive, I just say I have to go and hang up. I'm so brain dead that staring at a wall and doing nothing is actually relieving, I don't have the energy to constantly fight with him and deal with passive aggressive comments. He's like, \"Why don't you FaceTime me more often?\" Because **every time we talk, we fight or you harass me about when is the next time we are going to see each other**.\n\n> wanted to know if he could come up and stay in my new apartment for my first week of law school. I said heck no. I genuinely am gone all day, i'm exhausted and I need to be making friends with my colleagues and adjusting to my new city and life. ... This didn't settle well and he's asked probably every other time we've talked about when he can come visit. I genuinely can't even gather the free brain cells to think about what to have for dinner, let alone when I can squeeze in time for a visitor and the amount of pre-work I would have to do.\n\nWith all of that in mind, OP absolutely did the right thing, and it couldn't have been any more timely. \n\nThe way I see it, he wasn't getting something he wanted from her, so he was resorting to passive-aggressive behavior in an attempt to shame her into sacrificing all of her independence, her ambition, and her attempts to make a life for herself in order to lavish him with as much attention as he wanted. No matter how you look at it, this is emotional manipulation, plain and simple. Either he is hopelessly naive or consciously malicious, because no one in their right mind would think that forcing the one you love to return from 8 long hours of non-stop studying to over a dozen texts asking where they've been is in any way benign, especially after it's been warned against in the past. \n\nEven if you take the former optimistic answer that he's just an idiot, it is still completely and utterly unacceptable, and he has a lot of learning to do before he's ready for another relationship. But if you take the more cyncical latter answer, she didn't just escape an overly-attached boyfriend; she deftly evaded a malicious attempt to drag her into an endless cycle of abuse.\n\nEither way, OP saw it for exactly what it was and she would not have any of it. She asserted her agency, and it shouldn't just be accepted, but celebrated.\n\nLike, goddamn. If only more women (and men!) had her willpower and foresight. If more abusers were more conscious (or caring) of the pain they were inflicting upon the ones they supposedly loved. And if only we, us so-called \"relationship experts\", would do more to empower the victims of abuse, instead of criticizing them for not being \"more understanding\" or \"more patient\" for the benefit of their abusers.\n\nThank you to everyone who was willing to confront me with what I was doing. And to OP, I'm so sorry. You are not a hypocrite. You're an inspiration.",
            "Sometimes you just have to put your needs over the needs of others. Law is time consuming so will a job be in the legal field. You will definitely need to find a partner who can understand this and be accommodating of such things. He could clearly not accommodate such things. Besides that i wish you luck with your studies.",
            "Hey I read your first post and I just want to say even though it was hard you did the right thing.\nI also just started my first year of law school and my husband has been an angel. No sending messages or bothering me, cooking for me, encouraging me to study and driving me all over the place.\nThe kind of behavior your boyfriend was exhibiting was unacceptable. \nThe right person will support you and won’t complain while doing it either! \nGood luck in your 1l year, we’ve got this!!! ",
            "My ex was like this when I started medical school. We ended up breaking up. I should have broken up with him sooner. You made the right decision, kudos! ",
            ">His wants had nothing to do with what was best for me, or would make me happiest.\n\nIsn't the reverse also true though?",
            "In five to ten years, you'll look back at this as one of the best decisions of your life. ",
            "Lots of people here commenting having read the update only and not the original.\n\nYou did the right thing. Your ex texted you \"what are you doing\" *17 times in 36 hours* and *couldn't go grocery shopping without asking you first*. He wasn't just asking for more communication on a reasonable level. He was asking for more than most people who *aren't* going to law school can give. ",
            "You made the right choice. I had this same problem when I went to college and I still tried to make it work. In retrospect it was a huge waste of time and energy for me.",
            "Chin up, fam. Take care of yourself. Just remember, you are young, and have a whole career and life in front of you. You worked hard to get here, and you need to keep working for a bit more while you achieve your dreams. I think it's awesome that you prioritized yourself in this, because that is one thing I can promise you will never regret in life. Good luck for your future, and I'm sure you'll find someone soon, who's perfect for you. ",
            "I missed the first one, but after going back and reading your original post, I'm glad to see this update. You sounded done in that one anyway. Just done with the relationship, done with him, and ready to move on.\n\nAlso, good for you for recognizing that school has to come first. One of my biggest regrets in life is not taking college more seriously, because boys. The one semester I was single (yeah, I know.) was the one that I made straight A's. The rest of it, I mostly got B's and C's, because I just didn't have the mental energy to both study and deal with my then-boyfriends.",
            "[deleted]",
            "Good for you! I did nearly the same thing last year when my clingy boyfriend would constantly pick fights with me while I was starting a new semester and a new job. It sort of felt like he was trying to sabotage my success to make himself feel better about his own lack of motivation. I knew what was more important and so did you!",
            "I compare this to having a career in showbusiness or being a doctor. You kind of have to be single on the way up. The sacrifice is too great in the beginning.",
            "YES GIRL GET THAT LAW DEGREE!  I love seeing other women going into law (I’m a 3L).\n\nI hope the breakup doesn’t get in the way of you studying.  I broke up w my bf before studying for the LSATs and I was fucked up about the breakup.  It was a pretty bad breakup that took me a long time to get over (not him, his shady actions messed me up).  But I put my feelings aside for a few hours at a time when I was studying and gave myself permission to grieve afterwards.  Honestly I didn’t really truly process the breakup until after I took the LSATs bc I was just so busy w full time work and studying and dance classes to really grieve.\n\nLaw school contributes to a lot of breakups because it is such a jarring change.  It has to be your main priority outside of self care.  Just wait til 2L when you’re working or interning in addition to classes and readings ;) \n\nLaw school is it’s own brand of hell but I would not trade it for anything.  Best wishes!!!\n",
            "I will get down voted for this, but OP you did the right thing dumping him. A great education and successful future is simply the bedrock to a successful relationship. I wish I learned this years ago as I passed up great opportunities over a relationship and it didn’t last. \n\nNEVER let any person dictate your dreams and goals. It will never end well and you will resent them. Next person you become serious with please give them a heads up that they are important but not to mess with your goals. ",
            "Good for you. If he's not trying to support your dreams and goals, he's  not the right guy for you. And the same goes for you, if you can't support the dreams and goals of the man you're with, you're not right for him. ",
            "This thread made me sad 😢",
            "I hope it works out and you'll both be happier this way",
            "You said his wants have nothing to do with what is best for you, but is the opposite true? I read your original post and it sounds like you fell out of love quickly and that he is just bothering you constantly. I think it's good you two broke up",
            "Coming from a lawyer, you did the right thing. The legal profession will demand just as much of your time as law school. So, this issue was never going to get any better. Best of luck! ",
            "The first year of law school I fatal to so many relationships because partners don t seem to grasp how important one year can be. You did the right thing for yourself and for your future career. ",
            "This happens a lot. I went through law school believing I was both a terrible student and a terrible boyfriend/fiancée. I'm so glad I waited to get married until after finishing school.\n\nIf you're a 1L, it will get better (at least getting more efficient in reading happens).\n\nActually practice your practical legal writing. Take whatever you enjoy, but if there is a class (or classes) that are enjoyable and involve writing motions, a brief, memoranda, etc., you should aim to do a few of those at least (unless you know you're doing transactional work, so perhaps your school has a contract drafting course or something?).\n\nEnjoy your time in law school. Your 2L and 3L years are pretty great relatively speaking. And (not to be the bearer of bad news), but law school involves a lot more free time than practice for many people. So there's that?\n\nYou made the right call here. It's not his fault, and it's not yours. You two just were not going to work. Many strong relationships die (or never form) because of law school.",
            "It does take a big person to be so generous as to put up with the time and money involved with law school.   My wife and I moved to a new place for my job - she was good about it.  But there were few opportunities around there that interested her, so she asked me if it was “ok” if she explored law school as a reputable one was nearby.   She ended up enrolling.  I happily supported her, and the dollar cost was manageable.  But over time her understandable focus on doing well in law school took a toll.  I got promoted to a VP position that took 10 hours a day 6 days a week to handle.   Coming home late afterwork to a dark house, no food, no companionship got old for me.   I grew impatient.   She graduated with honors and flew past the State bar on the first try.   I was happy for her, but by then the relationship had gone totally south.   She was a bit of an introvert, so I could not expect her to spot and rally to my needs.  But she was an attractive, intelligent, good person.  We had almost a decade of good times together.\n\nWe split up shortly after she graduated.  She went on to a good career as an asst AG, and I went on my way.  I took a new job in another state and never saw her again.   I really wanted to see her for a dinner to talk over what happened, and to let her know that I did not ever consider the problem her fault.  She was loyal and good to me.  A few months back I found out that she died last November.  So that conversation will have to wait.\n\n",
            "Good call!! I'm in my last year of law school and one thing I learned through all these years is that if your SO can't understand how horribly time sucking law school is and that it's not that you don't love them it's just you simply do not have time then the relationship is doomed to fail. Good luck!",
            "A good friend of mine is in medicine. Her husband of the last 11 years takes their boys hunting and fishing, does marathons with her and the boys as that's her big thing, cooks them healthy meals, they all go on camping trips he plans, he goes to her social events, and is very supportive of her going back to school for her master's degree. They met online after she went through a similar situation. \n\nThere are really great, supportive, chill, independent, one day family men out there (if you want a family one day). I'm sorry for your break up, but it sounds like you need something different anyways. Best of luck!",
            "Jumping in before the mod-lock, you do what's best for you. Maybe you'll be friends someday, maybe not, but I'm glad to hear you've done what you needed to do to deal with your own life first.",
            "❤️ Good luck with everything!",
            "Thia might be the most mature break up story on Reddit. Sorry this happened. Best of luck at law school. ",
            "I think a lot of people are being harsh on you - saying you’re selfish and should have broken up with him earlier, and I don’t agree with them. \n\nYour situation sounds like a magnified situation I went through about 8 years ago. I was with my boyfriend at the time but was “just” working. So I had a significant amount of free time. I was putting a ton of effort into our relationship. What we would do, where, financially, I would always go TO him. Ect. He supported me going back to school because he wanted me to better myself. So I started taking the prerequisites for the program I was going into. At that point I was going to school full time, as well as working full time - and just didn’t have the energy to also plan what we would do, had quit my second job so I didn’t have extra money and he “didn’t” either. I finally got sick of it and sat him down and told him I had put the effort into making the relationship work for over 2 years, and this past year he hadn’t stepped up to the plate and that’s what I needed. Because the next year I would be in the program I was going into (Dental hygiene - not law school but for an associates degree it’s a demanding 2 years) and would need him to take over the x,y, z. Now mind you we lived together so we had a system as far as meals, cleaning, ect. But - it was the actual relationship part he put zero effort into. So his response when I essentially told him o needed to feel like he actually wanted me as a partner and to understand what I needed - he said “I am putting so much effort into other areas of my life right now that I don’t have any energy to put into a relationship”, which crushed me because it made me realize that he had been coasting our entire relationship. Because I had always carried us. \n\nNow I understand that this is different than your situation because what you need is space and your ex-bf couldn’t give you that. But I guess what I had read (of course by projecting my own experiences into it) was that you may not have realized the amount of effort you were putting into the relationship prior to law school. I will say I now have an extremely supportive husband, we both work on things and put effort in. We are a true team. I get so much more emotional support from him that o ever could have imagined - considering my ex was a narcissistic asshole (which I didn’t see until I was out)  \n\nIt may not have been easy but it was the right choice for both of you. You couldn’t give each other what you needed but I think at least giving it a shot was the smart thing to do. ",
            "This relationship is simply a mismatch. There’s no right or wrong here: you want different things. Even though it’s hard, it’s better to figure this out now and end it than to move forward.  And there’s no need to castigate either person. ",
            "Glad it worked out as well about as well as it could have. There are plenty of dudes out there who will support your career and respect your time :)",
            "My husband went through a period of wanting another baby when I was accepted to grad school. Took some conversations to work through it. It is too bad that you had to break up with your boyfriend but it sounds like it was a bad fit, and it does not sound like there was a conversation to be had, he was not going to work on changing or improving. ",
            "I am a bit late to this post, but maybe you'll read this OP. I am a medical student, so I can totally relate to the amount of the workload and the overall stress. I have a boyfriend who has been with me throughout the entire studies (5 years as of now) and I can say this is possible only with a person, that is 100% independent and not clingy. I think you did the right thing. Don't worry about dating now, just focus on the school as it is your top priority and sooner or later you'll come across a more mature person. Good luck with your studies! ",
            "Girl, don’t worry. Everything will be fine.\n\nI dumped my high school boyfriend of 5.5 years my second semester of law school. He was verbally and emotionally abusive and had been insecure (proud of me in his own way, but insecure nonetheless) for our entire relationship that I was motivated and successful in school and that I graduated college and enrolled in law school. \n\nI took the rest of my second semester to not date (messaged guys on Tinder for funsies lol), went and studied abroad through my law school, casually dated someone when I came home for a few months.\n\nI said I’d NEVER date someone from law school — well, here I am, 3 years later, living with the love of my life — who I met in law school! I know it’s hard to think about someone new right now (or maybe you’re like I was and you were so fed up you’re totally thinking of finding someone new, lol) — but in law school, you will find a smart, motivated guy with similar values to you and who will be able to commiserate with the absolute hell you are currently enduring. I met my boyfriend during pre-session before 2L Fall. By end of the semester, we were dating. Our last semester of law school, we studied abroad together.\n\nYou are sad now of course but you have SO MUCH BETTER waiting for you. Your life is gonna be great, and you’re gonna find someone who puts your needs first and who is gonna be perfect for you.\n\nBest of luck in law school — it sucks but you’ll be fine. Try not to stress TOO much. Start outlining early and take practice tests with a dean who can review the format of your answers if you can. Much love!",
            "> His wants had nothing to do with what was best for me, or would make me happiest.\n\nWell, you asked him what **he** wanted.\n\nWhile I totally understand your point, and in practice you may have done the best thing, you still have kind of a self entitled attitude.",
            "[deleted]",
            "I just read both posts.. I honestly think you’re very selfish. Not because you want an education but from reading post one, you clearly don’t /didn’t love and want to be with him anymore. You were forcing him to leave you alone so you can do what you want, rather then just ending the relationship.  Maybe this is just my opinion, but I think you should have broken up with him before law school and had been more honest with yourself. ",
            "You made the right decision. He would have just dragged you down.",
            "I understand the struggle, I was working two jobs on top of going to school and my ex had the balls to say I wasn't spending time with him. I told him fine I'm moving out and he changed his tune but the marriage fell apart a year later  ",
            "Probably the right decision but what’s up with everyone resorting to “break up now” for this? I mean come on. I posted on here a while back and every single response I got was just to end it. I ended up just talking it out with my so and things are fine. ",
            "[deleted]",
            "Watch Bojack Horseman! Great for emotions. Hang in there 💕",
            "The space you need is there. Live your life and be happy. Serendipity can still happen. ",
            "You're making the right decision. There's no guarantee it would work out if you stayed and no guarantee it would fall apart if you left. \n\nI went away to school for 4 years and stayed with my girlfriend in a long distance relationship and a few months after I came back we broke up. \n\nLife happens and you gotta be sure that you have put yourself in the best position for when the worst happens. ",
            "Hey OP! :) I also just started my 1L year in law school, and strangely enough I just finished my second week also (wouldn't it be funny if we went to the same law school lol). I just want to let you know I completely feel for you. I'm single, haven't been going out, and I'm still honestly swamped with work and readings. I know it's really hard, but please keep your head up. \n\nI've heard that it's pretty hard for relationships to be maintained during law school, and honestly, it seems like your now ex would not have been able to handle the rest of 1L very well (especially during finals week, can you imagine?). Don't listen to these other obviously non-law school people (no offense, and I'm not trying to sound pretentious or humble-braggy, but I really just don't think they understand). You're NOT selfish for breaking up with him or for making law school your #1 priority. \n\nAnyways, just wishing you best of luck! I know you're gonna kill it during 1L! Please enjoy Labor Day, if you have that off! :)",
            "[removed]",
            "Just went back and read your original post.  You were never in love with this guy.  He was always clingy and needy.  Ending it really was the only choice.",
            "[removed]",
            "[removed]",
            "I'm struggling on the other end of this dynamic.\n\nI'm really into this lawyer, but I need more communication, at the very least, that he's just not able to give me. It makes me sad, because I really like him. I could see us being great partners. But he doesn't want to try. He's just not into me, I guess. ",
            "I read your original post. If you are still on okay terms with him perhaps mention that he might benefit from ADHD testing. Much of what you're describing sounds like an undiagnosed and unmedicated young man with ADHD.",
            "Not sure why not try to maintain a relationship? My gf (34) and I (32) have been dating for 5 years, 3 of those through Medical School. Anyways, best of luck. ",
            "Good job on knowing what was right to do.\n\nAlso, check out Insatiable on Netflix for a good stupid show to watch. ",
            "Good choice. :)\n\n>but we are no longer in love\n\nI didn't understand this however?",
            "[removed]"
        ]
    }
]