[
    {
        "post_id": "bcj70v",
        "author": "Contractorgirl",
        "title": "I (35F) not sure if my marriage is going to work out with husband (45M).",
        "url": "https://www.reddit.com/r/relationships/comments/bcj70v/i_35f_not_sure_if_my_marriage_is_going_to_work/",
        "score": 2312,
        "num_comments": 374,
        "created_utc": 1555105153.0,
        "selftext": "My tl;dr is at the bottom. \n\nMy husband (45M) and I (35F) have been together for 10 years. We have two children, an 8 year old and a 9 month old. My husband was a very nice husband before I was pregnant and during my second pregnancy. After our second baby was born he started being very mean to me. He has always been a bit selfish, but it was always something I could handle before.\n\nHe tries to ruin things I have planned. As an example, I was going to take my dad to an event and my husband calls me and tells me he is going to be two hours late to watch the kids because he has to go shopping. Then he tries to push me to be mad at him. He will say, does this upset you? Are you getting mad? Then he will act like I’m the crazy person when I do get upset with him. \n\nHe makes fun of my hobbies or puts down and activity I do.  I actually took up running because he likes it and it was something I could do without him making fun of me. We planned to go on a run together and I set up a babysitter for an hour. I was waiting for him to show up and he never did. When I asked him what he was doing he said he was running. So he left me hanging while he still got to enjoy the activity. This also wasted a precious hour of babysitting time. \n\nHe is also unnecessarily cruel. I went on a four day trip with our two kids. He stayed at home because he had to work. When I came home he told me that maybe he could pick me up from the airport but maybe not. I told him it’s fine I will take a cab. But even up until I got on my plane ride he was telling me if he was free he would be at the airport but there was no guarantee. Then after I got home he immediately started lecturing me on spending money on our older son. Which, after a four day trip of taking care of two kids (one being a baby) I was just exhausted and didn’t want to be lectured the second I walked through the door. So I just told him I agree with you and I’m sorry. But he just kept going and going. \n\nOther examples of him being cruel are him telling a family member that I can’t handle the baby by myself. pouring a pop down the sink that I gave him saying he doesn’t want that pop and then grabbing the exact same brand of pop out of the fridge to drink.  \n\nI could go on but I think these might be enough examples. Like I mentioned earlier, these behaviours have been happening after our second baby was born. As things happen I do usually call him out on the spot, but he usually gaslights me in the moment and we get nowhere. He wants to go to couples therapy or just personal therapy for himself (his idea). But I’m honestly wondering is it worth it? I would prefer not to divorce but I’m honestly wondering if we could save this marriage or should I just walk away? \n\nTl;dr: husband has been treating me very badly for several months. He wants to go to couples therapy but I feel like the damage is done. How do I proceed?",
        "permalink": "/r/relationships/comments/bcj70v/i_35f_not_sure_if_my_marriage_is_going_to_work/",
        "comments": [
            "> He wants to go to couples therapy\n\n**Never EVER go to therapy with an abuser.**\n\nAll that will happen is that, as you unburden yourself in a supposedly safe space, he will use the information against you afterwards.  He will gaslight you, insisting that the therapist didn't say what you know damn good and well she did.  He'll try and wear you down and have you doubting your memories and feelings.\n\nIf that doesn't work?  He'll insist that the therapist is biased against him and refuse to go.  He'll counselor shop until he finds someone he's sure will side with him--i.e., someone incompetent who will do the lazy, \"the truth is somewhere in the middle\" bullshit.\n\nPlease, PLEASE, get therapy for yourself, alone.  Your husband is abusing you and it's only going to get worse.  You will reject the \"a\" word--victims always do at first--so if you want to call it \"toxic behavior,\" that's okay.  Having said that, can you look up the following terms for me?\n\n* cycle of abuse\n\n* trauma bonding\n\n* gaslighting\n\n* Issendai sick systems\n\nYour husband's sudden change is par for the abuser's course.  They always wait for a moment when they believe that you are well and truly \"caught\" to start the bullying, the insults, the long slog to destroy your self-esteem.\n\nI know, your first instinct will be to fix him.  Please don't.  You can't.  And no, it doesn't matter why he does what he does:  the important thing is that he IS doing it and that it will destroy you.\n\nPlease visit either/or Thehotline and loveisrespect.  Read through their resources. **Do not use any of your personal electronics to do this.** Get a copy of *Why Does He Do That?*, **but don't keep it anywhere that he can find it.**\n\nThis man will not only destroy *you,* he will destroy your children as well:  growing up in a home with an abuser is...abuse.  If you won't save yourself, PLEASE save your children.  If you don't, they will resent, even hate, you for having done nothing to protect them.",
            "When i took my kids on a 4 day trip w/o my husband he showed up at the train station at midnight, muscled his way on to the platform even though the train staff said it wasn't allowed. He said i was traveling alone and it would be impossible for me to get our kids and luggage off the train by myself. He waited until 1:30am with our stroller and baby carrier b/c of the delayed train. \n\nWHEN THE MOTHER OF YOUR CHILDREN NEEDS YOU TO PICK HER UP AT THE AIRPORT, YOU PICK HER AND YOUR KIDS UP AT THE FUCKING AIRPORT.",
            "[removed]",
            "Your husband doesn't seem to give a shit about you and your feelings at all. He is abusive and if you don't want to subject your kids to his abuse, you need to leave. Do not go to couples therapy with an abuser. It will only give them more ammo to use against you.",
            "He is deliberately doing these things because he doesn't respect you and he wants out. Try to find out if he is hiding assets or money. He sounds like the type who will suddenly turn poor when you divorce, so be careful.",
            "I really have a gut reaction that he may be having an affair or affairs. It’s common for guys to start putting down their partner when they do this. Running 2 hours late to a family event because he needs to go shopping ?! please. I’d loose my shit on my husband instantly in that situation.\n\nHe’s looking for excuses to be away from you and the kids... I think you’re better off moving on just based on how he’s treating you but I’d bet money on an affair being the catalyst for how he treats you. \n\nRather than realizing the affair is their problem and their flaw they put the blame on the other person ... my partner is so (fill in the blank here) that’s why I’m incapable of keeping my pants on... it’s sad but I’ve seen it happen so much it’s kind of a classic tell tale sign. \n\nGod I hope I’m wrong though. I was cheated on and I’d wish it on no one!",
            "The pouring pop down the sink thing, yeah, no. He's being a crazy asshole on purpose and seeing what he can get away with. Get out now.",
            "I've been visiting this sub for 5 years and this is one of the worst cases of emotional abuse I have read.",
            "You sound terribly unhappy. He's suggested therapy but from an outsider perspective that just feels like he wants to stick a band aid on a gaping wound.\n\nIf you're looking for people to tell you to leave... Leave. You need to think about what's right for you and your well-being, and that of your kids. Do you want them growing up thinking the way he treats you is the right way to treat a loved one?",
            "I don’t think there’s any therapy that can fix this. He’s just a jerk, plain and simple.",
            "So this might be out there.. but this happened in my family.  A cousins husband started acting completely out of character.  Years and years they were together and started acting like you have described.  It started slowly, and got worse and worse.  Have you considered having him checked out? In my cousin’s case, she left with the kids, but down the road he he was forced to seek medical care.  He had a brain tumor.  It was found so late sadly it was too late.  The behavior you are describing seems really malicious.  If these are traits you never saw before your second child and before they started would say was completely out of his character, I would urge you to get him seen.",
            "This is psychological abuse. Plain and simple. You need to GTFO now.",
            "Sooo what exactly are the positives here? I’m so sorry your husband is a turd.",
            "Since he was never like this before your second child was born, I think he's having an affair and/or a mid-life crises.\n\nHe's trying hard to find fault with you. That's a classic mistake when someone is unhappy with themselves - blame their unhappiness on the easiest target that isn't themselves. Since he is currently abusing you, and he wants to go to therapy tell him to go to therapy and figure his shit out or you are leaving. Draw the line at his bad treatment of you and mean it. \n\nI would also do some snooping if I were you to see if he's seeing someone. Screenshot whatever you find and save it.\n\nWhatever his unhappiness is, it's not your doing so refuse to take any blame and turn it back on him. If he's resistant, I would quietly shop for the best divorce lawyer in town and get your plan B in place.",
            "Get a divorce lawyer now",
            "He makes fun of your hobbies, does things intentionally that piss you off, doesn't care about inconveniencing you (maybe i'll pick you up, maybe i won't vs. he can just let you comfortably take a lyft), talking shit to your family members about how incompetent you are (you can't handle the baby by yourself), and worst of all he gaslights you. \n\nPlease ask yourself, would you ever treat someone the way he treats you? If the answer is no, then you need to leave. You should be with someone who treats you with kindness and respect, not with someone who manipulates you and doesn't seem to think you're worth respecting.",
            "He's an abuser. And he's not an \"accidental\" abuser (ie, has incredibly bad coping mechanisms, or a bad view of relationships due to negative childhood experiences), he is a *deliberate* abuser. He is going out of his way to make sure your life is miserable.\n\nThe only reason he wants to go to therapy is to learn new ways to make your life miserable. \n\nThere is nothing to save in this marriage because he does not want you to be happy. Go straight to divorce.",
            "My ex-husband (father of my children) was exactly like this. Controlling, manipulative, undermining me as a mother and a wife. He would make fun of the nerdy things I love (sorry if I’d rather watch Doctor Who than the latest Fast and Furious movie) and say he “didn’t want to do that stupid shit.”\n\nWe’d argue until I was in tears and he made me feel like I was crazy for being upset and then I was expected to just act like nothing happened afterwards. The last fight, my five year old son ran in and hugged me, telling him to “stop making Mama cry.” \n\nThat was it. I woke up the next morning and asked him, “Is it always going to be like this? Because I can’t do it any more.” \n\nI am now (happily) divorced, my kids are happier, and I’m getting ready to move in tomorrow with my boyfriend of two years, my kids love him, and the ex and I ended up being better co-parents when I stopped taking his shit. \n\nIf you’re miserable, the kids will know. Get out while you can!\n\nEdit: typos",
            "He's gas lighting you ..\nHe's textbook narcissist \nWants to make you look bad so he has a reason to leave .\n\nDo yourself the favor document everything somewhere safe dates times ect see a lawyer tell him nothing and a trained therapist .. then if u want to leave or he ends it u are 2 steps ahead",
            "He is gaslighting the fuck out of you, he is an abusive POS. But I think you know this already. Don't go to therapy with him, there's no point and I feel he's only suggesting it as a subtle way to say that the problem is with you, not him.\n\nI went through some of this kind of shit with my ex and it can psychologically destroy you if you stay too long. From your responses it looks like you know what you need to do. Good luck, you can do this.",
            "He isnt selfish he is a total asshole. Get a lawyer, record the pattern of abuse in a diary, take yourself to therapy and find support. Hopefully you realize how ludacris this behavior is.",
            "Op your husband is abusive.  And that he was nice prior to the second baby might be that common tactic where an abuser figures you're now trapped and he can keep escalating the abuse. \n\nI would suggest op that you take a read of \"Why does he do that\" and talk to a divorce lawyer.  Start the progress to leave, get documenting his behaviour and work on what you'll need to do to get full custody. \n\nIt doesn't get better op.  These type of deliberate emotional abuse just escalates.",
            "It seems to me that he is done with the marriage and trying to push you into getting fed up enough to file so that he isn’t the bad guy who left his wife and two children. I don’t think he sees that by being a disrespectful abusive monster to you, he is now and will always be the bad guy.\n\nI don’t know his side, and I honestly only care about yours, but that was what popped into my mind when I read this. I could be way off base and he’s just a horrible person just because he’s a horrible person and just couldn’t hide it a moment longer. I hope you can get you and your kids away from him. Nobody should have to grow up like that. What he’s doing isn’t love, it’s pure rage filled contempt.",
            "My first thought was he’s having an affair. Maybe, maybe not. As it’s quite common for cheaters to start picking fights for no big reason like your husband does. Other possibilities are mid life crisis or some sudden neurological problem. So as a first step he needs to see a medical doctor.",
            "Thank you everyone for your advice! I am still going through all the comments and planning my next steps. What I am thinking of doing is talking with a lawyer and planning a separation. I will still go to the therapy with him. I will just be extremely cautious as many of you have warned me. Thank you all so much! I will update you all.",
            "This sounds like some crazy resentment that is manifesting in passive aggressive actions. I am so sorry you are having to go through this and being the target of this. I am always going to advise going to therapy before going to a lawyer. You oh it to yourself, so you don’t have to look back and ask “what if ?“ Best of luck to you and this very difficult time you’re going through",
            "He is trying to make you break up with him so that he can say its your fault",
            "I think ur husband might be cheating",
            "\"pouring a pop down the sink that I gave him saying he doesn’t want that pop and then grabbing the exact same brand of pop out of the fridge to drink.\"\n\n&#x200B;\n\nWhat kind of monster is this?",
            "I didn’t scroll down through every comment so it’s entirely possible this has been suggested... has he had his health checked in the past couple of years? It’s not necessarily likely, but still a possibility that when people start to act dramatically different, there’s an underlying health issue like a brain tumor. \n\nAlso, is it possible that he’s having an affair? Can you have his actions and whereabouts followed or do it yourself? Check out his phone (I don’t encourage this in normal functioning relationships) to see if there is any evidence? I say this because a co worker of mine has been having an affair for almost 2 years and while his wife was completely blindsided, her husband had been really mean to her after their second child and it was around the time he started being mean, that he started his affair. If he is and you can gather evidence, it’ll only help your case in a divorce. Please do homework on what to look for and how to document things and collect evidence; do NOT tell your husband. He’s already abusive and him knowing that you know his secret may put you or the kids in danger. Reddit has a ton of real work advice for dealing with the documentation, contacting a divorce lawyer and going through a divorce with mean spouses.\n\nAlso, seek help from a lawyer and get your ducks in a row before he knows you decide to divorce him if therapy doesn’t work. He sounds like he could do some pretty cruel things to you in retaliation for losing control.",
            "That sounds pretty bad, and very hurtful. I would not want to live in that negative, unpredictable atmosphere. \n\nIf his behavior is dramatically different since the birth of your baby, and he was a great guy beforehand, he might have post partum anxiety/mood disorder. My husband had it with both of our kids. He was neurotic, demanding, unreasonable, and sometimes straight up crazy. It took over a year to get back to normal, and I wish now that we had searched out professional help instead of soldiering on by ourselves. I know it's usually viewed as a woman's problem, but it's a huge change in a guy's life too. Just a thought, before you leave him. But of course I do not reccomend staying with him if he's just being an arshole!",
            "This does not sound like it's worth saving.... Save yourself and your children they're watching and learning how to treat relationships through you guys.",
            "Yeah,  why are you putting up with that nonsense? It's also having  a very bad influence on how your children, especially the older one, understand relationships. Divorce this asshole.",
            "This is absurd. He’s abusive. Why is he escalating? Who cares. Divorce him before this affects your kids. Believe me, they will pick up on it. They’ll wonder why dad treats women this way and why mom allows it. They may well then see it as normalized for their own future relationships. \n\nPlease be safe. This kind of thing often escalates to danger levels.",
            "Wow what a vile person.",
            "> He wants to go to couples therapy\n\nto be blunt: this is a trap.\n\nyou need a d lawyer",
            "Sit down and have an honest conversation with your husband. You have been together for 10 years and he's only started to behave like this recently? Maybe there is a reason for it. It might be a childish way of coping with something that's bothering him. Maybe he feels like you're spending more time with the kids and therefore have a closer relationship with them than he does? (Just an example) \n\nAs long as you have an honest convo in which you tell him how you feel and what is bothering you I think you'll end up with more closure at the end of it. \n\nI think it's really selfless of you to not want to divorce as it would really affect your children in a negative way but I also don't think you should let your husband treat you like this. If he doesn't have a 'reason', consider couples theraoy. If that doesn't work divorce him OP.",
            "I personally wouldn't stay with someone who is gaslighting me or trying to goad me into getting angry.\n\nI would recommend therapy all around, but I would also recommend a consultation with a divorce lawyer.",
            "Leave this idiot. There are good men out there that will treasury a person like you; all you have to do is meet them.  You usually don't find what you are not looking for!",
            "Do you want your kids to be like him when they grow up?\n\nIf the answer is no, divorce him.",
            "I have a dad who is like this.  Not to my mother though, just to my sister and me. Mostly me. What your husband is doing is emotional abuse and what my dad did and continues to do to me is emotional abuse. It has had many adverse reactions on me and I have developed panic disorder. I don’t mean to hijack but to explain my point, It’s caused me to get into relationships with abusive men which have compounded my anxiety and panic. In the past few years I’ve not be able to work, I’ve not been able to go to school and I haven’t been able to leave the house to socialized. I’m 24 with my life suspended. All I do I currently is therapy to help get my life on track and sort through the trauma. So my point is.. please don’t stay with this man, think of your children. I can guarantee it probably does affect them. Please also consider maybe getting therapy for yourself and your  kids as well. Emotional abuse is often silent  but it can have devastating effects on people.",
            "[removed]",
            "I don't care if you feel sorry for yourself or if you are suffering. You have the responsibility to protect your children from someone who treats people like this and is comfortable about it. Take care of your family and from there on you can start healing. This is not the time to make compromises, you are normalizing severe emotional abuse. He'll treat your children the exact same way he treats you. You have a whole life ahead of you, you should make it count. \n\n&#x200B;\n\nIf you really want to work this out, you pick up your children, move out and work it out with him. **Priority should be protecting your children, at all times.**",
            "Your children deserve to see their mother treated with respect and love. I wouldn’t want my kids in that situation. Regardless of if you were happy in the past, you aren’t now and your relationship is unhealthy. I always try to put my kids in my shoes and see if I would want them to deal with these same issues and what I would want for them to do in the same situation. If you stay, you teach your daughter that it is okay to be treated poorly or your son that it is okay to act this way toward a spouse. My parents stayed together for years and had a very unhealthy relationship. My dad always said he was staying with my mom “for the kids” or “until we graduated” and then he wanted to leave. I wish they would’ve just split then, because living in a house with an unhealthy parental relationship does more damage than a divorce, in my experience.",
            "I can’t imagine a world where my significant other said “maybe” to picking their own children up at the airport. Fuck the relationship between you two. He mad mouthed you for “dumping out a soda, then drinking the same brand of soda” and “spending too much on your child” it seems like he is using your kids as pawns. It’s so weird that you planned on running together and then he went without you. He sounds like an abusive man and he needs to go to therapy. Good luck.",
            "Married when you were 25 and 35 respectively. Almost always dangerous territory.",
            "Dude needs a brain scan or he is trying to have you make the big decision to separate without looking like the bad guy",
            "I think your husband needs a CAT scan or MRI. A sudden personality shift is sometimes indicative of a brain tumor. I know that sounds insane and maybe it is, but you said he was normal and nice before. This sounds very new and recent. I also think your husband could be depressed. I think therapy will work. And I really think you should consider a scan.",
            "OP, if you decide to divorce, I strongly encourage you to talk to a divorce attorney well in advance of telling your husband. There are steps to take to protect yourself financially and otherwise.",
            "Wow. I’m so sorry for you I’m sending internet hugs. Your husband just completely switched up overnight, and started acting like this? Or was it a always and now it’s escalated to this? it’s such bizarre and over the top behaviour that you should maybe go to counselling if you would like to save your marriage but you should also make sure all your ducks are in a row if it doesn’t work out. \n\nDoes your husband have any other new weird behaviour or just being a petty asshole? The only reason I ask is sometimes really changed behaviour with no reason you can see, could be a issue with his brain, but only even consider that if the behaviour is absolutely new and not a worse continuance of previous behaviour.",
            "Everyone is all calling the husband abusive and i agree but, arent you guys curious as to why he became this way. OP said he wasnt always like this and i get that it would be hard to walk away from a long term marriage.    I think he needs help. Spmethings must've happened to him to be this way.  Maybe a trip to the doctor for him would work, idk, the comment about the tumor is possible. Good luck OP, hopefully it all works out",
            "Please go and please let us know when you're safe.  This is some not-viewing-you-as-human level stuff.  Like torturing puppies for fun kind of behavior.  I'm honestly alarmed and worried about you.",
            "That sounds a completely abusive person, that's abnormal behaviour.",
            "I wonder if your husband has narcissistic personality disorder...might be worth reading up on. Regardless, if this person is really as awful as you describe him, it's time for you to decide what you want the rest of your life to look like: you can either stick around and expect the same kind of shit, or you can start making moves and be deliberate about the kind of people, energy and behaviour you let pollute your mental garden. I'm so sorry you've had to deal with such unnecessary nonsense.",
            "I have two thoughts on this - one is along the lines of everyone else (cheating? Abusive?) and the other is that if this is such a sudden change in behaviour for him, could it be possible he has a brain tumour or some other pathology?\nIt’s up to you whether you’re willing to consider and investigate that, and what you do from there. \nAbsolutely this behaviour is abusive though, and you need to protect yourself and your children.",
            "After such a long time of being a good husband and father, why has he changed so suddenly? I wouod strongly suggest that he get checked out by a Dr and psychologist. Even if he is sick or temporarily like this, I would not stay in thr same household and recieve this kind of treatment. Maybe tell him you love him, but he needs to leave until he can figure out what is going on and fix it?",
            "[removed]",
            "Imagine your best friend wrote this and asked your advice. What do you tell her?",
            "So as I scrolled through the comments everyone says your husband is an abuser. He may well be an abuser. You just had a baby this year, you may have post partum. Go and see someone for yourself. Not with or for your husband and make sure there is no post partum depression. Then make a decision.",
            "This seems like a dramatic change and is a huge red flag. I think personal therapy for him would be good. How is his psych? The soda pop thing is unusual, it could be a symptom of something larger..or he’s just an asshole. However, before you think about divorcing, I would say therapy/doctor visit would be good. You never know.",
            "You said this is new? Like never before, or just less so before the baby was born?  He's 45, that's old to be dealing with a crying baby and a job.  I mean if this truly is a new thing  I'd say sleep deprivation is making him miserable and he takes that out on whoever he can.\n\nIf it's not new and only gotten worse than it likely won't change.  And you should maybe listen to the people that are saying to lawyer up.\n\nIf it truly is new HE needs to go to therapy, don't throw away a 10 year marriage when someone is going through a rough patch for the first time in a 10 year long marriage.  When people feel shitty they take it out on others and while that's not alright, it doesn't mean it can't be fixed.  Maybe he's depressed or stressed over finances, lack of sleep, work, something.",
            "I feel like based on the timing he’s the one that can’t handle the baby. Maybe being a father to two children is too much for him and he’s being an ass to force you to leave?",
            "Am wondering, what triggered your husband's change of behaviour in the 10th year ... If he's very nice for most of your relationship, and he's willing to try and face his problems (theropy), perhaps worth trying, at least to see what causes this?",
            "Your husband is a piece of shit and you really need to get the divorce and find a decent human being to be with.  Who leaves his wife and kids possibly stranded at the airport??  I highly doubt this guy was ever nice at any time.",
            "Sounds like a narcissist",
            "It is very likely your divorce attorney will recommend you go to couples therapy to show the courts you made every effort to save the marriage. In all likelihood, he won't show which would be perfect for the divorce. So step 1: get a good attorney. Step 2, follow his advice which will likely include the instruction to \"document, document, document\". In fact, start documenting today. Keep a private journal, maybe online with a password.",
            "Jeez, this really sucks for you. You must be pretty damn tough to take this for as long as you have. Yeah, get out of there. Good luck, and don't let him get you down!",
            "Yikes, divorce for sure. Give him what he wants but won’t say. (Divorce)",
            "Sounds like a gigantic man baby. Please, dump him. You don't need to deal with his tantrums on top of raising your kids, and I'm not sure he'd be exactly the kind of influence you'd want around them.",
            "Is having a lawyer on call possible? I’d give him an ultimatum - he can stop being an asshole or you’re divorcing him. If he gives you an answer you want to hear and reminds you of the man you fell in love with, give him another chance (but remain cautious and don’t tolerate his shit). If he gives you a bad response, I guess it’s time you start building a life without him that will be a good platform for raising your children without his toxicity as much as possible. Good luck, OP! Post an update!",
            "Please don’t let this man raise your kids like this. My father was like this, and he absolutely destroyed me and my siblings with his constant manipulating and abuse. He’s not going to get better. My father has been abusive for the past 19+ years, and you do not want to keep living  like this. It’s miserable.\n\nYou need to get away from him, for both you and your kids. You deserve to be happy, not to be manipulated and gaslit all the time. He’s a bully.",
            "I've been in a relationship with someone who gaslight. I fear that if you go to therapy with him he will try his best to show the therapist that you're the problem. He tries to get you angry so he can be like 'see, she gets mad so I'm not to blame! I'm the victim!' even if your reaction is justified. He knows you won't destroy him back so he has the high ground. Not all therapists can see through this.\n\nSome people take a while to show their true colors. It's up to you to see if you want to deal with it.\n\nYou sound like a good person btw. Taking your kids to a vacation and being so calm with him when he tries to rile you up.",
            "He sounds EXACTLY like my neighbor's husband! He was the SAME WAY to her (except worse sometimes, and it's still going on) and there is. no. cure. Sorry to break it to you, but he is the one who needs to change and unfortunately he is a narcissist and therefore he's never going to admit that he's at fault so he's never going to get help.\nYou need to leave him. Take the kids with you and file a restraining order against him (just for you, for your own safety) and go to court for custody of your children because you really, really don't want someone like him raising your children. Especially since he's a classic case narcissist. Looking forward to a possible update later - good luck! 🍀",
            "What the fuck? This must be awful to live with I would absolutely get a divorce lawyer. This is emotional abuse .",
            "He sounds absolutely horrible and aware of his actions. I think you'd be better off if you just left and didn't give him a chance to manipulate you any further in therapy.",
            "Get out of there. He is getting off on hurting you.",
            "He sounds like a bad dude. A narcissistic asshole really...I hope you find the strength to leave him. This does not sound at all like love.",
            "This is abuse and I’m so sorry it’s happening to you. I know that you don’t want to divorce but in my experience abusers don’t change and no amount of therapy can make a difference.\n\nIf you feel safe to do so, for your sake, and for the sake of your kids, walk away from this man.",
            "Okay, when I was with my ex, around 3 years in, I had a dinner with a friend. We were talking about relationships, and I was talking about all the things my ex did that I wasn't happy with. During the conversation it was clear, that this wasn't a good relationship and that I really should end it - I needed to say the things out loud on order to realize this. I feel, if you read your post out loud, you will have the exact same realization. \nMy mistake was that it took me another 1,5 years and a child to end the toxic relationship we had. Don't waste your time. For your, and your children's sake.",
            "He’s an abuser for sure. I wonder if he  is trying to get you to push for divorce because he has a little sweetie on the side that he wants to get together with?",
            "I reckon he feels trapped in the marriage and resents you.\n\nThis does not excuse his abusive behaviour, so unless you file for divorce, which is probably the best thing, I would recommend sitting him down and having an frank discussion to the tune of, I get that you hate me for some reason. Why? Do you want to fix this or should we move on in different directions? If you want this marriage to last for the rest of our lives, we have to be 100% straight up about what is bothering us, and clearly something is bothering you to the point that you are being a piece of shit to the person you supposedly love.\n\n Do not let him gaslight you, record every bullshit thing he does when he does and how it made you feel it so you can mentally know you have ground to stand on.",
            "OP this stories are crazy. Not  normal at all. Please leave him  now. Not couples therapy worthy. Be careful the guy is a bad person and migth try to scrub you and your childrens in the divorce.",
            "I get that it’s hard because of the kids. There is a lot both sides put up with because of this but this seems like there’s no Joy in your relationship at all. Plus it sounds like he lives to confront and incite you",
            "Listen hes being abusive and if you cant leave for yourself, leave for your kids. I grew it in an abusive situation and it messed you up as a kid, and do you want to put yourself and your kids through that situation. If you do want to speak to your husband about it, tell someone you trust so they can pop around after your chat, in case he gets physical, im not saying he will buts its a precaution.\n\nHave a list mentally and say you make me feel like crap by doing X Y Z and i cant put up with it anymore, you're not the man i married and im filing for divorce because i cant see things getting better. \n\nLastly I just want to say sorry that your situation, I know you probably never imagined this when you were getting married or when you planned and had your kids, but sometimes life screws our plan. It will get better and you will find someone who will treat you right.",
            "What you described is NOT a team working together, which is what a great marriage should be.\n\nTo me, his behavior sounds like he's baiting you into a reaction, or baiting you into dumping him. It could be a cowardly way of trying to get out of the relationship (he's not happy and is trying to push you into suggesting a divorce so he can blame the break up on you). \n\nOR he could just be abusive and is pushing you gradually to see how far he can manipulate you. \n\nEither way it's all horribly unhealthy. \n\nI can't help wondering if the \"couple's therapy\" is another manipulation. Either manipulating you and/or to show others how hard he \"tried to make it work\".",
            "He is an abuser, don't go to the therapy, the damage is done, you need your peace, you deserve be happy, you should get divorced.",
            "Sounds like he is a sociopath to me",
            "So sorry to hear about this. Don't waste your time with a guy that does not respect you. He already checked out, now it's your turn. Before things get worse.",
            "Ok you've been together for 10 years, have 2 kids, and this is a very recent (and dramatic) change in him. Doesn't anyone else see that this sudden shift is a big deal?\n\n\n\nIt could be mental illness. It could be PPD, or something triggered by the stress of a new baby. Men can be affected too. I see everyone is cautioning against doing couples therapy, but he also wants to do personal therapy. He should do it. Even if you're set on leaving, he should do therapy for himself bc something is wrong. He should probably also go to a doctor (if that's not already part of getting a referral for therapy).\n\n\n\nI know he's being shitty and abusive, and that behaviour isn't something you should have to live with. I think it's concerning for him as well - this is ruining his life and if it can be improved with medication or surgery, he should know about that option.\n\n\nWhy not separate while he gets his shit together? He wants to do therapy himself. Why not get yourself out of the situation and see how it goes?",
            "This must be terrible and I am sorry you are going through it. You sound strong and loving. Don’t let him continue to beat you down. No one deserves being treated like that. Your call if you want to go to therapy. But you should make plans to move forward with a divorce and go to therapy with a strong head on you that you will move on the moment he starts using anything against you. Therapy is tricky, you both have I want to change. (Not saying you have to change) but assume you aren’t perfect. Have you asked him if he is happy? Has the concept of not being together ever been brought up?",
            "It sounds like he wants a divorce but wants you to do it. Do it.",
            "A lot of guys that cheat get real mean while they're cheating. I don't know what it is, one of those I can't be bothered to break up with this person so I'll drive them to break up with me instead kind of thing.",
            "Not to sound like a \"break up!\" Cryer but also if you feel like he is gaslighting you and might try to make you seem like an incompetent parent please save the messages on a secret Google drive or something about what he has done. Also talking to a lawyer doesn't mean the divorce starts that day. A divorce lawyer will have experience with this and probably knows several therapists, groups, etc. They'll be able to help you figure out the smartest way to leave if that's what you decide. These actions of your husband are blatantly intentional so that's why I would advocate for divorce. If he were simply a forgetful person or just quirky about not wanting a certain soda, yea sure try therapy but this is just intentional cruelty. Your kids shouldn't have to see their mother treated that like, kids notice that stuff and they project those feeling into their own lives.",
            "At the end of the day communication, trust, respect and kindness are essential to any relationship. It sounds like you’ve lost all of these so maybe a trial separation might let him see what he’s losing. See how that goes and if you can build back up to healthy levels again. Once you’ve got a break from him I think you’ll know your answer. Good luck!",
            "Walk away and see a lawyer",
            "He is an abuser, you are a strong woman and a mother of two beautiful children. If anything, you should go search for a new home for you and your kids instead of a therapist. He is not willing to do the work if he is the one who is causing the trouble in the first place. I had an abusive father and took my mom long enough to take the ring off but the damage was already done and now she became abusive too along with my sister, and I’m the who is suffering from it. So my advice for your own good and your kids’ wellbeing, do the hard thing but know it’s worth it.",
            "If you decide to go to therapy with him, don’t be surprised if it turns into secret therapy for you only.\n\nPlease get as far from him as possible.",
            "I hear you and your husband as well have unresolved underlying causes what fuels the behavior to rebel and to submit to one another, and it would be a huge rush of relief to have the other person get your frustration, anger, need for love, support and understanding.\nAverage couples counseling won't think could help, because they are not finding the root cause of your problems, but escalating the current ones and make the sad emotional canyon even deeper, no resolution.\nIf you wanted to see what could be done to keep the family together or if that can't be done to go on separate ways peacefully, I'd suggest a compassionate communication trainer. First you and your husband separately,1-1 sessions. Once you figured out what's going on in you and so did your husband, then go together to dig deep enough to let the other know and to let in what the other sais, so you both can finding solutions that fits both of your needs.\nRegardless how tricky a case seems, there are strategies to meet everyone's needs.",
            "🚩🚩🚩🚩🚩\nYou’ve had two kids with him so he thinks you have no choice but to stay. He is escalating his abuse tactics because of this. He will continue to escalate. Take the kids, file for divorce, be open with your family about what is going on. You’ll need their support. Get out! You do not deserve this!",
            "Best guess, if he all of a sudden acting like that he trying to make you mad so you guys can be setting apart. So he can have time with a probably affair",
            "Please get the fuck out.",
            "Everyone deserves someone who loves them unconditionally and is kind, and so do your kids. Leave him in the dust. You are a strong independent woman. You can do this on your own. Believe in yourself and do what is best for your kids and you.",
            "Divorce him ASAP. I’m sorry but there’s no more love in this relationship.",
            "Tell him what you want and if he gaslights you again you know what to do. It isn’t work salvaging a relationship with a sociopath.",
            "The fact that this is a new  behavior after your second baby tells me its something medical. Like post partum depression or a chemical imbalance of some sort. Yes men can get post partum depression. \n\nIf its neither of those things or he is unwilling to admit to being horrible then definitely leave. But be aware that him suggesting therapy and you jumping to divorce will only help him in a divorce.",
            "I’m surprised at the many people saying not to go to therapy, when 99% of the time people are encouraging therapy. Firstly this behavior is new, he wants therapy (he can pick up the phone and make an appointment) why hasn’t he gone yet? He obviously has problems and is projecting. This isn’t fair to you. Of course it’s abuse, but every bad behavior is abuse. Even distance, stonewalling, and withholding affection is considered abuse, but would you divorce or therapy first? If you want to know what’s wrong, go to therapy. Tell him his behavior is unacceptable and why he his acting like this? Sounds like he wants you to do something rash for grounds of divorce (custody perhaps?) anyway, his seeking individual therapy and you both seeking couples therapy while you get your ducks in a row. Divorce doesn’t happen in the snap of your fingers. It takes time.",
            "This is definitely narcissism at its finest. He will lure you in with false promises and then go right back to being horrible. I let this go on for three years. Don’t let this continue. Leave him and do yourself and your boys a favor. This kind of behavior tends to lead to violence and it’d be better if you guys left and were safe from harm.",
            "He sounds like an abusive asshole. That behavior pisses ME off and I don't even know you. It's time to ask your family for help to extricate yourself. Talk to a lawyer and find a way out. There is no excuse for him treating you so badly. You could try therapy but he sounds so manipulative that I doubt he would be truthful in the sessions.",
            "I don't have time to read all the comments, so there may be some repetition in here; apologies.\n\nFirst, I agree with not going to therapy with an abuser.  However, I'm concerned that the abuse may not be within his control.  I \\[45M\\] have had quite a few friends and my brother talk about the onset of drastic mood swings in their spouses (male and female) in their 40s.  It could be a serious psychiatric shift or sudden chemical imbalance.  Caveat: I am not a doctor, or therapist, or shrink.  Some of these people have gone on meds and turned things around.  Others just became assholes.  It happens.\n\nAgain, not remotely qualified to diagnosis or recommend any course of action other than finding somebody who is qualified.  Before going to the divorce attorney, see if he is open to being evaluated.  One of two things will happen: 1) He gets evaluated and diagnosed and treated, 2a) He get evaluated and diagnosed with nothing or 2b) He refuses to see anybody; either way, 2a or 2b, you get an attorney (especially 2a).\n\nGood luck",
            "You need to speak to a divorce lawyer, figure out your options he probably thinks you’ll never leave him, once you have gotten information from a lawyer speak to your jerk husband don’t even try therapy by the looks of it, he wants you to be the one to leave him by being such a jerk so that he can tell people you were bad to him and left",
            "Has he been to see a doctor yet about this change in behaviour? If it was a sudden change I think it would be worth getting checked out. Certain conditions like depression or brain tumours can lead to changes in behaviour like you’re describing.",
            "What I don't understand is, why go through all the trouble to bully you and pester you like this and still want to go to couples therapy? That just baffles me.\n\nPlease get out. You said he was already selfish before so chances are he has been a horrible person all along and it's only getting worse and will continue to do so. For your own and your children's sake. Get. Out.\nGood luck OP, we're rooting for you!",
            "There’s something wrong with him. It’s weird that the behavior just started and that’s why I would say try counseling to see if it works and he needs to go to therapy on his own. But if it continues, leave his ass.",
            "Look up gas-lighting and narcissistic abuse.",
            "Read *The Divorce Hacker's Guide to Untying the Knot*. And keep it in a place he'll never find - like at a friend's house or even read it at the bookstore if you can. You have to protect yourself from this guy. It sounds like he's baiting you, big time.",
            "Definitely don't go to marriage counseling, which can make abuse even worse. The only thing that could \\*possibly\\* fix this situation is if your husband went through an intensive batterer's treatment program. He is an abuser, and you shouldn't have to put up with it. \n\n&#x200B;\n\nThat being said, if you do leave, make sure you have a safety plan in place (ideally leave secretly, with your children, with somewhere safe to go, and people to protect you if necessary), because his behavior will almost assuredly get worse when you leave.",
            "start recording his actions but try to do it in a way that he doesnt know. if you have any money of your own to to get things that can record video or audio without being obvious. also try and get him to go the therapy by himself to prove that he will before you are willing to disrupt your life to go to couples therapy. and make him prove that he is going. But over all it sounds like this could escalate and in the long run it might be safer for you to get away form him. thats what the recording is for, if u ever have to go to court",
            "Ah this is incurable. Sounded pretty similar to my abisive ex and I tried hard to let him be “normal” but someone it’s really up to that person, if he aware of his problem and he is willing to change , and is he improvinh fast enough . Now I’m an impatient person, I don’t speand hella much time to wait for his small growth , bcz it simply bot fast enough before I get fed up",
            "Go to therapy, the marriage isn't just about you, it is about your kids as well",
            "This guy is just spiteful. There's no love there. Leave. Don't teach those kids that that kind of treatment is ok.",
            "I think him going to counseling first and then bringing you in after he has worked through his mental health crisis,because that's what this is for him, a mental health crisis, would be your best plan of action if that is what you desire. It sounds like his age mixed with life changes has possibly triggered some sort of mental illness in him. I'm sorry that you have to endure this, I suffer from mental illness and my husband has been there for me but it's extremely hard before help is sought out. While his behavior is considered manipulative, disrespectful, and unsupportive to you, he is also in a place right now that he needs to get out of. If he agreed to go to counseling, encourage his going. Encourage him to go an also ensure he is getting help and that the person he sees is the best fit for him. If you just can't fathom sticking around at least encourage him start getting help and then start getting out. You have to think about your children's lives and if you don't have him get help but divorce and expect the children to not be hurt from the whole process you will be mistaken. He needs to see someone to work through this so he can handle life because he can't handle it right now, I can see that, from the third sentence in I could see it.",
            "45M, midlife crisis, likely having an affair. You are only 35, no need to stick it out with this mean moron.",
            "In my experience of 3 long term relationships (two of which I  ended because my partner acted like your husband), it's pretty much over. The once someone becomes mean in the relationship there's endless resentment that you can never really come back from. You can forgive him but you'll never not hear the asshole inside him even when he's acting nice. That's just my own personal experience though. Others may suggest saving the relationship. Ultimately it's your choice, but don't stay together because of children. Because the last thing you want is your kids growing up and thinking \"the way dad treats mom is what a normal relationship is\" when it's actually a toxic cesspool of abuse.\n\nEdit: re-read it and the making fun of your hobbies and interests is by far what stands out to me the most. That's him trying to control you. Don't take more abuse from this piece of shit. Put rocks beneath the soles of his running shoes so he can't run without going crazy haha",
            "my dad changed completely after having kids and started treating my mom like shit too. she wanted to stay for me and my siblings, but he just got worse and worse. i don't think it is going to get better, i think you need better advice than reddit is gonna give you. \n\nyou can try the therapy but mainly for insight on his behavior, and maybe to help you reconcile things for yourself. you also have kids so navigating things emotionally will be important. like, maybe i'd try it out for a few sessions to see what happens. but i don't think things will really change. maybe you are better off consulting a lawyer instead.",
            "I would start to think about an exit strategy. These habits of his will start to grate more more until he just bugs you to death",
            "You proceed with a good divorce lawyer. There’s no fixing a marriage to an asshole, because there’s no fixing an asshole.",
            "I'm going to go against the grain here and like a couple others say he may have something medically wrong with him or he's just flipped a switch mentally and needs help.  If he wasn't always this way it may be a medical issue or he's checked out of the marriage and is too much of a coward to break up so is hoping you do it for him since he's being such a shit.  It's really hard to say.  None of this means you have to stay with him but something has changed very drastically almost overnight and it might be worth looking in to a bit before you cut ties.",
            "You named it yourself: You said gaslighting. It does sound like he is doing some of this on purpose as if to sabotage you or at least he is trying to sabotage it. I would feel so angry too if I were you. I don't know what the best option would be because I don't have children. But I am married, and I guess I would have to go to a place of no return before I get divorced. I would go to couples therapy, and if the therapist also sees there being no point and just bad then I would go. \n\nSorry you are going through this. I really hope it gets better from here as you figure out what is best for you and your children.",
            "A lot of people have said abuser and I won’t deny that this is abusive behaviour....however I would only add how and why? Full disclosure I am not an expert in the matter, but if he never displayed these traits to this effect before it’s possible that the somewhat serious change in his life (birth of another child) has possibly triggered sociopathic tendencies in him; or some sort of trauma from an earlier point in life which was suppressed previously could be coming out through this behaviour.\n\nYou mention that he even himself mentioned the idea of going to couples therapy OR going to therapy himself on his own, and that doesn’t sound to me like someone not willing to change or who isn’t aware of the issue, that sounds like someone who is and wants to.\n\nNothing can justify his horrible behaviour towards you, but there seems to be a possibility that this is something he can change, so it’s pretty much up to you to decide if that’s worth it.\n\nWish you all the best",
            "You might be married to a narc. I’m my honest opinion that’s the type of crazy that’s not fixable",
            "It sounds like he is bitterly angry and resentful about something, and he is expressing it by lashing out and being mean.\n\nYou say that he was a very nice husband before your second pregnancy.  Has your sex life dropped off since having the second child, or has he said anything to that effect?  That's definitely not an uncommon thing to happen after the birth of a child.  \n\nJust thinking that might be behind his personality change.  I am not defending his behavior, but I have gone through periods where I felt rejected by a partner and it eventually built up into bitterness and anger.  I always tried my best to express it constructively, but I was so hurt and full of anger that I was nonetheless very cranky and sometimes picked fights.\n\nIf this is indeed what is going on and you do want to try and save things, I'd suggest going through with the couples counseling that he suggested.  He needs to find constructive ways to communicate with you when he's feeling negative emotions, instead of pouring out sodas.  A counselor can help with that.",
            "This might have been said but I didn't see it but, it is honestly really common for men to get postpartum depression and anxiety and if this is so linked to your second child being born, maybe it's related?",
            "People on this subreddit are either inexperienced, young or just stupid. That's why their first reaction is always \"go nuclear\" and any sign of conflict must be abuse. Hint: even in most abusive relationships it's still mutual. \n\nI've never been in a relationship where people respect each other 100% of the time. Out of all of my personal relationships I have one friend that has remained highly respectful and me likewise over ten years. \n\nIn ever other relationship I have disagreements and arguments and sometimes even falling outs. However usually you can chalk those up to external factors like your partner was stressed out. These posters must have a nice life if they don't have to deal with stress from work, bills, family health because all of that adding up affects the best of people. \n\n\n**** \n\nMy advice: you sound overwhelmed. Sounds like you think you're taking the high road instead of communicating with your husband. Maybe he's too hard to communicate with. That's why therapy is good. You now need to communicate you issues and not look like an ass in front of two people instead of one. Ten years is a lot to throw away. 9 months is pretty early in a child's life and post partem for the mother. You may still be having hormonal changes that are affecting how you feel. Make sure you think about it, there is a lot at stake. I can't really give advixe for your husband because he's not here and he's not reading it so don't take this as an attack on the OP. She's the one asking for advice not him. \n\nTherapy will really help. Even if you end up divorced. Even a mediator if you can't afford it. It's not like a therapist says much anyway. \n\nAnyone",
            "I disagree with the people that just want you to jump ship.  There are many things that could have caused behavior to change recently.  If he wants to go to therapy, with or without you, it’s a sign he acknowledges the problem and wants to find a solution.  You have to make sure and set a healthy boundary with how he treats you and decide if he can earn your trust and respect back.",
            "[deleted]",
            "The honest truth i find this highly offensive.. clearly this boy loves this women very much. He is in so much pain my question is when is enough enough!\nThis is a sad indictment on being married and riding rhe highs a nd lowsbi matter what...\ni dont know her anymore. pls leave them alone.\nyou mention addictions ets etc its very sad because he wad doing so well until she started playing games..\nleave this best boy in peace.",
            "Was the second baby planned? Did you discuss it before? Did he want an abortion and was overruled? Seems like he is regretting it, and that’s just a sad situation. Possibly no recourse now, unless he somehow changes (which he may very well not).",
            "Did he want the 2nd child sounds like he didn’t because he changed after the baby. Jealous of the baby? Resents u for being pregnant? No clue but we only get 1 life be happy.",
            "I shuddered when I read the word “pop”.",
            "This isn't merely a question of divorce. He will get partial custody which naturally means you will lose custody of your children part of the time. If you're willing to let him and another woman raise your children half of the time, go for it. Or think of other solutions to fix this until your kids are grown and out of the house.\n\nWhen did you begin to see these changes?",
            "People here are just telling you to divorce without thinking about the implications. You guys have two kids and you have to take care of them. After that, you are together for 10 years and you are 35 years old, divorcing that age and trying to get a partner is not a good experience.\n\nYou have to solve your problems, people can't just run from things and divorce 10 year marriages forever. Face this man. He will probably be toxic about your concerns but there is something bigger going on. Get him to therapy to see if you find out what it is.\n\nAnalyze what are his problems and see if it's solvable. Sometimes it will not be.",
            "It's not bang your neighbors",
            "[removed]",
            "How to proceed: go to couples therapy. You made a promise to stick together in good and bad times... this is a bad time. If you leave now then what's the worth of that promise you made? If not for the sheer fact that you made a promise, do it for your children... children from broken homes do far worse than from intact homes."
        ]
    },
    {
        "post_id": "4nah2v",
        "author": "treebudz",
        "title": "My [26M] girlfriend [25F] keeps breaking my shit",
        "url": "https://www.reddit.com/r/relationships/comments/4nah2v/my_26m_girlfriend_25f_keeps_breaking_my_shit/",
        "score": 2317,
        "num_comments": 553,
        "created_utc": 1465473707.0,
        "selftext": "She breaks so much of my stuff it doesn't seem like an accident anymore. The day after I got my iPad Pro she broke it, she broke my phone twice, she dropped my laptop and dented it, she broke my other iPad, all since she moved in with me in February. Even putting the expensive stuff aside she breaks tons of other shit. For example I had all my wool sweaters in a special hamper that I told her to never wash the clothes in it so I can make sure they don't get ruined but sure enough she washed and dried them all and they all died. Even though sweaters aren't that expensive individually replacing them cost a ton of money. I kinda think she's doing it on purpose because she thinks it's cute, which would be my fault because when she broke my iPad Pro I told her it was cute how worried she got about telling me. She says she's just clumsy but I don't think that's what is happening. We've been together for almost two years and I've never noticed any clumsiness. \n\n\nI locked all my shit up in my office when I went to work the past few days since there was another incident and that upset her a lot because she thinks I can't trust her and I'm treating her like a child. Is it really so wrong to lock up my shit though? She wants to borrow my camera this weekend and I straight up told her no because I know she's going to break it. I'm not using it but I do wedding photography when I want to bring in some extra cash so having to buy another camera would really suck.\n\n**tl;dr**: my SO is constantly breaking or ruining my shit and I think it's on purpose.  ",
        "permalink": "/r/relationships/comments/4nah2v/my_26m_girlfriend_25f_keeps_breaking_my_shit/",
        "comments": [
            "I saw in a comment that she doesn't break her own stuff or ruin her own clothing. \n\nI think it's safe to assume that she's destroying your stuff on purpose. Maybe for attention. Maybe because you said it was cute. Either way, I would sit her down and talk to her about the broken things. Explain that you can't keep replacing your expensive items, and you can't keep replacing your wardrobe, and that from here on out, if she breaks something, she has to repurchase it for you. Then also broach the fact that none of her stuff is broken. Ask how she's managed to break and ruin tons of your stuff, but none of her own. If she was that clumsy, then her stuff would be broken too. \n\nEither way, keep all of your nice things locked up. I think your relationship is coming to an end unless she confesses. A relationship isn't sustainable without trust, and right now you don't trust her. ",
            "How often does she break her own stuff? February is not a very long time to have destroyed so many things by accident. \n\n\"Mistakes can happen. But if you don't do anything to stop them from happening again, you can't keep calling them mistakes.\"",
            "[deleted]",
            "This post reminds me of the one where a girl would mention to her boyfriend that she wanted or needed to leave the house for something. Then when the time came, she'd find the library book she needed to return missing, her car keys vanished, whatever. The boyfriend would swear up and down he had nothing to do with it and she was worried she was going mad.\n\nShe updated a few weeks later after setting up a webcam - of course it was her boyfriend doing all this. It was some weird control thing.\n\nMaybe, similar to how the boyfriend would stash that lady's away to keep her from leaving, OP's GF is breaking stuff to exert some control over OP. Like punishing him for arguing with her or something.\n\nSo, OP, do you notice a pattern? Does she break your stuff a few days after you argue with her? When she's upset about something?\n\nTo deal with her, I'd tell her no touching anything expensive. Once or twice is a mistake, this is either a neurological condition (dyspraxia?) or deliberate.",
            "> she thinks I can't trust her\n\nWHY THE FUCK WOULD YOU TRUST HER?!?!?!\n\nJesus Christ. \"No, I don't trust you to avoid breaking my things, because you've broken my things SO MANY TIMES.\" What a fucking moron.\n\nI'm the clumsy girlfriend in this situation, and you know what I do? I buy my own stuff (and buy very protective cases for it), and I don't fuck around with my boyfriend's stuff, and if I do need to handle my boyfriend's stuff, I am extremely careful with it.\n\nI admit it's making me disproportionately angry that she would suggest she can be trusted AFTER she's shown as explicitly as possible that she cannot. ",
            "[removed]",
            "Does she replace it? I know the answer is no so I'll also say that if she breaks your stuff so much she should replace them.",
            "Is your girlfriend a fucking gorilla or something? ",
            "Clumsy would be more believable if it weren't for the sweaters. Cell phones, ipads, etc get water spilled on them, get dropped, it happens. Washing those sweaters is deliberate. ",
            "> she thinks I can't trust her and I'm treating her like a child.\n\nWell, you can't trust her. And she breaks stuff at a more rapid rate than a toddler. \n\nThe more appropriate response is some form of \"I'm sorry you feel that way but I can't afford to have more of my expensive belongings destroyed.\" ",
            "Tell her that if she wants to be treated like an adult, she should act like one. This is beyond \"clumsy\". It's reckless at best, and straight up bitchy at worst.\n\nTell her if she wants to borrow or use your things, she should be prepared to replace them if an \"accident\" happens.",
            "I can't deal with people who don't respect my stuff. Yes, it's only things, but it's things I've worked hard for.\n\nSit her down and have a very frank conversation with her.\n\nOh and no more borrowing of your stuff. Ever.",
            "Clumsy? More like incredibly irresponsible and uncaring. \n\n Has she paid for all this? I'm sure if she did, she would not break anything else. If she can't pay it right off the bat, then she should to it monthly or weekly,however she can. You need to talk to her sternly about her habit and the money before she decides to be clumsy again.",
            "> The day after I got my iPad Pro she broke it, she broke my phone twice, she dropped my laptop and dented it, she broke my other iPad, all since she moved in with me in February. \n\nThis could be explained by clumsiness.\n\n> For example I had all my wool sweaters in a special hamper that I told her to never wash the clothes in it so I can make sure they don't get ruined but sure enough she washed and dried them all and they all died.\n\nThis was deliberate. You don't trip on a hamper full of sweaters and have everything fly into the washing machine. Doesn't happen.\n\nShe's either doing it on purpose for the attention or she doesn't respect your property. Or both. Neither is worth sticking around for.\n\n> She's a doula\n\nThen there's no excuse for her clumsiness.\n\n> I locked all my shit up in my office when I went to work the past few days since there was another incident and that upset her a lot because she thinks I can't trust her and I'm treating her like a child. \n\n\"You're right, I am. And until you can prove that you respect me and my property like an adult, I will continue to distrust you and treat you like a child.\"",
            "You're enabling her. Hold her accountable for her actions and maybe then you can both stop feeling like she's a child. ",
            "[deleted]",
            "Is she one of those people who never had to work for anything of her own?  \n\nMy ex-bf was like that.  He didn't ever break anything expensive like that, but he destroyed so many of my things during the year that he lived with me it wasn't even funny.  All kinds of my things got broken, lost or just simply thrown away.  And he didn't care.  He was throwing away my spoons like they were disposable.  Literally would throw them away with the container that he took his lunch in to work.  And when I asked him why the spoons were missing, he couldn't account for it.  The only reason I realized what was happening is I found one of his lunch containers sitting in the trashcan with the spoon inside of it.  He just laughed about it.  That's just a small example of what used to happen.  He would throw away washrags like they were disposable too.  I would find them in the trashcan like paper towels \"it was dirty\".  That's what a washing machine is for, asshole.\n\nBUT, the point of my story is that I realized that he never actually had to provide for himself.  He had never lived on his own or had to furnish anything himself.  He lived with his mom before he moved in with me.  He didn't know the value of things.  He didn't realize how much it costs to HAVE those things and replace them when they are lost, broken, etc.  ",
            "My girlfriend once destroyed one of my favorite shirts in the wash (bleach and colors do not go well together). She felt so bad she bought me another one. Obviously an iPad is worth a lot more than a polo, but the fact she didn't even offer to make amends is kind of surprising. ",
            "You said in a comment that she's broken over 5k worth of stuff? Well when she pays you 5k back you'll let her use your stuff again. ",
            "This is ridiculous, dude. Like, I feel for your girlfriend. I do. I am *hilariously* uncoordinated. I drop my things constantly. My laptops end up with pieces knocked out, my phones end up with dents, I have a really well-ingrained reflex to move my feet out of the way because I drop knives all the time when I'm cooking. Sometimes I straight-up forget I'm holding something and it ends up on the floor before I remember. Sometimes I forget I'm holding something and then I look down and I've *disassembled* it, because apparently my subconscious' favorite thing to do is *ooh, new thing, break it*. \n\nMy boyfriend thinks this is very cute, but this is because it does not actually impact his life! I try very hard to take better care of things that are not mine! I use both hands to interact with his teacups and if he hands me a computer to show me something I pause whatever I am doing and give it my full attention. I don't break his things, not because I'm not horribly clumsy but because I *know* I'm clumsy and I am *careful*. And regardless I'm sure he knows that if I broke his iPad I would *buy him a new one*. Because I'm a responsible adult. \n\nShe's not just clumsy, she's *careless*. She feels entitled to your expensive things even though she makes absolutely no effort to take care of them, and that's unacceptable and you have *every* right to take them away. Tell her she's not ever ever allowed to touch anything you own until she pays you back for all the things she's destroyed. No discussion or compromise. If she throws a tantrum, too bad, you don't get to be treated like an adult unless you act like one. ",
            "She is breaking all your stuff and none of her own. She is definitely doing this on purpose, dude. I've never had a bf break anything of value of mine that I can remember. This isn't normal.",
            "I'd make a list of everything she broke and how much she owes you for each thing. Then sit her down and show her the list and the total. Make it clear that you're going to hold her responsible for this. She won't think it's so cute then.",
            "I broke a souvenir glass my husband bought on holiday with his ex girlfriend probably a decade ago now this morning. \n\nI felt terrible. I scoured ebay for a replacement while I waited for him to message me back. \n\nThe glass itself is maybe worth a tenner , and we're married, it's not in a display case, it's a standard drinking glass. I still felt guilty. As it happens husband isn't bothered and laughed at me for looking. \n\nThe point is I fessed  up, apologised and LOOKED INTO A REPLACEMENT. \n\nId start billing her, she needs to learn this shit  isn't ok and if she really really canr control it, she needs to leave your stuff alone. ",
            "I love my gf, but if she was breaking the kinds of things yours is breaking on a regular basis and ruining my clothes and yet still tries to borrow things of mine or use expensive things of mine, I would feel perfectly justified in locking my things away.\n\nLet her blow as much smoke as she wants, but keep your stuff locked away.  There's clumsy and then there's having zero spatial awareness and being a danger to everything around you.  Your gf is the latter.  I would be worried about my dishes, glasses, normal clothes, and nice furniture, too.  She sounds like the type to let glasses sweat all over nice wood furniture and such.\n\nKeep locking everything up, OP!",
            "She's mad you're locking up your own things and she's still asking to borrow other expensive, breakable things?  I would break up with her just based on that.  It's not that she breaks your things.  It's that when she does, she really doesn't give a shit.",
            "Probably don't have a baby with her, yeah?\n",
            "Why the fuck isn't she paying for ALL this shit? Have you combined finances? Even then, is she denying herself luxuries (like a money diet) until she can replace your items? \n \nShe sounds like a careless user.",
            "Has she been dropping things that aren't expensive?",
            "Reading this made me so angry. I'd be so furious if someone was so careless with the things I worked hard for to afford. You're totally within your rights to lock the expensive 'toys' away if she can't handle them with care and respect. \n\n\n\n",
            "I think it's absolutely fair to lock up your stuff. People are human, and if you break one item it's an accident, two items, yikes, maybe an accident, but to break as many things as she's broken? She's just not at all careful with your stuff! And why should she be? If she breaks it, it's not like there's any consequences for her. \n \nSo yes, lock up your stuff. Treat her like a child. She just can't be trusted. And if she feels \"I'm just clumsy\" is an acceptable excuse, then \"I can't lend my equipment to someone as clumsy as you\" is 100% acceptable.  \n \nIf I crashed my car 6 times in 2 years, my insurance company would say \"Sorry, we're not going to insure you any more.\" And if I say \"I'm just clumsy, they were just accidents, I didn't crash on purpose,\" they'd still say \"Sorry, you are a HAZARD.\"  \n \nI don't think you need to break up with her, but definitely lock up your stuff and say \"Enough. Buy and use your own electronics. Mine is off-limits now.\" ",
            "How is destroying someone else's property cute? I'm super frugal, so this would enrage me.\n\nYou are 100% correct in locking up your things. If she can't handle to treat your items with respect, then she doesn't have the right to borrow them. She can get her own.\n\nAnd replace yours while she's at it. ",
            "She should be buying you replacements.  Remember the guy whose dog ate his gf's shoes? He is buying her replacements-thats what people with integrity do.\n\nIf your gf is breaking your stuff bc its cute she has the maturity level of a 14 year old so theres that.\n\n",
            "> she thinks I can't trust her and I'm treating her like a child.\n\nThat's because you can't trust her not to break your shit, and you are treating her like a child because she's acting like one.\n\nAdults don't break everything.  And if they do break something, they offer to pay for it.  If they can't afford to pay for it and they know they might break it, *they don't touch it.*",
            "This is on purpose, no other explanation. If I broke 1-2 things from someone I can't repay, I'd fucking stop touching their things, out of sheer fear to hurt them even more, and from courtesy and respect. \n\nShe obviously feels none of that for you.",
            "Don't let her borrow your things, keep them locked up. Make a list of the things she has broken and a payment plan for her to pay you back.",
            "At this point I'd be pretty confrontational.\n\nTake a tally of all the stuff she's broken.  And in no uncertain terms tell her anything else she breaks from here on in, she has to replace.  You've listed stuff which probably adds up to a few thousand dollars.\n\nIf it's a matter of trust, tell her that no, you can't trust her when it comes to your possessions or electronics since she keeps having accidents and not being careful.  I find it pretty telling that only your possessions are the ones getting broken.\n\nIn regards to your camera, that is 100% the right call.  I'm very lenient with my electronics.  Friends use my stuff all the time or borrow my spare electronics / equipment.  But my camera gear...hell no.  That stuff stays locked up and stored in a Pelican Case with full insurance.",
            "This isn't how adulting works.\n\nIF an adult borrows something they return it in even better shape if possible (like cleaning and oiling a lawnmower).\n\nIf an adult ruins a load of sweaters they have been told not to wash, they replace them.\n\nIf an adult breaks an iPad, phone, tablet etc. they have it repaired or replaced at cost to themselves without having to be asked. Even if it means using a credit card they has to obtain. It may upset their credit but that's how adulting works.\n\nIf a child breaks things, the adult has to keep them out of her reach. ",
            "> She says she's just clumsy but I don't think that's what is happening.\n\nThen she needs to see a neurologist, cos it's not normal.",
            "I'm glad she isn't denying breaking your things. But after the third item broke, she should have stopped handling your things. She should have taken it upon herself to treat your things more carefully and with more respect. \n\nShe doesn't respect your property. She doesn't care. She may sob/whine/be generally upset that something has broken but it doesn't mean anything to her. She gets away with it because you let her off the hook. She should be paying you back because otherwise, you are treating her like a child. You're her parent who comes in to wag their finger before she goes back to play time. You can't trust her nor should you. Nothing happens to her when she breaks shit. That's why she wants the camera. She knows she'll get away with anything.\n\nIf the only way to protect your things is to lock them up because she won't keep her paws off, damn straight they'll be locked up. If she had any decency, she would not be asking to borrow your camera. She couldn't afford your other shit. It's offensive that she's now wanting your camera without properly atoning for all the other stuff she's broken. Do not let her near your camera. ",
            "Do you have any social media apps installed on your electronics? As much as I hate to say it she might be breaking them as a way to \"keep you from talking to girls\" or looking at porn, etc. \n\nThe sweaters certainly throw a wrench in that theory but she could have done that to throw you off or if she wants to dress you herself. \n\nEither way I'd have a talk about the current state of affairs. ",
            "I am very clumsy, and I only break things like plates or glasses. It's not funny, it's not cute and I always feel terrible afterwards, I don't go near expensive things if they are not mine and I have never break so many things in only four months. And the wool sweaters are not for clumsiness or absentmindness, she had to go out of her way for ruining them, she had no reasons to wash them all, they were in a special hamper and you told her to not wash them and dried them. It had to be on purpose.\n\nSo lock everything, don't let her borrow your camera and go to couple's therapy because something is very wrong.",
            "Make a list of all the things that she has broken. Say you could have made her pay for those things. See how she reacts. I know I'm clumsy so I usually avoid holding super valuable things that belong to other people for very long. She just doesn't seem to be careful with other people's items. I'd say that is a big flaw that she needs to work on. ",
            ">she thinks I can't trust her and I'm treating her like a child\n\ndamn right she can't be trusted, and you will continue to treat her like a child until proven otherwise. this is a result of her own fault because time and time again she has proven herself to be unable to handle your belongings with care.",
            "\"This is why we we can't have nice things!\" Sorry, had to.\n\nI feel like the simplest solution is to tell her that from now on, if she breaks it, she replaces it.  Be really firm and say that you would expect the same out of any of your friends and you just can't afford to pay twice for everything.  \n\nIf I were her, I'd be mortified and OFFER to pay before you even had to ask.  What's her excuse?",
            "Is she doing this because she thinks it's cute? For someone who hasn't seemed clumsy in two years time, this is quite a lot of shit to incidentally break in the span of four months. My SO is crazy clumsy, I mean she even walks into walls, you know? While it's anecdotal, my clumsy partner would have to go out of her way to break that much electronic equipment in that amount of time - when your partner says it's because she's clumsy but that doesn't add up, makes it seem like an excuse IMO.\n\nOr, what the fuck is she doing with iPads that she's broken them so much? Or broken your phone? What's going on there? While she's upset that you're restricting her access to your stuff... I mean, it's your stuff. She wouldn't have to want to continually keep buying brand new shit almost every other month - so why should you have to tolerate it? If she is clumsy, or has had a stroke of bad luck (or is doing it intentionally) - either way she's going to have to accept that there are going to be boundaries introduced with that risk, which has cost you a lot yet cost her practically nothing.",
            "[deleted]",
            "Just because she's your girlfriend doesn't mean she doesn't have to pay for any of this. If you let her borrow your camera, tell her if it's broken you need ALL the money back. It's not mean, it's part of how you make money. Breaking that much shit in such a short period of time is like being Eugene from Hey Arnold and that amount of bad luck is basically impossible. ",
            "It is on purpose and no you are not wrong to lock your stuff up.\n\nYou know who breaks/ruins stuff like that for real not-on-purpose? Little kids. and they can't help it because they are little children. CHRIST",
            "There's a simple way to figure out if she's breaking all your stuff on purpose or on accident.\n\nDoes she break her stuff any where near as much as she breaks yours?  If not chances are it hasn't all been accidents on her part.\n\nYou let her get away with this stuff with no repercussions for her actions.  Why on earth would she ever bother to be more careful with your stuff if she's not given a reason too.  Even if she is breaking all these things because you told her it was cute how worried she got the first time it happened that just isn't normal in any way, shape or form.  Who the hell thinks i'm going to break my partners things so he'll like me more? ",
            "Seriously, there's clumsy and then there's deliberate. I'd believe it was sheer clumsiness if an equal amount of her own stuff got broken, but having it only happen to yours is suspicious. If it's not deliberate, it could just be that she doesn't see other people's expensive items as anything to take care of, whereas her own have more value to her.\n\nHell, I'm clumsy as fuck. I bump into and drop things all the time. I try to minimise that as much as possible and christ, if anything ever breaks I offer to pay for a new one. Hell, the last thing of my boyfriend's I chipped was a pan lid and I felt bad. I'd have felt absolutely awful if I'd broken his tablet or phone. And why on earth didn't she offer to pay for the first thing she broke? Accidents are excuseable, but regardless, it should have immediately been a case of \"I'm so sorry I broke this. I don't have the money to pay for it outright, but let me reimburse you over a few months until it's paid off.\" It seems to me it's either some kind of bizarre attention-seeking behaviour, or she genuinely doesn't give a crap about your things.",
            "Well, she's not wrong. You can't trust her and she is acting like a child. As baffling as it sounds it does seem that she has some convinced herself that it is cute when she destroys expensive electronics of anything for that matter that you ask her to handle with care. \n\nIf it's an \"accident\" every time then she literally has no respect for you. If you are constantly having to remind her to be careful or please don't wash or do this and she still does it anyways, that's bad. She has zero consideration for you or your things. Either way there comes a point where you realize that there is no way I'm spending the rest of my life with this child. Maybe she will grow up one day, but that's going to have to be for the benefit of another partner. ",
            "I feel like this post is more asking for permission to dump her than advice.\n\nYes, you should dump her over this. She is breaking your things to get attention from you. You can't trust her around your belongings, how the hell are you going to share a house with her?\n\nPuppies chew on things for attention, but you can crate them. It's not like you can spend the next 50 years of your life letting your wife out of a crate when you get home from work.",
            "I had a GF that did something similar. Except in my case it was anytime I did something she didn't like such as, leaving her at home and going to a friends. She punched a picture of me and a 3\" sliver of glass got shoved in between her knuckles, fucked her hand up really bad. I told her is she does that again I'm DONE. WELP she did! Told her I was going somewhere ALONE. She proceeded to scream and put her head through a glass window. Got rid of the broad that day. Sent her home back to NY. \n\nPoint of the story: Don't ever let a woman destroy your shit, intentionally or unintentionally. Get rid of her. You will thank your bank account later.  ",
            "I am clumsy. I break my own shit and I try really really really hard not to break things in general. My husbands laptop finally went tits up after 7 years, because i fucked up the keyboard. But accidents happen. And my own shit gets broken too. My monitor has scratches on it from me dropping it. Hell, I have a scratch running the length of my shin from running into my roommates bed.\n\nAnd there is the key difference. I break my own shit too, and i apologize over and over. She breaks just your shit, and it definately sounds attention seeking. If she was just clumsy, she'd break her own shit too. Why are you with someone who thinks it's cute to break your shit?",
            "There is no way this is on accident. People are not that intentionally clumsy. I had a very oblivious friend in college, but she never broke anything to the extent of this. This is insane. 5K is a lot of money. ",
            "Even if it was all accidental I still feel like it would be reasonable to dump her over that much broken shit. Accident or not, it's important to treat other peoples' property with respect. More respect than your own. She's clearly not doing that and at least in my opinion that translates to poor character.",
            "I think it's only fair that you break her heart after all that. ",
            "This is super strange to me. As someone who is genuinely clumsy and has been all of my life, I treat other people's belongings with sooooo much care. I know I break things, I can deal when I break my own things, but breaking someone else's things just devastates me. I feel like the biggest asshole, so I do everything I can to stay the fuck away from other people's breakable shit. I wouldn't necessarily say she is doing it on purpose (although it is possible I guess), but she obviously is not treating your things with care, which would lead me to believe that she thinks your things are disposal and not important. Definitely talk to her. And don't buy into \"I can't help being clumsy.\" Something is definitely weird here.",
            "Jesus Christ. She must be a 10/10 and the sex must be amazing. ",
            "Umm. If I had broken all of this expensive stuff I would be trying to replace it. I would not be touching any of your other expensive stuff. \n\nReally? you all locking all your stuff up? If this was just a roommate what would you do? \n\nAnd how the heck do you think any of this is your fault? You are treating her like a child because she acts like a child. I don't think you can afford to live with this girl. I would say if you are going to keep dating she needs her own place. (personally I do not hold out much hope for the relationship.)",
            "Could it be a medical issue? I am a private tutor that works in conjunction with a therapist to help children who really can't deal with school.\n\nI have a client who is 16. Her parents brought her in to my therapist because she was constantly breaking things to the point her and her school thought she was doing it on purpose. The parents told us that it was only other people's things, which they used as evidence against her.\n\nWhen I started working with her in her room, I realized all her stuff was broken too, but she would hide it because she was too embarrassed to tell her parents. She couldn't hide breaking other people's things though, so that's all her parents knew about. Furthermore, she would tell me that handling other people's stuff made her more anxious, which caused her to drop more things.\n\nHer parents were also worried that she was using drugs or alcohol because sometimes she would slur her speech or trip over really obvious things or just act really \"silly\" as they said. Or she would forget really big things or not wake up from school and sleep for 12-16 hours instead.\n\nThen one day, we were in the middle of a session and very suddenly, her speech started to slightly slur. \n\nMy aunt has Multiple Sclerosis and I remember hearing similar stories about her as a young adult, before she was diagnosed. The parents took her to a doctor and she was diagnosed with MS.\n\nMS affects people in really weird, inconsistent, sometimes hard to put together ways, especially in the beginning. Maybe check out that.\n\nIt makes more sense than someone breaking things on purpose with no other significant anxiety responses. ",
            "[removed]",
            "Sorry isn't good enough. \n\nYou forgave the first incident, after that she needs to replace everything that she has broken, ruined or otherwise made unusable and anything that can be repaired, needs to be done as well.\n\nIF she cannot do this, then perhaps living together is not such a great idea.... \n\nMoving in together will either get this stuff sorted out so you can proceed or shine a light on an issue that illuminates the exit sign loudly and brightly. So, its a win... hopefully the former for the happiest result but either way not a long term sentence if you handle it properly.",
            "She breaks something then make her pay for it. It's happening too often to he an accident. Not saying she is just straight up throwing your shit on the floor but she doesn't respect your stuff. And because she doesn't she won't be bothered to be even the slightest bit careful. \n\nSeriously. If you make her pay to replace it is better you your shit will stop getting broke. If it ends because you want her to replace the shit she broke then fine, less money you gotta spend.",
            "Maybe she wants a spanking...? ",
            "Put a Nokia near her and if it breaks then you know what's going on.",
            "I think she's going for what she thinks you'll find cute/ditzy/endearing and doing it on purpose. Confront her about it. Tell her you think she's doing it on purpose, and tell her she needs to stop. Also let her know how much money it's cost you to fix all her \"oopsies\" even if she isn't going to pay for the fixes. If she were just naturally clumsy she would break her own shit too.",
            "Make an itemized list with prices of everything  she broke and tape it to the locked door. ",
            ">she thinks I can't trust her and I'm treating her like a child.\n\nShe is not acting like an adult so what can she really expect? Keep locking things up til she gets the message, or better yet explain that this has to stop. ",
            "My wife is really hard on everything we have, not just my own stuff. Broken phones, cracked tablet screens, scratches on top of every piece of furniture, hair color splattered on the bathroom walls, etc. My biggest gripe is the vehicles. She scrubs every fucking front passenger wheel and tire on every car she's ever had. Like it'll need a new tire from curb gouges and the rim gets either bent or scratched to hell. I had to pick up a wheel today from the Wheel Doctor for a nice $125, now it needs a front end alignment. I don't get it. She grew up broke, just like I did, but for some reason she couldn't care less about taking care of what she has. I get really tired of fixing shit.",
            "If you protect your stuff as a direct consequence of her actions, then whatever that makes her feel is really not for you to cushion or handle for her. No sane person would ask you to keep stuff around that they are likely to break, just to not hurt their feelings.\n\nMost normal people can handle the way people respond to their behaviour. If they see their behaviour is creating responses that are unpleasent or reflects poorly on themselves, its a great oppertunity to use those clues to change or modify behaviour. She is asking you to tread on eggshells instead, AND have your stuff destroyed.... lol, why would you put up with that?\n\nI dont think you should be living with her. She has some stuff to sort out. Maybe you can still date, but there is no indication that she is ready to share a living space with another person. Being careful with other peoples property is a very basic requirement for sharing living space.\n\nPS. it is not an accident that she keeps breaking stuff.. but what really matters, is that you already dont like living with her. You dont really trust her, and you cant keep cherished items around in your own home. - So, you are already done with this relationship, even if you havent really rationalised what all these things mean for the two of you. Dont feel bad. You didnt sabotage the relationship. She did. ",
            "Could she be breaking things strategically to serve her own purposes? The fact that she doesn't break her own stuff is infuriating and incriminating.\n\nLike with the iPad, maybe she didn't want it taking your attention away from her. \n\nWith the sweaters, maybe she didn't like them and wanted to suggest you get new sweaters, but didn't want to possibly insult you. This problem could be solved by her destroying them.\n\nDon't lend her your camera (obviously). Maybe she doesn't like that your wedding photography takes you away from her sometimes on weekends? Or she doesn't like the idea of you being around gussied-up drunk girls at said weddings? Idunno. \n\nJust a theory.  The experimental side of me wants you to break something valuable of hers, and see how she reacts. Oops!",
            "You're not treading her like a child by locking up your breakables.  You're treating her like someone who is either a major klutz or \"just\" completely uncaring with another's belongings.\n\nJK (maybe?): What the hell would she do with a baby?  How many times would it be dropped on its head?",
            "This sounds to me like misplaced rage or something. She's taking out anger at you on your things. Is there any reason why she might be angry at you, whether with cause or not? Heck if she's burying her emotions she might not even be aware that it's intentional.\n\nYou need to have a straight up talk with her, either to try to work out what's going on, or find a solution.\n\nWhatever you do, for the upcoming weekend DO NOT let her talk you into borrowing that camera. Tell her that it's business equipment and not up for discussion or negotiation.\n\n",
            "She doesn't respect you or your things.  Whether she actually knows that or not is debatable, but on some level she holds your things (and likely you) at a lower level than she.",
            "I think it is intentional and jealousy throw the bitch out.  Check me, how much of her stuff does she break?",
            "So, what was her excuse for washing your jumpers??  \nI'm sorry she is upset about you not trusting her with your stuff but she must see that she can't be trusted with your stuff.",
            "It's definitely fishy that she keeps \"accidentally\" breaking all your electronic devices. Is she a jealous person? Just thinking that this could be some strange way of trying to stop you from talking to other women. I've heard of some pretty crazy lengths controlling SOs will go to to isolate their partners. ",
            "When she breaks your stuff does she fix or pay to replace it? I would never lend my camera to someone who i couldn't count on to fix or replace anything that was damaged.  ",
            "She sounds like a puppy trying to get attention.",
            "If she breaks it she should pay up and replace it!  Holy crap if my SO did this I would break up with them on the spot. Three times is a pattern. It's on purpose. ",
            "If you're going to break up with her may I add this: *Put your precious belongings in storage or at a friend's house? Until she's moved out?* \n\nCause I've learned from this subreddit is a lock only stops good people. ",
            "I break shit all the time. I always thought I was just clumsy - it not only frustrated my husband (I can also never find anything) but it drove ME insane!!! Turns out I have epilepsy.  Not the type that causes seizures (although it does lower seizure threshold) but a type that causes memory issues,  and jerkiness which means I drop things,  or when I'm doing something fiddly I come across as clumsy,  or if I do something I was asked not to because I have memory issues. \n\n\n\n\nIt was such a relief to find out there was actually something wrong and it wasn't just me being a dumbarse. And there is medication!!!! It's changed my life!!!! \n\n\nNow,  I am 33 years old and have apparently had this my whole life. I only found out late last year,  and only because I had a seizure which was caused by a medication I was taking lowering seizure threshold plus epilepsy lowering seizure threshold. \n\n\n\n\nI never ever ever in my life would have thought I had epilepsy. So there could actually be a reasonable explanation for it! Get her to go to the doctor and ask if they believe it would be worth seeing a nuro - go with her and explain what you see happening from your side as often it's very different to what we see happening from our own point of view. \n\n\n",
            "She's irresponsible and reckless with your stuff. At best. Huge red flag, this is a serious lack of respect. \n\nI'm assuming she paid to replace things right? Lmao!!",
            "Due to your comment stating that she doesn't break or destroy her belongings, I'd say she is doing this for attention. You are right, I think you telling her it was cute that first time she broke your shit really fed her attention cravings. But damn to go to this extent is just crazy. I mean there has to be something wrong with someone's head to want that attention so much you break your SO's shit to get it. Horribly disrespectful. You deserve better. And she should replace all that she has destroyed. \n\nOne thing you could do since you are close to breaking it off with her anyways is to look her in the face and tell her you know what's up. Tell her you're not stupid to the fact that this only happens with your shit and that you know it all started with that first accident and that her doing this for attention is not cute. Watch the humiliation wash over her. ",
            "To boil it down...the girlfriend is broken, and time to replace.",
            "Why are people so careless with other people's stuff?  I never ask to borrow anything and if I did, I would be careful with the item.  I don't let people borrow things because people who borrow things obviously don't care enough to own the thing, so why would they care enough to not break it?",
            "The only way this is an accident is if her stuff doesn't get broken because she accident-proofs her life. So, does she wash her own wool sweaters without issue or is it she doesn't have sweaters that can't be washed normally (which is what my husband does). Does she keep from breaking her phone because she keeps it in a case (what I do) and broke yours because it wasn't in a case?",
            "Is she replacing it? If she had to replace them, maybe she will learn to be more careful?",
            "Its entirely possible she thought you meant that her breaking things is cute but regardless. I'm the same as her. I'm VERY clumsy. One day I broke one of my boyfriends dining glasses. I immediately replaced it. She sounds irresponsible. I would be really upset if I were in your position too.",
            "> I locked all my shit up in my office when I went to work the past few days since there was another incident and that upset her a lot because she thinks I can't trust her and I'm treating her like a child.\n\nNo, it upset her a lot because she wanted to break more of your shit and didn't get to.",
            "Do you think she might have jealousy issues or something and wants to break your electronics so you can't talk to other people? I don't know, that could be a big accusation but it might be the reason why...\n\nShe may just be really, insanely clumsy! But, damn. Haha. \n\n",
            "Hey man looks like you got a lot of suggestions, We'd like an update later if possible ",
            "Bro she is breaking your shit on purpose!",
            "I'm not sure this is about her being 'cute' with telling you she broke something. I think it could be that it started that way but at this stage I think she maybe sees it as some sort of power she has over you in that she can break expensive things and you can 'easily' get them fixed and / or replace them. She seems to think you wouldn't suspect her of doing this intentionally and that she can just be cute and innocent to get herself out of trouble. I don't buy that she's only doing this as a way of trying to appear cute to you when she tells you. She likes being able to get away with it. \n\n It sounds crazy, I know that; but from reading your post, anything that holds any value to you is there to be broken in her eyes. Your wool sweaters for example. We all know to wash wool in its own way, I'm sure she did too. \n\n Ultimately you can't trust her. I wouldn't have had the same patience you had. She doesn't take responsibility for what she breaks and I doubt she even feels bad at this stage. If she's going to act like a child, treat her like one when your valuables are concerned. \n\n You aren't going to be able to trust her and she wont admit this is on purpose. If she did I'd imagine you wont want to be with her because...Why would you?! Its a rotten thing to have done to someone. \n\n If you want to salvage what it is you guys have, sit her down. Don't ask her if she did it on purpose but if you can live with her knowing it probably was, then have a one to one. Tell her she can't keep breaking your things and you can't let her use your things because she's costing too much via repairs or replacements that she doesn't need to pay for. Make clear if she breaks anything else its her thats paying for it. Also state that you don't understand how she is so clumsy with your stuff when shes so careful with her own...and then watch as in the coming days something small of hers will break and she'll be so disappointed. \n\n The above might scare her into not breaking your stuff but honestly its not a sign of something good if she feels the need to break your stuff. I'm more airing my thoughts here but its what I thought from reading your post. ",
            "I take it from your post that she hasn't offered to replace any of the things she's broken, since you mentioned how expensive all your sweaters were and you don't want to have to replace your camera. Maybe open that discussion of \"you break, you buy\" and see how she responds. If she's willing to do that and does, that would show sincerely that she was apologetic. If she gets upset or angry, that would show something else entirely.\n\nI find it highly suspicious that you said she doesn't damage her own things, but I also would think you'd know if she was prone to doing things like this for attention since you've been together 2 years. Honestly, whether you keep her or not, she really needs to pay for the things she's broken.",
            "My 4 year old niece manages to not break her grammy's iPad and she uses is at least once a week. Much less 2 iPads, a laptop and 2 phones. In 4 months.",
            "When I bought my iPad, it had taken me months to sav up for it. My boyfriend is a mild technophobe and although doesn't break my electronics, he has this weird thing where when he uses my laptop it freezes, doesn't turn on or even just dies. I take it off him and it suddenly works. My point is - my iPad was special to me and expensive and so I told him \"you break it? You pay for it.\"",
            ">Either you're breaking my things on purpose or you just don't care about them because they're not yours. Either way I have a very good reason to not trust you with them\n\nOr something like that",
            "I cannot believe she didn't replace them herself!! I can't imagine breaking my boyfriend or any of my friends' things without replacing them. This is insanity...  she's a knobhead.",
            "We're supposed to use things and love people.  We're not supposed to love things and use people. \n\nThat said, things are expensive and should be kept out of her reach. ",
            "This is starting to sound like some kind of attention / cry for help thing. And I don't think it has a chance of getting better without a serious and direct conversation. Nothing cutsy, nothing sly, nothing overly polite or gentle. Just an outright, \"You've broken a huge number of my things in a short period of time. You don't break your own stuff. What is going on?\" And don't accept clumsy as an answer. \n \nAnd if there are denials and deflections then it's tough love... she can't touch anything that matters to you. No tech, no clothes, etc. She doesn't like it then she needs to learn to not break your shit.",
            "There's nothing wrong with telling anyone, even your SO, no to using your nice stuff. If I broke your shit I would feel so bad I wouldn't want to touch anything expensive of yours. If she only feels bad about it for like a day then she really doesn't feel bad. PITA.\n\nEdit: She might be testing you too. She wants to see what she can get away with before you *really* get upset and want to break up. She might be like a toddler and pushing her boundaries to see what she can get away with to gauge how much you must care about her... \nPITA!",
            "Is she very nervous when handling your things, compared to her own?  Maybe she's so freaked out from breaking things that she's overcompensating and her anxiety about this is making her more prone to dropping stuff?\n\nMany people are just telling you to break up, but I'd suggest having a talk with her about this if you're happy with her, overall.",
            "well shit keep us updated",
            "This is a complete lack of respect. It's not funny or cute. I would end it.",
            "Is it possible she's breaking these things to keep you from getting attention from other girls? (breaking electronics to prevent access social media and ruining outfits she's worried make you look too attractive?)",
            "I am an insanely clumsy person, to the point where it's a bit of a standing joke in the family. I genuinely don't know what's wrong with me. The reason it's a joke to everyone and they don't hate me for it? If I ever break something that isn't mine, I replace it. It's an expensive fault to have, but I'd expect the same if someone broke something of mine. ",
            "Does she break her own shit too, or other people's? Or is it just your stuff? If the latter, this is planned.\n\nSit her down and tell her she has to replace your broken property. You're locking up your stuff for good reason. If she's upset about what that insinuates about your lack of trust in her, that's a sign she needs to step up instead of playing the victim. \n\nIf she can't do this, I don't know how you could stay together. Trust (and, you know, not willfully damaging property) is integral to a relationship.",
            "I'd tell her to replace everything she's broken or GTFO, there's plenty of less clumsy fish in the sea anyway..",
            "Why isn't she offering to pay for the things that she breaks? If you were to ask her to pay for replacement for you broken items I wonder what her reaction would be. Is it possible there is a wealth disparity between you and she is envious? ",
            "There are people out there who you can have just as good a relationship with as the good parts of your current one AND ALSO they won't break your shit. ",
            "I propose that you let her borrow your camera as a test. Tell her beforehand that if she breaks it, she WILL be replacing it, and then let her borrow it. See what happens. She might break it and refuse to pay for it, but then you'll know everything you need to know.",
            "I am wondering... Have you done anything to upset her since  she has moved in? I ask because, this seems vindictive to me. The electronics, I mean..Maybe it could have been an accident the first couple of times. I dumped water on my husband's lap top one time & I felt so horrible! He was very  understanding but, I have been very careful to make sure that doesn't ever happen again.  \n  Then there is the issue with the  clothes... You put them in a separate place, and asked her not to touch them. Unless I missed something, that seems like it was definitely done on purpose.  I would definitely have a serious talk with her. Something is up. I wish you good luck. ",
            "I have this problem with my best friend. I love her to death, but she can be really irresponsible with both her belongings and stuff she borrows from other people. \n\nIt came to a head when we were living together with another friend whose laptop was stolen in a smash and grab from her locked car, so I lent her my old 2007 dinosaur Macbook for a while. BFF got pissed that I didn't do the same for her, but in her case, she *broke* her laptop because it was on her bedroom floor and she came home drunk and accidentally stepped on it. Big difference.\n\nAnyhoo OP, I think you should dump her with a PTSD clarinet boy meme that says \"She broke all my shit, so I broke her heart.\" Simple, crisp and to the point.",
            "I don't know if you are realising the true extent of this - but to me it sounds seriously odd. She sounds like a crazy; break it off before those possessions turn into *you*",
            "I have a friend who's accident prone, zero coordination. In the 2 years Ive known here she's broken less than this. ",
            "This sounds like this would fall into personality disorder territory, but damned if I've ever heard anything like it before...",
            "/r/relationships always says break up first, ask questions later. I suggest instead that you confront the shit out of her and get to the bottom of this. Either you find out that she's a complete klutz and need to take special measures, which include her buy-in, to avoid this happening in the future, or you find out that she's doing it on purpose. If she's doing it on purpose, ascertain why. If there's malice, leave. If it's some other goofy, idiotic reason, determine if it's possible to work through to the other side. If not, also leave.",
            "Has she ever in anger broken anything on purpose or threatened to? If yes then it is evidence that she is doing this on purpose. If not, it's still suspicious since she doesn't break her own stuff. What have you said when she breaks things? You mentioned once it was \"cute\" but what has your reaction been since? If you are angry about it then she shouldn't think it's cute. Very strange behavior on her part.",
            "Is there any chance she's doing this on purpose to get you to break up with her?",
            "I would make a list of what she's broken and what it cost, then sit her down and show it to her. Say, \"This is $5K (or however much) dollars. I could have spent that money on a nice vacation or a new car, but instead I had to spend it on replacing things that you broke. If it was honestly an accident, I forgive you, but I also feel I have plenty of reason not to trust you around my stuff, and you can't blame me for not letting you use it anymore. I don't want to believe that it was on purpose but considering that it's always MY stuff that you break, that's how I'm starting to feel. I'm taking this seriously and I need you to take it seriously too.\"",
            "Since you have not taken any action other than locking up your stuff, you need to put yourself out there one more time in order to make a point, IMHO.  I think you should say, \"I will lend you think camera (or whatever it is) if you think that you can take care of it.  Your track record for this is terrible, however, and I am dubious about your ability to take care of this.  If you borrow this and break it, I need you to understand that A) You need to replace this because it is NOT an IPAD or a sweater, it is SERIOUS.  and B) If you break this, I can NEVER, EVER lend you anything ever again.  So if you want to take that on and you are committed to taking care of it, let's DO THIS.\n\nThat's what I'd do.  I've done the same thing with money for people that are bad at paying back.  \"If I lend you this money, you can NEVNER EVER ask me for money AGAIN EVER until you pay me back.  So if you choose to NEVER pay me back, understand that it is in your hands to do that, but you will NEVER, EVER be allowed to ask for money assistance EVER AGAIN, EVER.\"\n\nAnd they didn't pay me back, and it was the best money I ever spent because I got to bring it up as a GUILT-FREE way to not lend money for the rest of my relationship with that person (SISTER).",
            "How's the sex? I only ask because it sounds like she's fucking you in the ass.",
            "All seriousness aside, I like how you said \"and they all died\" talking about your sweaters. ",
            "Tell her to cut it out, that shit isn't cute anymore ",
            "Presumably you have insurance? Make a claim. Pay the excess yourself, the first time - after that it's her cost.",
            "Why doesn't she use her own things?",
            "The saying is: \"it's cheaper to keep her \", but in your case, maybe not so much...",
            "She's doing this on purpose for attention, she never breaks any of her stuff. There are other ways to get attention and if she resorts to destroying your property, it could get worse in the future",
            "To offer a different perspective: you said in another comment that she doesn't break her own stuff (or at least her own phone). My partner is notorious in our household for accidentally breaking shit (we have a separate budget for glassware). Has been this way his whole life. So as a result he has tended to purchase break-resistant items for everyday life, including his phone.\n\nTo me this whole post reeks of somebody who is more careless than you'd like in a partner but who is otherwise harmless. Her carelessness has affected you financially for sure and that is worth addressing, but perhaps in a harm minimisation way more than anything. Seriously, some folks are just clumsy.",
            "Even if you tell her she needs to replace anything else she breaks, if she stops breaking things you know this is a dealbreaker, all she had to do was care more or change her attitude and she could have saved you 5k, whether it was on purpose or not she willingly cost you 5k by not giving a fuck, good luck man.",
            "Breaking one ipad is bad let alone break two... its not even clumsy anymore",
            "Set up a repayment plan for her to follow on things she breaks. She'll probably stop breaking shit when she knows she won't just get away with it. She's being reckless and disrespectful with your belongings. Breaking something on accident once can be understandable. However, this is excessive."
        ]
    },
    {
        "post_id": "4eamww",
        "author": "enfleurs",
        "title": "(Update) I [28F] think my husband [35M] might be hiding something from me",
        "url": "https://www.reddit.com/r/relationships/comments/4eamww/update_i_28f_think_my_husband_35m_might_be_hiding/",
        "score": 2312,
        "num_comments": 139,
        "created_utc": 1460380484.0,
        "selftext": "Hi, I wasn’t going to post an update but I was getting a lot of messages so here it is. Link to other post is below. \nhttps://www.reddit.com/r/relationships/comments/4dlhk6/i_28f_think_my_husband_35m_might_be_hiding/\n\n\nI asked my husband about everything in my post and he had really good reasons for some of it. It felt like that was the first time in a long time that he was being completely honest with me. He showed me inside the safe, backpack, showed me he had a second phone.\n\n\nFor anyone wondering the backpack just had clothes, an iPad and laptop, toiletries etc for “work trips.” The safe also held a gun which I had no idea he had. He says he got the second phone because he almost got fired for being unreachable one time so he got another phone on a  different network so his boss can always reach him, and he didn’t tell me because he didn’t want me to worry about him getting fired or us having to move to an area with better reception.\n\n\nI had decided to just leave it at that for a while because he was finally being honest with me and I knew he wasn’t doing anything nefarious so I was just going to drop it, but I saw he left his phone unlocked when he went to the bathroom and I couldn’t help myself so I snooped… I know thats bad but I just wanted to stop worrying. I looked at his texts and there was one woman who told him she loved him and the texts were really flirty, and another woman who he was talking to but I didn’t have time to read that convo. I only had maybe two minutes on his phone before he came running back from the bathroom (probably realizing he left his phone unlocked). \n\n\nHe knows I know but he doesn't want to discuss it because he doesn't know how much I know, so he's been pretty much avoiding our son and me since then. Honestly I just wish I never picked up his phone in the first place. I know that I need to leave him but just the thought of being a single mom and our son having to live the \"divorced parents\" life makes me sick. I've only told a couple people and my one friend offered to take me and the baby in so I can finish up my maternity leave without having to worry about buying a house, but he has a newish girlfriend so I doubt that would be ok with her, and he works in the same department as my husband. \n\n\nThat's all there is to update on. I know I need to get my shit together and deal with this but I'm having a really hard time pulling it together. \n\n\n**tl;dr**: Lots of lies and he's cheating on me. ",
        "permalink": "/r/relationships/comments/4eamww/update_i_28f_think_my_husband_35m_might_be_hiding/",
        "comments": [
            "Better the \"divorced parents life\" than the \"mom resents but feels trapped with my cheating father\" life.",
            "Better your son live the \"divorced parents\" life than the \"my parents hate each other\" life.",
            "I was wondering how this one turned out - his excuses did sound pretty weak, especially the second phone. I'm glad you snooped and found out (the ends justified the means, here!). \n\nHe was confronted and STILL didn't confess. I hope you remember that and do what's right for you and your kid. Being a child of divorce is likely less harmful than being around two parents who don't get along and having a father who cheats on his wife. ",
            "A testament to the power of the gut.    All hail the gut.",
            "That sucks to hear, OP. I was hoping that there was a valid reason behind his actions, but turns out he's just a terrible cheater. Divorce may not sound appealing to you at this stage, but I feel like if you stay in this relationship it will only get worse. You will resent each other more and more, you will both be unhappy and if you decide to stay with him because of your child, you are committing yourself to another 18 years with someone who doesn't love or respect you. Do you really want your child growing up in a household thinking that your unhappy marriage is how people in love are supposed to be? \n\nReally, I can only see two options for you from here. You can either stick with him, go to couples counselling, establish communication and try to rekindle what you've lost, but keep in mind that you will always *always* remember that he cheated on you, lied to you and then avoided the whole thing.\n\nThe other path you can go is get a divorce, establish custody boundaries and move on with your life, away from someone who would treat you like this. Staying with your friend might be an okay idea, but if it's going to interfere with their love life it might not be the most considerate one unless its an emergency. Perhaps you could stay with family instead? Honestly though, unless your house is in his name I would kick your husband out and stay right where you are. Good luck.",
            ">He says he got the second phone because he almost got fired for being unreachable one time so he got another phone on a different network so his boss can always reach him, and he didn’t tell me because he didn’t want me to worry about him getting fired or us having to move to an area with better reception.\n\n\nWTF this is the most lol wat excuse I ever heard of. \n\n\nGo stay with your friend. That's all you need to do right now. Friends and loved ones can help you get a plan together for the future.",
            "I'm glad you managed to snoop on his phone and found out, because his story about needing a third (secret) phone because he doesn't want to be unreachable at work is bullshit, and it sounded like you believed it.  I mean, he has a work cell phone and a personal cell phone *besides* that one.  And it's a really bad sign even if his reason was true, because a second smartphone account is expensive, and you're his wife... him hiding that from you... gah.\n\nAlso, um... I can't believe you are considering moving out of the house onto a friend's couch.  You have a 2-month-old baby.  He's the one who needs to leave.  \n\n",
            "Your son is young enough that he won't know the difference between having married parents and divorced parents. Your divorce will not be a life event for him, but rather some vague thing that he doesn't remember. I'm certain that he will be grateful to not have to grow up with married parents in a bad relationship. And your son will most likely eventually have a stepdad who isn't a scumbag so he'll have a chance at a decent male role model in his life. He isn't going to get that from your husband.",
            "> single mom and our son having to live the \"divorced parents\" life makes me sick  \n  \nIt's 2016. You can either get over this stigma and leave or you can continue living the rest of your life with a man who is cheating on you and in love with other women",
            "This is awful, I'm really sorry to hear this. Another red flag that no one is talking about: I can't imagine having a gun in the house and not telling my partner. Really dangerous.",
            "See?! I said he wasn't a super sneaky spy!\n\nAnyway. Sorry to hear, OP. What a shitty thing to do to you and your son. ",
            "Lots of people have said this already, but as a kid to parents in basically the same situation, divorced life for your son is the better life. I often wish my parents were divorced, as crazy as that sounds. Having parents who are cheating on each other or don't like each other is kind of worse than having divorced parents, plus it has the potential to fuck up how they view what a healthy relationship is. Sorry you have to deal with this. ",
            "I was with somebody for a while who lied and cheated. We weren't married, but I was committed and put everything into the relationship. \n\nWhen you realize you're being lied to and manipulated, it gets kind of weird, or it did for me anyway. At first, I thought I could handle it, thought I could \"understand\".  And then I just started feeling stupid, used, unappreciated. \n\nBut the worst was not ever knowing when he was telling me the truth. It felt like some bizarre game in which I was always at a disadvantage.  It'll drive you mad, and believe me, it isn't worth it. \n\nIt really hurt to put so much into a relationship, and just have my good nature ripped off, and even used against me. \n\nBut things got much better, very quickly after we split.  I'm now married to a great man who sincerely loves me, and I love the life we have built together. I'm afraid you won't have that with the man you are with now.\n\nThe happier you are, the happier your child will be.  Your child being so young, I would think the courts would give you the vast majority of the time with him.  \n\nBrighter days are ahead. Set a course, and make it so!  Good luck to you. ",
            "As a child of divorced parents (cheating husband) - it was the best decision they ever could have made. They divorced when I was a baby, I'm now in my late 20s and have never once wished they were together.\n\nDo what's best for you and your child.",
            "Everyone on this thread is giving really great nuggets about possible custody arrangements so I won't add to them, but I would advise you seek an attorney that specializes in family law as soon as possible. Some (not all, but some) will do free consultations and will advise you of your rights as a mother and the possible outcome of divorce proceedings. Just because you consult with an attorney doesn't mean you have to immediately file for divorce (which is a stigma I hear a lot working in a law office). \n\nIIRC your husband has a job that involves government contracting and security clearance? You'll need a lawyer to navigate that during a divorce, if you choose to get one, so you'll want to consult ASAP anyway. =)\n\nI wish you luck in whatever you choose. Stay strong!!",
            "I've read all of this comments here and what i've seen no one point out is the effect his actions will have on your son? Are you going to send a message that this is ok because if you ignore this then it can seem that way. Also sometimes its better for your son to be divorced and eventually be in a happy situation then stuck in one like this.",
            "My dad was a laying cheating piece of crap and my mom stayed with him for 25 years. Now they are finally divorced, but the damage is done. All five of my siblings have anxiety and depression, I had an eating disorder from my anxiety. Our family is getting extra pulled apart because everyone has a say in our situation because we lived in a small town, and my dad was always a \"stand up guy.\" Don't do that to your child. Leave while he's still young enough to not remember, respect yourself enough to get out. Starting over is hard, but I wish so much my mom would have left when I was a child. Not when I was a teenager sitting between them, explaining why I thought divorce would be the best option.",
            "Get tested for STDs right away. I'm so sorry.",
            "So now you know.  Start coming up with a plan before you do anything.  I am so sorry your marriage to this liar and cheater is over.",
            "Sorry to hear. \n\n> loved him and the texts were really flirty\n\nDeal breaker.\n\nI'm busy with my divorce. My wife also decided to be more than friends with my ex-best friend. I filed for divorce with 2 kids (7,12)\n\n>the \"divorced parents\" life makes me sick\n\nYou would get used to it believe me. I would rather divorce than be a doormat for a cheater rest of my life. If you stay, you are telling him you are ok with the cheating. There will be other women .. that I can promise you.\n\nDon't be a doormat. Divorce the cheating f!cker.",
            "Well that sucks. The secret gun is worrying too. But you handled it perfectly. You were basically forced into snooping. Now get a lawyer. \n\nThe best of luck to you, and remember, this either this woman is the tip of the iceberg, or she was about to be the tip of the iceberg.",
            "Ah yes the secret 2nd work phone, yep my now ex had one of those to, he was cheating on me (and knocked up the other girl). ",
            "Is living the \"divorced parents\" life going to be worse for your son than living the \"my dad cheats on my mom, she knows, but she sticks around and takes it\" lifestyle? Think about all the terrible life lessons that would teach your kiddo. It's better for him to have divorced parents than to grow up in a home where one parent is a lying cheater and the other stayed there for him.\n\nIt's going to be hard and messy. But that's not your fault; your husband is the one who did this, not you. You'll get through it. It's better not to stay.\n\nPS - you should get yourself tested for STDs just in case. ",
            "I just want to let you know, as a person who lived the 'divorced parents' life it really isn't that bad. My parents both loved me, I had a good upbringing.\n\nIt is better a kid has two parents living separately than married parents who are just staying together 'for the kid.' I'd hate if I grew up and found out that my parents only stayed together for me.\n\nYour husband is cheating on you, his phone excuse was quite frankly pathetic and you know that you can do better than this.",
            "Talk to a lawyer and try to get proof, even if you decide not to file for divorce",
            "I'm really sorry that it came out this way, OP. It sucks, there's no way around that. I wish you and your kids the very best moving forward. I know that it won't be easy, but I believe that you can do it.",
            "You dont have to do everything all at once.\n\nYou are in the process of making a drastic life change with a lot of moving parts and small and large decisions. \n\nIt sounds like you know the first step is to get  lawyer. The best way to do this is through word of mouth really.\n\n Has anyone in your local circle of friends and family used legal services? Did they use a lawyer that they liked and ptrusted? If that lawyer wasn't a family/divorce lawyer, they would be a good resource as a recommendation for your lawyer.\n\nPicking your lawyer is a similar process to picking your doctor, you would trust your GP to hook you up with the appropriate specialist.",
            "Hey there. I'm a kid who had divorced parents. I'm now an adult and off on my own life.  \nJust here to say... a kid doesn't need two parents. We can grow up and live happy lives with our parents divorced.  \nFrom what I saw of my friends who had both parents, but the parents no longer either trusted or loved each other, or both, that has a much harder effect on a kid than having parents that live in two separate locations.  \n\nA kid can learn that their two parents can still love them and not love each other.  \nA kid can learn that one parent is a useless piece of shit that only loves themselves, but they still have one caring parent.  \nA kid has a much harder time growing up hearing parents argue, particularly when they get to the age they're capable of discerning that they are the cause of those arguments and that the parents are only together for their sake.  \n\nIt can be hard on a kid, knowing their parents don't like each other and would be happier apart, but they're sticking in this shit situation for their sake.  \n\nAnd it's not like with divorced parents you only have one parent. You have both, they're just in two different houses.  \nYou can make it a fun activity. Like a holiday to go see dad for a few days.  \nYou can both be active in your child's life, without having to put up with each other's company.  \n\nSo... don't feel like you have to stay in this situation just for the sake of your kid. You'll do them no favours. ",
            "To be clear, your marriage is now over as a functional marriage. I'm sorry to be so blunt about that, but it's the first thing you have to accept.\n\nYou have three options, as far as I can see\n\n1. Ignore it and live a sham marriage to avoid the \"divorced parents\" scenario\n2. Confront him and either break up or try to fix things\n3. Leave him (/kick him out)\n\nJust remember that despite the fact you were vindicated, looking through his phone was the end of any semblance of trust. If you are to stay together it will be a long, difficult, possibly pointless process. Whether you do that is, of course, your decision - but it's not an easy thing to rebuild that trust. Especially when you know he will lie to you.\n\nEven if you do choose an option where you stay with him, a sham marriage could still end with him leaving. Trying again could end up with failure because of further dishonesty and lack of trust (assuming either of you even want to go down that route).\n\nMy personal opinion is that once cheating occurs, there's no way back, but only you know your relationship and self.",
            "Speak to a lawyer before you make any decisions. ",
            "I wasn't happy as a kid. I think if my parents divorced sooner I might have been. My father was toxic. If you are unhappy leave. ",
            "I'm so sorry, OP. This is a terrible situation for a new mother to be in. Shame on your husband for doing this to you. \n\nGo see a lawyer. You deserve to be protected. You have a nursing baby and you need to stay in your home. He must go. \n\nAgain, I'm so sorry.",
            "My good friends parents divorced after almost her entire childhood with their bitter relationship. When they did divorced everyone was finally happy. You can't hide resentment from your children, better to rip the band aids off ASAP than have a child in a festering household. ",
            "[removed]",
            "Go to counseling. Sometimes a marriage can be saved.  I know this because I was the one who was being flirty to others at one time in my marriage. It was years ago, we went to counseling and aired out all the underlying crap that was really the problem and worked to change our behaviors. These have been the best 5 years of my marriage and life since then. Not every marriage can or should be saved..but it could be worth it. ",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "5jxf1o",
        "author": "oldaunthelp",
        "title": "[Update] My [66M] wife [61F] is taking care of her aunt [86F] and it is killing our marriage.",
        "url": "https://www.reddit.com/r/relationships/comments/5jxf1o/update_my_66m_wife_61f_is_taking_care_of_her_aunt/",
        "score": 2316,
        "num_comments": 25,
        "created_utc": 1482504463.0,
        "selftext": "Original link: https://www.reddit.com/r/relationships/comments/5fdl1q/my_66m_wife_61f_is_taking_care_of_her_aunt_86f/\n\nSomething completely magical happened. My wife and I were looking at a house we both actually love. It has every single thing we waned in our retirement home and it's close to everything that we need. We were thrilled and when she told her aunt and showed her the pictures of the house her aunt laughed and said \"You can't buy that, it has stairs! I can't go up and down the stairs!\" \n\nSomething clicked in my wife's mind. She simply said to her aunt, it's the house that my husband and I like and the fact that it has some stairs that you are healthy enough to go up and down on won't stop us. Her aunt cried and cried. We called our (new) therapist which suggested that we treat her like a child, check on her every 15 minutes but not give in. We did that and she got over it by the next morning. \n\nMy wife also got more \"tough love\" with her aunt and whenever she'll complain about stuff my wife knows are unreal my wife dismisses it politely. \n\nThings aren't 100% perfect, the new therapist helped my wife a lot, she mainly focused on her and why my wife was feeling the almost nurturing need to be there for her aunt. \n\nThank you /r/relationships for the advice, changing therapists was a great idea, I don't know if I have had the courage to just follow through without you but I did the very next day. \n  ---   \n  **tl;dr**: Changed therapist, wife realized a lot of things about herself and is now less worried about her aunt and more focused on us. ",
        "permalink": "/r/relationships/comments/5jxf1o/update_my_66m_wife_61f_is_taking_care_of_her_aunt/",
        "comments": [
            "Good update! Your wife seems to finally seen reason and is establishing boundaries. Keep going to therapy. There will be more improvements, but it will take time.",
            "My sister was acting like a child in the ICU/hospital, refusing to cooperate with nurses and doctors and throwing little. I told them to treat her like a tottler and give her \"choices\" of two options (like taking her pills now or after they did something else with her). It helped a lot. She was much more cooperative. You might try that with your aunt. It sets boundaries very quickly.",
            "I said this last time but I don't think you saw it.\n\nThe reason your wife was continuing that codependent dynamic was because, your wife was getting something out of it. It *wasn't* just about duty or the aunt, it was also satisfying for your wife.\n\nI suspect some kind of empty nest syndrome, a crises of meaninglessness/being unneeded and not knowing what to do with oneself.\n\nIf your wife has your aunt to baby, your wife again has a function in the world. \n\nI would suggest finding something for your wife to do outside of the house, to make her feel important. ",
            "The great thing is that the more she sticks to her boundaries the easier it gets!",
            "A Christmas miracle!\n\nNow your wife's mind needs to turn one more click to \"OK auntie, here is your retirement home, bye!\"",
            "Your wife is finally coming around but the worrying thing is that you and your concerns did not figure in her decision to come around. \n\nI just read the older post and it is horrible what she put you through. ",
            "Original: https://www.reddit.com/r/relationships/comments/5fdl1q/my_66m_wife_61f_is_taking_care_of_her_aunt_86f/",
            "Regardless of what is now happening with the aunt, your wife owes you a HUGE apology. She needs to recognize how horribly and unfairly she has treated you, and what a shitty partner she has been throughout this fiasco.",
            "I have to tell you, I think you both need your heads examined for planning to move your aunt into your new home.",
            "Have you moved into the new house yet? \n\nThe next step needs to be bringing in some outside caretakers. I'd definitely want to choose someone who speaks aunt's language, so for that your wife needs to be heavily involved, though you should also be involved in the process every step of the way.\n\nHave you all talked about it in therapy yet? Tell your wife how much you want time away with her. ",
            "Good for your wife for snapping out of it! How is your relationship with her now? Have you gotten more time with her, planned another vacation or anything?",
            "I'm really happy for you, and I'm glad you're in a healthy place in your marriage.\n\nAt the same time, it's important to acknowledge that invisible illnesses are real, and often get blown off by doctors as psychosomatic or malingering. It's possible that at least some of her pain *is* real.\n\nI had to deal with a lot of shit from people, because doctors couldn't find out what was making me ill, until a specialist finally figured it out. So the \"tough love\" attitude does kind of rub me the wrong way. It doesn't help that my efforts to \"get over it\" and \"tough it out\" actually led to harming myself irreversibly. (Though thankfully I'm young and healthy enough that it's fairly minor.)\n\nI'd like to emphasize that going through the medical followup is NOT the responsibility of you or your wife, and you should absolutely not take it on.\n\nBut dealing with her, it's more appropriate to say something like \"if you have a problem, please follow up with your doctor, here's their number, etc.\" rather than \"you're making it up.\"\n\nMake sure the *aunt* has a therapist, because even if it's psychological, telling people to tough out their grief and psychological problems is not humane. It's important to not go overboard with boundaries. You shouldn't take of fixing her psychological issues, but you should pass it onto someone whose job it is to work through these issues.",
            "Wow that sounds exhausting but I'm glad things are on the up and up for you and your wife. ",
            "Am I the only one who still thinks the wife is a piece of shit? Canceling vacations that he booked for the pair of them so she can take care of some dipshit aunt who disrespects them? \n\nWhere is the wife apologizing for being so cruel? Why is the aunt still living there? All she's doing is wasting OP's time and making him miserable. She really sounds like a shit person. \n\nI mean who cares about perfect, lets just get some accountability and basic respect going on. Until wife owns up what she did, starts making it right, and kicks her asshole aunt out I don't see this working out for OP. ",
            "Thank you so much for the update! Such an uplifting thing to read. Congratulations on finding your dream retirement home!",
            ">Her aunt cried and cried. We called our (new) therapist which suggested that we treat her like a child, check on her every 15 minutes but not give in.\n\nWow, thank you so much for sharing. I never know there is a trick! I am going to use it. \n\nGood luck for both of you! ",
            "So.... did you put an offer on the house?",
            "Great to know things are getting better ! This is what r/relationship is for :) ",
            "Sorry for your situation. Hopefully she will die soon."
        ]
    },
    {
        "post_id": "3o6y6q",
        "author": "red-white-blue",
        "title": "(Update) My (26F) fiancee (28M) says I am not American, despite being born and raised here.",
        "url": "https://www.reddit.com/r/relationships/comments/3o6y6q/update_my_26f_fiancee_28m_says_i_am_not_american/",
        "score": 2308,
        "num_comments": 210,
        "created_utc": 1444457995.0,
        "selftext": "[Previous post](https://www.reddit.com/r/relationships/comments/3nwzla/my_26f_fiancee_28m_says_i_am_not_american_despite/)\n\nFirst, WOW. Did not expect this post to get so much attention. I originally planned to reply to all the comments, but theres like 500 on that post now, PLUS messages in my inbox. So, going to be that person and say a general thank you to everyone who took the time to reach out and weigh in. I read all your comments and messages and I decided to talk to Alan.\n\n\nI texted him before he got done work and asked him if he had any plans after, and if not, I'd like to talk to him about something. He said he'd come straight home.\n\nHe got home and we sat down to talk. I opened with saying that I loved him very much and that he was so different from anyone I'd ever met and let him know how much he means to me. I then said \"But\" and brought up what happened at his parents' dinner. Like many of you suggested, I made it clear to him why it was hurtful/ignorant. I told him that in all our time together, he had never made me feel \"other\" and therefor it was a pretty bad shock to hear him say what he said. I told him that it's hard for a lot of people to be minorities in this country, because you always have other people expecting you to play the cultural-bound immigrant, even if you just aren't interested. \n\nFor me, personally, I just prefer not to have to have one foot in two different worlds. I grew up here and that's all I really identify with. The fact that because I look the way I do, or have the last name I do, people *expect* me to be more than I am in regards to India. It's very frustrating when it's a damned if you do or damned if you don't situation. Even in the thread, I had people saying that I'm ashamed of being of Indian descent because I don't fucking care about all the cultural ties to it. To that I say, hey, did you think Alan was *ashamed* of being German/Irish because he's not calling himself German/Irish -American or keeping any norms alive from those cultures? So once again, it falls on me to have to play this part that I have *no fucking interest in playing*. So stop shoving this idea that people are married to their ancestors' culture down people's throats because it creates yet another barrier when it comes to integration.\n\nAnd then I showed him the thread. \n\nBy the time he got done reading everything, comments included, he look mortified. He apologized for the way he treated me during dinner and he admitted to me that his views had been ignorant. We had a long discussion about norms and attitudes he grew up with, and as many of you noted, Alan grew up with \"white\" being the default for American.  He said he never had thought about how caucasians get a free pass when it comes to being American, but someone with different features is immediately considered an \"other\" and needs a hyphen. I apologized to him for not explicitly spelling it out, but I told him that I assumed in this day and age it would be a little more obvious to him. We talked about future children and we both agreed to have them grow up American, and if later they chose to connect with other roots then that was fine too. He said he never wanted to make our kids feel like he made me feel with those comments.\n\nAnd no, he didn't want the whole Bollywood wedding some people thought he wanted. He was just making sure I knew that i had that choice. But now he has promised not to bring it up again and we've finally laid *that* issue to rest. I also told him, albeit a bit more jokingly, that I wouldn't be making him any rohti so he can stop holding his breath that I'd become some indian housewife. \n\nWe both agreed that this is probably not the last conversation we will have about race. But we also agreed that we wouldn't let it go under the rug again. He said he won't be hyphenating anyone else from now on, and instead let them set that identity for themselves. I appreciated that a lot and I could actually see that he took it seriously, that he wasn't just saying whatever I wanted to hear. \n\nSo, wedding is still on. Yaay\n\nReally, thank you guys so much. It was good to feel validated in this. It made me want to actually approach the issue instead of ducking my head and ignoring it. If I didn't know about this sub, I probably would have kept it bottled and so much resentment would have accumulated before I finally exploded. Like a firework. On 4th of july. :p\n\n\n\n\n\n\n\n\n   \n**tl;dr**: Talked to my fiancee, he was completely mortified after reading the thread/ listening to what I was saying. He is making an active effort to change his views and he apologized to me for the ignorant comments that were made. Wedding is still a go",
        "permalink": "/r/relationships/comments/3o6y6q/update_my_26f_fiancee_28m_says_i_am_not_american/",
        "comments": [
            ">hey, did you think Alan was ashamed of being German/Irish because he's not calling himself German/Irish -American or keeping any norms alive from those cultures? So once again, it falls on me to have to play this part that I have no fucking interest in playing.\n\nThis is so insightful.  And I'm amazed that *in the context of a question regarding unintentional racism*, you again had to deal with additional unintentional racism!  Very illuminating to see such concrete proof of its omnipresence.   ",
            "So happy with how your fiance reacted and that it all worked out for you. :)\n\n\nThis post is really close to my heart as I'm also a minority in a Western culture, albeit British instead of American. I even had someone repeatedly asking me for my \"real Asian name\" because he didn't believe that my Western-sounding name was my birth name.",
            "No, no, no, you're not supposed to communicate properly! Where's the  juicy drama r/relationships craves in you calmly explaining your opinions and feelings to your fiancee and having him understand and accept them? \n\nFor real though, congrats. I'm so glad this is a happy ending for you guys! We don't get enough of them. ",
            "[deleted]",
            "Your are completely spot on with this. \n>it's hard for a lot of people to be minorities in this country necauae you always have other people expecting you to have one foot in two different worlds. It's frustrating when it's damned if you do, damned if you don't. \n\nI abolutely agree! And when you said,\n>did you think Alan was ashamed of being German/Irish becsuse he's not calling himself that? \n\nThank you for this. This is the bullshit hipocracy I see and hear a lot. \n\nI can empathize with a lot of your post. It sucks even more when you do have interest in that part but you can never appease anyone. At all. Never. \n\nI'm glad it worked out in your favor though.",
            "Stop behaving like grown ups, if you keep doing this \"talking respectfully to each other\" nonsense you will have a long and (mostly) happy marriage ",
            "No tasty /r/relationships drama today. Truly tragic\n\nSeriously though, great to see this stuff worked out! Always good to have a happy continuation!",
            "I'm still amazed that people in the last thread were saying that he harbored secret racism that he'd never expressed to you in the years you'd been together, and that \"it's not your job to rid him of his ignorance.\" If you'd taken that advice instead of communicating with him, you'd have thrown away a great relationship. \n\nWell done. I'm happy for you and hope you enjoy your upcoming wedding!",
            "So happy! Great job OP and OP's fiancé! ",
            "For the record OP, as a white female American, I also found this really insightful and educational for myself, to really think about what it means to be \"American\" and the assumptions we make about people who aren't white, even if we don't know we do it. \n\nAnd also, it made me think a lot about how white Americans really love talking about how they are German-American, or Irish-American, and enjoy talking about our heritage and family history of how we got here. It's kind of an obnoxious American trait. \n\nKudos to you for your patience with your fiance and really communicating to him what was frustrating to you. And also, props to your fiance for not getting overly defensive, and really listening to what you have to say and being constructive about it. The way that you guys managed to resolve the issue says a lot about what a good marriage I think you will have.",
            "> people expect me to be more than I am in regards to India\n\nWoah. Relate to this 100%... growing up rural 1h north of Edmonton (basically rural as said before) as an Asian really felt weird in that way. I felt it took me like 2 years before people saw me for more than just my race, though admittedly part of it probably would be because I was kinda introverted/a lone wolf(?)/skipped a lot of school.\n\nGlad everything's going well :D",
            "The country you're born in doesn't define your identity. Being from Latin America I get extremely annoyed when my fiance says I'm not white even though I have a lighter skin color than he does. I'm of European descent just like he is. I am white. But for some Americans not being from America, Europe or Australia automatically makes you not white even if you're white as paper. They just call you light skinned latin American, African or whatever. Dumb as hell.\n\nEdit: a word",
            "Wow, I am so freaking happy that your story had a happy ending. I'm so glad that you were able to stand up for yourself, & that your SO realized he was being ignorant?! That's just the brandied cherry on this delightful sundae. ",
            "I have also been accused of being ashamed of my heritage. Any \"rejection\" of my heritage have been due to the fact that people make assumptions about me based on my looks. They expect me to act a certain way or like certain things, and that has made me want to distance myself from these generalizations. I too feel like I am an American, no need to hyphenate anything. It's so refreshing to read your words and know I am not alone!",
            "As a very small addendum to the otherness/hyphenation discussion, I will say that plenty of white Americans do hyphenate--or perhaps, have if forced upon them?  Whiteness has to do with social acceptability as much as anything else; I mean, Italians and Eastern Europeans weren't \"white\" when they first came to the U.S., for example.  So, yeah, being \"Italian-American\" is a way of underlining otherness, but it's perhaps also a \"fuck you\" at The Man--what The Man then saw as stigma, I will trumpet from the hilltops!  You know:  taking an attempt at marginalization and turning it on its head, marking it a mark of pride.\n\nThere are other reasons--Irish- and Scottish-American identities can be...complex.  Yeah.  Let's leave it as \"complex.\"  Sometimes cultural groups were isolated and homogeneous so a sense of identity beyond \"American\" developed.  Sometimes...it makes life a little more interesting to have and celebrate cultural links beyond suburbia, y'know?  \n\nJust spitballing here.\n\nAnyway, I am a Scandinavian-American:  its just like being a regular, mainstream American but better.  Because it just is (uff da!) :)",
            "I was born in Taiwan, I speak, read and write Mandarin fluently alongside English, my legal name is in Chinese... but when people ask me where I'm from, I say Canada. \n\nI grew up in Canada. My cultural identity is Canadian. I drink like a Canadian, I talk like a Canadian. I say \"sorry\" often like a Canadian (heh). \n\nI don't recall ever being categorized to this degree by people until recently; and funnily enough, it was by Chinese people. \n\nI was in the wedding party for a Chinese friend. Me and all the other bridemaids were of Chinese origin. We were all chatting, and the bride said she was adopting her husband's last name (he has a French last name). \n\nThe girls were MORTIFIED. Taking your husband's last name is \"not done\" in China, or Taiwan. Women from that culture associate it with losing our identity. \n\nSo when one of them asked, \"Who gave you that idea??\" The bride pointed to me, \"JustWords--she took her husband's last name!\" (My husband is Australian, and their family name is Scottish). \n\nThe looks these girls gave me. I never felt so shamed for adopting a name. The bridesmaid who asked the question then went on to ask me \"why in the world\" I would willingly do that. She made me feel like I was a \"race-betrayer\". \n\nTo be honest, I do things for my own reasons. Taking my husband's name was important to his family, and it was also important to me. Having grown up in Canada, I felt that sharing a name with your husband was truly showing that you are now part of the same family. I don't feel like I've \"left\" my own family--I felt like our families just melded together. \n\nI make these choices based on what makes me happy, and what would make the people I love happy. The idea that I would be openly judged by anyone for this decision baffled me. \n\nI mean... even my mother, who asked me if I would change my name, was respectful about it. She was upset that I was going to, but she said she understood and respected it. My mom even went through the effort of learning how to pronounce my new name (she's not good at English) properly. \n\nSo it really threw me that I was being judged like this by people from MY GENERATION. If this type of snobbery came from an old Chinese person, I'd understand--that they have solidified their point of view and have a hard time changing it.\n\nWhen I read your post about how your husband's actions made you feel like you had to be ashamed for choosing to identify with American culture, that's what it reminded me of. I just assume people who are our generation would be less ignorant about these things.\n\nI'm glad everything worked out for you! ",
            "Communication for the win!\n\nGlad to read this update, OP! So glad he now sees your view and has apologized for his ignorance. \n\nGood luck with the wedding!",
            ">that I wouldn't be making him any rohti \n\nYou're an evil, evil woman. The world would be a better place if we all ate roti once in a while.",
            "I was born and raised here in Florida but my mom is from Germany. I was raised though speaking German as my first language, in a heavy German household. Growing up and going to friend's houses I always felt I was in a slightly different world. My friends always say I'm American but I maintain I'm German-american. Being first generation as well I'd say you have a slightly different cultural upbringing but that doesn't affect how you identify yourself. I'm glad you talked it through and he seems to understand but it seems to show a bit of cultural blindness. Through talking and showing each other how you grew up understanding your meaning of American over time I feel he will grow to understand ",
            "This update was supposed to be about how you discovered he was some closet racist and then you hit the gym and lawyered up! This is not these things happen on reddit! ",
            "Refreshing as fuck. You have a rational, human spouse that makes mistakes as we all do, but then listens to your perspective, admits if he was uninformed and adjusts his viewpoint when confronted with new information. Congratulations r/relationships, we did it. We've got a healthy, loving relationship right here. Have a wonderful wedding and an even better marriage, OP.",
            "> For me, personally, I just prefer not to have to have one foot in two different worlds. I grew up here and that's all I really identify with. The fact that because I look the way I do, or have the last name I do, people expect me to be more than I am in regards to India. It's very frustrating when it's a damned if you do or damned if you don't situation. Even in the thread, I had people saying that I'm ashamed of being of Indian descent because I don't fucking care about all the cultural ties to it. To that I say, hey, did you think Alan was ashamed of being German/Irish because he's not calling himself German/Irish -American or keeping any norms alive from those cultures? So once again, it falls on me to have to play this part that I have no fucking interest in playing. So stop shoving this idea that people are married to their ancestors' culture down people's throats because it creates yet another barrier when it comes to integration.\n\nI agree with this wholeheartedly and want to share an anecdote from my life. I'm white American, many generations deep. I love Indian culture, went there to study abroad, minored in South Asian studies, etc. One of my best friends from college is ethnically Indian, born in India and moved here as a child and raised in NYC. However she never mentions anything about Indian culture, and I noticed this very early in the friendship so I don't try to talk to her about Indian culture. It's just not something she's super interested in. She has other interests, like the Yankees. I figured it out early, and that was that... I never classified that as \"good\" or \"bad\" it's just who she is, and that's fine. As long as she's happy doing what she does, our friendship has lots of other aspects and her ethnicity doesn't define her to me.",
            "Your story reminds me of mine a lot. I am white and American. My wife is Indian but moved to the States when she was two. She became a citizen when she was 18 and has always identified more with her American upbringing. We did a Hindu wedding that was kind of a fusion ceremony, but then we also did a Catholic wedding for my side of the family.\n\nI've been in your fiance's position where I would say things that come across as insensitive just because I don't have the vocabulary for how to speak about it. It also comes up a lot because my stupid redneck family sometimes say things that can be construed as racially insensitive although they are not being malicious. I swear to god, my elderly mother probably still has to double check how to spell my wife's name. And my family always seems to forget that she doesn't eat beef, and it's always a big ordeal finding something she can eat at the last minute. \"She doesn't eat pork, right?\" Give me a break, people. \n\nAs it turns out, sometimes people don't even know that they're being insensitive or thoughtless. It's always a learning opportunity for everyone, and for the most part, people want to learn to be better to avoid hurting someone they sincerely care about. \n\nImportant thing is to continue doing what you did here, which is to be patient, explain the issue, and come up with a plan for how you might resolve similar issues if they ever come up in the future. There will be difficult issues that come up in wedding planning, raising children, choosing whether the kids will be introduced to religion and if so which one, etc. Just make sure the lines of communication stay open, everyone keeps an open heart and mind, and don't harden yourself if people make an occasional mistake.",
            "Aw! I'm glad you two talked it out. Sounds like you have a good basis for further discussion and it's awesome that you brought it up instead of getting madder and madder about it.",
            "Ugh. Happy endings are so boring. \n\nOn a more serious note, glad everything worked out OP.",
            "This is so beautiful to read. I'm glad it didn't end up with the all too common split over differences, and am really proud of you guys for sitting down, having an adult conversation and working things out. I wish you the very best for your wedding, and for the future! Keep rocking :)",
            "I have this problem all the time. I'm originally from Mexico but have lived here in the US for 20 out of my 21 years of life. I feel as American as I can get yet because I'm not a \"citizen\" people always perceive me a certain way. Once they learn I'm Mexican they compliment me on my fluent, accent-less English as if I'm supposed to add the words \"ese\" and \"holmes\" to every sentence.\n\nHappy to see that your fiance is realizing his mistakes and open to educating himself a bit more. My boyfriend is the same way. He never grew up around other races so he tends to be a tad ignorant until I explain the situation to him. This kinda thing will only pop up more in the future but as long as you both are open and honest and communicate, you should be fine.",
            "Wow! This is such an interesting topic to me. I was having an argument with my friends about this the other day. Have you ever seen the video of raven symone, where she says she identifies as simply \"American\" and not African-American? I feel like this is very similar. And I feel like you are both right, and you have a progressive mindset. \n\nI was trying to start a discussion about this on reddit, but for the life of me, I couldn't figure out how to phrase the question properly so the bots wouldn't take it down. \n\nBut i wonder... What does it take for \"minorities\" to lose the hyphenation? If your family has been here for 200 years, and 10 generations, are you still African-American, Asian-American, Mexican-American? Or are you just an American now? I feel like the this causes a division between the cultures, when we should in fact be united as Americans. ",
            "I'm so glad things worked out for you!",
            "Congrats on getting married and have this work out so well! I thought I should point out to you though that your \"American\" wedding is really more of a European one. I've been looking up all the traditions in typical American weddings to see what they mean and decide if I want to use them. Turns out your dress will be white (or close to white) because of Queen Victoria of England, your bridal party is for protection from spirits, bachelor parties came from Sparta, etc. I suppose the mixing of everything makes it American because we are a country of immigrants, but it's mostly European because we borrow little, if anything, from cultures in Africa, Asia, or even from Native American traditions. Just an interesting tidbit to pass along! ",
            "This is a fantastic update, I'm so happy for both of you. Good luck with the wedding planning!",
            "This is an extremely fascinating thread to read in relation to a book I've been studying recently in school. If your bf wants to read more of what it feels like to be the \"other,\" and the ontological issues with a non-white being forced by the white race into the role of \"other,\" Frantz Fanon's *Black Skin, White Masks* has an unbelievably good chapter on it. The chapter is called \"The Fact of Blackness,\" and while some of the terminology may be confusing if he hasn't read Hegel, Fanon does an amazingly good job of placing you in the shoes of someone who's been discriminated against and making you feel uncomfortable by it.",
            "Glad you worked it out. Shame about the rohti as that is amazing flat bread! ",
            "Sounds like a great conversation, glad he was willing to listen and change his preconceptions.",
            "Good for you. I disagree about the rohti though. Indian food is so freaking delicious, I could eat it every day. ",
            "Ghank god this had a happy ending. I'm so used to seeing this sort of thing ending horribly, it is refreshing to see someone who fucks up admit they fucked up and apologize.",
            "Communication! ",
            "Yay, glad things worked out! I figured that if he was a half-decent guy, it would come out like this.",
            "Get's me in the feels. ",
            "Awesome! It's great that you two could have a really productive conversation about this.  Ingrained racism is really hard to notice and get over so as long as he's willing to try, I think it's definitely a good sign!\n\nHope your wedding is awesome! :D",
            "My friends do the same by calling me mexican.. My dad is the only one that came from mexico, I havent. So I'm not mexican; I'm american. \n\nDoesn't seem to fly for some reason. ",
            "In the original post people kept saying that he was ignorant because he is an American forgetting that so is she. Just wanted to point it out since it annoyed me.",
            "This is so great! I'm so pleased for you guys being able to talk it through like this, especially in a way that gave you both a place to air things out *and* see where the other was coming from. I hope you have a lovely marriage.",
            "Yay! Happy ending and a wedding! A good way to end the week! :D",
            "I'm so proud of you! \n\nCommunication is a powerful tool. Use it for good! ",
            "I'm so glad you two we're able to talk this through. Best of luck with your upcoming wedding!",
            "You're marrying a cool dude.",
            "I'm so happy to see an /r/relationships dilemma solved by actual communication. ",
            "Hooray!",
            "great news!",
            "It sounds like you're in a very healthy relationship.  I think a lot of people on this sub could learn a lot from this post.  Congratulations and best wishes!",
            "Glad you guys worked it out, and he sees how what he did was wrong and hurtful. ",
            "That's wonderful. :)",
            "Whauw, good conversation. That is the proper way of doing that in a serious relationship!",
            "Yay! Positive update!",
            "Happy it turned out this way and a win for r/relationships ",
            "I'm not from the US so admittedly I don't understand the racial nuances in America... but can I ask, if you were born and raised in, say, Greece, would you go around saying you were Greek? Or is it the \"melting pot\" nature of America in particular? ",
            "I hate the hyphen. I feel that it divides this country. If you move here and become a citizen your a freaking American and if you choose to become an American then you should accept the cultures and religions of others and expect the same. You live here and benefit from all this nation has to offer then contribute to it. Classifying and segregating to your own sub culture hurts this nation. It has and always will. Kudos to you op and your parents for adopting a more open view. Unfortunately for most white people we have been brow beaten over the head with this \"PC\" idea that everyone is unique (that is true they are) but that we must coddle everyone as to not hurt their feelings.",
            "[deleted]",
            "Well at least reddit did something good, happy marriage!!! ",
            "You mentioned \"rohti\". I've never heard of rohti before. I looked it up and I'm wondering if your family is Indian? And if so perhaps you'd enjoy an Indian wedding?",
            "After reading all the comments who wouldn't agree in fear of a reddit crusade! ",
            "I'm very glad you guys talked about it. He seems like a good guy. \n\nBut, I'll be honest here, I have to say it. How can you honestly, *legitimately* NOT know that \"white people are the only REAL Americans\" is an incredibly ignorant and racist sentiment in 2015? \n\nLike, I totally understand why he might think you would want an Indian wedding or something. I understand why the conversation about your personal identity needs to happen. Just like getting to know someone in every other context, understanding how they identify is an important thing to talk about. So he's not wrong or bad for not knowing how attached or not-attached you are to Indian culture. \n\nBut how can you seriously, actually NOT understand that \"white people\" =/= \"american\"? Like when you said \"Are we going to have beer steins?\" and he was utterly BAFFLED, he literally had no idea what you could possibly be talking about. \n\nHonestly, I just....I had to read that line over and over again. I was raised in a very white-washed, privileged community. I never knew any black kids, the only Mexicans I knew were \"workers\". I never had any gay friends or knew anyone gay. \n\nI went to exclusive private schools where the parents drove Maseratis and Rolls Royces. My best friend's first car was a BMW when we were 16. All three of my closest friends had plastic surgery before 20. Most kids in my high school got Porches and Mercedes to drive on their 16th birthdays. The only \"minorities\" that broke into our community were the incredibly rich--offspring of politicians, athletes, or other prominent community members. So we are talking, super homogeneous, privileged, shelter little bubble world of white people and white values. That is how I grew up.\n\n  But like I still understand--deeply, deeply understand--that \"whiteness\" does not define who is an \"American\". \n\nI'm just having a hard time understanding. We live in the age of the internet, when Facebook is inundated with gay/gender/race soapboxing CONSTANTLY, I feel like we live in an onslaught of perspectives about this...how has he never ever in his life ever been presented with these ideas???? \n\nI get the whole \"my middle class upbringing\" copout, but being middle class doesn't replace your brain. My friends in high school had entire WINGS of houses to themselves. Their parents were millionaires. I can count on my hands how many non-white kids we had in our school. And it is still considered an OBVIOUS FACT that white people aren't the only \"Real\" Americans. Has he never read a book?\n\nI went on kind of a rant. I'm sure he's a nice guy. But that was an incredibly, incredibly stupid ignorant inexcusable thing to say and I hope he takes some more initiative in understanding racial/ethnic/national identity more after this. Because holy shit. My brain melted a little when I read his excuses.",
            "I just want to say that before when your fiance was harping on the Indian wedding, he was just unaware that your culture is American culture. You were born in America, English is your mother tongue, you know what region of India your grandparents live in, you watch the same crappy reality TV any American watches. That's American. My best friends is Taiwanese. His father was the first sibling to come to America, and the family has slowly been bringing my best friend's aunts and uncles over one household at a time. My friend's dad speaks little English, but my friend and his brother are native English speakers, they speak Mandarin with their parents but need to constantly review it for their own sakes. Their mother cooks Chinese food every night (really though, it is just food, boiled eggs and fish, veggies), and they have a low opinion of Mao. That's all. I would say the family is, umm, \"very in touch with their roots,\" being that they are the first gen children of immigrants, but that whole family is American. They buy their cars at dealerships, the kids/cousins all play video games like me, one kid will do drugs and go to EDM shows, the whole family watches fireworks on July 4^th . American. Just because your grandfather didn't fight for the Yanks in WWII does not mean you aren't American. ",
            "Perhaps the stupidest post I have ever read. You got mad at him for trying to adhere to any culture differences you may have had, and call him racist. There are people who would be offended at people NOT doing this.",
            "A perfect Bollywood ending. ;)",
            "Great! I would say make sure your kids have a tiny taste of both your cultures though and encourage them to explore their background while making sure they know how you feel though.",
            "> I also told him, albeit a bit more jokingly, that I wouldn't be making him any rohti \n\nWell why the hell not? That shit is delicious, and as working with an indian taught me, fairly easy. ",
            "From the way you talk you seem like a model of integration (you and your parents of course). I wish more people would be that way. If you decide to go to another country, integration is key. You can't hold on to all your old traditions and values, unless you really don't want to be a part of that culture and rather remain with your \"old\" culture. It's cool if you can mix it up, but I see a lot of immigrants here who do not accept their new country as the new norm, won't even learn the language, so I wonder what the fuck they're even doing here. Instead they are creating ghettos, nothing more.",
            "Only one correction, hes not Caucasian because I doubt hes from the caucus isles.\n\nEDIT: Caucus Mountains as I was corrected.\n\nEDIT: By all means keep down voting, not liking what I said makes it no less true. You cant change a fact.",
            "[deleted]",
            "I'd postpone the wedding if I were you. Sure, he said some nice things, but I'd need to see him actually prove it with his actions before I could think of marrying him. ",
            "All I'm seeing is a bunch of cry babies because their white husbands have more privilege than them. \"You don't know what's it like!\" Well fuck if you cared to have someone relate to you you would've married someone in your position. Wouldn't have to be the same race. It could be another minority but you wanted the white guy with privilege who is the standard for all other men to live up to in this country. How is he supposed to ever understand what you think. He doesn't. He's just nodding his head because he doesn't want to fight. You guys want to be equal with whites? Ha! Segregation happens in nature. You're only equal among your own. To them you're just the token exotic girl who's so cut off from her race that she has to ride white people's coat tails. They feel sorry for you!",
            "I honestly pity you for continuing a relationship with a racist. Just because he won't say these things out loud doesn't mean he doesn't still think that way about you. ",
            "Yup your fiancé is a classic closet racist And this is without question a huge red flag. But this is /r/relationships so as long as he's not beating you it's not a problem. Good luck op!",
            "I'm glad this all worked out in such a feel-good family movie kind of way, but I suggest postponing the marriage a year, or at least until you two have a big angry fight of some kind. I'm not saying you should trap or goad him into one but latent racism like this doesn't evaporate in the face of logic. I predict that unless you perform this figurative biopsy one day you two will be arguing and something will slip out and of course he'll apologize profusely afterwards but you'll realize that deep down he still harbours prejudice."
        ]
    }
]