[
    {
        "post_id": "5qtdu2",
        "author": "Keshet279",
        "title": "I'm (28F) not sure if what mt therapist (30sM) said to me is creepy and inappropriate",
        "url": "https://www.reddit.com/r/relationships/comments/5qtdu2/im_28f_not_sure_if_what_mt_therapist_30sm_said_to/",
        "score": 2301,
        "num_comments": 86,
        "created_utc": 1485689480.0,
        "selftext": "So I started seeing my therapist a few months ago and after the first session I decided I liked him and felt like I could trust him. We've recently been doing some work on my lack of assertiveness/ inability to call people out if they upset me because I'm scared of hurting their feelings.\n\nI can't exactly remember how the conversation went but he suddenly said \"can I be honest with you? And I hope you trust me enough to listen and not take this personally but from the moment I met you I could tell you were very vulnerable. I knew that if I wanted something more from you than a working relationship, I could have had it. You're in a vulnerable position here, I'm a man who's stronger than you and I could see your vulnerability, I knew you wouldn't say no\"\n\nFirst of all this pissed me off because obviously I would say no, I'm engaged and also am not about to fuck my therapist regardless of my situation. Second of all I found it really creepy and unprofessional. I get the point he was trying to make, I just don't understand why he had to use that theoretical situation. \nThird of all, why the hell was he wondering whether he thinks he could take advantage of me or not in our first session?\n\nAnother important point is that I was raped in the past and he is fully aware of this. He brought it up and said \"I can see how it happened, you didn't give him the right signals that you didn't want to have sex with him. By the way I'm in no way suggesting that it was your fault\" I couldn't help but think that he totally was suggesting that and it really upset me. Also, that's not even true- my rapist was fully aware I did not want to sleep with him. I can't stop thinking about it but I'm not sure if I'm overreacting or not. Maybe I just didn't want to hear what he said so I'm thinking he's wrong to say those things when in actual fact he's just doing his job?\n\nHe's said other slightly weird things in the past that I've let go and assumed I was being oversensitive but I can't stop thinking about this.\n\nTL:DR Therapist basically said he felt like he could fuck me if he wanted and I probably wouldn't say no. Went on to hint that my rape was my fault. Do I sack him off?",
        "permalink": "/r/relationships/comments/5qtdu2/im_28f_not_sure_if_what_mt_therapist_30sm_said_to/",
        "comments": [
            "[deleted]",
            "> \"I can see how it happened, you didn't give him the right signals that you didn't want to have sex with him. \n\n#No NO NOPE NOPE NOPE\n\nPlease change to another therapist immediately...  this guy is really inappropriate and creepy",
            "WARNING SIGN WARNING SIGN WARNING SIGN.\n\n\nThat is all kinds of creepy and inappropriate. Between that and the \"the poor rapist prbably didn't know you didn't wanbt to have sex, because of what you did, but I'm totally not saying it's your fault...\" I would say that he's trying to groom you, or test the waters to see if he can sexually harrass or abuse you. He's trying to convince you both that it's your fault if he does anything, and also that you're too weak to deny him.\n\nGet out and see if there's a governing body you can raise this with. I would lay good money on him having done this before, with other patients.",
            "WOAH! \n\n[I posted this](https://www.reddit.com/r/relationships/comments/5qoqxd/my_30f_husbands_32m_therapist_50sf_was_kind_of_a/dd1g7l5/) about my unpleasant experience with a therapist. \n\nI would do the same in your case as I did in mine- ask for a full refund for ALL sessions and I would report him to the appropriate association. He is not only not helping, but he is making it worse, but making you even more vulnerable than before you started therapy. \n\nAll the best.",
            "Holy. Fucking. Shit. \n\nSack him. Report him to his boss, to the licencing board, to the newspapers, and to the police.\n\nThat is terrible. He is so bad at his job.",
            "Sack him off now. \n\nThere are plenty of other ways that the issue of your vulneratility could have been highlighted. \n\nThere is no reason for him to even insinuate that the rape was your fault. \n\nEven in the 100000000 to 1 situation that he's a councellor who's bad at communicating and has 0 interest in you, that alone is worth sacking him off for. \n\nAny therapist that makes you feel like that is not one you need to deal with.",
            "Report him. Very unprofessional. He's setting you up mentally to fuck him. Edit...As a therapist he knows your weaknesses. ",
            "I'm a therapist, so first of all, report him. Second, take this opportunity to use the skills you've hopefully been learning in session to be assertive & stand up for yourself. Practice what you want to say. If you want to go into detail, have at it, but expect him\nto manipulate the situation & turn it into what's wrong with you, not him. You don't owe him an explanation. He knows what he did wrong already. Something along the lines of, \"I won't be coming back for therapy\" will be just fine.    ",
            "Yes, even if he was \"trying to make a point\" that seems like a super shitty way to go about it.\n",
            "Two kinds of therapists in the world. Those who are drawn to the profession because they have a deep seated empathy and a desire to help people, and those who are drawn to the profession because they are *predators.*\n\nGet out, OP, and report this awful person to EVERYONE. Sexual remarks aside, gas lighting your experience with rape is another reason this man should never work again.",
            "I'm a therapist as well (I see several therapists responding here) and that is TOTALLY inappropriate behavior.  I would NEVER say something like that to a client, especially because clients can be vulnerable and are looking to me for safety.  That is really messed up!  I would highly suggest finding a different therapist.  I have worked with multiple male therapists and trusted them immensely, they have never even said anything remotely creepy.  ",
            "Wife's a psychologist. She says report him. Call the state licensing board.",
            "So he is doing the \"I'm not racist but [insert racist stuff]\" about you being at fault.\n\nAs a general rule, when someone tells you that they are helping you, check their actions. Chances are they are trying to convinced you. When someone tells you that they aren't racist, listen to what comes after. And when someone tells you that they aren't telling you that something is your fault the odds are pretty high that they just did that or are going to. Otherwise they would simply tell you that it's not your fault, just like my other examples would show that they are helpful with actions or not say anything racist.\n\nReport and find someone else.",
            "As someone who studies Psychology, and is entering my Grad program to be a counselor, this is so fucking infuriating and scary. There are so many people getting licensed that have no business of being in the field.\n\nFind a new therapist immediately, as your therapeutic environment has been completely destroyed. I'd also report him, because if he says that to you, then you're probably not the first. I wouldn't be surprised if he has made a move on a patient (or more) of his in the past.",
            "He should be reported. \nEven if he starts making excuses or try to wriggle his way out of it, his supervisor will be looking into this. \nIf we had complaints at my old job (psychologist in a clinic) our supervisor would always sit down with the patient to go through the situation, then get the psychologist in to talk through it. After the patient left, there would be a one on one talk. ",
            "That's awful.\n\nI have to wonder how many other patients he's groomed this way. I doubt OP is the first.",
            "What the fuck? There is zero ambiguity about how not okay this is. Drop that manipulative creep, report his actions, and personally I would recommend that you request a female therapist to replace him if possible. I have had awkward/creepy experiences with male psychiatric professionals in the past, so I make it a firm priority that I only deal with women now. Surely there are a lot of wonderful male therapists out there, but I don't consider it worth the risk anymore, myself. I'm sorry this happened to you.",
            "HOLY CRAP YES SO INAPPROPRIATE.\n\nThis is not only stomping all over professional boundaries, it sounds very, very much like someone who is grooming you for sexual abuse. Get away from this guy and report him to the board that licenses him ASAP. \n\nIt's an unfortunate truth that a tiny minority of therapists use their access to vulnerable people about whom they know intimate details to behave in a predatory manner, and that's EXACTLY what this guy is doing. Your instincts are dead on. Run away.",
            "Wow. I'm a therapist & what he said was incredibly unethical. You didn't deserve that and I hope that didn't ruin your likelihood of seeking help elsewhere. \n\nPlease report him so he is less likely to harm someone else in the future. \n",
            "Oh he's one of THOSE therapists. The ones that think they understand everyone better than themselves and say whatever they please under the guise of 'I'm a professional therapist'.\n\nDon't pay this guy any more money and see someone else. In fact I'd personally report him.",
            "REPORT REPORT REPORT like today. I think he's testing boundaries for people he thinks he CAN take advantage of. Next time it might not be you but a teen girl who's not as savvy. ",
            "I am a student in mental health services. His behavior is **extremely** inappropriate. Please, please report him to your regional licensing board. If he is acting this way with you, he is doing it with other patients. He is taking advantage of his position of power and putting your mental health at risk. He suggested it is your fault you were raped!!! He suggested he would take advantage of you sexually! He is literally banking on the fact that you are too vulnerable to see this situation for what it is. He is using your insecurities to his advantage and rubbing it in your face. This is not a joke. Do not go back to see him and report him immediately. ",
            "Don't even go to another session if you have an appointment scheduled. Get rid of him but you must also report him. Be assertive, you can do this!!",
            "Not only should you stop seeing this therapist, you should report him to his professional association if you can.\n\nHe sees you as a victim and is responding to you as a victim in a dominating/controlling/predatory fashion.  The experience probably gives him a rush of pleasure.  He may be completely unaware that his behaviour is unhealthy and extremely unprofessional, but that's a mitigating circumstance that's also a bad thing in its own way.\n\nPlease, please report the incident to his professional association if that's something that can be done where you are.  At best, he is emotionally unstable, not aware of himself or in control of himself, and is likely to repeatedly betray the trust he has cultivated as a therapist with weird sexual overtures.  At worst, he is a sexual predator and a rapist.  No matter which it is, he has probably done this before, and he will certainly do it again.\n\n",
            "That's horribly unprofessional. I have multiple friends and family members in the mental health field. I would notify the state licensing board.",
            "As a therapist myself: yes, very inappropriate. Do you really feel comfortable continuing therapy with him?",
            "> Do I sack him off?\n\nI say this as a psychiatrist and therapist myself; please don't merely do that. File a report with his professional collegium or whatever institution is in charge of certifying him. \n\nI get a feeling though, that the kind of person who'd do such a thing isn't one of great training. I'm not certain of the legal hindrances in your country to practice without a title, but what are his credentials? Did you check them up before booking an appointment?",
            "I would actually be worried that he was planning a sexual assault for which he could blame you.\n\nPersonally I would not go back.\n\nI would probably report him to whatever board is relevant in your country.",
            "Yea what the fuck. This guy is a predator. ",
            "You didn't give him the \"right signals\"?? This man is clearly not fit to be a therapist. That is accusatory and damaging language. What he is saying is coercive. This is NOT ok. Stop seeing him and report what happened so other women do not have to go through the same. You do not deserve to be treated this way. A therapist's job is to help you be a strong, happy, and healthy person. That is not accomplished by knocking someone down and convincing them that they're vulnerable. ",
            "What state are you in, and what license does the therapist have, i.e. California LCSW, etc. ? Google those words and \"file a complaint\". You should find a link that allows you to submit this directly to a board that can take action. If you are hesitant to do this because you can shake this off, please remember that if he said this to you he's said this to other women, or he will. ",
            "Report him. Start the process of finding a new professional. If you don't know the proper channels, you can ask your new therapist to help you. \n\nI think it's very awesome that you're going to counselling to improve yourself and I hope you don't let this creep change that. Dump him and find someone capable of helping you. I went through something similar in the past and my biggest regret is how long it took me to find a new counsellor. I could have been getting help all that time! \n\nI'm sorry this happened to you. I can't post here without reiterating that getting raped was in no way your fault. Zero per cent!! ",
            "Psych student here. I can see so many practical and ethical breaches in this guy's behavior, it's just staggering. Cut contact with him immediately and warn others to stay away. Report him if you can.",
            "Report him! This is terrible and he is taking advantage by even saying these things. ",
            "> \"I can see how it happened, you didn't give him the right signals that you didn't want to have sex with him. By the way I'm in no way suggesting that it was your fault\"\n\n\"I'm not saying it was your fault... but it was your fault!\"\n\nWhat a creep. You are 100% not being oversensitive, your instincts about this guy are right on the money.",
            "That is not OK. Makes me completly question his qualifications, as several different tenants of psychiatry and psychology were broken in the attitude you described.",
            "Of course you're not overreacting. You are absolutely justified in feeling the way you do. Just joining in on the chorus, dear god is that so inappropriate, among many other bad things.",
            "Yes, your instincts are right. This is not appropriate behavior and I would not feel safe with him if he was saying stuff like that to me. I think you should report him, absolutely. He is likely to do this stuff to others who may in fact be vulnerable enough to go along with it. \nI also suggest looking for a new therapist you trust so you can talk about how to move past this incident - I think it is really a huge violation of trust for a therapist to act like this with a client. :( ",
            "Holy shit, yes, that's awful. you should feel absolutely no guilt in raining down whatever hell you can muster upon him",
            "HOLY CRAP! Stop seeing him, and report him to any and all appropriate boards.",
            "You should 100% see someone else. That is incredibly inappropriate. And what he said about \"not giving someone the right signals\" is BS. It was never your fault, and he is a piece of shit for even suggesting something like that. These are not qualities that you should have in a therapist. He shouldn't even be a therapist if he is saying these things to his clients. Don't go back for any more meetings, just cut it off right now and find someone else to see. ",
            "This guy should not be a therapist, what he is saying is not only wrong but really damaging also. You should definitely stop seeing him and report him. His job is to help you, not to make you feel creeped out and reinforce your insecurities. ",
            "Sounds like Dennis Reynolds and the implication.",
            "Yeah, I don't think you should trust him anymore. Like other's suggested I would report him (anonymously if that's your preference) and stop seeing him. The great thing about this situation, if there is any, is that you can put all his advice about being assertive to use to shut him out of your life.",
            "Report him to licensing board.",
            "He's creepy and manipulative. I think he was certainly testing the waters, but will claim that it was a hypothetical comment if you confront him on it. The victim blaming for your rape was repugnant. You should definitely find a new therapist and think about reporting him to the licensing board.",
            "Wow - very creepy and inappropriate indeed. \n\nDrop him and report him to the licensing agency in your state.\n\nHis statement(s) is/are completely off-base and entirely  disturbing.\n\nYou take care and I wish you well - never see him again, seriously.\n\n*Nana internet hug*",
            "Fuck this isn't just creepy. It's unethical and predatory. Please report the shit out of him to an ethics review board. Or record him on your phone the next time so you can have some evidence to nail him and then report him. ",
            "He sounds like a piece of shit. Abort and report. Sometimes for these types of counseling issues, you can request a female counselor if that makes you more comfortable. Also can request ethnicity if that's available at that clinic although you may want to switch providers if you don't want the possibility of seeing this douchebag around at your next visit with a different counselor. ",
            "Please, report this man!! He is not qualified for his job!!! Please go find a new therapist!!",
            "What the actual fuck.. this is so wrong.",
            "I'm currently a therapist, and this is definitely an ethics violation based on all of my training. Find a new therapist, and PLEASE report him to his licensing agency. If he's saying this sort of stuff to you, it's pretty likely that he is doing the same with others, which is, frankly, anti-therapy and potentially retraumatizing.",
            "He blamed you, the victim.   Find a new therapist, and if you have the strength report that conversation to his governing board. He needs retraining or a new career.  He *also* said really creepy things about how we *could* seduce you - that also needs to be reported to his board because wtf? you are not over reacting - that is ALL kinds of wtf!  ",
            "Report him to whatever licensing board there is where you are",
            "That's creepy. I wouldn't feel comfortable after this. ",
            "Get another therapist!",
            "Oh, hell no. He knew what he was doing. Drop his ass",
            "Report him to whoever you can and then never see him again. He must *never* practice again.",
            "\"We've recently been doing work on my lack of assertivness when calling someone out when they upset my feelings\"\nYou didnt call him out???\nI think you should call him on it and tell him how you feel and that you dont like it.\n\n\nIf you oversensitive or not you should make your own boundarys and this a great opportunity to start. If you switch therapists, you only get better at avoiding situations.\n\nSorry im on mobile.",
            "Ah, sorry for the misunderstanding, I didn't mean to suggest confrontation over reporting, but doing both. \n\nI do see where you are coming from though...maybe I'm being naive in thinking that he wouldn't follow through with his words once confronted. But I guess you could be right, swallowing one 's pride and apologising isn't for everyone. ",
            "Before leaving him to see another therapist, confront him about this behavior, even if just to show him, that you are much stronger than that douche bag assumes you are. What an unprofessional creep!",
            "get a new therapist? i don't see the issue. "
        ]
    },
    {
        "post_id": "asq6y7",
        "author": "Twinkeul",
        "title": "UPDATE: How do I (21m) tell my older brother (27m) that I’m addicted to drugs",
        "url": "https://www.reddit.com/r/relationships/comments/asq6y7/update_how_do_i_21m_tell_my_older_brother_27m/",
        "score": 2296,
        "num_comments": 188,
        "created_utc": 1550679503.0,
        "selftext": "[Original Post] (https://www.reddit.com/r/relationships/comments/a1n4rf/how_do_i_21m_tell_my_older_brother_27m_that_im/?st=JSDCPU1X&sh=6f94cd15)\n\nMy original post didn’t get a huge amount of attention but some people were asking for an update when I had one so here goes. \n\nLong story short, I guess I wasn’t hiding my addiction very well (shocker I know) and my brother straight up just asked me what I was on. We had an hour long frank conversation where he told me he thought I was an idiot for thinking I could keep this from him (and he agreed not to tell our parents) and I agreed to go to detox at the hospital (we live in Canada so, free). \n\nI don’t want to talk about what the detox was like as I’m sure people can imagine and others who have gone through it can explain it better than me, but yeah, it wasn’t fun. \n\nAnyways, this was two months ago. I have been clean since then and I am on a waiting list to see a therapist. \n\nI didn’t tell him about the money for sex, and he didn’t ask me how I was getting all the money. I have been having problems with the more sketchy people I had coming around bothering me after I cut contact with them, but honestly there isn’t really much I can do about it. \n\nPeople will probably call me an idiot for this and I know I am being an idiot, but I still haven’t gotten tested for anything yet, not HIV or anything. It’s not that I can’t, it’s that I’m scared to death. The men who I slept with for money, some of them were super sketchy and were sick with who knows what. But I didn’t care back then. \n\nEither way, I haven’t gone to get tested, even though I know I’m being stupid. \n\nJust thought I’d throw this update out there. \n\nTl;dr: Talked to my brother, did detox, still haven’t gotten STI checked. \n",
        "permalink": "/r/relationships/comments/asq6y7/update_how_do_i_21m_tell_my_older_brother_27m/",
        "comments": [
            "[deleted]",
            "Congrats on your sobriety! That's an amazing thing; something you have to work for the rest of your life at but worth the hard work.\n\nPlease please consider getting tested. I get why you'd be scared, but things like HIV aren't the death sentences they used to be - doctors can do so much now BUT ONLY IF ITS CAUGHT EARLY. Don't wait and let it get worse; chances are you aren't ill, but don't gamble on it... there is no upside! \n\nGood luck for the future :) ",
            "It gets easier... and even if you end up being HIV positive, it's not the death sentence it once was... you can and will have a full happy life so long as you stay clean. \n\nHere is the most important thing from my perspective: forgive yourself.  You can be a better person now than the person you were, and what happened in the past does not define you- your future, your potential is still unlimited. \n\nHold your head high, accept yourself as you are and strive to be more of the person you want to be. \n\nHold fast, and know you are loved.",
            "The thing about HIV and other STDs is that not knowing is worse than knowing. HIV has stopped being a death sentence years ago, but only as long as you seek medical help. ",
            "I'm not sure what province you're in, but I know Ontario has community programs specifically for the case management of people who use drugs and people who are at risk of contracting HIV. Every region in Ontario is mandated to have an \"AIDS Service Organization\", and these organizations usually have funded staff for a program called \"harm reduction outreach\".\n\nThese workers are not trained therapists, but part of their mandate is to help people (compassionately) to get testing and to build rapport with the drug using community. If you go to an AIDS Service Organization and simply ask to talk to someone about these issues, I'm sure you'll find an open ear.\n\nCongratulations on your work so far! Detox is rough.",
            "Congrats on getting clean! It’s hard, but it’s worth it. Waiting because you’re scared is understandable, but silly. You’re giving yourself anxiety and taking yourself over the coals, and a lot of things are treatable or easily manageable with early detection and medication. There’s also a lot of stuff that can really mess you up if you don’t take care of it. You’ve faced some big barriers so far, go ahead and get ready for this last one.",
            "Where are you in Canada? I'll go with you for your test.",
            "First of all, I'm *so glad* you got help and got clean.  That's something to really feel good about. Not everyone gets that far.   Not everyone *survives* their addiction.  You did.  So be proud of yourself.   \n\nSecond, if you need some moral support to go and get tested, then ask for it.  Tell your brother -- he wants to make sure you're OK, he's not trying to make you feel like an idiot.    If you don't want to, tell a friend. Or at least tell your primary care doctor.  Make yourself accountable to someone who will push you to go, and will support you whatever the results are.    You can do this.  ",
            "The drug addiction was a certain death sentence far worse than HIV nowadays. So, congratulations on getting clean! You should be proud of yourself and proud of our brother for being supportive. \n\nLook. If you were HIV positive, not getting tested doesn’t mean you are HIV negative. Instead you are living in complete stress and you could actually exacerbate your condition (if you are HIV positive). You would still be HIV positive. Just take sometime and truly think about that. \n\nOn the flip side, you could be HIV negative and be free of the shackles of your former life. \n\nGetting tested will only be to your benefit. Please get tested. \n\nDon’t potentially infect another person because you are too fearful to find out your status. This would be an unconscionable injustice to someone who isn’t aware of your past prior to sleeping with you in the future.",
            "I get that you are scared to get checked but you are only hurting yourself and you can literally ONLY make it worse by delaying. Also that shows some really problematic avoidance behavior that you need to address with your therapist when you get one.  I am sure that avoidance contributed to your addiction because you would use drugs to \"escape\" your problems rather than addressing them.  Stop hiding from your problems and start facing them, or you are going to end up relapsing I can all but guarantee that.  ",
            "Good for you!! I'm super proud of you. \n\nMy husband's friend (23m) came to stay with us for like five months when he was trying to get off pills and meth because none of his friends or sketchy people/enablers he hung around knew where we lived. I don't know how possible something like that is for you but it really helped him. He only did suboxone from the clinic when he stayed there and slowwwwly cut back until his coworker and him made a pact to quit together. \n\nGetting tested is so worth it, most std's are treatable, even HIV has a pill now. I'm sure you already know why you should so I'm just gonna sympathize with being stressed and scared. I was never a prostitute but I've had a lot of unprotected sex with them, not as a client they had quit years ago, and people who just slept around a lot (came back clean!). You've got this!! You're on the road to recovery, pamper your body like it needs you to and make sure you're healthy. Imo you should give yourself a break from everything else and focus on this ",
            "Congrats on getting clean! As for getting tested, just break it down into simple steps. Like tomorrow, make an appointment. First step. No big deal. Then, think of the next step as going to the appointment. No problem, you can go to an appointment. Third step, talk to the doctor. Not a big deal, that's what they're there for. Just think of it as one thing at a time.",
            "Amazing! I’m happy you got through detox and you’re clean. People and things will often test your commitment to staying that way. Just remember what kind of hell you went through to get clean in the first place anytime that happens. You got this! Oh and the sooner you get tested, the sooner you can close that chapter and enjoy your life again. ",
            "Congratulations on getting sober. I've lost a lot of friends to heroin addiction, so I know how hard it can be. Next step is getting tested. It's terrifying, but there is no positives to waiting. Please, take this next step in your health and get yourself tested. You've got this!",
            "Your brother knows — that must be a huge relief. \n\nNow go get tested. NOW. It will be a relief either way, knowing things early gives people the best chance of survival. Or you could just be genuinely relieved when you find out it’s nothing. \n\nGo. Get. Tested. No excuse for failing to do this. ",
            "Are you located in Toronto? If so, look for the Hassle Free clinic. They are amazing, and do on site HIV testing. Nothing to be afraid of; it's one day at a time. Plus you'll feel better about yourself and can get on the road to healing once you know the results. All the best! ",
            "Congrats on all the positive changes, seriously. I read your original post and that's a lot of difficult stuff. I'm really glad you're in a better place now.\n",
            "I am so fucking proud of you for going to treatment and getting clean!!! Congratulations!! I know you are scared to get tested, but you need to. If you do have something, putting the test off is only going to make it worse. ",
            "Detox is 100x harder than going to the doctors office and peeing into a cup.  You've already done the tough part of getting clean, now take charge of your health and get your Johnson checked out.",
            "See if your local Planned Parenthood can do a panel.  They will not judge you.  God forbid you test positive for HIV, there are organizations in Canada that can help you with the cost, PP can direct you to them if they themselves cannot.",
            "Honey, pushing off the tests won't change the results, but what it could do is end your life. Please don't wait. I know it's scary, but most things are curable, or close to it, and it's just fear holding you back. I promise you won't regret getting those tests, but I also promise that you will regret having put them off if it's too late to treat. And, you may be lucky and don't have anything, and that will be such a relief. Do not have any sexual partners until you're tested. I'm so proud of you for making it so far. Like, damn proud. Hugs. Keep up the good work.",
            "I dont know how moral/proper of a argument this is to make, but statisticaly you almost certainly dont have a serious sexualy transmited disease. So if you get tested you can probably finaly have a burden lifted from your sholders and leave all of this behind 100%, as opposed to having to abstinate from sex and worrying in the back of your mind.",
            "It’s great you reached out to your brother, that’s what us brothers are there for each other another and he would appreciate you came to him. Never be ashamed when it comes to family.\n\nI’ve witnessed losing a brother who tried to hide there drug habit and the ramifications across his friends and family were huge when he passed away.\n\nAlways talk up and don’t be ashamed.... \n\nIn regards to your health, it’s best to sort things out sooner rather than later and you will really kick yourself if it’s something you could’ve fixed earlier than later.\n\nPull the bandaid off mate and go get checked... do it for you and also your family. \n\nTake care,\n\nBest of everything for you and your future \n\nChris-",
            "Good for you dude. Everything will come in time. From someone who has battled alcohol and drug addictions continuously for a decade, I'm proud of you.",
            "Congratulations on getting clean--that's a huge accomplishment. If you're looking for a way to have someone to support you through getting tested (without telling why), tell your brother that you need to get tested based on your drug usage. I'm not sure if you did use needles, but either way, your brother probably won't press you for more information. And you're not being stupid--you're really not. We all do the same thing, even if it's ignoring bills or not going to the doctor. Set up a plan that will force you to commit (like telling your brother about your appointment) so that you'll be held accountable. Best of luck.",
            "Congrats man. So happy to hear that. I hope you find the courage and strength to get tested soon. It is literally one of the scariest things to have to go to the drs for but as I’m sure you know it is very important. But you will do it eventually I know you will. I hope that you come back clean. Good luck. ",
            "Proud of you. Now for the tough stuff: whether or not you have something, early detection is KEY. You deserve to give yourself the best chance at health. ",
            "You're still better off than you were a few months ago. Do the test when you're ready. Just be safe. It'll happen. Good on you for quitting.",
            "About avoiding getting tested.  All you are doing is preventing you from finding out.  If you're sick, you're already sick.  Being tested doesn't make you sick.  Being tested gives you a chance to get diagnosed and treated.  The alternative is wait and see which means you'd likely be in a worse state than you are now.  I totally relate and honestly I should take my own damn advice, because I get that you're just afraid of knowing.  If you have any reason to believe you actually might have something (and you definitely do), you should be more afraid of what you don't know.\n\n&#x200B;\n\nAlso, congratulations on the recovery.  Whatever you're afraid of, just remind yourself that you've done the hardest part.  You've gotten clean. You got this. Even if you do have something, modern medicine is such that rarely is an STI contraction unable to be managed.",
            "Hugs, so happy to read this! Hugs to you!",
            "Good job. It's scary coming to your family but they can detect the changes before you do and were probably waiting on you to come to them, it's obvious that they love you. \n\nThe best thing moving forward is to get tested and make sure you cut ties with the sketchy people that fed your addiction. Those will be the very people that try to drag you back. If you can make it for 2 months, you can make it for 6 months clean. Next thing you know it's a year, two years, and then it becomes a lifestyle thing. Most important to get away from the negative triggers that brought you to your addiction and to find constructive ways to improve yourself daily. I believe you can do it. ",
            "You should talk to your brother, you don't need to tell him everything, just that you need to get tested, sounds like you need support, and he's there for you. He supported you through the worst, he will continue to do so if you let him. best of luck dude. ",
            "Hey! You did fucking great!!! \n\nAnd those guys who looked sick? They looked sick because they weren’t getting treated. They aren’t you. \n\nWhen you are ready to get tested, you will. You already faced something much more difficult. It’s just one more little mess to clean up. I think all of us want you to get tested now so you can get busy being the healthiest you can be. \n\nPlease know that it’s okay if you haven’t cleared that hurdle yet. I’m very sure you will. Because you’ve already shown that you are the kind of person who can handle facing the consequences of their actions. Now, do yourself a favor and face the testing sooner rather than later.\n\nCon-fucking-gratulations. You should be damn proud.",
            "I completely understand the fear of getting bad news about your health. What I've come to learn, however, is that it's better to know and address a potential health problem than it is to spend months or years worrying you might have one. It's entirely possible you were lucky enough not to contract an STI. Wouldn't it be nice to alleviate your anxiety by finding out for sure? Even HIV isn't a death sentence at this point--as long as you actually manage it.\n\nYou gain nothing by remaining ignorant about your health. And taking control of the issue will work wonders for your anxiety.",
            "If there is a need for medication, I’m not sure what province you’re in (I’m in Ontario) and I got tests done at a public health clinic (came back clean) but during the blood test the nurse explained that they offer medications for STI’s at a reduced cost and some meds were even free! Lots of people get testing done regularly so there barely any stigma attached to it at the clinics. I hope this helps, take care!",
            "Congrats on being clean from the drugs! 2 months is not nothing, and soon it'll be 20, or 200 months!\n\nIf you're scared about a positive HIV test, don't be. It's not a death sentence, and there's less stigma attached to it now. Before you get too freaked out, let me ask you some basic health questions, which you don't have to answer publicly. I've been studying infection and disease, so I know some details about it.\n\nSince you started the sex for money, have there been any times when you caught a really bad flu-like illness, but without vomit or high fever? I'm talking like a 2-week long stint of feeling achy, poorly, tired all the time, headaches, maybe mild fever, that just cleared on its own? This would likely not involve cold-like symptoms, so no congestion, runny nose, coughing, phlegm, or anything like that. \n\nIf no, then there's a very good chance you're completely HIV free, as that's the main signal of a new HIV infection. If you did have such a time, then it's still not 100% a diagnosis, but you definitely should get checked ASAP. The sooner you get checked, the sooner the infection can be kept under control and the likelihood of you experiencing NO side effects or illness symptoms increases!\n\nIt's not even like 20 years ago when you had to take 35 pills a day, religiously at the same time. You still have to take medication at the same time every day without fail, but the Highly Active Anti-Retroviral Therapy (HAART), I've been told, is down to a single pill once a day.\n\nIf it turns out you do have HIV, that's way different than AIDS. AIDS is the 'acquired immunodeficiency syndrome' that comes from the virus nuking all your CD4 T cells. Those dudes help regulate the response of the rest of your immune system, so if you don't have those, then you tend to catch a lot of other illnesses. Not all HIV patients progress to AIDS, but they are all considered immunocompromised, so folks around you need to make sure they don't come by if they have a nasty illness, or haven't been vaccinated.\n\nAs far as potential partners goes, don't worry about it. You can be HIV positive and still have romantic relationships. You are not broken, or destroyed, and you are still worthy of being loved. Any potential partner would need to know the truth, but there is also medication that they can take to prevent HIV from being able to infect them were they to be exposed. HAART can keep the viral load in your blood so low as to be undetectable and likely not transmittable. HIV cannot be transferred through your skin, saliva, or sweat - only blood and semen. So, if you did have HIV, your partner would take the preventative drug, and you'd have to wear condoms, and be careful about minor cuts and scrapes.\n\nThat's about as big an effect this can have on you, but only if you get tested ASAP. Like I said, most everything else can be cured or treated, so it's not the end of your life, or the end of the world. Please get some support from your brother and make a doctor's appointment for some blood tests :) It'll be okay, I promise.",
            "Hey. Idk if this will get buried, but I hope you see it. I am the older brother in this situation but reverse. I was addicted to coke, X and other stuff.  I had to tell my parents I needed help, and my brother. 3 years later I am clean. Stick with the program, I am on the NA track. Just keep you head high and try and take it slow.\n\nFor me I asked only for gift cards to like grocery stores for a year. To avoid buying stuff with cash. It helped me, maybe you too.\n\nYou’re not alone. PM me if you want to talk.",
            "Hey man congrats on getting clean! I just want to make sure that you know recovery is a lifelong process. Yes, it gets easier with time but it is something you will have to deal with for the rest of your life. I am a person in long term recovery myself as well, and what I have seen with people who stay sober vs the ones who relapse is that they stay active in recovery. Go to meetings, do service work, get a sponsor, go to therapy (I see you are working on this, good!), etc. Do not become complacent!",
            "The nice thing about knowing your status and getting tested is it sets you up to have an open and honest relationship with sexual partners in the future. You want to get laid, right? Of course you do! Let those future organisms from safe and consenting partners carry you through the fear and anxiety if not knowing. :)",
            "I'm so happy to hear you have managed to detox  in a healthy manner.  I'm currently working on my LCDC (Licensed Chemical Dependency Counselor) and am interning at a methadone clinic. I just wanted to share the same bit of advice given to everyone who comes in. Be sure to set up a support system, and remember that recovery is ongoing.  Keep working towards your recovery!!",
            "Congrats on getting clean.  It’s one of the hardest (and best) things you can do in life. I’m going through this with an old best friend. She didn’t think I knew but I knew. Anywho, I hope you keep on this path. As far as getting checked, it’s better to go sooner than later. If you go now, they maybe able to help you get better. If you wait till later, it may not be able to be cured. Please take care of yourself! After all that, you deserve to be happy and carefree. Best of luck! ❤️",
            "Good job getting to where you are now.  \nBut you need to close that chapter of your life by getting tested.  \nYour mind will never be free of the concern, and as the concern grows, you’ll only want to push it further away in your mind.  \nAnd the sooner these things are caught, the better!  \nIt’s time to say “fuck it”, perhaps taking a friend with you, to go get tested. Put your mind at ease!  \nIf you have something, well that’s just how it is and you get treatment for it sooner rather than later, which can prevent much worse complications if you wait.  If you don’t have anything, you get to move forward with a new chapter in your life.  \nEither way, good luck to you and God bless. ",
            "I'm glad you made the decision to stop using drugs I hope you get psychological help. Please be strong , i cant imagine how hard it must be and you are probably scared but please get checked to see if you are okay. The earlier the better . I hope there's nothing wrong with you :/. I'm sending you positive thoughts. ",
            "This is kind of random but have you ever read the book Go Ask Alice? When I was using opioids back in the day I enjoyed that book to let me know I wasn’t alone. It’s more about LSD but same concept. All the best ",
            "Congratulations on getting clean.\n\nI know it seems scary to go find out if you contracted something, but you really need to. Not going to get checked out health wise is not a healthy decision.\n\nNeglecting your health when you know you've done some risky shit is avoiding a big issue, almost like using drugs is usually to avoid/escape big issues(whether you're knowing of the issue or not)\n\nI hope you muster the courage to continue your journey to health. Good luck, I hope you're okay.",
            "I avoid things when I'm really struggling (I have mental illnesses) so I understand. Do you have any friends who could go with you or even a dog you could take in your car (that helps me a bit, just keep it warm).\n\nIf you don't have someone to take with you I'd be happy to message you or hop in a discord or something. No matter how the tests come out you'll feel so much better when they're done. Fear of the unknown is often worse than reality.\n\nI'm glad your sober now, I hope good things come your way.",
            "Congratulations on getting clean, that's a big fucking deal. \n\n\nThere is no point worrying about the test unless you plan on sexual activity (not a great idea in early recovery). \n\nFuture you will have the test when you can deal with it and they will be able to deal with what ever comes up. \n\nYour job today is to stay clean. \n\nThat's it. If you get a sober and clean head on a pillow tonight you're winning. \n\n\nThere are consequences to life as an addict but they are way more manageable living clean. \n\nFeel free to join us in r/addiction or r/redditorsinrecovery - you are not alone. ",
            "Speaking from a medical perspective. If in the worst case scenario you did have something, the earlier they find it the better. Sweetheart go get tested. Trust me. Waiting only hurts. I know im a stranger online. But good for you, i am proud of you. And you should be proud of yourself. \n\nRecovery is a long process and will test you. You’ve made it through the hardest part. So you can face whatever comes next. Get yourself tested, and enjoy life from now on ❤️",
            "First I'm happy to hear that you are clean and doing better but you need to get yourself tested, I understand how scary it is. I found out that I was HIV positive when I was 20, and it felt like my world came crashing down. I was scared and went into denial. I refused to get the confirmation test done or see a doctor about it for weeks. It took my mother dragging me to the doctors to get back on my feet.\n\nSince then my life hasn't really changed, I take Odefsy, which is a single pill, everyday and every 6 months I have a blood draw to make sure that my HIV is under control. I have a loving boyfriend, who is negative, of 4 years and an amazing job that I love. My life didn't end because of my diagnosis, it just became one more piece of who I am.\n\nI am not as familiar with Canadian medical system, but I am assuming that there will be a few similar programs to those in the USA. There are a ton of medical assistance programs to get the medication. If I loose my job I pretty much get the medication for free. It is considered a critical and non optional medication so all forms of insurance cover it.\n\nPM me if you have any questions or need help. I'm glad you are clean but you need to take care of yourself.",
            "You arent stupid. You are understandably scared. But the sooner you find out if you are sick and with what, the less damage it can do to your body. Please dont let your fear keep you from doing what is best for your health right now. Congratulations on getting clean. Dont forget how much strength and courage it took you to get to this point, and dont give up. Sending you love 💕",
            "well done friend!  I'm coming up on a year, and I still remembering the tears I shed when I told my brother",
            "congratulations!! this is a dumb response to an equally dumb fear but you can def get tested for certain things at a time!! like, things you can solve with a round of antibiotics and with time/therapy you can work up the courage to get tested for the scarier ones! i don’t have a penis so i can’t confirm this for you but when i get tested i always get a few different swabs/blood analyses and I can pick and chose what i want them to test for",
            "HIV medication has gotten so good that you can become Undetectable. Meaning that there's so little in your body that their readings, which are very good, can't detect the virus which in tern means you're perfectly healthy.\n\nNow of course you'd have to disclose this information with sexual partners but seriously. I know its so rough to be in your position but there's not just the HIV you have to worry about, there's other diseases which are more serious that could hurt you and you'd be doing a disservice to yourself not to get treated if you have anything. \n\nMy girlfriend had Chlamydia right before we dated but you take 1 pill and within 9 days its gone. So please go out and take care of yourself.\n\nMuch love",
            "If you are scared of getting tested think it less and do it, say to yourself \"making sure that I'm safe and healthy makes me a better person\" and do it thinking of that, is part of getting better, be Stern and mean to yourself in a way that can actually help you. If there is something that I learn due to poor life decisions is that making one that's good actually helps a lot.",
            "Go to AA - it saved my life",
            "Good job! Nothing’s better than the love of a brother. Please get tested if not for yourself then for your brother he doesn’t want to loose you. I",
            "Being scared to death of getting tested is normal. You can get a take home HIV test for around $50 I think if that is something that would make you more comfortable than a doctor’s office. Chances are you don’t have anything. HIV is incredibly difficult to contract, even if having unprotected sex with someone infected it is more probable that you won’t contract it than will. Hope that helps ease your anxiety. \n\nAccording to the CDC you have around a 1.14% chance of having contracted HIV during any individual  unprotected sexual encounter (anal, receptive) with an HIV positive person. Rest easy knowing the numbers are on your side. people here are talking like it’s very likely you might have it, when the truth is it’s not likely at all. Oh and any other kind of method of possible transmission (like needles or oral sex, etc) is a lower risk than 1.14%. ",
            "I am so proud of you for being 2 months clean! My brother struggles with addiction and everyday that you are sober, is one more day that you can check off! You are on the right path! \n\nYou already know this, but at some point you will want to get tested. And always make sure you have a good support team :) ",
            "Hey my dude, I got clean when I was your age.\n\nIt's been over 15 years now. I've got a beautiful wife who loves me to pieces. I really attribute my time in recovery as being able to express myself more openly in an emotional way. It put me in touch with my feelings and it gave me a really good sense of self. I understood myself in a way not many people do in their lifetimes because I had to introspect. \n\nIt's a long rough progress and its okay if you relapse and have stumbles along the way. Just keep trying. \n\nLife is beautiful on this side. We have a 10 year old together. I have a great career. There's a wonderful life for you on this side you just have to go out and grab it.",
            "Congrats on sobriety!!\nSmart people can make poor decisions as well so don’t get too down about it.\nA lot of people have addictions they just happen to be addicted to something less dangerous (depending on the definition you have as gambling addiction can and does ruin people’s lives)\n\nI- for example have to stay away from games with microtransactions and claw machines. It sounds ridiculous but I can very easily spend WAY too much money very fast with little to no reward as most of the “items” I was getting were virtual and any items I got with claw machines I could probably just by myself.\n\nYours was a more life threatening addiction but you aren’t the only one that has ever been addicted to dangerous substances. Innocent people can be hooked because of chronic illness or pain and going to harder materials. \n\nIts going to be very hard and you may relapse- but just know that its ok and addiction is hard to break and handle. You’re doing great!",
            "Congratulations on getting clean. Both of my brothers are still struggling with addiction and I hope one day they can find the courage to get clean as well. I wish you all the best. ☺️☺️",
            "I spent over a year scared to death I had HIV, only reason was my ex and I hooked up after fucking a heroin addict. That entire year I convinced myself I was going to do. It was stupid and fucking terrifying. When I finally got the balls to get tested, came back clean, I think it was one of the happiest moments of my life lol. Just get the test. Either way it’s a huge weight off your chest. ",
            "Yo, get checked. From experience, you would rather know, than not know.",
            "Firstly, I'm proud of you! I have heard how horrible detox is and I'm pleased to hear that you stuck with it and made it out. \n\nAlso, the amount of anxiety you may feel regarding STDs will greatly reduce after you take the test. Right now it may seem and feel insurmountable but the reality is, taking the initiative is the biggest hurdle. From there it is all about acceptance. If you have an STD, you KNOW, you accept, you deal with it. The idea of how terrible it *could* be and not knowing the unknown amplifies stress and anxiety. \n\nI'm glad you are taking the steps necessary for a successful recovery. A lot of people take short cuts and avoid therapy, which compromises sobriety. Although you have a long road in front of you, you will get through it. Find a reliable support system, download a sobriety tracker app and widget it to your home screen to always remind you of how far you have come, leave sticky notes around your home, keep a journal, etc. I truly wish you the very best! ",
            "> People will probably call me an idiot for this and I know I am being an idiot, but I still haven’t gotten tested for anything yet, not HIV or anything \n\nWell, since you're expecting it: you're an idiot.\n\nLook, *if* you have something, the sooner you find out, the better your treatment options are. The longer you wait, the worse things can get. \n\nCall your brother. He doesn't need the details, but tell him you messed around with a stranger while you were in your addiction and ask him if he can be there with you while you go get tested. Or to at least give you the kick in the ass you need to go get tested.\n\nYou've *already* made one insanely bad choice that will negatively impact you for the *entire rest of your life*. Don't risk making another.\n\nOn top of that, what if lightning strikes a week from now and you meet up with someone you're hitting it off really well with? And you've still let yourself put off what you need to go do? You really want to risk being responsible for passing something horrendous along to others in the future? ",
            "I hope you know that a lot of us here are feeling proud of you for making the tough decision you did and going through the agony of detox. \n\nThat does sound like a very scary thing, and you should definitely get tested. But I also hope you can take a lot of comfort in knowing that HIV treatments have come so far that they can actually suppress the viral load in your system with medications so much that for many people, it's not even detectable in your blood anymore. That's a tremendous medical breakthrough and gives HIV positive people a lot of hope and health. Even if you are positive for something, people won't automatically assume it's sexually-transmitted, or even if they do that it's for that reason.\n\nLots of other STDs and blood borne diseases have treatments and cures available for them too. The sooner you diagnose them, the easier they are to address! It's easy to let it go, but you don't want to wait and be guessing every time you feel a symptom if maybe that's what's happening. If you ever need people to talk to, you can always come back here (feel free to PM too!). If you have a friend you van trust, maybe they can go with you for the testing to be your support, knowing they will stick with you no matter what.",
            "Dude I'm really proud of you. Keep up the good work, you're on the right track. But damn get tested ASAP, better just rip that bandaid off fast",
            "One step at a time friend! Glad you’re two months sober.\n\nThe getting tested is important but it’ll be ok! You’re jumping through hurdles and this is just another, you’ll feel a lot better once you go to the doctor and get yourself checked out. \n\nYou’re doing good :)",
            "Universal Health Care: Free Detox- YAY!  2 Mo± wait for therapist- YAY!",
            "Please don’t just wait for a therapist. Get your butt to a 12 step meeting and work the steps with a sponsor you trust. And that can even be a woman btw, I’m a female who has sponsored a gay man because he had had a bad experience with a male sponsor and felt more comfortable with me. I’m in recovery from opioids and if you just detox and think that’s enough it won’t be. Look into post acute withdrawal syndrome and work a recovery program please, I want to see you beat this. Look into young peoples meetings in your area.",
            "I'm happy for you OP, getting clean is never easy, I hope it only gets better for you.",
            "Get insurance now before you get tested - some companies won’t cover “preexisting conditions”.\n\nThen please go get tested. \n\nThe earlier you know, the sooner you can start to deal with it. You’ll always have that fear - it won’t go away until you know for sure.\n\n(I’m Canada. I looked into one company and they wouldn’t cover my anxiety medications.)",
            "Get tested and report back. We're here for you.",
            "First of all, congrats on getting clean. As a former iv heroin user who's struggled with sobriety for a few years now, I know how hard it is to take that first step. The hardest part though, is **staying** clean. Do whatever works for you to do that. Meetings. Get a sponsor. Do the work. Its *worth it*. As for getting tested. I know what you're struggling with. Its fucking scary. I made some really stupid choices when I was using. Sharing needles, sex for money. It was bad. I was terrified of getting tested. But the truth is..if you have something..getting tested wont change that. But what it **will** do is give you a chance to fight it and stay alive. HIV and hep c are no joke but medicine has come a long long way in the last 10 years. Hell, Hep C is curable now. I know several people from my NA goups that are living normal lives with HIV. Its 100% not a death sentence anymore. It may feel that way but its not. And you're not alone. From one former addict to another, I believe in you man. You beat the grip opiates had on you and you got clean. Now you can beat this fear too. Take the first step and get tested. Then just take it one day at a time. Knowing your status is scary...not knowing is scarier. You got this. If you ever need to talk my inbox is open. Keep fighting <3",
            "Congrats! \n\nMost STI's are very treatable, but some could cause long term damage or lead to more devastating diseases if untreated. Even the untreatable ones can be managed. You can't change the past now, but you can do your future self a favor. \n\nPS I'm also from Canada. ",
            "Yeah, everyone thinks they are hiding their addiction, when really everyone else just has no idea how to say anything to you.",
            "The longer you wait to get tested the more scared you will get.  Rip that ban-aid off.  HIV is not a death sentence if you end up having that.  You can have a long full life.  \n\nGet tested today or tomorrow.  Just do it.",
            "Just think - if you get tested and you're NOT positive, you dodged a bullet. And that apprehension you have of not knowing? It's gone! You're HIV negative!",
            "I have immense respect for anyone who's detoxed off opiates essentially cold turkey. For people who haven't been through opiate withdrawal, it is impossible to explain how bad it is. Like the flu times 1,000.  Most addicts get to a point where it isn't even about getting high anymore, it's about not getting sick and you'll do things you never thought you would to avoid going into withdrawal. It's that bad. \nMost people don't make it through the first day much less a couple wks. It isn't like it's over in a couple days. It is at least a week of absolute physical and mental torture.  I applaud you, OP for having the strength and resolve to get through it.  \n\n\nTake it one step at a time. If you're not ready for the stress of STD testing then wait until you feel more stable but obv don't be having sex with anyone until you know.  You're still in a fragile state only 2 months out so no need to trigger yourself. Wait until you're ready. ",
            "So happy to hear your progress. Also re: getting tested--YOU CAN DO IT! We're all rooting for ya bud :)",
            "If you haven’t already do something special for your brother. He sounds like a good human being. And congrats on getting clean. ",
            "Your family may not always understand you, but they'll always want what's best for you.  If you did something that was harmful to your life and they didn't get mad it would mean they didn't care about you. \n\nAmazing job already at taking the necessary steps to improve the situation.  Remember your life isn't over when your family finds out about your problems.  Your life is over once the problems are too big to handle.  Every problem can be solved while its still small, I'm happy you solved it with your brother while it was.",
            "Good for you for telling him and for going to detox. Is there an Al-Anon group you can start attending? It’s an outstanding and as soon as you get a sponsor you have 24/7 support.\n\nAnd by the way, even though denial is a hallmark characteristic of addiction, it’s a pretty poor choice when you’re facing a potentially serious health issue. Please get tested as soon as possible.",
            "[deleted]",
            "A waiting list to see a therapist?  But.....\n"
        ]
    },
    {
        "post_id": "70osl2",
        "author": "helpmeout15555",
        "title": "My [17M] sister [21F] has been missing for 6 months, I feel lots of rage",
        "url": "https://www.reddit.com/r/relationships/comments/70osl2/my_17m_sister_21f_has_been_missing_for_6_months_i/",
        "score": 2291,
        "num_comments": 125,
        "created_utc": 1505668569.0,
        "selftext": "My big brother told me to write it here. He's helping me write this. Sorry if it is a bit all over the place.\n\n\nMy sister, Laura, has always been a very sweet girl. She was always respectfull and kind, intelligent, pretty. She was great to me while growing up, and she loved kids.\n\n\nLaura is adopted. We all are. Her biological parents died. Our adoptive parents are not bad people but they are very...weird. For example they do not say 'your T-shirt is ugly', they say 'you are ugly'.\n\n\nLaura was studying at University. Had good grades. 2 years ago she got a boyfriend: Jens. He was an asshole. He cheated on her, told her how he wanted to beat her, was mad cause she did not cheat on him etc. He went out with other girls etc. After4 months he broke up with her.\n\n\nLaura had never been the Same. She told us about how Jens would date all his ex's for at least a year. Even the ones he did not love. Laura felt like a loser. To top things of, she had been bullied by the girl he cheated on her with. She was threatening her etc.\n\n\n6 months ago, Laura told out mother that she did not want to return to the city she studied at. We had seen it coming,for 2 weeks she only slept, did not eat. Our mother told her 'To think long and hard' and How she was going to be a 'loser working at a supermarket'. They got into a huge fight and Laura went to bed. \n\n\nThe next morning she was gone. She took a train and further we do not know. She posted on Instagram 'Goodbye'. Police came and our mother was not able to answer a single question: her friends, hobby's, what she liked, the subject of her bachelorpaper,... Our mother could not answer a thing.\n\n\nIt's been 6 months. Police found her. But she told them she wishes to be left in peace. As an adult, they have to respect that.\n\n\nI miss my sister. I am also mad. At her. But especially at my mom, and Jens. For being so mean and hurting her, while in fact she was so sweet. I don't get why she ran away. How she could do that.\n\n\nI feel a lot of anger towards people. I would like to know how I could handle this? And if any of you know or could explain why people run away? Thank you\n\n\nTl;dr: My sister ran away,  I am very mad at people like my mom and her ex-bf for doing this. How do I handle these feelings?",
        "permalink": "/r/relationships/comments/70osl2/my_17m_sister_21f_has_been_missing_for_6_months_i/",
        "comments": [
            "A lot of times people run away because they are being emotionally abused and they don't think the situation can change. They want to put distance between themselves and the abuser so they can heal. \n\nAnd make no mistake, calling someone ugly or telling them they're going to be a loser is very mean. The fact that your mother couldn't answer a single question about Laura is very telling. \n\nHow does your mother treat you?",
            "At 21, your sister is not a runaway. She moved out to be independent. If she wants to work at a supermarket and live on her own that's her choice. It stinks that you are caught in the middle of that choice, but your sister had a right to her own life. Even if that life does not involve your parents. It sounds like she was escaping a toxic situation. \n\nHave you or your brother tried to reach out independently? If you do manage you get her contact info, definitely do not use that time to convince her to come home or tell your parents about her life. ",
            "Laura left for the sake of her own mental health. That is why people go no-contact in these situations.\n\nI understand your frustration and your pain, but she didn't do this to hurt anyone. She did it to save herself.\n\nThe way you describe your parents is very concerning, but because you were raised by them, you might not see it. There's also the possibility that Laura was being treated worse than you realized.\n\n>For example they do not say 'your T-shirt is ugly', they say 'you are ugly'.\n\nThis is flat-out mean. It's not *weird.* Good parents don't say that kind of stuff to their own kids.\n\nYou're still a minor, so it would be difficult for Laura to maintain a relationship with you while continuing to avoid your parents. Once you're an adult, and you've moved out, there may be a chance to get back in contact with her again, provided you respect any boundaries she makes.",
            ">I don't get why she ran away. How could she do that.\n\nYour mom's only involvement in her life was the time spent insulting her. It sounds to me like Laura made a healthy decision to separate herself from the negative presence your mom had in her life. ",
            "Laura did the right thing. She left her abusers (Jens, mom) because there's no way she could be happy in their vicinity. \n\nDon't be mad at Laura, direct your anger to the correct people - Mom for being verbally abusive over the years, Jens for abusing her. ",
            "I am sorry, but your parents are not good parents based on what you wrote and commented. Even just what you described is enough of an explanation for why she ran away. Imagine being in her place where the person supposed to take care of you and love you calls you worthless? However she treats you, she is not a good mom and she has driven your sister away. I'm truly sorry but I think this is the truth and you should try to forgive your sister. If you want to be in her life after you no longer live with your mother, you will probably have to apologize for not standing up for her and be willing to respect her not wanting to see your mother. She may be upset with you and your brother for standing by and letting her be mistreated as well. This isn't your fault, but advise if you want to get back in touch with her and for you to think about how your parents really are. Do not blame yourself as You had no point of reference to know. \n\nEdit: some words",
            "+1 for talk therapy/counselling. It's totally understandable that you have a lot of anger around this. But if I were her, I would've probably run away too. Your mom and Jens are the people who deserve that anger.\n\nRegardless, especially with Jens, the anger is really never going to be productive and is only hurting *you*. Therapy to deal with it is the best thing you can do for yourself.",
            "I think you need to seek professional help. \n\nThere are charities out there that support the families of missing people. They must have had cases like this, where the person is found but wishes to remain uncontacted, before and may be able to point you in the direction of resources you can use, or of support groups that can help you. \n\nThis is an awful lot for you to cope with on your own and it sounds like outside help would be a good start. ",
            "\"You are ugly\" \"loser working in a supermarket\" maybe this has something to do with it, if you were in that situation you would have left too.",
            "Your mom is the real problem. She's abusive so who can really blame your sister for leaving? Perhaps one day she will come back around. It's her life, her choice. Sorry she hasn't given you closure but some times we don't get that. ",
            "My guess is that your sister is not out of your life permanently.\n\nWhile you are 17 - that is, under the age of 18 - she cannot contact you without getting your guardians involved.  That is because you are a minor.  She has wanted to be free of contact with them and it sounds like she has good reason for that.\n\nAlthough she has shut off her instagram etc, there are probably still ways of getting in touch with her.  When you turn 18 you should try.\n\nYou should understand that what is probably most important to her is that you not bring your guardians back into her life.  Until you can promise that you will not do that, she probably will not want anything to do with you.",
            "I agree with the others. You should try to contact her once you move out of the house. Me and my brother lost contact when I moved away from my mom (because of similar abuse), but now we talk pretty frequently now that he moved out, too :)",
            "This is a really tough situation. However, from an outside perspective, it seems that your family is much more dysfunctional than you think. When you've grown up in a dysfunctional family, things become normalized.\n\nYou can't link on this sub, but look up \"dysfunctional family presentation\" and click on the one from SlideShare from Lucia Moreno. Do you identify with anything on that list?",
            "When my sister went to university, she essentially went no contact with my mother since, this was decades ago. For a long time, she didn't contact me even though I missed her, from the age of 12yo-23(or 4) I had talked to my sister maybe 3 times very briefly with the last time essentially saying \"Hey, contact me when you're an independent adult\"\n\nShe kept far from me, because as a teenager I was a conduit to my Mother, when I become an adult I was able to see that what my sister did was smart, and we've had a great relationship without my mother being a part of it for the last few years.\n",
            "\"Our adoptive parents are not bad people but they are very...weird. For example they do not say 'your T-shirt is ugly', they say 'you are ugly'.\"\n\nHon, that isn't 'weird'. That's 'cruel'. It verges on 'emotionally abusive'. If that sort of interaction was common-place in your home, then your parents ARE emotionally abusive.\n\nThat is likely the reason your sister got with Jens in the first place; thanks to how your parents raised you, she is used to equating bad treatment with love. Your parents have literally raised her to believe that if someone is mean to you, it is a sign they love you.\n\nThat isn't normal - it's also very Not Ok.\n\nIn many ways, it sounds like Jens treatment of your sister did her a favour, because it was drastic enough that it broke her 'programming', and made her realise that being treated like that is NOT ok, and you DON'T have to accept it. She came home seeking comfort and support, and your mother literally threw it in her face. No wonder she left.\n\nI appreciate your anger, but towards her, it's misplaced. Don't be mad, be proud. She's broken out. She's taking actual concrete steps to get healthier and be loved, even if it's just by herself. She knew that there was no way for her to get or be treated better while she remained in contact with your family, and she took measures to change it, hard measures. She's forging the path that, if you're lucky, maybe you can take one day as well.\n\nIn the meantime, seek support from other people where you can - friends, or your school counsellor. Recognise that your mom isn't treating you well and try to factor that in when she speaks to you. And recognise that Jens may be an awful person, but something really really good came out of his relationship with your sister; her freedom.",
            "I'm a sister who ran away at a similar age from a (sort of) similar situation. I lost sleep at night worrying about my younger siblings. I missed them all the time and wanted to keep them in my life but I couldn't do that while getting the space I needed from my parents.\n\nIt's okay that you're angry. It's okay that my siblings were angry. She's doing what she needs to do right now and hopefully she will reach out to you when she's ready--and once you move out and start your own life that will be easier for her. Take care of yourself and know that she cares about you.",
            "Emotionally abusive mother, abusive boyfriend - no wonder she took off to find a better place. Try to understand her decision. I hope she's getting help to work through it, you should too. And there's nothing stopping you from contacting her, you weren't part of the problem. Her leaving wasn't about you. Don't take it as a rejection. Or abandonment. It isn't. ",
            "Your parents sound like serious pieces of shit. I suggest you run away as soon as you turn 18. Maybe you can have a relationship with your sister at that point. For now, you represent the life she left behind and she's better off without you. Sorry. ",
            "I don't know that I have anything to add other than what has already been said, but I'd like to reiterate the good things here. I'm glad your brother is here to help you, I'm glad you are open to talking about this and working through it, and I'm glad you have love for your sister. Hopefully you'll be able to find her, independent of your mother, soon. You sound like such a kind and strong soul. I'm thinking of you and sending you lots of love.",
            "Did you use their real names? Sounds very danish. ",
            "Your sister sounds like me. I cut off contact with my entire family because my dad was abusive (physically and emotionally). The sad thing was I had to leave my brother and other relatives in the process, because if I didn't, they would end up keeping me in closer contact with my dad. My brother also was not ready to leave my dad (not his fault), and I could not stay in that abusive environment anymore. I still want to talk to my brother, but can't because I don't know how close he is to my dad, or how understanding he would be of the abuse I feel that I experienced.\n\nI know you must be angry at her, but know that she must be hurting too. She is doing this because the alternative of staying at home is worse.\n\nThe best thing for you to think of is how to take care of yourself. I am so glad you have a brother to talk to about this. Keep talking to him if you both are on the same page. Reach out to your sister once she's had some time to herself.",
            "Your sister is 21 and an adult, she is well within her rights to live where she is happy. \n\nIf you miss her, then you can reach out to her after a while and start to develop a relationship with her WITHOUT your mom or anyone from her old life. \n\nThis is very important for her. If you are going to be in her life, it has to be just you and her and it has to be positive. You can't talk about your mom or her old life. You have to allow her to move and be happy. \n\nYou will be an adult soon and you can have a long and good relationship with her if you do it correctly by letting her live where she wants to live and be positive around her. \n\n\nGood luck.",
            "Im sorry man but it sounds like your mother is an abusive person. Tell me, if your mother treated YOU the way she treats your sister, would you want to stay living there? \n\nMy parents don't abuse me (anymore) but they sure did fuck my life up and my only way to heal and be successful is to move out. The thing is I was forcibly moved 500 miles away from EVERYTHING into a shit town with NO work so I'm wracking my brain and I cry a lot because nothing is going my way. \n\nThink about it this way, your sister is adopted right? Her parents DIED and out of all the foster parents in the world she got hooked up with your folks, who know NOTHING about her life after 21 years, and insult her to her own face and to you, her younger, more impressionable brother, WHEN SHE'S VULNERABLE AFTER AN ABUSIVE RELATIONSHIP. \n\nShe is definitely in a better place.\n\nThere's another reddit sub called r/raisedbynarcissists that I think you should read through. Don't post there though unless you think your mother is going to start abusing you. ",
            "Wait a minute. If mom is living off a disability pension, who is she to be slagging off supermarket workers?",
            "A little late to the show but...\nWhen my brother was 18 he left everything behind, blocked anyone related to him on social media, and basically, just vanished. This was in 2008. We still have no idea why.\n\nMy family believes that this is just a phase in my brother's life, and that he will eventually return home. As it has been almost 10 years, I am not so sure. It's hard to not blame yourself. It's hard to not wonder why, was it something I did? Something someone did? \n\nThe only reason we know my brother is alive and well is because of my mother's surprisingly high connections with members of the US military - for example, an admiral recently sent a photo of him getting off a helicopter on an aircraft carrier (he joined the Marines). And we now have some form of contact with him thanks to a stubborn sister who joined the Navy, ran into him, cornered him and demanded that he at least have contact with her kids if no one else. He complied, but that's the extent of the contact. \n\nYour sister is an adult, and it's up to her to stay in contact if she wants. If you know otherwise, don't blame yourself. Forgive her. Forgive your ex. Don't cast blame anywhere. You'll only hurt yourself. Believe me, I know. ",
            "If you can access therapy, it might help. DBT or CBT therapy could be helpful. It sounds like you were all raised in an emotionally abusive environment. There's also a reddit for children of narcissistic parents - you might find some resources there (I'm not sure of the link, sorry). \n\nIt's normal that you would feel anger over these circumstances. And I'm betting you also feel partially responsible and angry at yourself (not that you could have done much, but it's pretty common for people in circumstances like yours to also feel anger and disappointment or guilt). \n\nSelf-compassion in therapy could help as well as DBT or CBT. There are books on those topics if you can't afford therapy or if you're unable to access a service that would provide it free or inexpensively. \n\nYour sister got away. As hard as it is for you to be missing your sister, maybe she is happier and healthier because of it.",
            "Hey. I ran away from home myself when I was 19 - away from my mother, like your sister did. Left up out of nowhere when nobody expected it, and dropped out of uni also. Seems like we have very similar situations. I can try and answer any questions if you have any that may pertain to my situation too. ",
            "Alright, I  think I can give you a bit of perspective here as I was raised in a similar fashion.\n\nMy mother remarried and had essentially stolen me from my father's side. She was a very selfish woman who simply played the single mom pity card a lot. When my brother was born of her and the new husband, I had no value to them.\n\nThings said to me were demoralizing, I'm ugly, I will never achieve anything... Or if I did, it was all credited to them. My little brother, though I now bare no resentment towards him, was the favorite.\n\nGrowing up in that house was a nightmare for me and they encouraged other family members to pick on me and dote on my brother. I saw the abuse while he sadly was rather blind to it. Again, I don't blame him and love him dearly.\n\nBut when I finally decided that as an adult, I have had enough of being treated like less than a turd and cut contact with the parents, I knew it would cost me my brother. But at that point, I also understood that abusers like to be in control, they want to rope you right back in and keep picking at you. It makes them feel better about themselves.  But my brother still couldn't see that and he still can't see that they control him just as much as they tried to control me.\n\nThey use him as a pawn. So in order to regain sanity, I had to stop talking to him as well. Just because he's blind and usable. \n\nMy mental health has greatly improved since the weight of their horrible behaviour has been lifted off of me and I have learned who I am when I'm not reduced to ugly and useless. But I never would had found that if I had stayed in contact with them.\n\nI miss my little brother and if he could be able to see through the fog they have over him, then I would love to have him back in my life. But I doubt it will happen.\n\nSo from being in your sister's shoes, all advice I can offer you is to recognize what abuse, whether it's mental, physical or emotional, looks like. Think hard and long on how your mother treated her, how you and your brother treated her in response.  You were kids. That might have some damper on resentment against you and your other sibling. Maybe one day she'll feel strong enough to say hi. Maybe one day she'll want to reconnect with her siblings, but if she has not at the moment, it's likely because of fear of bring lured back in. Fear of being guilted for wanting to be more than an emotional punching bag.\n\nAnd if that day comes that she wants to reconnect with her siblings, the best thing you can do is to be prepared and start understanding what she went through and be supportive of her decision and respect her choice to have your mother in her life. That's what it would take for me and you have the awesome opportunity to start seeing things as they are and be able to break free from the normalized abuse. Because make no mistake, any parent that calls their child ugly or reduces their choices to ugly is also a parent that does it constantly and reduces a child to nothing. Many of us turn to drugs and alcohol or simply kill themselves.  \n\nI hope one day things are good for you both. But that will definitely depend on your understanding.  I wish you the best. I can assure you, she did not do this to spite or hurt you.",
            "I'm really sorry that this has happened to you. This may not be my place but I honestly thought when you said they found her, you meant her body. Anyways it's not my place to say it could have been worse. But I do think it's unfair to you, your brother, and your sister. If you're mad at your sister then it might be misplaced. I am not saying it is but it's a possibility. I suggest trying to reach out to her without your mother's involvement. Sounds like you love your sister. Your sister might not be ready to talk to you yet but maybe she will eventually. Good luck",
            "I haven't seen my younger sister since 1987. My parents were incredibly abusive. My sister was mentally ill, and rather than getting her help they scapegoated the life out of her.\n\n In the past six years, I have lost my mother, my other younger sister, and her youngest son, who committed suicide roughly 2 years after his mother's death. \n\n All that is to say, I wish I at least knew that my sister is alive or dead, but I can understand why she's gone underground. Verbal abuse is deadly, and compounded by every other kind of abuse that we endured was too much for her to bear.  I hope she found help, I hope she found peace - but I've really always known why she had to go, and I don't resent her for leaving.\n\n I think if you give yourself some time and give her some credit, you will understand why she felt she needed to flee.\n",
            "Your adoptive parents are abusive and neglectful and Laura ran away to get a fresh start away from them.\n\nShe has made the right decision in this circumstance in my opinion.",
            "She's alive, and she's safe, take solace in that. The police could have returned with much worse news, especially After Jens and your mother's treatment of her.\n\nShe might not talk to you again for years, or ever, but you know that she's alive. That's a lot more than some people get.",
            "When you are able to live on your own, maybe try hiring a private investigator to find her and reaching out on your own?",
            "I'm really sorry, man. It feels really rough and shitty to be separated from a sibling like this. I can only imagine the kind of anger you're going through.  \nI'm not going to justify what your sister did, but I can tell you why I did a similar thing once. When a partner you love so much rips out your heart like this, all you want is to curl up in a ball and die, and you think nobody in the world loves you. It is then that it's imperative for family to show you that no, there are people who will always be there and love you unconditionally. In her case, instead on getting love, she got guilted and shamed. So shamed that she needed to distance herself away from it. She started seeing herself from your mom's (and what she imagined is also yours and your brother's) point of view and she couldn't stand what she saw. She felt ashamed being around and seeing herself as a loser, so she pulled away to save herself.  \nI imagine she needs to work long and hard to pull herself out of this dark hole she's in. But she needs to do it away from the shame. Hopefully she'll get back on her feet and surface again  \nWhat you can do is write her, tell her what you feel about her. Tell her that, regardless of what happened, you miss her and love her. That she's a good person. Tell her what you like about her. Make sure she knows that you're there for her if she ever does decide to make contact again. You can try asking the police if they wouldn't mind forwarding the letter to her",
            "As previously mentioned I've dealt with anger related problems in the past so i might be able to help in some way.\n\nThe loss of someone dear to you hurts us all in some way or another, and being rational beings we tend to try and rationalise our way out of the situation. We are however not always capable of finding an explanation that we deem to be acceptable and that angers some of us and saddens others. What you're most likely dealing with is exactly that. An anger for something that has no validity in the situation. What I'd reccomend is that you seek help. Dealing with this on your own is incredibly difficult unless you're capable of performing an insane level of self evaluation and not only that but you will need to piece the pieces that you gather from self reflecting into something that'll make sense. The help i recommend for you, seeing as how your situation at home doesn't seem to be very helpful, is that you start talking to school councilors and such. I don't know what your brother and sister's take is on the situation they share with you but they are most likely also having difficulties to some degree and thus they would not be as helpful to talk to without third party guidance.\n\nUltimately you'll need to reflect on the situation you're in and how you interract with the situation.getting good at self reflecting will aid you through out your entire life but it'll be difficult and you'll not like it when times are tough but eventually you'll be able to make sense of the tough situations and come out on top of them!\n\n(Writing on mobile...sorry for typos)",
            "It's okay to be angry, and you're angry at the right people!\n\nIt sounds like your sister has done the best thing for herself. She needed to get away from these people who hurt her to try and heal herself. I'm glad that your brother is supporting you and looking after you. \n\nIt's quite shocking that your mother couldn't answer a single question about your sister to the Police. What is she like towards you and your brother? \n\nTo handle your own feelings, it could be worth speaking to a councillor? That way you can let all of your feelings and emotions out to someone who can offer professional help and advice for you! Good luck.",
            "Not sure if this breaks any posting rules, but I would beat the living shit out of Jens. Narcissists won't charge for assault, and I promise you'll feel better, if only on the principle that doing something is better than nothing so long as no good people are harmed.",
            "Dear HMO, all happy families are alike, each unhappy family is unhappy in its own ways.\nYour situation makes me remember this line, from Anna Karenina.  There are tons of reasons and facts that lead to unhappy situation, some lie under your eyes and make feel you helpless cause still you couldn t do anything to avoid them and some lie in the past and , while you don t completely understand them, you feel they are also  making you miserable, angry and, again,so doomed. \nI bet that lots of your questions  are the same which your sister was tempting to answer as she was leaving your home. Why your mum was so careless or unsensitive. Why she falled in love for that scumbag, how to heal and stop to feel angry, ashamed and worthless.  \nDon t be mad at Laura. Everyone makes mistakes, moreover when we are stressed and maybe in that situation your sister felt she coldn t cope anymore. Maybe you had made the same choise if you were in her shoes. Maybe even you'd rather stop communicate.\nBut I understand that you already understand Laura's reasons and forgive Laura.\nAs for your mother, let me say that parents are always very far from perfection, we make lots of mistakes raising our children even in the best situation. She could be narcissistic as someone pointed out or could have singled out your sister as her scapegoat when she couldn t handle situations simply because she was too ill or too anxious. Surely she didn ' t have a good relationship with Laura and it could be something that went on for long time. As you pointed out she didn t know lots of things about your sister. is it the same with you or your brother or is it different? Why, when your mum and Laura became so Estranged?  talk about all of this with your mum and let  her know your feelings. She owns you not an answer, but to listen to you at least. \nYou seems considerate respectful and pityful, towards your sister and your mum in all you have written with the help of your brother, that I am sure you ll find the best way to handle this disgraceful situation, don t despair. I wish you the best for your family",
            "Sounds like the \"parents\" are just adopting for money from the government, not to be parents. ",
            "Hey man, sorry to hear about your situation, glad to read from other comments in here that you're overall ok.  \n If you would like a personal suggestion, try doing some kind of activity, something that's not expensive and (hopefully) safe. I started doing martial arts when I was about your age, not from the US though, I know that classes there are expensive af (at least compared to what I pay).  \n But yeah, try doing something like running, body weight excercises (no need for a gym or equipment) or getting a hobby (if you don't have one). I truly hope your sister read this and notices how important she is to you. Take a hug from an internet stranger and keep rocking on :)",
            "It's ok to be angry. I'd be angry too, even if I could understand why she left. \n\nHave you tried looking for outlets for the anger? Maybe you could write her a letter where you tell her how angry you are, and then burn it or tear it up? (Or even several letters?) Maybe you could do more exercise to get that anger out? Maybe just talking to someone about it? (though I guess you're already doing that if your brother is helping you, so good job!). \n\nThis situation sounds really tough to deal with. I bet your sister is sorry she had to leave you, as well, but hopefully with time you two will be able to speak again. In the meantime, do your best to work on the anger and let it out in non-destructive ways (e.g. unsent letters, exercise) so that when/if she DOES come back you are ready to listen to her. \n\nIf you're still struggling with this after a few months and you don't think it's getting better, it might be a good idea to find a counsellor or a psychologist to talk about it with. For now though, I think you are managing fine and it's perfectly normal to be angry. ",
            "Sometimes I want to run away. You kind of become selfish and forget about anyone else. I guarantee you, she has no idea how much this is hurting you. Maybe email get (without blame) and let her know lines of contact are open. It's likely all she needs. Sometimes you start thinking no one cares and it spirals from there. ",
            "I almost didn't want to read this because I was afraid it was a situation where she might have been abducted. She's alive and free, so there is hope. Can you find a way to get a message to her at all?",
            "I haven't read through the other comments all the way down, so I don't know if this has been said already or not:\n\nBut is there any way for you to contact your sister? Without involving your parents at all? To explain to her that you miss her and want to have contact with her, that you understand she doesn't want a relationship with your adoptive parents anymore - but to ask if she still wants one with you?\n\nOr is she just completely out of contact....\n"
        ]
    },
    {
        "post_id": "52rrb6",
        "author": "KarateYuppy",
        "title": "My sister [26] is telling family members that my husband [31] is a \"bully\" because he embarrassed her wannabe MMA-fighter boyfriend [24] after the guy tried to show off his fighting prowess at my [32F] apartment",
        "url": "https://www.reddit.com/r/relationships/comments/52rrb6/my_sister_26_is_telling_family_members_that_my/",
        "score": 2293,
        "num_comments": 334,
        "created_utc": 1473875624.0,
        "selftext": "Sister's boyfriend is an aspiring MMA fighter. I think he is a middleweight. He also is a PX90 trainer and fitness coach. Stereotypical \"bro jock.\"\n\n\nMy husband is a science teacher and NOT a jock. Though he happens to have a black belt in judo, which he doesn't go around telling people.\n\n\nSister and her boyfriend were watching football at our apartment last weekend. Talk turned to mixed martial arts, and my sister's boyfriend starts pontificating and humble bragging about how tough it is, and by extension how tough HE is. He goes on and on about how he is \"not a huge guy but can take down anyone,\" and that he has moves that are impossible to counter.\n\n\nHe's about the same height as my own husband (my husband is Japanese; sister's boyfriend is Irish-American) but much more muscular. My husband is fit but very slender. Anyway my husband innocently says that no move is really impossible to counter.\n\n\nSo, since his jock sensibilities were threatened, sister's boyfriend offers to demonstrate an unbreakable hold on my husband. My husband doesn't talk about judo with anyone and not even my sister knows he's a high-ranking expert, so her boyfriend tries to demonstrate the hold, and my husband easily breaks it.\n\n\nSo, he says he was going easy on my husband, and offers to try harder. My husband consents, and this time not only breaks the hold again, but counters the move and holds sister's boyfriend in a compromising, embarrassing position, and tells him to break the hold.\n\n\nSister's boyfriend is totally humiliated and eventually \"surrenders.\" He is humble about it and shakes my husband's hand. Rest of the afternoon seemed to go just fine.\n\n\nBut later on Facebook my sister mentions to me that my husband was being a bully to her boyfriend. In fact my mom called me later and told me to tell my husband to stop showing off, and for him to stop messing with sister's boyfriend.\n\n\nOne would think my husband was stealing candy from children or something.\n\n\nI texted my sister back and said that her boyfriend was the one bragging endlessly about what a badass he thinks he is, and out of nowhere challenges my husband to break an \"impossible\" hold, and so my husband humors him and does exactly that.\n\n\nI personally think my sister is just butthurt because she knows my meek little husband would absolutely smack the shit out of her alpha dog if they had a fight, and she's processing it all like an immature ten year old instead of moving on with her job of... Unemployed.\n\n\nThen she went into a long spiel about how teachers are all corrupt (I'm a teacher too, for history) and just collecting paychecks and doing a lousy job, and how I think that now that I married a foreign person I think I'm exotic now.\n\n\nOuch. Tell me what you really think, sis!\n\n\nI told her that she was acting like some of the middle school kids at mine and my husband's work. Now she's saying that I'm bullying HER by saying that.\n\n\nBut is it true? Was my husband being a bully? It seemed like the other guy had a sporting attitude about being beaten, so I don't get why sister is so mad.\n  \n\nI realize she's proud of her boyfriend being fit or being a cage fighter or whatever but she should know that one shouldn't go around trying to act like you're tougher than everyone else, because eventually someone will check you.\n\n  ---   \n  **tl;dr**: My husband made my sister's PX90/MMA boyfriend cry \"mercy\" and now my sister is calling my husband a bully.",
        "permalink": "/r/relationships/comments/52rrb6/my_sister_26_is_telling_family_members_that_my/",
        "comments": [
            "\"Sister, what you're saying is really insulting to your boyfriend. There's a lot of honor amongst fighters and losing gracefully is a very important. Why are you diminishing your boyfriend by implying he was bullied? You're making him sound like a frightened little boy instead of the trained fighter he is. Do you think he'd appreciate you condescending to him like that? Does he know this is what you think of him?\"\n\nOr \n\n\"What happened, happened between two trained fighters. It's between them. As experienced practitioners of martial arts both understand how to win or lose gracefully. It's part of the sport they both practice and love. To call it bullying is really disrespectful to the time and effort they spent training and insulting to them. \" ",
            "[removed]",
            "[deleted]",
            ">I personally think my sister is just butthurt because she knows my meek little husband would absolutely smack the shit out of her alpha dog if they had a fight, and she's processing it all like an immature ten year old instead of moving on with her job of... Unemployed.\n\nThis is the key line in your post. There is clearly so much bullshit between you and your sister, going both ways. Leave your husbands out of it.",
            ">I told her that she was acting like some of the middle school kids\n\nThis is exactly what's happening, OP. They're throwing a tantrum and doubling-down on it.  Maybe, at worst, it was a little sneaky because boyfriend didn't know about your husband's training, but that's like a 0.5/10 on the Bad-move-ometer.  She's being wholly inappropriate and immature,  and probably throwing around the \"bully\" word because she knows it's a hot button issue at schools. ",
            "Your husband is not a bully. This other guy thought his shit didn't stink and your husband, IMHO, actually did him a courtesy - this humbling experience was a lesson to be learned. You are right - your sister is butthurt and being a poor sport. Calling you a bully is her simply pushing delusion to garner support, don't allow it to inflate the situation. I would expect more from someone her age.\n\nYour sister's boyfriend was puffing his chest and didn't have respect for the art - your husband knows more about martial arts, considering his demeanor, and he did something that wouldn't necessarily be out of place for a sensei to do to a student. \n\nWhen I was younger, I had a cousin who claimed that all you need to do to defend yourself, was hit someone in the nuts. He's like 10 or 12 and clearly knows jack shit. My dad works in a dangerous work environment and challenged him.  He ended up hanging my cousin by the ankle and told him, defend yourself. You either learn your lesson among friends or you get burnt hard by your opponents.",
            "I'm sitting here grinning.\n\nMy own partner is a 5'3 Taiwanese-American with a sweet face and a low voice. Very, very quiet. Gentle. Lets spiders out of the shower, won't kill wasps in the house, cuddles his cat and makes silly voices. Sysadmin by trade, likes video games and SF movies, he's just about the dictionary definition of \"unassuming.\"\n\nHe's also a kung fu instructor who regularly takes first place at the biggest tournament on this half of the country.  Can casually run across a room on his hands, knows dozens of different weapons, does all his push-ups on his fingertips, all that flashy stuff.\n\nSo, basically, I'm walking into this one already biased? But no, to me, it doesn't sound at all like your husband was in the wrong.  MMA Jock Dude huffed and puffed, and it accomplished nothing.  Some lessons have to be learnt.  People who go on about how they are unbeatable are frequently the easiest to beat. People who think they've found the Perfect Move haven't ever had enough practice, or enough practice partners, and in all honestly I feel like your husband did him a favor.  After all, if it'd been in a real bout it would have been a lot more humiliating.\n\n\n>Then she went into a long spiel about how teachers are all corrupt (I'm a teacher too, for history) and just collecting paychecks and doing a lousy job, and how I think that now that I married a foreign person I think I'm exotic now.\n\nThat sounds a lot like jealousy. Not to mention kind of racist? I mean, as an Asian woman myself, \"exotic\" is one of my most-loathed words to hear applied to another human being.",
            "Your sister is nuts.  It sounds like her boyfriend actually handled it pretty well, all things considered.  I think she's just embarrassed that her tough guy boyfriend got beat up by a smaller guy.",
            "> But is it true? Was my husband being a bully?\n\nNope. And it sounds like your sister's BF knows it. \n\n>I personally think my sister is just butthurt because she knows my meek little husband would absolutely smack the shit out of her alpha dog if they had a fight, and she's processing it all like an immature ten year old instead of moving on with her job of... Unemployed.\n\nShe has tied up her own self-worth in her boyfriend's strength/fighting prowess. And, in her own mind at least, had done the same thing to you and your husband, allowing her to  feel superior to you to the extent that she believed her BF could kick your husband's butt. Your husband made clear how ridiculous that notion was and she is now looking for other ways of feeling superior. Like a petulant middle-schooler, as you say.\n\nHer striking out at you and your husband because of feelings of inferiority are the real issue here. Not the interaction between your respective SOs. ",
            "Your sister has no idea what she's in for if her BF continues to train to fight. He's going to be humbled over and over again. Even with the world's greatest attitude, a fighter is constantly humbled in practice. They are in for a rude awakening. ",
            "Haha... you guys are acting like siblings. Its funny.\n\nQuit posturing. No one here is a bully. Her boyfriend isn't a bad dude, just not a dude you find particularly attractive. He was even humble about getting beat, by your own admission.\n\nYour sister is mad because siblings and that is really all there is here. Its the same reason you are like: \"he knows my meek little husband would absolutely smack the shit out of her alpha dog if they had a fight\". Yall are just badmouthing each other and thats about it.\n\nedit: just read some other comments. Jeez is reddit ever getting a justice-boner here. You really sold it OP; the mild mannered good guy took on the loud mouth bad guy and won! Of course... maybe its because we only have your side? Sure, your sister is acting childish, but... uh... so are you. But you are siblings and thats what siblings do.",
            "You all sound as bad as each other to me. Your husband and brother in law got in a pissing contest which your husband won, and you're gloating just as hard as your sister would have if BIL won. You all need to grow up and move on.",
            "Your sister sounds like she is 10 years old.  Set your mother and others straight on the facts and then ignore what she has to say since she cant act like an adult.  ",
            "This reads more like a humble brag on your part about how badass you think your husband is and less like an actual problem in your life. Are you and your sister competitive about many other things?",
            "KarateYuppy, you're being mean and escalating things well beyond whats necessary and appropriate.  Your husbands had a play fight. That's all.  Hell, it was probably more of a bonding exercise if anything. From what I can tell, neither took the fight too seriously. You shouldn't either.\n\nHer husband didn't go about talking about the fight, your sister did. I think you're being a bit too hard on him. Your language shows your obvious disgust with him. \"His jock sensibilities were threatened\". Your husband is just as responsible for the fight as her husband. It takes two to tango. He didn't innocently say that no move is impossible to counter. He's a smart guy (he's a science teacher after all). He knew damn well where that conversation was going. He was excited about the prospect of putting that shit-talking MMA fighter in his place. \n\nAnd you know what? Her husband had it coming, he knew it and was thankful to your husband for not rubbing it in. He's probably pissed that your sister is making a big deal of this.  I don't think he's really at fault for your own problem and probably wants to stop this drama more than you even do. Try to be more open minded about him. Even if he is jocky, he might have other redeeming qualities. Your sister certainly thinks so. I think you can learn to like him.\n\nThe chief instigator here seems to be your family. Your sister for being exceedingly dramatic about what amounts to nothing more than a curfufle. The men don't seem to have any standing dispute with one another. She made their curfufle a much bigger thing than it really was. The men certainly didn't see it as bullying. Maybe ask your husband about how he feels about it. \n\nYour mother on the other hand had no business interfering at all. She didn't text you because she cared about the curfufle. It's because she feeds on drama. That's all this is. It's drama. Your mother loves it, your sister loves it, and YOU love it. Your language shows just how snide you can be. \"my sister is just butthurt\" You go out, and you get into unnecessary fights with your own family. You didn't start the fight but you fed the fire when you started deliberately antagonizing her. \"I told her she was acting like some middle school kids\" Why? Why'd you say that? You need to apologize. Her being mean is no excuse for your own behavior.",
            "Coming from a competitive background ... the interaction of both men was cocky. \n\nSister's bf is loud and bragging. \n\nOP's husband knows that you don't throw an \"innocent\" \"nothing is impossible\" out when talking to a cocky fighter. He knew that it would lead to a confrontation. To which he agreed to as well. \n\nWhich is not wrong. There's nothing wrong with a test of skills between two people. \n\nBoth were confident in their skills (you have to be), but only one will win. I don't see why the loser was \"humiliated\" (OP's words). He lost, shook hands and everything was fine. \nIf OP's husband really thinks that he \"humiliated\" sister's bf, then yes, he is a bully. But I doubt that he thinks that way. \n\nI think the real problem is the women. They don't measure their skills. They measure their own worth by proxy (skills of their bf/husband). OP is glad that her husband \"humiliated\" her sister's husband. To the sister she is worth more than OP, since her bf is not a \"bully\". They get their mother involved. They insult their employment status/job or the race. \n\nOP look at yourself and figure out what the fuck is wrong with your relationship with your sister. And then talk to her and try to fix it. All you talked about in your post are symptoms, but not the reason. \"The internet agreed with me that my husband is not a bully\" will not help. ",
            "you're posturing just as much as your sister is. both of the guys have brushed this off - why can't you two? and moreover, why do you keep insulting her boyfriend when by your own admission he didn't even act shitty about being beaten? you don't think he's as great as your husband, but other than making an assertion he couldn't back up and *owning up to that,* what exactly did he do?\n\ni never thought i'd say the people who got physical are the ones acting the most mature, and yet here i am. stop getting into a pissing contest with your sister.",
            "> she's saying that I'm bullying HER\n\nMy projection meter just went critical.",
            "This has very little to do with what actually happened, as I think you already know, and everything to do with jealousy issues between you and your younger sibling. You have a husband (who sounds like a catch by the way), she has a boyfriend. You have a career, she doesn't even have a job. \n\nShe was likely counting \"my boyfriend is a manly muscular MMA guy who can kick anyone's ass\" as part of what made her cool and interesting. This in turn is used as a bulwark against the stuff in her life that is not going so great. Your husband demonstrated that this was not in fact the case and she reacted negatively because her sense of sefl-worth is fragile right now. \n\nIf you're close enough with her to do so, try not to escalate this situation. She's being ridiculous, but she's lashing out because she is hurting right now. If you can find ways to be supportive and be there for her instead of making this into an even bigger conflict, she will remember this when she's in a better place, and likely be grateful (I mean, assuming she isn't just generally awful).  ",
            "[deleted]",
            "Nope, I don't think he was a bully from the information you gave us. Your little jab at her for being unemployed was unnecessary and a bit mean, so maybe there is more to this that we aren't seeing from the post? But from what I can see here, boyfriend was being a braggart and your husband just did what anyone might do in the same position. \n",
            "Tell your mom that it is not her job to mediate conflicts because you, at least, are no longer in middle school. Tell your sister that her boyfriend is not getting any apologies because there's nothing for you or your husband to apologize for, but you are willing to listen to her when she's ready to apologize to both of you.",
            "Boy is your sister jealous of you. She backs up her idiot boyfriend to start something, he loses, and she declares the winner a bully. If her boyfriend he won she would give you shit about it forever. \n\n\nAnd the exotic teacher angle? I've never heard of that before. I think that's just how she feels, she views you as more exotic and it makes her jealous. Your sister is butthurt and you can tell her to grow the fuck up. Your meddling mother too. ",
            "No, your husband wasn't being a bully. He was just showing things like they are, and you said yourself it seemed like the other guy had a sporting attitude about being beaten. He wasn't trying to beat him up or anything; he just wanted to prove a point.  \n\nBut your sister does actually sound like a kid. Maybe you should stop getting involved with her. That's what I would do.",
            "LOL the butthurt. Oh god, this is hilarious. You really have to step back and just appreciate this, because every word out of her mouth is desperate scrabbling trying to patch her wounded ego. \n\nFor me personally, I would just ignore anything else about this until it blows over and put some distance in place with sister in general until she grows up some.",
            "Ha! This reminds me of this kid in my high school that made a big thing about how he was a black belt in karate and he won all of these tournaments. He got in an argument with my friend about something that happened playing soccer and tried to fight him. Karate dude was not all that big, but he was tall, and my friend was an average sized, super chill, Filipino guy. Karate guy had like 6 inches on him. My friend had some kind of martial arts training when he was a kid, but he had only mentioned it in passing so nobody really knew about it. The fight was over in 2 seconds and karate guy got his ass handed to him. My friend just put him on the ground, pinned him, and embarrassed the shit out of captain karate expert. In front of most of the school. It was hilarious. ",
            "Idk I think your husband was a bit of a dick for goading this guy into a position where he knew he could humiliate him.\n\nBut that doesn't really serve to stroke reddit's justice boner. I mean how *dare he* brag a bit about his passion?",
            "My gym has a couple dozen fighters who complete in BJJ, Muay Thai/various other flavors of kickboxing, and MMA, along with a bunch of aspiring fighters. We see people like your sisters bro-friend come in regularly, and most of the time they do not come back after the first lesson, because it doesn't fit their narrative. They normally have taken a couple of years of something or other at a school teaching cardio to non-fighters, and when nothing works like they expect it to, they leave a real school for one that fits there narrative and where they can get by solely on size and strength or in very very rare cases conditioning.\n\nYour husband is not a bully, and has nothing to be ashamed of. In fact he did bro-friend a huge favor. If bro-friend is really an aspiring MMA fighter and not just a professional MMA talker, and he is actually planning to take a fight, he had a bad time coming. He didn't know how lacking his training was, he can't handle a smaller, less fit person in a safe environment, and he was marching into a broken arm his first amateur fight. If he's a reasonable person with a future in MMA, he'll just be impressed at your husband, may if try to learn something from him, and will drop the tough guy banter. If not, he'll be mad at your husband, try to out tough guy him, and will be a miserable pain in the ass until your sister wises up.\n\nSounds like your sister wanted to impress you with bro-friend, and instead learned he wasn't the bad ass he claimed to be. She's dealing with that by lashing out at you and your husband instead of dealing with reality. She's being about as lame as possible, just set the story straight if it comes up and hope she gets her rectal-cranial inversion corrected.",
            "What does her boyfriend have to say about this? It sounds like he was a really good sport, recognized that he was being a bit of a prat and got what was coming. I imagine he would be much more embarassed by your sister's actions than what happened with your husband.",
            "The reason the boyfriend lost is because he ignored the first rule. Never talk about fight club. \n\n",
            "So not only is she an asshole, she also is racist (the exotic jab)? What a winner. Probably better off not dealing with her, honestly. And if she gets mad again your husband can teach her boyfriend to ukemi a seoi nage.",
            "You two sound like dog handlers fighting their dog husbands and fighting who has the tougher husband dog. ",
            "I see where you sister gets this from, with you as a role model. You are also handling this immaturely and catty... It appears that the only two people who don't give a shit are your husband and her boyfriend, which are the only two people that matter here. I think it's ti for you, your sister, and mother to grow up...",
            "Yea this has nothing to do with either of the men.  Your sister is upset that her boyfriend isn't the badass she wants him to be, and for your part you are absolutely being a brat about how badass your own man is.\n\nThings like *Stereotypical \"bro jock.\"* aren't helping the conversation.  You very clearly revel in the fact that your husband knows how to fight, the same way your sister does.  You're both vain and petty.",
            "I think you are being a little pathetic and getting off on the fact your husband can probably take out your sisters partner. Go and ring out your panties and grow up",
            "Leave the guys out of this. You two girls have some serious issues that need to work out. Both need to grow up. You need to humble yourself. She needs to be less envious of your situation. \n\nThe real issue here is not your two husbands. Granted she comes across as immature but you two have some serious issues going on. Why did you feel the need to talk about career/being unemployed? It sounds like you took jabs at her and that really escalated the situation. Granted context means everything and you could have left some things out. But you mentioning her being \"unemployed\" makes you sound like a jackass while she's just immature especially if she didn't bring up about careers to begin with.\n\nYour husband sounds like a champion. Her boyfriend sounds like he was just humble'd by a champion. I think he handled it well too  and your sister doesn't like  having the inferior partner between you two. How childish! If anything, your husband can invite him to a judo class or two so he can learn additional moves on top of his MMA training and they can become best buds.  \n",
            "> I personally think my sister is just butthurt because she knows my meek little husband would absolutely smack the shit out of her alpha dog if they had a fight\n\nAlright I think you need to chill a little. You're husband sounds humble, but you sure as fuck don't. The fighters both sound like they handled the situation well.\n\nI can't help but feel that you're attitude is contributing negatively to this situation.",
            "Your husband has elements of being a bully.  \n\nI was with you almost until the end, but your husband is a skilled martial arts practitioner, and there was no reason to hold anyone in \"humiliating\" positions (if I understand right, there was something humiliating about the position *beyond* just that he couldn't get out of it) or to use a painful submission technique until someone cries \"mercy\".\n\nIf the intent is to get out of an unbreakable hold, and you do just that, that is fine.  If the intent is to put someone in a hold they can't get out of, that is fine too, but intentionally causing pain and humiliation beyond what was tacitly agreed upon is not ok.\n\nAlso, a more experienced person putting a braggart in their place, say, in a dojo is way more acceptable because everyone in a dojo has agreed to fit into the teaching environment of the dojo, and someone with his attitude can be dangerous there, rather than just annoying if they are out on the street bragging about their skills, and they will be a continual liability until they are corrected, rather than just as a one off thing.",
            "This whole situation is just LOL worthy. Your sister seems to have not grown out of the pissing contest of who has better 'stuff'. Your husband's interaction with her BF probably made her embarrassed and upset at 'losing', so she is just lashing out at you. Dragging your  mother in in this mess also seems a little over the top. I would just let the matter rest.",
            "\"Mom - stay out of it. You've been told the wrong information.\"\n\n\"Sister - You're delusional. Feel free to contact me when you've touched back down in reality.\"\n\nAnd then ignore. Sounds like her BF wasn't even bothered by the whole thing, so she'll stop throwing a hissy fit when you all stop paying attention.",
            "I hesit between /r/iamverysmart and /r/thathappened \n\nYou don't stop to brag about your husband, how superior he is, ect...  \n\nExactly like your sister would...",
            "I bet dollars to donuts if your sister's boyfriend knew she was spouting this shit he would be hugely embarrassed. It seemed like he had learned a respectful lesson.... something she could use herself. \n",
            "I enjoyed this so much; the schadenfreude was off the charts. Both your sister's dignity and her boyfriend's dignity were hurt, and now they're taking it out on you. Instead of admitting your husband has great fighting skills and wanting to learn from him, your sister's guy is crying in a corner. That's not a very productive attitude. \n\nI suggest you not get caught into the web of having to \"prove yourself\" to your sister. State your version of events, which is that your husband demonstrated defensive and offensive moves for her boyfriend, and that no bullying was intended. Then back away (seriously, give your relationship with her SPACE for awhile as in, don't contact her), and make it clear you will only engage with her if she treats you with respect in the future, not calling you both names and assigning motives she knows are hurtful and untrue. Tell her you value your relationship with her, but you will not be slandered to your own face and if you start hearing about it from others, that, too, will harm your relationship. If she values you, she needs to respect you and be honest. She's totally behaving like a child and silence on your end is a time-out. ",
            "The conversation they had on the way home in the car must have been hilarious.",
            "I don't see a question, I see you looking for approval in your role here. So here's my observation. There's a big dramallama between you and your sister and now you guys are using the men in your lives as a new way to fight. And mom likes to feed the drama, create a villain and play rescuer to the victim. Let me guess, your younger sister is usually mom's poor baby?\n\nIs it really worth fighting over? Who cares if she called him a bully? She's being ridiculous, that should be the end of it. Arguing further is also ridiculous. ",
            "Sounds like this is all between yourself and your sister and your mother. Maybe there's some deeper issues between the three of you? I'm not saying you're in the wrong here but you clearly don't worry to insult her, I mean was her being unemployed really pertinent to this story? \n\nAll I'm saying is it sounds like your sister is jealous of you having your shit together and in a very childish way was hoping her boyfriend being tougher might make her less ashamed of herself and her life. And either your mom is a root in this attitude your sister has, or your sister spun a very untrue version of the story to your mom. \n\n",
            "Im 150lbs. Look weak. I fought mma. Wrestled 10 years and almosy have two black belts. I find it fun tossing a guy with 100lbs on me. \n\nTell your sister to fuck off. Honestly. I back down from most situations because of crap like this.",
            "No, your husband is not a bully. Ignore the petulant children.",
            "[deleted]",
            "There's very little in Man World, more unacceptable than talking a bunch of shit, not being able to back it up, and then being a crybaby faux-victim about it. This will go away, because your sister's meatball boyfriend can not allow it to be known about him.",
            "No your husband wasn't being a show off, but I suppose he could have said that he was extensively trained in judo before he proved her boyfriend wrong. Still, they are pretty butthurt over the whole thing and your sister is just embarrassed for her boyfriend I believe. ",
            ">but she should know that one shouldn't go around trying to act like you're tougher than everyone else, because eventually someone will check you.\n\nOne thing about life that always holds true, \"There is always someone tougher than you\".",
            "Real fighters knows this to be true.  Any given fighter can be beaten on any given day.  Anyone who fights enough will eventually get humbled (RIP Cesar Chavez).  It's really the best part of the sport I think.  You husband seems to be someone who knows this, and he was helping the young man's education.  Not bullying at all.  He may have helped him be a better fighter. ",
            "Love this story. Your sister is salty. At least her bf tired to be a man and actually shook your husbands hand afterward. So lame that she got your mom involved. ",
            "Just wanted to say, I follow MMA a little (and my friends moreso). Judo is fundamental. Pretty awesome that your husband humbled one of these shit-talkers.",
            "Neither one of you belittled the idiots. What happened is that someone made an allegation, you offered to help them prove it, and they failed. What they are is embarrassed but their actions are what caused it.\n\nContinue on with your life. These people will sort themselves out.",
            "You'd think the boyfriend would be embarrassed to have been \"bullied\" and then have it put out on social media for everyone to see.",
            "Nah, you're fine. Your husband is not a bully, and neither are you. In the future though maybe reconsider the way you instantly engage with your sister. If my sister came up to me and launched into a nonsensical rant about imagined slights, I'd just say \"...oookay\" and be on my merry way. No time to waste with this shit. Don't entertain it too much, it just gives traction to the noise makers such as your sister & her boyfriend.",
            "I hope you're posting this here just as an excuse to share this hilarious story with people and not because you actually think that you husband might have been being a bully. ",
            "Sounds like bf handled eating crow with grace but your sister seemed to think she could one up you with her jock boyfriend and got schooled ... Pun intended because you are a teacher.  I have a feeling she is very jealous of you.  Your husband was in NO way being a bully BTW.  It was the green eyed monster who made an ugly appearance, nothing more.",
            "Your husband is awesome.\n\nI guarantee, her boyfriend is not training to be an mma fighter.  He is merely taking mma classes.\n\nWhich means he is new to every aspect of the sport.\n\nYour husband handled it well.\n\nYour sister handled it poorly.",
            "My sisters are both complete twats. And my mother gives them free range over my dignity in the name of treating us equally.\n\nSo you know you're not alone. I salute your calmness and your patience. \n\nHere's a possibility that I'm *not* saying is the right solution for you: Just because she's your sister doesn't mean you have to give her the time of day. You are entirely in the right here, and it sounds like she keeps doubling down. It's a waste of time, which I know you don't have enough of; because you're a *teacher*, and that shit is *hard work*. ",
            "There's a video on YouTube with millions of views of a cocky MMA fighter getting knocked out in seconds. Everyone loves seeing people like that get their comeuppance.\n\nThe bf perhaps quickly recognized he should try to not be like that in the future when your husband got the best of him, but if your sister keeps up with this kind of behavior and gets in his ear he could easily regress back to being cocky again.",
            "This story reminds me of the opening scene from Karate Kid II. Your husband is in the Pat Morita role and sis's boyfriend is evil instructor who ends up with his hands full of glass.\n\n\n",
            "Your sister is going to eventually get her boyfriend hurt. She sounds unbearable. Can you imagine this loudmouth woman yipping and yapping at a bunch of huge bikers? \n\n\n\"My boyfriend'll show you!\"\n\n\nLOL. Poor guy.",
            "The MMA guy should be the real man here and set things right. If he's serious about MMA, he should be really stoked about being connected with a family member who obviously has something to teach him about fighting. He should tell the fam that he was embarrassed, surprised, but that he holds no ill feelings for the husband. The others should respect that. Also, they need to stop being babies about it.",
            "This is your sister's problem. It sounds like your husband and her boyfriend handled it just fine. She's got too much time on her hands and this is what she's doing to fill it. Ignore.",
            "Tell you're sister [26] that your husband [31] is doing her wannabe MMA-fighter boyfriend [24] a favor by challenging his dreams. Fighting isn't just physical. It's a mental battle that you have to be ready for everyday. If he can't take that abuse then step out of the ring a.k.a. your [32F] apartment!",
            "Nah, martial arts is important. If the first your thing they teach you isn't respect, get out. There is no ego on the mat, you train and you improve and you learn. If you can't handle a loss, you aren't a martial artist, you are just some child expecting to be good at something without effort. Your sister's bf seems to have learned, or at least learned to back down and not act like he is already a famous international MMA champ. \n\nYour sister seems more involved than he is though. She is toxic with all of this. She went to your mom, and I guarantee she is telling anyone who will listen about this and try to sway them to her side like it's some kind of war. Don't feed it. Don't react to her any more than saying that you really feel like this wasn't an issue and you want to get past it. Trap her in the way that /u/kitten1002 says if you must, but the more you give her, the more she will stoke the flames. ",
            "Saves him bragging and getting into an actual fight with someone highly practised and actually getting his ass beat.\n\nThere's two ways you learn this stuff, and he should be thankful this was the way he learned it.\n\nAlso, just sayin', your husband is the man.",
            "Op's sister is slinging mud because her bf lost. She is a sore loser.",
            "Surely her boyfriend is embarrassed as fuck that your sister is defending him claiming he was bullied? Does he even know about it? Lol",
            "I never understood how someone can passive-aggressively talk shit about you to your face, then why you try to respond they call YOU out for bullying.\n\n\"So me calling you a middle school kid is bullying, but you calling my work and my husband's work basically equivalent to a sack of shit and corrupt isn't. The fuck?\"",
            "I trained martial arts for a bit and while I was no expert by any means a major lesson I was taught was about ego. There's always someone better than you. And you learn from that.  Sounds like your sisters boyfriend bypassed that lesson.\n\nEdit: reading closer it seems like the dude is not the problem. You and your sister seem to have your own drama.",
            "Tell her boyfriend. If he's a jock bet he'll hate idea of people saying he's being bullied. \n\nSounds like he was okay after the mini sparring match so he might more cool headed than you give him credit for. \n\nI bet your sisters ego was more damaged than her boyfriends. She likely felt like she had the tougher boyfriend and is pissy about it. \n\nIf her boyfriends a fighter she has to accept he's going to lose fights and competitions. It is a sport and being undefeated is almost impossible or hard to maintain for too long. All fighters have that I can beat anyone attitude sometimes, but they know how to handle losing too. \n\nRemind her that her boyfriend and hers shook hands after their sparring match. They have respect for each other after that display and it would be great if she showed same level of respect. A competition doesn't mean having to hate your rivals at a personal level. ",
            "Her bf also trains at a shit gym, shit trainer, or hes just an idiot. Any respectful place would teach him how to behave and never to act like that. \"Unbreakable hold\" Hahaha",
            ">But is it true? Was my husband being a bully?\n\nBJJ person here.I think the humiliating hold post reversal is arguably too far on his part. The reversal was enough to shut down all the silliness. So the hold could be seen as a gratuitous put-down to someone not used to fighting and that type of competitive mindset.\n\nMoreover, By not being open about his judo, your husband prevented the boyfriend  from getting a clue and editing  is schtick for the audience. Bragging is annoying, but at the  same time, you are people he would reasonably want to try and impress-- young, new boyfriends  miss the mark all the time.\n\nThe top comment suggesting that you frame the issue as one of respect among martial arts practitioners is a good one in my opinion.\n\n> Tell me what you really think, sis!\n\nI dont think your sister was wrong to be upset with how your husband handled things, be protective of  her boyfriend, and want her family to be good to him. But, to use understatement: the mean things she says later are of course inappropriate.\n\n>  I don't get why sister is so mad.\n\nDoes she think of you as a bully? Has your relationship always been good? Toxic opinions about family members are easy to develop when there are persistent, unresolved conflicts.\n\nYou are the teacher while she is unemployed and has poor opinions of teachers....did she feel failed by certain attitudes in the education system? Always strughled with schooling? Does she resent certain attitudes in teaching you might openly identify with? Like, a certain way of demonstrating achievement for example?\n\nBasically, is there any chronic issue between you two that this vignette could be emblematic of?",
            "Your husband probably saved the boyfriends ass.  Now instead of being a blowhard he won't underestimate people who look small and are mild mannered.  Did him a favor.",
            "As someone whos done MMA, anyone who actually competes would know, NOTHING is impossible to counter. \n\nIt should be a good learning experience for the boyfriend. ",
            "Sounds like you and your sister have some issues between you. What sisters dont, right? \n\nNo, your husband wasnt being a bully. All in all, it sounds like both your husband and her BF handled the encounter with grace. Husband banked a win. BF learned maybe he has a little more learning to do before he goes around running his mouth. \n\nStill, stop engaging with your sister. \"Im sorry youre upset. But this is something between Husband and BF. If BF wants to talk to Husband about it, youre more than welcome to pass his phone number along. They know that it was a friendly bout. All losing tells a trained, experienced fighter is that he has more to learn. It seems your BF knew that but if he has greater concerns, again, he can talk to Husband.\" And then change the subject. ",
            "I don't think your husband was being a bully, but he *was* purposefully tweaking the guy's nose just because he could.  He *could* have just let the guy brag and then just not invite him over anymore or something, but instead he wanted to put him in his place or at least humble him a bit.\n\nI agree with what your husband did(because most people dislike the huge d-bag jocks who brag about themselves), but he really didn't have to do it.",
            "She's acting like a child and your mother is perpetuating this behavior by getting involved. \n\nYou and your husband did nothing wrong. She is butthurt and acting like a fool. ",
            "This is a sister vs sister problem. Your sister has issues and is choosing low quality guys. You can't fix that. \nThe fact that your mom is bothering you, suggests that she indulges your sisters behaviour and poor choices. \nNothing you can do there. \nRealize that you will never be close to people you can't respect and keep as much distance as you feel reasonable. \nOtherwise, drama and trouble may be brought to your doorstep. ",
            "Your husband was not being a bully. Your sisters bf was a total scumbag and I would've proudly wanted to take him down too, if I had the opportunity and the skill to do so. He was also the one who wanted to initiate the showing off. Your husband is completely fine IMO.  \n",
            "Yo ir sister has other issues beyond the BF ability to break holds. The exotic comment is extremely indicative of some deep resentment, perhaps towards foreigners? \n\nOr perhaps unemployment is messing with her head. ",
            "Satisfying as it was to read this, two things to comment on:  \n> My husband doesn't talk about judo with anyone and not even my sister knows he's a high-ranking expert  \n  \nWhere I come from, martial arts are considered a weapon. Hiding this from a street fight seems rather logical, but hiding it from his brother-in-law in this context was not a very selfless move.  \nSecondly, good practice in martial arts suggests that they are NOT to be used to show off (or even to prove a point, when you can completely avoid it). I would have expected a black belt of any MA to have some more self control and discipline than to embarrass a member of the family in front of the others. If everybody knows the guys is an ass, let him be an ass, no need to enter a pissing contest with them.",
            "Her boyfriend acted like a douche and your husband put him in his place. Your sister was embarrassed so she decided to be an even bigger douche. I'd just stop responding to her messages.",
            "Honestly, your husband did your sister's boyfriend a favor.  If he got into a ring with someone else prematurely and got his ass kicked, he might have gotten hurt instead of humbled.\n\nIf the boyfriend is smart, he'll get back to training and keep his mouth shut from now on.  This probably has more to do with your sister's jealousy that your husband is likely smarter and a better fighter than her bro jock.",
            "You bruised their ego and children can't handle that, being said, you said in your post that it's on your sister doing the talking so still a pretty legit chance her bf isn't the douche nozzle all the replies are making out. If I was your husband I would offer to do some training/sparring together since the guy seems to have taken it well and your sister is the problem",
            "Your sister is the type of person that you probably wouldn't hang out with, except that you grew up in the same house. I don't think this is \"no-contact\" worthy, but maybe it'd be good to just distance yourself from your sister for a while. Find better people to hang with.",
            "This is so funny. You know you're right, don't back down. Your sister sounds like she's embarrassed of her situation and is taking it out on you in every way, from comments about your husband to your job. Be firm and wait for her to drop it before you engage in normal activities with her again. ",
            "I think maybe your sister just doesn't know what \"bully\" means.",
            "Set the facts straight to your mom and let your immature sister remain sphincter torched. Honestly there are stronger MMA fighters out there and if she can't handle her boyfriend losing matches, then she's in for a world of pain XD. Also seems she's projecting her insecurities on you.",
            "Your husband is not a bully.  He seems really mature.  Your sister's boyfriend is a jackass, and your sister is an immature little toddler.  I think you need to reduce contact with your sibling and tell your Mom if the boyfriend is so tough, why does he need his girlfriend's mom to protect her from your husband?\n\nOne thing I have learned in the martial arts is that the people that are actually dangerous do not tend to talk about it.  The ones that go on about being lethal weapons are usually just insecure posers.",
            "I don't know this to be true, but I don't think the non-aggressor can be considered a bully",
            "a class act would have been your sisters bf admitting your husband got the best of him, ask him how he is so knowledgeabl about judo, and then proceed to ask him if he would ever be willing to show him some techniques so he can improve his form. \n\n\nI know and totally get that if you want to be in mma you have to walk around with a chip on your shoulder, but I would guess that someone who is dedicated to his craft would never stop learning and improving. \n\n\nyour husband is a class act.",
            "It sounds like her boyfriend took it better than she did. As \"bro jock\" as he may be, he doesn't really deserve someone as immature as your sister.",
            "Nope.. You guys are in the right. \nI'm thinking she's the one making something out of nothing. I seriously doubt the boyfriend is all that hurt. If this guy has any brains he'd be hitting your husband up for pointers. Anyone at a halfway decent MMA gym is used to being humbled by someone who has a black belt in a discipline. Ronda Rousey kicked a lot of ass based solely on her Judo training. \n\nMartial arts requires you to be humble. You don't learn otherwise. ",
            "If anything, your sister is being the bully here.",
            "Ok I just want to say that I love it when people are quiet about their skills and then absolutely put people in their place. Your husband sounds very humble and awesome.",
            "\"her job of... unemployed.\" \n\nOh. My. God! LOL I cracked up!",
            "Your husband did NOTHING wrong. Jock challanged nerd, nerd accepted and won, jock and nerd shook hands like men. That's honourable. The situation means nothing to your sister, however.",
            "I have nothing constructive to offer. I am too busy laughing at your sister.  Your husband is a class act.  Your sister needs to learn how to be a better loser. ",
            "I certainly don't have any sympathy for the boyfriend, since he sounds like a grade A loser, but I think what your husband did was a bit...iffy from an objective standpoint.\n\nThink about it this way. What if your husband, a science teacher, was asked about something he knew a bit about but wasn't 100% sure on. He loves science, so he says what he knows, he says it with passion because he's passionate about science. Then the person who asks reveals that they are an academic researcher specializing in that specific field, and state in front of everyone every single thing he said that was incorrect, and publicly chastises him for talking about something that he didn't really know.\n\nThat wouldn't be fair to your husband, because your husband was under the impression he was just offering some offhanded opinions to people who were interested, not directly discussing the finer points of the subject with a leading expert on it. If he had known the guy was a leading expert he could have prefaced it with some phrases like, \"I was under the impression that,\" or \"From what I recall,\" and not been out of line.\n\nYour husband, before he agreed to engage with the bf, should've said, \"By the way, I've actually trained in judo my whole life and am at a fairly high level.\" Your sister's bf shouldn't have been running his mouth (about something he's clearly not very knowledgeable of ), but your husband shouldn't have baited him into a confrontation your husband knew he would win.\n\nI don't think an apology is out of order.",
            "A japanese Science teacher with a black belt in judo and a fit but slender body.\n\nGood Lord, your husband sounds like those guys you only read about in a romance novel, -Fans self-",
            "Your sister is 26 and unemployed; she's just saying these things to try and feel superior. She takes a lot of pride in her BF's \"skills\" and probably felt threatened once your husband rightly put him in his place. Neither of you did anything wrong IMO.",
            "All I would do is laugh and send him a link to a good judo dojo's schedule.\n\nHe obviously needs to learn the basics of martial arts.\n\nYour husband did absolutely nothing wrong. What he did is essentially the essence of teaching martial arts -- compassionatly dispatching the student's ego.",
            "Has your sister always been an ass?\n\nHow ridiculous to get your identity all caught up in your husband's alleged toughness. Ridiculous.",
            "Your sister is a baby, just ignore her. What a sook. ",
            "Your husband is definitely not a bully, he just happened to be the one who proved your sister's boyfriend wrong and sister's boyfriend couldn't handle being proved wrong or having a bruised ego.",
            "Your sister and her BF are both acting childish about the situation. But I will say that generally when two guys want to practice fighting moves it doesn't usually end well lmao. \n\nFor example, I was at a party and  the guys thought it would be cool to have a makeshift \"boxing\" match.... One ended up going to the hospital for stitches.\n\nYour sister is taking it to way too personally and no, your husband isn't a bully but he probably should have mentioned that he did judo so the other guy had a chance to save face.\n\n",
            "p.s. your husband is the freaking man",
            "Your husband just taught this guy the important life lesson that you shouldn't overestimate yourself or your moves in a fight. Maybe that will keep this guy from picking a fight he thinks he can win with someone who has no intention of going easy on him. I think your husband did this guy a favor. ",
            "Your sister made me lol. She is butthurt",
            "Actually if your husband is a Black Belt and recognized as such then the cops could charge him with 'assault with a deadly weapon' i.e.; his hands. The sister's bf was a wannabe, i.e.; not recognized as an MMA fighter. But I was still rooting for your husband.",
            "Well, I feel pretty confident saying all of us here enjoyed that tremendously.\n\nJust ignore the sore loser, obviously, you've said your piece so it's probably time to rise above. But I might tell SL that her bf is pretty cool, that it takes a lot of character and humility to respond that way, and you and bf were both really impressed. Focus on him, maybe, see if it hits her shame button.\n\nWell. Except for all that other shit she said, which is pretty unforgivable and frankly, strange and desperate. And would imply the general absence of a shame button. So, maybe she's irredeemable, and terminally immature, and all around awful.\n\nBut I think you know that your bf did nothing wrong. And I thank you for the tale, good fun.",
            ">Anyway my husband innocently says that no move is really impossible to counter.\n\nOP, although your husband is NOT a bully, this is a goad. It sounds like the dumb boyfriend was pushing your husband's buttons and deserved some humble pie, but he did not challenge your husband \"out of nowhere.\" Your sister needed some humbling, too, but did not take her licks.\n\nGoing forward, I would talk to your husband and together reach out to the boyfriend. Ask him if there's a way hubby can make up for what happened, and if there are any hard feelings. Reference your sister's outcry, and let him know you two didn't realize it had affected him so much. (the idea is that this gets back to sister and she shuts up a bit). Maybe hubby can show jock some moves. Let your mom and others know that you're apologizing to the person in question, and ignore your sister. She was humiliated because she put too much ego into her boyfriend's \"toughness,\" but she should calm down eventually.",
            "Your sister and her boyfriend are brats.\n\nStop associating with them until they decide to act their age.",
            "People tend to think that other people think like they do. \n\nYour sister and boyfriend have huge egos and an inflated sense of superiority. \n\nIt is only natural for them to thing the same of you and your boyfriend. \n\nJust ignore them. ",
            "Ask your mother how long she's thought you're corrupt, getting paid to do a lousy job, and think you're exotic  since you married an Asian man. \n\nIf she answers that she doesn't think that, suggest she stay out of the middle of arguments between you and your sister. \n\nIf she does think that, time for no contact with your whole family. ",
            "I wish i could leave some detailed advice here but the situation is really simple. Sore losers. Don't even explain yourself. ",
            "Your husband wasn't being a bully, and your sister is being a ridiculous child.  But \"ignore her and don't feed her anything else\" seems the obvious and simple solution to this sort of childish behaviour.",
            "So what did your mom say when you told her what actually happened?\n\nEdit: why am I getting downvoted? :/ I'm asking a follow-up question. She said her mom called and told her to tell her husband to stop bullying. I'm assuming OP followed-up by telling her mom what *actually* happened. I want to know her mom's response. Did she believe OP? Did she believe sister? Why is this question worthy of several downvotes?",
            "Op  Your hubby handled it very well, only asshats brag about what they \"think\" they can do, those that \"know\" what do never brag",
            "No, your husband was not being a bully.  MMA boyfriend was the one who was being all full of swagger, and challenged him.  If anyone was a bully, originally, it was MMA boyfriend, and now, your sister.",
            "Are you really really in a state of doubt about this? You really think there's a chance in hell that your husband's behaviour was *bullyish*?\n\nMMA is basically a sport for douches - if anything your husband was being a giant maxi pad and soaking up all the run off from that enormous douche your sister calls a boyfriend.\n\nNote to sister's boyfriend. Better go with plan B -- you know - that multi-level marketing scheme your buddy at the gym wants you to get onboard with.",
            "This is amazing. If only there was a video.",
            "Probably best if you let the while thing cool down, and then go all concern troll: \n\n\"I think the boys were just having a bit of rough housing. I don't think it was as serious as it looked like to their wives. But on a serious note, we would all be devastated if anything happened to him in the ring.\" ",
            "Your husband should help train him in judo.  Husband= Miyagi. Sister's boyfriend= Danielsahn. In the end husband's boyfriend will learn about more than fighting, he'll learn to be a man.",
            "Your husband showed an amazing amount of restraint and is by no means a bully. Kudos to him!\n\nI myself am a traditional martial artist, I practice Muay Thai, I have quite a bit of experience for an American amateur. MMA likes to take techniques from pure arts like judo and Muay Thai and adapt (bastardize) them to MMA fighting. I'm a fighter too, and I would've kicked your sisters boyfriends legs so hard he wouldn't be able to walk for a few days. That's bullying. "
        ]
    },
    {
        "post_id": "o374g6",
        "author": "None",
        "title": "My (29f) husband (39m) doesn't get that meeting my needs and running errands isn't self care for Moms.",
        "url": "https://www.reddit.com/r/relationships/comments/o374g6/my_29f_husband_39m_doesnt_get_that_meeting_my/",
        "score": 2292,
        "num_comments": 345,
        "created_utc": 1624073416.0,
        "selftext": "My husband seems to think that stuff like having a quick shower after going without for 5 days, running into the grocery store by myself for 25 minutes, or getting a quick basic haircut after 2 years of not getting it done, or simply any time where he is watching the kids all count towards my self care \"me time\"...\n\nI kind of think that this stuff just counts as maintaining basic hygiene and doing chores/errands. \n\nMy husband goes out for a few drinks 2-4 times a month. So tonight he's going out and I said I was jealous, it sounds nice to go out a have a few drinks without the kids. I don't really get to do stuff like that for me. \n\nHe said that I am going to a Drs appointment tomorrow and that's for me, it's something I wanted to do. I told him a DRs appointment isn't the same as going out for drinks, it's not enjoyable or stress relieving. He just kinda brushed it off. I'm still so mad that he thinks those 2 things are at all equal.\n\nI just don't know how to get it through his head that I need actual time for stress relief. He always acts like if I want to go out for a coffee or have a glass of wine and have a nice bath or something that I'm taking extra time on top of all the \"me time\" he thinks I'm already getting. Like I am unfairly burdening him with watching the kids when he already works 8hrs a day. \n\nHe just was on 3.5 months of parental leave and said it's so stressful watching the kids 24/7 and would give me breaks a lot. I thought he finally understood what it's like. How do I make him get it? Taking time for myself isn't nice when I know I'll just get lectured on how the kids were screaming and it was so hard on him the whole time.\n\nTL:DR\nMy husband thinks any time he is watching the kids is self care, stress relief time for me. How do I get him to understand it's not?",
        "permalink": "/r/relationships/comments/o374g6/my_29f_husband_39m_doesnt_get_that_meeting_my/",
        "comments": [
            "\\> Taking time for myself isn't nice when I know I'll just get lectured on how the kids were screaming and it was so hard on him the whole time.\n\nDon't give into the guilt trip. I'm sure they scream when you are watching them and it's hard for you too. Such is the life of a parent. \n\nYou want to go out for drinks? Make a date and go.",
            "You went 5 days without a shower?? And then when you took one, he considered it \"me time\"? I'm so offended for you 😅",
            "He wasn't even helping when he was on parental leave. https://www.reddit.com/r/Parenting/comments/m2wmf0/husband_set_up_gaming_computer_in_babys_room/?utm_medium=android_app&utm_source=share \n\nThis is your life now. My sister has a similar situation and so did I 10 years before her. We both realized that being a single mom was actually easier. If you're doing all the childcare and housework anyway, may as well not have the added grief of a man that doesn't help and also wants his meals made for him and wants to be c leaned up after. My ex even called it \"babysitting\" while he cared for our kids when I was at work. I had my me time when they went to daddy's for visitation. \n\nAdvice from me is to tell him that you two get marriage counseling or he can start cutting child support checks.",
            "He understands it. He just doesnt care and doesn't want to do more work.",
            "He knows full well a doctor appointment isn't \"me time\".\n\nHe's being deliberately obtuse in the hope that it's too much trouble to explain to him (argue) that it's not and you just walk away. \n\nStart scheduling time away for yourself. When he announces that he's going out with the boys on Friday, be ready with \"cool, I'm going out with the girls on Saturday, you'll be fine with the kids\".\n\nAlso, when he gets out of the shower, ask him if he enjoyed his \"self care\" time. Make the point that if your shower counts as \"me time\", so does his.\n\nFinally, it sounds like he's babysitting or \"helping with the kids\". The whole mindset needs to change. \"You're raising those kids buddy, you're parenting! Either step up or ship out\"\n\nHe's taking the time away to enjoy himself. You don't need permission to do the same. Make plans and see them through.",
            "You work 24/7 because \"watching his kids for a minute\" is not him parenting. You don't get to \"come home FROM work.\" Meeting children's needs all day is work. \n\nI am a parent and was a preschool teacher for many years. Being with children is exhausting because their needs are many and constant.  Washing your hair, using the toilet, feeding yourself IS NOT ME TIME. \n\n\nChildren need a type of constant physical and emotional availability, planning and execution that takes being 100% on top of everything including everything else that is going on in the home, like maintaining it and doing laundry, cooking, Dr appointments, Dental appointments.....\n\nYour husband just thinks you can do it all with your eyes closed and that it's no big deal. He leaves his work at work, and gets to come home and have a change of scenery, a change of pace, some fun with his kids who were taken care of all day by you, so they are probably feeling pretty great when he gets home, if a little hungry because maybe it's dinner time.\n\nYou need to get out of the house, away from everybody. Get a calendar where he can see it and write in your time. If my husband goes sailing or goes off with friends, I count those hours and demand them in return. At first this pissed him off because it tapped into his own childhood crap of being forced to do more work if \"caught\" having fun, and he would complain that if he wanted to have fun he had to suffer for it or pay for it, and I had to raise my hand and remind him who would be doing it while he was out. \n\nHe tried to tell me that I was doing those things anyway, so it was not like I was working harder, but I reminded him that I deserved time away to do fun things too, and I deserved to have someone take up the work for me while I got to choose what I would do with several hours at a time just like he was doing. You deserve it too.",
            "Oh he understands perfectly, he just doesn’t give a shit about it or you",
            "This does sound a *lot* like wilful ignorance. Absolutely no one would consider what you’re referring to “me time”. \n\nI can see his point of view though (SEE, not agree), he is confusing self-care and recreational time with “anything away from the kids”. By that logic, he spends 40 hours a week having “me time”. He just calls it “being at work”. \n\nPerhaps if you explained it to him like that the penny might drop? This is how resentment brews, however it’s not beyond saving. \n\nTry to put things in terms he’ll understand. The kids aren’t just a burden, they’re your children. Yes I know kids can be little bastards now and then but, as I’m sure you know, this is part of being a parent. He shouldn’t be considering *every* moment with them a burden and *every* moment away a treat. \n\nThat aside though, just express to him that just because the kids aren’t present doesn’t instantly equal rest, relief and relaxation.\n\nGood luck 😊✌️",
            "[removed]",
            "Honestly your going to be raising these kids on your own he is not going to be a involved father or a caring one. Start preparing yourself.",
            "Why do y’all insist on marrying and having the children of such useless men on this subreddit? I’m honestly getting a little sick and tired of young women not properly vetting men (btw I’m 22 and with ADHD + Major Depression so y’all don’t try to whine about “but they’re young that’s why, she’s mentally ill so she was vulnerable that’s why” I’m young too and I learned my lesson in high school) ??? For the love of GOD I want women to be more aware of the type of men they are dating before getting baby trapped... I seriously do not understand. He’s trash, tell him he is to his face.\n\nHe’s not stupid, either. He understands everything, 99% of the time men do- they are just acting stupid because they don’t want to take care of the kids or do housework etc. He doesn’t care about you actually having time for yourself to ACTUALLY relax because it will come at his expense, he just wants to be absolved of taking care of the kids. \nSo I repeat- he is trash.\n\nAlso the age gap between the two of you is a massive red flag. It seems a lot of women with these type of issues are always with men 8+ years older than them...\n\n\nEdit: Just read your post history- your husband is indeed an extreme douchebag. Instead of simply telling him he is garbage you should leave him.",
            "I looked through your post history. Why are you with this man? You seriously need to think about how little respect he shows you. Your kids will see that. Do you really want to put up with that forever? Is he just a paycheck? Because it sounds like he contributes nothing else. He put a gaming system in the babies room and then played games on paternity leave instead of helping you?\n\nHe preyed on you at a young age. You said you were 21/31 right? 31 has so much more life experience, which you know. He sounds kind of awful.",
            "Maybe try just telling him you’re going out and he’s got the kids that night. He probably doesn’t ask your permission when he goes out, so you do the same. Give him just as much curtesy about it as he gives you. \n\nOr, go on strike so he sees how much you actually do. \n\nOr, ideally, sit him down and spell out what you need and why you need it and that no, basic life and household sustaining tasks are not “me time” and you need free time just as much as he does. And you *will* get it because they are his kids too and he is just as responsible for them as you are.",
            "\"Honey, I need  you to be the primary parent tonight, I need some me time\"\n\n\"What do you mean, you just went for a pap smear 2 weeks ago? That counts!\"\n\nOP, it sounds like he thinks his job is 40 ours a week and yours is 24/7. The best explanation I've heard is that while the working parent is at work or commuting, the SAHP's job is child care and house work. For the other 110+ hours a week, it should be 50/50. You shouldn't have to negotiate for time off as if he's your boss.",
            "He seems to think ‘me’ time is any time without the kids. I’m assuming he goes to work, so start telling him he gets all his ‘me’ time when he’s working. Why does he need to go out four times a month?",
            ">I'm still so mad that he thinks those 2 things are at all equal.\n\nIs your husband dumb as a brick? You say he works so I assume his intelligence is fairly average, at least.\n\nSo let's me make this clear : he knows. He just doesn't care at all about your well-being.\n\nI would not give him a choice and schedule an evening out for myself. Just tell him : \"I'm going out that day, you take care of the kids\". Repeat 2 to 4 times a month, just like he does.",
            "TAKE your time back. Go out for drinks. Take an entire day off. Leave him with his kids. Hell, get a part time evening job outside of the house, since he gets 8 hours a day \"me time\" at his job🤷‍♀️",
            "\"My husband is like a caricature one would use to explain misogyny to a child, how do I fix him\"\n\nJust another day (hour? Minute?) on r/relationships\n\nHow the hell did you get married in the first place?!",
            "First things first... Get on a schedule of showering every day. Every. Day. \n\nI would go days without showering thinking I didn't have time or I was too tired. A switch flipped after having my second daughter where I realized how ridiculous I was being. It became routine and my husband knew before dinner was my shower time.",
            "You don’t need to make him understand. You tell him you are going out for drinks and do it. And then you continue doing it until it becomes so normal he thinks nothing of it.",
            "Your husband is gaslighting you and he knows it. \n\nThat's really fucked that he goes out to the bar, and doesn't let you have the same \"me\" time. Or, that he doesn't get a sitter and take you with him. I was married to a narcissist like this for way too long. Free for 2 years now. I'd rather be on my own with my kids than lonely and married and resentful. I never get lonely now. I've casually dated someone for over a year now and kept it not serious. I love this life, no snoring asshole drunk husband at 2 am waking me up trying to fuck me when he comes home drunk. \n\nThis is narcissism. They are putting their selfish needs over your well being. It is abusive behavior, and will not change unless they work on what really makes them act like that. Super hard for a narcissist to ever see themselves. Accept that and move on. Make him parent alone 50% of the time. My ex was SO MAD when I left him too. He was happy with his little life and wife home with the kids.",
            "I just looked through your post history, he takes over the babies room for his video games, he constantly gets in trouble at work for yelling and arguing with people, you are with someone that you need to leave, I’m sorry but seriously look at your post history",
            "You can’t honestly think so little of your husband to believe he doesn’t know the difference between hanging out with friends at a bar and seeing a proctologist, right? I’d blame him being strategically incompetent before thinking he was an utter moron who doesn’t understand how grocery stores work.\n\nFor real though, if it’s all the same in his mind - just trade him. He gets all the doctors appointments since he thinks it’s fun.",
            "He’s a lazy, selfish pig. He picked you ten years younger so he could be boss, now you’re outgrowing his bs ideas. Ugh.",
            "So does he make it difficult for you to actually take time to relax? Or he thinks it’s excessive?",
            "He doesn’t “not get it”. He’s decided that you don’t *deserve* it. He is so dedicated to protecting himself from actual parenting that he doesn’t care if you suffer. Any time you leave him with the kids is a reason, to him, to resent you. \n\nThis is not okay. It isn’t often talked about but buying your free time at the expense of your partner, forcing them into domestic labor without choice, and ignoring their needs like this is **abusive**.\n\nStart comparing free time; he has a lot. You have none. Free time is going out for drinks, not seeking medical care or hygiene. \n\nStart **leaving**. You made plans. Keep them. Inform him since he’s acting like you have to ask permission. \n\nAlso by his logic, his 8 hour workdays are also free time no?",
            "I feel I should mention that I can't drive. People keep asking why I don't just leave and have fun. I never got my license so that really limits me in where I can actually go. I don't live in a very pedestrian friendly area, so I have to walk 40+min each way to get anywhere. The bus isn't really much faster but better for bad weather. Not to mention until very recently you couldn't eat inside restaurants or cafes because of covid restrictions. If I have 2hrs to go out, it sucks to spend 90% of the time just walking where I want to go. If I ask him to drive me somewhere he really rushes me along to finish quick and leave.",
            "Give him a taste of what you experience. Book a weekend away to see friends/ relatives, or even just a cheap hotel for a couple of days, and make it clear he isn't invited. Leave him at home with the children 2-3 days. Switch your phone off so he can't contact you. You might even choose to strategically visit a location with 'bad phone reception'. He ought to understand by the time you come home that looking after children is work. If he doesn't, you know there's something wrong and it will be decision time for you. Good luck OP",
            "Disclaimer: Threads like this are why I am childfree. \n\nIt sounds like he thinks ANY time without the kids is \"me time\".\n\nSounds like he really hates your kids.",
            "Another day another man not worthy of the family he has. \n\nIm sorry OP.",
            "I was married for 19 years to a man just like this. He would be gone 10-14 hours every day, leaving around 7 am and coming home around 9 at night, and was just clueless about how demanding it was caring for our kids with zero funds. I used to joke that I entertained the kids on $5 a day or less. \nHad to fight for 4 hours once a week. He seriously counted down the minutes when I would get home. Personal time with my friends was viewed as withholding myself from him, he couldn't fathom how drained I was at the end of each day and why I wouldn't \"put out\". Tried multiple times to communicate my need for breaks. But since I \"didn't work\", I had zero excuse for needing personal time to myself... To this day, he still has no clue how abusive he was and thinks I make shit up to disrespect him. The level of toxicity is just unreal...\n\nNote: huge age difference between us (14 years) he came from a very abusive world, and he was my 2nd serious boyfriend. I jokingly tell new friends I got married stupidly young, and started dating him in kindergarten...reality I was 2 months post high school graduation.",
            "I am more and more convinced that marrying a man is a terrible idea",
            "> So tonight he's going out and I said I was jealous, it sounds nice to go out a have a few drinks without the kids. I don't really get to do stuff like that for me.\n\nWell why not? You’re entitled to it, start up a new routine where you go out for drinks with your friends too. He’s a parent, not a babysitter.",
            "I'm just gonna point out the age gap, something I'm sure other people pointed out to you over the course of your relationship. Deep down, you know what this is about. People have probably told you many times why older men date younger women.",
            "Time to \"go to the doctor\" again and meet some GFs for brunch, with mimosas 😬",
            "It's not that he considers doctors appointments and going out for drinks as equal. It's that he doesn't consider you as his equal.",
            "Time for him to pay alimony, child support, uphold his own household, and parent all on his own. Words ain't going to do it with this trash person.",
            "No one is that stupid. He knows exactly what he's doing, he feels completely entitled to your labour. Couples counselling.",
            "Where did you pick up this asshole?",
            "Reading this I wonder if any of this rings true to you. It’s a really good example of the gendered divide in child rearing and house work. \n\nwww.theguardian.com/world/2017/may/26/gender-wars-household-chores-comic\n\nNote: just because this stuff is common, doesn’t mean he has an excuse. Him watching his kids is him parenting, it’s not him “doing a favour for you”. \n\nI’d suggest therapy and some open communication. If he refuses, start also counting his showers and appointments as his “me time” and just booking your own drinks nice and using his lines against him.",
            "This guy sounds like trash and you should probably leave him.",
            "Looking at your post history... what is he offering you?",
            "ok. he doesn’t actually truly believe what he’s saying, so don’t worry about getting through to him, he won’t let you because he’s avoiding it purposefully. you should instead worry about putting your foot down and going on strike. no one genuinely believes a doctors appointment is fucking me time, he’s just training you to always revolve entirely around his convenience. he’s not going to acknowledge any of this unless you force him to.",
            "When I decided to go back to school as a mom with a full time job, you know what my husband did?  He picked up some extra slack. He did probably 80% of the childcare and chores while still working for the FIVE YEARS I was studying. And then, during any “free time” I had, he encouraged me to do things I wanted to do for fun. \n\nThis is not a flex or a brag, it’s what I want for all the women reading this. \n\nDo not give in to guilt trips or willful ignorance. Stand your ground or start stepping. If you don’t do it for you, do it for your daughters and sons so that their understanding of relationships and the work that goes into households is forever changed. \n\nDon’t let your kids learn that moms parent and dads drink with friends. Teach them that parents parent and adults take care of their home.",
            "Your husband sounds like a bad dad and a bad husband. Dad’s don’t “baby sit” their own children. It’s time for you to stand up for yourself a little more forcefully and make specific plans for your stress relief. Then take them without guilt. He is the children’s father. He can do 50% of the parenting.\n\nHonestly I think you need marriage counseling. Him hearing he is being self centered and cruel to his wife from a third party will drive the point home. If it doesn’t I’m sorry you married and had children with this kind of person. I also think you need some support in developing a stronger self confidence and self worth. Learn to set a reinforce healthy boundaries that allow you to take care of yourself and be a better mom and partner.",
            "I have the sense you're a stay@home momma. I understand if he is the breadwinner but I really think some boundaries need to redefined. \n\nIt almost sounds like you're in an abusive/neglectful situation. You're not a childbearing slave.",
            "Honestly, this is just how my ex was. It never got any better, and in the end I broke up with him. Now he HAS to look after our kid several times per month on his own, and I'm not there to rant about it to. And I get a break. I'm so much happier apart, no more feeling guilty for doing stuff for me (no, doctor appointments are not \"me time\").  \nMen like this will never change and be even a semi-equal partner in a relationship. I'm really sorry you're in this situation, I know it is awfully difficult.",
            "This man doesn't vaule you or your contribution to the family. He is telling you in words and actions that you don't deserve the leisure time and self care he does.  He has decided your children are completely your responsibility and any care he does is a personal favor to you. Think about how unbelievably disrespectful this is, how uncaring this is, and how your children are learning to treat their spouses. Act accordingly.",
            "He doesn’t care about you. His actions are telling you he doesn’t care about you. \n\n5 days is far too long between showers, especially if you’re caring for others. It’s time to be realistic about what your life is. You are a victim of emotional abuse. Honestly I bet he physically hurts you too but you just don’t want to admit it. \n\nHe is not going to understand. Respect for you isn’t there. You deserve to be respected, especially by yourself. \n\nTime to move towards divorce.",
            "You’re giving him way too much benefit of the doubt. He gets it. He knows. He just doesn’t care.",
            "Not gonna lie, sometimes wife and I flip a coin for who gets to go to the store while the other watches the beasts.\n\nA doctor's appointment is not me time. A haircut is possibly.\n\nAnyways this guy is going out for drinks a lot and the current arrangement is not fair.",
            "Start stating what you need. \"I need a couple of hours for myself tonight\". Preferably on a schedule (in our household, we each get one evening a week for fun, and one for work/house maintenance. The other parent watches the kids. It works.)",
            "You can’t make him understand, I would start planning little days out with friends or just by yourself a couple times a month and leave him to watch the kids.",
            "Maybe teach him the hard way. Words aren't going to change his perspective. They haven't until now. If he thinks a Drs appointment is me-time then he's been getting 8hrs+ me-time at the office everyday.\n\nGo take a bath, read a book, have a glass of wine. Tell the kids when they need something to go to dad. When he complains tell him straight up you've been dealing with that screaming for 8+hrs a day alone, he'll survive 1-2 hrs. \n\nYou need to actively plan me-time into your day, regardless of your husbands views. It's not \"can you watch the kids?\" It's \"watch the kids, I'm taking a bath.\"",
            "if he says you already had \"me time\" this week because of your doctor's appointment or anything similar, then just say \"oh but you showered 3x this week, you had A LOT more me time than I did!\" -___-",
            "Count every second he is away from his children for a week, label that his free time, and tell him you want an equal amount. Include his work day as he isn't with the kids, so clearly it's down time. \n\nSeriously though, this is How To Get a Divorce 101. Jesus christ, go to counseling together or this is going to fall apart.",
            "Honestly? Show him this post and then tell him you’re genuinely furious with him for brushing it off and you want to have a serious real conversation where he suggests a plan because that’s the only way you’re going to be able to be less angry. He needs to actually know the level of anger, sorrow and loneliness you’re carrying around because of this genuinely infuriating thing.",
            "So I do an overnight trip (one night) with a couple of my buddies (wife of one is my wife’s bestie); and go drinking at one of them’s house maybe once every 3-4 months. \n\nMy wife tries to get all upset about me getting this time to myself and her never doing anything.  Every time she brings it up I remind her that if she wants to do something all she has to do is make plans and let me know. I’m doing nothing to prevent her from a night out or a day away.  I actively encourage it. \n\nObviously I don’t have the same attitude as your husband but IMO- just make a plan, tell him, and go. He’s an adult- he can handle kids for a day/night.",
            "Why aren't you scheduling nights out if you want to go out?",
            "Set up a time for you to go out of the house and do something you enjoy. \n\nLet him know he’s taking care of the kids tonight, and then leave. \n\nIf you don’t feel like you can do that without risking hungry/dirty/neglected kids, then you’ve got a bigger problem on your hands.",
            "> it sounds nice to go out a have a few drinks without the kids.\n\nSo do it? It’s not as complicated as you’re making it out to be. Time to grow a backbone.",
            "He understands just fine, he doesn't give a shit, is all.",
            "Fuck it, go hang out after your drs appt. If that’s you’re only “me time” according to him, then make the best of it.",
            "Ugh! \n\nA) Make him run errands, consider it a gift to him so he can “relax”\n\nB) Go out for drinks with your friends, schedule your own me time! Every time he goes out for drinks, schedule something for yourself. He’s not going to make it even, you have to take that time for yourself.",
            "You can’t make him understand. He doesn’t want to understand. He will never understand. \n\nLooking at your post history, it’s pretty clear that you need to make a choice: do you want to continue living like this, or do you want to leave him? It’s unlikely marriage counseling will help - he will go through the motions without making any lasting change. You should check out loveisrespect.org\n\nI’m sorry you are in this position, and I really hope that you can make a choice that allows you to find some peace and happiness.",
            "Wow. Your husband sucks. \n\nIf being with his children all day every day for 3.5 months, wasn’t enough to get it and appreciate you, I’m not sure what is. I honestly think he gets it, but it’s easier for him to act like he doesn’t and pretend that him “watching” his kids occasionally is enough because he doesn’t want to put in any effort.\n\nI’d suggest making plans and just telling him you have those plans. Go out no matter what, don’t take no for an answer. If you give him an easy way out, he’ll take it. And then ignore his guilt trip, just say “you’re their parent too”. \n\nIf I’m honest, I don’t think he’ll change or get better unless he spontaneously decides to.",
            "Don’t ask for permission, you are an adult.  Tell him that this is what you’re doing and he needs to take care of his own kids.  He doesn’t get to decide what is for your self-care and what isn’t. If he refuses then ask a family member to come watch them/bring them to them or a babysitter and he can explain why he isn’t taking care of his own children.\nI used to have to have a babysitter just to work my small part time job I had whether he was home or not because both him and his mother did not approve of me working (having my own money) so couldn’t be counted on.\nHe’s 10 years older then you and there’s a reason why he wanted such a younger women, part of which is that no women in his age group would put up with such treatment and a young women wouldn’t have the life experience to know better.\nStand up for yourself and wish you all the best.",
            "It always surprises me what lowlives women on these subreddit have children with. So sad :(",
            "Why don’t you simply just make plans and go out? Instead of making passive aggressive comments. I mean, I get why you are but you seriously need to stand up for yourself and actually take some action or this will happen forever.",
            "Use time blocking. Take out a calendar and block our time. At first, block out the hours he has for free time, lets say its 4 hours / week. Work with him to get 4 hours / week for you. \n\nCreate a list of things that count (DR's visit isn't reasonable as \"me time\", but maybe a salon day with the hair and nails is). Hold him to the same standard.",
            "Schedule things and tell him he’s watching the kids. If he whines, schedule more.",
            "He gets it. Sounds like he just doesn't care.",
            "Despite what you think your husband doesn't love you. This is your life now unless you are willing to make a change and leave. Otherwise stop posting on reddit. No one can help you but yourself.",
            "Sit down and schedule a day when you go out for the entire day for yourself. He can reacquaint himself with what it’s like to be the primary caregiver. It’s important for the kids to see their father being the only caregiver more than just when you’re out to the doctors or getting a hair cut. \n\nHe should totally have Daddy days with the kids where he takes care of the kids and maintaining the tidiness of your home. Not only because it helps him understand what you do (and therefore gives him the empathy he needs to support you better), but also because the kids need to see how a well balanced home life looks like.",
            "LOLOL; you're husband very well knows a doctor appointment is not \"me time\" and nowhere equivalent to going out for drinks! Sounds like he just doesn't want to parent his own kids.",
            "According to his own logic, him going for work is his me time.",
            "Keep talking to him until it sinks in.\n\nAlso hold him to the same standards he holds you to.\n\nTell him how lucky he is to be getting some free time every time he has a dental appointment or a prostate exam....",
            "Sounds like he already gets it but its easier for him to act like a dummy",
            "My wife and I don't have kids yet, but I really think this issue goes way beyond Reddit's pay grade. Unless you two have 10 kids, there's no reason why you shouldn't have time to shower every day, or go out a couple times a month. Your husband can't look after the kids by himself for a couple hours to give you that free time? That's very concerning",
            "Tell him directly what you want and need. Don't say things like 'i would like to have some drinks too sometime'.\nBut tell him what you need and when you will get it. Take your own space.",
            "Looking at your post history, you would really benefit from couples therapy. It seems like he’s been out of touch with your needs and the needs of your whole family for quite some time. Hopefully it is something he can fix.",
            "Go to therapy. With or without him. Make a plan to meet up with folks and let him know. He can either be a responsible father or a jerk.",
            "I don't understand why people have more than one child when it's so hard to live and share duties. I don't understand how women who see how little their partner contributes with one child and then they go ahead and have a few more with them.\n\nI don't get it...OP, how did you get stuck in this situation? Didn't you see what he was like with one, did you think he'd get better with more?",
            "He sounds like a great guy! Not!",
            "This sounds like a conservative gender roles situation.  His role is to provide dollars.  Your role is to raise kids.  Therefore any time you spend not raising kids and he has to backfill is like you're not doing your job and he has to pick up the slack.\n\nThis is a clear cut situation for couples counselling.  He likely isn't even aware how callous and unbalanced his mentality is.  He likely sees the stress of providing as something that entitles him to more.  He's the general that must be well-fed so he can think clearly while his army starves.",
            "There is no reason to go five days without a shower. You are doing this to yourself.",
            "I thought I was doing pretty crap at being a supportive partner through all this parenting stuff but after hearing about your partner I have realised the bar is so extremely low, tell your husband I said thank you for making me look good.",
            "Damn, I’m sorry. He’s being rather obtuse, isn’t he? \n\nI think a big part of why local Kroger’s starting to put wine/beer bars and coffee shops inside the stores was for situations like yours. If grocery shopping is “me time”, then someone could have a cup of coffee or a drink first, sit and relax, and *then* do the shopping.",
            "Communication is such a vital thing for relationships especially marriage. Have you discussed how you’re feeling with him? I would talk to him about it first and be honest about your feelings.",
            "Posts like these make me so happy I never want to have kids. I guess my brain/dna did one thing write. Idk how all you wonderful women deal. I know not all men are like this but all my friends husbands are except for 1.",
            "It's not your husband's responsibility to make time for yourself.  Don't make it his problem.  You want to go get drinks?  Fucking plan that shit ahead with your husband, and go get drinks!",
            "You're complaining about a problem but aren't offering a solution.",
            "Clear it kind. Be specific with him about what self care actually means for you, and be clear on how he can help you to take that time/do those things for yourself. I’ll never understand why men act helpless after choosing to be a parent. Being a parent means….parenting. It means doing his half of the part of watching and raising the kids. This is probably why thousands of years ago men weren’t even needed to be in a fathering role, and villages of women all worked together to raise children. \n\nAnyways. Be clear. Be specific. Ask him how he’s willing to help you and compromise with you. \n\n“On the first Fridays of each month, I’m going to take some time for myself to _____ from 6pm to 9pm and I’d love your support so that I can recharge.” Giving men reasons as to WHY doing this thing will help you, for some reason is what makes them understand. Tell him WHY you need this time and why him doing [fill in whatever favor or task] will help you to feel ____.\n\nHow he chooses to react having to do some parenting and watching HIS children isn’t your problem.",
            "You feminists want us men to do your chores now",
            "My wife and I had this debate. \n\nI consider those things “me time” despite being necessities because they’re about the person, not about the family as a whole. \n\nThe bigger underlying argument here is not a tit-for-tat about who gets what, it’s you asking for help and your husband shooting you down. That’s the real problem here... the concept of “me time” just means different things to everyone but it’s universally gross that he thinks he gets to go out and play but you have to stay with the kids.",
            "I can relate. Mine complains about the 'mess' that kids bring and refuses to help. It's exhausting. \n\nIt took a ton of self reflection and a lot of research, but I discovered I have codependent traits. Try reading Codependent No More. Even if your spouse doesn't have addictive tendencies, a lot of the 'caretaking' behaviors I really identified with.. a lack of self care was part of that too. \n\nIt's ok to demand more time for yourself. I will warn you, I had a really hard time with it. My husband started saying I was cheating on him or wanted out of the marriage. I needed that time to keep from going crazy. Best of luck to you.",
            "You need to fold in weekly time for yourselves. For example, Thursday can be the day you checkout to go do whatever you want for yourself. He can take Tuesday. You should alternate Saturday evenings. Remind him that you both have full-time jobs - he works 8 hours & you work your 8 hours with the kids. When the work day is over, you both need to split childcare equally. Also, how old are your kids? My toddler is in bed by 7:30 pm and I use the rest of the night to relax.",
            "Make him do your job for a week.  Hel be sending you out for all the me time you want.",
            "If your husband can afford it, pay for help, a sitter, cleaners, whatever that makes both of your lives easier. Since he doesn't want to pull his weight, he can certainly pull his wallet.",
            "I think he knows but is acting like he doesn't, tbh.",
            "It sounds like it's time for change and the fact that he is fresh from 3.5 months of parental leave makes now the best time to do it. He should fully know how hard it is being at home every day and should be willing to do his fair share but it sounds like he's almost justifying his absence by calling everything you do without the kids in your pocket 'me' time.\n\nSit down with him and raise your concerns. If he really equates a shower with me time then he must understand that he is taking the same amount of me time as you, maybe even more. His lunch break from work is me time, his drive home is me time, etc. He should be able to see how ridiculous it all is when applied to him. \n\nIf he really believes in an equal relationship where you both get breaks from work / parenting then he should be open to redrawing things so that it's fair for both of you. If not then you may have married a man who does not fully respect you or the role of women in the home.\n\nIt might be worth speaking to a therapist about your feeling of guilt - he may be using this to keep things going the way he wants.",
            "Schedule a time to go out every week “for drinks” when he watches the kids.\n\nAlso, are two of you going out together every week and hiring a babysitter? \n\nOr tell him you are thinking about going back into the workforce full time and that you need to start looking at childcare options. It’s expensive. Maybe you can go back part time to start.\n\nYou both need self care, maybe he is better at advocating for himself than you are. \n\nI have a married friend that joined an expensive gym because it included childcare while they were there and that was part of her self care.",
            "I’m sorry this is your experience. Honestly he sounds very selfish and out of touch. He just doesn’t care and doesn’t want to be bothered being a dad. I’d try counseling to drive the point home that you need regular me time but in the meantime, for your own sanity, I’d start scheduling “appointments” a lot more frequently and actually doing self care things during those times. Like for instance I’d schedule “appointments” all day Saturday and get a mani/pedi, a haircut and brunch w some friends. I’d schedule an “appointment” for happy hour drinks w the girls. Maybe even a massage. You need time to decompress. It’s not 1952; time for him to step up and be an equal parent to the kids he equally created",
            "Usually I don't like tic for tac but if he goes out one night, then you get a night out too. Ask him if he would consider a dr appt, or errand \"down time\", if that's the case he can do the errands if it so \"relaxing\" for him. He needs a reality check and maybe reading these comments may help realize how his perspective is horrible.",
            "I’ve been a SAHM since March last year. It’s just me and my daughter most days until about 5 pm. We have had pretty severe lockdowns in my area a good portion of that time. Last December, I had to go to a specialist appointment. We slept over at my parents the night before and they took care of my daughter while I left for the appointment. I was probably gone about 3 hours in total as the appointment was about an hour away from their house. I had to have the doctor’s finger shoved up my butt. My dad asked if it felt good to get some alone time when I got back to their house. Uhhhh….",
            "It really is a hard thing to understand. I got remarried at 49 and became a dad again at 50. Now I am a \"stay at home dad\" and fuck if this is not the hardest job I have ever had. And I say that having been in the Marines. I truly was ignorant to how hard it was for my ex wife with my older kids. So this is not an excuse for how your husband is, but a guy really does not know, until he knows. Stay strong.",
            "I recommend just picking something you are going to do on the regular and make it non-negotiable. “Every Wednesday I’m having drinks with a friend” or “every Saturday morning I am going for a run…plan accordingly”. Regular, planned outings (and I do think leaving the house is key) gets everyone used to the idea and they learn how to make that time work for them.",
            "just tell him your going out for a couple of beers with the boys and he can look after the kids.",
            "Maybe you could tell him he's going to have to step up more in the child care role, or you'll have to hire someone to give you a couple hours break a few times a week.  I know a couple who did that, and it actually worked out pretty well for them.  They hired the neighbor girl to come for a couple of hours after school so the wife could have some time to herself.",
            "So make him do the errands and go out with your friends for drinks?",
            "Hey OP \n\nWrite a list of the chores/errands you do while hes at work, organized by day and start time, over the course of a week. \n\nInclude any time you spend gaming/tv/reading/etc, marked as \"me time.\"\n\nShow it to him and say you're exhausted and need him to help.\n\nMake this shit as clear as possible, in the most obvious way, because lazy people who can rationalize will never work if they dont have to.",
            "Hire a babysitter and go out.",
            "Time for you to start going out for drinks four times a month, then. He’s not being a partner to you. He’s being a selfish asshole. \n\nI would tell him that you’re disappointed in him for not treating you with respect, and you’re not gonna take it.",
            "I’m guessing he’s one of those guys that doesn’t go to the doctor or dentist or gets his hit cut. I would either write out all the things you do and the times and how you need more time him having the baby and I would also just schedule things with your friends and tell him that you will also be getting 2-4 nights out a month. Ignore any guilt trips he gives you.",
            "So when he's watching the kids it counts as your me-time no matter what the activity right?\n\nSo by that logic, it would count as HIS me-time whenever you take care of your kids, say, when he's at work maybe? \n\nCome on, either he is stupid as shit not to see the irony or he just doesn't give a fuck about your wellbeing, is this new behavior?",
            "I would take my time after the Dr's appointment.  Go get an overview the top Starbucks drink,go to the nail salon and order a premium pedicure with extra massage. Call a friend and see if they want to meet up for lunch after. Eat window shop,etc. You need to take your moments",
            "Hire a babysitter for three hours a week to get in some dedicated you time. If he won’t step up to the plate and be a dad, he can pay for someone else to.  You need a break. \n\nWhen you’ve had time to let the stress go then you can talk about dividing up the parenting duties.",
            "I think it sounds like it's time to take a nice, long vacation for just you. Book a week at the beach and kiss the kids goodbye, tell hubby you'll be back in 7, kiss kiss and good luck!",
            "I don't have an answer but I relate so hard",
            "Throw the whole man away. 🗑",
            "He’s a classic abuser. Please be careful for yourself and your kids! Do you want your kids to fall into this cycle woth their SO’s?",
            "Just tell him you're going out for the evening and go.",
            "I just wanted to say that I totally understand where you're coming from. \n\nSo I don't know how to label him when I respond to questions that involve him. He's technically my boyfriend, but that doesn't feel strong enough to describe our relationship. We've been together for 11 years, but we're not married, and we also have a daughter who is a little over a year and a half old.\nHe works quite a bit more than 40 hours/week most weeks. I stay at home with her, which I'm super thankful that he's provided that opportunity.  I just feel like I'm asking too much if I want him to watch her for a little bit so I can do these things that you mention, like grocery shopping, shower, etc. He doesn't necessarily say things out loud to me, but just some vibes I get from him. And honestly, half the time I would rather not even bother to ask him to watch her because I feel like he doesn't try to be more involved with her, like getting down and playing with her and her toys or just going to do something fun with her. I think it will get better when she's older and can talk more and walk more, but that doesn't help me now. I try telling him what bothers me, as well as try getting him to address anything that I'm doing that bothers him, but he just shrugs it off.\n\nEdit: a word",
            "Just go out for drinks with your friends? He can watch the kids. Or he can watch them 50% of the time after you leave him, the selfish ass.",
            "He works 8 hours a day. How many hours a day are you working in the home? \n\nWhen he gets home, he can take a short break to decompress, but then you and he should be sharing the chores for the rest of the day. \n\nWorking 8 hours a day doesn’t absolve anyone from chores. We all have to do them. \n\nThere’s an old saying. “A man may work from sun to sun, but a woman’s work is never done.”  This is bullshit and we need to destroy this old idea. Men need to be just as involved.",
            "He doesn't think taking care of the kids is a real job. He doesn't respect it as real work.",
            "You guys need a couples therapist. Stat. Something is up here. You cant make him do anything. What he is doing speaks volumes about how he feels for you and your family together, however.",
            "Are you two Hispanic?  I don’t mean anything by it I grew up in a Hispanic household and it sounds pretty close to that.  Mom took care of everything and dad worked all day and on his days off he would chill.  Mom never got a day off.  Im not saying it’s right and I hope when I get married I have a different outlook, but it might just be a cultural thing which will be so hard to change.  Possible, but hard.",
            "I think more than one issue here. Firstly which is bothering you the most? His ignorance or your struggle with housework and forgetfulness? From what you’ve written it sounds like you don’t have anything outside of housework and the kids. Are they all young or at school? Have you tried writing a list every day of what you need to do or having an app that can do it. It might help with remembering. I wouldn’t assume ADHD it could be many different things maybe even depression. He needs to grow up and realise that the children are his too and he needs to share the responsibility. You’re entitled to do things independent of the children just as much as him. This might be partly why you’re having trouble finishing things and remembering",
            "These are indeed stuff for you but you have you time as in entertainment/anti stressor and you got… wel the rest.\n\nAsk him if he thinks doing groceries or going to the doctor is fun or as fun as going to the bar, getting a manacure, spa day etc or anything equivalent for him.\n\nThhe answer is obvious and shouldn’t even need to be said, taking care of your self is the most basic of basic. That’s how it should be and to not live an empty life just maintaining your care, you let yourself loose and enjoy something as well.",
            "Your husband 100% understands these things. He just knows that he's in a better position in this marriage than you are and he can maintain that position by continuing to play dumb. It has worked so far. You have continued to allow him to get away with it. If you want the behavior to change, force the issue and stop making excuses for him. He doesn't have to \"understand.\" He just has to change his behavior.",
            "You can't make him understand. You can only schedule your time. \n\nStop justifying it and go. Get a sitter if you have to. You married a troglodyte, it's on you to protect yourself and your kids.",
            "I love how men always call it \"babysitting\" when they are caring for their own children 😆😆",
            "I need some me time..to do the laundry",
            "There’s a reason why he went for some a decade younger than him and this is it. He doesn’t have to respect you and you don’t consider leaving.",
            "Is he willing to consider couples counselling? Since he isn't listening to you, perhaps he will listen to a counsellor. The alternative is that you fit in all the self-care you can on the alternate weekends that he gets the kids.",
            "On his next day off just hand him the kids and walk out the door.  Go enjoy your day however you like.  Go to lunch with your friends, go to a movie, go shopping, go to the spa, etc...  Spend the same amount of time doing what you want as he does doing what he wants like drinks with friends.   Unless you are breastfeeding a newborn there is no reason Dad can't give Mom a real break.",
            "Your husband sounds horrible, OP. I’m sorry but I doubt you can get him to understand - he’s wilfully being selfish. If he loved and respected you, he would want more for you than this.\n\nOne thing I feel like many people misunderstand about stay-at-home-parent dynamics is that being a homemaker is your job. That means that while he’s working, you’re doing that job. When he’s not working, household chores and childcare are both of your responsibility. So many parents are disrespected by their partners who act like because they don’t work in an office, everything else is their responsibility. If it’s possible, I would consider leaving this man. It’s just so sad what he’s doing to you.",
            "You guys need therapy so that an outsider can talk to your husband about how his actions are negatively impacting you. No offense but your husband seems kind of spoiled. You are enabling his entitled behavior and you need to speak up for yourself and explain to him in a more serious manner. If he complains, maybe suggest spending some money for a sitter. Mental health is very important!",
            "If he's acting like that already then either lay down the law or get used to it because it will not get better on it's own",
            "Do you have any support from friends or family outside of your marriage? Because this entire dynamic sounds extremely unhealthy.",
            "THIS. \n\nSO MUCH THIS. \n\nThank you for writing your post!\n\nIn our household, it's the opposite. Me, the husband, is so busy while the wife gets \"breaks\". We're just in different spots in our lives, in our careers, so... good for her, I guess. \n\nBut she's like, \"you haven't even seen the kids!\" After working overtime and then coming home and studying for licensure and running errands and doing work around the house... \"you barely see the kids how can you be so cranky\"????\n\nThey're all NEGATIVE activities. Running errands, doing chores, going to a doctor's appointment. I know I may literally be child-free while doing this work, but it is still NEGATIVE activities. \n\nIf your whole day is full of nothing but negative activities, of course you're going to be in a bad mood!\n\nHe's child free... out at a bar socializing. That is a POSITIVE activity. \n\nHe's child free doing something POSITIVE (bar)\n\nYou're child free doing something NEGATIVE (errands / chores)",
            "Sounds like a controling asshole. I love when my wife goes out for \"me time\" it gives me time alone with kids that I treasure, greatly. My only complaint is my wife doesn't go out enough. On some really special occasions the kids are at a grandparent's house and my wife is out with friends and I get some peace and quiet to watch TV, smoke pot, and get munchy food delivered. It doesn't sound like an exciting life, but as a former alcoholic and intense partier, I've never been happier.",
            "Your post history makes my heart break. You deserve so much better than this person. You deserve to be a full human, and you deserve life where you're respected.\n\nPlease, please, please. Get out of there.",
            "Dude I found you on Instagram and I found your account here. Leave. Your. Husband. He's an abusive piece of shit who has no regard for you or HIS children. He tells you to lose weight and never gives you time for yourself. You would definitely be considering divorce I wouldn't even give it couples therapy. You should keep going to the doctors to help with your mental health and focus on yourself. \nI'm assuming you don't have family support in this situation but I would try to see if you can make some friends somewhere? You need to be able to leave him. He's holding everything above your head as he's probably in charge of all the finances. You would be better off as a single mother with child support checks coming in from him. \nWrite down every shitty thing he's done in great detail and please realize this behaviour is not normal and he will not change. Don't be optimistic about this. \nAn idea is if you need money and he's the only one you can get it from, ask him if you can do things to \"make you prettier\" or play them off as ways to make you seem more attractive but pocket the money instead so you can get away. You're in Canada I think you should move provinces, somewhere more crowded with more people and more help as well. \nYou gotta get out before it's too late OP.",
            "From your post history he seems like a giant AH. Constantly yelling at SOMEONE, getting in trouble at work for arguing, treating you like garbage. You need to tell him to get his shit together or you need to leave. It's not going to get better for you or your kids."
        ]
    }
]