[
    {
        "post_id": "ojhfeh",
        "author": "TheRedGerund",
        "title": "My [27M] girlfriend [27F] of three years told my mom that she doesn’t think it’ll work between us. I’m abroad finishing a trip and dreading coming home to be broken up with. How should I react?",
        "url": "https://www.reddit.com/r/relationships/comments/ojhfeh/my_27m_girlfriend_27f_of_three_years_told_my_mom/",
        "score": 2289,
        "num_comments": 345,
        "created_utc": 1626188563.0,
        "selftext": "tl;dr how to react healthily to an impending breakup that I cannot reveal I know about to my partner?\n\nTo be honest I’d been considering breaking up as well. Our sex life has been poor by my measure for months. She has been waiting for a proposal that I feel we’re nowhere near ready for. \n\nBut, and this is selfish, I have never felt safer than with her. She cuddles me and strokes my head and tells me she loves and believes in me. She helps me improve and wants me to be better than I already am. \n\nI struggle with depression and I really don’t know if I can go back to being alone after three years of this safety. \n\nMoreover, I took an extra week on a family vacation and let everyone go back including her while I travelled for a week. She apparently told my mom on the flight back that “she thinks this will be her last trip with my family and that things won’t work out with me”. She also asked my\nMom not to tell me so as not to ruin the remainder of my trip but Mom didn’t want to keep secrets from me. I understand my mom’s reasoning but now it’s all I can think of and I’m going to obsess over this. I’m freaking out.\n\nEdit: just to be clear I did ask, twice, if she would like to join me. I just love Italy, I don’t really regret having made the choice to stay.",
        "permalink": "/r/relationships/comments/ojhfeh/my_27m_girlfriend_27f_of_three_years_told_my_mom/",
        "comments": [
            "It sounds like she senses you’re just keeping her around as a security blanket and she knows the relationship has run its course. Don’t waste her time if you’re one foot out the door.",
            "27 years old and 3 years of dating is a pretty common \"move forward or end it\" step. You have no desire to move forward and she does. So, yeah, seems like it's over.\n\nYou react by letting it happen. Do you even love her? You describe her as a security blanket and mommy (with insufficient bang) essentially. She deserves better than that. If you don't love her, want to marry her, then let her go. Nobody deserves to be kept around because it's better than you being alone.\n\nAlso, if she's constantly having to emotionally support you and you treat her as your security blanket, that could easily be the explanation for your faltering sex life. On top of knowing you don't have any particularly strong future goals with her.",
            "Tbh, from what you said, it sounds like your girlfriend would be correct in wanting to separate and I think you probably know that it isn't lining up correctly for you either. It does honestly seem like you're taking more from her then you're able to give because you struggle with mental health (which isn't your fault so please don't misunderstand at all, but she has to take care of her needs too). But this is just my interpretation of your post, I could be misunderstanding things too and you know your situation much better than an outsider who read a few paragraphs about it.\n\nAnyway, supporting someone else while only getting a reserved amount in return eats away at a person after a while, if she's getting bitter toward the situation then that'll only make you both miserable so the kindest thing for both of you would be to part ways I think. It seems like you need to keep working on self-love and your own journey to feeling safe and ok in yourself while she needs to find someone who is ready to give the same amount she is in the relationship so that she can feel supported and valued, not just like someone else's safety net. I wouldn't like to feel that way in a relationship if I was her and you don't seem like a bad person or anything so I doubt you'd want to make someone feel that way either.\n\nAnyway you should just be honest I think and say that yes, your mom mentioned it when the subject comes up once you're done with holiday. It seems like everyone is trying to avoid confrontation because it's uncomfortable but breakups are a confrontation by their nature, regardless of whether it ends on good or bad terms. No one has anything they should feel bad about in the situation, not you, not your mom, and not her (other than the grief and disruption that comes with breaking up). You two are just different people with different needs, even if you love one another. And your mom was just put in a situation she shouldn't have been, that was a mistake on your girlfriend 's part (she's human though and people make mistakes). Anyway try not to forget that a lot of great things happen with breakups too, like excitement, time for hobbies and friends, and personal growth.\n\nBest of luck and sorry for the essay!!",
            "If you're depressed and unstable without her, you're actually depressed and unstable *with* her and the good feelings she gives you mask the depression.\n\nI can't imagine she would tell this to your mother and expect her not to tell you. She was probably hoping that your mom would tell you.\n\nYou write like you can't live without her yet you say you aren't ready for marriage after 3 years and that's fine but you can't expect her to wait forever. It's nice for you to have that \"safety\" but it's not her responsibility.\n\nJust ask your gf about it. Maybe it'll lead to a meaningful conversation that will strenghten your relationship or end it. One way or the other, it needs to be had and you need to be in therapy. And if you are, maybe you aren't listening to your therapist.",
            "[deleted]",
            "It sounds like you’re using her. It’s unfair to keep her around just for security without giving her much in return. You should probably take the breakup in stride and then work on yourself.",
            "[removed]",
            "Bear in mind that you only know what was said through the intermediary of your mom.  It may well be that your girlfriend was feeling sad that she can't relate to you as well as she once did, but is not planning to dump you.  Perhaps your depression is more debilitating in a relationship than you are aware of (sometimes depressed people think it is themselves who are feeling down, when in fact it's all one's close associates too).  If there is true affection, couples counseling might be indicated.  So maybe you need to work harder to keep this relationship healthy, but you really don't know until you get back and talk to her.\n\nI wouldn't keep the broken confidence by your mother to yourself.  Admit that the girlfriend's remark got repeated, and gave you a lot to think about.  And think you did!  This could be the occasion for a healthy boost between you and your girlfriend.",
            "You took your girlfriend of 3 years on a family vacation. She was probably expecting a proposal. Instead, she flew home with your parents while you stayed in Italy for another week. You said you’ve considered breaking up with her, so break up with her. Let her find someone who treats her better than a security blanket. If you want someone to cuddle you and smother you with love, get a puppy.",
            "TALK to your girlfriend. But also be really really honest with yourself. You’ve been together 3 years. You’re kinda meh on the relationship. If it isn’t fuck yeah, then it’s a no. I’m sure that at this point you’re with her more because you’re comfortable rather than you want to spend your life with her. That’s ok. You guys have had a great relationship. But it may be time that you part ways.",
            "Please stop wasting her time just because you cannot handle being alone.",
            "My mom told my wife that my sister didn't like her and it led to some frosty interactions for a while until I found out from my sister that's not at all what she had said or meant.\n\nIt's like that old telephone party game where people whisper a message to each other and when it gets back to the source it's completely different.\n\nTalk to your gf before you reach any conclusion.",
            "Yeah man after reading that I kinda hope she does break up with you. She's tired of being your security blanket. Work on your mental illnesses, alone. Yeah that's right, the long dreadful \"stress relief\" walks, meds, eating healthy, staying on top of your hygiene and finding healthy ways to relieve stress. Get therapy or therapy from friends & family who offer it. She's been your therapy & she's all out. I've seen people come and go from this life because they didn't force themselves to get up every morning. You have to really WANT to get better, in order to get better. You'll end up alone at this rate with the way you talk about her. There's no love there, just love for the things she does for you. Be the change & be her peace.",
            "Dude this woman is your crutch. You're not really all that compatible, you just like having a companion you can be codependent with. You're responsible for your mental health, not her. You need to get on top of that, because when you guys break up, you're going to need to have a good core foundation for yourself to build from. You put too much on the line with your self worth by investing in relationships which aren't really anything more than... well, you're living it, man.",
            " Sounds to me like you already have one foot out the door but are reluctant because you'll miss your feel good girl and security blanket.\n\nThat's Horribly unfair to her, yet you seem entirely focused on yourself and YOUR feelings.\n\nYOU don't think you're having enough sex. YOU don't want to be alone. YOU don't want to lose your security blanket because she makes you feel good about yourself. YOU don't think 3 years is long enough to commit to someone.\n\nBut what do you, do for her?",
            "You: my gf who is my security blanket doesn’t have great sex with me anyone and I want to break up; she wants to break up too. Boo hoo, how do I make her not break up so I could waste another 3 years of her life so she could soothe my aching soul?\n\nMe: 👁👄👁 bruh",
            "If you ever want to be in a real healthy relationship then you need to live your own life for you, not using someone for safety. You love the idea of her... Break up and work on yourself.",
            "So you want a babysitter instead of a partner, and you think your girlfriend should give up her life to only be a caretaker for you instead of any quality relationship she could have?",
            ">Our sex life has been poor by my measure for months.\n\nHave you talked to her about this or tried anything to fix it?",
            "You're using her as a security blanket, she can obviously see it and doesn't want to continue to get used, just because it's convenient for you. By 27, you should know whether you want to get engaged/married and have kids. It's completely normal to wait for a proposal, so stop making it sound like it's a problem. At this point, you're only wasting her time and you should break up with her, so she can be happy and plan for her future.",
            "Yikes, let her go. You won't commit to her and you're staying with her just so you won't be alone. She deserves better.",
            "> “she thinks this will be her last trip with my family and that things won’t work out with me”. She also asked my Mom not to tell me so as not to ruin the remainder of my trip but Mom didn’t want to keep secrets from me. I understand my mom’s reasoning but now it’s all I can think of and I’m going to obsess over this. I’m freaking out.\n\nCall your girlfriend and speak to her directly, find out exactly what she is thinking. \n\nIf you are worried about your mental health, are you in therapy? Can you speak to your doctor?\n\n\n>But, and this is selfish, I have never felt safer than with her. She cuddles me and strokes my head and tells me she loves and believes in me. She helps me improve and wants me to be better than I already am.\n\nThis isn't a good reason to stay in a relationship where both you and she have doubts. \n\nThis sounds very mothering",
            "I understand you’re depressed but good for her. Sounds like you’re being pretty selfish, emotionally manipulative and downright foul in wasting her time. You can react healthily by not calling her back or throwing a fit or begging her to stay. When she breaks up with you tell her you understand, that you’re not in the right frame of mind to be in a relationship and tell her she’s been amazing. After that don’t fucking bother her or contact her or use any moment that she reaches out to you as an opportunity to vent your sorrows. You want to respond healthily the best way to do that is to let her be afterwards. As for you man you’re going to have to seek out the support of friends and family and also get some professional help if you can do that.",
            "You’re 27 and you’ve been dating for three years.  If you’re nowhere near ready for a proposal now, you never will be.  She sees this.  If she wants to get married, she knows she needs to move on.",
            "You're not the victim and your comments are gross",
            "I would break up with her immediately. It sounds like you aren't really into her, she's just comfortable security, and now even staying with her isn't really security since you know she has one foot out the door too. It sounds like you'll both be relieved.\n\nI would recommend, in order:\n\n1. End the relationship\n2. Enjoy the remainder of your trip in peace\n3. Figure out how to manage your depression independently from reliance on a romantic partner.\n4. Find someone you actually want to be with",
            "Kindly - it sounds like you are with her for personal gain rather than actually loving who she is. You’ve listed all the ways she makes you feel good and benefits your life, but nothing much about her as a person. Also, you mention that you feel nowhere near proposing meanwhile she is anticipating it. Sounds like you two are looking for different things right now, relationship wise! \nI get that being alone with yourself for the first time in years is daunting, but I promise it is one of the best opportunities for personal growth. You can do this!",
            "\nYou have to invest in yourself and look for treatment, if you are sick you seek a psychologist, so you need to seek medic help because you will lose her.\nI strongly advise you to talk to her and if she feels comfortable with you seeking help while in the relationship then move along. But if she feels tired and she can't continue you need to respect her choice but still look for counseling for help and improve yourself because this cycle will continue unless someones provides you guidance.\nHelp is there but you need to make an effort on it",
            "I agree with the other comments, this might be unpopular but i also think:\n\n> I have never felt safer than with her. She cuddles me and strokes my head and tells me she loves and believes in me. She helps me improve and wants me to be better than I already am.\n\nThis sounds like the bare minimum for a partner. \n\nI get you are sad but at the end of the day if she doesn't think it's gonna work then that's that. Dont take it too personally, i get that you cant enjoy your trip now but just try to take this time to reflect on the good and the potential of what the future holds.",
            "If my boyfriend randomly stayed on a vacation for a week... it would probably be a hefty straw on the camel's back. Like wtf? Why? It's odd. Planning to go travel with friends/whatever - yeah. But just staying... when everyone else leaves? That's suspicious af.\n\nImagine being at a pub, friends and fam. They all go to leave and your gf is like... \"no, you go, don't worry about me. I'm just gonna hang out for a little bit.\"\n\nYour sex life is probably suffering due to the depression and depression is contagious. It is SO hard to be strong for two people constantly. She's probably tired of being rejected and not knowing if you'll be in the mood. Or worse, internalising, blaming and questioning herself.\n\nUnless you can promise her and more importantly, yourself, that you can improve... just accept it and end it. You may have no choice anyway.\n\nGo get healthy. Trust me. It's like everyone says - you've got to love yourself first.",
            "So the only reason you have for breaking up is a poor sex life for a few months out of 3 years? \n\nSex in relationships tend to eb and flow. It won't always be amazing. You have to take steps to keep it amazing.",
            "Dude get out of this. This is bad for both of you. You will never deal with your depression if she coddles it. You’ll only bring her down to your level. \n\nBeen there, done that - get out.",
            "Your mom should not have told you and your girlfriend shouldn’t have confided in your mom.\n\nBased on very limited information provided here, it sounds like your girlfriend is ready to settle down, get married and start a family.\n\nIf you are not ready for that, then you need to break up so she can find someone who wants to build a life with her.\n\nYou would be selfish to begrudge her that. \n\n\nRelationships are about building a future together, and in order to do that you need to want the same one. \n\nIt sounds like you don’t, so you need to go your separate ways.",
            "Your reaction today should be to practice being here and now during your travels. What do you smell? What do you hear? What do you see? Do what you set out to do first. \n\nAnd when you have a safe, calm minute to think ask yourself \"what do I really want in this relationship\" (not her, not your family, not society-YOU). And then you can explore what is possible when you get home.",
            "The reality is, breakups tend to suck, and they tend to hurt, even when they're 100% necessary. You were thinking of ending it, she was thinking of ending it, and from what you said, it's for the best. You can't depend on her to keep you afloat emotionally, that's way too much responsibility for your partner, especially if you don't really love her or want to marry her. \n\nPrepare for the breakup, find a therapist, learn to manage your depression on your own so you won't depend on the next partner who comes along. Get yourself to a point where you're in a relationship because you love the *person* you're with, and not just addicted to the security of the relationship.",
            "She sounds great. You should just end it yourself so you can get your crap together and be better for the next person.",
            "You sound like a bit of a drama queen and she will be better off without you.",
            "I sympathize with finding out her intentions this way. That said, your own doubts are telling. This is not the best reason to be with someone:\n\n>But, and this is selfish, I have never felt safer than with her. She cuddles  \n me and strokes my head and tells me she loves and believes in me. She   \nhelps me improve and wants me to be better than I already am.\n\nOn the surface, it sounds wonderful. She has supported you, and you love being supported. However, in a situation where you mismatch in other very important ways, you're letting her emotional care for your own insecurities get in the way of your need for a partner that is more satisfying sexually and that has a timeline for proposal similar to your own. It's possible she senses that incompatibility too. \n\nI also wonder what prospects for other forms of emotional care you have. What is your support network? Usually people have at least a few of the following, which can help them: \n\n* Family (you seem close to yours)\n* Friends, including close friends you can talk to about issues like this\n* Activities you enjoy doing with others\n* Activities you enjoy doing alone that help center you\n* Mentors through school, work, or community life\n* Some kind of civic or organizational involvement\n* A therapist, counselor, or coach (is your depression diagnosed? is it being treated?)\n\nI point all of these out because it's easy to let a relationship be our primary support network, and people often have trouble seeing how they get affirmation outside of a relationship. Obviously partners are an important source of affirmation and support for many people, but if we don't also have other places for emotional support, then it may put stress on the relationship, make you overlook other important aspects to a relationship, or (as here) make breakups harder. \n\nSo my suggestion is to ask her directly about this statement and affirm the breakup. Then work on your support network, with the goal of diversifying your emotional support basket.  I know that isn't easy with depression, but every proactive step - every meeting you plan with a friend, every activity you attend, every session you show up to - is a boon. Eventually, someday, in a future relationship, your goal is to have someone sexually satisfying, compatible in terms of relationship trajectory, and *supportive* without being your only support.",
            "It's understandable that if, after three years, you are not progressing the relationship to a proposal, she would want out.  If you are not ready to make that commitment to her, then let her go so she can find someone who would value and appreciate her enough to take that step.  You can't expect her to wait around indefinitely.  As the saying goes, \"Shit or get off the pot.\"  She gave it three years.",
            "She should break up with you. You've been with her for 3 freaking years and you guys, \"still aren't ready for it\" na shes ready, your just being weak and noncommittal. Ask her or dont, stop wasting your time. If you arent intersted in getting married let her move on  if you want to get married ask her.",
            "Get a dog or something.",
            "I see you have been in therapy for many years. But you are taking a back seat to life still at this point.  You will need to come forward and truly inhabit yourself. To do this is scary as it should be. It is scary to risk failure for what you really want. \n\nSit down with your therapist and start talking about what you want for yourself out of your life. Depression is a symptom of being unfulfilled, and often of having some kinds of trauma, family dysfunction or a series of losses or things that did not pan out. It’s not depression that needs to be overcome - what needs to be adddesssed are the actions, thoughts, wounds and emotions that are tied up and causing the fear of becoming your full self. \n\nYour gf may or may not stay to see that through. We don’t know. You gotta do this for you. And you’ve already started by taking some extra time away to be by yourself and do your own reflection. Your gf wanted you to be able to be alone to reflect and have her own time to reflect, your mom threw gasoline on your turmoil.",
            "Yeah your depression is serious but it’s no one else’s problem. You shouldn’t be looking for someone else to fix that problem for you cuz that’s not fair and creates codependency. Either you manage to fix the issue and salvage this relationship with someone who seems amazing to you, or you stop tying her down and go fix yourself alone. Either way you can’t be half in and half out.",
            "\nNow chances are that she didn't want to stay with you because she already knows she was going to break up with you, but I can't really imagine going on a trip to Europe/Italy , having my gf be there with me for part of the trip but telling her to go on home because I wanted to enjoy Italy by myself.\n\nAnd I guess I don't understand what you're worried about because you already want to break up also.\n\nOne of you just did it first before the other one got to.",
            "Why aren't you ready to propose",
            "I think when you get home, given what you have said you need to be honest with your girlfriend. Tell her what your mom said. Acknowledge that neither of your needs have been met in the relationship. That she is a comfort to you that you're afraid of losing but you don't want to get married soon so staying together will be wasting her time when she might want to have children.  And will likely make your depression worse. And break up amicably. \n\nYou can stay friends, if you have the emotional maturity to support that and you won't depend on her in the same way. She's essentially mothering you. Which is not at all sexy. \n\nYou need to learn to be that comforting voice for yourself. Or hell, just hire someone to cuddle you and encourage you. But don't waste her time. It's really cruel. Depression makes you think about yourself alot. If you're not making her life better and giving her what she wants, if you loved her you would leave. It's not enough.",
            "My boyfriend of 9 years broke up with me a month ago… feel I’ve been in purgatory since.",
            "Honestly man, get some treatment for your mental illnesses.\n\nI've had depression a long time, and the fact of the matter is you can't make people carry the weight of your mental health like this. You're facing the consequences of externalizing your coping mechanisms now-- you can't grasp going back to being alone because someone else, who has the right to define their own future and whether or not you're in it regardless of what would be ideal for you, is doing whats best for them. You have to find a way to build up that security in yourself. And if I could do it, someone who has literally been depressed for as long as I can remember, you can too. You need to find that security and love for you within yourself. You won't give her what she yearns for, which isn't your fault, but sometimes people are just too different for things to work. That's why you need to become your own security, because it is extremely rare for two people to fit each other like gloves.\n\nFind a therapist you like, one you feel comfortable with, one that can relate to you. They will be able to lead you where you're looking to go. They will teach you how to find that security. And I think you'll find when you figure out how to get it to come within you, all of your relationships will become rich with more love than you've ever known.",
            "It sounds as though you’re using her for your mental benefit and she senses that. Honestly, I would break up with you over that if I were her. Maybe she won’t though! She definitely didn’t tell your mother that thinking she wouldn’t tell you— she probably did it knowing she would tell you. Also, you can’t expect someone to be willing to wait for a proposal forever. If you’re nowhere near ready and she is, then that’s just another sign that maybe you two aren’t meant to be. You even say in this that you have been thinking of leaving due to sex, but she offers you mental comfort… so you stay for that. It’s not fair to her when it’s very clear that’s the biggest reason you’re staying with her. It will be okay either way, just remember that.",
            "I would appreciate her honesty. That's rare these days.",
            ">She has been waiting for a proposal that I feel we’re nowhere near ready for.\n\n&#x200B;\n\n>...she doesn’t think it’ll work between us.\n\nI feel like there are **massive** amounts of this story missing. Why do you not feel on the same page about marriage right now? Do you think not being on the same page for that is *why* she doesn't think this will work out? Do you two live together? Do you talk about your future in concrete terms? I left a totally great guy for the last two reasons. He made no attempt to actually, truly discuss a future or moving in together after three years. I didn't want to wait three more and be in the same place of him not being fully honest and open with me. I didn't want to feel like I was putting in all the effort waiting around for him to make up his mind while our late 20s and 30s went by. \n\nThat doesn't mean you should rush into a proposal or marriage by any means. I guess I'm just trying to point at that it doesn't surprise me that she's unhappy, if after three years you two still aren't on the same page with the pace at which the relationship is moving.",
            "Are you sure she really said this, and it’s not your mom meddling?",
            "I don’t understand what you’re asking. There’s no correct way to react to a break up. Just be honest and communicate how you’re feeling but if she wants to end it then you need to respect it. Honestly, it sounds like you’ve been lacking in the communication already so if you want any chance to save it just be honest with her about the issues in your relationship and try to figure out why it is you’re hesitant about moving forward.",
            "Talk directly to her.  Mom may be putting words in girlfriends mouth.",
            "I’m so sorry first of all. I understand the depression thing. I suffer from it too. I’ve been in the same place before in the past, and honestly, after three long years of being with the person, I realized leaving was better for myself. It gave me time to focus on myself and my mental health. It was hard not gonna lie. But in the end, they say everything happens for a reason.",
            "Sounds like you're using your gf. Sounds like you're scared to be alone which is your issue not hers. Sounds like you're leeching away at her life honestly. You came here; there's my opinion.",
            "Never forget that marriage is forever. If you don't think you'd want to commit to this one person for decades, it's a good idea to break up, however hard it is. It will suck hard for a while, but trust that time is usually good at healing relationship heartbreaks. Just brace yourself, take goos care of yourself, surround yourself with people you love and wait for that day where you'll realize you haven't thinking of her at all the previous day! I wish you well.",
            "Time to grow up and start \"adulting\"; and time to stop being self-absorbed. Either commit to her or let her go.",
            "When you get home, no matter how much you may want to work on this, be calm, and say you agree with what she told your mom. Let her know you care about her but don't think you are on the same page about the relationship. You aren't happy, she isn't happy, so suggest taking a break or maybe just moving onbas friends.",
            "[deleted]",
            "sounds like YTA. You don't do anything to work on yourself, you acknowledge you aren't ready for long-term commitment and you use her as a security blanket. It's no wonder she doesn't want to stick around.",
            "It’s a shame that your mom told you.  Take your time to really focus on what you want in life. You also don’t sound too sure about the relationship. Sometimes relationships don’t last forever. It’s okay to be single. You wanted to vacation alone for a reason, so try and still make the most of your trip.",
            "How much longer would you need to be ready for marriage? Three years seems like an awfully long time",
            "Bro... Leave her alone. That's how you react. Say your goodbyes and leave her alone.",
            "Write out in a way directed towards her what you wrote up for us. Why you appreciate the relationship and her and what it's done for her, but also what your reservations and uncertainties in the relationship are. Even if you don't write or tell her that, it will help bring clarity to you on how you view the relationship, regardless of immediate context.\n\nIf you're able to sit down with her, and discuss in a relatively non-dramatic, pragmatic way, your options within the relationship, and how you want to proceed, whether it's something you want to work on, or whether the personal vibe simply isn't 'intimate relationship' kind, even though you share a lot and you can be friends. Whether you need to stop talking until you both heal...\n\nAnd, address it, proactively. Don't be waiting for her to break it to you. I think it's fair game to say your mom shared that she has some reservations, but that you want to talk directly with her, and see where things are going.\n\nYou can do this!",
            "Like most people have been pointing out, it seems like you are using her as a \"security blanket\" to help cope with depression. \n\nTrust me this is not sustainable and not worth her time or your time. \n\nI myself have recently gotten out of a relationship that wasn't good for either of us but I stayed and was using it as a way to feel \"safe\" with my own problems. Once I began to realize that, I knew the relationship wasn't working but the only thing keeping me there was the safety. So I broke it off and trust me it sucked hard. I felt lost and totally did not know what to do. I'm finally coming out of that fog and feel I am becoming better at battling my problems because now I don't have that crutch, I NEED to deal with it. \n\nI think in the grand scheme of your life this may be the best thing that happens to you. I know it doesn't feel like it, but trust me, as long as you work hard to improve yourself once the break up happens, you will feel good about yourself and your life.",
            "First and foremost.  You need to make sure you have a support system.  Depression is not a joke, and with the situation you are currently in, you need to make sure you have the ability to stay out of a low.  Maybe call your doctor, psychiatrist etc. give them a low down of what you are worried about, and prepare accordingly.   Next, I don’t know if you provided her with the same security, either way, I don’t know your relationship well enough to say you are using her. I do know this though, you obsessing over the situation is not going to help it I’m anyway.  If you can get passed it, make the phone call.  You don’t need to say your mother said something, you can just call and bring up your own thoughts. Hell, if you are completely honest things could be saved.  Idk.  If she is hanging on till you get back, she is probably torturing herself as well.  Before you do so, make sure you spend the time to go over how the conversation might play out.  Look in the mirror, go over the hard questions, and make sure you tell yourself over and over again what your expectations from the conversation are.  Then stick to those. Also go over what you expect and don’t expect on her end.\n\nThe other possibility in this situation is she said something to your mom, to give you a heads up.  Maybe even to spark what I’m saying to you.  \n\nOnce again, make sure you prioritize your emotional stability above all.  I suffer with depression as well.  I find it gives me strength to sit and stew, obsess, and generally beat the crap out of myself internally for one day after breaking up.  Then the next I spend all day physically exhausting myself.  Hiking, running, lifting, swimming, and smoking green and popping and Advil right before I fall asleep.  Then the next day I push harder, hard enough for the physical pain to overwhelm the emotional pain. Takes me a few days, but my routine works.  Take care and good luck.",
            "Safety isn't life. Exploration is. If you've got depression, work on that. You're literally letting it keep you in a miserable relationship.",
            "I study psychology and was in a similar situation where I was with a long term partner and we talked about our futures together and marriage but he never seemed to be actually committed. I feel like you taking an extra week to yourself may have impacted her in a way. While it's understandable that you might want some time alone, it would seem rather strange to her and she might feel left out and like you don't actually care. Have the two of you been keeping in touch while you're away? Maybe it's just me and my ideals of traveling and spending time with a partner but I'm just giving you my two cents on what might be going on in her mind. I think you should also get into some therapy. It doesn't seem like your parents really know how to set or respect the boundaries. Yes - your parents may have not known how to deal with it themselves when they got the news and panicked to tell you. Did they elaborate on why she even expressed breaking up? Also what.. why were YOU considering breaking up with her? Or is this some sort of justification you're coming up with to not feel so hurt? \"I was planning to dump her anyways.\" Just come to terms with it and be mature is all I can say. You two grew apart and the sex is declining (tbh if you actually love her, that wouldn't be an issue, since it can be rekindled if you work at it). Don't explode. Don't say snide remarks like \"I knew you were going to dump me\". So far she thinks it won't work between the two of you and you're not even going to figure out why? This could still be saved if you want to save it and put some work into the relationship. \n\nAnyways this is what you can do - pretend you didn't hear it from your parents and try to improve the relationship (if you still want to keep it) or wait till she breaks up with you and take it maturely. How? Just say that you have been feeling the same way and it sucks it didn't work out but that you have enjoyed the time you've spent together.",
            "Just babe honest and up front.\n\n\"I've been thinking about breaking up too, so fair.\"",
            "I think she probably got mad that you didn't go back with everyone & stayed an extra week.",
            "Here’s a classic: leave before you get left. It’s safer that way, balls in your court, you’re controlling the situation.",
            "You don’t love her or want to be with her long term. That is clear. But it is hard to let her go because you are comfortable and feel safe with her. And these are ultimately the hardest breakups— the one where no one did anything “wrong”, you just are wrong for each other. For her sake and your sake, end it.",
            "What changed in the sexual department that has made it poor?",
            "You guys want two different things. This is what happens when you want two different things. I'm pretty sure your mom told you so you would propose marriage to your girlfriend, so we'll see how that goes should you give us an update. But otherwise,  I'm going out on a limb here; good luck with the single life.",
            "Hi OP, I also am a monopolar depressive.  I hope you don't mind if I offer advice from my point of view.\n\nYou're young.  It seems like you're into exploring and not quite into settling down - there's nothing wrong with that.  But part of you wants to feel safe.  Hence, you're staying with your gf for those areas.  Yet, another part of you understands that you're not getting enough out of this relationship.\n\nI'll probably get downvoted, but there's nothing wrong with dating more people until you find someone who's compatible with you in ways that you can be with for a long time.  It's ok to realize that aspects of your relationship are what you'd like in a marriage (the kindness and affection), and aspects of it are not (the mismatched sex drives).  This is growth and maturity.\n\nYour current girlfriend might only be able to give you part of what you need.  It's ok to break up for that and ok to look for someone closer to fitting you better.  It's even ok to think \"wow, she really does it for me in the cuddling department\" while admitting she can't in other ways.\n\nDon't force a relationship and don't think that marriage and children will fix problems.  I'd suggest that if both you and your gf think that it's best if you break up, then break up.  Now you know more about yourself and your needs.  You'll bring that maturity to your next girlfriend.  Be choosey!  Don't just date anyone.  Find someone who matches with you, now that you know what you need.",
            "simple answer: break up with her.\n\nlong answer: talk to her and see if it can work out, if not then break up with her.",
            "Dude you got to let her know that she isn't just there to make you feel better she's there because you love her and you want her by your side through thick and thin so you got to show her no you got to prove to her that she's the woman for you but don't act like it's the end of the world if she leaves you because it's not there's plenty more fish in the sea",
            "Don't waste time if you cannot commit. Neither of you are getting any younger. Why does she need to wait for YOU to be ready. For her, she could spend her time now, healing from you and finding something suits her than to wait for a journey which is bound to end.\n\nThink Bout her, not about you.",
            "You've reduced her to an emotional fluffer. No one deserves that",
            "Buck up or get out, you can’t keep her around as a safety net that’s not fair to her you been dating for three years at your ages a family is usually gonna be on someone brain. \n\nhave you talked to her about the sex? Not that it matters it seems like she fulfills you in other aspects and you just are not appreciative",
            "Ehm, I don't see any other mentioning it, so can we talk about how sort of really kinda a lot weird it is to take another week of vacation when all the other people on the vacation (Mom and partner, atleast, who else) leaves? This is just so weird ... like ... it screams you want to experience the place more than you want to experience the place \\*with people you love\\*, and \\*create memories together\\*.\n\nI think this action is quite symptomatic of how you see her place in your life. She is nice to keep around when things are bad, but if things are good and you are doing interesting things (like visiting a country you really love), you don't need her, and are perfectly good on your own. The fact it does not sour your experience that your partner said no to joining is very, very telling.\n\nCaveat: this mostly applies because you already went on vacation together and you decided to stay, alone. If you both decided you wanted different types of vacations and locations from the get go, and took separate holidays, that's a different situation, but that's not what's happening here.",
            "Sadly this might be a dependence based relationship which she, while still loving you, can also suffer from mentally. Depression and things of the sort are hard not only for the people with it but people around them because finding a balance between supporting someone while not giving up your own mental sanity. She also sounds like she ready for a commitment that your not open to it’s honestly probably more so a wrong time kinda thing as much as it sucks",
            "The hardest part of a breakup is just before it happens. Afterwards you'll feel fine.",
            "First assess are you SURE you want her in your life. \n\nThen discuss with her about the sex and any number of things that she may take issue with.\n\nYes there's a real possibility you can go home and she aint there but if she is, that's a sign and you need to act upon it.",
            "i think you just don’t want to be the one to get broken up with. also lucky you, enjoy italy. if a man was trying to break up with me and i was in italy, i don’t think i’d notice 😂",
            "Just break up over the phone.  It's not ideal, but it's practical in this case and no sense in dragging things out.  Call her now, have a talk, end things, and then you can move on.  Being single is way better than being in a bad relationship.",
            "She wants to break up, you had a thought of that. Why not just cut it now? Just flat out let her know things are dull and it makes no sense to keep going. It'll ease your time away and there will be no waiting for the inevitable to happen.",
            "She's probably leaving because you haven't popped the question yet. Unless she gave your mother some other reason, or you really think there is another reason. If she loves you and takes care of you, and believes in you and has expressed a desire to make a life with you, then she loves you enough to marry you. She just doesn't think you're ever going to ask because it's already been 3 years. And frankly she's being smart about that. \n\nRegarding the sex, you're going to go through periods in your relationship where you have less sex than other periods in your relationship. It happens in every long-term relationship and marriage. You might be dry for a few months, and then you might have sex everyday for a few months. That's just the normal ebb and flow. \n\nHave you discussed a future together at all? Have you discussed having children? Buying a home? What's your career goals are? Of course these are all things you'll need to discuss before you decide to get married. The lack of discussion on these topics is the only thing that I personally consider makes someone of age not ready for marriage. Did she give any reasons related to these types of life plans that calls her to think you're incompatible? \n\nSo, in summation, unless she told your mother that she didn't think it was working for some other specific reason, then truly it's probably because she doesn't think you're going to marry her- and well you know, tick tock. In fact, she might have told your mother before she told you in order to prompt your mother to talk some sense into you. So I would explore that before I determine that everything is lost. Good luck!",
            "Look, the reality is that women who think they might at all want to have kids in the future have to be aware of their timeline, because pregnancy will just get harder. So if you cannot move at her timeline, you need to let her go. Period. She’s already aware of this, so I’m not entirely sure what the problem is aside from the general pain of a breakup in a seemingly good three year relationship. Telling your mother was smoothing the way, and she was doing the nice thing by asking your mom to not tell you while still leaving it up to her. There is no “I can’t reveal that I know” — don’t get hung up on that. She knew there was a good likelihood of your mom telling you. It doesn’t matter.",
            "Dont beg bro and dont chase her. Seems many women want you to play that game",
            "If you don’t know after three years that you’re ready for marriage, then you’ll never be ready with this person. Let her go so she can move on and find someone who is ready to commit.",
            "Once you've started considering breaking up then you need to see where you really stand. If you're just keeping her around for your self benefit then you don't need her, it's just something that you don't want to lose, but you can get that from somebody else.",
            "Get over yourself, the world won't end if she breaks up with you. You say you've been in therapy for six years but the mere fact that you afraid of being single seems like you haven't even dealt with your mental illness at all.",
            "Your sex life has gone down hill only after 3 years. I am with my wife 15 years and I still find her amazing. Spend time on her and she will do the same back. Explore new things. Talk to one another and find out what your comfortable with and not with. Clear communication is the best thing so you both know where you stand. If this person makes you feel safe and a better person then you need to work harder to make her happy. The sad thing is you don't know what you have until you lose it. Sounds like you know what you have and just need to put in more effort. If this is something you can't do the you need to let her go and find someone who can.",
            "Maybe your mom is trying to sabotage your relationship?",
            "I don't understand the hostile responses here. OP said that the breakup is \"imminent\" and asked how to cope with it. He's not soliciting opinions on his character.\n\nOP: I would recommend you start spending more time with family and friends, maybe reconnecting with old ones and making new ones - this is helpful especially if your ex was your main source of social interaction. Focus on your career and hobbies. You also should consider getting a pet provided you think you're able to meet its needs.",
            "I would tell her you know and save yourself the anxiety. Of course your mom has an obligation to protect her, and it is kind of inappropriate in my opinion for her to tell your Mom something like that (did she expect her not to tell you! that is alot of pressure). I also think if you are struggling with depression, it is easier to take care of yourself when you are alone than trying to take care of you and emotionally support someone else in a relationship.\n\nIn the long run- you will feel better for airing things out...don't \"drag yourself through the mud\" as a friend once told me.",
            "id just say ok and exit.",
            "I love how barely no one answered his question - of how to healthily cope & react to the breakup.\n\nOP doesn't need/or asked for advice on his situation, just how to cope with the breakup.",
            "OP I don’t have specific advice for you but I’m noticing the comments are ripping on you. If the woman was doing this, most of these people would be supporting her. Double standard for sure.",
            "Boohoo, you're keeping her from being happy",
            "My opinion. And it’s a simple one . Games are being played here and a bit of power struggle .The telling your Mom this, is a it’s over move or a big gamble on her part to force the ring . I’n my heart I think you guys should split and work on yourselves . Your not going to do that but if you marry it wont last . She will file for divorce within 5 years . Im not an a hole just please give some thought to yourself and realize there is no magic and getting married does not solve any problems whatsoever.",
            "What Freud said “there is no such thing as love”. You like her pampering you and taking care of you. She is your treatment to depression. In return what is she getting? You have lot of baggage, work on that first. You are too needy. No one likes that.",
            "I'm sorry to have to tell you this but if she even told your mom, then it means that she checked out months ago and is now done grieving so there is no point even considering trying to fix the relationship because that ship already sailed.\n\nThe best way I think you can go about this is as follows:\n\n* Make plans for a day date and just spend the whole day with her, doing stuff you both love, having fun and eating good stuff.\n* Then take her to a special spot that meant something for both of you, like sunset at the beach or a city view from a rooftop.\n* Tell her to not say anything and just enjoy the view while you hold her.\n* When you think it's been long enough, give her a soft romantic kiss while holding her close and tell her that you're going to miss her.\n* If she asks what you mean, tell her that you've noticed that you were headed for a break up, that she has been pulling away, and that you understand.This is around the point she will start sobbing\n* Tell her that you wanted to spend this day with your best friend one last time and how much you appreciate all she's done for you.\n* Express how this is perhaps the most painful part because you loved he character and quirks that only you got to experience.\n* This is the point where she will ugly cry and snot all over the place, have a handkerchief ready (you should always have one, if you don't then get one).\n* Take the drive or walk back home while reminiscing about your funny memories.\n* When you get home, tell her how beautiful she is, how you've always desired her and how you want to kiss, touch, smell and feel her one last time as the right end to the best relationship of your life.\n* Take a shot of drink of preference (have her preference ready as well) and use that as a spring board into some of the most passionate sex you'll ever have. Make sure she cums!!!!!!!!!!!\n* Keep drinking and fucking all night!\n* Wake up early and slip away before she wakes up.\n* Head home knowing that she will always remember you and that day, which in turn will ruin her for other men who cant possibly compare.\n* Work on improving yourself, learn to be happy with your own company and DO NOT, UNDER ANY CIRCUMSTANCES GET BACK TOGETHER WITH HER.",
            "Some things in relationships are unique, one-of-a-kind.\n\n>  She cuddles me and strokes my head and tells me she loves and believes in me. She helps me improve and wants me to be better than I already am.\n\nThis is incredibly common in healthy romantic relationships.",
            "you dont have to be alone, i'll talk to you, friend!",
            "She has to know your Mom would tell you, it’s your mom…",
            "Break up with her before she can break up with you.",
            "Why can you not reveal that you know? \n\nTell her you know and break up with her, take back that power. There will be plenty of people who will meet your criteria for a partner, based on your humble description. \n\nWishing you lots of strength!",
            "Can you trust your Mom?",
            "Take control. Just come to terms with it and break it off yourself. It’s too late to fix it cause she already had her exit strategy executed.",
            "Might as well get out ahead of it and end it before you come home. \n\nPlus you will be out of town and single. Might be fun",
            "Break up with her first over text before you get home.",
            "Indifferent, like you don’t give a shit, why will you? She doesn’t care, why will you?\n\n I see a lot of men 40 and under breaking up, crying, for the love of a woman, and don’t get me wrong, there is nothing more beautiful that a woman, but to wreck your life, the rest of your life, is not worth it.\n\nbut maybe I’m wrong, what do I know.",
            "She sounds a little passive aggressive imo. Don’t get manipulated into doing anything you don’t want to do ( 💍)",
            "Talk to her and talk about ur feeling. Sometimes it doesn’t work out. Yeah it’s hard to move on but eventually you will find someone that will fill in of what your looking for. Yes I understand that you have depression and is afraid to be by yourself. This is why you have friends and family that care about you. Either way you will be depressed vice versa if the relationship is not even working out for your point of view",
            "That's just a really weird thing to tell the Mother of your significant other. It's almost like she found somebody else and she's trying to get her story out to your family before you do so she doesn't seem like the bad guy.\n\nI mean really, why wouldn't your Mom tell you this? She had to have known you'd end up finding out.",
            "Never come back and then she has to break up with you by phone. Then it's her who sucks 😂",
            "She found a new guy, rip",
            "React with a side chick!!",
            "Best to let her go. \n\nYou can’t keep her around because you feel safer around her; that’s not fair to her and if you base your wanting her to stay around your avoidance of being uncomfortable, you’re only prolonging the inevitable. Don’t make this more painful for both of you. If she’s done and you don’t want to take the relationship past this point, then it’s over.\n\nplease have a support system when this is all done.",
            "Ok, I've seen a lot of comments shitting on OP for the situation. It's true, after 3 years and you KNOWING she's waiting for a proposal you arent ready for, it makes sense for her to want to end. She wants a future and probably has an idea or plan of what that looks like and her window for achieving it might be lessening. Be understanding and honest. Tell her your mom told you before.\n\nBut I think you need to hear **this**.You dont need your girlfriend to be and feel safe. Six years of work should have given you some skills in managing your depression. Change is terrifying, but you are capable of handling it. You can have an honest, difficult conversation and come out the other side. You dont need your girlfriend to be your security blanket. You have your family as a support system, based on your recent vacation. You have your therapist. You have a good number of online resources when thoughts are overwhelming and you feel the need to hurt yourself. There are likely a few friends you have you can talk too. Most importantly, you have tools to get through difficult feelings and you ARE capable.\n\nSide note: I highly recommend looking into dialectical behavioral therapy, especially distress tolerance and the mammalian diving response. I found this most helpful dealing with intrusive thoughts.",
            "Your mental health issues are not your girlfriends or *anyone elses* problem. Your depression should not be her problem and you shouldn’t be relying on her to make you feel good and to be your security blanket. That’s not healthy, that’s codependency. She would be happier with someone who actually wants to commit to her and be a real partner to her, rather than someone who uses her for the serotonin she gives them and holds her back under the guise of comfort and security. In what way would she be benefitting by staying with you? I’ve been in the exact situation she’s in with my ex, and leaving him was the best decision I ever made because I found my husband who is a true partner to me. I’ve read through some of your comments and you’re using your depression as not only a crutch, but as an excuse to be selfish in wanting to keep other people (girlfriend) around just to make you feel better despite the fact that you know you and her would *both* be better off if you were to break up. This goes far beyond the security blanket statement and straight into the codependent territory. If I were you I would start seeing a different therapist and start treating your codependency issues so you can have healthy boundaries in the future.",
            "You both want to separate.\nYou just want the keep her around because it feels comfortable, and that's selfish.\nLet her go and be with someone who wants to be with her, give yourself the same opportunity.",
            "How should you react? Just agree with her to end the relationship. Be respectful and part ways amicably and you can both move on with your lives",
            "She's got some good advisors. By telling your mom first, she ensures thsy you get told by someone else except her...and a promise is broken to fulfill that so there's no shade on her. \n\nIf your family thinks she's a good catch, they'll talk you into being more committed.\n\nAfter 3 years she probably knows all the ways to Hack you.\n\nIf you don't make drastic changes, you'll suffer, but the most anxiety is that you might be screwed either way.",
            "For an alternate perspective, you say you’ve been thinking of breaking up and perhaps she’s picked up on that. She’s clearly invested in the relationship if she’s been waiting for a proposal and you’ve probably also demonstrated that you’re not going to propose. I don’t think she told your mom because she’s planning on breaking up with you. She thinks you’re about to break up with her",
            "If it's not gonna work either way, do cocaine and hookers 24/7 and don't be so down.",
            "[removed]",
            "Not to be an ass, but the problem is you. Either talk to her (not us) or get your life together, including therapy, or both. You don’t deserve her, but she wants this to work. If you do too, hop to it.",
            "Start therapy now. Go once a week. Will help with the transition.",
            "Hi there. I bet you're freaking out. Direct open honest communication is the way forward. If you don't see a future with her, why hold her back from someone who does? Have you talked to her about the issues that upset you, or have you just avoided conflict and allowed yourself to be unhappy and not speak up for yourself then resented your partner for your inability to communicate your needs? If you do want a future with her ??? get thee to a therapist. Solo for you, and couples with her cause you 2 are at a point where you are resorting to using other people to communicate with each other. Might as well go all the way and get a professional.",
            "The whole picture, you should let her go so she can go and plan her future. Three years is no short amount of time if there is no end in sight. Life is short. If you can't make concrete actions for a future, let her go. What she's doing is a blessing in disguise for the both of you.\n\nSomething ELSE you said is most alarming than anything else in your post: \n\n>Our sex life has been poor by my measure for months. She has been waiting for a proposal that I feel we’re nowhere near ready for.\n\nThe sex part is BAD NEWS BEARS. It doesn't get better. Sex actually mostly gets worse lol. Let this one go! Find someone you WANT to marry, you're SEXUALLY COMPATIBLE WITH, and your can get therapy and take action for your depression. \n\nYou're young, maybe you should be alone anywhere from 3 months to 2 years to work on yourself. If you find another compatible  woman in one day, take her!\n\nIt's not with this girlfriend of yours that wants to break up with you and move on. \n\nJust say, yeah I know you talked with my mom. She told me. Then talk with her about it.",
            "Find an EDM festival.  Have fun.",
            "i'm not sure what you expect from us? According to your own statement, the sex has been bad for months (have you talked to her about it?) and you are not even sure that you want a future with her... but want at best things stay same BECAUSE you have depression and you are don't wanna be  alone  with it your use her and your relationship as safe place and that is unfair to her.. because never once said you would be sad or that you still love her, you Love they way she take of YOU it all About you no thought about you being hurt or in pain over losing her...I guess she understand she is a nurse and a second mother Figur for you...",
            "It was just your turn, wish her best and go take care of yourself.",
            "Talk to her about it. No use waiting until you get home since your mom already spilled the beans right?\n\nDisregard the people judging you.\n\nJust have the talk.\n\nAnd being alone, although it feels worse at first, actually helps with your depression.",
            "Talk to her. Maybe she wants to work it out as well, but just feels distant from you.\n\nAgree on a timeline for the proposal if that matters to her. Like that you'll work on your relationship for a year, then come back to it then.\n\nThe sex is probably off bc she feels disconnected from you. Make an effort to connect with her and make her feel important. Do romantic things with her.\n\nAnd I wouldn't give up without a fight.",
            "Maybe the sex life is poor because she wants more",
            "Might be too much from me to expect a little more from a 27M? \nWhat output do you want from us by posting this? Cuddling, again? \nAren't you just upset because she 'destroyed' the rest of your trip by releasing herself from you?\nIf you don't know what you want in your life, let the one you (kinda) love get hers.",
            "Be thankful you had a good woman, she considered your best interests by asking your mom not to tell you to avoid ruining your remaining trip. That shows she has integrity in her character. It’s always hard when breaking up but maybe work on yourself. Women at this age are looking for marriage to be honest, they have different timelines than men for marriage. Women earlier than men, her next man will most likely be the one she marries and starts a family with",
            "Reading these comments, I thought I am either among some religious extremist or in a different century: in which world is marriage so important that you break up with someone after three years? In this day and age?",
            "Just end it so you both can find what you are looking for. Ignore the stupid comments basically blaming you lol. Everyone is different and it's only stupid people in society who think people have to be married and have kids or know what they want by the age you are...that's pathetic of them really",
            "It sounds like you have gotten used to her / feel secure with her due to length of time together but you aren’t doing either of you any favours by staying together if there’s no real future",
            "I also have depression and my boyfriend is such an emotional supporter of mine, very similar to how you’ve described your gf - I’ve never met someone like this before. I think this is a trait of hers that you like and that you value in a partner, and there’s no harm in that. I also don’t feel like getting married right now and neither does my bf. It’s sad that people feel that by the time you’re 27 you should be looking to get married. But if it’s her wish, then she indeed should be looking for it. Why don’t you sit down with her and have an honest conversation? Tell her what you want and hear what she wants - maybe you can both compromise a bit? Move in together before deciding to get married? Also, I wouldn’t worry so much about your sex life right now, the pandemic/lockdown has affected most peoples sex life",
            "I have to say your post title is a bait and switch OP.\n\nYou sent her on home alone with your folks and stayed on holiday by yourself for an extra week.\n\nI bet she said that to your mum because she thinks you are taking a week to get your shizz together then you are going to break up.\n\nTalk to one another.",
            "Why does this get recommended to me when everyone has clearly addressed the issue?",
            "Tbh my dude, as someone that came out of a 6 year relationship that took me completely by surprise - being on your own is possibly the best thing you could have happen to you. You're not happy, intimacy is important, and at least for me, my last relationship petered out to basically minimal sex. Being by yourself will give you clarity and what you really want when you're on your own. I'm in another relationship now, and I can tell you I 110% needed that time to grow on my own. I'm more assured of myself and I know what I need to be me now, and I also know what it means to BE me. \n\nYou'll do whatever you feel is best, but take it as a blessing. Being single, living alone and grabbing your independence with both hands is something no one can gift you. You don't need anyone else in your life to tell you who you are, you can only figure that out by being by yourself.",
            "Just come home and organize your life, minus her. Done deal. Simple as."
        ]
    },
    {
        "post_id": "4svab9",
        "author": "housethrow9",
        "title": "UPDATE: My husband [34M] bought a house without telling me [27F] and now expects us to live in it.",
        "url": "https://www.reddit.com/r/relationships/comments/4svab9/update_my_husband_34m_bought_a_house_without/",
        "score": 2275,
        "num_comments": 325,
        "created_utc": 1468526453.0,
        "selftext": "[Orignal Post](https://www.reddit.com/r/relationships/comments/4sl27b/my_husband_34m_bought_a_house_without_telling_me/)\n\nI have what I consider to be a pretty happy update, but considering how many people would calling for me to divorce my husband in the last post, maybe you guys won't feel the same. \n\nWe sat down and had long talk last night and again this morning.\nI told my husband, in no uncertain terms, that this had been a huge breach of trust and I was in no way happy with the fact that he bought this house. I had called my parents before and figured out how much it cost them to renovate a lot of the rooms in their house, as well as how long they estimated it took. I showed him those numbers and I could tell that that made it really sink in just how much work he had signed himself up for.\n\nAll of this finally sobered him up and he apologized for doing this. He said he understands why I didn't want it, and he understood that I wanted no part in the renovations, but he still loves this house and thinks he can renovate it to the point that I will love it, too. And to be fair to him, the house does have nice bones. It's in a good area, and the idea of being able to hand-pick everything and change a few things around to exactly what we want does appeal to me a *little* bit. So I agreed to keep the house.\n\nWith that decision, though, comes the condition that he will be doing *all* the renovations by himself. It will come from his pocket, he will do all the work, deal with hiring any contractors needed, everything. We agreed on a few major things that need to be done by the end of this year to make the house livable without it being a total construction zone. The only involvement I will have in the renovations will be input on paint colors, flooring, and fixtures. If he has the major projects we agreed on done by the end of the year, we will move in and I have agreed that I will help a little, but the house will not take up all of our free time. As soon as it does, I am done. \n\nIn the meantime, we will be keeping the apartment. That is where we'll be living for the rest of this year. We agreed on a maximum amount that either of us can spend without consulting the other person. He has agreed to go to marital counseling with me so that we can figure out a better way to communicate so that this never happens again.\n\nAll in all, I'm pretty happy with it. I'm still kind of pissed at him and won't be lovey-dovey for a quite a while, but I can be in the same room as him without wanting to snap his head off. He's still my husband and I still love him. Hopefully in 20 years this will just be something that makes me roll my eyes when I remember it. I'm not looking forward to the coming months of renovations, but I'm glad that I don't have to be a part of it. He can spend his weekends ripping up carpet and insulating walls. I'll be in the San Juan Islands whale-watching and getting drunk on vineyard tours. \n\nThanks to everyone for your help.\n\n\n   \n**tl;dr**: We're keeping the house and have some new \"rules\" to assure that this doesn't happen again. Not looking forward to renovations, but I don't have to do any of it so I think this is the best compromise. ",
        "permalink": "/r/relationships/comments/4svab9/update_my_husband_34m_bought_a_house_without/",
        "comments": [
            "Good for you. \n\nMy dad actually did something like this to my step-mom about ten years ago and bought a terribly gross and destroyed foreclosed home for dirt cheap on a ton of land without consulting her at all. Now, she jokes about how she nearly left him, or killed him, over that decision, and the house is beautiful and exactly what they want. \n\nI wish you the best of luck in the future, and hope you'll be able to eventually joke about it too! ",
            "good for you.  Hopefully you end up with a house that you both love.",
            "One positive note to your compromise is that it is much faster and easier to renovate a house with no one living in it.  But it does take a great deal of time as you know.",
            "If you're happy (and being treated well) that's what matters.  Good luck, and please invite me on your San Juan vineyard tours.  That sounds amazing and we can talk about our husbands.",
            "So, *was* u/throwthehouseather your husband? ",
            "Just remember, you're giving him an opportunity to prove himself and undo his fuckup, not a new get out of fuckup free cards.",
            "> I'm still kind of pissed at him and won't be lovey-dovey for a quite a while, but I can be in the same room as him without wanting to snap his head off. He's still my husband and I still love him.\n\nThis is a real marriage. It's not all sunshine and roses, but if you can weather the storms it will last.",
            "If you're in the Seattle area I can see the urge to buy a house as soon as you can. Everyone keeps saying housing prices are just getting higher, it's really stressful to someone who is starting to think about buying a house, it makes him pulling the trigger quickly a little more understandable. ",
            "I feel like you're definitively going to be guilt tripped into more work than you want to do ",
            "You'd better pray he's not the type of person to be satisfied with living in a pile of unmounted drywall, exposed wires, and naked support beams.",
            "He probably watcehd the office and thought you could be like jim and pam",
            "You know he won't be doing it all on his own don't you?",
            "girl.........he won't be doing all the work himself. he won't be paying for it all himself. this is like when a mom gets her kids a puppy because 'they will be taking care of it!!' and shes the one walking it in the pouring rain.\n\ngood luck i guess",
            "Did you see my last comment about pre-1980s houses sliding off their foundations during earthquakes? I hope \"seismic retrofit\" is on your ASAP to-do list. The Seattle Office of Emergency Management maintains a list of structural engineers who are certified to retrofit houses not bolted to their foundations. This is NOT work that can be DIY'd for legal and safety reasons. \n\nYou also need to make a budget so that you're each contributing equally to non-house expenses, otherwise you're subsidizing this boondoggle. \n\nIf you can ensure the house is both livable and structurally sound (even in an earthquake, which this region is prone to) AND that you're not financially subsidizing this mess of projects, then go ahead and stay. But frankly I doubt either of these conditions can reasonably be met before the end of the year. That said, I wish you both the absolute best of luck & welcome to the neighborhood! ",
            "Honestly I'm happy you didn't listen to the people that always jump to \"leave him/her\". Relationships aren't perfect and marriage sure as hell isn't either.\n\nI'm sure you'll end up loving the home down the road, it really seems like he had good intentions even if he wanted it to be a surprise. Even if he betrayed your trust and let you down by buying that house just think of the future and how perfect you can make the home for you twos future. \n\nOoh! I say you guys should take pictures once a month to document the changes and then you should give another update when it's done, I'd love to see how bad it is now and how beautiful it will end up.",
            "If you're happy with the compromise you've reached, then you're happy. I think counseling is an extremely important idea, however.",
            ">It will come from his pocket.\n\nSo presumably if/when it sells you'll want no part of any proffits?",
            "I'm surprised the biggest issue for you is the renovation aspect, and not the fact that your husband would make such a huge unilateral decision. And it payed of for him, because you have so far proven him right in doing it. I can just imagine a year or two down the line when the house starts to look nice and you get emotionally invested. That will be the final proof to him that it is ok for him to make decisions like this without you, he won't really need to consider your opinion or give you a say in mayor decisions, because you'll come around to his way of thinking. Just as it happened when he BOUGHT A HOUSE WITHOUT TELLING YOU.\n\nI wish you the best of luck, but frankly I have my doubts.",
            "Am I the only one who thinks of Jim from the office doing this with his L parents house?",
            "Good on you both for sitting down and working it out instead of just giving up and divorcing!",
            "Can we get an update in two years time please OP?",
            "[deleted]",
            "Glad you came to an agreement. \n\nThe divorce comment is what you get in this sub. There are always people calling for divorce. You could post about your SO eating the last ice cream. And some asshole on here will go \"he completely disrespected you and the relationship and doesn't give a shit about your feelings, you should divorce him.\" But oh well.\n\nIn happy for you",
            "The people in r/relationships have a very itchy \"dump the guy/girl\" trigger finger.",
            "Wow that is messed up. Glad you came to terms, and are taking the most of it, I guess. As you gear up for the major renovation, I must recommend that you get a copy of The Money Pit - an 80's movie wih Tom Hanks and Shelley Long - and watch it before, during, and afterward. ",
            "So does your husband have residential construction experience? I'm experienced in plumbing, electrical, HVAC, as in that's been my living for 10 years. I've also done bathroom remodels, tile work etc. \n\nI mean, it sounds like he didn't even have a clue on his budget for this or what would be involved(I have $20K in tools in one work vehicle) so it sounds like he has maybe watched a few HGTV/DIY shows and thought it would be cool. These things typically go one of two ways, the person with no experience spends 2 years on a 4-5month project, does a terrible job or they just don't get it done at all. The better outcome is that they realize a month in they have no clue what they are doing and that watching YouTube videos is not actually the same as using an experienced contractor and they cave and hire one but since they didn't have a real budget they spend way more money then they anticipated. If he's replacing electrical panels that's supposed to be permitted and inspected, replacing HVAC permitted and inspected, new plumbing permitted and inspected. Is he moving walls, are they load bearing, does he know the difference?\n\nIt's just always sort of shocking to me how people have arrived at this idea that they can just do a full remodel with no experience, if you've ever watched Holmes on Homes when he goes in and finds just a total botch job or a partially finished job from a long time ago and makes it all right, that's how these often turn out.",
            "If you leave all the work to him, even though he's consented, probably under duress from trying to get out of the dog house from buying the damn thing, he might resent you for it. \n\nIf he picked the house paid, for all the work as well as doing the what he can himself, he'll see it as his home. \n\nYes your husband fucked up, but contrary to the theme on this sub I dont think divorce him is the answer. \n\nMarriage is a team game, he fucked up and went solo but saying it's his mistake alone is you stepping away from the team, don't make his mistake.\n",
            ">I'm not looking forward to the coming months of renovations, but I'm glad that I don't have to be a part of it. He can spend his weekends ripping up carpet and insulating walls. I'll be in the San Juan Islands whale-watching and getting drunk on vineyard tours. \n\nI know you said that you'd help with a little bit of the work, but be careful that your compromise doesn't drive a wedge into your relationship. Your husband may begin to resent you if you're out enjoying life on the weekends and he's stuck inside fixing up the house with his own time and money. It's one thing for him to verbally compromise and say he'll do all the work, but his feelings may change once he realizes the full consequences of his actions.",
            "My husband and I consult each other on all purchases over $100. Good luck with everything.\n\nOn a different note, I love Seattle and am planning on moving there next year, so congrats on the move and have loads of fun exploring!\n ",
            "Cool, so he pretty much gets to do what he wants with very little input from you. Sounds like he got what he wanted ",
            "But wouldn't you like to buy a house that you picked out?\n\n\nI didn't see you address the question in your OP about how long his deception had been going on. As that poster mentioned, you can't just buy a house. He knew you would object, so he hid all of the meetings with the bank, home inspector, and realtor as he waited for the deal to go through. You weren't respected enough to be told anything. He knew you'd acquiesce.\n\n\nBetween your first and your second post, I think all you have done is added a layer of denial. You will end up knee deep in that mess with him. You will absolutely be doing renovations, agonizing over decisions with him...all of it. You say:\n\n\"I'm not gonna roll over and let him force me in to something I hate and never signed up for just because he thinks it's a good idea.\"\n\nHow is that not exactly what you've done? Sure, you have an apt for a year, but you've only delayed the inevitable, and his plan moves forward.",
            "Good job in reaching an adult compromise. Good luck on restoring the house! Hope some day you two will be able to make it a home. ",
            "Where does one get these husbands whose major fuckups are \"buys house\" and not \"caught making out with cousin\"?\n\nDammit.",
            "> but the house will not take up all of our free time. As soon as it does, I am done.\n\nheh",
            "Good luck - you're going to need it.",
            "As far as getting drunk on vineyard yours, if you're in Washington (which I'm assuming you are), I recommend a weekend out to Woodinville Wine Country. An excellent number of great wineries all within walking distance of each other. ",
            "Does this house have shag carpet and a clown picture that is necessary to the foundation of the house? ",
            "So many rude responses :/\n  I am glad you COMMUNICATED more with your husband, and that you came to an acceptable ultimatum. \n\n  Don't listen to the negative ones, its your marriage and you are handling it well. Good luck :)",
            "See you again in a year when he makes another decision without you.\n\nHe got exactly what he wanted 100% and you got nothing you wanted.  He's good at this.",
            "Atleast he sobered up and apologized!\n\nHope everything else goes to plan",
            "I'm glad you've come to some kind of understanding.  It obviously isn't ideal but your last topic was basically a no win scenario - he'd bought the house and was dead set on keeping it, and you were massively betrayed and also hated the idea of the house.   It's certainly a difficult road ahead still but I think you've made the best you possibly could without ending the relationship over this.\n\nGood luck!",
            "> I showed him those numbers and I could tell that that made it really sink in just how much work he had signed himself up for.\n\nHalleluja! \n\nSeriously, though, I'm glad he finally listened and you both found a way to work on this.\nBeet wishes for your marriage and new house",
            "Welcome to the PNW - I'm so glad this worked out for you. Sounds like you have a wonderful relationship and a loveable dumbass of a hubby (me too!)",
            "This is working it out, and it seems a fair compromise. Sometimes good people do stupid things. My mom told my dad she wanted a compact car. He bought her this giant sedan he got a good deal on without consulting her. She hated it. But she loved him and so they worked it out. Turns out part of his dislike of a small car was she'd had a wreck in a small car--why they were looking for a new car anyway--and he didn't like the fact she was hurt last time. It wasn't her fault, a drug addled fool hit her, but she was hurt. In his mind small car equaled hurt wife. Buying her a massive sedan was high-handed, stubborn, controlling, and also weirdly loving. Part of staying married is working it out--good job OP. I think your deal is good and holds him accountable for his choice. ",
            "you sound like a smart level headed person. but i still think he got off way too easy waaaaay too fast for such a huge fuck up. he basically got his way in just 24 hours.",
            "I think you handled that as well as could be, and he seems to have responded suitably\n\nWow, as success!",
            "This is probably the best outcome that could be expected.  I would expect that your husband will be all gung ho about fixing things for the first few weeks, then it will start to wear on him, and he may grow resentful that he is spending his weekend doing chores while you are having fun.  Just gently remind him that he made this decision and now has to live with the consequences.  Your marriage certainly is going to be tested by this, but maybe you can make it work.  Good luck!",
            "How does a couple without a lot of money have the ability to maintain two homes?",
            "As someone who just hit the 24 year mark.... There will be a lot of those... But you found the key to getting to the 20 year mark... Working through it. Marriage is the hardest job I ever had..and the only one I truly loved. Good luck with the house.",
            "Sounds like the best compromise in the situation.  I'm glad you can stay in your apartment and not have to live in reno hell.  I hope it turns out a gorgeous home in the end, and you're both happy!",
            "I mean, how's about this. I read both your posts. I understand that you don't want the house. Instead of bearing with the house -- Fix it up, and sell it? \n\nI understand the breach of trust when it comes to both of you making decisions, both of you doing things together -- Although if it's a business venture, and it's his business (buying and selling the house) he doesn't need your permission to do so. If I had to consult my girlfriend / SO on every investment I made, whether it panned out or didn't pan out things wouldn't get done. She's more conservative than I am when I comes to finances. Thus we have joint / separate accounts when it comes down to it. I make a lot more than her on the books, and if we merged our finances together it wouldn't be fair for me. And to the feminists on reddit, it's not that I think since she makes less than me she's less of a person -- It's that on paper, I work my ass off. 90 - 100 hours per week, run multiple companies if I want a toy, I'm getting it (it's THAT simple). We meet our obligations, I take her out and treat her extremely well. Same goes for her, she wants a pair of thousand dollar Christian Louboutins who the hell am I to say anything against it as long as our savings, finances, and obligations are met (Expenses and Savings for future)\n\nIn my opinion if it's not the \"house of your dreams\" don't live in it! Tell him that he should fix it up, put his hard work, sweat, tears into making it a profitable solution. Hell, you guys probably make a pretty penny out of the deal. \n\nMake light out of a bad situation? And then maybe next time, when he decides to buy a house he'll consult you first. Especially if he wants his queen to live in it. ",
            "Excellent compromise :) ",
            "I love how 95% of /relationships told her to instantly leave her husband and that this is pretty much unforgivable and all of you just did a 180 and ate happy this worked out for her.  \n\nHoly shit balls I cannot take you serious anymore.",
            "Honestly it could be a lot worse... if you hadn't had the experience with a fixer upper in your past, you might have signed on the help with the renovations, gotten sucked into the whole fantasy.  And that is a misery from the 9th level of hell if you don't absolutely love that kind of work and you end up fighting with your spouse about who is gonna do what.  This way, your position is totally clear from the start.  ",
            "I'm proud of you. \n\nYou didn't jump to the divorce idea, like so many do these days. \n\nYou sat down and had an adult talk, found logic and compromise as well as a plan for future issues. \n\nVirtual high five chick. #adulting",
            "I think this sounds like a great compromise! I'm excited for your adventure, good luck!",
            "I am so impressed with this compromise. This seems like a great way to let him have his dream, but more grounded in reality, while ensuring you don't have to live your nightmare. The counselling is also a great idea, and that neutral third party is sure to be valuable if any stress comes out of the compromise.",
            "Looking forward to an update in 3 years when you regret agreeing to this.\n\nSeriously, though, hope it turns out fine for both of you.",
            "This how adults handle things. Good job.",
            "Look at the other threads here, do you see any other couples where one person does the entire task and the other does nothing? You will get pulled into this with labor or money and since you agreed, you will have no recourse. Also you did not address the initial situation of breach of trust. You just focused on logistics. Logistics are easy! logistics are concrete! Emotion are not. ",
            "This will be down voted to hell, but I think you did the right thing OP. People on here tend to jump on the \"end the relationship\" train on this subreddit really, really fast. ",
            "If you guys are married, then there is no \"his\" money. The money that he will be spending to renovate the house is money that you two otherwise would have been able to save for something else. Also if he is doing all the work renovating the house, when do you expect to ever be able to see him?",
            "So he has to do all the work and front the bill for all the material while you get to pick out \"paint colours\"? \nIf you want nothing to do with the house except to live in it once all the hard work and expense is taken care of that isn't exactly fair to your husband.  It's kinda like if you don't pay into the office lottery tickets on Friday, then finding out they won on Saturday, then throwing in your 5 dollars on Monday expecting to share in the winnings. \n\nIf thays the way you honestly feel and don't want to to be part of the journey, you should sign a post nuptial with your husband giving him the house. I get your frustration over his actions, but now he is getting a shit end of the stick.\n\nAfter the renos are done it might be your dream house, but you wouldn't have contributed to it",
            "Yea I don't think he'll be able to hold up his end of the bargain. ",
            "Don't worry too much about the people wanting you to get a divorce. I love this sub, but the default response to ANYTHING on here appears to be screaming \"BREAK UP GET A DIVORCE  AND **DESTROY ALL THAT THEY HOLD DEAR.**\n\nA little hyperbole, obviously, but yeah. Good luck!",
            "Good luck with everything, I hope you'll end up with a wonderful home that you both love!",
            "Good for you! I'm glad you two talked and came t0 an agreement. ",
            "[deleted]",
            "The people who suggested to divorce your husband are insane.",
            "[deleted]",
            "Some of my aunts and uncles have stories about way back early in their marriage, where my aunt laughs and mentions that they almost broke up over \"that\". I really hope your husband sticks to his word and learns from this, and that you two will be OK. ",
            "Happy for you! After 7 years with my husband, this is how we resolve our differences as well: like adults who respect each other's autonomy.",
            "I thought I'd have to wait a while for an update on this!\n\nHappy for you that you came to a compromise and he finally understood the scale of his fudge up!\n\nI wish you the best going forward!\n\nPs. If you decide to do a blog with updates of the renovation I think it would be interesting to see how he gets on, plus it may help give you a way to release feelings about it while enjoying him struggle but hopefully come out ok in the end!",
            "Maybe put him in direct contact with your parents and they can walk him through some of the issues involved. I mean they like renovation, right? They can walk around that money pit with him tut tutting and talking about the details and you can explore the neighborhood.",
            ">The only involvement I will have in the renovations will be input on paint colors, flooring, and fixtures.\n\nDude, don't give him the kitchen! Do that design at least",
            "I think this is a great update and I'm glad you were able to come to an agreement that saves the marriage.  \n\nPlease stick to your guns, though.  Don't let him go back on anything he agreed to - you agreeing to keep the house is a HUGE concession on your part.  Don't let him say you're being inflexible later because you won't help with X. It sounds like you have it in writing? but if you don't, please do so there's no room for confusion.  I hope everything works out for you two.",
            "I still don't know how he bought the house without telling you. That typically requires both spouses to sign.",
            "My buddies wife wants to buy a house and start a family and he told her to get what she wants and he will sign a contract that he will not take it from her in the event of a divorce.  He is happy for her to pick her dream home with HER life savings, sacrifice and hard work.\n\nIn short she has savings and he has none.  She has future income and he has none.  He can barely hold up his half of the rent right now.  \n\nThis is one of my best friends and he was the party boy that traveled and got on art degree.  He and his awesome wife live in a cheap apartment near her work downtown.  She slaved away got an JD / MBA from a top school and worked as a slave for many years saving every dollar.  \n\nReading this post to them, none of us can understand why he should not support her in what ever she does with her money and lifetime savings and guarantee in writing that he will not try to steal her house in the future?",
            "Just make sure you stick to your guns on these \"rules\". Glad it's resolved but this is still a huge breach of trust and if in a year when moving in time comes and things aren't as you want them, then it's not better than the initial breach of trust because he failed to agree to the terms that allowed you to forgive him.\n\nStick to your guns and hopefully it'll work out.",
            "Start binge watching Fixer Upper on Netflix. Get ideas. Profit.",
            "Good for you.  Please hold him to the commitments he made, and don't cave if he tries to change the deal or make excuses.  Good luck to you.",
            "[deleted]",
            "oh whew, that says house, not horse..",
            "Good on you!\n\nIt's important to note, that even if he did make this massive financial fuckup, his intentions were good. I hope that you have a happy marriage from here on out.",
            "The guy has no idea what he did.\n\nHe will be living in a constant reminder of his fuck up forever.\n\nNot like you'll bring it up at random times for THE NEXT THIRTY YEARS, no?",
            "Just a question: Why wouldn't you want to do renovations with him? It would be a nice activity to do together and accomplish together. Just a thought. In any case, glad y'all came up with some sort of good resolution. \n\nEDIT: I know what you said about how you grew up in a fixer upper and all that. But that's even better; you can use your previous experience to help him come up with what projects should be done first and what not. Also, more often than not, if you do it well, the amount you put in can add more value and eclipse what you put into it. ",
            "[removed]",
            "If he paid for the house, renovates and pays everything by himself isn't it *his* house and his alone? Would you pay him rent?",
            "[removed]",
            "So if he fixes the house up all by himself and that neighborhood becomes hot and he sells the house at a fabulous profit, he doesn't have to share a DIME of it with you, right?",
            "While he fucked up, this  \n  \n> the condition that he will be doing all the renovations by himself. It will come from his pocket, he will do all the work, deal with hiring any contractors needed, everything  \n  \n...seems harsh and overkill. Yes he shouldn't have bought it, but now you are actually telling him deal with it on your own? And what is this about 'his pocket', are your finances not common?  \nIt seems as if your attitude is \"handle your shit by yourself, and when you turn it into something nice with my input but not my help, *then* I might stop being angry at you\".  \nNot exactly a good team spirit...",
            "[removed]",
            "Well that's a relatively happy update. But uhm... what about events? What takes precedence? I suspect there will be collision between weekends where he wants to work on the house and you wanting to do events?\n\n",
            "I hope you have this all in writing so when you two get divorced your husband can keep his house.",
            "Honestly if my wife bought a house and did not need any money from me or to sign anything, I could not be happier no matter what that place looked like.\n\nGo Hawks",
            "So you get to dictate what you want but actually do nothing to help? And you think that's fair? You two dad need a professional",
            "Good outcome. Honestly you've shown more maturity in this post than your last one. Well done. :-)",
            "I think this solution will end up in divorce. Guy does all the work but in the end OP will be happy with a house without putting any work into it but still deciding the decoration and such.",
            "Wow, you're both wrong. Your husband for making such a huge decision without consulting you. You for actually refusing to help patch/fix that place up because you've had to do *so* much in your parents' house when you were little. Wow, just wow. So while he's busting his ass off making a nice house, you'll *be in the San Juan Islands whale-watching and getting drunk on vineyard tours*. I'm glad my girlfriend and I are on the same page and she's working as hard as I am to make it a beautiful home.",
            "[removed]",
            "I wonder if his asking himself what he sign up for(the marriage). The idea of working together is not really in your relationship. ",
            "Did your husband post a thread here? Because someone did.",
            "I dont hear any cooking....",
            "[deleted]",
            "[removed]"
        ]
    },
    {
        "post_id": "3po6ug",
        "author": "Teacherthrowaway1313",
        "title": "[UPDATE] Teacher [40sF] called me[19F] out in front of the class, asking if I am an adult and making me admit I don't have $10 to spend on school supplies",
        "url": "https://www.reddit.com/r/relationships/comments/3po6ug/update_teacher_40sf_called_me19f_out_in_front_of/",
        "score": 2281,
        "num_comments": 341,
        "created_utc": 1445454837.0,
        "selftext": "Original: https://www.reddit.com/r/relationships/comments/3pipnj/teacher_40sf_called_me19f_out_in_front_of_the/\n\nOkay. I had no idea so many people would care so much about clay, I thought I would get like two comments. This really blew up. Thank you to everyone who commented, to all the people who told me how the process works, and for all of the general tips regarding clay, student financial aid, and general finances. A lot of people took time to read my stupid ramblings and type up a reply. I'm grateful. \n\nI also want to thank every single one of you who offered to buy me clay. You are all the kindest, most generous people ever. I just wouldn't feel right taking money to buy clay, when I don't even enjoy the medium. I also will go into more details below, but I'm not going to be taking the class anymore. \n\nTo all of you who agreed with Mary and said that I'm not an adult because:\n\n1. I don't have $10\n2. I wasn't prepared coming to class (Gosh, if only I was psychic and knew my clay hardened)\n3. I cried when someone yelled at me for not having money\n4. I'm lying about not having any money, and I just wanted to be a bitch to my teacher\n\nI would like to say that I'm glad none of you has ever been in this situation before. I put it clearly in my post (and my replies) that I didn't have $10 that day. I have money now! Fiance got paid, we're fluuuuuuuuuush with cash! I mean not really, but still. We're good! If I wanted to buy a shit ton of clay right now, I could. It just so happened that I ran out of money after paying the bills in the middle of the month, and I didn't see how it was a big deal because I wasn't expecting any purchases. It was probably a period of 3 or 4 days where I was OUT of money, and at that point it's easy to just hold out until one of us gets paid. I have an apartment, a computer, my bills are paid and I have food. I would say I am adulting, just by definition. For everyone telling me I need to sort that out, I AM. FFS I AM. Fiance got a better job, I'm looking for a better job. I KNOW I'M NOT IN THE BEST SITUATION, I'M WORKING TO FIX IT. JEEZ. \n\nFor the clay, I stored it in my locker the entire semester with no problems so far. The outside would maybe be a little stiff, but being new to clay (at least, new to fancy high-fire sculpting clay), I thought it was normal. I would just spray it and squish it until it was manageable. This was the first time the entire block felt like a rock, and I couldn't move much of the clay. I didn't know what the procedure was here, so to all of you saying that it's easy to google and find out, guess who doesn't like phones in her class? Also, why would I google it when I have a supposed clay expert two feet from me? I picked up my bag, felt the clay, and asked Mary for help because my clay was hard. That was it. I didn't say, \"Mary. My clay is ruined. Get me new clay or I'm not participating in your stupid class.\" I also wasn't taking her away from her lesson, because she had just finished demonstrating something. People were picking up their clay and getting started on the assignment, so I wasn't taking her away from my other classmates and I certainly wasn't disturbing anyone. According to many of the ceramicists(?) here on reddit, hard clay is an easy fix. She could have showed me how to fix the clay. She could have TOLD me how to fix the clay, and left me to do it on my own. She could have told me that without clay, I can't participate and my grade will be docked. She could have simply said, \"Can you go get more clay?\" And I would have probably said \"Not today, but if you want I can model for my partner today and I'll have clay on Thursday.\"\n\nSo on to the update. I spoke to my other trusted teacher, who happens to be the chair of my major's department. I came up to him and said, \"I know it's not YOUR department, but as a department chair, I was wondering if I could get your advice. It's about a teacher.\" And he just gestured me outside to where we could talk. At first I tried to be vague, and not single out who the teacher was since it's not his department, but I was struggling with what I was trying to say. He asked me to tell him who it was and what happened, so I did. I teared up a little bit, felt stupid, but he totally validated my feelings. He said she was unprofessional and classless, that she should NOT have done what she did. He said I confirmed what he already thought of the teacher. He also told me (he used to go to school for ceramics) that she is not even using the right clay for figure sculpture. She's using ceramics clay, and it isn't necessary or easy when it comes to sculpting people.\n\nI asked what I should do, because it's his certificate I'm taking the class for. He told me we would find some other alternative for those credits, or I could wait it out until the department takes the class from her and gives it to someone who deserves it. He advised that I should drop the class, because as a teacher, you start to be in danger when your enrollment drops. You get looked at, you get questioned, evaluated. He basically said, fuck her. If she's going to be that unstable and treat me like that, she doesn't deserve to have me in her classroom. She thinks she's teaching us some big life lesson when she gets mad about a late student, or when she yells at us about having hard clay, but she forgets where she is. A community college. We're there to learn, to try and better ourselves, and we're doing it despite being in a worse-off financial position. I shouldn't let someone like her discourage me from getting a certificate or a degree. So I asked if a complaint would make any sort of difference, and he just said it wouldn't. Unless there are a thousand complaints, then nothing will be done. Her file will be flagged, but unless it's a pattern, then she won't be fired. Being new to the class, however, might get through enough to where they take the class from her. He also told me that if he hears any other student having problems with her class like this, he will take it off of his certificate and replace it with something else. This would hurt her, because over half of those students were in there because of the same certificate I was. \n\nWhen I got home, I got an email from her. It said: \n\n\"Teacherthrowaway1313\n\nI am so sorry if I embarrassed you in front of the class. Please accept my apology\"\n\nHeartfelt, right?\n\nSo basically I'm writing a letter to the dean and dropping the class. I know a lot of you said how it would be cowardly of me, how I should walk back in with my head held high, and pretend that she can't hurt me, but this was the final straw. I was not learning anything from her class. When it started, I was really excited to learn how to work in clay and how to make little sculptures, to learn about more sculptors and their techniques, and none of that has happened. The only reason I was there was a certificate, and if I don't have to go back, I don't want to waste my time on her. I can spend my time focusing on my other classes and looking for a better job ;) I've been working on standing up for myself more (my roommate's friends wanted to crash on my couch for a few days, which of course turned into wanting to stay for a few months, and I shut that down before he was even done talking. Set boundaries, set expectations. Felt like a bitch, but a boss ass bitch). You win some, you lose some. Next time someone starts to yell in my face, hopefully I won't turn red and stutter apologies. Let them know it's not okay to talk to me like that, and give them a chance to correct themselves. But this time, I feel better just leaving it behind me. Thanks for your help, /r/relationships, you guys are cool :)\n\nTLDR: Writing a letter to the dean, dropping the class. Finding alternative credits for my certificate, don't have to deal with Ms. Crazypants anymore. Also, am now flush with cash. ",
        "permalink": "/r/relationships/comments/3po6ug/update_teacher_40sf_called_me19f_out_in_front_of/",
        "comments": [
            "don't forget about ratemyprofessors.com  she may be on there (or you can add her).  I always think its good to leave a review in situations like this.  It has the potential to help other future students.",
            "Also to the people giving you shit about \"just get a better job\" like, no shit. I've been there before and had that said to me. Like \"Oh, why didn't I think of that. Hello, good job factory? One please.\"\n\nIf you've never gone through a rough patch where you've been literally actually out of money then shut up. I had a week once where I slowly ate a jar of pralines until payday so I could buy food. If I could have gotten a better job at the time I would have. ",
            "Jesus Christ, fuck those people who can’t take something like this at face value and believe that a shitty college teacher bullying a student for no good reason is soooooo beyond the realm of possibilities. I’m sorry you even had to go through an explanation about that, and that you felt the need to explain your temporary poorness (you didn’t have to). \n\nGood luck, as long as you’re getting your certificate that’s all that should matter. \n",
            ">So basically I'm writing a letter to the dean and dropping the class.\n\nThis is the right course of action. \n\nMy cousin had a similar situation, but the teacher was a larger asshole. Had a bad test and went to ask him for help/review since she still didn't understand it. He told her \"If I ever did as bad as you are doing in my class, I'd kill myself\". She went to the President in tears and told him what had happened. \n\nGuess which professor was the first professor at the university to lose their tenure. It probably didn't help that he was one of the professors that had, years before, campaigned to keep the school male only. ",
            "Good update!\n\nBTW her \"apology\" sucked as hard as her classroom decorum.",
            ">He advised that I should drop the class, because as a teacher, you start to be in danger when your enrollment drops. You get looked at, you get questioned, evaluated. \n\nvs.\n\n>So I asked if a complaint would make any sort of difference, and he just said it wouldn't. Unless there are a thousand complaints, then nothing will be done. Her file will be flagged, but unless it's a pattern, then she won't be fired. \n\nDoes not compute. One student dropping her class will not make any difference either--the assumption will be that the problem was with you (you signed up for too many courses, you were just really bad at figure sculpting or didn't like it) and not with her. I mean, file a complaint or don't file a complaint, but this advice makes no logical sense to me. ",
            "Uh, don't listen to those other people.  She is providing a service.  Just like an employee at a store.  You expect good service and don't like being treated less than human.  A college's image is based on having good student/teacher relations.  She is damaging that and to boot, she isn't even teaching you with the right equipment (Wrong clay which is an amateur mistake, googled it and got the answer in 2 minutes but a teacher couldn't figure it out?)\n\nWrite that letter, make it a fact specific letter and leave emotion out of it, UNLESS you are talking about how it made you feel.  Keep it like a woman's skirt, long enough to cover the good parts but short enough to keep them looking.  \n\nWish you luck and I hope you can update us on a solid ending.  I would put in a good letter for the professor who is helping you out.  Whether it is a review on a professor rating website or a letter to the Dean letting them know how amazing this teacher was and how much they helped you.  Just a thought.",
            "I'm a community college professor.  I remember one of my first years a student mentioned they couldn't afford the book.  We stayed after class and found a weird edition of the book on goodwillbooks.com for 1 cent.  She was super excited, she could finally afford a book. Then I mention the 3 dollar shipping.  At that moment I realized the extent of the obstacles my students faced.  \n\nI ended up calling the publisher and requested an instructor edition and gave her mine in the meantime.  \n\nStay in school.  Eventually you will get a better job.  ",
            "Wow-really surprised you had to come back and explain a lot of this stuff.  I've been in your shoes (both related to not having spare cash to use, and having chump teachers like this).  It feels awful.\n\nSounds like you've done everything you can-going to a higher up you feel like you can trust is nearly always the best solution.  I always felt like I could trust my advisers, department heads, deans, etc.  They always listened when I had a problem and did what they could, even if the \"best\" they could offer was \"I know it sucks, but just stick it out, don't take it personally, and come to me if it gets any worse.\"  \n\n",
            "Be careful about dropping classes. My college has a policy to temporarily suspend you or just drop your GPA altogether if you drop more than one class the entire time you attend. I burned that drop out on my jerk of a chemistry teacher who didn't know jack about computers and insisted that I used a certain program, when a different program could do the exact same thing better, and save in the format that he wanted. He openly started screaming at me in class in front of other class mates. How so many people at that college liked him is beyond me. Might want to check to see how it will affect you, though I know you would love to get away from her. ",
            "I'm 18 and in college and I find it crazy that people can't seem to understand you not having $10 on you when you weren't expecting to need it. It's hard to work a full time job and be in school, some people have to pay for gas but a lot have to pay for bills and food so that's where every penny goes to. Ive had three dollars for a few days now until I get paid tomorrow",
            "I know you're probably slammed with comments right now. But I wanted to say that no matter what, the teacher acted inappropriately. Whether you had money on your or not, whether you are an adult or not, nobody deserves to be chastised in that manner. It's simply unacceptable. I'm glad to hear you're dropping the class. There is nothing good that can come of continuing with that teacher.",
            "I saw your other thread. People that called YOU out made me sick! You're an adult so that means you have every right to complain to someone bullying you, ESPECIALLY since they're a college professor. You don't need that BECAUSE you're an adult and there to learn. People can be so nasty and mean ",
            ">He also told me (he used to go to school for ceramics) that she is not even using the right clay for figure sculpture. She's using ceramics clay, and it isn't necessary or easy when it comes to sculpting people.\n\nYou know, I looked around. I'm guess you got the basic grey clay, right? That's a lot cheaper than super sculpty. That may have been why your professor chose that. I'm not positive about the type of either clay, but she may have given you a cheaper alternative for an intro class.",
            "Reddit has surprisingly few people who have suffered poverty. If anyone bad talked you because of your financial situation they are likely shitty people.",
            "I'm appalled that people made you feel the need to defend your financial situation. Those silver spoon fucks can eat dicks. It sounds like this teacher has a shitty go of things in her day to day life. People like that aren't happy.",
            "First off, *STOP EXPLAINING YOURSELF TO ASSHOLE COMMENTERS*. I mean I get it, I do. But UGH, they're not worth any more of your time. For what it's worth, I have an actual \"grown up\" / professional job. But bills are bills, and my used car is running on hopes and dreams until I get paid tomorrow. So, solidarity there I suppose.\n\n\nSecond, I'm *really* glad that your other Prof was understanding of your situation. Although the petty side of me wishes you could write an e-mail to Mary and just say, \n>\"I'm sorry to inform you that I will be dropping your class. Clearly you don't take sculpting as seriously as you should. Even a lay-person like me knows that what you've required of us is for ceramic modeling, not sculpting. So because of that, no, I didn't take your particular product recommendation seriously. How do you expect any of us to take you seriously? Bye-now\"\n\n\nAt any rate, I'm happy you have a dept chair that supports you, and that you're out of that toxic class. Yay, OP!\n\n*Edit: fixed word*",
            "Fuck all the people who called you cowardly. Dude, you pay the college to provide you with an education. If you get a scholarship, you get it because you've earned it. That's why they call it a fucking AWARD. \n\nIf the professor providing the service isn't doing so in a professional, effective, or complete manner, you ABSOLUTELY should report it, drop the class, and stop wasting your time and money. \n\nLet me tell you something. Your \"honor\" or \"manliness\" or \"bravery\" or whatever the hell people are trying to suggest you defend -- is NOT WORTH wasting your time or money on. \n\nYou could be sitting in a class with an actually qualified teacher, learning actual skills, enjoying your day. You could be doing any number of things, or purchasing any number of things that actually have value instead of being in this dumb class and spending your money. \n\nEducation is power, but lately the trend in higher education is to financially bleed people dry for a mediocre and irrelevant educational experience, saddling students with debt and launching them into the real world with little to no practical knowledge. \n\nDon't let that happen to you. The only education worth paying for is one that meets YOUR needs, standards, and expectations. \n\n",
            "Sounds like a happy ending, OP. Good job.\n\nYour teacher's attempt at an apology was as lame as I could imagine. A public humiliation deserves (at least) a public apology, and every apology should be made face-to-face whenever possible.  We don't need any more evidence of her poor social skills, though, I suppose.",
            "... You probably aren't an adult, and I don't see how that's a problem.\n\nDepending the definition one uses, Adolescence can last well into the late 20's.\n\nVery few people in university would qualify as an adult.\n\nAnd there's nothing wrong with that.  \n\nCalling someone out for being young - when they are supposed to be young - is stupid and dumb bullying.",
            "I'm glad things are working out for you, but I'm just going to add this: you must figure out an emergency cash fund.\n\nAs I said before, what would you have done if you had broken your leg that day and needed to take a taxi to the doctor? I'm not saying that you need to have cash at all times (though that is usually part of being an adult too), but you need to plan for emergencies when you need to buy something.\n\nI understand that occasionally things happen, but you really need to take steps to ensure that this won't happen again. This time it was a stupid bag of clay, but what will it be next time? Also, if it was just that you were out of cash at this particular point in time, you really shouldn't try to get by with the bare minimum. The difference between $40 and $20 is small and you sounded like you were barely scraping by with the amount of supplies you had. If you're using the library copy of a textbook, you need to deal with the scenario that it might be checked out. If you're buying the minimum amount of clay, you need to be prepared that something could happen to it or it might not be enough.",
            "> I am so sorry if\n\nIf.  \n\nYeah, fuck you lady.  \n\nI think dropping the class will be the answer she deserves to hear after that one.  ",
            "Hey I'm glad it worked out for the best. Love the Jean Ralphio reference haha. You're doing a great job at getting your life on track. Best of luck with finding a better job and with the rest of your school year!",
            "My only concern about you dropping is money--do you get any of it back at this point? If you're already struggling I would really hate to see you pay for this twice.",
            "Hey, I just want to tell you that I was once an art student who had a horrendous clay instructor.  He was a revolting turd.  A group of us complained and went up the chain.  I found out he had to go to sensitivity training or something.  Good though it probably didn't do much to change him.   \n\nAnyway, I got a masters in teaching and now teach art in an elementary school.  I can't tell you how many parents/fellow teachers tell me horrible tales about an art teacher who was cruel to them.  This makes me super pissed.  Art is such a personal thing.  Art teachers should be sensitive, thoughtful, and caring.  And any good art teacher creates that kind of atmosphere in the class.  How can people feel comfortable expressing themselves and working through problems if they are being judged and treated like a sub human?  Sadly I have had several nasty college art professors.  Remember that she has the problem not you.  I don't want to make blanket statements but there are a lot of \"art people\" who think they are the shit and then guess what?  Turns out what they have a talent for is something that's really hard to get a job in.  So they turn to teaching and they are terrible, bitter, judgmental teachers.  They might be miserable doing something they don't want to, maybe they are jealous of the talent of their students...who knows?  But I've seen it a lot.  I always wanted to be a teacher and when I was in my undergrad art program this was like \"looked down upon\" that I would WANT to become a teacher.  Looked down on by professors.  It was like they didn't think of themselves as art teachers.  Whatever.  \n\nAnyway, I just want to tell you that I am sorry you had this experience.  If I was your art teacher I would have put my arm around you, said \"don't you worry one bit!\" And I would have plenty of extra clay on hand because a good art teacher is always prepared.  And this wouldn't have been a public discussion for all to hear.  ",
            " I hate hearing people say \"just get a better job\" as if its easy, instantaneous and a new idea. Finding a better job isn't easy. I just switched jobs because I wasn't making enough money. I applied for 75 jobs in about a month and a half. I had 4 interviews. Only offered the one job (two days ago, yay!!!) I get a dollar more an hour now... In about A MONTH  I'll see the first of that pay bump. Until then, I'm going to keep running  out of money two days before payday. Things will change once my education is completed. Also, saying you're not an adult for not having $10 is absurd. My husband lost his job a few months ago. I don't make enough to support us both. Money was scarce as hell for us. And let me tell you, I've never felt like such an adult in my life. In the worst kind of way. Good luck, OP! Everything will turn around and you'll be comfortable financially soon!",
            "Sometimes instructors go on power trips. Believe it or not though, negative feedback from students does count, and if enough students drop the class and the chair removes her class from his certificate, she could be in hot water come evaluation time. This is especially true if she's not tenured. \n\nYou did the right thing. She shouldn't have gone off on you the way she did and if she doesn't watch it, she will find herself out of a job. ",
            "The point of school is to learn, and you're paying good money to do so. This teacher is clearly impeding most people's learning. Also, a teacher might have an idea as to what the rules should be, but should be flexible because not all students are the same and not all student populations are the same.  \n\nSo yeah, as a teacher myself, fuck Ms. Wrong Damn Clay. She doesn't even like teaching, apparantly. And don't take the few self-styled tough guys on here so seriously either. Anybody whose hobby is to go online and tell perfect strangers what's wrong with them has a pathetic life. ",
            "Seems like this sub had a difficult time reacting when the answer isn't *\"you have to break up with him, the relationship is already over.\"*",
            "Higher Ed teacher admin here\n\nYou did the right thing. Adult students are adults and they make choices in their lives based on their situations. There are an enormous amount of responsibilities that adult students face and financial responsibilities are a big part of that.  The choices that adult students make are their choices and sometimes it is \"do I pay the rent or do I buy the book for this class, or the clay\" or whatever.  No teacher should ever humiliate a student or even point out a student in the class in public who doesn't have the materials he or she needs.   We as teachers don't know that student's situation. \n\nI mildly and semi-jokingly scolded a student the other day for not wearing his glasses to class and sitting in the back when he can't see the board. He told me he never takes his glasses out of the house. I asked him why when he needs them outside probably more than in the house. He said they're too expensive to replace and he's afraid he's going to break them. I told him that sounded like very sound logic.  What else could I say? I'd happily buy him a new pair of glasses if he broke his wearing them to class but that's not the issue. It's that I as a professor never know what my students are facing and that i should never assume that their lack of preparedness or materials means a lack of interest or concern.  \n\nIt's not our place to judge. It's our place to educate the best we can and our students' place to learn the best they can in the way that is the most fitting for them.  I'm sorry you had such a difficult situation with your professor and I'm so glad you stood up for yourself  and that you found support from another professor. Students have rights and you are not subservient to your professors'  demands.  Please keep standing up for yourself  in your educational environment. You help yourself and your fellow students who may not have the same courage to speak up ",
            "Out of curiousity, why are you engaged when there are days you don't have $10 between the two of you? I'm not trying to be a dick, just trying to understand a different lifestyle.\n\nEdit: my girlfriend and myself find ourselves in a similar boat from time to time and its one of the main reasons marriage is off the table for now. As I said, I'm just curious. ",
            "That's really discouraging that the school doesn't take a lone complaint seriously. I would still go ahead and write to the dean- this woman's behavior was abhorrent and it's better to have a complaint on file. I'm sure this isn't the first or last time she has done this. ",
            "Alright, I guess it is my turn to be that person.\n\nThis update does not paint you in a good light. I wasn't sure in the first post but in this one you do sound immature and entitled. It's harsh, I know. But it's important to take responsibility for yourself and you do not seem to.\n\nWhat is extremely unprofessional is the conversation you claim to have had with the department chair. That is extremely unprofessional to say those things to a student about another professor. It is rude, inappropriate, out of place, and horribly disrespectful not only to the other teacher but to the school.\n\nThis thread seems to have turned into people thinking that criticizing OP means we're all hyper-elite rich folk. I went to community college too. I went there because it was all I could afford and because I needed to work full time while in school. And you know what? A lot of my experiences there weren't great. I had teachers who didn't care, who weren't professional, or who were downright rude. And I learned from those experiences which I'm afraid is not what will happen with the attitude you're using here. \n\nYou're not a victim. No one should feel bad for you. You should not feel bad for yourself. You made a mistake, someone handled it poorly, and that should have been the end of it. It did not need to turn into such a dramatic situation (leaving the room crying is very dramatic -- if you get emotional, take a while to compose yourself and return and ask to speak to the person in private to explain). The worst part of what you wrote is that you expect the other student to pay the teacher back for the clay on his/her own. You're complaining that people don't understand and help your financial situation but at the same time you're being extremely inconsiderate and doing the same thing. This other student might be in the same situation -- hell, they may even have it worse. Many of my peers at my community college were single parents living on barely-above-minimum-wage shift jobs and feeding several children. \n\nThe point of this is to say use this moment. Use this as a chance to learn a more external world view, to try to learn from other's perspectives and to grow. You can cushion yourself in the all the \"Go You!\" replies you're getting or you could admit that you played a significant role in the escalation of this situation and that you can do better. \n\nSo I was in your shoes. I went to community college, I lived paycheck to paycheck. But I have come really far since then because I learned to take responsibility for myself and stop expecting people to bend for me. Community college can be an incredible experience because you are surrounded by people who really want to succeed and yet most of them have it way worse than you. Use this to learn how to understand other's perspectives, how to appreciate what you have, and how to take responsibility for yourself. \n\nTLDR: Stop making yourself into a victim, this is what will really mess you up. Take responsibility and use this as a learning experience.",
            "Since the head of the department for your degree is on your side, and is willing to give you an alternative or just waiting to take the class, you don't really need to do this, but it may help: I think you should still go to the head of the art department and talk to him/her about this issue. They may have already have some complaints about her, and yours may help with their decision to remove her from teaching the class in the future. If you were kinda close to other people in your class that you know have problems with her too, you could see if they are willing to speak up about it as well. That is not necessary though, and not your responsibility at this point, since the department chair for your certificate is working with you.",
            "Good work. I'm glad it's turning out. I think one thing you could possibly work on is how you handle altercations. In your writings,  you seem to break down or cry or tear up a lot etc. People like your horrible teacher take advantage of these types of things, and think they can throw you around. \n\nIf you could practise being a bit more aggressive and confident over time, perhaps the next jerk person you encounter won't be able to rattle your feathers as easily. I need to work on that big time, personally.\n\nBut I'm only going off of the 2 posts you've posted. For all I know, you are normally a tough person, haha!\n\nThat apology was... hilarious.\n\nOverall, well done. You really did the right thing.",
            "I was one of the people who said don't drop the class, but if your department chair has recommended a path for you to take, do it. He clearly understands the ins and outs of your school and has your best interests at heart. \n\nGood luck with your studies. ",
            "In the future if you're this stressed you should think about not taking so many classes at one time to reduce that stress/pressure.",
            "I was once a b Ike college student and very much remember not having a dime to my name. Fuck all those people who probably have had so much given to them by their parents. ",
            "I was better off when I was in school than when I wasn't! I went to school full time, two days a week and worked the rest. I know where you're coming from. Sometimes you just don't have the money right then. I think you're doing the right thing and right on with your other professor! He sounds like a cool dude. Hopefully it all works out.",
            "Yeah I read your previous post and her response was seriously \"please accept my apology\"?? Did you, like, copy and paste that? Holy shit. Yeah, drop that shit. You don't need this, girl.",
            "Fuck the haters, good for you.  You handled this well, you're totally adulting now.\n\nIts easy for people to troll and talk shit behind a keyboard.  I've been where you are, and worse, most people have.\n\nGood on you.",
            "Ugh, screw all the people in that thread telling you you're not an adult! What kind of self-righteous prick comments with how to make sure you have more than $10? That wasn't even the issue you were posting about! \n\nStay strong, screw the haters! ",
            "How did you not know that your clay would have hardened? ",
            "I feel like a lot of people in this thread don't understand what it's like to live on a budget while in school, so definitely don't take that to heart. As someone who achieved a BFA in art from a highly ranked national art school... Fuck that professor. Introductory art classes are meant to teach students the ins and outs of a specific medium and techniques, and let them decide whether their path in art school will include further training in that medium. That professor sounds like she's got a complex about teaching an intro class, and is taking it out on you. Keep your chin up, and you followed through on the correct plan of action. Good luck in your educational career. ",
            "HI, teacher here.  Your teacher was incredibly unprofessional and an asshole.  I think there are times where I become frustrated with students for acting goofy or silly/immautre and I give a lecture about enough is enough, but I would never have said something like that.  I also understand what it is like to not have money on hand.  Did I say teacher?  Plus my husband is also a teacher and daycare is my entire paycheck. I basically get the bills paid and then suffer for 2 weeks.  But you are doing the right thing.  Mary has created a hostile environment that is not conducive to learning.  I am sorry that you went through this.  When I have taught new courses I recognize and admit when I make errors and I certainly do not hold the students responsible.  \n\nStay with your certificate, and def write the letter.",
            "Did you still end up having to pay for the class?",
            "I would definitely drop the class as well.  It doesn't sound like anyone is learning properly and thus not getting their money's worth.  And more importantly, she's harassing you (and others).  Why should you put up with that?  See if you can find something more fun for your certificate!\n\n(oh, and if I were in your situation, I'd've probably cried too.  I've had an instructor make me cry, but luckily my department head was awesome and saw me as I left the room in tears, and took care of the situation.)",
            "I didn't see your post the first time around.  It sounds like it worked out for the best.  That was seriously uncool of her.",
            "I'm glad that it worked out for you OP and I hope it gets better. I've been unemployed for a long time and will hopefully have a chance soon to go back to living check to check. Keep working at it, you can do it!",
            "Good for you. Sounds like you resolved your situation and came out on top. That's called being an adult.\n\nMy only advice to you is to put aside some of that cash you now have into an emergency fund. You never know when something will come up. You need that backup money there just in case even if you aren't expecting any expenses before your next payday. ",
            "I'm glad you're dropping the class! Her email was not a true apology.",
            "Do you happen to go to school in Hayward, CA? A lot of what you've said sounds just like my school. But trust me, you did all the right things. I've had so many teachers at my college that act like what you described, there's been a time where I was holding back tears because of how a teacher acted. I've seen kids cry in my classes. Department heads do need to be spoken to. College is supposed to be a supportive learning environment, not a place to get used to assholes. You have a job, which is responsible no matter how much it pays. Glad it all worked out! ",
            "You made the perfect course of action.",
            ">I am so sorry if I embarrassed you in front of the class\n\nAh yes, the old 'non apology' apology.  Worthless.\n\n>I know a lot of you said how it would be cowardly of me, how I should walk back in with my head held high, and pretend that she can't hurt me, but this was the final straw. I was not learning anything from her class\n\nScrew those people.  It's all good and well for them to sit at their computers and say 'make a stand', but this YOUR education.  If a teacher is ill-mannered and you're not learning anything, drop the class and don't look back.  ",
            "The teacher was out of line. I think it's good you talked to the chair of your major, and you can work out another way to get the needed credits. You shouldn't dread or dislike a class. ",
            "Great choice talking to your advisor and dropping the class.",
            "The infantilization of America continues. ",
            "I think you are handling the situation really well and are very lucky to have such a cool department head. \n\nThere's also something else I wanted to add. I am an extremely assertive person who's been described with \"subtle as a punch to the jaw\". However there have been instances where I am literally stunned into silence by someone's rudeness. Please don't feel like less of an adult for getting upset and freezing up, because you were in a ridiculous situation. ",
            "Well done on getting good advice from another teacher who has your back. That's awesome! It's good that you have other options for those credits. You did the right thing!",
            "Well done. Don't let anyone tell you otherwise.",
            "She's just saying that because she's sorry she got caught, tbh. Good on you OP. You did the right thing. I'm sorry for what you had to go through. Not all teachers are assholes.",
            "That teacher you talked to is right.  Ceramics clay does not have the properties needed to do figure sculpting, you'd use a kind of polymer clay for that, such as super sculpey which does not dry out nearly as fast since it's not water based.  Thankfully someone was there to tell you to just add water to the material you have.  \n\nGood luck!",
            "A community college is where I got a second chance at life after being ready to kill myself, so I hold it very close to my heart. I also despise teachers who undermine the purpose of community college for both academics and students. I think you did the right thing and I wish you all the success with what you set out to achieve :D",
            "Look you're young, she's a horrible teacher, you're handling your business. Please take this as advice and not criticism. Do art as your minor. Do not major in anything art related. Go do a science degree. I implore you. It's hard enough getting a job right now. Get paid from your major, use your minor as your passion.\n\nIt's so hard right and I only graduated in 2009, it's only gotten worse.",
            "First off, fuck everyone that gave you crap. I work hard on long hours and shit pay, there is usually a 3-4 day gap where I don't have a penny to my name but I have food, and gas and my bills are paid. \n\nSecond, good on you. I never understood putting your pride before your own emotional comfort and that's exactly what you avoided. \n\nGood luck on everything, OP. ",
            "Don't let these people bring you down about dropping the class. I've had to deal with teachers like that and exposing yourself to them more is not the solution. She sounds like a twat anyway and doesn't even know how to even do what she is teaching.",
            "I just finished binge watching Parks & Rec and thoroughly enjoyed this post. :)",
            "I'm glad you aren't going to subject yourself to any more of her bullying. I was told the same thing when I had a professor behaving inappropriately...filing a complaint wouldn't get him fired, and without other students filing complaints it wouldn't establish a pattern. \n\nI filed one anyway. I made it detailed and was content with being the first person to help establish a pattern for the next person who had an issue. \n\nWell, what do you know, a few years later someone did complain and my letter was pulled out as well. It helped establish a pattern, and thing snowballed after that. The dean even let me know that he appreciated me submitting the complaint. ",
            "Good job!  Yes, dropping the class (now that that's a possibility and you can still get your certificate) will ding her.  Deans watch headcounts closely.  Getting dropped from a certificate is a further step toward program doom.  \n\nBest of all, you did deal with this like a boss.  Write your letter - don't give that part up!",
            "You're at a stage of adulting that is possibly the most difficult; you're juggling classes and schoolwork (and probably a social life so you don't go crazy). I've done that before and it is hard! There are days without money, and there are days where there's more money. It happens.\n\nPeople who are giving you grief for that either have not had to experience that, or were born with a silver spoon, or they forget what it's like...which I find hard to believe. I'll never forget those struggling days when I was young, trying to make it out on my own.\n\nYou'll get there OP, and drop the class for sure. I wish I'd seen your original post, because I would have given you some slightly different advice. But I'm glad that it seems to be working out for you the way it's progressing right now.",
            "Will you be refunded for the course? I'd hate for you to lose that money because of her shitty behaviour.",
            "Do you have an email address attached to a paypal account? PM it to me. ",
            "That's **PROFESSOR** Crazypants to you!",
            "Look at you...ballin' on a budget! ;) \n\nSucks that you wasted your time with her class this semester but it's great that you don't have to deal with her anymore. And awesome that you have a good teacher that was there for you.",
            "I stand by my offer to anonymously ship her (the teacher, not OP) $200 worth of clay and tell her to shut up.\n\nEven though it wasn't exactly popular.",
            "Thanks for the update. It was more than just clay. The college system can be a difficult landscape to maneuver through and I'm happy you found your way. Good luck on your certificate! ",
            "Good to see you realised you suck at the subject and are better off just dropping out. \n\nHope you suck less at whatever you choose for \"alternative credits\" so you don't have to drop out altogether, but lets be realistic, you're going to have to stop blaming other people for your problems first.",
            "As a TA who just had to hunt down a stapler for ~20 papers that students turned in without being held together in any way I feel your teacher's pain.  I don't think that she overreacted at all because A) you having clay helps her help you and to force her to take on that responsibility too is wrong and B) It is completely reasonable to think a college student has $10, but will deny it because they care about beer more than school.  You overreacted, please don't try to damage this woman's career. ",
            "\"I am so sorry IF I embarrassed you...\"\n\nSure fucking sign that she knew exactly what the fuck she was saying.",
            "The fact that you think you are \"fluuuuuuuuuush\" with cash when you are living paycheck to paycheck is a pretty good indicator of some of the maturity issues at play here. You are not flush with cash, it seems you are just temporarily not broke, but will return to that soon. ",
            "Do you get a refund for the class when you drop it?  I thought the whole reason you were so embarrassed was because you didn't have 10 dollars because you are so financially burdened?  Now you can afford to pay for classes you can't complete because the teacher wasn't nice to you?  Sounds like the lesson you learned is that if some one is mean to you run away and tattle on them on the way out.",
            ">She thinks she's teaching us some big life lesson when she gets mad about a late student, or when she yells at us about having hard clay, but she forgets where she is. A community college.\n\nIsn't that where you are as well?",
            "[removed]",
            "Good for you, I'm really happy that you've found an ally in your other teacher.\n\nYou don't owe Mary or anyone else any satisfaction or good face by showing up again or making amends. If you wanted to finish the class that's one thing, but otherwise there's no reason at all to make life harder on yourself than it needs to be.",
            "Well done.\n\nI don't know why she's teaching at a community college when she clearly doesn't like teaching. Community colleges pay absolute shit anyway, so it's not like she's doing it for the money. Unless she just literally can't do anything else, she should be doing something else.",
            "Ugh, I don't miss the days of being a broke art student, and your story reminds me of why! Good luck with your classes :)",
            "Whoever the fuck agreed that Mary was right should get their penis cut off or vaginas sewed up, because they should not be reproducing!! ",
            "Ya think, with all this, two huge walls of text about something relatively trivial in the big scheme of things, that you really should be getting married?! ",
            "Congrats OP, get your shit handled. If you ever want to, we need driven people in Tech. Get your certs, get that money, make cool shit. Have a good one.",
            "good for you, you've done the right thing, kudos!",
            "Ha ha ha this thread is hilarious. Makes me glad I graduated long ago. \n\nTo the OP: I think you sound like you are adulting JUST FINE! I would drop the class too. That teacher sounds like a total tool. \n\nI took a philosophy class once and the first thing the professor said to us after introducing himself on the first day was that he was going to give everyone an A this semester, because we were all going to fail like anyway so why not. He was kinda kidding. He did give everyone an A as far as I can tell. But it was actually a pretty good class. \n\nTeachers, bosses, in-laws, cops, doctors, crazy people can turn up anywhere. A degree does not mean you are smart. Being smart does not mean you have common sense. \n\nSometimes the best move you can make (or the best money you can make) is to nope the fuck out of someplace. Best wishes to the OP. I'm sorry to laugh at your troubles, not laughing at you for being poor (been there, once ate nothing but Corn Nuts for 2 weeks lol) but at your stupid fucking ass excuse for a teacher. After the semester is over please send her the link to this thread lol. ",
            "Gotta be honest, I still think this could all have been avoided if you just checked your clay stash before class and made arrangements if you couldn't show up with the required materials.\n\nYour teacher is probably having a nervous breakdown and needs to be removed for everyone's sanity.  But if you really don't see a problem with failing to uphold your professional responsibilities, you're going to hit this kind of problem again and again.\n\nSeriously: successful people in life arrange things such that it is **other people's fuckups** which set off their crazy superiors.",
            "How many times does OP ask to speak to a manager each day? That's exactly the attitude they have. ",
            "I think everyone has had at least one bad professor. I went to a mediocre public school and tried to learn a language. It was basically a class where people napped and the teacher gave out A's.  I needed at least 3 years of language in my high school, I guess wishful thinking made me stay for the fourth. On college the saw I had 4 years of said language on my transcript, bumped me to the intermediate class, and man oh man wtf? We were only allowed to speak in that language. I would go to office hours and the professor would imply I had ADHD for not grasping his wonderful teaching methods. He would monopolize students time outside of class by saying our grades were dependent on going to coffee with him and talking about poetry in his language. I was still wrapped up in my N-mom at the time, and she would scream at me not to quit. Let's say I had to spend another semester with this delightful man. If you have any questions pretty much the entire class dropped out except me and 5 people.",
            "Clay is shit. That is all.",
            "[deleted]",
            "Ask her to apologize to you in front of the class",
            "GOOD FOR YOU. You did the right thing and your fav teacher is a pro.  So glad you are out of that mess.   Hope you have enough post-paycheck money to buy yourself a treat!",
            "Keep your head up.  The fact that students were willing to spot you the $ for clay and another teacher said they would figure out another way for you to get certificate credit should tell you a lot.  Use this as a life lesson.  Some people will use your current limitations to discount you (not having enough money to buy clay is an opportunity to crap all over you).  Everyone else sees riiiiiight through it.  \n",
            "Don't worry about the crying.  You're young and full of hormones, it's really normal.  I used to cry over the dumbest shit when I was..uh.. Well I don't anymore and I'm 28!  \n\nIf you enjoyed sculpting and want to do it now and then for fun you can always try paperclay.  It's not too expensive and hardens on its own.  There's also sculpy which you can bake.  When you have some spare cash that is.  <3",
            "[removed]",
            "I didn't buy a 4ft paintbrush for art class...my bad. Hugs. Some people just shouldn't be teaching at a college level should they.",
            "I'll tell ye one thing, if I could go back to a certain teacher who called me out and was being cheeky with me for no good reason, I'd have told her to fuck off",
            "Please let there be an update to /r/justiceporn soon!\n",
            "[removed]"
        ]
    },
    {
        "post_id": "378zv2",
        "author": "duckduckchicken2",
        "title": "Me [31F] with my husband [32M] 10 years, he didn't hang up phone properly and went on to give away his infidelity. Help!",
        "url": "https://www.reddit.com/r/relationships/comments/378zv2/me_31f_with_my_husband_32m_10_years_he_didnt_hang/",
        "score": 2280,
        "num_comments": 401,
        "created_utc": 1432588694.0,
        "selftext": "So I was talking to my husband on the phone earlier while he finished work and was getting groceries.\n\nAnyway, we say goodbye and he fails to hang up properly. I didn't actually realsie until I heard a female voice say his name and that she was so excited to spend the night again.\n\nHe said he was excited too and I heard a pecking kiss sort of thing. I hung up.\n\nI text him straight away saying \"I heard it all. Come home immediately. Alone. To talk. Seriosuly\"\n\nThat was 2 hours ago and his phone has now tunred off and I don't know what to do. Help?\n\ntl;dr: Overheard husband and female talk about spending the night and what may have been a kiss. When I asked him to come home he turned off his phone and hasn't been home 4 hours later.\n\nEdit: IT is nearly 1am in the UK. I am off to bed but will update of and when I can. Thanks everyone!\n\nEdit 2: He hasn't turned up for work this morning. He was due in at 10am and its now 12:15. His boss rang me to ask why he was late. I half explained that we'd had a falling out, didn't want to go into too much detail of course. Peter (the boss) said he seemed distant as he clocked off work yesterday evening. \n\nNow this is where things get a little complicated. My husband work in a care home for special needs children, he was still working while doing groceries (it was a shopping trip for the residents too), so he finished work shortly after the phonecall incident. \n\nThis means that the woman in question is either a colleague, or my husband has the complete audacity to risk his job by allowing strangers to join his work activities. I'm trying not to dwell on who the woman could be or I'll be too upset. \n\nI've spoken to all friends, family, any one that might know where my husband is but no one knows. My sister, and my husband's brother have come to an agreement if he is not home by dinner time tonight we will have to report him missing just incase. \n\nALso, for those concerned, I have spoken to a lawyer briefly over the phone, and am seeing him in person tomorrow while my sister babysits. I have also checked our bank and the last access was while husband was shopping before he finished work. No money has gone in or out since.\n\n(Sorry for any mistakes, editing on my mobile while out with the kids, they are a lot chirpier today, but who wouldn't be while at the zoo?!)",
        "permalink": "/r/relationships/comments/378zv2/me_31f_with_my_husband_32m_10_years_he_didnt_hang/",
        "comments": [
            "[removed]",
            "Wow, I wouldn't even expect him to come home tonight.",
            "Not sure if anyone has brought this up but check your bank account(s). A cornered animal is a dangerous one.",
            "He's not answering? What a fucking coward. Prepare for divorce. ",
            "Prepare the lawyers. Gather the evidence. Move him out of your bedroom. Tell the family and friends.\n\nIf he has turned off his phone, then that gives you time to get the head start on him.",
            "[removed]",
            "He is using this time to get his stories straight. I am furious for you.",
            "You sound like an incredibly strong woman with a good head on her shoulders. Be there for your children, they'll need you more than ever. Be strong, you have all of us rooting for you. Its his loss, I'm sure. Most men dont know a good thing til theyve taken it for granted.",
            "Just wow! What a coward! Get a lawyer first thing and divorce him. Nothing worth saving here. Sorry that this happened to you, OP!\n\nEdit: wording",
            "Did this come out of nowhere? No signs or suspicions?",
            "[deleted]",
            "What are you waiting for? Pack his bags for him and have them waiting by the door.",
            "I'm sorry this has happened to you.  No one deserves to be treated this way.\n\nI haven't read all the comments yet, but a few things:\n\n1) Your children need to know that it is not their fault.  They will try to get you two back together again, but they need to learn that they did nothing wrong.\n\n2) I saw one comment where you said that your husband is a good father.  Being in that space where you no longer respect your spouse as a partner, but recognize that they need to be able to parent with authority is what I call \"being zen about it\".  It is hard.\n\n3) Tough times are coming.  If you are like me, there will be nights when you are dreaming and you'll dream about your ex and in the dream you'll turn to him and say, \"but you were lying to me\" or \"but you were cheating on me\" and then you'll wake up upset.  That seemed like a dirty deal.  Trying to rise above it and manage your feelings during waking hours, and then be undone by a dream that disturbs your sleep, knowing that you'll need to get up in a couple of hours to get the kids to school and get to work.  You'll be zen about stuff and then one of your children will say that your ex is in love with his girlfriend and you'll want to rant a little, just to set the record straight, or throw off a comment like, \"yeah, well he was in love with me once, and ...\".  But you can't so you try not to show your feelings to your kids because they don't deserve to have to deal with the things that happen in their parent's lives because one of the parents is a selfish son of a bitch.\n\n4) You'll try dating and you realize that you don't really like dating.  You'll really wish that you could have it all back again.  Then you'll find someone and it will be really good and you try to recreate all the intimacy that you had with your husband, but then things happen and it all falls apart.\n\nBut at some point, you'll realize that you are okay, that you have weathered the storm and you are stronger than you ever knew you could be.  You wish that you had not found that out, but you will be the parent that your kids look up to because you have kept the drama out of their lives and you will have special times with them.  You'll wish that you could have shared those times with someone else, but you will be glad for them, nonetheless.\n\nGood luck.",
            "Remain as calm as you can.  Collect your assets and separate his from yours.  DO NOT DRAIN A JOINT BANK ACCOUNT, take out what you will need and put a hold on it.  If it comes up in litigation that you did this you could be in some deep shit.  \n\nRemind yourself of the facts, he is cheating therefore he is in breach of the agreement you guys legally made when you entered into matrimony.  \n\nThe truth is your evidence is circumstantial, any action you take now has to have solid proof.  You said you heard \"what may have been kissing\", that may be true but it will take him admitting it in court for it to be considered foundation for divorce.  Contact your lawyer and only follow their advice.  The advice in this thread is mostly from people who spend way too much time watching movies or reading stories online.  The cooler your head remains the easier this will be for everyone involved.\n\nFor your children, you had good advice in here, be vague.  In time when the divorce comes to fruition find a therapist to help you explain it to them and help them work though it.  \n\nTL;DR: Don't blindly follow the advice in here, you need legal council and a child therapist to help you make the correct decisions.  There are resources available for you that are much more accurate and legal than the advice being offered on Reddit, use them.  \n\nGood luck, I'm sorry you're going through this.  ",
            "My stomach dropped and I feel sad even thinking about this.  I would be so absolutely crushed, but I can't even truly imagine what you're feeling.  You say your sister's a lawyer, and you DO need a lawyer, but I would suggest going outside the family if you can.  Divorces tend to be ugly, especially when someone as apparently cowardly and callous as I am gathering your husband to be from both his ability to do this to you as well as his ignoring you.  Everyone in my family is a lawyer, but unless it is for something as innocuous as a traffic ticket, I'd always search outside immediate family just to avoid dragging more emotion into it.  Just a suggestion.  Either way, best of luck.",
            "Damn, a lot of people here are really fucking bitter and using OP's situation for personal satisfaction. Kudos to the people giving sane, level-headed advice.",
            "Whenever you do talk to him, as a man who has seen this and have witnessed it from his side, dont let him talk himself out of the situation. He knew what he was doing, he knows what he wants and he knows what he sacrificed with his actions.  \r\rYou sound like you do not want anything to do with him but i am sure there are still feelings for him deep down. Dont let him take advantage of that and get what he wants. Dont let him use the kids against you, in the same light, dont use them against him. Do your best to leave the kids out of it, but keep them in mind when you both make your decisions.  \r\rLife will clearly be different for all of you. The kids will live separate lives in each house hold. But those lives dont have to be bad. Just let if be clear that you want the best for your children. I have seen too many good children's lives fall apart because the parents are selfish asses. ",
            "How is he going to lie from getting grocery to spending a night with another woman? He isn't really smart.",
            "I've updated with what I know for now.",
            "Call a lawyer.",
            "Been there, done that, and I am sorry to hear what you are going through.\n\nHowever, **you MUST immediately close or transfer all funds out of any joint accounts you have**.  Call the credit card companies and report the cards lost/stolen if you have to, then put a password on the account.\n\nMy ex-wife, who I caught cheating on me, cleaned out our savings and checking accounts in just two days, and maxed out all my credit cards to the tune of $30k+.  I was forced to file bankruptcy, as did she (the judge threw the book at her and made her file Chapter 11 [repayment of debt] and let me off with Chapter 7 [no debt repayment]), but I lost my house, and it was just a nightmare.  ",
            "*This means that the woman in question is either a colleague,*\n\nOr a resident? I mean just saying, that would mean maximum shame.",
            "I'll probably get downvoted but is it just me or does something not smell right about this story?",
            "Im sorry. Just really leave now. Im in a situation where i love a liar and can tell you they never change. ",
            "Rocking the zoo, good on you.",
            "So he is stupid, cheater, bad father and a coward?\n\nWell, someone hit the lottery.\n\nGood luck with the divorce. ",
            "I have to hand it to you. You've handled this way better and more calm than I think I ever could. Your kids are lucky to have such a great mother, I'm so sorry you're in this predicament.",
            "Is it possible you could have misheard? Everyone is yelling for divorce, etc, but can we at least get his side of the story before we call for his head?  \n\nStranger things have happened before than this type of potential misunderstanding. ",
            "My dad cheated on my mom, so I know sort of what you're going through. While you said that you wouldn't bad-mouth him in front of your kids, you also need to make sure that when he comes home, which should be soon (he'll need to collect his stuff/beg for mercy), you need to make sure that your children are not around. If they absolutely have to be there, avoid any form of verbal confrontation. Don't argue, don't yell, don't make accusations; because if your kids hear this, they will use it against him. So, if you and/or your (ex) husband are... verbal people, you need to send your kids somewhere else, whether it be Grandma's, Grandpa's, their Aunt's or Uncle's. If you both are not verbal people, then you can keep them in the house, but make an effort not to yell or instigate anything with your husband. My parents divorced when I was 7, and I used to periodically use it on my dad when I'd become upset with him. \n\nI'm really sorry this happened to you, OP. Let me know if there's any other advice I could give you. ",
            "Also, contact a lawyer ASAP to find out how long he has to be out of the house before you make home and family abandonment part of the divorce case. Get every ounce of custody you can, and if he remains a good father you can let him have them more than you \"have\" to. Kudos to you for wanting him to stay involved while this is so fresh, but you should and deserve to be the one in the driver's seat.",
            "Lawyer, Document, be fair, be firm. ",
            "You know the usual advice. Just wanna say you're handeling this really well",
            "Echoing several of the comments, but pack his bags and hire a lawyer. You and your children deserve far better!\n\nThis infuriates me, especially knowing that young children are going to be impacted so much by his choices. ",
            "Put his clothes on the front lawn. gather his things, drink and/or break his whiskey. ",
            "Hey OP,\n\nI'm so sorry you are going through this. Stay strong for yourself and your babies. Please update us when you have more to share!",
            "Update?",
            "I hope the reason your husband appears to be missing at the moment is because he's too afraid to deal with how deep in shit he is.",
            "Maybe it's a colleague who enjoys night shifts, it's a residential unit. Maybe it was a special needs woman? ",
            "Hope things are going okay!",
            "He's frightened of the consequences so he's hiding. Its understandable. I assume you'll hear from him at one point.\n\nI dare say the kids special events are low on his priority right now, he probably wasn't expecting to get caught and knows what will be waiting for him at home.\n\nWaiting to face him in person would have avoided this problem, but all you can really do now is wait a few days for him to show his face. ",
            "When you wake up, get a lawyer and check your bank accounts. After you set an appointment, go to the bank. If you still have money in there, withdraw half of it (to be fair) and open up your own. Don't leave yourself vulnerable, I speak from experience. ",
            "Don't do anything rash until you know for sure.",
            "10 years, so the usual legal questions:\n\nPre nup? \n\nCounselling? \n\nDivorce? \n\nAfter that it, find out who other woman is and why it led to that,  and make your decision. This is a shit deal for you, I'm so sorry. ",
            "I'm so sorry you married an asshat. ",
            "Odd question, what phone does he use? If you know certain log in details you can track his location to find where he is at any time. ",
            "So sorry to hear your going through this, people gave some great advice",
            "Just wanted to say good luck with everything, OP. Sorry you have to deal with this. *Hugs*",
            "That sucks. Get a lawyer ASAP and tell those who will know (family and friends), there is always a possibility that he slanders you and makes your story unbelievable.\n\n",
            "You're handling everything correctly, follow what the lawyer says.",
            "I'm sorry OP, this really sucks. Maybe now you can move on to some who truly deserves you. Call a lawyer and get prepared. You're now better off.\n\nTake care, and keep us updated. :)",
            "Read the update, and I'm so sorry. I don't think your text was the problem; I think your husband had some mental health issues that he wasn't coping with very well, and ultimately it led him to taking the worst path possible. If I could fly to the UK and give you a hug, or bake you cookies or something, I would.\n\nEdit: Also, I *highly* recommend getting some grief counseling for you and your children. A friend's father committed suicide when I was in college, and she and her family all saw therapists for a few years afterwards trying to cope with it all. The kids probably don't need to know about the infidelity, either.",
            "Fake",
            "yikes, this sounds awful.  I'm so sorry for you and your kids, y'all don't deserve this.\n\nHaving said that - 1) good thing you're finding out about this now, rather than 5 years from now, and 2) you sound like a strong, level-headed woman who deserves much better than him.\n\nStay strong, and good luck!",
            "Good luck. I'll hope for the best for you.",
            "What about packing up and going to your parents with the kids for a few days. It would be good for you to have some support at this time and frankly as he isn't coming home, he doesn't deserve a family to come home to.",
            "I am so sorry this happened to you and I hope the best for you and your children  ",
            "Let's check /r/tifu for OP's husband.",
            "I'm sorry about this. Must be really hard for you right now but wtf is wrong with reddit?\n\n\"Prepare your lawyer! File your divorce papers!\" Holy shit, that's some really sound advice people! Let's absolutely not talk to each other first and immediately start the hostilies shall we?",
            "Why the fuck wouldn't you keep listening?",
            "I would be calling a locksmith to have the locks changed.",
            "[deleted]",
            "hug your family if you read this. just do.",
            "sorry to hear all that.. hes probably banging a co-worker or one of the special needs kids mothers.",
            "No chance for reconciliation? Let the smoke settle and have a serious talk with him.  ",
            "This won't be popular but realize he just had his carefully constructed web of lies demolished.  He is going through a shit ton of emotions right now that he has been tamping down.  It sounds cruel but the emotions you are dealing with now are raw.  What ever vision of himself he had is now gone.  You can save this if you choose but do not hold the fear he feels now over him.  No good will come of it.  ",
            "Listen to his explanation. If he actually has a good explanation for what happened then resume your relationship. If you confirm he is cheating then break up. How fucking hard can this be?\n\nThis is really suspicious though since this is your first post, you know how to use reddit perfectly, and your husband is spending the night with another woman when he's supposed to be grocery shopping, a task that you don't spend the night to do. I'm thinking this is fake but I'll listen to your explanation first, wouldn't want to be a hypocrite.\n\n",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "4q9jr9",
        "author": "ImSickOfVideoGames",
        "title": "UPDATE: My boyfriend [30M] of three years has a problem with video games and I [27F] need guidance",
        "url": "https://www.reddit.com/r/relationships/comments/4q9jr9/update_my_boyfriend_30m_of_three_years_has_a/",
        "score": 2275,
        "num_comments": 199,
        "created_utc": 1467122233.0,
        "selftext": "[The original post](https://www.reddit.com/r/relationships/comments/4lv9f8/my_boyfriend_30m_of_three_years_has_a_problem/)\n\n\n\n\nSo I want to quickly thank everyone who shared all of their personal gaming stories with me as well as some interesting debates as to what level of gaming is considered addiction. Also sweet shout out to whoever decided to pm me and say that this was all my fault for making my boyfriend want to escape reality and play video games so much. I hope Jesus finds you before Chuck Norris does... sorry my \"sick\" burns still derive from middle school. \n\n\n\n\nSo on to the update. After submitting the post I read through a lot of material on how to quell gaming addictions and help me explain my boundaries without forcing an ultimatum on my SO. So a day after I went out and bought books from a second hand store. I tried to get two copies of each. I went on Groupon and signed up for a ton of couple courses (fitness, painting, anything). I also cleaned out our refrigerator of a lot of ready to eat meals/snacks and purchased a lot of food that requires some prep ranging from 5 minutes to 30.\n\n\n\nWhen he got home that night I cleared off our kitchen table and asked him if he'd sit with me, no electronics. We had a pad of paper between us and I asked him if he'd write out how much time on average he spends on certain activities during the week/weekend. Work was 40-45 hours, carpool was about 8 hours, weekday gaming 36 hours (hour before work, at least two hours cumulated at work, hour on the way home from work, and average of five hours once home into the night), misc activities an hour (chores and household or grocery shopping). Weekend numbers for gaming were more or less the same fluctuating between 40-45 (saturday, sunday, monday). I asked him to count \"quality\" time between us for the week. As in minimal electronics, cooking together, coffee dates, hiking, dog walking, engaging conversation, sex... it totaled to roughly five hours a whole week, including weekends. \n\n\nI then asked him to rank important aspects of his life. They could be in a more important first manner, or just \"here are 10 things that are all equally important to me\". I was the third thing written. His family and security (financial, home, auto are all rolled into that) were the first he thought of, but I'm ok with that. I'd rank my family first too until we are together a lot longer or married. Our dog, traveling, learning, and health also made the list. \n\n\nI showed him the list vs. how he spends his time. \n\n\nSo I asked him to compare the list of things he thought were important to how he spends his time. And that's when the tears started. He asked me if this was my way of saying the relationship was over, and I told him no, but I need attention too. Living with your SO seems like an easy way to spend quality time, and I suppose it can be, but it doesn't mean you should stop \"dating\".\n\n\n\n\nI asked him if there was any reason his video gaming had been increasing as five months ago he didn't play this much. He said that it started as him being a little depressed about our finances, his job being so high strung, and not being able to go out as much wanted because of the finances (traveling, expensive sushi, what have you). He also felt pressure from some of his friends to play more as this was all they did. We talked about my gaming and how he would like for me to play more but recognizes that the fun is taken out of it if he begs me to play every day and is a majority of what he talks about.  In the end the gaming just became a weird solace for him. At first he used it to escape his financial fear, but later it just became a safe space that he was used to. He described it like going to your grandmas when you're upset with your parents only to really recognize how much you love being in her home and how she comforts you... So you try and visit her as much as possible, anything that can kind of trigger sadness and it's off to grandma's. They're out of my favorite kind of chips at the vending machine? Time to play video games real quick so I feel good. \n\n\n\n\nSo we made a plan. I made it clear that I don't want to feel neglected in a relationship for any reason, that I like video gaming with him but I need more stimulation from him than quality time via coop mode. I brought out the books I bought and showed him the groupons I found and we reworked our weekly schedule so that during those free hours he has other activities to try that I'll be doing too. We didn't completely cut out his gaming time but we made set amounts per day. Carpool? Play all you want or read. At work? minimize it as much as possible by reading or working on work related activities so a promotion and raise are in sight to help quell financial freak out nerves. At home? Activities as much as possible with the promise that Sunday's we play video games together for around five hours schedule permitting. \n\n\n\n\n\n\nSo far there's been one hiccup. Not major, he told me immediately that he overplayed and would be deleting his apps to get rid of the temptation. He's trying some therapy to help cope and though it's early I think he really is working hard to make things better. He cooks with me and a lot more in general, we play card games, we have our own read at your pace book club (we read a book a week at this point; onto book four soon), and through our activities stay as busy as possible. On our gaming days we make pizza together and make snacks and get ready to destroy on coop mode. He likes being able to do coop more than gaming alone and says that having a big day with him and I is makes not playing as much during the week worth it. \n\n\n\n\n\n\n\n\n\n\n\nI'm cautiously optimistic at this point. It's great that he's throwing himself so heavily into everything else, but moderation is still key. Thank you all very much again for help and ideas. \n\n\n\n\n   \n**tl;dr**: So far things are looking up. We sat down and he recognized how much time during the week he spends on video games and we're working on cutting it down. He's been fairly good thus far. Thank you!",
        "permalink": "/r/relationships/comments/4q9jr9/update_my_boyfriend_30m_of_three_years_has_a/",
        "comments": [
            "> I asked him if he'd write out how much time on average he spends on certain activities during the week/weekend....So I asked him to compare the list of things he thought were important to how he spends his time.\n\nThat was an *astonishingly* effective approach. Wow, what a gut-check that must have been. Would be, for *anyone.*",
            "As a boyfriend whose girlfriend enjoys playing video games with me and will be moving in soon this was a great perspective on something that could potentially be an issue in the future.  Thanks for giving such a great example of how both parties should handle the situation.",
            "This. This is the epitome of adulting done right. You are a Grade A girlfriend.  Good luck to you both.",
            "You are a rock star. You handled it perfectly.",
            "This was awesome to read. I really like how you handled it.",
            "That was the perfect way to handle this.  You basically got him to identify his own issue just by asking him what was important to him versus what his actual action are.\n\nThat was brilliant.  Good job, OP!",
            "I'm glad this has worked out, I knew I recognised the post title :)  \nI'm glad my advice was able to help someone.  \nGreat job handling this so maturely.  \nYay \\o/",
            "Handled like adults. Wish you the best.",
            "That pad and paper thing is definitely something I'm saving for the future. That was such a good idea.\n\nGood luck with your life!",
            "I'm happy for you that you've been able to tackle this head on. I hope things continue to go well. \n\nHowever, it sounds like your bf just has an addictive personality in general. I doubt this will be the last time you have to talk him down from a vice. Maybe the therapy can help him address the root cause of why he clings to substances/behaviors for comfort when times are tough. ",
            "So impressed with you! It makes me want to do the same thing with my time and priorities.",
            "[deleted]",
            "You guys sound like you have a lock on what makes a good relationship. Well done! ",
            "I am very, very happy for you. You handled it very well, but also I'm happy your boyfriend was willing to listen and cooperate. Cooperative spirit is everything. So many people try and try with their spouses but if their spouse views them as enemies, they'll get nowhere. And it's sad. \n\nBut your update is great and happy! Congratulations on keeping and fueling that cooperation! You two are a team, as long as you both keep it in mind you can overcome pretty much anything.",
            "\"I need more stimulation from him than quality time via coop mode.\"\n\n\nI love you.",
            "I just wanted to say, as someone who has addictive tendencies as well, you handled this in the absolute best manner possible. Way too often this can come across condescending, and tend to only make him bury even deeper. You are absolutely a wonderful human being, and a complete \"Grade A Girlfriend\" as someone else put it. Seriously OP's BF, if you read this, work on saving up for that ring. Marry this girl, or I will! lol",
            "I missed your OP, but wanted to say kudos to the both of you!  \nAnd you are so right on the \"dating\" thing ... Even though my husband and I work an insane amount of hours (we work together as well!) and live in really tight quarters, we try to go out at least once a week for dinner and a movie, or even just running some fun errands (looking for Amiibo, hitting up Lush or B&BW for me, or going to Target just to look around.) It really helps us reconnect and talk about things we might have forgotten to mention during the week.  \nYou totally got this. Nice adulting! And like many others, I'm having a gut-check too! ",
            "You are amazing. I wish I would've seen this before the attention to video games destroyed my last relationship. A million kudos to you!! ",
            "[deleted]",
            "You are a pro OP.  He will be thanking you for this so much in a few years.",
            "Fantastic update! You really did everything perfectly and it worked! I'm so happy for you guys. ",
            "I went thru the same thing with my girlfriend of 4 years. The lack of communication and willingness to figure out what was going on and how to solved it, ultimately lead to our break-up. I'm over the gaming now after a year of depression after loosing my job and girlfriend (separate issues). You just slowly get sucked in. Lesson's learned I guess. I'm glad you were both adults about it. ",
            "you two should get into board games.   they can scratch that same video gaming itch, but are more social and fun for couples.",
            ">at least two hours cumulated at work\n\nNo wonder he thinks his job is stressful.\n\n>hour on the way home from work\n\nThis seems safe.\n\n>average of five hours once home into the night\n\nI don't think I could even come up with 5 hours a night to do any one activity. Does he not eat? Does he not clean? Does he not help you with anything around the house?",
            "I think it's great that he was receptive to it and that this works for you, which is what is important.\n\nThat said I can't say that I agree with the other posters itt; if somebody sat me down and made me rank what's important in my life and timetable my every activity I would tell them where to go.\n\nBut best of luck to you, I hope you guys are on the right path for you!",
            "This is the best possible outcome. You're a rockstar, OP!\n\nSeriously, girlfriend of the year award",
            "That is SO wonderful. I'm so happy for you both!",
            "What a great way to handle it-I'm so impressed by how different of an update this is to what we normally see on here. It was a pretty big issue, one that you wouldn't have been wrong in maybe deciding it was too much to surmount. You worked WITH him to address the issue instead of against him. Great job OP!",
            "This post is not only a fantastic way to deal with the problem at hand, but also a really inspiring way to combat personal things as well! Thank you !",
            "You did a super great job handling that situation!",
            "Can you tell my gf this? she thinks im bad at about 5-10 hours a week",
            "I have to tell you, you sound like a very level headed person and I think you did a great job of handling this. You treated him like a human being- instead of letting your anger about all the time he was spending gaming get to you, you approached him maturely and did a really good job proving your point by illustrating why it was a problem. You then offered solutions.\n\nSeriously- I'm impressed! \n\nI hope things continue to improve for the two of you. Best of luck!",
            "This is literally the best thing you could have done. Sounds weird but thank you for making it a point not to attack him and making sure he really had an issue first. My SO loves games, but didn't really play any when we first got together. Eventually he would but if he would ask me first, always figured it was because we had limited time together so never questioned it. Then we moved in together and he still asked, finally I had to basically say \"I don't care if you're playing games, half the time I am too or I'm sucked into a book. You don't have to ask me\" (laughing/joking tone through out, sounds super harsh when I read it in text) \n\nApparently his last gf had gone absolutely ape shit nuts over him playing video games. We're talking 3 hours or so at a time every few days or beating the hard level/boss for his siblings (he's the oldest). And he quit his alone gaming but refused to not help/play a few rounds with his siblings, part of why they split. \n\nHe still asks every so often, I've started being sarcastically over dramatic saying, \"Oh my God no how dare you play that game you just bought\" (on sale and using old games as trade ins, super hard to convince him to spend actual money on it), humor of it seems to help.\n\nBonus points-Found a profile on their dad's consol with her name and likeness, never figured out if it was hers or one of the siblings trying to frame her lmao.\n\nAnyway thank you for your approach and I'm happy it went as well as it did. ",
            "so uh... what game do you guys play together?",
            "Who is afraid of the big bad wolf? All relationships need their boundaries and you need to draw clear lines for him and yourself. Good luck dear. I had a good beginning with someone but with my nails, I had an accident. I wish you the best. My own fate is not good.",
            "This is probably gonna get lost in all the comments but if he reddits (or you can check it out) is /r/StopGaming. They have excellent resources for people looking to quit gaming/lower the amount they play.",
            "Gamer here. Fucking impressed how you handled this. Bravo.",
            "Well, you seem to be handling things well. I like that you threw him a bone for co-op day(s). What is it, like 2-3 days a week? Not bad at all and he's hopefully more motivated to do other things with you knowing he'll get his itch scratched. I'm sure it helps that you apparently really throw yourself 100% into it.\n\nFor anyone wanting to change their partner's behavior; take notes. This is how you do it. You don't just go \"change!\" and then modify nothing yourself. You modify their lifestyle into a healthier one but you also give them an outlet for what they really want to do, involving yourself in it as well. You'll have a much happier and more motivated partner but you'll also get what you want at the same time. ",
            "Really mature, so impressed with your ability to communicate! He needs you :)",
            "I think the fact that he sat down with you and willingly made this list without being given an ultimatum, and while being honest about his priorities should be applauded.  It takes strength to admit fault and addiction, and for him to let you help him see things objectively shows that he cares about you and your relationship, as well as himself in a positive way.  ",
            "Wow I applaud your maturity and how you handled the situation. It looks like you two are genuine couple and both care enough each other to find the solution. I love that you helped him with his weakness with creativity and honesty. Go you!",
            "It sounds like you have a shot at controlling this. If the problem gets much worse, you might consider contacting these guys: www.netaddictionrecovery.com",
            "It sounds like you handled this in a very level-headed way. And that you have reasonable expectations going forward. I wish you guys lots of luck!",
            "I'm literally saving this post because the way you handled it was so perfect. \n\nKudos to you for handling it so maturely and in a way that helped him instead of beating him down ",
            "Sounds like we need to start a Gamers Anonymous. I would be the first to sign up if I had a problem....",
            "Do you mind telling me what coop games you play together? I'm looking for some games to play with my bf myself",
            "I'm a guy with similar problems as your SO. Glad you guys could talk it out. It's rough sometimes.",
            "I don't get why people were being rude to you... It would be more understandable if you straight up said you hate video games and you don't want him playing AT ALL. But that's not how you wrote your post.\n\n\nI think how you handled the situation was very mature. A lot more than when I was in that situation haha. I actually consider myself a gamer (or at least used to!) And my SO is definitely one, but addicted. He would play online games with his friends, so he'd be on Mic. I hated that because I'd try and talk to him, and he wouldn't hear me, so I'd repeat myself, and he'd get mad at me.. Claiming he heard me, and yet didn't acknowledge it. OR.... I would say something then 5 minutes later \"what?\". So I started doing my own thing when he gamed. Played my own, read, etc..... But.. that became an issue because I \"wouldn't talk to him\".. It was very frustrating, but he finally got it under control a couple years ago.\n\n\nI'm sure he's still addicted to it, but instead of playing for HOURS while I worked (he did also, but still....) and did ALL of the house work. We had a baby and he was laid off, so not working full time. He stepped up and finally realized how much I did and how little he did.... -_-\nbut\n\n\nGood luck to you! 😊",
            "Good on you for making this plan and executing.\n\nMy ex 4 months ago got bad with gaming. She (yeah she's a girl and I'm a guy lol) was playing everyday 12 hours a day. Ignoring her job (family business so she knew they wouldn't fire her) and her college work (failed all 4 classes).\n\nI finally had enough one day after weeks of dealing with it. She stayed up the whole night. She took a little nap and I ran around and got her coffee and breakfast from town. Got back woke her up, got her shower running and her in it, cleaned her desk and area.\n\nWhen she got out I asked her if she could cut back a little on gaming. Her response was to dump me. \n\nI found out later that day she was talking to a guy on the video game behind my back and deleting the messages. \n\nShe started dating that guy within an hour of dumping my ass and proceeded to stay at my house for another 3 days til I finally kicked her out.\n\nShe's now doing drugs and dating guys on tinder for a week or so at a time then moving on.\n\nI was heartbroken but now I'm taking back control and am working on losing weight.\n\nSeriously congrats to you for not dealing with it.",
            "I really like the way you approached this situation. ",
            "I don't have a girlfriend, just games here but this was inspiring and rational. I hope he wifes you",
            "You are a better woman than me. All the best, OP!",
            "Probs to you for the way you handled it, and props to your boyfriend for realizing his problem and making an effort to change things",
            "this hit closer to home than expected.\nhis reasoning for gaming so much sounds too familiar, as does the level of gaming.\nI'm single, so I'm not neglecting an S.O. but I am neglecting some things that are more important.\nI'm glad I read this and I hope things continue to be well with the two of you!",
            "As someone who can probably relate to your boyfriend more than I can say, I wanted to give my input on something.\n\nThis:\n\n> And that's when the tears started. He asked me if this was my way of saying the relationship was over\n\nCombined with all the other stuff you've mentioned... This sounds exactly like me at a different point in my life. Which I say so that I can further say: If he's as much as like me as I believe from reading this, this is not a man secure in his relationship. He clearly values you and is, somewhere inside that he may not even realize, absolutely fucking terrified and convinced that he is fucking it up. I know when I got like that, that very conviction would lead me to become apathetic about the whole thing, making it a self-fulfilling prophecy.\n\nI don't have any advice to give you and I may be way off the mark, but there it is.",
            "Holy cow this is almost exactly the same problem my ex and I had. The way you approached this was awesome, I hope it all works out :) ",
            "I'm happy to see progress being made instead of breaking up and all this negative bullshyt. ",
            "You really REALLY did a great job here, and it sounds like he is doing a great job to fix this too. Wow, congrats OP, you have won at adulting. The list thing.... I think anyone could benefit from that, how amazing.",
            "Aww, I'm glad things are going well for you guys now. Quite the way to handle the situation. As in a very effective way. I would be like your husband who would think that you would be done with the relationship but instead you chose to try and fix it effectively. Best of luck!",
            "that is awesome, think i'm about to do the same thing with my kids. they need a intervention. hahahha I have 3 and mom and gaming gets all their attention. Congrats and good luck. keep us updated. ",
            "This is great for a solution, just make sure that \"schedule permitting\" means you don't schedule things for Sunday and allow him his promised day.  That should really only factor in if there's an emergency. ",
            "I can understand if there's an addiction, but hardcore gamers will never be happy if you force them to smoosh all their gaming into one or two days. Let him game for a couple hours a day, it's not hurting anybody as long as he holds a job and takes care of whatever he's supposed to do at home. And yes, you should be a priority, but if you stifle him too much he'll end up resenting you. Also for the morons saying a 30-year-old is a man-child for gaming, ever heard of Rooster Teeth? A group of men in their 30s built a COMPANY around gaming. It's a legitimate passion for some people, deal with it. I'm not justifying addiction, but he should be allowed to game a little every day if he wants. Just as someone who loves to read should be able to read every day, or a biker to bike every day. Gaming, despite popular opinion, is just as valid as any other hobby. \ntl;dr Let him be himself as long as it doesn't interfere with his job and he makes time for you too.",
            "[Called it!](https://www.reddit.com/r/relationships/comments/4lv9f8/my_boyfriend_30m_of_three_years_has_a_problem/d3r5out)",
            "Both me and my bf game a lot and were planning on moving in together within a couple years. This is such a great tool and you handled it perfectly. Thanks for doing this! I'm happy things are looking optimistic!",
            "[deleted]",
            "Wow. This is one of the best updates ever. I'm very excited to here things are improving and I laud your netural, non-confrontation way of handling this. ",
            "I thought you were the crazy woman whose boyfriend played like 2 nights a week for like 6 hours total, I'm happy you aren't ",
            "It sounds like you're parenting him. May I please ask why you're still dating? He doesn't sound like a catch, sorry.",
            "As someone who is an avid gamer, my SO understands that just because I'm playing a video game doesn't mean I don't care about her. I'll blow her a kiss or something like that every so often or take a 5 minute break for cuddles but other than that I sometimes \"ignore\" her for hours unless she wants to talk about something serious or really wants to do something specific. If she started telling me I could only play for x hours a day I wouldn't be happy about that because me not directly spending time with her doesn't devalue our relationship. She is able to understand this and lets me do what I want and in return I'm as loving as can be when we're communicating.  The only difference between our situations is that I don't have to play video games if I'm out doing something. I get the urge now and then but it's definitely not overpowering most of the time. \n\nI think you just have an incompatibility with your SO here. You think him doing what he loves to do devalues your relationship. If him doing his favorite activity a lot doesn't sit well with you then you guys simply aren't compatible. Making him do things he doesn't like to do (reading?  For a gamer?) in order to preserve the relationship is going to breed resentment even if he isn't vocal about it. If he's legitimately addicted then the therapy is the only thing I can see helping the situation. Other than that you either need to accept his hobby (however excessive it is) or move on. \n\nOf course I don't know virtually anything about your relationship, but I have an insanely strong bond with my SO. If she started telling me I can't play video games as much anymore the bond would slowly start breaking. Luckily she is completely fine with me doing it because she can feel every day how much I love her despite spending all that time being distracted from her. He's not going to be happy if he gets less than 90% of his free time into video games if there's nothing else to do, telling you right now. ",
            "that seems exhausting.  I think you're too good for him ",
            "[deleted]",
            "If he could spend 2 hours a day playing games on his phone at work then it's not that stressful of a job.",
            "He needs to grow up and become a man.",
            "Your first mistake was dating someone over the age of 15 that still plays video games."
        ]
    }
]