[
    {
        "post_id": "448019",
        "author": "worriedmom92",
        "title": "I [49F] recently learned my son [22M] has some disturbing beliefs and it's making me uncomfortable.",
        "url": "https://www.reddit.com/r/relationships/comments/448019/i_49f_recently_learned_my_son_22m_has_some/",
        "score": 2273,
        "num_comments": 272,
        "created_utc": 1454628544.0,
        "selftext": "Before I elaborate I just want to say that neither me nor the rest of my family share my son's beliefs. I have no idea where they came from but I'm certain when I say it has nothing to do with how my husband and I raised our son.\n\n\nMy son went to college across the country and graduated last spring, and thankfully he got a very good job close to home o now he's back and living with us. On all fronts, he's doing great in life and is shaping up to have a very successful future. I've always considered him nothing short of perfect but recent events have taught me that my son holds incredibly disturbing beliefs.\n\n\nMy son has always been very protective of his younger sister (18F), she's currently in her last year of high school. Well, he found out a few days ago by looking at her texts (he said he wasn't snooping, but saw an unsavory text pop up and read further) about my daughter's sex life. Now I don't pry into what my daughter does in her adult life nor do I feel the need to, as my daughter practices safe and responsible sex. My husband and I both know she is sexually active but as she's going about it as an adult, in a healthy and safe way, we have no problem with it.\n\n\nMy son blew up and called my daughter all manner of horrible words, particularly \"filthy whore\" and \"putrid slut\", demeaning and humiliating her without mercy. I've never seen my daughter cry so hard, she was absolutely devastated especially since she adores her brother and looks up to him. He refused to apologize and then berated both me and his father for \"letting your daughter become a whore\".  \n\n\nWe were all shocked by this and didn't know how to react, really. It seemed so surreal like a scene in a movie, and his father asked him how he could say things like that. My son explained his beliefs and we learned he's frighteningly misogynistic and sexist and violent. For example, he believes all adulterers should be stoned to death and praises ISIS for doing so. He thinks modern women are all disgusting sluts and that there's no good women left. I don't want to list his other beliefs because just typing this makes me upset, but you get the idea.\n\n\nWe tried to reason with him but he simply won't budge on these horribly ignorant and harmful beliefs. Worse, he won't entertain any conversation about this issue with us as he believes he's completely right about these ideas. So for the past few days the atmosphere in the house is incredibly tense. He's carrying on like everything is normal but both my husband, my daughter and myself are constantly in disbelief that he could be like this. I have no idea how to even broach this topic again without him shutting me down instantly. I've raised my son to be open-minded, a true gentleman and I'm saddened that he completely abandoned that. What do I do? How do I even go about restoring the family life we used to have?\n\n   \ntl;dr: Recently learned son is a huge misogynist/sexist. The family atmosphere is very tense and uncomfortable, I have no idea how to approach him about this since he dismisses both me and my husband immediately.",
        "permalink": "/r/relationships/comments/448019/i_49f_recently_learned_my_son_22m_has_some/",
        "comments": [
            "He snooped, then gave an offensive ranting lecture about your daughter's sex life (which is absolutely none of his business), then disrespected you and your husband in your home. That's a pretty awful way to treat people you love. \n\nAt this point I would be making a big deal out of this and laying down some ultimatums: (1) apologize to his sister for snooping and calling her names (2) apologize to you and you husband (3) either group or individual therapy and (4) no longer welcome to live at home if he behaves like this again. ",
            "Personally, I'd tell him that if he is going to treat his family that way, he isn't welcome in the home.  In fact, either he apologizes or he's out.  I don't know where he's gotten these beliefs, but making his stay at your house contingent on him getting therapy would be something else I would seriously consider.\n\nYou cannot just let this go.  You need to step in, even if only to defend your daughter.  ",
            ">Well, he found out a few days ago by looking at her texts (he said he wasn't snooping, but saw an unsavory text pop up and read further)\n\nThat's the definition of snooping. \n\nLook, your son can believe whatever misguided or backwards thing he wants. You don't have to give him a free place to stay in light of it. Tell him he apologizes and keeps it to himself, or he leaves and isn't welcome back until those demands are met. ",
            "...the Internet. The Internet is where he got these ideas. My guess is he got burned bad by a rejection and jnstead of dealing with it like an adult, he sought out an online echo chamber that fanned his anger and hurt into full-blown hatred of women. I have seen it happen and it is goddamn heartbreaking. Doesn't matter how he was raised. He chose misogyny over maturity because being able to blame others for your failures is seductive to people of all backgrounds.\n\nSet an example. Do not tolerate hate speech from him or anyone else, and abruptly end conversations and visits if it arises. Continue to respect your daughter openly, and reassure her that her brother is very wrong and you and your husband do not share his views. Beyond that, he is an adult...you can hope he grows out of it and realizes how deeply he's hurt his sister, but that's up to him. I'm sorry. ",
            "So all  of you are living under one roof and your son has developed some stupid ideas.\n\nFirst off, your sons beliefs are not you doing.  Somewhere along the line he came to those beliefs in a twisted strange way.  You tried your best to raise him but at a certain point people discover their own values.\n\nSecond, there is something you can do to maintain a safe environment for your daughter who seems to be doing all the right things and that is taking a firm stance with your son.  He lives in YOUR house, and you don't have to take that kind of behavior from him.  \n\nSimply put, tell him to not act like a misogynistic asshole when he is around the house or get out.  He shouldn't talk to his sister like that, nor should you allow it.  I'd make it known that he is free to have those twisted views if he wants, but that under no circumstance is a repeat of what happened (with the yelling etc) to occur again.  If if did, he should be prepared to pack his things.  Because that shows a gross disrespect for not only you and your husband, but his sister too.",
            "It sounds like he's fallen in with a bad crowd at Uni. Are you guys Muslim ? Because if you are, a long sit down talk with your own Mullah might be the way to go. Muslim extremists are very active on campuses, and he might simply have fallen in with a bad crowd. A chat with your own Mullah about what is going on here may well set him straight.\n\nIf not, he needs to see a psych, stat. He needs to be talked down from whatever this influence is.\n\nI know you're being told to kick him out, but it must be heartbreaking to see your baby boy turn nasty like this and he needs to be fixed. The risk is, that if you just turn him out, he'll continue in his appalling beliefs.\n\nYou and your husband need to sit him down and make it very clear to him that his behaviour and language is **reprehensible** and that you are disgusted and horrified with him, that this is not how you raised him, and that his behaviour is deeply disappointing to you and wholly unacceptable. He must apologise, wholeheartedly, to his sister and he must attend counselling. If he refuses, evict him.\n\nThe inappropriateness of his behaviour must be brought home to him in the strongest possible terms.",
            "[removed]",
            "Does he live with you? Kick him out. Until he learns how to treat your daughter, *his sister*, with the respect she deserves, he isn't welcome in your home.",
            "Put his ass OUT. I mean, his headspace is totally fucked all the way up but I'm gonna overlook that in favor of a more pressing issue- the message you are sending your daughter if you let your son treat her so badly under your roof, which is supposed to be a *safe place* for her. Not to mention the fact that this IS your house- he has no business dismissing *shit*. \n\nI feel so bad for you, though. I really do. I would be so mortified if that were my kid. ",
            "If your son can't treat his family with respect, empathy, or even a shred of decency, don't allow him in your home. Put your foot down. He sounds like a disrespectful brat who can't be bothered to look past his own views to even treat his own family with a tiny bit of compassion. \n\nIf he lives there, kick him out. If you wont, get him therapy if he wants to stay. I do think kicking him out would be better for your daughter. \n\nTalk to your daughter. Reassure her that she is not anything like what her brother thinks. Since she looked up to him, she needs someone to come in and undo the damage he probably did to her. He verbally abused her, and she should limit all contact with him unless he learns how to respect and love her for who she is. \n\n\n\n",
            "I made an account just to say this:\n\nThis isn't just disrespectful. This is dangerous. He is willing to degrade and abuse his sister, someone close to him, without any remorse. How had his relationship with his sister been prior to college? How has he dealt with extreme stress in the past? (You don't have to answer me but consider them yourself.)\n\nIf he's willing to act this way to his sister, how will he act toward the next woman who rejects him? Or his next romantic partner if she upsets him?\n\nI can't imagine the position you're in and, despite his behavior, I'm sure you love your son and want him to be better. But he needs therapy. I don't know if the ISIS comment is religious extremism as others validly suggested, or if it's just an example in how he views violence against women to be acceptable and right. Since he's an adult I don't know if you can force him into therapy but if you're financially supporting him, cut him off on the stipulation that he gets help. If not, you need to set hard boundaries. He shouldn't be allowed to act as though everything is normal and okay after what he's done. Either he apologizes to his sister and agrees to get help, or you'll treat him like any other adult who screams at your daughter, calls her every misogynistic name purely to hurt her, and refuses to show either you or your husband an ounce of respect.\n\nI guess I'm echoing everyone else but I wanted to drive it home that this isn't just acting like a bad house guest. He said women deserve to be murdered. He yelled it in the faces of his family. His implication is that his sister, who he called a filthy whore, should be stoned to death for having safe and consensual sex. That is not something you can take lightly.\n\nYour son is genuinely frightening.",
            "I know how to deal with him:\n\n\"You have 30 days to move out.\"",
            "[deleted]",
            "[removed]",
            "Does your son know that you've had sex before, OP?",
            "[deleted]",
            "I agree with all the comments saying that you should tell him to apologize and get therapy or to move out. I just want to add that he should also apologize to your daughter for looking through her phone. He absolutely was snooping and he had no right to violate her personal property.",
            "Have you looked at his internet history? I don't know if I would ordinarily promote snooping but it might be good to see where he is getting his beliefs. Also I don't know if you're religious or if he is, but having him sit down with someone with authority who can call him on that stuff might be a good idea.",
            ">and praises ISIS for doing so\n\nThis is a pretty big deal.  What else has he said about terrorists?   You might need to report him before he hurts somebody.  ",
            "While this post is dealing in rather extreme perspectives, we wish to remind you that the encouragement of violent action, implicit or explicit, is not allowed in this subreddit.  We recognize that this post may elicit strong reactions and the extreme nature may require a variety of different perspectives to consider.  However, we draw the line at violence and ask that you respect this boundary. \n\nEDIT: Thanks for the gold, kind stranger! The mods appreciate the sentiment!!",
            "if this was my brother and you were my parents, my dad would kick him out and not let him back until he shapes up and gets over himself.\n\nmy dad doesnt allow that sort of bullshit in his home and my brother would not be welcome here anymore, and my parents would not have issues telilng people he disowned his son over his sexism.",
            "First\n\n> he's back and living with us\n\nand then\n\n> My son blew up and called my daughter all manner of horrible words, particularly \"filthy whore\" and \"putrid slut\", demeaning and humiliating her without mercy. \n\nTell your son to live somewhere else.",
            "This sounds very much like radicalization.\n\nI know you might not want to hear this but I think you and your family need to entertain the thought that your son has changed and there may be nothing you can do about it. I would suggest you retain the services of a private investigation firm---and a lawyer---to look into your son's activity on the internet and off of it. To the extent that is legal in your state, hence my mentioning the lawyer. In the world we live in it's not a far-fetched idea that your son could be radicalizing and going down a very dark path. You need to think of your family's safety right now.\n\nI would certainly kick him out after you had a chance to let the investigators do their work only because it's very important that, if he is indeed radicalizing, he is identified and investigated by the FBI or DHS. This isn't acceptable behavior and the only way you can show that is to remove him from your household. I've known my sister to be sexually active since she was 16 and I would never say such awful things to her.",
            "If he's going to be an asshole, then he can be an asshole on his own.  Kick him to the curb and stop treating him like a kid.  Someone comes into my house and calls my daughter a whore, you best bet they are leaving.  I dont care what their relationship is to me.",
            "Give him an ultimatum. Either he stays and goes to therapy or he can't live there. Comfort your daughter and let her know that you do not condone his actions and love and support her. ",
            "If that was my kid he would be apologizing to me his mother and sister all separately. Then he can eaither get therapy because he clearly fucking needs it or he can get the fuck out of my house. By continuing to let him stay there you are teaching him that his behavior is not only okay but is perfectly acceptable.",
            "The green river killer shared your sons views on women. Food for thought",
            "I agree with everything here, and would also recommend you get him in with a doctor.  His extreme beliefs and blowup out of nowhere could indicate a medical condition or mental illness.  Yes, your daughter needs to be protected from him, but if this is as out-of-character as you describe, there may be a physiological component to it.",
            "Holy shiiiiit, your son is a scary guy. Like very very scary. ",
            "He leaves the house, no question. Reiterate to daughter you and husbands beliefs.",
            "I haven't looked through all the posts, but the top few didn't mention this. I really think you need to consider that he could pose a danger to yourself and your daughter. The ideas he is expressing are violent. Supporting the stoning of adulterers is disturbing. However, adulterers is a term that is heavily influenced by perception. I've heard that people can be punished for adultery even if there isn't proof in some corners of the world. Furthermore, at least in the Bible, there is a verse that says if you get divorced, you're committing adultery with any future partners. The point I'm making is that when it comes to women, rules about sex, and extremist views, all bets are off. If he thinks stoning adulterers is a good idea, there is a high chance he might feel that harming your daughter is also acceptable. Obviously I can't know that, but I would be getting him as far away from her as possible. I would not feel safe with him around. These are scary ideas he has and, while I don't want to freak you out, I don't want anything bad to happen either. ",
            "Regardless that he is your son, he is a dangerous person to have around your daughter. Kick him out and keep him away, we've had too many stories here about siblings who abuse other siblings while the parents do nothing, or offer only token protest.",
            "Your house, your rules.  If he's being abusive and creating a hostile environment, then you need to kick him out.  He's an adult.  He's entitled to his dumbfuck ideas, but he's not entitled to your shelter or support.",
            "Your son is an asshole, but he's a grown asshole. Kick him the hell out of your house.",
            "You need to step up and make him leave. He's 22. He's capable of living alone. You and your husband need to protect your daughter from that toxic kind of mindset. ",
            "Your son should not be allowed to say those words to your daughter. Remove him from the household until he apologizes. \n\nEdit: It's also not your son's job to police your daughter's phone for unsavory texts. He needs to be put in his place about that too. He needs to apologize and never touch her phone again. \n\nThis whole thing is really gross to me. He needs to get his head out of your daughter's sex life. ",
            "As a parent, you have two opposing issues right now, protecting your daughter and 'fixing' your son.   I grew up in a fundamentalist religion and have seen this issue tear families apart many times, so I hope I can offer at least a modicum of help here.\n\nFirst, are all his beliefs Muslim? Or is it a hodgepodge of crap from various ideologies?   I ask because you got two different paths there.\n\nIf it's just a hodgepodge of crap, may I suggest the standard counseling and discover the root issue. Hopefully just a stupid phase.\n\nIf he's going down a fundamental path with Muslim beliefs (or any Abraham based faith) don't bother trying to debate with him that women shouldn't be treated so, or she can do what she wants as an adult.   Because, to him, no she can't.  God said so, AND god said the male(s) in the family are duty bound and judged to make them so.    Quite simply, you can't trump what God said.  You can try the bit about respect your parents and in this house you will do X, but again, you're asking him to ignore God's commands in your house, so I wouldn't count on it.   Sadly here, isolation is often a reinforcement that they were right in the first place and is as likely to harm your goals as help.\n\nYou really only have three likely outcomes depending on his level of exposure, and mindset towards other issues.  \n\n* First, something about this view appeals to him and he's closed to all other thinking, there may be nothing you can do hear but try and find out what appeals so much and try and deal with that.  Some are so accepting of their new ideas, they almost literally cover their ears for points one and two.  If so, isolation to protect your family may be your only choice.\n* Second, discuss the root of his new faith.   The contradictions in the koran, the idea of flying horses, muhammaded being a pedophile, the allowance of sex slaves.   do a bit of research and point these things that his new friends likely haven't.  But do it kindly and as if you were trying to learn about his new beliefs, not from a hey, here's why what you think is crap.   If you present it wrong, you'll be done before you start.\n* Third, Science.   Fundamentalists cling to young earth, the flood, even flat earth in muslim science.   Watch cosmos, have him look up his objections to evolution on talk.origions.   Anything you can do that might open his mind to the idea that he's taking his morality from people that never talked to any 'God' at all.\n\nFinally, it sucks.  And I wish you all the best dealing with this.   Do everything you can to save your son from the path he's on, but set clear boundaries, and repercussions if he crosses them.   Secondly talk to your daughter, and make sure she realizes that his crap is his crap.   She is not responsible for his issues, and she should feel pity for his broken mind, not shame for the shit he says.",
            "Is he a Muslim? Is your family Muslim? It sounds like he got radicalized by an extremist Muslim Cleric, which results in massive and sudden shifts in personal beliefs and principles. \n\nIn which case this issue with your daughter is just a symptom of a much more terrifying reality.\n\nThat comment about ISIS really pulls at me. ISIS cuts the heads off of innocent people. They aren't praised by people casually. That isn't something that is casually tossed around.",
            "Maybe it's overboard but I would call the cops. College is prime recruiting territory for groups like ISIS. Now, I'm not saying this is what happened but at some point he was exposed to it and had it repeated enough that it is now engrained. The fact that he believes in such things makes him extremely dangerous not just to you his family but all women in his vicinity. \n\nHonestly, for your safety, especially your daughters, he needs to be out of the house. A report needs to be filed and if necessary a protection order in place.",
            "Would you let a KKK member stay in your house? Same issue, if you ask me.",
            "Kick him out, OP. Your daughter and you aren't safe with him in the home. If he feels that way, he can go live somewhere without any women. ",
            "In order to protect your daughter from his toxic beliefs and further abuse, I'd cut him off. It's only an assumption, but by ignoring his outburst and continuing to let him stay there he'll probably think that his behavior was socially acceptable. Or even worse, that her feelings aren't as important as tiptoeing around his scary ass ideals. ",
            "Seek help and therapy for him. It sounds like he may be getting influenced and radicalised by extremists if he is directly attributing and praising ISIS values.\n\nIt seems backwards, but there has been lots of news in my country (Australia) of pure Aussie born no Muslim background being radicalised.\n\nIt is paramount to brainwashing, and could be very hard to 'deprogram' him. It may be something worth talking to a therapist about yourself first but also heavily suggesting it for him also. You have the leverage of him living in your home, but be mindful of your country's tenant laws as you may not be able to just kick him to the kerb and may have to legally evict him.",
            "Is he a terper or a muslim kid who is an isis sympathizer? At first I pictured the former but reading the comments it sounds like the latter...that's more fucked up. I would actually be concerned for your daughter's safety.",
            "[deleted]",
            "If he lives with you give him notice to start looking for a place to live then kick him out. Your daughter shouldn't have to deal with that bullshit ",
            "I keep reading a lot of posts that are encouraging you to throw him out of the house and to cut all ties with him until he gives into an ultimatum but I don't think that will help him overcome his problems (which is what it sounds like he has). By rejecting him you'll only reinforce his world views and inhibit any personal growth he could possibly have. You'll also lose valuable time with him from estrangement that you'll never get back. \n\nYou should urge him to see a counselor. He most likely feels some sort of alienation from his peers. With guidance from a professional he can experience personal growth and with this growth will come a changing of his world view.",
            "Sounds like your son was brainwashed in college. If he was not like this before then something changed while he was gone. I'd take this very seriously, kids don't change that drastically for no reason. Therapy would be good but good luck getting him there he's an adult and can refuse it. Letting it go is wrong....... I don't know what the hell I'd do. Is he showing any other weird behaviours? Do you talk to his friends? Perhaps talk to one of his friends and see what they can offer you. ",
            "Is there anything that might predispose him to the other beliefs (re: extremism)?  Look into that, since that's the actual problem, not the words describing the symptoms (the sexism/misogyny).  He certainly ran into something online or someone at college that gave him those beliefs.\n\nI definitely agree that it would be worse to throw him out.  That would deny *any* chance to present a challenge to his beliefs.  It would also give him due motivation to provide more direct support - and die in the process.\n\ntl;dr: Your son was radicalized by someone/something, and this behavior is only a *symptom*.  He needs *help*.",
            "If my brother ever tried to speak to me that way, my parents would have shut his ass down before he could even finish the word \"whore.\" \n\nHe's expressed incredibly violent beliefs and has directed aggression toward your daughter. You are her parents, too, and it's your job to protect her. He obviously has zero respect for women, so I think it might be best if your husband runs point here. I think he has to be told that he either needs to seek counseling or leave your home. He needs help and he should know that you and your husband want to help him get it, but if he refuses, you won't allow that kind of hatred in your house.",
            "Well, now that he's got a job he doesn't need to be in your house. He'll terrorize your daughter.",
            "Your son is openly supporting ISIS... you have a bigger issue on your hands...",
            "You're a really good mom. ",
            "I'm sorry to ask, but is mental illness a possibility?",
            "I mean, I can sorta understand being an overprotective brother. But the vile insults and then\n>he believes all adulterers should be stoned to death and praises ISIS for doing so\n\nThis is sooooo far beyond the pale that I wonder about his overall mental stability. Keyboard psychiatrist here, but 22 is around the age that some mental disorders start to come to light. Boy needs professional help. ",
            "Sounds like he fell in with a bad crowd in college, maybe earlier. Maybe there is a religious/cult component here? In any case, it's unlikely you are going to get through to him unless you lay down the law. Maybe there is a book or something you can demand that he reads?",
            "Could he have been influenced by a radical Muslim terrorist group at college? If you think that could be true, then I would strongly recommend that you start doing some research on how cults and extreme religions brainwash people and perhaps ask for some advice on subreddits that understand how these groups operate such as /r/exmuslim    on how to reason with someone who has been influenced. I know from my own experiences with /r/exjw and /r/exmormon that extreme religions have a lot in common with each other on the way they brainwash people and the approach to trying to wake someone up. \n\n",
            "Sounds like he's upset cause his little sister got laid before he did. \n\nAlthough I agree that your daughter should not continue to be subject to abuse (which is his behavior, explicitly) and has some growing up to do (i.e. Move out of his parents house), I wouldn't suggest alienate him altogether.\n\nI think everyone has reasons, legit or not to believe what they do. If you turn him away, shun him, he will feel justified in his beliefs. How could your opinions be correct if you can't stand for love? He will find other misogynist ISIS sympathizes to make him feel relevant. The guy needs therapy, don't we all. But yeah, he needs therapy big time.",
            "He's disrespecting you, your husband, your daughter, and every other woman in your lives (and any man who disagrees with him). But you know that. \n\nit is *possible* this is a mental break of some kind, like someone said. So if you want to help your son, you tell him he must go to a psychiatric consult of some kind in order to continue living there. You can't force treatment if he doesn't want it, and telling him so may help convince him to go, but he at least should get it to find out if something is wrong. \n\nIf it finds nothing wrong with him, or he refuses to go, then you tell him he has to move out because you won't allow him to treat you, your husband, or your daughter this way. \n\nSeriously. Every day you let him stay there is harmful to your daughter. He thinks adulterers should be stoned, how long do you think before he assaults her? Don't you think she's afraid of that? She doesn't deserve to live this way.  ",
            "I think there is more to this. I think he had a poor relationship or many poor relationships with women in college that led to this. He needs therapy.",
            "You need to ask your son to move out of the house. What he is doing is scary. What happens when he decides his sister is a dirty sl.t and deserves to be beat/hurt for having sex.\n\nI think its time for him to leave the nest, because he is out of control.",
            "I am so sorry.  I don't even know what to say.  I have an 18 year old son and a 15 year old daughter.  Did your son get hurt badly by a girlfriend?  Or could he have some kind of physical problem that is causing him psychological issues (like something wrong with his penis?)  Something drove him to start to research these beliefs and whatever is bothering him made him reinforce those beliefs in his mind.  \n\nI know you can't MAKE him go to counseling at this age, but I would try, and definitely he should not be around your daughter.  I would almost be afraid he might do something violent because he seems so sure of his \"beliefs.\"  Please be careful, protect your daughter and yourselves. I know it is hard because this is your child too.  If there is any way to get him help, he needs it.  ",
            "Kick him the fuck out.",
            " I feel he should be put out not because of his beliefs but because of his behavior. I am with everyone that his beliefs are very misguided and messed up but the point to focus on is the behavior. Everyone is entitled to their beliefs no matter how messed up they are but how they choose to act on those beliefs is the most important thing. ",
            "OP!\n\nYou need to find out if your son is radicalizing. Can you get access to his internet history?\n\nEssentially his beliefs make it very unsafe for you and your daughter (as a woman you shouldn't go against him etc) to be around him but if he's further radicalized, no one is safe around him.\n\nYou can google signs a loved one has radicalized, see if they fit, if they do and you can get any evidence at all, then you can report him to the authorities.\n\nYou should also kick him out of your home, you are passed the point of a normal family with him unless he agrees to therapy and change, but he should do that whilst not living at home for your daughters sake. ",
            "To all of the people here saying she should kick her son out. Are you insane? Have you ever had a kid before?\n\nWhat happens when this guy's family does not support him? He loses the one thing he can turn into. And he will drive deeper into his weird world views, with people who will feed these thoughts. (I assume he was influenced by at least some people, and he will be forced to depend on them, and not the family) The \"my house, my rules\" will drive him further away. \n\nTalk to your son, OP. Ask him what does he think of you and why does he think that way. It will be painful. But better than abandoning your kid into a world which only nourishes hatred.\n\nIf he praises ISIS he probably is in contact with someone trying to recruit him. This is how they grab followers. Maybe contact the police, and report him as a threat. They can monitor his communications and catch him if in any case, he tries to leave the country.",
            "This will likely get buried, but I disagree with most of the posts. I just don't know if hardening your parenting on your child will accomplish anything. Alienation and feelings of abandonment won't convince him to turn a new leaf on his beliefs. This isn't about disagreeing on beliefs. I think it's more about getting in touch with the deeper issuers your son is dealing with to get to this conclusions. \n\nWe all have different opinions. But this is not about that. He's projecting whatever issues he has, be it with women and politics, onto how he believes his family members should act. Now is not the time to kick him out or win him over with anger and a hotter flame. It's about patience and a little kindness, something that maybe he's not feeling at the moment particularly with the opposite sex. \n\nIf that fails, then you did your best to show him love and what's right. Teach and demonstrate why his beliefs are hateful. Not about telling him who's boss and what he should be thinking when truthfully as a person he's free to decide his thoughts and beliefs. \n\nJust my thoughts. People are a little too quick to fierce response here. I don't agree with your son's beliefs but you want your son to be the son that you think he is. I just don't think the methods mentioned here will do that. \n\nAll this is easier said than done. But he didn't develop this thoughts over night. Neither will showing him otherwise. You may have a long road ahead with this. Good luck. ",
            "Put him out. Let him go peddle his bullshit somewhere else before he ruins your daughter.",
            "I'd say kick his ass out like everyone else, but since he idolizes terrorists he might go join them.  \n\nI'm sorry your son is such a terrible person, OP.",
            "He's an adult. Just kick him out unless he applogizes (I'd kick him out regardless, but that's just me). \n\n\nHe demeaned, slut-shamed, and indirectly threatened your daughter. ",
            "That's a scary line of thought out of nowhere, it almost sounds like he joined a cult. I wouldn't reward his shitty behaviour with letting him stay and talk down you guys and your daughter. Especially since he refuses to talk about it or budge in any way. I wonder where it all came from?",
            "Send him packing. Son or not, he's a menace.",
            "Kick his ass out. ",
            "Tell him to get the fuck out. 30 days notice as is customary.",
            "There may be an underline issue.  If he's being overprotective of his sister, does he feel or think that she belongs to him?",
            "Kick him out and cut him off! As his mother you need to put your foot down and show him how unacceptable those views are. It will hurt, but you have to lay down the law.",
            "Kick him out. Otherwise you're giving him a free pass and silently telling your daughter that this sort of abuse is okay.",
            "I feel so bad for your daughter. But are you saying your son supports ISIS!?",
            "The only reason I slightly hesitate to tell you to kick your son is only so you get the chance to see exactly what your son has been doing to get these beliefs. \nBrowse through his phone, his computer, his internet history etc. Then take it all away. No money, no going out, no privacy until he starts to talk.\n\nI'm concerned about whether his behaviour worsens... and whether he continues to treat other people and how far he will go for his beliefs.\n\nKick him out with nothing. It must be horrible for you to hear that but as a mother you need to be strong - you didn't sacrifice to raise a monster. At some point the children you raised and the adults they become are different.\n\nI have a son and if this happened with me, I'd probably beat the living crap out of him. And I mean it. But then, I live in a 3rd world country and could probably get away with.\n\nI'd also make sure his friends know about his beliefs - that way he's have some social pressure to consider and his life wont be as easy anymore. It shouldn't be for someone who doesn't have basic human decency himself.\n\nI'm really sorry you are going through this. But if you need support please PM me.",
            "It sounds he got into some misogynist stuff online somewhere.  I would avoid analyzing how it happened unless it's some life event you can engage him on in discussion.\n\nIf he's 22, it may go away over time.  Are there any other relatives he's close to you could talk to?",
            "Any chance this could be the start of a mental disease, brain tumor or something?",
            "I would be terrified and probably notify FBI. Radical ISIS view and violent outburst? It is no laughing matter nowadays.",
            "College seems to be a recruiting ground for extreme groups of all fronts, I just hope he gets over this and it's just a phase, maybe coax him into smaller simpler thing like a \"family night\" where you all hang out, maybe play a board game, and don't mention his recent behavior immediately but try and reunite as a family. Or possibly he went through something traumatic he won't admit, honestly I'm not sure, but either way I certainly hope for the best!",
            "[removed]",
            "You might explore the possibility that he has been sexually abused in the past by a woman.",
            "[removed]",
            "[removed]",
            "I almost thought this was my own mother from 4 years ago writing this. This was me, minus the Islam component. In my case, the story never reached a happily ever after conclusion.\n\nThe female I once considered my sister and I don't talk and I'm very happy with it the way it is. I still think my dad was a weak loser who encouraged my sister to be a dumb, loose \"experimenter\" through his cuck-like lack of explaining how guys can be to her, mostly because he was a complete geek himself and doesn't understand men and women at all.\n\nThe only part in all of this that affects me negatively is knowing that my actions are a consistent source of sadness and pain for my mother and father. However, in this family, the girl also did two-faced things to me prior to me discovering her sordid personal history that made me hate her forever.\n\nPlease, whatever you do, don't try to force him to pretend everything is okay between the two of them.\n\nRegarding Islam, I'm not sure how he has developed these strong views, but I would encourage you to consult with /r/exmuslim. They are really skilled at handling tense situations like the one you described.\n\nBest of luck.",
            "[removed]",
            "Maybe some day he will grow up?  Or you can all distance yourselves.  ",
            "Honestly\nI think maybe he watched too much porn and messed with his head. Porn can lead to men hating women but of course he would have to be a bit disturbed to begin with. Ask him how much porn he watched but unfortunately you cant do a thing about it as he's an adult but keep your daughter away from him. ",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "43pba4",
        "author": "hurtneedhelp",
        "title": "My [23F] boyfriend [28M] of 8 years says I'm abusive. I'm confused, need advice.",
        "url": "https://www.reddit.com/r/relationships/comments/43pba4/my_23f_boyfriend_28m_of_8_years_says_im_abusive/",
        "score": 2274,
        "num_comments": 584,
        "created_utc": 1454345494.0,
        "selftext": "Hi guys, I'm using a throwaway and avoiding names for anonymity.  \n\nSo, I don't really know where to start. It's almost a decade of my life and I could write about it for days, but I'll try to pick out the unimportant bits.\nI [23F] have been with my boyfriend [28M] for 8 years. \n\nI know it's pretty much impossible to paint a good picture of someone through a few paragraphs of a story, especially considering I'm mostly pointing out problem areas, but please keep in mind that he's a good person. He's loving, gentle, cares about me than anything and absolutely devoted to me. But we have tangled this relationship into quite a mess.\nLike everyone who posts here I have countless reasons to want to stay, but I'm having trouble taking off these rose-colored glasses. Please help me, Reddit.\n\n**Backstory:** \nWhen we started dating I was going through a lot of shit, and he was the first guy I have ever been with. I was the one who was always compromising and always finding ways to go see him. He very rarely came to see me, and if he did he would get irritated and complain that he shouldn't have to. He would ask me to come over every single night, saying he missed me and he couldn't sleep. I lived about an hour away, and I didn't even have a car, so when I'd find rides to his house (bus, friends driving me, etc.) I was excited to see him. I'd get there early in the day, and instead of seeing him, I'd sit on his couch alone for HOURS while he played video games. It was infuriating, because I played games too, but he always told me not to bring my console because I could use his (he had literally zero games for it), but I always ended up just pacing around his house, waiting for him to give me a second of his time. As bad as this sounds (and it was), he was so sweet and sincere when he would finally get done, he told me how glad he was that he could keep up with his legion and still have a girlfriend (he said although he ended up breaking up with his last three because of fidelity problems, they hated him gaming.)\n\nI was young and stupid, and caught up in being the cool girlfriend.\n\nI used to have a lot of fun, going to clubs and parties and all kinds of things. I had a ton of friends, mostly male. He would get upset if I talked to them, even the ones I had known since I was a toddler, and he said that since he didn't talk to girls then I shouldn't either. (Little did I know, he actually was talking to a few girls all this time.)\n\t\nHe said I love you two days into dating, and proposed after a few months. I told him I wasn't ready, that I loved him but I was too young and I needed to get to know him better. He was different after this, like it hurt him for me to say no. \nAfter a few months together, I'd tell him I was about to do something (like walk to the grocery store since I had no car) and he would SCREAM at me over the phone. He said I was an idiot, going to get myself killed, women can't walk alone, especially near nighttime. I know what you're thinking, why would I stay with a sexist asshole?? Well, he had never made it seem like he was sexist before, and would deny saying it. He would say he never said any such thing, and that he was only worried about me. I'd ask why he screamed, and tell him it wasn't okay to treat me like that, and he'd say “I have never and will never yell at you.”\n\nAt this point I'm already doubting my sanity, but the other 75% or so of the time, he's so incredibly sweet to me. I moved in with him about 10 months in because my mother died, and I had no where else to go. I had a job, but didn't make enough to support myself. His family owned farm land in the south, and had bought him his own house.\n\nAbout a year into our relationship, I found out that he'd lied about every single thing he'd told me about himself. The way I found out was the worst part; he just told me. He forgot that he'd lied in the beginning, and he'd start randomly telling me things like, “I almost married my high school sweetheart, but she changed her mind last second” and “my tenth or so girlfriend calls me every weekend to say she wants to fuck.” This is after telling me that he's been with only three others before me, and that he doesn't talk to any exes. None of this would've mattered to me if he'd been upfront in the beginning, but because he lied and was using the whole “I don't talk to girls, you can't talk to guys” bullshit to keep me from having male friends, I was pretty upset. \n\nA few weeks after that, I told him I was going to the movies with a female friend for her birthday. I told him the movie was at 7 and I'd be back before midnight. We wouldn't be drinking, partying, anything like that. Well,at about 9:30 I start getting horrible texts. I'm a “lying bitch,” I “better enjoy the dick I'm getting because I'm never getting [his]” again, and that he doesn't want to see me when I get home.\nI was crushed. It was the first time I'd seen ANY friend since we started dating, and she had never met him, but she saw what he was sending me. I ignored him and ended up getting home at 11 pm. The house was trashed, and he was up waiting for me. When I asked what the hell he was talking about, he slammed the door in my face (literally, it hit me really hard in the nose) and screamed “fuck off!”\n\nI slept on the couch. The next day he left without saying a word to me for a softball game he'd been planning with his friends. I was still pissed, so  I called him as soon as I woke up (btw, he was OUT OF STATE, and would be sleeping in a motel room with multiple single girls/guys for the next five days) and I told him he's an asshole I'm done. He was absolutely desperate over the phone for me to give him another chance, but I hung up. I packed everything I owned and tried to leave, but he showed up right before I could and was very sincere about getting help. \n\nThe next day, he stayed out until 5 am at a strip club and came back without his promise ring on. He said he'd put it in his pocket so he wouldn't lose it, but he smelled strange and was acting strange and I just know that he cheated. He vehemently denied it, saying I was insane for accusing him and that we should just break up if I wasn't going to trust him. I said okay, and started packing AGAIN. Then he said he'd never said any of that.\n\nAfter the fight earlier, he said he'd go to therapy, stop punching holes in the walls, pay more attention to me and even let me go to clubs again and resume contact with my male friends. Well, he did start therapy. He went for three months, and nothing changed. He continued to punch and break things, scream at me, tell me everything was my fault and that he couldn't stand me. He turned to drinking and when he'd get violent and drunk, he said I was the reason he was forced to drink. Because I was causing him so many issues. Well, things got better then they got worse, they were up and down for a while but we had a good period of about four years. \n\nThere were several large fights over the years, here a few that stand out:\n\nThe day my favorite aunt died, I was with her at the hospital. I drove a shitty vehicle there that was known for breaking down. After she passed I was a mess. I told him I was leaving and would be back soon. We lived only a few minutes down the street, but my car broke down and I was about 15 minutes late. I got home and he was furious, said I was cheating on him and that was why I was late, screamed that I was a cheater and the landlord who was our neighbor heard the whole thing, he always hated me after that. No apology after he calmed down, instead it was my fault for causing him to worry.\n\nI was feeling depressed about the amount of porn he watched versus how often he was interested in me. We used to have a ton of sex, we had six different FFM threesomes with multiple girls he chooses and I tried everything to satisfy his kinks. But then I just stopped being enough. Hint; he preferred porn and good ol' Jennifer Haniston. (hmm it's not very funny in this context huh?) \nGuys, I have zero self-esteem at this point, and I'm just dreading waking up every single morning. \n\nOne day, after a month of no sex, he locks himself in the bathroom and I can hear him in there, I get so sick to my stomach and have an anxiety attack (I'm a very in-shape, busty girl. I'm in gymnastics and have always been told I'm generally attractive, so it's not a weight issue or anything. I suspect porn addiction). I'm hyperventilating on the floor when he comes out, and he's sweet for a moment, asking what's wrong and to please talk to him.\n\nWell, I trusted him and I shouldn't have. I told him in the most calm voice I could that it makes me feel sad when he chooses porn over me, that we've had sex 4 times in three months and I wish I had more from him.\n\nHe completely lost it. He grabbed my shoulders so hard his nails dug in, he shook me and screamed that he doesn't even watch porn, that he is so whipped by a stupid bitch, that his life is shit because of me.\n\nI have always been very sensitive and I cry at the drop of a hat, I know that makes him feel like I'm trying to manipulate him. But even if I lock myself in the bathroom to cry, in private, it's still my fault and I'm using it to control him. I don't have anywhere to go, and I cannot NOT cry sometimes, is there something I could have done to show him I just need to cry sometimes?\n\n\n**That brings us to now.**\nMost of the year was good, but the past few months he's been screaming a lot more. He's told me that I am a horrible person for trying to leave him years ago, and that I don't deserve him and will never find another guy who'd put up with me. He always denies things and tries to make me sounds crazy, so this time I recorded it. Later when he was more calm I played it for him, and he accused me of inviting guys over the pretend to be him so I could get him in trouble. What the fucking fuck???\n\nHe's done much more. He's gone through every file on my computer and set the only dirty one he could find as my background to humiliate me because he knew his family was coming over. He wanted them to see the filthy shit I look at. Remember earlier how I said he has a porn addiction? Yeah, he's at a level of hypocrisy that I just can't understand. \n\nI know this is incredibly toxic and I am so sick of feeling suicidal.\n\nI just wanted to know one thing; am I the one who is abusive? I know I didn't give very many examples of things I've done, and maybe if he posted his side you'd agree with him, but what about my trying to leave? Was that a horrible act of betrayal? Because he is convinced it's worse than cheating, and says he is abused and is a victim. I am just so confused and feel constantly devastated and lonely. I have no one if I lose him :(\n\nPlease, send help\n\nTL;DR: Toxic relationship becoming too much for me to handle, and I'm confused about my role in it. Am I a horrible person? What do I do?\n\n**Edit:** I guess it doesn't really make sense for me to ask if I'm being abusive since this is from my point of view and for all you know I could just leave what I do out, so I don't really know what I'm asking. I guess I just want to see what others think. I feel like I'm crazy.\n\n**Edit 2:** He just texted me that he saw my post and is coming home\n\n:[\n\n**UPDATE:** I'm somewhere safe now! I'll post a full update as soon as this post dies down because the one I posted got removed!\n\n THANK YOU ALL SO FUCKING MUCH.\n\n**UPDATED POST HERE:** [update](https://www.reddit.com/r/relationships/comments/43wk5m/update_my_23f_boyfriend_28m_of_8_years_says_im/)",
        "permalink": "/r/relationships/comments/43pba4/my_23f_boyfriend_28m_of_8_years_says_im_abusive/",
        "comments": [
            "I think the psycological term is projection.  He is calling you a cheater and an abuser, because HE is a cheater and an abuser. Most abusers are notall horrible all the time, it would be too easy to leave them. No, they vary up the abuse with times of being terribly sweet, just to keep you hooked, and keep you hoping that today is the day sweet boyfriend comes to stay, and horrible boyfriend goes away forever. But that never happens, the abuse gets worse and worse as he sees what you will put up with without leaving. And of course, it is all your fault, all the time.\n\nFind a safe place to go, and leave.  If he really thought you were abusive, he would leave you, not tell you it is all your fault and you have to change even more. So do the right thing for him and you, and leave.",
            "Here's my honest answer, I would rather live in the back seat of my car than with your psychopathic boyfriend. Call all of your friends, even though you think those bridges are burned they might not be.  ",
            "Edit 2:  Leave your house immediately.  You do not want to be alone with this man, he may hurt you.  GET OUT NOW!",
            "To Edit 2\n\nLeave now and call the police!!",
            "OP if you are anywhere near Georgia or South Carolina please send me a PM. I will come and get you no questions asked. I'm a 23F also, you can check my posting history to confirm. I will give you a place to stay and something to eat until we can figure out long term plans. I am scared for you right now based on everything you've written, especially your second edit. Please, please be safe. ",
            "OP, your last edit was two hours ago.\n\nPlease tell me you're safe and out of the house. Go to a shitty hotel, go to shelter, just don't stay with him. He's abusive physically and verbally, you do not deserve that. You have options to a life without him.",
            "[deleted]",
            "[deleted]",
            "To edit 2: Leave the house!!  This guy is unstable.",
            "Get out, now. He is incredibly abusive. Please just run and never look back.",
            "He's calling you abusive to deflect from his abuse. You deserve better than this.",
            ">Edit 2: He just texted me that he saw my post and is coming home\n\nWoah, get the fuck out of there!  This guy is scary.  You need to get away from him.",
            "Whenever I see posts where they say \"75% of the time he's fantastic!\"  Well, if I offered you a brownie and told you that 25% of the brownie is dog shit, would you eat it?  Even though the brownie is 75% chocolaty fudgy goodness?",
            "> Toxic relationship becoming too much for me to handle, and I'm confused about my role in it. \n\nDoes it matter?  \n\n> Am I a horrible person? \n\nAgain, does it matter?  \n\n> What do I do?\n\nYou leave.\n\nLook, regardless of your role in your relationship's toxicity, and it is evident your relationship is awful, you should leave.  \n\n> I am just so confused and feel constantly devastated and lonely. \n\nWhy on Earth would you stay?  That's an awful way to feel, OP.\n\n",
            "At this point it really doesn't matter who was more abusive (by the way, i didn't see any abusive behavior by you (he's the one grabbing your shoulder and punching walls). \n\nThe fact is, you two are toxic together, and have no business being with each other. \n\nJust move on, and never speak to him again. You two can never have a successful relationship, and sooner he is out of your life, better off you'll be. ",
            "Um, he's emotionally, verbally, and physically abusive to you. HE is a horrible person. What should you do? Leave. This relationship won't get any better than it is now, and you've wasted far too much time on him already. You're only 23, there's so much more out there for you. Don't waste any more of your life with him.",
            "Saw edit 2.\n\nRUN!! NOW!!",
            "Leave. He's nuts. Just go. Come back later with cops to get your stuff. Block him on your phone.",
            "So many people on here are going to tell you to break up and leave. And while that's obvious to all of us, it probably isn't to you, because for 8 years he has made you think that the way he treats you is okay and the norm, to the point where you're questioning your own actions.\n\nWhat I would suggest is to look up some services in your area that deals with victims of domestic violence. I can't link anything here, but there are a ton of resources out there that can help you. It's going to be hard. He's going to convince you to stay. He's going to tell you everything you want to hear. But you have to ignore it.\n\nDo you have a job/money where you can hide out in a hotel for awhile? Do you have friends in the area you can stay with while you figure out your next steps? You mentioned in the comments that the women's shelter said they were full. Can you call them back and ask them to help you in other ways? Maybe suggestions on other places you can stay? \n\nCall or visit the Department of Social Services in your city. Their websites usually have a list of resources.\n\nI'm sure all of this sounds completely overwhelming right now. If you'd like, feel free to PM me, and I can actually send you some links and help you further, if you'd like.",
            "Please leave. Message me. I will give you my phone number. I will buy you a plane ticket and let you stay with me. I know it sounds crazy but my ex sounds EXACTLY like your boyfriend and let me tell you, IT WILL ONLY ESCELATE. THE HOLES IN THE WALL WILL BE YOUR FACE. He's the worse kind of abuser. Please please leave. Please message me if you need a friend. I can tell you I sincerely care (25/F here)",
            "OP,\n\nYour story sounds a lot like my friend's story, minus the age difference. She was my best friend growing up. She got mixed with the wrong people out of high school and ended up dating this abusive asshole who sounds eerily like your boyfriend. She didn't listen to reason and ended up alienating her friends for this guy.\n\nLast June, he came home one day and murdered her. \n\nHe came home and started an argument. He threw her down on the floor and strangled her to death. Then slashed her wrists to make it look like a suicide. \n\nPlease heed the warnings of other folks here and leave. He is easily capable of killing you and it will probably escalate to that.",
            "OP Please, if you need help or a place to stay in NYC please contact me! I can provide you a room, or find you a hotel to stay in. Please be careful! I will link you another story of a girl in a similar position to you so that you can see what we see when we read your story.\n\nhttps://www.reddit.com/r/relationships/comments/427124/flying_to_visit_my_26f_boyfriend_27m_1_month_6/\n\nPlease be careful, your boyfriend is crazy and trying to keep you confused so you don't know which way is up. I swear that if you get a little distance a part (only a few months) you'll start to see that he's just telling you bullshit. Please protect yourself. \n\nLook at your writing and then read the girl's, it's so obvious how much bullshit your guy is spinning you to us, because we've all been that 15 yo girl who dates a guy in his mid twenties. \n\nMy question to you now, is would you ever date a 15yo boy???\n\nSigns that you’re in an abusive relationship~~~~\n>Your Inner Thoughts and Feelings Do you: feel afraid of your partner much of the time? avoid certain topics out of fear of angering your partner? believe that you deserve to be hurt or mistreated? wonder if you’re the one who is crazy? feel emotionally numb or helpless?\n\n>Your Partner’s Belittling Behavior Does your partner: humiliate or yell at you? criticize you and put you down? treat you so badly that you’re embarrassed for your friends or family to see? ignore or put down your opinions or accomplishments? blame you for their own abusive behavior? see you as property or a sex object, rather than as a person?\n\n>Your Partner’s Violent Behavior or Threats Does your partner: have a bad and unpredictable temper? hurt you, or threaten to hurt or kill you? threaten to take your children away or harm them? threaten to commit suicide if you leave? force you to have sex? destroy your belongings?\n\n>Your Partner’s Controlling Behavior Does your partner: act excessively jealous and possessive? control where you go or what you do? keep you from seeing your friends or family? limit your access to money, the phone, or the car? constantly check up on you?",
            "He is abusive. Check out LoveIsRespect.org for more reading and resources. And make an exit plan to get out. Good luck.",
            "I'm really worried about you OP. Let us know if you're okay. Your boyfriend is abusive 100% no question. This relationship is toxic and you need to leave.",
            "Jesu christe I hope she's ok. ",
            "[removed]",
            "It’s been 6 hours since OP updated and I’m really worried.. ",
            "YALL SHE PMed ME BACK. SHE'S OKAY. SHE TRIED UPDATING BUT HER POST IS STILL ON THE FRONT PAGE!!!! BUT SHE'S ALRIGHT!!!! :D",
            "Where are you? Pm me, I will come get you if you're in the PNW and get you in touch with women's shelters. I hope you left the house. Please be safe. ",
            "He snagged you when you were 15 and vulnerable, and has managed to crush every ounce of independence or self-esteem you might have developed.\n\nGet the fuck away from this creep before it gets EVEN WORSE. Holy shit. I'm just so sad and worried for you.",
            "Just saw second edit. Please, please, please just be out of the house when he gets home. The next time you talk to him, if at all (though I agree with most posters that you should never talk to this guy again), have it be in a public place. I'm concerned for your safety.",
            "I stopped reading halfway through when it got too creepy to handle.  OP, when you were 15, you had a 20 year old tell you he loves you after 2 days.  That is creepy as shit and just the first half of your post was enough red flags to sail a ship(especially the obvious gaslighting).\n\nTake the advice others are giving and get out, please.",
            "I am scared for you OP. Genuinely terrified. No matter what he says when he gets/got home, you need to leave. He is abusive, you are not. You tried to leave and that was being STRONG.  \n\nBe strong, I know you have it in you. We all. do. You deserve a better life where no one ever screams at you, ever. \n\n",
            ">Edit 2: He just texted me that he saw my post and is coming home\n\nWhat the heck.  How did he find out so fast.  Does he constantly refresh /r/relationships all day long trying to get dirt on you?  \n\n",
            "Go to a police station while you figure things out.",
            "GIRRRRL: When you started dating, you were 15 and he was 20! You were a teen-ager and he was an adult. He knew you had very little experience with men, and he's used it to his advantage for years and years. He's tried to cut you off from your friends and family. He can do what he likes, and he gets violent if you question him.\n\nRun! Run fast, run free! Run like the wind! Just - run away from him and stay away, and do what you need to do to keep him away. Find people who will help you, and get back to your life, free from fear and confusion.\n\nDid I say run? RUN!",
            "Fuck this little insecure twat. I hope you're reading this, bro, because you don't get to treat ANYONE like that. She's not *lucky* to have you, you scum. She could pick anyone, but she's clearly invested in you, and you used that to your ugly advantage. Soon you'll be alone, sad, desperate, and the only thing you will have left is paid sexual contact and your 14 year-old, teenager porn habit. Grow up, loser. Putting your hands on your girlfriend, yelling in her face, saying degrading things??? Yeah, wow, she must be SO lucky to have you! You're dirt. You need serious therapy, and you need to revisit whatever fucked up childhood scenario that landed you here as an entitled piece of shit.",
            "So a 20 year old man starts grooming a 15 year old CHILD and you're asking if YOU'RE abusive!? Get out.",
            "Please go and stay with a friend.  He sounds very abusive and scary.",
            "Typical textbook abusive behavior from him... OP I am concerned for your safety, please get out of there while you can. ",
            "RUN, RUN AWAY. This guy is emotionally unstable. Pack your stuff, get the fuck out. Call the police if he touches you. You second edit made me scared for you. You owe him nothing.",
            ">please keep in mind that he's a good person\n\nNo 20 year old who dates 15 year olds is a good person.\n\nFull stop. Period. \n\nThe rest of your post is just details about how much of a piece of shit he is. It's not going to be easy. He's almost completely bent you to his will (you may have heard the terms \"grooming\" and \"gaslighting\"?) but the best possible thing you could do is leave him. Make sure you're safe from him. Cut all contact and work towards creating a more healthy life and environment for yourself.",
            "I was going to quote a few of the red flags but as I read the whole post there were so many it would have been futile.  This man has abused and manipulated you for your entire relationship.  At this point you are so controlled that he has made you feel as if it is all your fault.  If you learn nothing else from this post please realize this.\n\n\nIT IS NOT YOUR FAULT\n\n\nNow, print out your post, pack any essential items and leave.  Go to the police, go to the public library.  Go anywhere you think there will be adults that can help you.  Tell them you are in an abusive relationship and afraid that your now ex may hurt you if you return home.  Do not let him convince you to return or that you are to blame.  For the love of god, please survive this.\n\n\nIT IS NOT YOUR FAULT",
            "Holy shit I am so afraid for you. Please post an update as soon as you can! Gaslighting and abuse is so scary and it's awful to doubt your own sanity. I've been there. Please be safe.",
            "OP we need to know if you're ok. Please be ok.",
            "ok I'm not calling bullshit on her or anything but this struck me as odd:\"his family owned farm land in the south and bought him his own house.\"\nThen later: \"Screamed that I was a cheater and our landlord who was our neighbor heard the whole thing, he always hated me after that.\" \nI know this is probably low on the priority list but can someone explain what I missed? \nAlso people who are controlling narcissistic shit heads prey on younger people because they don't know any better/easier to control. ",
            "Hope you are somewhere safe OP.   That second update is VERY concerning.  ",
            "OP please tell us you are alright, we are TERRIFIED for you. ",
            "Hey, OP, are you safe? \n\nIf you still need help and are anywhere near me, I'm 20F in NW Ohio (check my history, I'm real). Basically any random stranger on the Internet would be safer to be with than your boyfriend. \n\nPlease do your best to get safe. We're all worried about you. ",
            ">UPDATE: I'm somewhere safe now! I'll post a full update as soon as this post dies down because the one I posted got removed!\n\nHoly shit thank god. ",
            "If all this is true, then you guys need to break up. I know people use this phrase a lot, but your relationship is toxic as fuck. Plain and simple. Break up. Move on. I don't know which of you is abusive since you probably wouldn't post things that you've done wrong, but it doesn't matter. The relationship is absolutely awful and it needs to end. ",
            "Please contact the police, get somewhere safe, and consider deleting your second edit (and comments referencing it) if you are able to do so in time. It can totally confirm your identity to him (especially if he was just fishing and saying he knew it was your post when he wasn't sure). I'm very worried about your safety.",
            "Once you get out and away from him, you should check out the book \"Why Does He Do That?\" by Lundy Bancroft. This goes for your boyfriend too if he's reading this. Abusers (which is what your boyfriend absolutely 100000% is) almost never change, the only thing they tend to take away from therapy long-term is how to use therapy-language to manipulate their partners. Which is exactly what he's doing with you, sounds like. ",
            "have there been any updates? I'm so worried for OP.",
            "If I'm honest, I couldn't sleep last night not knowing whether or not your were safe or alive. I kept refreshing the page at work hoping to get an update to hear that you're safe. I don't think I've ever been this concerned for a complete stranger before. \n\nI'm really glad to hear that you're in a safe place. If you need anything, anything at all, feel free to reach out. ",
            "Has anything actually changed in your relationship?  I mean 8 years of the same old shit, and you are back to square one. \n\nHe is the abuser, he is manipulating you and gas lighting you.  Look up gas lighting, he is convincing you he does not yell, and denies his behavior, leaving you feeling like you are the villain, which is classic mental abuse. He is making you question your sanity.\n\nconvincing the abusee that they are the abuser is classic mental abuse, this whole post is classic mental abuse, it reeks of it. \n\nIs everything always your fault, does he ever take the blame for anything, or is everything wrong with his life your fault?\n\nIf he never lets go of the things you feel guilty for, it is because he knows those things hold power over you (like trying to leave him).\n\n8 years and you haven't seen through his bullshit, you need to get the hell away from him, it will end badly no matter what, but the sooner the better. hopefully you will get away, best update us OP. ",
            "Holy shit. Leave. Now.\n\nYou are not even a little bit abusive in this relationship, but you are 100% BEING ABUSED.\n\nLeave. Find a friend to stay with. And never talk to him again. He doesn't deserve it. Aaaagh.\n\nEdit to your Edit 2. HOLY SHIT. LEAVE NOW. STOP READING THIS. LEAVE. STAY IN A HOTEL IF YOU CAN'T FIND SOMEONE TO STAY WITH. LEAVE.",
            "You are NOT crazy. You are an intelligent, young woman who's in a horrible situation.\n\nI've just read your story and I'm so sorry for you. It's not your fault, your boyfriend sounds like he's projecting his abusive and cheating behavior on you. I agree with everyone else here: you deserve a loving and caring boyfriend.\n\nPlease let us know if you're safe. ",
            "The latest edit is terrifying, please assure us you're alright when you get the chance. ",
            "It doesn't matter of you've been with him for 8 years. That's 8 years too long. Your relationship is so toxic you're even questioning being with an abusive bastard. \n\nLeave. Get therapy to get your normal meter straightened out before you get into another relationship. ",
            "Getoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetoutgetout!!!!!!!!!",
            "Get. Out. Get out get out get out get out. Go wherever you can. A friend's house, any family you have, a women's shelter, anything. If you don't have time to pack, don't. Leave everything there. Stuff is replaceable. Your life is not. He's already shown you clear signs of physical abuse. Even if he's sweet 75% of the time, the other 25% could easily kill you. Get out of there right now. ",
            "FUCKING LEAVE you don't know how he's going to react to this point. You both cannot be together. This is toxic. ",
            "You feel like you're crazy because you're dating an abusive asshole.\n\n**GET THE FUCK OUT RIGHT NOW.**",
            "Op did you get out? I dated someone just like this and he would have killed me had I not left when I did. Porn addiction, blaming me and a busing me and my cats while telling everyone I was a shit girlfriend and crazy.\n\nPlease escape asap",
            "Leave the house. Now.",
            "I sure hope this is a troll post and you haven't really been putting up with this shit from a guy.  You story makes him look like a psycho creepy guy starting with the fact that at 20 he was dating a 15 year old girl; and extending through years of him acting crazy and cruel.  \n\nEven if you are leaving a lot out and are not good to him sometimes his actions are no excuse and you need to get out of this relationship. \n\nSo if it is real then please leave now.  Do not let him stop you.",
            "YOU ARE IN DANGER. He is abusive, with a history of violence, and you need to CALL THE POLICE NOW. I sincerely hope you're safe. Getting physical when you try to leave is abuse. Claiming that breaking up with him is worse than cheating is manipulation and abuse. Calling you a \"lying bitch\" is manipulation and abuse.\n\nI dated a guy a lot like this for about 4 years. He would destroy my self-esteem, guilt me about any and all friends, and said that I owed him sex since I'd been with \"all those other guys before\" him (there were 5 others), and generally feed me bullshit about the horrible person i was and how no one else would ever \"put up with\" me. It was all lies, but I ate it all up like a starving person. When I finally wised up and tried to leave, he refused to get out of my house, broke glasses, and slammed me repeatedly against the heavy door to the garage. I had bruises and bumps on the back of my head and arms. When I tried to tell his friends and family that I felt threatened by his behavior, they laughed and said I must be talking about someone else since it was so unlike him. Leaving him was worth every tear and bruise, but I would never wish that on another person. Please, call the police to let them know you are in trouble.\n\nHE WILL PHYSICALLY HARM YOU if you do not leave before he gets there. CALL THE POLICE. They are trained for these situations and MUST take you seriously.",
            "For the record, my alcoholic abusive mother told me it was all my fault she started drinking. She also has anger management issues and would throw shit and beat down doors. She had her moments where it seemed like it was worth it to stay in touch and talk with her, but the bad outweighed the good after a while. My dad stayed with her for 30 years trying to get her to see what she was doing to herself and her family and it was probably the largest waste of his time and our safety that he could've done. His finances are a wreck, she tried to kill him and a few of our relatives... Honey, it's really just not worth it to stay with someone like that. They destroy your life, they destroy your family's life, and they destroy your friends' lives. I got myself a job far away, took out a loan,  and moved the hell away from all of it. \n\nTalk to a women's shelter, and start making plans to get somewhere safe. Cut this guy out of your life. You're worth so much more than this. ",
            "This is a level of gaslighting I've never seen. \n\nOP I'm so scared for you, I'm almost in tears. Please get out of there.",
            "OP, I just saw your second edit and I'm extremely worried about you!! Please leave the house, don't worry about leaving any belongings. Just leave. Take it from someone who's been in your position, it may seem like you're the abuser but you aren't. He's manipulating and gaslighting you. I hope you are safe, and please please please leave and go to the police or a safe place. ",
            "I'm really hoping you update soon. The second update is honestly terrifying, and I hope you're okay. ",
            "So happy with that last update. I was so worried I kept refreshing the page",
            "Oh thank GOD.",
            "D:\n\nGET OUT!!!\n\nGET OUT OF THERE!!!!",
            "Go to the police immediately and ask for help. Do not go home. This man is going to hurt or kill you.",
            "This sounds all too familiar. Grab your absolute essentials and get out, this will end with him hurting you, possibly hospitalizing you, maybe even killing you. \nHaving been where you are, I can tell you that your friends whom he has taken extreme efforts to isolate you from still love you and they will help you. Five years after playing a big part in my escape from an abusive asshole, my white knight became the most fantastic partner I could ask for, so never think that those bridges are ever actually burned. \nAlso, you don't deserve this. I feel like that's important to say because abusers tend to have a sick gift for making you feel as though you deserve everything they throw at you and then some, and that is nothing but smoke and mirrors to justify their abhorrent behavior and to try to convince you to stay. The road back to a healthy self-esteem is long and winding with a fucking ungodly amount of ups and downs, but this is absolutely something you can come back from. You've already been so strong for such a long time, you can easily find the strength to leave and never look back. I really wish you the best, please keep us updated!",
            "For the love of god or whatever the fuck you believe in, GET. OUT. NOW. Don't pack anything, just grab your phone and go. Get to the nearest police station and hole up with them. If he's going to confront you, you may as well be around trained officers.",
            ">> please keep in mind that he's a good person. He's loving, gentle, cares about me than anything and absolutely devoted to me. \n\n\nBut ... you then go on to say that he's violent, unfaithful, verbally abusive ... I'm confused.",
            "If you are anywhere within 3 hours of central Ohio I will come get you right now, but GET OUT OF THAT HOUSE. DO NOT BE THERE WHEN HE GETS HOME!!!!",
            "Yo op, you ok? ",
            "OP, if by any chance you are near Ottawa ON, let me know. I am a 24 year old female. I will help you. I've done it before, I'll do it for you.  You're in danger. ",
            "I am SO SO SO happy to hear you're okay. I've been refreshing this post since I read it yesterday afternoon. I literally have tears in my eyes. Thank goodness you're safe.",
            "OP is safe!!!!!!!!!!!!!!!!",
            "thank fucking god, i just stumbled upon this and got pretty immersed, when i read edit 2 my mind exploded.  very happy to see OP is safe",
            "I AM SO RELIEVED TO SEE YOUR THIRD UPDATE! I checked back so many times, hoping I wouldn't wake up the next day and see a terrible crime on the news. Glad you are safe!",
            "Oh thank you for the update!  I'm so glad you're okay, Internet Stranger!  I've been worried sick about you and refreshing your post regularly just waiting for an update.  Stay safe, stay smart!  \n\nIf you're in central FL,  I offer my place and services as a temporary haven, just PM. (26 F) ",
            "I'm sure a lot of people are genuinely happy that you posted the final update saying you're safe. ",
            "No joke, I'm so relieved to see your final edit. I have never been so scared for an internet stranger.",
            "You need to leave the house before he gets home-grab your stuff and RUN bc he is the abusive one.  get out. Block him. Tell your parents. Get into therapy.",
            "Honey, HE is abusive.\n\nTHE CALL IS COMING FROM INSIDE THE HOUSE.\n\nHe is controlling and manipulative.  He is gaslighting you.  He hasn't hit you--YET--so you may think, \"Well, he may be doing all those things but he isn't beating me, so...not abusive!\"  \n\nPhysical harm is only one tool in the abuser's kit.  There are so many others and he is using all of them (note:  punching holes in wall and telling you that you are blame?  That's a signal to you:  this could be you, he's telling you,  \"But I'm a good guy, so I'm going to put a hole through a wall instead of your face.\"  And then he expects a cookie for his restraint.)\n\nEvery single thing you've listed is classic abusive behavior, beginning with the lovebombing at the very beginning of your relationship.  Also?  There's a reason *that a 20-year old was dating a minor and it wasn't because you were super mature for your age.*\n\nHoney, you need to leave the house before he puts your head through a wall and then demands an apology from you for making him do that.\n\nThis is not hyperbole.\n\nLeave.  Grab your most important documents (birth certificate, social security card, financials), shove them in your purse and LEAVE.  I know you're on foot, but keep walking until you have some distance from the house.  Now, pull out your phone and start calling everyone you once knew and ask for help until someone can pick you up and take you to a safe place.\n\nOnce you are in a safe place, call The Hotline.  Visit their website.  Learn about abuse.  The number of red flags (ALL OF THEM) in your situation will dazzle your eyes.\n\nText your ex that he is now your ex and hand your phone to your friend for safekeeping.  Do not engage with your ex under any circumstances.  Do not meet with him for \"closure.\"  Don't block him yet because you will need evidence of his threats of physical harm (oh, you'll get threats!) to get a restraining order.\n\nThe first, most important thing is:  LEAVE.  Leave before he puts you in either the hospital or the asylum.  Leave with the clothes on your back.\n\nThe rest you can figure out when you are safe.\n\nPlease, PLEASE stay safe, OP.",
            "He sounds like my ex, that I was with for 10 years. I was browbeaten as well. Those bridges you think that were burned most likely just went underwater for a little bit and now that you're looking to get away from him, call everyone you know (except for mutual friends). You'll be surprised by how many bridges magically reappear. Including your brother. Call him and explain the situation. \n\nI would actually just call the cops, tell them you are not in a safe situation and you need help to get out. ",
            "Wait, he proposed to you after a few months of dating... so you were 15..? or 16... while he was 20? Is it just me or is that horribly wrong? ",
            "Just mentioning this: a 20 year old does not date a 15 year old unless there's something deeply rooted in control involved. There's just such a large gap in maturity there.\n\nThis doesn't sound healthy and you deserve a little self-confidence and a chance to become someone you can be genuinely proud of every day.",
            "Please let us know if you are okay.",
            "[removed]",
            "Praise the Lord! PM me if I can help you in anyway.",
            "Thank god you're alive! :) I was scared I would never see that update *happy tears*",
            "SO Glad you are Safe!!!",
            "Been checking this ever since I read edit 2. So glad to see the update today. Stay safe OP",
            "let me get this straight. you were 15 years old when you started dating him, and he was 20? that's fucking sick. RUN.",
            "I spent 6 years with a very similar-sounding guy (starting at age 18). I thought one of us was going to have to die for it to end. I tried to break up but it never worked because I was naive at the time. I finally snapped and got myself away from him. I found out months later he had been so paranoid and jealous because he was the one cheating, with my best friend of 12 years. \n\nAre you able to stay with a friend for a little while so you can figure out how to get away permanently? ",
            "Leave now, call the cops. Please let us know you're alright.",
            "This was so ridiculous that I thought it was a /r/nosleep post. You need to leave 7 years ago, but now is much better than never. \n\nMany people have been in an abusive relationship and it's so very difficult to recognize one when you're in the thick of it. Explain everything to your family and friends and they're sure to be sympathetic. No matter what he or anyone else says, you're not the one to blame for anything he does. His actions are dictated by him.",
            "I feel like this dude is going to come home to murder you.\n\nGet the hell out immediately.",
            "Fucking Christ I couldn't finish reading",
            "I don't know if anyone has said this, but the kind of 20 year old who dates a 15 year old is looking for an imbalanced relationship.  From the start he wanted to be dominant over you, whether or not he could articulate that.  You should not be in this relationship.  Your ultimate happiness, not to mention your safety is in real danger.  You should get out.",
            "Good god woman get the hell out now! There are shelters for women like you and will give you emergency resources. He is abusive, you are need to move out and get yourself some counselling, this isn't a normal or healthy relationship under any circumstances. Don't let him talk you into staying and if he's forcing you to stay after this post call the police to help you move out.",
            "Geez this is a scary one. Give us an update!! ",
            "At first I was very concerned and worried, then I saw Edit2 and I am down right nauseous. Please for the love of god update us and tell us you are ok.",
            "If you are in Texas, please PM me. I've been in your shoes, girl. I will come get you if you need somewhere to sleep just please PM me. We are so worried about you, OP. :(",
            "You know OP I'm super worried about you right now. Like I seriously hope you got out of there. What trips me out the most about this post is that you were 15 when you guys got together OP!!! Like holy shit that's just too crazy. Your shitty boyfriend was a twenty year old scumbag preying on you in your youth.\n",
            "I really hope you're okay now. Everyone here is worried. Best of luck for the future for you. ",
            "OMG I'm so relieved you're safe!",
            "I'm so glad you're safe, OP. I've been worrying about you since yesterday. ",
            "I am really happy you are somewhere safe. ",
            "<3 <3 <3 Very proud of you, OP. It's time to start anew :')",
            "No, you are not abusive at all. He preyed upon you when you were 15 and he was 20 and he has been abusing you ever since then because he has always had the upper hand financially and you have been very helpless.\n\nYou need to look up Gaslighting and read about it, please. That is a very well known technique that abusers use. It's when they try to make you think you are crazy. Or they deny reality and try to enforce their made up version of \"reality.\" He is gaslighting you anytime he says or does something and then denies it afterwards. Or when he does a certain thing and then accuses you of being the one who does it. Gaslighting is just an extreme/manipulative form of lying. But that's basically what it is. Lying.\n\nI'm so sorry that you're in this situation. It's not normal at all. Most guys are not like this. \n\nPlease learn to see the signs of abuse for what they are. \"Gaslighting\" and so on. That way you don't get into another relationship with an abuser based on thinking this behavior is normal, when it's really not. ",
            "He's gaslighting you and he's the abusive one, and I think I only got a third of the way down your post. \n\nRun. ",
            "You're not crazy, he's gaslighting you! I had an ex that did the same thing! He's really convinced himself that he didn't say or do those things and that he's in the right! YOU NEED TO GET THE FUCK OUTTA DODGE",
            "Break up. It's a certain kind of adult that would date a child and propose in a month. Leave. This is not a good relationship to be in",
            "You need to leave him ASAP. He is fucking crazy. You can't get your years back, but you can have a much brighter and happier future. ",
            "Holy crap I'm terrified. ",
            "It was very hard to read everything you have written. You definitely need to leave this man and safety precautions others mentioned are advisable. What I am more concerned with us your ability to leave and stay away, you should get some counseling as soon as you can.\n\nYou are not a horrible person for wanting to leave, and you have an obligation to yourself to leave and move on.",
            "GET OUT!! RUN!!! ",
            "You need to get out of the house before he gets there.  NOW.  GO NOW.",
            "You are in an abusive relationship. You are the victim and he is a manipulative P.O.S. Leave. Grab the essentials and leave. Then get some of your male friends to get the rest.",
            "*Later when he was more calm I played it for him, and he accused me of inviting guys over the pretend to be him so I could get him in trouble*\n\nWUT\n\nO_o",
            "He's been abusing you since you were 15?",
            "leave your house.  NOW\n\nHe is already physically abusing you.  You are in danger girl.  Get out.  Go home.\n\nDo not stay with him.",
            "@ops boyfriend. You fucking suck dude. \n\nOP at this point we don't need to know what you've done. this is a bad relationship that you need to end. You're both miserable, so what's the point?  If your shithead bf hurts you after seeing this you gotta leave immediately. \n\nI bet he key logged your pc",
            "Please reply. I hope you are safe.",
            "DUUUUUDE please reply so we know you're okay. ",
            "My heart just broke.  You deserve better.  So much better.  You are young and have a great life ahead of you, and you should not feel loyal to this piece of shit.  \n\nThe fact of the matter is that he knew you were vulnerable and used that against you when you were young.  From there he has worn you down to nothing.  Get out of this relationship and get a fresh start in life.  Find a shelter if you need to or a friend if you can that will help you out.  \n\nWhatever you do, please don't go back to him.  You may feel broken, but you definitely aren't.  Things will get better.  ",
            "That 2nd edit. Fuck this is horrifying :(",
            "are you alive?",
            "Thank you for this short but very important update! I am so happy and relieved that you are safe!",
            "Thank god, girl!! We were all so worried.",
            "A guy who is 20 and is looking at 15-year-olds as his dating pool is obviously going to have a lot of problems.\n\nHopefully you can re-establish yourself and learn who you are, you spend much of your adolescence with an abusive older man who is not a good example of a good relationship ",
            "Please, please, please leave. Your post made me cry. I am so sorry you have been beaten and crushed by him so much that you now have zero self esteem. Please don't blame yourself - this has been continuous systematic emotional and physical abuse over (as you say) nearly a decade - even on a much smaller level it can be difficult to look at things objectively, so please don't think you're stupid or anything for feeling tied to the relationship. \n\nThat said, please let the better replies on this post sink in and leave - I've seen your update and I really really hope you are safe. Please stick to your guns and don't let him worm his way in. \n\nSo much of your post - in between descriptions of his abusive, controlling behaviour - centres on you trying to change yourself and behaviour to pacify him. This never works and, as you've experienced, just spirals out of control. \n\nOnce you are physically free of him, you will be able to start being emotionally free from him (strongly suggest therapy!!) and I really hope that day comes soon. You deserve a happy life without being abused - I wish you all the success. ",
            "[deleted]",
            "So this guy is a child molester/pedophile and you're worried that you are abusing him? He's been abusing you since you first met him. He hasn't stopped. He'll never stop and I imagine the fact that you reached out to us internet strangers will piss him off to no end. So either prepare for what will probably be the beating of your life, maybe to death, or get the fuck out 5 minutes ago. Take only essential documents. Everything else can stay. Physical safety is the most important thing, not clothing or anything. ",
            "The fact that you were15 and he was 20 when you got together creeps me the fuck out. Normal guys do not have relationships with 15 year olds. Guys who want to be controlling and have all the power in a relationship date 15 year olds. He makes my skin crawl.",
            "He's a good person who at age 20 started dating a 15yr old? Shit I haven't gotten any farther in the story yet and it's already obvious he ain't all that great and might actually be totally awful. I'll still read the rest though but this guy would have to be a damn angel to make up for how fucking predatory that shit is.\n\nE: Jesus, he was your first guy and he picked you up when you are going through some shit? So as a grown as man he saw a completely inexperienced, completely vulnerable 15yr old little girl and thought that would be an acceptable relationship? Get out of this relationship before he fucks your head up worse than he already has. You'll be fine, but it's clear he's hurt you emotionally and it's gonna take some time to get through that but for the love of god get out now while you still can\n\nE2: holy Christ on a stick girl run. Run and never ever look back. This guy is a monster",
            "His behavior is called gaslighting and its bullshit.  Read up on the phenomenon so you understand how you are being used.",
            "Get out.  He's so violent with his rages and inability or refusal to recall them he could hurt or kill you. ",
            "OP, he is abusive and dangerous. You're being abused.",
            "Leave the house, call the police in that order.  If he's seen your post you are in danger of him losing it.  He is not a safe person.  Do not think can calm him down or reason with him. Call the police NOW.",
            "Don't need his story. I hope you have the courage to leave. His behaviors have escalated over time. Take a step back and imagine if a friend was telling you this story. ",
            "GET OUT. ",
            "Gaslighting all up in this. Get. Out.",
            "Even if you're leaving out a lot of things you did in the relationship, your boyfriend quite obviously has a very serious disorder.\nI also know how you feel. I was in an abusive relationship before too, and I've also been the abuser in a relationship. Abusive people make you feel like you're the crazy one. But there's a very simple way to tell-- if you're questioning your sanity, then you're not the one who's crazy. Abusive people never question that anything they do is wrong, ever. They often have to have a VERY dramatic event happen in their lives to give them an objective perspective and cause them to realize the truth of what they've been doing to people. For me that was being left completely alone during an unexpected pregnancy. As awful as that sounds, it was the best thing to happen to me, and many abusive people aren't so lucky.\nYou would really benefit from leaving this relationship and seeking therapy. It's very likely you're codependent and have some serious issues with abandonment that will lead you to attract abusive people over and over. Just think, what will your life look like 5 or 10 years from now if you allow things to stay the same?\nPlease seek proffessional help immediately. Best of luck.\n",
            "Well, from what you wrote, he is the abusive person in this relationship. Here are a couple signs to watch out for\n\n* Undermining self confidence by saying things like \"you will never do better\" or \"you are worth nothing\"\n* Mood swings, being compassionate for once and being enraged the other\n* I promise I'll change, just don't leave me promises that are never kept.\n* Substance abuse.\n* Trust issues. He is distancing you from your friends, and making your life centered around him.\n\nFrom what you described, just get the fuck away from him. Just reread everything you wrote here. There is nothing for you in this relationship. Absolutely nothing. The last eight years you invested in this is gone, they can't be redeemed or relived.\n\nCall the police now. They can chaperone you if you suspect your partner is going to abuse you.",
            "My ex-husband called me crazy and made me feel like I was the problem in the relationship; I believed him (rather, I wanted to believe him) so much that I sought counseling for over a year to deal with my \"issues\". In the end it turned out that I wasn't crazy, that he was not only treating me poorly and cheating on me, but he reveled in the fact that he could convince me that I was crazy for even wondering such things. \n\nThis sounds like a very similar situation to what you are currently dealing with. I'm sorry you're having to go through this, but know that there are plenty of people who support you!",
            "It may feel like you've burned bridges with your friends, but call anyway. I have a friend in an abusive relationship and I would drop anything if I got that call, even though her bf has systematically tried to destroy our relationship. I know it's hard, but be honest and ask for help. ",
            "Jesus, what a fucking horror story. I really hope OP is okay.",
            "Of 8 years...\n\n> does he math \n\nYou were 15!!!! When he was 20?!!!! WTF",
            "He's abusive and projecting on you. That's all he's doing is projecting. That's what happened with the no talking to other guys he was talking to other girls. With the cheating, with the porn, and ultimately the abuse in general. OP you don't des ever anyone screaming at you. You deserve better please leave it doesn't have to be like this. Leave and don't look back. ",
            "Life Pro Tip: Men who are in their twenties don't date highschoolers unless they are abusive/controlling and know people their age wouldn't put up with their bullshit.\n\nRun, don't walk. I don't know how you could last 8 years in such a terrible situation. Your [hopefully Ex] Boyfriend is abusive and controlling, and has been manipulating you for years. For your mental and physical health, you need to leave and never look back.\n\nYou will be fine. You will find real love. You will be happy. But you won't be as long as you stay with him.",
            "This is classic narcissist behavior from him. Sociopath or malignant I'm not sure but very very dangerous either way. He's gaslighting you to make you question your sense of reality and dependant on him/his. There is NO changing him and if he is in therapy, he's likely playing them to. That is what these people do, they're like a plague. Thank god there is no mention of kids in this post. OP, it's highly unlikely you'll come back to this post or be able to but if you do and come across this, please read up on this personality disorder and everything will make so much more sense! To see it is in fact not you and it won't change will help you immensely. Hopefully someone broke through to you and you're safe. I KNOW how hard this is.",
            "I really hope this is a troll after reading the edit. It's good to see so many people here offer help, y'all are good people.",
            "OP, please let us know you're safe. Genuinely worried and freaking out. ",
            "OP we need an update to know that you are safe and out of there! ",
            "This is classic abuse..his, not yours.  RUN!  Leave, get yourself safe, get yourself therapy.  You deserve so, so much better than this even IF you were a terrible person.  You aren't!!!! You deserve summertime you can trust and respect, summertime who trusts and respects you.\n\nRUN.  Be safe.  Get therapy to undo the years of brainwashing he's subjected you to.  Live a long, happy life, my dear.",
            "Ok, first- when you started \"dating,\" that was not a relationship.  That was an adult man abusing a teenage girl.  The fact that your relationship is now legal does not negate the fact that was committing statutory rape for the first three years.  And now?  If what you're saying is true, he is the abuser, not you.  This is a toxic relationship, and there is no way around that.  You need to get out of it.  Learn to love yourself alone for a while, then eventually find someone age-appropriate who will love you and cherish you.",
            "So glad to see the final edit. Stay safe! I wish you the best and look forward to seeing an update when you've got your feet on the ground. Be careful in case he's still lurking online. He's likely tracking something on your computer if he was able to find this original post so quickly and that's scary",
            "I'm so happy to see your update. Time to begin anew!",
            "I'm so glad you're alright! We were all worried about you ",
            "Relationship Math Time!\n\n28 - 8 years = 20.\n\n23 - 8 years = 15.\n\nWhat the fuck/shit/hell is a grown man doing dating a teenager?\n\nThis relationship was all bad from the start!  Leave his ass and call the cops on him!",
            "I can imagine that in these various fights you've had with him, there's been plenty of screaming on your side. Maybe you're feeling guilty about that. But from what you've said, the destruction of property, the incredibly controlling behavior, getting after you when you're a little late, etc., this is definitely abusive on his part.\n\nEven *if* you've done something like slap the guy at some point, or done other things that are wrong - this is still a relationship that you *HAVE* to get out of. It's obviously incredibly toxic.\n\nGet the hell out of there, to anyplace that's safe, with your important documents and important possessions. Get safe. Once you're safe, then maybe you can talk to a therapist about whether your BF might have had a point. But honestly, this guy has been manipulating you horribly from day one - why would you think that he's not trying to manipulate you and flip things around on you now?",
            "Regardless of who is \"in the right\", it doesn't matter. You two aren't a good team together, and that's okay. Break up so you can both get on the right path. This clearly isn't it.",
            "What a waste of 8 years on your part. Don't waste any more time with this useless guy. He uses and abuses you and doesn't give 2 shits about you. He probably also hates himself. \n\nPlease never reproduce with this man. And leave as soon as you can. ",
            "I've been in your shoes. I know it's hard because it's all you've known for 8 years, but you need to leave. I promise you he's not worth it. If you have any doubts I urge you to reread everything you just wrote and really ask yourself \"is this what I want for the rest of my life?\" Because this is what it's going to be and you deserve so much more. \n\n\n",
            "If he truly believes that he doesn't say the things he said, and even accused you of having guys impersonate him, he could be pretty sick. He should get some help.\n\nI would advise you to get the fuck out though. He may need help, but you're not obligated to be the agent who gives him that help after what you've been through with him.",
            "Get out and leave. There's no real reason for the pair of you to be together. As hard as it may be I think it's time you went your separate ways. Good luck OP.",
            "Nothing about this relationship is healthy.  Nothing.",
            "Run away from this wreck. Don't wait until he gets home.",
            "Your only problem is this guy. He is *breaking* you. You need to leave NOW! Seriously. He is breaking you.",
            "One of the more common tactics of abusers is trying to convince you that *you* are actually the abusive one, because it's easier to control you when they are perceived to be the victim and when you are constantly doubting yourself and feeling guilty.\n\nThis behaviour, along with him acting out and denying that anything happened (I have never and will never scream at you) is called gaslighting, and he's intentionally doing it to make you feel crazy. The more you doubt your own memory and judgement, the more you're going to blindly trust his, and that exactly what he wants.\n\nYou to run away from him before this gets any worse.",
            "It's been 8 years. So you were 15, a child. And he was 20, an adult. So first of all, that says something about him wanting to date someone that young (it's not a huge deal in your 20's but at the time y'all started dating, that's a HUGE deal): he wanted to control someone. And he has. You've believed everything he has said, and I can't even blame you, because you were so young, it's like he has indoctrinated you. I encourage you to leave. Completely dispel this dirtbag from your life. It will be hard, since you were under his thumb for so long, but it will be absolutely worth it. Reconnect with your friends, tell them your story, try to find help and heal. You are so much more worthy, and so much more better off. No matter how abusive he says you are, you don't deserve the treatment you've outlined in this post. I've dated someone like that and it took me YEARS to get fully out of his grasp. I am so much happier and healthier for it, and you will be too. Please, protect yourself. ",
            "He's the abusive one - not you. It is not your fault. Please be safe and update us ;__;",
            "I have nothing to say that all of these other wonderful people haven't already said...\n\nHowever, please - PLEASE - take care of yourself.\n\nThis is when the relationships subreddit gets difficult, because we don't actually personally know you - but we already care about you and are EXTREMELY worried for your safety.\n\nYou said you don't have anyone, but you have us. We will band together to help you - and I really believe that. I would do anything in my power.\n\nPlease let us know you are okay. Please take care of yourself. Whatever you need - let us know. We will help or find your the resources to help yourself. ",
            "LEAVE\n\nYou are the one who's been abused here. You told reddit, reddit will tell you, and the jig is up. Take whatever you can't live without or take nothing, go anywhere else but there and don't tell him where you went.",
            "LEAVE. There is so much gaslighting going on and it's so fucking familiar it makes me sick. My ex accused me of having \"control\" issues when HE was the one who was living in complete fear of everything. This man you are with does not love you, and has a LOT of work to do, and is most likely not able to be saved. Leave now, please.",
            "Even if you are abusive OP, which I doubt, if everything you have said here is true, you know what you must do. Leave and be safe. Call a domestic violence shelter if you're not sure how to get out. Call 911 if he becomes physical.",
            "Get out of there NOW! He's deliberately manipulating, controlling, and abusing you",
            "Ugh. I'm so sorry this is happening to you. I was in this same exact relationship about 3 years ago. It took me 3 1/2 years to leave. The classic \"you were late from the hospital/movies/grocery store by 15 minutes, so you obviously were fucking some guy right then\" move. UGH I HATE MY EX. \n\nJust go, leave, get out. It doesn't get better, it never does. I promise you within a week of leaving you'll feel happier than you ever had before. Just knowing you can go anywhere, anytime you want without being accused of something is the single best part of the breakup.",
            "Guy is crazy.  Leave now.  You're young and have your whole life in front of you.  I get that we're not hearing his side.  A relationship is a two-way thing and he probably has a side to tell as well.   However, you don't sound happy and the relationship sounds incredibly toxic.  Get out and don't look back.",
            "I hope u can get out asap. Nobody deserves what he's doing to you. Take care and be strong, i wish u the best!",
            "Girl, run! It doesn't matter, you need out. Why are you still with him? Don't fall for his shit!",
            "Run.",
            "Get out now. ",
            "What state are you in?",
            "You sound so nice - it's time to go don't waste your 20's on this insecure abusive person! Godspeed ",
            "He started dating u when he was 20 and u were 15, pedo!",
            "Holy shit, are you me? If I really am talking to my past self I need to say GET OUT! GET OUT WHILE YOU STILL HAVE A SHRED OF DIGNITY AND/OR SANITY! IT'S NOT TOO LATE!",
            "If you're in Utah, PM me.  I have a spare bedroom and a few large guy friends who can help you move.  You need to get out before he gets home.  Grab what you can carry and RUN.",
            "From the looks of it, he is the abusive one! RUN. FAR. AWAY. He's gaslighting you and projecting all sorts of insecurities. If anything he's the manipulative one.",
            "Leave leave leave leave leave leave leave, please for the LOVE OF EVERYTHING ON THIS DAMN PLANET LEAVE!\n\nGet. Out. Right. Fucking. Now. ",
            "He's a paranoid narcissist. His behavior is so classic. Read up on narcissism so you can recognize it when you meet one. ",
            "So. Pack up your important documents and go to a domestic violence shelter. You are being abused. He is a gaslighting asshole. You will be happier and safer without him. I promise.\n\n",
            "Please, please listen to all these people and get out! Go to a restaurant or a store and call someone to get you. ASAP!!!!!",
            "OP please be safe",
            "FUCKING LEAVE HIM. holy shit! This post infuriated me. There is no reason to stay with someone like that. Please do yourself a favor.",
            "I hope there is an update soon ",
            "Run, girl, please RUN.\n\nHE IS ABUSIVE.",
            "Run.",
            "I'm having a hard time framing how to give you my advice, as someone who was in your shoes a long time ago, so I'm just going to throw it out there as it comes.  \n\nRip the bandaid and leave, now. Leave while you have this small window in your mind shedding light onto how toxic this scenario is. It may not last. I understand what it feels like to see how horrible it is for awhile, and then it gets good again, and you think back on how wrong you were about the bad parts. It's easy to let the good outweigh the bad - just understand that. \n\nYou are being abused, and none of it is your fault. NONE OF IT. Even the part where you stayed for so long - that is NOT your fault. You are being controlled, manipulated, gaslit, and projected onto, which are all abusive tactics.  \n\nLeaving is not going to be easy at all. It is going to feel like you hit  the refresh button on your life for awhile. But I promise you that it will feel okay sooner than you think. Tiny pieces of yourself are going to come back that were being forcibly taken from you over years of abuse. Little by little, you will learn how to cope and rebuild. You will rekindle your self-esteem and rediscover your self worth. \n\nLeave soon. Start a new life. Go to counseling. We all deserve a life that is ours, and we all deserve to be loved and respected. \n\nI wish you all the best and more. ",
            "Possibly call the sheriff or police (not as an emergency, use their office number) and ask them to send a squad car to escort you away from their, it sounds like you live in a small town they should be very helpful.",
            "Holy shit, I just relived my past abusive relationship through your post. And that was only 7 months. \n\nGirl do what I didn't do AND GET OUT NOW!!!! Especially because he read your post. He has the type of personality to seriously hurt you. \n\nYou did NOTHING wrong. And even if you did cheat, that doesn't mean he should treat you with this toxic behavior (just leave). When I was with my ex, I wanted to leave but was too scared to. I ended up telling a past fling I still loved him. Which, yes, was wrong of me. He found it by reading through my Facebook messages while I was in the shower. While he said he forgave me, he used it against me in every fight. He would \"run away\" leaving all his stuff behind. I would always chase, he would call me \"stupid, bitch, clingy, crazy\" etc. And while the worst he did to me was put me in debt and borrowed a shit ton of money from my friends (without paying back), so he could move to Utah, your boyfriend might seriously hurt you. Call the cops to be there while you leave. If anything tell them you feel unsafe and ask if they can stick around while you pack/leave. Then block him from everything. ",
            "If anyone looks at my posts they will find that I tend to be a voice of calm and reason, and suggest people try to work things out.  In this case, there is too much broken to save.  He sounds like he has serious mental health issues.  He may truly love you, and you may love him, but his behavior sounds destructive to your mental health.  You need to leave and you may feel sorry for him, but don't believe he is going to get better for you.  He may come to terms with his problem through therapy and drugs, but with you he will always have the option to revert to his former abusive self when it becomes too hard to be a better person.",
            "Please op, if he came home crying don't believe any of that bullshit. There's no fixing this relationship, it was a toxic dump from the beginning",
            "This is one of the worst causes of physical, mental and emotional abuse I've seen posted here.\n\nDon't post your plans here, or write them on your computer at all, even in private messages, as he may view them.\n\nMake an escape plan but keep it to yourself so he doesn't know what you are up to.",
            "OP just take a second to read what you just submitted, and tell me if you actually still think you are being abusive. (Assuming this isn't a troll)",
            "From your end of the story it sounds like he is gaslighting you. Not fun. Please try and end the relationship and leave. Even if you're worse off for a little while, once you get back up on your feet and have gotten him out of your system you will feel a million times better!",
            "GTFO! GTFO! GTFO! No amount of good times warrant this shit!",
            "word for word, minus me getting beat, this sounds exactly like my ex. get the fuck out, the beatings are next. run and dont ever look back.",
            "You had better update us in the next few hours, or we'll probably assume you're dead",
            "Please leave please please leave OP",
            "call the cops. he is insane!!!",
            "He is the abusive one. He's projecting all the things he's doing wrong by accusing and blaming you. Get out now because soon you won't be able to walk away if you wanted. Nothing is worth putting yourself through that. ",
            "Not going to go in to detail, but you could have just been describing my (old) friend who I eventually told to fuck off after the way he treats women.\n\nI had to help 2of his GF's leave him and our whole circle of friends was done with him. I'd given him one last chance recently (about 2 years ago) when he came back to Australia after about 7 years, this time with a new wife and a kid.\n\nI ended up trying to help her get out (she wasn't ready but I couldn't take any more) and told him to fuck off. She did leave him eventually and went back home with her kids.\n\nHe is a sociopath and the pinnacle of Narcissist. He will never change. He will never treat women properly.\n\nHe will make them feel great at first. He is very charming, very fun, very intelligent.\n\nHe will then wear them down over time and isolate them from their network (family/friends).\n\nHe will then use and abuse them horribly when he knows he has them trapped.\n\nHe will never change and neither will you BF.\n\nAnd the things you described, is exactly the things he would pull.\n\nYour BF is a fuckwit and you need to go.\n\n ",
            "It took me a moment to realize that they were 16 and 20 when they first started dating. ",
            "So happy to read that you are safe OP!!! Offer still stands, 31F in utah area. PM if I can offer any assistance. ",
            "Oh thank god... I'm so glad you are safe. Lots of love to you. ",
            "You were 15 dating a 20 year old. He's gross.",
            "Okay first. He is a pedophile. A 20 year old dating a 15 year old is a pedophile in every state.\n\nSecond, it doesn't matter if you occasionally stab him in the arm. His actions are abusive, irrational, and terrifyingly mentally unstable.\nThis is independent of your actions. Even if you are abusive, him being abusive like he is should make you run.\n\nHe is crazy, paranoid, and an asshole. I can't believe you could stay with him for 8 hears when he showed his true colors after only a year. The reason he stopped lying to you is because you moved in and he had control of you. He was a 21 year old man that had his 16 year old victim all to himself.\n\nFinally, if your last edit (and this whole post) is true. Gtfo. Don't look back, don't answer his calls just run to a friend and never go back.\n\nIf you are just some lonely girl looking for attention and this is all made up, then I hope my advice helped someone in a similar situation",
            "I'm so glad you're okay. I was so worried that I was having trouble sleeping and kept checking for an update.",
            "He met you when you were 15 and he was 20.\n\nUhhh...",
            "15 yo dating a 20 yo.\n\n",
            "I didn't get halfway through your post before my mind went to \"nope nope nope never!\" . Leave this crazy loser before you get hurt. Luckily you're still young, plenty more great guys out there that will value you and treat you right",
            "LEAVE. this shouldnt even be a question",
            "So he was 20 and you were 15 when you started dating? Does nobody else see a problem with this?\n\nAlso, definitely think you need to leave immediately. With his history of being aggressive toward you I don't understand why you've stayed this long.",
            "Is it weird to point out that your were about 15 and he was about 20 when you started dating.....",
            "Wait wait wait, he was 20 and you were 15? Just fucking run already this was all a terrible idea from the start.",
            "Why would you ever spend more than a day of your life with someone who is being disrespectuful to you from the start?\nI know being a cool gf is great. But he should never play games for hours before you guys hang out. He should never course at you! not a single dirty word! \nYou deserve a better man. You are a young attractive woman who's been mentally and maybe even physicly damaged. Pick up your dignity and selfesteem. find a new place to live. far away from him. SAVE all mean texts and photos he will send you. Get a visitation violation permit thing, so he can't come near you again. If you stay in this relationship, your life wont improve. He is a poor choice of person. I know it's hard when you are attached to someone. But as giving and kind you are, YOU WILL find a new BETTER bf. ",
            "Honey, you're only being abusive to yourself. Pack up and gtfo before he comes home, the way you described all this makes me feel like you're in danger. Please don't be alone with this poor excuse for a human.",
            "No matter what he comes home to say, it is time to go. Call the people who love you. I know there are old friends of mine I haven't seen in years that I would answer in a second. Good luck <3",
            "WHAT ARE YOU DOING. GET THE FUCK AWAY FROM HIM.",
            "AY, YO, GET UP AND GO!!!\n\nOP, please. please please please - from the bottom of my heart - get the fuck out of there. ",
            "You need to get on up out of there.  Now.",
            "OMG leave now now now now now. Read this over and over again and this is what your life is going to look like! You deserve better, anyone deserves better than this! ",
            "This guy shows all of the signs of being manipulative, selfish, and just plain crazy. You should have left long ago. Sane men don't act that way. Just leave, you can't change him. He is beyond help and that relationship is toxic. You are wasting your time. His apologies and promises are obviously bullshit, he is saying anything just to keep you around. Don't let him continue to manipulate you."
        ]
    },
    {
        "post_id": "3i02ws",
        "author": "jhasfkg",
        "title": "I [19F] passed out at a party and woke up to my ex [19M, dated for 2 years] having sex with me.",
        "url": "https://www.reddit.com/r/relationships/comments/3i02ws/i_19f_passed_out_at_a_party_and_woke_up_to_my_ex/",
        "score": 2267,
        "num_comments": 192,
        "created_utc": 1440272996.0,
        "selftext": "I was home for the weekend when I received a text from Eric, my ex-boyfriend from high school. He and I attempted long-distance when I left for college last year, but I ultimately ended the relationship because I didn’t see it going anywhere. But I did still care about him, and breaking up with him wasn’t easy. \n\nHe invited me over to a small party at a mutual friend’s house, so I went. I didn’t know what to expect. Maybe I would see him and change my mind about the whole thing, maybe I wouldn’t, but either way, I still decided to go because I missed him.\n\nIt was nice to see Eric again. A little while into the party I was fairly certain that I wanted to reconcile a friendship with him. As far as a relationship or anything of the sort, it still didn’t feel right. But catching up was nice.\n\nThere was a lot of alcohol and a lot of weed at this party. I’d never drank and smoked at the same time before, but I was with people who I trusted, so I thought I’d be fine. I was wrong; I smoked and drank so much that I lost track of how many drinks I’d had, to the point that I vomited and then passed out in the host’s (old friend from high school) bed. Or maybe it was just a really deep sleep. Either way, I was completely out.\n\nI woke up with my dress pulled up and my ex having sex with me. It hurt. I was completely dry. It took me a moment to register what was happening, but once I realized, I tried to push him off. He was heavy and stronger than I was. I was still having trouble even keeping my eyes open. I told him to stop (slurred, more like) and he acted like he didn’t hear me and just kept going. He finished (pulled out and came on my dress) and left the bedroom without saying a single word to me. I was laying in the bed, my dress still hiked up, trying not to pass out again, but I did. \n\nI woke up to him bringing another girl into the room and having sex with her while I was half-conscious in the bed next to them. I felt so disgusting. When I completely woke up around 6:00 AM, everyone was still sleeping, and I just left. I’m home now, with a hangover from hell.\n\nEmotionally I’m a mess. I don’t know what to do. I don’t know if I should tell someone. I feel like I should, but I don’t know who. Not to mention that I was drinking while underage and on drugs when it happened. And he was drinking, too. A part of me just wants to forget about the whole thing, but this really doesn't feel right.\n\nTlDr: Ex invited me to a party. Got very drunk and very high, to the point of passing out. Woke up to him having sex with me and wouldn’t stop. Passed out again. Woke up to him bringing another girl into the room and having sex with her as I lay next to them in the bed. Woke up again, drove home, at a loss for what to do now, or if I should do anything at all.\n",
        "permalink": "/r/relationships/comments/3i02ws/i_19f_passed_out_at_a_party_and_woke_up_to_my_ex/",
        "comments": [
            "[deleted]",
            "This is 100% rape. Don't wash the dress you were wearing if you haven't yet, his semen in evidence if he says you're lying. There's no excuse for letting him off and if I knew where this was/who either of you were I would have called for you. Let someone know who you trust if you can't do this alone. ABSOLUTELY do not let this go. This man is a danger to you and anyone else who he just happens to find passed out. ",
            "You were raped, put your dress in a ~~plastic~~ paper bag, don't shower and go to the hospital and tell them what happened. They will call the police and bring in a counselor for you to speak with and sort out.",
            "Go to the hospital. Immediately. Get rape tested. If it hurt they may be able to document abrasions or physical evidence that will be very important in getting this reported. Call the cops. The hospital will probably have a rape counselor or personal on staff that will get you in contact with the right people and the right resources. Bring the dress he came on for evidence. Drinking and drugs do not give him the right to rape you and I guarantee you will not be charged. ",
            "DO NOT SHOWER. CALL THE POLICE NOW.\n\nYou were raped. I'm sorry this happened. Please make sure you find appropriate help so you can move on. ",
            "Listen carefully, cause this is very important. Quick background, I've worked in the medical field for over 6 years and have dealt with rapes, murders, kidnappings, and chain of custody with police. DO NOT SHOWER. DO NOT CLEAN THE CLOTHES. Call 911, report it for what it is, a rape. Ems doesn't care about drugs, underage booze, strippers, or anything else. A horrible thing happened to you, and you need help. They can take you to the hospital or someone can drive you there, but you need a rape kit test done, you need blood, urine samples taken asap. Those will help if you think he drugged you. Keep this post saved. DO NOT CONTACT HIM. Let me repeat that, DO. NOT. CONTACT. HIM. I don't care what he says, does, tries, messages, friends say, or anything else. Don't fucking talk to him in any way shape or form. Not to him, about him, don't fucking think about him without the prosecution present. Clear? Moving on, after evidence has been collected, they will question you. This part sucks and takes hours. It will be hard, but it will make it easier to catch him and put him where he belongs. After you can go home, shower, take a bath. Do whatever you want, just don't be home alone. Once shit for brains gets picked up, and trial is done, you can put this night behind you. I'm sorry for what that fucking sad excuse of a man did to you. But don't let him get off free with it. Go get help. Make him legally pay for the crime he commited. Hopefully him and the guy from subway will meet each other in jail.",
            "That's rape.\n\nTalk to someone you trust, preferably a parent or mentor. Consider talking to the police as well. Trust me, they won't give a shit that you were drinking or getting high. They'll have bigger fish to fry.",
            "GET TESTED",
            "Go to the hospital ask for a rape kit and have the police called. You were raped. Bring your dress. It doesn't matter if you had a shower. There's no way it wasn't rape. You asked him to stop, he didn't, so if you have any doubt about thay hold onto that one memory, you said no. \n\nI'm so sorry,  i wish you the best. Don't worry about the alcohol or weed. Make sure you aren't carrying any, if you're in the us they really need to catch you in possession. ",
            "[removed]",
            "Talk to the other girl if you can figure out who she is. He likely raped her too. \n\nAlso, people are giving you good advice, but we are not experts. You might want to call RAINN:  1.800.656.4673\n\nThis hotline can support you in the moment as this all sinks in, and help you with next steps and the choices you have to make.\n\nMy suggestion is, if you are sure you want to report, drive yourself (if you're sobered up) or get a ride to the ER, get a rape kit done immediately. \n\nRemember this is not your fault. You don't have to be ashamed of anything. ",
            "This is rape. It doesn't matter if you had dated in the past, it doesn't matter if you were drunk or high, it doesn't matter if you had had sex in the past.\n\nYou did not give him consent, you were not able to give it, he saw you laying there and took advantage of the situation. This is someone that deserves to be locked up.",
            "Oh my goodness, darling. I am absolutely horrified for you. This is something that no one should ever have to live through and I am so sorry that this happened.\n\nThat being said, it's ok that you were drinking and it's ok that you smoked some weed. Honestly, those are pretty minor offenses, and I am 99.9% sure that the cops won't care that you were doing them. That information IS crucial to tell the police though,and I 100% recommend going to the cops as soon as possible. The police will want to know that information because it solidifies the fact that were you incapable of consent. That you were absolutely not ok with him doing what he did to you. Let your mom know, she's going to be a little upset with the drinking, but more than anything she's just going to want to make sure you are ok. \n\nPLEASE go to the police. PLEASE press charges. Anyone capable of doing this to someone they loved is capable of doing it to anyone.\n\nI was raped when I was 15, and I want you to know that if you don't go to counseling as well, it can really stay with you and affect your life in the future, I would recommend finding a counselor to talk to as soon as you can, they will also help you with dealing with the police officers and your parents. But I promise you, people are going to want to help you, they aren't going to want to shame you, and you are going to get through this and come out ok on the other end.\n\nMessage me if you need anything at all. You are strong, you are a completely innocent party, and you are going to be ok.\n\n*edit for formatting*",
            "First off, I'm so sorry that this happened to you. No one deserves this, and I can only imagine how much is going through your head right now.\n\nI hope you're in the company of loved ones and are receiving proper care and support. I know you posted this a few hours back, but as a California certified rape crisis counselor, I wanted to give you some additional information that may be of some use to you. Although this information is based on my knowledge and training in California, I would imagine that similar policies and practices are in place elsewhere.\n\n\n&nbsp;\n\n\nTo begin, I cannot assert enough that this is not your fault. You are not to blame, the alcohol and the weed are not to blame---this person took advantage of you when you were incapacitated and unable to give consent. That being said, you have various options you may consider whenever you feel ready:\n\n\n- Given that the assault happened very recently and you mentioned that you were hurt in the process, I implore you to seek medical attention, if you haven't already, ASAP. Find the rape crisis center for your designated county based on where the assault occurred or where you're from (which matters because of police jurisdiction and funding) and tell the staff there that you were assaulted. You should been seen for free, and you don't have to perform a rape test kit if you don't want to. There, the hospital staff can at least treat any injuries and give you preventative medicine.\n\n\n- Should you decide to perform a rape test kit, bring your clothes and whatever else you can in a paper bag, and if possible, do not shower.\nThe rape test kit itself may entail collection of evidence such as swabs around your vagina and uterus, taking pictures, as well as some other tests. **That being said, it is completely your choice as to whether or not you want a rape test kit done, and even if you've already begun, you can stop the test at any time.**\n\n\n- Also, you may have the right to have a person of your choice, as well as a medical advocate to be in the room with you during the process. With that, if possible, I would recommend requesting a medical advocate, as doctors, nurses, and if they show up, the police, are all mandated reporters who each have their own objectives and agendas. That isn't to say that they're bad ones---they just might be different than what you want. However, a medical advocate's job is to make sure you're alright, and legally, they are the only person who can provide full confidentiality. In other words, if there's something you want to say that you don't want others to possibly report, take your medical advocate aside to speak in private. *note that advocates also become mandated reporters if you might hurt yourself and/or others*\n\n\n- Afterwards, you may want to look into local organizations and rape crisis centers for further support and resources. Some may offer services such as case management, peer counseling, crisis hotlines, and/or may be able to put you in touch with other folx who can provide such. They also may be able to give you referrals to therapists and other organizations beyond the realms of sexual assault. \n\n\n- Lastly, take care of yourself in whatever way is necessary. No matter what anyone says, you know what is best for you, and everything from here on out is your choice. **There is no right or wrong way to go about this; you are the expert in your own healing.**\n\n\nThat's everything I can think of off the top of my head, but if I remember anything else, I'll edit it in. Also, feel free to message me at any point if you have any questions or just want to talk. I wish you the best.",
            "Get this asshole on the offender registry. Go to the hospital NOW for a rape kit. Right now. Not tonight or tomorrow or next week nut RIGHT NOW. I'm so sorry this happened to you.",
            "Drink and drugs aren't illegal after the fact. Talk to your parents/guardians/a friend and report it!  He doesn't deserve to get away with it!",
            "Sounds like he raped that other girl too",
            "Stop this piece of shit from doing it to the next girl. Report it.",
            "Go to the hospital. Report it to the police. Take a plan B.",
            "Oh yeah--even if you have showered, go to the hospital anyway.",
            "This is called rape. You should report him to the police.",
            "Boy, this guy was looking for trouble and he's going to get trouble. He's going to be in big trouble.",
            "I'm so sorry this happened to you. It isn't your fault. Yes you were drinking and smoking, but that does not mean you deserved to be raped, at all. \n\nReport him. This happened to me when I was in high school by a trusted friend, at my \"best friends\" house. I still have flashbacks and it's really disturbing and painful to think about.\n\nIf you want to talk to someone, please PM me. Please tell your parents or trusted friend(s) - and go with them (as emotional support) to the police station to report him. He raped you, and he may have raped the other girl he brought into the room, too. Go to a clinic or hospital and have them check you out, get checked for STD's, and yes, bring your dress along - it's all incriminating evidence.\n\nI'm so sorry, you didn't do anything wrong - and you didn't deserve this. I'm here if you want to talk to someone.",
            "Don't shower. Preserve the dress. Police, now.",
            "Also--it was NOT your fault. You did NOT deserve it. He is a RAPIST.",
            "I'm so, so sorry that this happened to you.  Please follow the advice people are giving you here, it's good advice.  It's going to be a hard road ahead, but you can do it - rely on your family and close friends, because they will be your support.  If you feel that you can, reach out here again, there are so many amazing people who have advice that can help you.\n\nCall the police and EMS if you haven't already.  Do NOT contact your ex, do not listen/read anything he tries to get to you.\n\nI'm so sorry and I hope you get the help you need.",
            "Rape. Call the cops. ",
            "You were raped. That's a fact. Go to the police.",
            "Yeah that is rape...\n\nContact the police. Sorry it happened to you. ",
            "If you're still in the right time frame, you may also want to take a plan b, just in case.",
            "Please get tested for narcotics ",
            "Go to the hospital and ask for a rape kit. ",
            "OP please go to https://rainn.org/ and call their hotline number. Do not wash your dress and put it in a bag. Get Plan B. Please, please get help from somebody you trust and will support you.\n\nGo to the Police if you feel comfortable enough filing charges. I'd even suggest going to the hospital. \n\nYou're going to be okay. Just take a deep breath. I believe what happened to you. You can do this. ",
            "I'm so sorry this happened to you sweetie. Remember what he did to you isn't your fault in any way. Listen to the other comments and realize that the fact you are underage and drinking is much less of a problem than the fact that you were molested.",
            "Straight to the hospital and police.",
            "Report him for rape.",
            "[deleted]",
            "It is deeply important that you don't think of yourself as dirt or guilty in any way. There is this kind of behavior that tends to transfer the guilt to the woman when something like that happens. It is sexist and must not be tolerated. You must be strong, because you are about to hear things like \"you shouldn't have got this drunk\". Don't listen to it. The victim is never to be blamed in a rape crime.",
            "You were raped. You need to report him.",
            "hey, sorry that this happened to you. what's important is you, okay. it's really overwhelming and you don't know what to do and that's okay - you have time to decide who you want to tell. however, you only have a small window to see a doctor and get the evidence collected. so if you think there's a chance you'll go to the police, even if it's just a 1% chance, really consider going to the doctor because you can decide what to do about everything else later when you've had time to think, except for this. \n\nplease keep in mind that it's also important that you get your blood tested for STDs - now, and again in three months. also if it's still hurting down there, see if vaseline or coconut oil help to soothe it. a lot of other creams etc will sting or give you an infection. \n\nsorry if my language got harsh anywhere in this. sorry again that this happened. make yourself a nice drink and put on some comfy clothes. take care of yourself",
            "Tell your family and call the police. You were raped :(",
            "Please do not suffer through this quietly and alone because you were drinking underage and smoking weed! You won't get in trouble for that! Please go to the hospital and have them do a rape kit and also test you for date rape drugs. Bring your Mom and have her with you while the police come. I am so very sorry that this happened to you. Do not let the actions of this asshole define you. Take action and get the police involved. Please.",
            "Wow I got angry reading that, what a disgusting creature he is. Report the rape this is not your fault and I wouldn't be surprised if something was added to your drink. ",
            "Omg yes tell your parents,he raped you ",
            "OP, you were raped. Please please please do what you the other comments are telling you to do! Save that dress, tell your mom, go to the hospital, get a rape kit and report it to the police! Please do this for your sake and the other girl(s) he raped as well. I'm so sorry for what he's done to you. After you go to the hospital for a rape kit, you should ask the hospital to refer you to a therapist. ",
            "You need to speak with the police. What you are describing is a crime and it needs to be addressed with law enforcement. I'm sorry this happened to you.",
            "Please call the police.",
            "This wasn't your fault. Nothing you did or said caused it. Contact the authorities, and a rape advocate center if you can.",
            "I'm sorry you had to go through this. Be strong and just know that you didn't cause this to happen. That guy needs to pay for his actions so please get help as soon as possible.",
            "Please report him.. This is not even the drunk situations when the consent was not clear thing.. This guy is a clear rapist and his behavior will only escalate. Please report him before he ruins the lives of lot of people. Guys like him need to be in jail",
            "[removed]",
            "You need to call the police. What he did was rape. ",
            "I'm so sorry you were raped, OP. Please go to the hospital and update us when you return. ",
            "I want to be sick reading it. Hes a horrible fucking person and he'll do it to other people. \n\nJesus Christ what the fuck is wrong with people? No drug on the face of the planet could make me even consider doing something like that to someone. There is no excuse, that was just awful, horrible, wrong.. ",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "ddmbaj",
        "author": "throwaway0342777",
        "title": "I [22F] need advice getting over this unhealthy crush on my coworker [20sM]",
        "url": "https://www.reddit.com/r/relationships/comments/ddmbaj/i_22f_need_advice_getting_over_this_unhealthy/",
        "score": 2275,
        "num_comments": 147,
        "created_utc": 1570276691.0,
        "selftext": "Hello everyone. So I've had this crush on my coworker for a few months now, and it's really not good. We only see eachother in passing, and he's only talked to me once about something work related. Even though we don't talk, we do look at each other sometimes, so we notice each other's existence. He's very outgoing and friendly with other people on my team. He's also very attractive. I enjoy being around him, but I'm way too nervous to talk to him. Honestly, I basically just admire him from afar. I'm not interested in a relationship with anyone right now, partially because I need therapy to heal from past relationships first, so I'm definitely not trying to be together with him. I just like him.\n\nThis wouldn't be so bad, except it's become unhealthy for me. Whenever he's around, I get so overwhelmed that it's difficult to concentrate on my work. Sometimes I have to walk away and take deep breaths to calm down. I just get so nervous and preoccupied with my thoughts. I realize this sounds ridiculous, it is. I also can't stop thinking about him. It seems like I spend the entire day looking forward to seeing him, then once he's gone I feel empty and sad. I recognize this is really unhealthy and potentially creepy.\n\nI work with some good friends and I genuinely enjoy their company, I also like my job a lot so it's not that work is boring without him. I'm actually a very talkative and happy person with everyone else. I really want to get over these feelings because they're useless and only hurting me. To be honest, this isn't the first co-worker I've felt this way about. At my last job, I also had a crush on my manager and it was on the same unhealthy level. So I feel like becoming fixated on people is reoccuring problem, and I really would like to know how I can change this pattern.\n\nI welcome your honest thoughts on this situation.\n\nTL;DR: I have a coworker that I really like, even though we never talk, and it's become an unhealthy crush because I get so overwhelmed when he is around that it's interfering with my job. I already accept that we won't (and shouldn't) be together. I just need advice on getting over him and changing whatever is causing me to feel this way.\n\nEDIT: I seriously can't believe how many people have responded to my post. Every single comment has something very relevant and beneficial to say, and you all have given me a lot of insight about my feelings and ways to cope. All of your compassionate and understanding words are helping me tremendously. I'm sincerely thankful for all of your responses. I will take your suggestions to heart, and as some of you advised I'll bring this up during therapy when I get the chance to go. I will take some time to reply to individual posts soon, but please know I'm reading all of them and am truly grateful for your input. Also, that so many of you can relate to having unhealthy crushes makes me both happy and sad. It feels good to know I'm not alone, although I wish the best for all of us, that we can move on and find fulfillment in our lives. Thank you all so much.",
        "permalink": "/r/relationships/comments/ddmbaj/i_22f_need_advice_getting_over_this_unhealthy/",
        "comments": [
            "Well done acknowledging that this crush isn't a positive thing for you right now. You said that you need therapy for something else right now, so why not bring this crush up as an issue as well? The two things may be more related than you think, so working on these two issues concurrently with your counsellor (the crush and your other relationships) could actually help you get to the root of your issue quicker.",
            "It may be a reach but personally I used to have a similar issue and I believe it was due to low self esteem and a need to attach myself to others in order gain their approval and validation; I felt that, if this cool person accepted me and chose me, then I could allow myself to feel valuable. Realistically though it was an unhealthy coping mechanism. How is your self esteem? Do you validate yourself largely through external relationships?",
            "Therapist here!\n\nCRUSHES ARE SO FUCKING HARD. They're hard because there's a lot of mystery behind a crush. We typically meet them in environments where we are around them often, even if they're not deliberately close to us in that environment. It's also easy to look at someone and imagine this fantasy that you're not even sure really exists. Good on you that you recognize the unhealthy nature of this crush and honestly, the way you're responding to it makes sense because there's a LOT of tension I bet. This, like anxiety, can cause a physiological experience that can be uncomfortable and interfere with our day-to-day. \n\n&#x200B;\n\nI don't like giving advice but what I will say is sometimes to either a) break that mystery by getting to know that person a little more or b) tell your mind that this person is more than the way you are envisioning him/experiencing him. Sometimes we can just train our brains to notice the shit we're making up versus the shit that actually exists.\n\n&#x200B;\n\nHope this was helpful!! It's happened to me too <3",
            "Ummm...  everyone is telling you therapy. That's good advice.\n\nBut also, when you see yourself developing a crush, why not just try talking to the guy?\nI mean, it's true that it's just the idea of the person you've fixated and dreamed up. So, shake up the dreamland with reality.\n\nI've been attracted to men--and then two minutes into the conversation, all chemistry died.\n\nOr maybe it'll turn out that you guys become friends. Idk. It just seems like you're making this very \"either or\". Black or white. He exists and so do you and in the same workplace.",
            "Do you also have ADHD? Huge fixation crushes are a common trait among people with ADHD, it's an extension of hyperfocus",
            "https://www.reddit.com/r/dating_advice/comments/bthu2j/how_do_i_19f_look_for_people_in_real_life_without/?utm_medium=android_app&utm_source=share\n\nI have (had?) the same problem, especially when I'm new to a place. I got a lot of good advice on this post, but in my experience, the main things that help are:\n\n(1) Focusing on your own goals. You say you know you're not ready for a relationship right now, so stick to that. I know it's easy to say \"I'm not looking for anything right now\" when you don't have any prospects and then throw yourself at the first one you find, but if you do you're gonna have a bad time. Is your job related to your \"dream career\" or is it just something that pays the bills for now? Right now I'm very focused on my education, and it's so freeing to be fulfilled by something outside of myself, rather than being wrapped up in other people (crushes or otherwise). If not your job, maybe a hobby you really enjoy. This is also a good way to meet people who you're actually compatible with once you *are* ready for a relationship.\n\n(2) Thinking about what you actually want in a partner. When I was younger, I was so desperate to have a boyfriend that basically any average-to-hot guy in my age range became a \"situation\", and the vast majority of them I was incompatible with in hindsight. It's a sign of low self-esteem, but you have to have your own standards (not necessarily in terms of physical looks, but what kind of personality do you like spending time with? What interests do you want to share with someone?) and, if it's important enough to you, dig deeper to find out whether he actually meets them- and be honest with yourself about whether or not he does. My \"friends\" tried to push me into another situation (after a year of complaining about how annoying they were...) months after I wrote that post based on nothing but one conversation, and I didn't even like the guy like that. In most of my previous situations, if I had thought about it enough I would have realized that I didn't like the guy like that. By overcoming the \"decent looking male = romantic interest\" conditioning, it allows you to develop genuine connections with people and *then* see where they lead.\n\n(3) The fact that this is a pattern could be a sign of codependency and/or an insecure attachment style. You might want to consider bringing this up with your therapist- I did, and I've made a lot of progress on this in just a few short months. Even being aware of the problem helps me to recognize it and nip it in the bud- \"no, these weird feelings don't mean that I like my TA, it's just the effects of laughing and prolonged eye contact. There's nothing about him that would make me attracted to him, besides being male and existing in my vicinity. Proceed as normal.\"\n\n(4) If nothing else works, time eventually puts everything in perspective. There was this one guy I was obsessed with for the better part of my freshman year of college, and the first time I spoke to him as a sophomore, I completely *forgot* that I used to have a crush on him until after the conversation was over. (I was way too proud of myself for this, lol.) The thing is, time doesn't always stop you from making the same mistakes with new people.\n\nHope this helps! My inbox is open if you want to talk more.",
            "Hi! (Happily) married person here who tends to get a lot of crushes. Good for acknowledging that the crush isn’t working for you. Something I’ve noticed with myself is that whenever I develop a crush on someone, it’s usually because there is something about them that I wish either I had more of myself or that I wish I had in my life at the time. Like if someone is funny and outgoing, maybe I wish I was a little more that way. If they’re a stable older person who seems to have their stuff together, it’s because I wish I had a little more certainty in my life at the moment. If you can identify the things about him that you like the most, and then try to add these things into your own life or work on them in some way - this can make the crush sometimes disappear or at least dramatically diminish.  Also, remember that crushes are totally normal, and are sometimes completely biological... maybe your brain just *really* likes the smell of his pheromones. Just remind yourself that it’s okay to feel how you do, and try not to fantasize about him or build him up in your head. Hope this helps!",
            "Hey! This may be some stuff that’s lurking under the surface from your past relationships or even childhood that might have traumatized you in some way- sounds like therapy is definitely a good idea!\n\nMaybe just also try to remember that you don’t even really know this guy - you’re idealizing him a lot in your head based on his appearance and the limited interactions you’ve seen him had with others. For all you know, he’s a racist or not a nice person! (Obviously exaggerations but you get what I’m saying). I think if you maybe just stop whenever you feel those things and remember the feeling you have is just about the idea of this dude rather than the actual guy, that may help a bit?",
            "I have this same pattern of obsession with people. It's funny, when I'm in this rut it feels suffocating, but when I'm out of it I always wonder when I would ever like someone to that degree again. It could be years or never. So don't have any regrets when making your decision :)\n\nAnyways, if you've decided that you don't want a relationship (and not just because you're scared and making up other excuses), I think there are two solutions based on the situation.\n\nHave you know him for a long time? There's a difference between liking the idea and potential of someone you recently met and liking someone you've knows for years and know deeply.\n\nIf you really don't know him that well. Try talking to him some more. This usually reveals that they're a human being like the rest of us. And gradually you'll probably become more comfortable around him. Note that this doesn't mean you would stop liking him as a person. It's getting over the obsession part. I would start out by going to group events and talking to him there so there's not too much pressure.\n\nIf you know him deeply (I'm guessing this is unlikely since you avoid him), well that's tricky. Let me say though, you are probably getting jittery at the thought of being with him, because he's single and available. I feel like you wouldn't be so obsessed over him if he were in a stable relationship, for example. At this point I would go for trying to create more physical distance...\n\nI'm not a therapist!",
            "Bring this up in your therapy sessions. Talk through everything you wrote here and let your therapist help you figure out ways to diminish fixation at this level, in addition to helping you figure out *why* you feel crushes so intensely. You're right...it is unhealthy to feel this strongly about someone you do not even know, but it's a great sign that you've acknowledged it's not a healthy mindset because then you have a much better chance at learning methods to handle those feelings in the future.",
            "It's ok. I am married and had a similarly intense crush on another student. These things happen. I even cried in yoga class one time when they weren't there. What helped me A LOT was consciously trying to let the thoughts pass. \"Ok, I am feeling the butterflies. That is ok. Instead of fixating on this feeling, I am going to breathe and let my thoughts drift.\"\n\nTime helped...a lot. Are you able to work on location for a bit, work from home temporarily, or take a vacation?",
            "Maybe this is a skill that you learn if you grow up having to hide your bisexuality, but crushes don't have to be sexual or romantic. Having a crush can be a good feeling (although I recognize that \"too much\" can be bad, too much excitement for example is basically anxiety), try to enjoy it.\n\nIf you can rule out a romantic or sexual relationship in your mind (maybe easier said than done) you might be able to put that energy into a completely platonic relationship, so long as the other person isn't trying to push it in a different direction.\n\nYou need the discipline not to be overbearing on the other person but I have some very good friendships that started off as crushes.\n\nEdit: I'm not sure if this is applicable though, just a perspective on crushes that may be helpful.",
            "Check out r/limerance",
            "Hey OP, I went through this same thing earlier this year,  so I know the struggle. Unfortunately I let an infatuation pretty much rearrange my life, and I’m not sure what could have been done about it. Sometimes life just throws you a curve ball I guess.\n\nSo my crush was/is significantly younger than me (early-mid 20s, I’m in mid 30s), and never showed any interest or anything beyond very minimal pleasantries. Right from the get go I knew the dynamic was hopeless and creepy (I’m not exactly the most handsome or charming dude around), but at some point I realized I was MASSIVELY infatuated with this girl. To make things worse, I had been in a long term, loving relationship, and the crush (I admitted it to my ex, without trying to cheat) effectively dismantled that - it was brutal and painful, and we tried to work it out but couldn’t. I’ve been single and dating since then, but my ex is almost certainly “the one who got away”. I live with constant regret now, of what could have been. \n\nI ultimately asked out this coworker (over text, and without any “softening up” so to speak), and was politely rejected. It was rough but expected, and I believe I’ve handled it well - returning to professional and friendly interaction, without bothering her again; hopefully she isn’t creeped out by me now, but I’d bet she is. The thing is, the infatuation never stopped and has only become worse - it’s been like 10 months total and I still consider this girl “the one” (as in, if she gave me a chance I’d do everything in my power to make it last and ultimately tie the knot...trust me I know how crazy that sounds).\n\nSo it’s a crazy and scary rabbit hole to go down, this infatuation thing. If you don’t have anything to lose by entertaining the notion, then by all means GO FOR IT - when you’re this into someone I believe it’s your body/mind trying to send you in the right direction. It can cause terrible damage too, but maybe that destruction was inevitable regardless and it was just a matter of time. I don’t know. \n\nThe point I’m at now is to just try my best to live and work and deal with it, knowing that I’m super into this coworker. I still have foolish hope, like “well now she knows I’m interested, maybe she’ll stew over it and reciprocate over time!!”, but it causes me so much turmoil (the other day I fucking CRIED after a team lunch type of thing, since just being around her is overwhelming). I hope that one day I’ll be able to move on and no longer believe that she’s the most beautiful and charming person I’ve ever seen (and that it’s possible for me to find someone else I feel this way about, who will like me back), but I just don’t know. This one is just unreal, like a unicorn created in a lab to be absolutely perfect to me. And I’m getting older, if I don’t straighten up I’ll be alone forever (I’m dating successfully, but honestly I just want that one unicorn and it scares me how long I’d be willing to wait).\n\nI’ve had a lot of time to think about my situation and what it all means. I think that if you ever run across someone that you’re THIS into, even if there seems to be very little realistic chance, you owe it to yourself and to THEM to at least express some interest and let them know (of course without being pushy, creepy, or threatening. And you have to accept NO when it comes). Because on my side, everything is already there to create an amazing story and life together - it’s just a shame it’s focused on someone who couldn’t care less. Every time I see her (or even hear her voice, ugh), it’s like getting blasted with EVERY AMAZING LOVE SONG EVER WRITTEN, all at once. It’s fucking obliterating. I also don’t want to hurt anyone else while I wait for my perfect unicorn... but it’s starting to look like hurt is inevitable, since being alone sucks (I know that isn’t fair to the other party, but should I be alone forever then?)\n\nI can’t tell if I’m insane or thinking more clearly than I’ve ever been, but I’ve never had this type of reaction to anyone. I knew this would be a wild ride as soon as it started.",
            "2 things:\n\n1. Ever hear how attractive people have it easier in life? Reasons like this are why. We are automatically predisposed to like attractive, outgoing, people. Initially, our liking them has nothing to do with who they actually are as a person but rather what they represent. I've been guilty of it myself. What has helped me greatly overcome this pro hot people bias is humanizing them.In the simplest of ways, I think to myself, no matter how good-looking or awesome someone seems, there's someone in their life that they annoy. Maybe they're not a very good brother or son, maybe he's dismissive of his girlfriend's feelings, maybe he's stubborn to a fault, maybe he never cleans dishes up after himself. He's got faults and maybe pretty bad ones at that. Guaranteed there is someone in his life that actually knows him and he pisses them off to no end.If this humanization technique doesn't work start mentally creating a list about the most unattractive things about him that are probably true or have been at some point. For eg. He's eaten his own booger, he has $40,000 in CC debt, he cheated on a college exam, sometimes he finds shit streaks in his underwear and wonders if anyone smelled them, he spends 20 minutes fussing with his hair every time he goes out gets super mad if anyone tries to touch it, he thinks 10% is a good tip, he secretly thinks women shouldn't be allowed run in politics cause he thinks their periods mess with their judgment, he doesn't rerack weights at the gym cause he knows other people will clean up after him. Long story short - humanize him. These ideas about him you come up with don't even have to be true, it's just a technique to start practicing seeing him as something other than godly. Trust me, he isn't perfect, not even close. In fact, a lot of the very good looking people I know are significantly more messed up than my average-looking friends.\n2. Recognize within yourself that you are not in love/crushing on him, you like the idea/story you've created about him. You don't know him. You don't even know how old he is. You only know his work persona which is probably quite different than how he acts in his personal life. You've attached good feelings to his presence, but what does he actually do to make you feel good? You've admitted you hardly interact. In fact, if we slip on the reality lense here, your feelings for him are damaging your mental health and work productivity. Those aren't positive things at all!\n\nI'm not saying this to be mean. I've been in your position and also came to the realization I was taking my crushes way too far. You're addicted to that high feeling, not him. If it wasn't him, it would be some other guy. Just acknowledging to yourself that the fantasy you've created around him is not really real. It goes a long way in being able to let it go. I know sounds silly but next time you see him, think \"shit-streaked boxers\" over and over and you might find yourself feeling a little silly and relieved when the spell has been broken. Be aware of what you're doing in the moment. He's just a dude. Born with a nice face, that has given him a leg up in life. You don't know him and you don't need to. He's just another dude you work with. Exhale. Take him off the pedestal.\n\nP.S. This got a lot easier for me with age. I also dated a really attractive dude for a bit and he wound up being super pathetic and probably one of my biggest dating regrets. Biggest spell breaker of all.",
            "I needed this post so much",
            "It seems like you're the female version of me... Something similar has happened to me about a month and a half ago, with a girl who works at the same company as I do but with another team. My case was made worse by the fact that I found out she is engaged and it hurt a bit to know I couldn't pursue that crush further.\n\nI then noticed on myself the same pattern you did of becoming attached and fixated too easily to people. In my case, it's probably because I never had that many friends growing up, nor any potential romantic relationships. So anything that I see that could turn into one I cling onto it like my life depended on it because it feels that opportunities like these are too difficult to come across, as my mindset stems from a place of scarcity. Therapy played a huge part on this discovery, so it was important to have someone help me search those things within myself; while I'm not saying your case is similar to mine, you might discover something about yourself along those lines.\n\nAnyway, what I have been trying to do is basically getting to know more people. Like, as many people as possible, regardless of the setting. The more people you interact with, the more you learn about others and in turn, you discover things about yourself as well. And by immersing yourself in this, the idea is to abolish the thought that one single person is so special that they deserve your undivided attention and be the sole focus of your fantasies and desires. Having an abundance of people coming and going through your life is the key to avoid falling into these kinds of pitfalls.\n\nLastly, crushes come and go. It's normal to fantasize about people. To desire them. It's part of the human nature. What we do with them is up to us, and we have to learn how to control our emotions instead of having them controlling us. Kudos for you to walking a path towards emotional self-control.",
            "First of all I want to say I'm not a therapist. I'm also somebody who particularly enjoys what you are describing, crushes on my co-workers make the day that much more fun and I feel like I have a reason to get dolled up. And a little friendly flirting boosts my ego. \n\nWith that said, I completely feel for you because it is overwhelming, especially when you aren't into it. My random person girl-to-girl advice would be to try and find things about him that are not attractive. Bring out your inner vanity and focus on them. If you guys are ever talking just socially, try and bring up another girl and talk her up to him. Put your relationship firmly in the friend zone. Sometimes feeling like I've given him a signal that there's absolutely no chance helps me stop seeing someone in that light after a while because it's like I've closed that door. Maybe it won't work, but that's helped me in the past.",
            "I actually really understand this, and can relate a bit. When I was young I always had a crush on someone, it would be the soul crushing kind. But I NEVER actively pursued them or wanted to them to know. Many times I barely socialized with them. They also all had something in common. They were unavailable to me, unattainable, unreachable, and the more off limits they were the harder I crushed. \n\nI've recently come to understand that I am incredibly scared of intimacy. Vulnerability and intimacy make me really uncomfortable. When I take these two things I think they're related. \n\nPerhaps this issue with crushing you're having stems from the same kind of issue?  I don't know why your last relationship didn't last or why you need therapy for it, but maybe a fear of intimacy could be part of the problem?",
            "I have found in the past that simply talking to and developing a relationship with a crush can make them seem less like unattainable gods and more human. What about just trying to normalize him for yourself?",
            "Hey OP, totally know where you're coming from. Question: are you a person who suffers from anxiety and/or can get really hyper-focused on things (whether work, hobbies, or other)? If so, you could be experiencing something called maladaptive daydreaming. I've noticed about myself that when I'm under a lot of stress, my mind tends to obsess about something unrelated to the main source of stress. Sometimes this means I do a lot of online shopping-- like I get this vision of the \"perfect\" outfit and can't stop until I've done price comparisons and bought all the components. Other times, I get an intense crush on someone and get really carried away. \n\nI finally realized a few years ago that this was just my brain's unhelpful way of siphoning off stress from whatever was really bothering me. Now, I can usually stop it as soon as I realize, \"Uh oh, there I go again!\" \n\nMaybe this isn't you...but putting it out there just in case!",
            "Hey....love that you're self-examining and making realizations. Therapy is great and has done wonders for me and I highly recommend.",
            "I think you’re idealizing this guy. In your head, this guy is perfect and you’re unable to focus on anything else. The best thing to do is to remind yourself he isn’t what you’ve romanticized. \n\nSometimes the best way to deal with this is to force exposure. Invite him to a group hang out and spend time with him. You’ll either realize he isn’t perfect like you think and get over him fast, or you’ll at least hopefully get over the “wow this guy is amazing and I can’t think of anything else while he’s around” \n\nMaybe bring this guy up in your next therapy session?",
            "I had almost exactly this situation for approx two years.  The only way out was getting therapy. It took about three months working with my therapist, and some realignment of my thought patterns.  Voila, my crush slowly faded away. I felt SO FREE.\n\nGo get therapy. Being free of this unhealthy thought pattern is 10000% worth it. I know! I’ve been there. \n\nXoxo good luck.",
            "Okay so a few years ago I worked at a place and we had a customer that would come in frequently that was just gorgeous. He had stunning eyes and a perfect smile. He was also very friendly and personable. He would come in and look at me with his eyes and smile at me and talk to me in a flirty way, and I would just melt. I developed a crush on him and looked forward to him coming in. A few months of this, and he ended up getting a job there. I got to know him a lot better and we became friends but we had very different viewpoints and I also started to see him as more human and less idealized. I still had a crush on him but it was very mild because we were so different. So maybe get to know the guy and take some of the shine off. But then again I have had this backfire once with a different guy who I ended up having a lot in common with and we got on like a house on fire. So your mileage may vary but I have found that getting to know someone usually helps more than it hurts.  \n\n\nI agree with the folks that say to discuss this in therapy. This is something you could work out and they can give you coping tools and strategies for when you are around this person.\n\nOne more thing, I don't want to sound condescending, but when I was your age I still got really intense crushes, but over time I became less prone to them. So it might be something that happens less as you get older.",
            "I’m yet another women who has had to navigate unbearable crushes. My most recent crush happened a year ago, including the excessive eye-contact nonsense. He’s a classmate and I most definitely put him on a pedestal. A portion of my attraction to him was probably a wish to see some qualities of his personality in my own (for example, gregariousness). As others here have have suggested, I tried talking to him more, hoping to find a quality that turned me off of him permanently, but that quest failed. He was also single, so that didn’t help. I talked to my boyfriend about this crush as the internet advises one to do, but that didn’t help either, and our newly long-distance relationship kept struggling. Lucky for me I tend to lose interest in someone after getting rejected. I was 99% sure he was not interested in me. But I guess that 1% was still there and my crush wasn’t fading with time. A few months into the school year I told him I have a crush on him and I needed him to reject me so that I can stop having a crush on him. He kindly told me he was interested in a girl from back home. I apologized for the uncomfortable conversation; he was very nice about it all. I started to get over him! I do feel a bit creepy and selfish for forcing that conversation on him, but I don’t regret it. Whatever you decide to do, good luck, your not alone, and hugs.",
            "I used to experience this whenever I really liked someone.  I went to therapy for several years...not for this but this type of thing came out. I realized it was a lot of anxiety because I have attachment issues because I ONLY felt these feelings with people either I didn't know or in the long run were not good for me.\n\nPart of what helped eventually is daily I'd remind myself this person could be a COMPLETE asshole. I know NOTHING about them. They could be abusive. The beatles lied, love is not all we need. We need respect, trust, communication, etc. and I had no idea if this person embodied all of the things I needed. And that feeling I had that I labelled a \"crush\" was actually an anxiety response because of early childhood  shit that caused me to prioritize others over my own well being.\n\nEventually as I resolved internally what was going on and learned to ground myself in the reality of the situation,those feelings resided. It's like internal parenting. Set guidelines for yourself to do what you need to do. Your world is more important than someone you hardly know.",
            "And even if this person is GREAT, humanizing him a little more will lessen the intensity of the crush. It’s weird but it’s true.",
            "It happens and that is that.  Do you really know if it is unhealthy?",
            "Your mind is fixating for a reason. Even though this is actually hurting you, there’s a part of your mind that thinks it’s helping by doing this. What are you getting out of this fixation? What is it protecting you from? You did say that you still have fun at work, so it probably isn’t doing this out of boredom.\n\nYou mentioned that you’re healing from past relationships. Could it be that your heart is yearning for someone to love, but doesn’t feel safe, so you’ve fixated on someone “unattainable” as an outlet?",
            "I had a crush on a former co-worker that was so bad that I actually had to quit and find another job.  At my new job I'm at, I'm so thankful I have my own space and that I don't see people much unless they come up to my station.  There's this guy at my new job, too, that I'm interested in getting to know but because of my last bad experience, I haven't been pursuing it.  If I run into him, cool, but I'm not going to go out of my way to run into him.\n\nPlus, I don't know if he has a girlfriend or not.  Usually the ones I meet who have stable jobs already have girlfriends so I'm willing to bet my new crush at my new job already has someone.  \n\nI've been keeping my distance so it doesn't end up like my last job with me quitting.  Having my own office space where I don't see much of anyone helps in not running into the said co-worker.\n\nIf you can, keep your distance from him and only see him if you have to - like don't go out of your way to see him just to see him and remind yourself keeping a job is more important than a temporary crush.",
            "Work relationships are not a good idea.",
            "Find things you don't like about him and repeat those thoughts when you find yourself thinking of him. For example, \" he's really kind to me...but he doesn't like cats so i could never be with him.\" Or \"the way he talks/dresses remind me of my brother, I could never date him.\" Etc. Just create and find ways to not like him.",
            "I think the technique you should be looking for is \"mindfulness.\"\n\nYou recognize that you really don't know this guy and that a relationship is not something you need right now.\n\nSo the problem that remains is that he takes up your thoughts, fantasies, and also affects your bodily responses like heart rate or breathing. \n\nWhen you see him and your body responds with a racing heart or irregular breathing, practice mindfulness. Focus your efforts on slowing your heartbeat and breathing normally. \n\nWhen you find yourself thinking about him, focus your efforts on something else. What are the most important or most interesting things going on in your life right now (aside from your coworker)? Focus your thoughts on those things.\n\nFantasize about other things. A relaxing vacation on the beach. Your ideal life after therapy. Or whatever else you dream about.\n\nThis will take time. But these mindfulness exercises teach your body and mind how to respond how you wish them to respond. \n\nGood luck!",
            "I acc had a totally creepy crush on this guy in my year for like 5 years and then wham he got with me out of nowhere and we fell in love, didn't last long but the moral is its only creepy if they don't find you attractive so you might as well find out",
            "Seriously, just don't start masturbaiting to him and you still have hope. It may be a feeling you'll have to work through and that takes time.",
            "It sounds like you don't actually like how you feel or act when you're around him. You could focus on that, because it is something that is within your control. When he walks in, take a moment and notice things about yourself. Is your heart beating faster? What do your hands feel like? What emotion are feeling? Notice the differences in you when he is near you versus when he is not, and then when he is near you, do your best to replicate or remember how it feels when he's gone. Take some deep breaths, focus inwards and give yourself a lot of self compassion as you work towards acting the way you want, regardless of how you feel. \n\nTherapy is also good. I learned these particular skills in Acceptance and Commitment Therapy (ACT), as well as Eye Movement Desensitization and Reprocessing Therapy (EMDR). Traditional talk therapy was good at first, but I discovered I needed more concrete tools to change my behavior. Happy to send you resources if you want help tracking this stuff down. It can be extremely difficult to navigate the mental health field alone.",
            "Keep in mind, your crush probably knows you like him.  I'm in a similar environment but on the other side playing the role of the \"very attractive\" male and I know who likes me a little more than just the friendly co-worker.  I had shadow banned the whole building  when I started working there ( NO DATING ) as a rule, your guy might follow the same rule .  That being said, I love bumping into them outside of work, they are ridiculously pretty where I work.  Damn the ban.",
            "I’m not a therapist. I have had a similar issue with a crush in the workplace but it conflicted with my don’t shit where you eat policy because if there’s a breakup I don’t want to have to see that person again. For me it was an attachment issue because I felt that the coworker really understood me in a way most people don’t. I asked him out after changing jobs but he wasn’t looking for a relationship. There were feelings from his side that I didn’t know about until a friend of his told me. Anyway I have since moved on to healthier relationships with reciprocated feelings and expectations. You can do it too! Just wait until things are more settled in your life to make these relationship “moves.”",
            "Just talk more and maybe become friends. Attraction is a great precursor to friendship. Get to know them and the more human they are to you, the less \"oh my god\" you'll feel whenever you see them, and the more comfortable you'll feel.",
            "It’s 2020. You chase that tail girl! But as a dude that hooked up with a coworker in a relationship don’t do it. Causes people to quit!",
            "I had something similar to this but not as severe. I ended up getting the guys phone number and upon getting to know him i realized he was a giant asshole.  (I meantioned i had a little crush on him and he just said \"well i think youre hot, buttttt\" and then later on he basically said the only good thing about me was my body. Im very smart, told so by lots of people and my academics reflect this. So it isnt just a hot body i have going for me.) So if you only see each other in passing maybe exchange phone numbers and just text him a little. He might reveal something that totally ruins your crush on him. The opposite could happen, but then maybe you would try harder in therapy if you thought he was a great guy and wanted to be with him, but you know you need to be healed and happy first. Maybe when you start seeing a therapist for your past relationship issues you can mention this dilemma. A therapist will definitely be able to give more insight on how you can change your feelings. My advice is to choose to get to know him and end up either really liking him and going to therapy to get better so you can date him, or you fond out you hate him as a person and no longer like him. Your choice.",
            "Good for you for realizing you need to work on yourself first before entering a relationship :)\n\nSo... this may sound weird, and it could possibly backfire... but since you don't want to leave your job, the best thing to do is to actually force yourself to start talking to him more.  This will hopefully normalize him, rather than continue to unintentionally put him on an emotional pedestal. You may find things about him you don't like that pushes away your feelings. Should you find yourself liking him /more/, then you just need to work on your self-control; continue to catch your feelings, as you are now, and tell yourself it can't happen now.",
            "Why can't you talk to him if you see him so often? Maybe he would like you? If he doesn't at least you can shut it down in your mind. But if you keep it at this level you probably won't be able to move on",
            "I was in your shoes when I was in high school 3 yrs ago.i had a crush on a girl in my class.we didn't talk...At all.maybe here and there a bit about upcoming events and stuff.I used to look at her but not talk.I think she did the same...Coz sometimes when I looked at her she would be looking at me and abruptly look away.i didn't tell her that I liked her...This is the most regretful thing I've done in my life.i still haven't told her.she has a bf now.when I left school I had dreams about her everyday.not in a bad way...I don't even remember what the dreams were.I'm still single and still have a crush on her.i haven't seen her for 3 yrs..Only on Instagram.\nI highly suggest you tell him...Maybe he likes you too and is too shy?What's the worse thing that's gonna happen? You'll be awkward around each other and it's not like you talk a lot.look at the pros:you'll be concentrating on your work.you'll be more confident when around him.",
            "I didn't think it is unhealthy. Hear me out. First, you are not in a relationship now. Second, when we have a crush on someone, we tend to be a more soft, better person. Use that in as an advantage. Consider this crush as motivation rather than jail. Motivation to heal from a prior relationship that caused you hurt. Feel the fire in your hear again. It's a beautiful feeling to feel attached to seeing someone because there will be a time when you will hate everyone. 😊",
            "Talk to him honestly. If it’s really bothering your work, you should handle it now before it gets any more intense. \n\nHe sounds like a guy that would understand and appreciate you trying to get him to understand your struggle. Plus, he probably feels oblivious to you and your crush of him, so it might shock him to know you’ve been low key obsessed, but in a good respectful way. You recognize that you’re not ready for anything close to a relation, but you also recognize you can’t just ignore these thoughts, they can quickly turn into a negative spiral of self hate and self sabotage. \n\nPlease be careful, and do what’s right for you, don’t think about how he’ll take it think about how you need to express yourself so y’all can have a coercive work environment.",
            "I don't know if this will help at all, but one of my first hard crushes grew very bad over months, i started dreaming him. He wasn't interested at all, so I wrote him a long letter about everything I feel and think about him, it felt like getting him out of my system. I intended to burn it but couldn't bring myself to do it. It also turned up longer than I thought it was going to be. In the end I felt like it helped to pour everything out, it was like i got rid of it. Hope this helps someone!",
            "So reading your post, I felt like it could describe my situation at work, even though it could apply to a lot of people.  \n\n> He's very outgoing and friendly with other people on my team. He's also very attractive. I enjoy being around him, but I'm way too nervous to talk to him.  \n\nHe might feel the same way about you. You should keep in mind that he is a human being as well. Being attractive does not mean he does not have insecurities of his own.  \n\nI would also second therapy to try to get to the root of the issue.  \n\nAlso, if he likes you back, there is probably a lot he is willing to do. You should ask yourself what you want from him. If you just want someone to talk to, he might be down for that.",
            "Have you ever heard the term limerence? That might apply to you. It’s an obsessive kind of love, usually on someone who’s just out of reach but is close enough that you have little interactions with them throughout the day. It can become obsessive and take over all your thoughts. You should look up resources for this. Some people have limerence and some don’t. Your friends might not get it but there are online communities for it.",
            "I [29M] have a very similar crush towards a co-worker [early-maybe-mid-20sF]. Actually broke down about it yesterday when I went on lunch for work. If it's really eating away at you, to the point you can let out some emotion over it, I highly advise it. It's still there and it might never leave till I leave the job, or she does, but getting a lot of emotion out at once makes the day-to-day easier. Good luck homie.",
            "my 2 cents is to try therapy. psychiatrists and or therapists are great at helping people work through these types of circumstances",
            "When are you starting therapy? A good therapist can help you use this experience to work through it and grow. It's a really good idea not to get involved with people you work with, especially if you have issues you need to work on. \n\nTherapy would be the #1 step if you have access to it. \n\nYou could also start looking for things you don't like about him. Most of the reason you like him is probably based on fantasy and his external appearance. So you could start looking for his flaws (in his appearance, the way he talks to people, etc). None of us are perfect so that might help lessen the intensity of your feelings toward him. And keep reminding yourself that a lot of this obsession is based on fantasy, not reality.",
            "Story time!!!!\n\nOnce upon a time, I got hired in a store that i used to shop in a lot, to get groceries, etc. I submitted my resume at the age of 18, and the manager immediately thought I’d be a great addition to the team, so she hired me on spot. \nI did not know that a handsome, young and mysterious man worked there.\nDays pass and I become uncomfortably attached to him. I will explain the crux of this attachment down towards the bottom of the story. \nHe ended up loving the attention I gave him and he manipulated me for 4 more years. He would get to know where I went to college, enroll in my classes, flirt with me, invite me to his house alone, went on small dates, then would constantly make sensual remarks that my mentally ill brain thought was his way of expressing love. We ate each others energy up and I couldn’t bare the days where he wasn’t there with me. I told people about him and how close we were. Every stare, every move we would make at me just drove me more and more ill. There came a day where I confessed my love for him and he shot me down, extremely painfully and abruptly. He said that I only got this way because I let myself fall, letting him revel in the unhealthy power balance. I fell into a suicidal depression, and then got diagnosed with various personality disorders. I am under very strong medications now. By the way, I did not have a history of falling for anyone like this, so hard, in the past. \n\nTLDR: I became obsessed with my coworker, confessed my love for him, he shot me down and admitted he only liked manipulating me for years.\n\nLISTEN TO YOUR INSTINCTS. Don’t let your mental health slide for a man who could easily make you 1/8th of a person you are now. Talk to a professional and get help before a power imbalance manifests between the two of you. Yes, my story is extremely dramatic and rare, but it is a lesson to learn when you don’t rely on instincts and ignore warning signs in the first place.",
            "Quit your job, it's literally the only way you'll might be able to deal with it, anything else and you'll keep coming back to it until you screw something up. Next time stop it before it happens, if you notice yourself paying a little too much attention to someone distract yourself immediately.",
            "Just go for it! You said you're not looking for a relationship so the worst he can do is say no.",
            "Have you graduated college? I ask because 22 is kind of young, and if you’re still in college and this is an internship/co-op type deal where it’s temporary then I would say the best way to deal with this is wait it out and move on if you don’t want to actually make a move. You should shoot your shot, though, you never know!",
            "You need to turn this crush into a real person by talking to him; practice speaking to a few new people who you aren’t attracted to— people usually love talking about themselves.",
            "Is there any reason you cant tell your coworker how you feel and ask him out?",
            "So yes to therapy.\n\nAnd also, I understand the sort of crush you have. I’ve had a fair few myself and I tend to pick guys that are unavailable anyway because it’s just like a fantasy for me (like teachers).\n\nSo I write. Try writing it down! Even if you aren’t a writer! Use it to fuel a creative endevour you have. Then delete it when your done. It’s not bad to have the feelings, it’s about what you do with them. For me, bottling up a crush has never worked. I’ve always needed to excise them with writing or drawing or daydreaming.\n\nBut yeah, also therapy. Good luck!",
            "Woohoo crushing on someone is the best and most distracting thing at the same time. I’ve left jobs coz I couldn’t handle the heat I’ve had with someone but knew it was a no fly zone. I say put it on slow burn, let yourself heal from last situation and enjoy the thrill from the new. Slow burn is the key. Self restraint and enjoy that sizzle energy",
            "Hmm. I’m not sure if I have the right answer but it sounds like enmeshment behavior. It’s where you don’t know where someone begins and you end. If they are happy you are and if they are sad you are too. Sort of in that direction. Maybe if you worked on yourself and your identity, you may feel a stronger sense of self. Maybe do some identity and boundary work...and self in that way to get a stronger handle on yourself in our own space and environment...not that it’s bad to have a crush. Also you could maybe look to see who he is as a person and see if he is really someone you respect, you might get turned off if you find that he isn’t quite you expected idk",
            "I’m going to imagine you’re my coworker. See you in about 9 hours.",
            "I wonder if a chick ever felt this way about me lmao",
            "This sometimes happens and it doesn’t make you a creep. I think it is a sign you’re not 100% mentally healthy with regard to romantic relationships if it’s happening, which you seem to realize. \nIt’s worth noting that some of these commenters would indeed be calling you a terrifying and dangerous creep right now if you were a guy.",
            "I don’t want to play armchair psychologist here so please take this advice with a grain of salt - and I’m only saying it because I suffer from this disorder - but have you possibly looked into the symptoms of OCD? I personally go through phases sometimes where I feel unhealthily obsessed with someone or something (could be a person, an actor, band etc) and it hinders my ability to focus on other things. I’ve been told by therapists that this could be related to my OCD (which I was diagnosed with at 9). Good luck with your predicament.",
            "In rob zombies voice, “meet the creeper!”.",
            "Honestly, I've understood with a bit of age that the fantasy of someone is almost always, waaaaay better than the reality. Girl he might have a tiny penis, no stroke game, daddy issues, ex gf issues, closeted gay issues, you never know with someone. You can't be obsessed with someone you don't know. They have flaws and faults. I've been where you've been and I can tell you that even though you're older than some, you're very very young. This is a crush and it will past.",
            "Why not try to date somebody else who is a good choice?",
            "Tell him. All of this.",
            "Whatever you do, don't tell him. Don't get into writing him letters, gifts and shit. It's at work, and even if it wasn't, he should never, ever know this. Don't even tell anyone about this anywhere near him. Hide all of this.",
            "Find a nice FWB?  You’re saying it’s intellectually a bad time to do what everyone has a biological drive to do.  Probably not with a coworker you’ve fixated on, but with someone.",
            "Here is the thing..  you don't HAVE to pursue a relationship with your crush in order to pursue your crush. You're allowed to have casual, FWB sex with him if he's also into you and that's your thing.  Otherwise, your hand is your friend...",
            "Can i ask whats your job? And if you can describe whats so attracting on him? And maybe you should be glad that you have feelings like this and instead of trying to delete them you should try to accept them and enjoy them.",
            "Get her drunk, have your fill, and then ghost her. Easy."
        ]
    },
    {
        "post_id": "4ohwwg",
        "author": "throwawaytppcp",
        "title": "UPDATE: I [23/F] don't know whether my SO [24/M] of two year's appearance-related \"preferences\" cross the line.",
        "url": "https://www.reddit.com/r/relationships/comments/4ohwwg/update_i_23f_dont_know_whether_my_so_24m_of_two/",
        "score": 2268,
        "num_comments": 163,
        "created_utc": 1466144233.0,
        "selftext": "Link to original post here: \nhttps://www.reddit.com/r/relationships/comments/4o5d3y/i_23f_dont_know_whether_my_so_of_two_years_24m/\n\nPutting this up top because the post might get lengthy: \n**tl;dr**: My boyfriend continually insulted my lady parts. I tried to talk to him, but he just made excuses and blamed his behavior on me, so I broke up with him.\n\nThis morning I decided to sit my boyfriend down and explain how hurtful his comments had been. He became very defensive and stated that the labia comment was meant as a compliment. Furthermore, he expressed that he thinks I'm far too sensitive, lack self confidence, and that nobody else would be bothered by his \"negging\". From the responses friends have given me when I've mentioned this (and from the comments on my previous post), I really don't think that's true. Constantly picking apart your significant other's appearance is the abnormal behavior. \n\nHis reaction really drove home for me how selfish and insensitive the dude is. I could name numerous situations during the course of the relationship where he played the martyr, disregarding my needs and feelings entirely. \n\nCases in point (All entirely true- sadly):\n* He managed to break a sex toy (that he had purchased and that I hadn't even wanted to use) so forcefully that it cut me \"down there\". I got to go to urgent care bleeding from the vajayjay and he texted me saying how much it \"sucked that he hadn't gotten off\". \n\n*He demanded to use my laptop to play video games while on vacation, caught the charger cord with his foot while he flailed around playing World of Warcraft, and smashed it to the ground. He had a fit when I asked him to pay for the repairs and went home 10 days early (without me).\n\n*He wore threadbare gym shorts to my grandfather's funeral and watched porn on his phone during the service.\n\nPoint being, the guy's a selfish, disrespectful jerk. I put up with it for far too long and I'm just done. Nobody's significant other should make them feel as crummy as he did me. I hope that he is able to change his behavior and find happiness in a relationship in the future. As for me, I will take my \"lady garden\" somewhere that it will be appreciated in future. Thanks to all who commented. Your kind advice helped me see what I needed to do. \n\n\n\n",
        "permalink": "/r/relationships/comments/4ohwwg/update_i_23f_dont_know_whether_my_so_24m_of_two/",
        "comments": [
            "HE WATCHED PORN ON HIS PHONE AT YOUR GRANDAD'S FUNERAL.\n\nHE HOSPITALISED YOU VIA SEX TOY.\n\nHoly moly, well done on leaving.",
            "I would strongly suggest you get yourself into some individual counseling to focus on building your self-esteem. Those examples you gave are reason enough (any one of them, by themselves) to show this guy had zero respect for you and you put up with it for far too long. I'm glad you're out now, but take this time to focus on yourself and why you let yourself be treated that way and how you can positively change so that it doesn't happen again in the future. You are worthy of love and respect. ",
            "Good for you, but also... Jesus Christ woman, have some self-respect. SO hurts you, you have to go to the ER, and they can't be bothered to come with? That's bad enough on its own without the text complaining about how hard it is for him. SO wears ratty clothes to your grandfather's funeral? Again, pretty bad on its own - but watching porn during brings it to an entirely new level. I think you need to sit down and have a looooooooong think about why you were okay dating this guy for as long as you did.",
            "Who the hell watches PORN AT A FUNERAL??\n\nOP, you are way better off without this dickhole. Good job in dumping him - may your ladygarden receive far more polite and mature company from now on.",
            "Anyone who admits to 'negging' is pretty much an abusive asshole, at least in training, and as a concept it also is frequently attached to some incredibly mysoginistic beliefs. Thinking that's an ok way to treat a person is a flag so big and red China would be jealous. \n\nSo good for you that you got out. Huge bullet dodged for you.  Sadly I doubt he'll learn his leson and some other poor women will be subject to his shit at some point. ",
            ">Cases in point (All entirely true- sadly): * He managed to break a sex toy (that he had purchased and that I hadn't even wanted to use) so forcefully that it cut me \"down there\". I got to go to urgent care bleeding from the vajayjay and he texted me saying how much it \"sucked that he hadn't gotten off\".\n*He demanded to use my laptop to play video games while on vacation, caught the charger cord with his foot while he flailed around playing World of Warcraft, and smashed it to the ground. He had a fit when I asked him to pay for the repairs and went home 10 days early (without me).\n*He wore threadbare gym shorts to my grandfather's funeral and watched porn on his phone during the service.\n\n\nYou realise these were all FAR fucking worse than him complaining about your hair/labia, right? This guy is an unrepentant douchebag and you should have dumped him immediately after the first of those cases. Jesus.",
            "[deleted]",
            "> He wore threadbare gym shorts to my grandfather's funeral and watched porn on his phone during the service\n\nHe broke your vagina, refused to accompany you to the hospital, and instead of sending a \"are you okay\"/\"how are you text\" he basically sent a \"i'm still horny\" text\n\n**Why the fuck did you stay with him after that?** How did you manage to stay with this douche for two years, knowing he's capable of something like?\n\nLook, now that you've dumped the asshole you need to work on your self-esteem because any one of these situations should've resulted in a complete dumping. If your bar for dumping is set so high that you needed multiple of these situations to get you to end the relationship. You need to re-evaluate something (particularly, re-evaluate your self-worth, because you are worth so much more than how he treated you).",
            "[removed]",
            "I think you are still incredibly blind to how severe this guys behavior was. \n\nHe wasn't just a jerk; he was ABUSIVE. You were in an abusive relationship. \n\nHell, I was in an abusive relationship and he never made me bleed and go to urgent care. \n\nPlease don't move on to the next guy who abuses you in a different way.",
            "Yay. Awesome update. May your lady garden flourish now it's free of this jerk.",
            "[removed]",
            ">Furthermore, he expressed that he thinks I'm far too sensitive, lack self confidence \n\nOn the contrary, the more self confidence someone has, the sooner they would have shitcanned him.",
            "With each example, my eyebrows raised a little bit more. My mouth literally dropped open at the porn/funeral one and now I actually look like a cartoon going :o\n\nWhat the HECK. To all of it. Well done for leaving. It's incredible what you put up with when you really care about someone, and how you can trick yourself into ignoring/rationalising the horrid stuff - especially when they're literally telling you that you're overreacting or whatever. \n\nYou're great and your lady garden is, I'm sure, glorious. This guy is a class A douchebag. I hope the breakup is easier for you knowing that you're getting rid of something ridiculously toxic, and that you move on to brighter and better things! ",
            "Jesus. I thought he was an asshole *before* you said he watched porn at a funeral! Good riddance! ",
            "I too, like everyone else here think you need to be in therapy. Never mind the hating your vagina shit. His behaviour you describe in your update is absolutely horrifying. It's equally horrifying that you have such poor self esteem as to put up with it. The fact that you have allowed someone to treat you so, so, poorly is something you urgently need to address. Stay single until you can love yourself. ",
            "[deleted]",
            "Oh... good for you. I can't imagine how you could make it this far with him. So glad you got rid of the special snowflake man-baby. Congratulations! \n\nNow get some time to learn to appreciate yourself so that you don't get together with another selfish prick.",
            "I dont understand, why did it take four of these incidents, each of which should have resulted in an instant dumping, for you to see the light?\n\nI mean,  I do understand - you must have critically low self-esteem to stay in this relationship this long.  Please consider therapy.",
            "Whoa. All three of those examples are the worst things I've ever heard. Each of them should have been immediate grounds for a break-up. Better late than never! You deserve better than that lunatic.",
            "[removed]",
            "if this guy is real, he is a piece of shit.  If you have feelings and dont like being treated this way, dont put up with it.  Dont be with people that are shitty.  The older you get you will naturally figure this out without me, or the internet having to say anything, but for now, since we are here....Dont date guys that treat you like shit!\n\nIf ou find its a pattern, then you need to figure out what it is with you that is being so needy that you are letting people treat you like a garbage person.  I dont know you, but I doubt you deserve emotional abuse, no one does, except for the people out there dishing it out, but even they do it for a reason, ussualy I think because it was done to them.  \n\nMove on, its better to be alone (which btw, isnt that bad), than to be with anyone that treats you like you dont have feelings, or maybe even basic humon rights.  \nGood luck out there, knock em dead..or maybe just slap the next one who is rough enough with you to break a sex toy off in you.  Thats grounds for open hand punch to the face or maybe his balls idk, your pick at that point.  ",
            "> *He wore threadbare gym shorts to my grandfather's funeral and watched porn on his phone during the service.\n\nWTF. Nope. Fucking nope. ",
            "[removed]",
            "So glad you dumped him! I really hope though that you can take a look at his behavior and use it to recalibrate your expectations for your next relationship. Every single one of those stories is a dump worthy offense and anyone who does something similar is not worth your time or effort.\n\nI promise you there are scores of guys who at baseline are 100x more respectful that your ex. So if there's a next time you find yourself saying, \"he's a great guy but he disrespects me in this way,\" please come to Reddit so we can tell you he is not in fact a great guy.",
            "Umm... Why the *fuck* did you stay with him through all the stuff that came before this??",
            "What I don't get is, all of the examples in this post are already enough to break up. You waited far too long. Watching porn during a funeral. Breaking your laptop. Cutting your vagina and whining about not getting sex after. Christ, what a douche.",
            "Frankly, I'm flabbergasted you put up with this guy for so long. Hindsight is 20/20, but he should have been gone *loooong* ago. Glad you're moving on.",
            "He watched porn at a funeral and you didn't immediately break up with him? What the fuck were you waiting for",
            "Why did you allow him to attend the funeral wearing gym shorts?  I would have kicked him out the car on the way there.  ",
            "How did you not break up with him at your grand-dad's funeral? The level of disrespect from this guy is astounding. \n\nNext time red flags start slapping you in the face, pay attention!",
            "There's literally a segment of society that is undateable by normal people. Your boyfriend unfortunately is part of that segment. ",
            "Any one of these issues by itself is reason enough to get rid of the guy. Suffering through any of it for two years is alarming. As other posters have commented, counseling would be a great idea before moving into any future relationship. Establishing sense of self-worth, acceptable boundaries and being able to assert one's needs are essential to a health relationship, and those are things we have to find in ourselves before finding a partner.",
            "Jesus Christ this guy is degenerate scumfuck piece of shit\n\nYou made the right call",
            "I'm so glad that you managed to get away from this *unbelivable asshole*.\n\n\nLady garden's are happier when only nice people play there!\n\nI wish you all the best!",
            ">He managed to break a sex toy (that he had purchased and that I hadn't even wanted to use) so forcefully that it cut me \"down there\". I got to go to urgent care bleeding from the vajayjay and he texted me saying how much it \"sucked that he hadn't gotten off\".\n\nWhat. The. Actual. FUCK.\n\nAre you kidding me? Girl, you have no idea what a good decision you made. That guy is nothing more than a shit-sandwich on legs. First, aside from understandable circumstances (stuck in traffic, at work and can't leave, etc.) if I'm in the hospital/urgent care you best believe my guy is there too. And then, *he is directly responsible for you being there* and he doesn't even go with you?? And I can't even talk about the text because it's actually pissing me off that someone thinks it's okay to say something like that to another person.\n\nSeriously, go forth! Be single for a while, fall in love with yourself (seriously, you have to if you want to have a good relationship) and then find someone who is going to be there for you. Your SO should be your rock to hang on to, not the rock itself that's being flung at your head. \n\nOn the upside, it will be hard to find someone that's worse than this idiot, so yay?",
            "the fact that he used the word \"negging\" indicates that he's one of those PUA twats.  good riddance!",
            "LOL. Had me dying by point two, but point three... dear baby Jesus lol what is this kid's problem",
            "Oh wow... This actually made me pretty sad to read. What a vile person. I'm really sorry that you had to experience even one of those things. \n\nThe other people commenting about self esteem counselling are worth listening to. You deserve so much better than this. \n\nWell done for getting out, you should feel really proud of yourself. Write these things down and if you ever even begin to miss that creature, read what you wrote. Xx",
            "I do not remember who said this and I'm paraphrasing, so apologies in advance: If you get a VIP ticket to pussytown, don't complain about ... Something, anything ... Point being if you want to keep visiting my bed, don't. Complain. About. It. That'll get you kicked right off the flight before you even arrive. ",
            "[deleted]",
            "He's even more of w douchebag than I originally thought! That's amazing!!",
            "Wow. How men like this find a relationship and maintain it is beyond me. ",
            "Oh I'm so glad you got rid of him. I remember your first post, I think I was involuntarily making a vomit face throughout reading it. \n\nI'm just so happy you diced him. He sounds utterly horrific. The only thing that could make me happier at this point is knowing that he cried when you dumped him. \n\nGood for you op!!",
            "How did you put up with this guy for two years? :O",
            "> and that nobody else would be bothered by his \"negging\".\n\nWait a minute? He himself used that term? I mean it obviously was negging, but to not even try to hide it is astoundingly stupid.\n\nI'm happy for you that you got away from such a douche. You'll find someone who respects you the way you are for sure.",
            "Wow all those examples are just total shitty behavior, but just the fact that he used the word \"negging\" at all would be cause enough for me to GTFO.",
            "He sounds like a sociopath to be honest. You dodged a bullet. Might wanna change your phone number and locks, too. I'm not even kidding. Who watches porn at a funeral service and makes their partner's vagina bleed like that with no remorse?! YIKES.",
            ">He wore threadbare gym shorts to my grandfather's funeral and watched porn on his phone during the service.\n\nJesus...making comments about your downstairs mixup is what broke the camels back?! You must have the patience of a saint.",
            "Disgusting.  This guy is the bottom of the barrel. Who the hell raised someone to be this shitty?",
            "IDK which one of his top 3 asshole stunts he pulled off first from what you listed but anyone of those would've been a reason to dump his ass.  OP don't put up with shit anything like this again.",
            "Holy shit, better late than never. How in the fuck did you put up with that shit for 2 years? He watched porn at your grandfather's funeral!? Fucking hell.",
            "My jaw fucking DROPPED when I read that he watched PORN at your grandfather's funeral!\n\nGood on you for dumping such a self-centered asshole.",
            "The guy is 24 and is a total herb. Good on you for leaving. \n\nI'm sure he'll be a castaway soon enough with those traits. Pushing everyone away from him. ",
            "Your bf was a douche, porn at a funeral?! The actual f....?!",
            "WHAT.THE.FUCK.  How is this assclown even dateable?  In what universe does his behavior even approach acceptable?",
            "Good God.\n\nI've never been so happy to see someone get dumped on this sub before.\n\nPlease enjoy your life, free of this selfish piece of shit!",
            "Good partners pick you up when you're down, do positive things with you and enjoy the good times together.  Find one of those guys.",
            "Holy fuck, what an ass hole. Glad you broke up with him OP. Find someone who likes you for you",
            "You're getting a lot of crap for not dumping him earlier.  You don't deserve it.  There is a switch that flips when someone's self esteem kicks in - as yours did when you kicked this asshole to the curb.  Now that you know how good that feels, you are more likely to expect to be treated like a human being next time.  Great job!  Some people are suggesting counseling for you, and that's not a bad idea.  It could help you reinforce your new inner badass in the future!  You're on the right path and taking care of yourself!  Good for you!",
            "Oh honey.... Please leave him now!!! Remember he will try to find a way to manipulate you back, you've made things easy for him as you were being understanding and supporting and he will miss the hell out of that. Please be strong you don't deserve him, his behavior and his selfishness. Dump his ass. Finish him!",
            "Good for you for getting out of a relationship with a manipulative, cruel jackass. But seriously, you need to re-examine why you stayed with him for so long when he both mentally and even *physically* hurt you. \n\nA romantic relationship should be a pact of mutual nurturance, where both partners commit to loving one another and showing each other compassion, care and respect. In the future, you need to get out of a relationship if you see clear signs that your partner is not willing to treat you with the respect you deserve. Do not just \"hang in there\" hoping whatever jerk you're with will magically transform into a great guy!\n\nAlso, I recommend you read Ty Tashiro's Science of Happily Ever After to better understand what a good partner *does* look like. Basically, you need someone who is both kind and emotionally stable -- core concepts your horrible ex lacked!",
            "I can't believe you didn't break up with him.... A lonnnng time ago.",
            "You need to figure out why you let this guy push you around for so long. I can't believe the labia comment is what tipped you over the iceberg. You should have been running for the hills from the get go. Girl - you seriously need some self worth. ",
            "Holy shit so this guy came across as a massive jerk during the first post, but the examples you just listed - who the fuck a) hospitalises their SO during sex and doesn't go with them to hospital and apologise and care for them, b) leave a vacation 10 days early because they broke a laptop, and c) WATCH PORN AT A FUCKING FUNERAL??????? ",
            "He was right about one thing: for having put up with this, it does sound like you have low self-esteem. I'm not sure what good it does him to point this out in a way designed to tear you down, except to not face his own low self-esteem, because if he things so negatively of parts of you, why was he with you? Did he secretly believe he couldn't do better? \n\nMost of the time this kind of criticizing is an attempt to mask and redirect someone's own insecurity.",
            "The fact that he tried to defend himself saying no one else would be bothered by his negging would be enough for me to stand up and leave. Honestly reading the rest of the points were so painful...  He watched porn at your grandfather's funeral? What a disrespectful asshole. I'm sorry you dated such an ass OP, you deserve better. ",
            "Woooooooow! I am so glad you are outta there. You did not deserve any of that treatment, and there is a happier, brighter future in store for you without this asshole!",
            "Holy hell, I didn't think this guy could get any more awful, but people are full of surprises, eh?\n\n\nGood job on putting your foot down and leaving him.\nYou deserve to find someone who will appreciate your lady garden and won't constantly complain about the plants or landscaping :) Don’t ever forget that. Now, take some time to appreciate and enjoy yourself!",
            "What a total ass! Find someone who appreciates you and your lady parts in all their glory",
            "I'm so so glad you decided to leave. This guy has no respect for you, and it's great of you to be able to see that! ",
            "Congratulations on standing up for yourself and dumping this jerk. You have made a great choice. \n\nIf he comes crawling back to you, and says that he cares about you and will change, please tell him that your answer is still no. Blocking him on phone, facebook, etc would be a great choice. You deserve so much better. ",
            "Glad you broke up with him. He's selfish and doesn't deserve your lady bits.\nAlso, I'm sure plenty of other men will find them attractive. ",
            "This blows my mind.  I don't think I've ever been asked my opinion of the appearance of a partner's vjay... \n\nbut I'm pretty sure if asked the only answer is: I love it, its sexy as hell.\n\nThen the other shit this guy did... yeah DTMFA.",
            "Bullet = dodged. Well done OP. ",
            "How do people like this end up getting into relationships with normal seeming people?",
            "This is the post you read and go WTF out loud. Good for you OP, human relationships are a b*tch.",
            "blows my mind that people can be so fucking stupid. the very least a guy should do is support and encourage his GF... im pretty dumb sometimes, but goddamn... ",
            "I am so glad that you were brave and took control of the situation and chose not to allow to be treated that way anymore! You don't deserve the way he made you feel about yourself and for how immature and disrespectful even as a person he is, he should be ashamed of himself, and his parents should be embarrassed by their son's actions! And for the way he acted at your grandfather's funeral (I'm sorry for your loss), I would have broken up with him right there. I hope that you take the time and enjoy your single life and do not rush into any new relationships and take things as they come! ALWAYS remember, you DESERVE and SHOULD be treated like a queen and nothing else! xoxo",
            "He's a narcissistic, abusive asshole. Don't waste your time investing any more of your youth with this colossal douchebag. He's never going to change and he will get much worse. This is classical narcissistic behavior. He'll make you feel like shit for the entire relationship, gas light you, slowly isolate you from family and friends and then when he's done, he'll leave you in the dust and your life in shambles. Dump this loser and find someone worth your time. \n",
            "Good job ditching this abusive man-child. ",
            "Well... And I thought I was being an asshole sometimes. What a real charmer. Never look back.",
            "Holy shit, OP. I thought he was garbage before, but really, the funeral, the hospitalizing you via sex toy, the breaking your laptop??!\n\nThat is unspeakably bad.\n\n\nFor perspective, the bare human response would be 1) take you to the hospital 2) wear at least khakis and sit quietly, and 3) at *least* split costs.  OP, that's how a stranger would have responded.\n\n\n\nYou seem like a very kind and patient person. Please, please find a copy of the book \"Boundaries\" by John Townsend and read it before thinking about dating again. You deserve much much better. \n\n\n Sometimes people say \"relationships are hard\" and that can be true. This isn't the kind of \"hard\" they're talking about though.\n\n\nYou are a queen, and you deserve to be with someone that adores you and treats you well.",
            "Sounds like he needs to admit who he really is and come out of the closet.",
            "OP, I'm so glad you dumped this jerk. But please consider seeking therapy. You've been abused in this relationship and your capacity for abuse is disturbing.",
            "There's people who make bad mistakes and then there are people like this... rotten to the core.",
            "[deleted]",
            "[removed]",
            "Oh my god, girl. I'm so glad you're through with that guy.  You seem like a sweet person, but I really think you might have a self esteem problem.  You deserve way better treatment then what he was giving, and you endured for far too long.  It's easy to \"miss the forest for the trees\" when it comes to loving the wrong person.  I think you would benefit from counseling because you really ignored your self worth for way, way too long, and you need to identify how it happens and learn how to prevent it from happening.  ",
            "what a fucking prick, hope you find someone who deserves you",
            "[deleted]"
        ]
    }
]