[
    {
        "post_id": "4umydj",
        "author": "Ringdrama34",
        "title": "Me (26F) with my soon to be SILs (23/25F). One is causing drama over my engagement ring and now wants proof from my fiance about its worth. I'm worried about what family I'm marrying into with my fiance (27M)",
        "url": "https://www.reddit.com/r/relationships/comments/4umydj/me_26f_with_my_soon_to_be_sils_2325f_one_is/",
        "score": 2265,
        "num_comments": 346,
        "created_utc": 1469509166.0,
        "selftext": "I've been with my fiance Michael for almost four years now and it's been a great relationship so far. He proposed a month ago and we are both really excited to start our lives together. Hes truly wonderful. His family, well... :/\n\nMichael does not live in the same state as his family anymore and as a result I've only met his family a few times. He has said before that some of his family members can be weird and he was even hesitant for me to meet his siblings. \n\nHis siblings (both girls) are apparently really spoiled rotten individuals. Neither of the girls ever had to work while growing up and relied heavily on their parents money. Their parents treated them like royal princesses. Michael on the other hand was always expected to work from age 14 and go to school and achieve far more ( 4.0, be in  at least two clubs and two sports) than was expected of his sisters (who only were required to make Cs and do nothing more) Michael was rarely allowed to attend social events at school or go out on weekends. he did all chores and his parents treated him very different than his sisters. His sisters were incredibly mean to him as teenagers. Basically he was pushed around like a literal peasant until he had enough money to move out and was able to receive grants and scholarships to go to school. It was a lot of luck that played a part in his being able to attend undergrad and grad. If not for outside help, I believe his family would have left him to rot whilst giving the sisters everything they ever wanted. \n\nMichael is now an engineer while his sisters have basic minimum wage jobs (nothing wrong with that) however his sisters have done all they can to pester Michael about borrowing money, making him feel ashamed that he makes more money than they do, and even going as far as to claim that they deserve the money more than Michael does. They ask him monthly for money, which I just learned a year ago after Michael confessed to me in shame that he had been giving them money to help them through a rough patch for the past few months. \n\nApparently their mom and dad has refused to continue to support them to the large extent that they have been the past several years (maybe they finally got fed up, who knows) and now the sisters are looking to Michael. \n\nTina, Michaels eldest sister, is being really difficult lately. Apparently, she is bitter that Michael has not been giving her anymore money. And she is acting very strange about Michael's engagement. Apparently, Michael \"should he thinking about his family first\" before thinking of getting married and spending a bunch of money on a wedding and a wife. His sisters should be put first, apparently.  Now, supposedly she is pissed over my engagement ring. \n\nThis past weekend Michael and I went to visit the family and Tina and the whole family obviously learned about our recent engagement. I had never even met Michael's dad before because he travels so much for work. His mom seemed passive towards me and his dad kept asking me what my name was. It made me sad tbh. \n\nTina remarked on the large size of my engagement ring. Later in the day, she pulled Michael aside and told him that she was really suffering financially along with the rest of the family, and basically said. She was shocked Michael was forking over thousands of dollars for my engagement ring and the wedding rather than help out his own family. She said \"you've only known this chick for what, a few years? You're already giving her everything while you give your own family nothing.\" \n\nWell, Michael then informed her that my ring wasn't real diamond. It is moissanite, which I specifically wanted instead of a diamond. Michael could easily afford a diamond but we are saving our money and I liked the idea of moissanite. \n\nBut, Tina didn't believe that and expressed such. She stalked over to me in the kitchen and made a huge scene in front of everyone asking to see my ring, and examine it. She tried to play it off jokingly but I could see through it, and at one point she made a grab for my left hand. I refused to hand over my ring and Tina got emotional and the other sister, Hannah, soon butted in and asked what my problem was, Tina just wanted to look, what do I have to hide, etc. I just tried to calm the situation down as best I could and Michael kept telling them to mind their own business.\n\nHonestly, the whole thing was infuriating. We left after dinner to go stay in a hotel. Michael then told me how he thinks his sister is also jealous of me and my ring. Tina has  been engaged for over a year now with still no wedding planned, she was given a tiny ring. Albeit with a real diamond but it is very tiny. Mine, though fake, is big and sparkly and she remarked to him once that he had better not get me a prettier looking ring than she had. (Wtf?) Michael and I will be getting married fairly soon and she seems bitter that her own fiance has still not expressed a desire to start planning the wedding. She has also remarked in the past to Michael how I am too beautiful, and that my looks are somehow suspicious, and I'm just out to get his money. \n\nI make my own money as a nurse and I definitely am not using Michael for his money. \n\nNow, Tina has started creating all sorts of drama over this, posting on Facebook about how real men should know where their priorities lie, how real men stick by family and don't play with little girls who are gold diggers who only care about having a huge rock. One status said \"show me the paperwork and I might believe the ring isn't real lol\" and another one was some stupid quote about being distracted by shiny things that turn out to be coal in disguise. (Me I'm guessing lol) she commented \"lmao 😂😂😂\" on my instagram picture of my ring. I deleted the comment.\n\nI only know this about her Facebook statuses because Michael showed me through his account. Tina deleted me off of everything and even blocked me. She sent out a mass email to the whole family and announced that her and Hannah will not be attending my wedding nor supporting Michaels marriage to me and then listing all of the reasons. (I don't really love him. I'm a gold digger, Michael doesn't care about his family anymore) \nHowever at the end of the email she said she may consider believing Michael if she saw proof that my ring wasn't real.\n\nReddit, I'm at a complete loss as to what to do here. Michael is also shocked but not really because he is so used to his sisters' antics. He took my side and I appreciate that but when I talked to him about cutting his family off for good he seemed hesitant. I think he just doesn't wanna create more drama. But I need him to draw hard lines here.\n\nThe thing is, I don't want Tina and Hannah coming along every few months asking for money and judging us. I don't want my marriage to involve their pettiness and begging. I won't give any of my hard earned money to them, that's for sure. I don't want Michael to either but I guess I can't force him not to. I just worry because that could be money our future children need. Or money WE need. \n\nHow can I handle this situation? At this point I never wanna see the sisters again. \n\n   \n**tl;dr**: crazy soon to be SILs are creating drama over my engagement ring, and telling everyone I'm a gold digger. ",
        "permalink": "/r/relationships/comments/4umydj/me_26f_with_my_soon_to_be_sils_2325f_one_is/",
        "comments": [
            "> she sent out a mass email to the whole family and announced that her and Hannah will not be attending my wedding\n\nHallelujah, she's done the dirty work for you!\n\nYou need to have a good long talk with Michael, with a counsellor present if necessary. You guys need to ensure you're both on the same page in regards to what your obligations to your extended family are, and how you spend your money now and in the future. \n\nI think cutting his sisters out of your lives should absolutely be a no-brainer for both of you, but it sounds like Michael's still struggling to let go of his internalised belief (no doubt hammered into him since childhood) that Sisters Are God and Must Be Obeyed.  But both of you are a team - work with him to extract himself from his toxic family (as it flies in the face of everything he's been taught from day one), but be firm with your boundaries.\n\nBut seriously, do not invite the sisters to the wedding. Even when they *belevolently* change their minds and decree that they will come to the wedding, even when they suck up to you, even when they demand to know why they aren't your bridesmaids, even when they kick and scream at you for stealing their brother away. Being invited to your wedding is a priviledge, not a right, and their behaviour has put them very very firmly in the negative. ",
            "There is a gold digger here, but it isn't you.",
            "[deleted]",
            "My wife has an enormous engagement ring. (1.7 carats)\nEveryone believes it is a diamond. It's not, its a topaz. \nThe reason that I am not believed when I say that, is because topaz is normally blue and this is very clear. \nIt's pretty damn special to both of us, because her father cut the stone. \n\nNext thing, moissanite isn't fake. It is different to a diamond, and if you wanted it, it's special too. I'd rather a moissanite ring too. \n\nYour in laws are a lot like my wife's in laws. Materialistic, self absorbed, narcissistic assholes. You don't need them in your life. They have already made the decision to stay away from the wedding. Thank them for their thoughtfulness. \n\nI moved countries to escape my family, and now talk to them three or four times a year. \nNo regrets. ",
            "Umm you better decide what's going on with supporting his sisters before you get married.",
            "This is definitely going to be all up to him to set boundaries and draw lines. He needs to put his sisters in his place - he's not giving them an allowance, his relationship with you is not up for discussion, and how much he spent on your engagement ring is none of their business. \n\nYou two might benefit from pre-marital counseling to make sure you're both on the same page about key issues like helping family out with financial issues - it sounds like his sisters are used to running to him in an emergency and you both need to agree on how to handle future requests. When you bring it up with him I would phrase it as \"pre-marital counseling\" and not as \"therapy\" or something - you two both seem to be handling the situation well, but having an outside perspective to guide you through these discussions could be useful.",
            "Even if you cut them out completely, these women sound like the types to come back, and come back...and pretty much just be a sticky little stain forevermore.\n\nI think you need to tell him that you love him dearly, but that you simply don't think you can handle entwining your life with their's until you've both set hard lines. Like, really, what happens when you guys have kids? What if these women want to be involved then? Or what if their poor financial situation keeps you guys from being able to afford a necessity? ",
            "Wow. This situation reminds me a lot of my parents marriage and the way my dad's side of the family reacted after my dad got engaged with my mom. (FYI traditional Pakistani arranged marriage stuff between them).\n\nThe back story is that my dad had moved to America, got his Masters degree and continued to send money home to his family in Pakistan (mainly for his parents, but considering his younger, unmarried sisters still lived with his parents, the money was \"everyone's\"). Around this time my dad was 30 and had been sending money to his parents for almost a decade. He decided that he wanted to try and settle down and start a family. So his parents set him up with my mom, they liked each other, and went forward with the marriage. My dad's sisters weren't too happy. My dad getting married and starting a family meant that my dad would be sending less money to Pakistan to his parents and sisters. Dad was (rightfully) pissed because the money he sent was more for his elderly parents rather than his sisters who never ended up doing anything with their education.\n\nLong story short, they tried to sabotage my parents wedding. Really made my mom miserable during the whole ordeal. Long story, but not really worth detailing. My mom (god bless her), tried to forgive and help one of the sisters with her own wedding a few years later, but it really went to shit. My parents organized, paid for her wedding, and let her stay in their home for months, and all my aunt could focus on was \"me me me, why didn't you do X, Y, and Z (costly things) for my wedding?\"\n\nShe still doesn't talk to us. But has no problem asking my dad for money! \n\nI don't know if there will be any fixing your relationship with your future sister in laws. Just by looking at the way my family has been dealing with a similar situation for two and a half decades. Greedy, entitled people dont start to change their tune at this age. Not when they've had things handed to them their entire lives. They will probably always blame you for their brother ceasing to send them money. \n\nThe ONLY times I EVER saw my parents fight was when it involved my aunts. They've otherwise had a happy marriage. This will not be the last time you will deal with your fiancée's sisters, even if yoh decide to not pursue a relationship with them. Be prepared for that.",
            "I think you need to resolve the MUCH larger issue than the ring here.\n\nMichael is TERRIBLE at setting boundaries with his sisters. He enables their narcissism massively.  He needs INTENSE therapy, and realistically to go zero contact with them both.\n\nI think this therapy should be a precondition of marrying him.  He doesnt understand how awful this relationship is.  He is too used to being a pushover who people bully into things and that MUST change before you marry him.",
            "Frankly, them boycotting your wedding is the best wedding present they could possibly give you. \n\nI'll be blunt, you are **never** going to win with these women. They will never be your family, they will never like you, and they will never stop asking you for money. \n\nThe less contact you have with them the better to be honest. ",
            "> I talked to him about cutting his family off for good he seemed hesitant\n\nHis sisters are shit, and they deserve to be cut out from your lives. But there is a way to compromise between you and Michael. Instead of cutting all ties with them, you could temporarily cut contact. Like, he doesn't need to go visit them until they apologize. Or, if he's on the phone with one of them, if they start bitching about the ring, then he can hang up. And definitely not give them any more money.\n\nBasically, temporarily block them and tell them he won't talk to them until they apologize.",
            "W O W.\n\nUnless he decides to draw a hard line here, you are going to be married to a man who is supporting his sisters, who feel completely ok about abusing you.\n\nThis is not ok.\n\nI would honestly tell Michael that by not cutting them off, he is tacitly condoning their abuse of you. He actually does need to make a decision here. It's not fair to ask you to put up with that kind of abuse.\n\nBlock them on all social media, and seriously consider if you want to marry into this crazy, given that the only one who can set boundaries is him and he's not willing to do so.",
            "Whenever anyone wants \"proof\" of the value of your engagement ring, I believe that the proper response is: \"go fuck yourselves\".",
            "Michael's sisters are losers. Their enabler parents ironically didn't enable them to be productive adults but emotionally stunted leeches. The scapegoat won out in the end over the golden children. Or he will if he cuts these truly awful people out and focuses on his real family, the one you're building together. If he doesn't, I honestly don't see a healthy relationship surviving them.",
            "His sister isnt jealous of your ring.\n\nHis sister is threatened by you.  You are the one person right now that can cut off her cash cow.  She's probably spent years manipulating him and now you are about to unravel it all.\n\nMy first instinct is to let her know that she and her sister are uninvited due to her behavior.  No one gets to go to the wedding without supporting the couple, or at the very least acting civilized.\n\nMichael should probably go talk to a therapist at the very least.  Im not sure if he should cut off contact with his entire family, but his sisters should go VLC.  And he needs to stop giving them money.",
            "You need to have a serious talk with your fiance about giving money to his sisters, boundaries and the sort. Maybe you can agree that you are only going to help in the case of emergency, or that you are going to make a loan and not loan anymore till they pay it. \n\nThen you block them from your life, stop visiting them and let your fiance deal with them. They are his family and you don't have to suffer them, they have made very clear that they don't like you and they don't want to have a relationship with you, so don't.\n",
            "Who wants to bet that if OP gave into the SIL's ridiculous demands and provided proof for the rings, the SIL would start making snide remarks about OP not being \"good enough\" to \"deserve\" a diamond?\n\nJust ignore them, OP. They're bitter and unhappy with their lives so they tear other people down and stir up drama to make themselves feel better. They should only have your pity, not attention.",
            "There are a *lot* of good comments here, but there's something that comes to mind that hasn't been mentioned that I have experienced. \n\nA lot of people are saying go low contact or no contact with the family and this is good advice, but what hasn't been mentioned is that this will be extremely difficult for Michael to do. His entire life has been spent deferring to his family in nearly all things. And when he's around the family, he's very likely falling back into that pattern even though some part of him knows they are crazy. \n\nIt's going to feel very, very wrong for him to push back on the family about anything. It's going against who he's been his whole life. The \"not wanting to create drama\" is that manifesting. Drawing hard lines is going to be almost impossible right now in the beginning. It's not like flipping a switch. \n\nIt *is* possible for him to change his dynamic with his family, but it's going to take all of your support, a lot of introspection on his part, and very likely a fair amount of (yes, I'm going to say it) therapy. But he's got you on his side and that's a great start. Good luck. ",
            "What a bunch of jerks. What is your fiance saying to them? I agree with the \"no\" without other explanation that others suggest.\n\nOne thing to note though:\n\n>Neither of the girls ever had to work while growing up and relied heavily on their parents money. Their parents treated them like royal princesses. Michael on the other hand was always expected to work from age 14 and go to school and achieve far more ( 4.0, be in at least two clubs and two sports) than was expected of his sisters (who only were required to make Cs and do nothing more)\n\nThis is not actually a nice thing the parents did for the sisters, as you can see by the results. They raised your husband to be a useful adult and didn't bother to do the same with his sisters. Maybe it was spoiling, but I bet it was just lazy parenting or sexism.",
            "They're digging their own hole of embarassment.\n\nIf i were you, i would have screenshotted their comments on Facebook and said: \"Can you believe there are people out there who think getting engaged and married is a hobby that you can just quit to continue supporting 2 x mooching adults?\"\n\nThat said, you need to either get Michael on board with cutting the monthly gravy train or you need to keep separate finances and get a prenup before you marry.\n",
            "JESUS, his sisters sound fucking awful. What exactly is he gaining from his relationship with them? Maybe ask him. \"Family\" is the family you MAKE. If his sisters are so fucking awful, why the hell does he still give in to them. You need to set a HARD boundary, if he wants you in his life he needs to cut his damn sisters off and shut down ANY bad-mouthing you. He seems like he has NO spine against them. \n\n\nPlease get pre-marital counseling and I think he needs some individual counseling, he has a very, very unhealthy family dynamic. He needs to realize he does not OWE these people anything and he sure as hell does not need them in his life. ",
            "I think your fiance needs to make a choice.  Marry you and have no contact with his family, or bow out of the wedding and take up the role of breadwinner for his sisters.  He seems to have spent his life being the whipped puppy of the family so it is probably a hard call for him to make.",
            "This entire process sounds like a group of teenagers. Fuck his sisters. Bottom line. I wouldn't explain shit, prove shit, show shit, or give a damn about their childish behaviour. I wouldn't be friends on social media with them to be blocked by them. I wouldn't mention his sisters again. Wouldn't invite them to my wedding, much less care of they came; I would act as if these chics do not exist. Let them dig their own graves. He's not going to cut off his sisters, but it takes 2 to argue. Remain mum. He'll figure out on his own his sisters are worth nothing.",
            "> I won't give any of my hard earned money to them, that's for sure. I don't want Michael to either but I guess I can't force him not to. \n\nHe sure as hell shouldn't be doing this with YOUR (both of you) money!",
            "Sounds like he could use some Therapy too.",
            "All I can say is wow. When people accuse people of something like this it usually means they are the ones committing the act. She's accusing you of being a gold digger while in all actuality it's her and her sister. The whole family seems corrupt. And honestly, I think your fiancé needs to take a stand for himself against his family and the way they are treating the both of you. It is his parents fault for the way they were raised and his sisters fault for being complete assholes as to why turned out the way they are now and why can't be dealt with now. They're toxic and I feel like they will hurt your relationship. Michael really needs to tell his family how he feels personally. And if they're manipulative and rude about his feelings and try to minimize them in order to keep getting what they want then sadly maybe Michael needs to cut them out of his life? All I can say is if my family acted like this towards me and my significant other I would not tolerate it, they would be out of my life, family or not. It only makes them worse by the fact that they are using the word \"family\" as a tool to manipulate him showing that they don't really care. Also, why would you want to invite that kind of drama and immaturity into your lives? Posting on Facebook really? Obviously they are ignorant people who have been spoiled and only strived to pass in life and not truly succeed. They need to get out there and work for themselves. ",
            "I think its up to your fiance to deal with them. If it were me, I'd tell them how it is, send them a letter or text (so they cant interrupt) detailing how he worked damn hard to earn a decent salary and put himself through college, while they lived off handouts off their parents and have never worked for anything in their lives before. Their parents gave them everything and him nothing, so why should he continue to enable them. They are not entitled to his money. They need to grow up and realise that they are not princesses any  more. They are adults that have to support themselves. It is important that everything that happens comes from your fiance however, and not you.\n  \n\n  \nPetty, non-serious part I'd do because I'm especially petty: if they wish to be treated like children, they can be. If they continue with this line of entitlement, he can start talking to them like they literally are children, talking to them in a baby voice. Buying them children's toys for their birthdays or offering to take them for ice cream. Anything you can think of that will demean them. \n  \nIt is important that whatever action you two decide to take, it is enforced by your fiance because anything done by you will demonize you to them. If they cannot learn to be civilised, you will eventually have to cut them out.",
            ">She sent out a mass email to the whole family and announced that her and Hannah will not be attending my wedding\n\nSounds like a good thing, honestly. Hire security to make sure these two spoiled princesses *don't* show up and cause a scene.\n\nBecause otherwise, they will. Their gravy train is coming to an end, and they'll do pretty much anything to keep it moving.",
            "He doesn't need to cut them off NC. He just needs to say NO and stick to it whenever money is requested. As far as judging you, anybody can see that is high-school petty stuff, just ignore it. You start reacting to it, that is just what they want.",
            "Therapy. He needs therapy. ",
            "/r/justnomil welcomes you! ",
            "I think people are missing the point here.  You have just seen the beginning of the view over this massive mountain of shit.  Marrying into this before it's fixed is a mistake.  Don't get involved.  Answering emails...or even taking them, much less phone calls or online maneuverings, is just asking for more and feeding into the hysteria.  This is a black and white situation.  He cuts them off.  His parents get one chance.  The rest of the family already knows these girls are ridiculous.  Whatever they do is ON THEM.  You step away. Plan your wedding, sure, but your fiance has to see the light.  If that means going to a counselor, then do so, but BEFORE the wedding.  \n\nQuit listening to any of it.  Step aside.  Get off social media.  Fiance...he's got to do the same.  He HAS to chose you.  Make some strict lines and stick to them.  Otherwise, run.  Run far, far away.",
            "Not going to lie but your life sounds like Cinderella. You're Cinderella and your future sister in laws, the evil step sisters. \nHonestly, it sounds like your fiancé has a soft side and will never give up on his family even if they treated him badly over the years. It's the only family he knows. So it's up to you to either deal with it because you love him so much or reconsider what you will be marrying into. Best of luck!",
            "Okay, that is what I would do:\nSit down with Michael and point out how his family treated him unbelievably cruel and that they deserve nothing from him. Then tell him you are not getting married before this isn't  resolved, and you will need him to go to therapy individually and together with you. \nRead some post about such family members on here. You willist grow a lot of resentment if Michael doesn't draw a LOT of hard boundaries now. I would tell him that he needs to tell them that he will give no one of them any money anymore, and then stand by what he says, because I couldn't be with someone who gives horrible people money instead of investing it into our future. It is different, IMO, if his family were nice and something unforeseeable happend (car crash, etc...) But his family is rotten and their situation is their own fault.",
            "There's a wide range of options between giving in and participating in the drama and actually cutting them off completely. Talk to him to find out something that will work for both of you, and involving a third party will help. With my husband's family, we set boundaries, left events early, limited contact, etc. It can be tough but does work. Cutting contact should be the nuclear option. ",
            "I'm gonna be honest, I got about 1/4th of the way through this post before I said fuck it, these sisters need to be kicked the fuck out of your lives. Fuck them and their \"family first\" bullshit. Where was that when Michael was being treated like shit while growing up? Nowhere because it's all a ploy for purely their own gain and that needs to be shoved right bag in their smug ridiculous faces. I have two things I'd do: one is cut contact, say nothing to them, block them, refuse to allow them into your lives. Tell his parents if necessary that you no longer want to see them for the way they treat him and you and that there will be no discussion about it.\n\nOr two: tell them to fuck right off, shove all their bullshit right back in their faces and explain why they're such horrible human beings that they deserve absolutely nothing and even less. That they will never get another penny out of you guys because their conceded little guilt trips are insane and it's so easy to see through their bullshit. Then cut of them out of your lives.\n\nI like the second idea cuz I'm a little vengeful this morning, plus these girls sound like they need a slap across the face. With a chair.",
            "He moved to another state because he knows who they are and wanted to get away from them. I think the best option is to leave things how they are. You rarely see them, he's on your side and defending you. Concentrate on your wedding and your relationship with this man, don't worry about his family. As far as him giving them money, you can voice your opinion and tell him you're not sharing your money with anyone but him and expect the same. Explain your concerns like with raising a family and so on. I'm sure he will be understanding and stop, but if he doesn't it's his money. ",
            "I don't care if you're Princess Diana. The announcement of a wedding, ANY wedding seems to bring out the drama queen in *somebody*, somewhere. In your case, it's your insane SILs to be. They'd LOVE it if their drama split you up, so don't do that. Of course, they get no invite to the wedding, no \"proof\" about the ring's worth, not one more ounce of attention from you. If your guy insists on paying them attention, that's HIS problem, but you are DONE with these asshats. Keep your dignity and do NOT get down in the mud with them. Also, imagine what the poor other relatives are thinking of how stupid these girls are. Don't get run over by these girls. *Shun* them, like the Amish do. It really is the best way to deal with troubled individuals.",
            "He has to cut them off. Not just for you but for him. Why would he support his abusers? Michael should cut the funds and use it for therapy. The relationship with his sisters is unhealthy. If you two have kids, his passive nature might become a source of frustration. I would highly recommend he cut ties with his sisters indefinitely. People like that never change. ",
            "That boy has been beaten into submission by his family... he is so afraid of \"creating more drama\" that he won't even stand up for himself, let alone you. This does not bode well for you two.",
            "> I don't want Michael to either but I guess I can't force him not to. \n\nWell no, you can't but in a marriage you can and should jointly discuss how finances are to be spent. If you can't agree on cutting off the sisters from any and all financial assistance, you should seriously reconsider this marriage. You are right, worrying about your lives and future is more important than the dredge of society these sisters represent. \n\nYou are 1,000% right that fiance needs to draw hard-lines and shut these two gold-diggers down or out for good. And really, any of his family that \"takes their side\" should be treated likewise and avoided or cut out completely. There is NO positive to come out of the lackadaisical, doormat attitude that your fiance is taking. If he can't do it on his own, he needs counseling to help him recognize what toxic beings these people are. They will make your life miserable. If he wants to avoid \"drama\" he needs to avoid them.\n\nI get that the sister blocked you, but you should also be blocking her so she doesn't control when she can \"unblock and harass.\"",
            "I think you and Michael should see a marriage counselor. You definitely need to be on the same page financially before getting married. And he ought to be taking \"Disrespecting my future wife is disrespecting me, and I will not tolerate it\" stance with his family rather than the path of least drama for himself. The things Tina has said about you are far more than enough grounds for Michael to go completely no contact with her. Tina is actively trying to break up your engagement, for Christ's sake. Maybe it would be good for Michael to see a therapist individually so he can hear from an independent party that his sister's behavior is worse than a street heckler and so he can work on what happen during his childhood and his guilt about helping them.",
            "HOW in teh fuck do people act this way and sleep soundly at night?! Michael needs to grow a backbone and go no contact because his entire family seems like a bunch of fucking assholes. ",
            "Do not get married to this man if you haven't discussed how to handle his family and your shared finances in the future. I recommend some counselling that directly addresses this before you tie the knot.",
            ">How can I handle this situation? At this point I never wanna see the sisters again.\n\nYou should not see them ever again. No invitation to your wedding, no visits, no social media interactions. Your life is going to be so much better without them.\n\n\nHowever, your fiance need to understand that he should not support them financially. They are responsible for their financial situation, not Michael. Once you get married, there will be no \"his\" money, so all significant financial decisions should be agreed by both of you. I doubt you would agree to send any money to his sisters. You need to discuss it now and, probably, have a therapist to help.",
            "Tell your fiance he needs to cut off contact with his family until they all deliver written, public apologies. The whole thing is atrocious and reads like something out of /r/raisedbynarcissists.",
            "do not give her the proof of your ring cost.  WTF\n\nwhat a stupid woman.\ngood thing she already uninvited herself from your wedding.\n\nGood.\n\n",
            "Michael,\nYour sisters are spoiled little girls who will never grow up. They are gold diggers. They have their own lives and families, as you will when you marry. You will then have your own family to look first. You do not need people like them in your life.\n",
            "Jesus H. Christ. Your man needs to shape up and tell these harpies to shut the fuck up and grow up.\n\nAs for his parents, that kind of disrespect is not something I would accept. I mean, if my own mother didn't treat my loved one with respect, I would most certainly ask her for a decent reason and failing that, scold her. It's never been a problem here, and frankly they're all being little children. \n\nSo in conclusion: Your Michael needs to tell his sisters to get their shit together and stay the fuck away, until they've learned to treat both you and him with respect. The bank is closed. Furthermore, he needs to talk to his parents and tell them that they either show you some decency or they won't see much of you, him or their future grandchildren. Harsh? Perhaps. Necessary? It would seem so.",
            "Honestly, they sound like horrible fucking people and you are better off without them at their wedding. \n\n> some stupid quote about being distracted by shiny things that turn out to be coal in disguise.\n\nAre they actually stupid?\n\nJust keep supporting your fiance, nothing else really. Hopefully he will create boundaries and with you supporting him it will hopefully be easier for him. ",
            "Good thing is when you get married you create your own family, and you will be his family.  \n\nSo in my marriage, my family-of-origin are the shitty ones. My parents are religious fundamentalists and refused to even meet my husband until a year after we got married because he is not part of their religion. Then when we had a kid they suddenly got over themselves and acted like not an asshole and wanted to hang out all the time.  But guess what?  We still live 12 hours away so I only have to see them once a year, and I make sure it's a short visit. \n\nYour sister in laws are young.  There is a chance they will grow out of this. There is a chance they won't.  Your fiance needs to tell them to cut that shit out.   Or heck- you are engaged, you can tell them to cut that shit out, I think that is totally appropriate (but clear it with your fiance first).  \n\nETA: Just saw the part where they said they are not coming to your wedding. Perfect! It's like when my mom disowned me when I moved in with my husband and got engaged.  Saved me from having to talk to her for 3 years! ",
            "Issue is with his sister she'll damn you if its too big or too small. \n\nIf he was giving them money, they are now worried you'd stop him from doing that. So the claws are out. they are the gold diggers really and you can try your best to remember that when they fling crap. \n\nYour partner has been walking on eggshells his entire life, grown up with this abuse. He's likely said yes to avoid whatever conflict they throw at him. He has a right to say no. And it's not his fault if they get mad. It's a hard cycle to break, get therapy or domestic abuse support for him. He must be very strong to survive childhood and find himself work and life to escape it bit by bit. \n\nThis might sound familiar (from mens advice line, a domestic abuse site for male victims)\n\n>What is domestic violence?\n\n>Domestic violence includes a range of behaviours: physical, psychological, sexual or financial abuse. It happens within intimate relationships as well as between family members. It forms a pattern of bullying and controlling behaviours. It is rarely a one-off event and it tends to get worse over time. Abusers can be very manipulative in the way they use their power and control over you and may blame you and other factors for their abusive behaviours.\n\n>How do you know you are abused by your partner?\n\n>If you are forced to change the way you behave because you are frightened of your partner's reaction, it is likely you are  being abused. If you feel afraid, walking on eggshells, intimidated by your partner, it is likely you are being abused. If there is conflict in your relationship and your partner hurts you (physically, emotionally etc) it is likely you are being abused.",
            "You need to talk to Michael.  His sisters are toxic to your relationship.  He needs to cut them off and block them.  They are not treating Michael with love and their behavior is not based on concern for Michael but out of greed and jealousy.\n\nIf Michael can't set up and enforce the necessary boundaries with his family, postpone the wedding.\n\nAlso, therapy would be a good idea for him.",
            "Your fiance sounds like a modern day male Cinderella",
            "They are his family and unless he cuts them off they will always be family.  No matter how bad they treat him he still loves them.  It sucks but that is life.  It sounds like he has already made you his priority and that is the way it is suppose to be.  I would not expect him to cut off contact just because the crazies are starting a pissing contact with you.  They will either burn themselves out and get over it or your future husband will cut them off.   His family is just static,  I would not worry about them because they really don’t matter in the scope of your life with your future husband,  Think on the bright side. At least you don’t have to pay for 4 plates at the wedding.",
            "this won't be a problem as long as Michael has good boundaries with his family.",
            "1. Your ring is not fake, it's a beautiful sparkly stone and that's what you wanted and asked for.  There is not a goddamn thing wrong with getting a stone that is not a diamond. \n\n2. It sounds like you're going to save some money by not inviting them to the wedding, so that's nice. ",
            "I'd have a word with your FH and say that if he really wants his sisters to come to the wedding, which sounds like a bad idea to me, then they have got to make sure they don't say anything. I had a friend who was in a similar situation, although not quite as bad, and his sister mentioned that his fiance wasn't as good looking as her (the sister looks like a dogs arse btw and the fiance looked amazing) and it took quite a few hours and my mate telling his sister to go home, in front of everyone, for the fiance to calm down\n\nSmall things can ruin a wedding, even if you think you can handle them. Best to try and avoid them. Maybe try and get your FH to speak to the parents first. ",
            "1) Do not respond IN ANY WAY. Don't show her proof that the ring is moissanite. She's not actually worried about that, she just wants drama so that she can try to emotionally manipulate your fiancé into \"taking care of her.\"\n\n2) Go no or low contact with her -- both of you. She and Hannah don't want to come to the wedding? Great. Consider that their decline of the invite and plan for them not to come. Don't engage with her by talking to her, block her on your phone/email/social media (and the other sister too).\n\n3) Michael should see a therapist. This sub sees golden child/scapegoat dynamics all the time, and they can leave a really lasting impression on the scapegoat child. I'm sure he's dealt with it in his own way, and he sounds like a wonderful person, but it might be helpful for him to navigate this stressful time by going to a therapist to work through his familial issues. Ultimately, Michael has to cut the cord with his sisters. Even his parents have cut them off; he has to as well, or else risk them leeching for the rest of his life.",
            "Usually it is better to take the high road. But there are other times that you need to sling mud right back. Make your own status or email. Point out the irony of the situation. Like the fact that you're a nurse and could do just fine all on your own. But that you love your fiance and would prefer to not be on your own. And the fact that they are the ones always asking for loans...especially after the treatment of their brother for years and years. And then last but not least...the fact that your engagement ring is none of anybodys business. It could be made from a 1 of a kind space diamond or regular diamond or cubic zirconia and if they didn't have anything to do with paying for it then its not their problem to worry about it. Like I said...In 99% of situations its better to just play nice and ignore the bullshit. But it sounds like they are nasty nasty girls and it sounds like your fiance doesn't have much of a backbone where his family is concerned. So if you want lined drawn you're gonna have to draw them yourself. And once he sees that you aren't gonna take their shit...maybe he will follow your lead. Chances are that they are drama queens and they will see it as invitation for drama..but after you say what needs to be said then you can ignore them and it'll piss them off that much worse",
            "> He took my side and I appreciate that but when I talked to him about cutting his family off for good he seemed hesitant. I think he just doesn't wanna create more drama. \n\nYeah, clearly the way to avoid drama is to keep these people in your lives. Maybe invite them to move in with you.",
            "He needs to set boundaries with his family. They are the crazy ones, but he's enabling their behavior. Let him know that he needs to set boundaries with them before the wedding. No more giving any of them any money at all, no more letting them harass him or you. And don't worry about what they say on social media. They are just making themselves look like idiots and anyone who agrees with them is also an idiot. In fact, it's a good way to sort out the chaff. ",
            "Suggest Tina read The Ant and the Grasshopper.",
            "After that bullshit, I'd be tempted to exchange the ring for a nice $25,000 large, flawless diamond. ",
            "It would be a great idea to sit down and talk about hypotheticals and boundaries.  (Marriage counseling would be a big help- maybe you guys are amazing together but families can drive a wedge and a professional can help you find direction in dealing with this in the healthiest manner)\n\nFirstly, if your SO doesn't want to completely cut his family out I suggest you support him in that decision not to.  However in return he must respect certain guidelines that are important to you.  Tit for tat, compromise, and all that.\n\nHis sisters absolutely have zero business knowing any details about your ring.  Zero.  Do not cave or give in on this.  They are asserting themselves and if they find they can cross this boundary it will encourage them to cross more.  \n\nIt is absolutely on him to *not* give in and tell them behind your back as well.  You want to marry him, not his sisters.  If he's not willing to cut them out of his life he's is expected to tell them No when they try to cut into yours. \n\nI'd highly recommend you both not borrow them anymore money as they obviously feel entitled to it instead of being appreciative, they have zero business knowing or benefiting from your earnings, and it will enable them to further ask for more and more and more.\n\nMoney and finance talk should be strictly prohibited with the both of them and you can discuss and agree apon a generous but not outlandish dollar allowance for birthday and Christmas gifts to them.\n\nIt is important that your husband know you are on his side but that these sort of topics are important because his sisters are decidedly not on your side.  That you are not attacking him or making him choose but making sure the both of you are not steamrolled.  You didn't sign up for this so you want to adapt to make sure you both are on the same page.\n\nBoundaries and respect is something that should be expected *more so* from family, not less.  The word family is not an excuse to take advantage of and disrespect each other.  They don't give a shit about what family really means, only that they benefit from it.  He'd never do this to them.  You'd never do this to them and so you both are undeserving of having it done to you.\n\nGiving in, placating, giving them what they want to shut them up seems easier but it is absolutely a surefire way of putting a giant wedge into your relationship and happiness.  Make absolutely sure both of you are able to say No as a complete sentence or you're in for a not so fun ride.  If you don't believe me go check out r/JustNoFamily and r/JustNoMil.  Family can ruin relationships and they shouldn't get a free pass to do so because of filial ties.\n\nInvite your fiance to read some of these comments together if you haven't already.  It will allow him to understand you aren't out to attack him (coming under scrutiny by a spouse can result in the other getting defensive and that doesn't help the situation).  It's important that you both work as a team and not against each other.\n\nMuch luck to you and congrats on your engagement!",
            "Just ignore them and don't talk to them. Them posting on facebook has no effect on you. Repeat that 3 times out loud. Them posting on facebook has no effect on you. Michael has boundaries to maintain, you have to learn to say \"fuck off\".",
            "I am so angry at the selfishness of his sisters. Good god, where are the normal people who celebrate normally in a happy way when their family members get married. \n\nThis is not okay, she is harrassing you, and honestly, I do not know how you kept it together. What a poisonous woman. \n\nI dont know what to suggest, other than NC. But that can be seriously difficult with a partner's family rather then your own. I wish you luck OP, this is utter bullshit, and I hope you get through it with your fiance. ",
            "The cost of your ring is no one's business but you and your fiance.\n\nYour finances are private. Your sex life is private. Decisions you make together regarding your married life - are private.\n\nSimply say - we don't discuss those sorts of things outside of our relationship. Change the subject and move on.\n\nIf they insist - you give them the stink eye, say nothing, and walk away.\n\nSeriously.\n\nRude people must be handled in such a way that they know never to cross that line again with you.\n\nThese people are ludicrously brain-dead, rude.\n\nYou take care and I wish you well.\n\n*Nana internet hug*",
            "Everyone here has good advice, just emphasizing the \"you don't have to show her shit\" perspective.  It will make Tina feel better about herself that SHE has a DIAMOND and will do nothing at all to improve your relationship.  My engagement ring isn't diamond, either, for ecological/human rights reasons as well as economic.  But you know what? That isn't anyone's business and Tina is rude as hell. Don't show her anything.  Get on the same page as your fiance inre: financial support to family.  He needs a couselor, STAT.  If nobody's recommended it, also check out r/justnofamily.  Keep being the classier person.",
            "What the hell is wrong with your FSILs?!\n\nThis is the part where my jaw literally opened because I was so shocked. I had to read this back to make sure someone actually said that. \n\n>Apparently, Michael \"should he thinking about his family first\" before thinking of getting married and spending a bunch of money on a wedding and a wife. His sisters should be put first, apparently.\n\nUm, hello???? You ARE his family now! I don't understand this mentality at all. I was raised to believe that when young people reach a certain age, they marry and become each other's family and priority. Parents, siblings, and other relatives are \"extended family.\" It's certainly not that you love them less, but I've always felt that when you're an established adult, you look to find a life partner and they become your priority. What Michael's sister is saying is absolute garbage. She and her sister sound like horribly spoiled woman-babies and it is obvious they are jealous of how successful and hardworking you and Michael are. \n\nBut, like, why is the engagement ring such a big deal? This is what I don't understand. She can't marry her brother. \n\nYou are well within your right to tell Michael that you aren't okay with him giving his sisters money. Ask him if they would do the same for him. Michael needs to be the one to stand up for himself and tell his sisters they need to back off, leave you alone, and make their own damn money.\n\nHonestly, I can't believe this is happening. I'm so sorry.",
            "She sounds like a real piece of work. I'm impressed she has a fiance. I bet that'll be a fun marriage. ",
            "Sounds to me like all he really needs to do is not show them any proof regarding the ring, continue with plans to marry you, and let them cut themselves out of his life. As long as he stops giving in to their manipulative shit, they'll go away. Sucks to lose family, but honestly: good riddance.",
            "She's projecting her own shit and insecurities onto you. This has very little to do with you, and a lot to do with her low self esteem. Just try and keep that in mind and know to not take her antics personally and to simply just be the bigger person and ignore it. ",
            "Judging by their childhood, it seems the parents have put into their childrens' minds that men are for earning while women reap the benefits. That's why education was never emphasised for the sisters, and they think it's fine to have lower earning jobs and never aspired to anything more - and why they think it's their right to leech off Michael now. Incidently, it's also why they are projecting this on to you, as though you're a gold digger.",
            "He doesn't need to cut anyone off formally, he just needs to not engage as it will fuel their weirdness and obsession. Plus they will never be satisfied. They weren't satisfied with you having a fake ring even though its realness or fakeness should never have been anything they have any business in in the first place.nIf your ring had been real, that would still be none of their business!\n\nDon't send them wedding invites. Don't engage them. Ignore them. Never lend them money either. Ever. It would make things worse and they have NO business in you or Michael's fiances. ",
            "Michael is a grown man who can buy whatever he damn well pleases. If she wants the kind of money Michael makes, she should go out there and make it herself. It's funny she talks about you being a gold-digger, when it seems like her only interest lies in her brother's money.\n\nIt's one thing to help a family member out because they need it, because you care deeply about them, because YOU honestly feel it's the right thing to do. Being family does not *require* that you share your money openly and freely.\n\nIt will be hard for him to cut out his family, if that's what you guys decide to do. At the very least, he needs to address their disrespect towards you and have your back on this. Not just \"be on your side\", but have your back in the way that he'll step up and let them know he does not appreciate their comments and that they won't be speaking to him anymore if that's how they're going to be about it.\n\nAs long as he's willing to have your back, offer your support freely. Even if family is wrong sometimes, it's family. It can be difficult to speak up and say something, or to cut out someone you love because they won't stop overstepping boundaries. He'll need your support in that so that he can continue to stand up for you.",
            "I am sadly familiar with this family dynamic.\n\nPeople like Michael live in fear. They fear being alone even more than they fear the next blow from their abusers. They grow up walking on eggshells to prevent that next blow from coming, but it always does. At least they're not alone, though.\n\nMichael's sisters know this about him. As Michael becomes stronger, his bullies become weaker. If he has a support system (you) he is more likely to say \"no\" to them. Now, the sisters' attempts to drive you away have gone a bit far, creating a situation where he must choose between you and his sisters. And he *must* choose, because no self-respecting woman would settle for a man who lets his family treat her like garbage. No self-respecting woman would sign up to have her funds--her shared, marital funds--bled away by these leeches.\n\nHowever, it seems like your bond is not yet secure enough, and Michael is not grown enough, to make this choice yet. He can't throw away a sure thing (his sisters,) for a gamble (you.) They are his blood, they will always be happy to pick up their whips as long as he's happy to be their whipping boy.\n\nI think you need to make this a long engagement. Prod Michael to grow in the ways he needs to. Give him, and read with him, literature about narcissistic households, scapegoats and golden children. Refer him to /r/raisedby and have him share there. Until he has outgrown his fear and his role as the scapegoat, he is not husband material. \n\n",
            "Ask him to take an objective look at his life. He wants to avoid drama because he has been conditioned to. What he probably doesn't realize is with people like this, you get the drama regardless. There is only one way to avoid it and that is to not engage. People that behave this way do so for attention, drama is attention and they must have it. They mind fuck you into thinking if you placate them you avoid drama but the drama is always there regardless. Eventually he will realize this, I just hope he does before he loses everything important in his life, including you. ",
            "I would tell Michael that giving his sisters a single red cent is a dealbreaker for marriage. 100%. They get nothing if he wants to marry you. Then honestly I'd want to have a joint bank account to make sure he didn't. Might sound controlling, but he has every right to say \"no\" and find another wife.\n\nDo you really want to find out in a few years that he's been giving thousands of dollars that should be spent/saved on your children and family on these heinous women who harassed and disrespected you over your engagement?\n\nYou need to draw a HARD boundary against this behavior and if he won't comply with full transparency I would reconsider the marriage. The way they treated you... That would be a 1 way ticket to *never being in my presence again.* I would never forgive or forget that shit.",
            "You're right, he needs to draw that hard line or you shouldn't marry him.  That's it.  That's the only acceptable solution.",
            "You have a man problem. He needs to step up and tell them off. You ARE his family now and they need to recognize. They can come back when they're behaving again, like children in time out.",
            "Michael sounds like a really top notch guy. Don't make him disown his family. He seems to be the only sane one in it. They need him. So they are annoying and infuriating. What family doesn't have someone with those \"qualities\"? As horrible as they are, his upbringing made him the seemingly wonderful man he is today. \n\nI would definitely take the advice of another commenter about making decisions about how much/often money will be distributed. It's his money, and he doesn't seem like a dummy. He loves his family--warts and all. \n\nI agree that the evil sisters need to cool their jets and stop laying guilt trips on Cinderfella, but you (or Michael) can't control what they do. Their threats not to attend the wedding (which may be a blessing) are unnecessary pleas for attention.  Maybe Michael should turn the tables on them and tell them that they have stopped caring about their family. \n\nMom and Dad totally created these monsters, but they're grown and should know better. \n\nAs for worrying about their presence in your marriage: like you said, they live in a different state and have only met them a few times. You'll maybe see them once a year. \n\nHere's my advice:\n\n1. Ask Michael to stop showing you the FB posts. That's doing nothing but sowing bad seeds. They're HIS sisters. He has the history and the patience to put up with their antics. You don't. If he wants to keep the peace, he should stop telling about their idiotic rhetoric. \n\n2. Don't make him cut out his family. This will very likely cause resentment. An ultimatum is never a good way to start a marriage. \n\n3. Don't be bothered by his stupid sisters. They are petty and mean, but if your relationship with Michael is strong enough to decide on marriage, then they are not a threat. \n\nCongratulations on your engagement. Best wishes for all the blessings of a joyful marriage! ",
            "Michael has to be the one to set the boundaries here. No more giving money, no more supporting his sisters. Remain friends on social media to keep the peace if you like, but block them from seeing anything on either of your Facebooks. Set it so you have to pre-approve everything that's posted to your page. Do not engage them, low contact and remove yourselves from any situation or conversation that devolves into gold-digger taunts or requests for money. You both need to extremely consistent. It's sort of like training a set dogs. ",
            "After a lifetime of this, it's going to be hard for him to start making boundaries with his family. But it's about practice and if he wants to keep you, he has to do it. If, at the end after you have both tried to compromise and work on this, and he still can't establish and maintain hard boundaries with his family (could result in NC no contact), you need to run. Marriage is never about marrying the one person; you also marry the family. ",
            "People like her ruin lives.   My dad's side of the family and my mom's sister.   They're all about money.   I grew up with fights between my parents because of them.   After 20 years, they finally cut off the shit people.   It was hard for them because the family they come from was more important than each other for the longest time. \n\nWhen you're married, your spouse and kids are more important than anyone else. ",
            "First off, I hope you and Michael have a happy life together. Secondly as we say here in Brooklyn when it comes to the two SIL's...fuck em. What a couple of rotten women. If they want to be that mean and drive themselves out of his life, than that is their choice. Let them. Don't invite them to the wedding at all. Make it known to the rest of the family that they aren't welcome. Also tell Michael, no more helping Tina with money.\n\nHe ultimately needs to stand up to them and put his foot down and put them in their place. But yeah, the hell with the both of them.",
            "Is your fiancées family very religious, or are his parents from a country where women are expected to marry as soon as possible in order to become a SAHW?  That's what this sounds like to me.  The parents aren't supporting the daughters because they didn't get married when they were expected to, like right after they graduated.",
            "His sisters are losers who are digging their own grave. They continually bite the hands that feed them, and now they're living the consequences. \n\n\"Maybe if I shit talk my brother and his fiancee on Facebook, that'll make him give me half his salary!\"",
            "This is a really horrible situation but I don't think you should be putting pressure on him to cut his family out for good - he might end up resenting you for that later on. Family relationships comes with years of emotional baggage, he might not want to do something it might be hard to come back from. \n\nHe's on your side, he's got your back and that's good enough for now. \n\nEven though the sisters have said they won't be coming to the wedding make sure your and your fiancé are on the same page that if they change their minds they are uninvited away. \n\nI agree with other commenters, it would be good to get some pre-marital counselling and also to have a proper discussion about how much support he has been giving his sisters and how much he might expect to give in the future. You may have to accept that he will in the future help his sisters again BUT you can at least have a say in how much help is appropriate - especially in light of the recent events. \n\nI really wouldn't push him to completely cut them out though - that has to be fully his decision.",
            "If it wasn't this it would be something else. The sisters can eat a bag of dicks.\n\nIt sounds like you and SO are on the same page. Enjoy your life together and don't waste any more time/thought/effort on them.",
            "Your husband grew up enabling them, so he thinks its normal. But its time to put a stop to it. They have been beyond disrespectful and petty, all because you're \"taking\" their walking wallet away from them. Maybe show him this thread to see how fucked up he's being. And its not him thats starting drama if he decides to cut him off, if they decide to throw a hissy fit, thats on them, not him. And besides, he hasn't even left yet and they're throwing hissy fits, whats the harm in leaving when they're already doing what they would have done? No need to feel guilty for your sister's actions, Michael. ",
            "Family can be bad but you're not marrying that family. Idk your family status but you two are starting a new family and they probably shoudnt be part of it anyway. Looks like you avoided two more idiots at a public gathering because they would have sabotaged everything out of spite. Keep them away. \n",
            "I have a big family,  everyone is always in your business. My family is also very poor; so, when I moved out of new jersey to texas, started doing well, got divorced from my first husband and eventually met my current husband who made more money and over all was more mature, they accused me of being a gold digger, and would often tell me I forgot where I came from ect...I cut everyone but my mother and youngest sister off. I don't talk to, visit, send money to or interact with my middle sister, my aunts, uncles or cousins. I learned that sometimes family isn't always blood, and my husband has taught me (cause he stopped talking to his family too) that husband and wife ARE the only family you need to worry about,  and eventually the children. It was hard to stop contact,  and it took me a few tries, but it's been a few years and my life couldn't be more peaceful. Good luck with everything and remember to stand strong and United! ",
            "Go no contact or low contact. They will keep on abusing your Husband until they get the money they think they deserve.",
            "You don't have to do a single thing. It's crystal clear, likely to everyone, that your future SIL is the gold digger. She was spoiled as a child, never held accountable for her own actions, given everything on a silver platter, and now expects her brother to take care of her the way he would a WIFE. Your ring, it's cost, the stone, your wedding plans, your or your fiance's financial status - none of that is her business. Be grateful she cut you off in social media and think of all the drama you'll save by not having either of these ingrates at your wedding.",
            "Find a way to make sure you have a united front. Apart from that, enjoy your lives together and to the extent you can, stay away from his family.  Whatever happens, don't let this ruin your relationship. It sounds like you both are good people and well suited for each other. All the best to you both. ",
            "If this is true what the hell is wrong with his parents? You basically set your children up for failure by teaching them to shun a work ethic and that they will be handed what they need, and then cut them off once you've successfully done that? Why would they do that? This sounds like a really gross family dynamic. Please tell me there aren't any racial dynamics at play (ie you are a different race than Michael and his sisters) because that would color the entire situation slightly differently.\n\nBefore you get married, you legitimately need to hammer out, IN WRITING, how much of your shared income (once you are married it is no longer simply his money, it is your HOUSEHOLD's money and YOU are his family now) exactly how much of his money is free to leave the household for nefarious purposes. (A grown man supporting his grown sisters is a nefarious purpose.) Do not think you'll be able to wing it or take it as it comes. You both need to be clear on what the boundaries are - yes, it will benefit him to make sure his stance regarding the extent he's going to be inserted into his sisters' lives is important to get on the record too.",
            "'Michael. Meeting your family was an eye opener for me. I don't want them coming to our wedding or being  a part of our lives. You are enabling their terrible behaviour by still giving them money every month and the first time I have met them, they treated me terribly. Anyone who makes fun of me, blocks me on social media and harasses people I love are not welcome in  my life. You need to decide if you want to marry me, because I will not be okay with you sending any money to them, and I will never let any potential children meet them. I love you, but your family is toxic and I won't be dealing with them ever again. Please let me know if this is something we will have, or I don't think we should be getting married. '\n\n\nAnd then fucking stick to it. ",
            "His sisters definitely deserve to be cut off, no question. The way they've treated him his entire life and the way they're treating you now... unacceptable.  As far as his parents, they've created this situation. He feels guilty and that's why he's having a hard time with the idea of cutting them off. He's been trained to never feel good enough. But how would he feel if they start treating your future children that way? Will they treat your son like he has to work twice as hard and is never quite good enough and then treat your daughter like she's a princess and never has to lift a finger? Would he put a stop to that? He definitely needs some therapy to deal with what his parents did to him and you both need therapy to deal with your future and whether he can stand up for you and your children.",
            "Uhhh ...have you watched Arrested Development?\n\nYou might want to if you haven't. It's about your husband's family.",
            "Don't blame your Fiance for his sisters' bad behavior. ",
            "So gold digging sisters. He needs to cut contact with them as he had in the past",
            "Under no circumstances. Let them come to the wedding. If you think this is bad, wait till the whole day is dedicated to you and him. Because they will shift the focus of the entire day.",
            "I don't know if you should insist on cutting them off completely. But before you marry Michael you need to be sure he won't give them any more money, and I don't think he's there yet. It's worrying that he felt the need to tell his sister the ring wasn't a diamond.",
            "I empathize with your situation and I'll say this much, he needs to stop giving this chick money. Period. As far as the wedding goes, go ahead and do your thing. It sounds like you're not comfortable with his sisters and as such I think you deserve to not have to deal with them on your wedding day.\n\nIt seems like he's already distanced himself quite a bit from these two (for good reason), but I would not force him to cut them off completely. At the end of the day, they're still his family and he's probably going to have to deal with them at one point or another. Cutting them off completely is going to make it only more awkward than it already is. Just do your best to eliminate the drama by not being a part of it. Exclude yourselves from it... from a distance. \n\nChances are after the money stops there's gonna be some more drama temporarily so prepare for that. A tough situation indeed but after that I think you'll be in the clear. Other than that congrats on the engagement! Sorry to hear you have to deal with this nonsense.",
            "First, Congratulations on your engagement and upcoming nuptials. Second, I'm so pleased to know you have a Moissanite ring! I love Moissanite, it is beautiful, more sparkly than a diamond and there is no worries about it being a blood or conflict diamond. You get to have a great big beautiful stone without going into hardly any debt and if you are a science nerd like me the fact that it is grown in a lab makes it even more enticing. I only wish you would stop calling it a fake. It is a real Moissanite and I think you should not be apologizing for it. After all look at the puny little diamond SIL has probably at the same cost or more. I'd just feel sorry for her.  \n\nAs to what you should do about SILs, I would be happy to cut such shallow people out of my life and never give them a second thought going forward. Now convincing your fiancé of this is your real challenge. When I was reading your post, even before I got to the actual current conflict I was thinking he should walk away from those leeches. He has been taking care of himself since he was a young teenager and seems to be doing a good job of it. How you convince him to do this is going to be hard since they have brainwashed him into believing that family trumps all even when that same family is shallow, spoiled and didn't have the gumption to make anything out of themselves. In this day and age to see two young women behaving like they were raised in the middle of last century is laughable. They didn't care to get an education in order to be self reliant. That is definitely not you or your fiancé's problem. Good luck with getting him to realize that fact. I hope you can though because if you can't I wouldn't give you any great hopes that this problem is going away and you might just have a rough time going forward which is no way to start your new life together. I hope you two figure this out. Good luck.",
            "I did not read the entire thing but I already know what I would do. I would cut the entire family off.  His parents treated him like an unwanted step child his sisters were mean little shits to him. While the way they treated him may be partially responsible for why he is so successful it was still a horrible way to treat him.  \n\nI would go no contact with all of them.  None of them sound worth while to maintain a relationship with.",
            "His family is awful-luckily they are not local to you.\n\nYou ned to talk to Mike about the money thing-you need to find out exactly how much he has given them over the last three years and what his limits are for the future-now that you are married will he change how much he is willing to give? What about after you guys have children-what is his response going to be when they come begging with their hands out?\n\nTalk about this gently with him-see how committed and strong he is about setting limits.\n\nDOnt tell his family anything-not about your salaries, profession, titles, rent/mortgage/savings/cars/rings/trips-nothing.  not a word. If they ask-sorry, thats private.\n\nETA-and not coming to the wedding-thats a huge win for you.  I would point it out try bluntly to your FH that now h has addiotnal compelling grounds to both go nc and stop handing out money.\n\nTHEY SLANDERED YOU ON FB AND CALLED YOU-HIS FW- A GOLD DIGGER IN FORNT OF EVERYONE.  Ask him why he thinks its ok to even consider giving into demands for money from someone who treats you so horribly. \n\nBlock them from seeing your fb page and on any other social media.",
            "Please have as little contact as you can with these people & enjoy your engagement & wedding.  They are toxic they will try to bring you down.",
            "you ignore them. people like this make themselves look bad. fuck em.",
            "I would be worried if he wasn't ready to stop lending them money.",
            "Pre marital counseling is awesome to have good safe conversation and get to the same page on issues like this as well as other issues that you might not even see as a big deal right now but communicating on them and having a plan now could earn you years of happiness instead of grief and bickering.  Best!",
            "People really act this way? Tell them both to go fuck themselves. Also express that you weren't planning on inviting them to your wedding anyway since they obviously don't support it  ",
            "I treat my stray cats better than the way they treat their own brother/son.\n\n\nThat is to say, they treat him like shit.\n\nHope you guys eventually go low contact with that toxic \"family\"\n\nOnce you have kids I think Michael will start to get more protective too. I wouldn't want to raise kids around those kinds of greedy, bitter, petty jealous people, who I bet would even try to fight your (future) kids on their inheritance from Michael, if they ever had that chance or if Michael died prematurely.",
            "I think you need to encourage your soon-to-be-husband to visit a therapist regarding his family. The poor guy has been used and abused by them his whole life - he knows he should stand up to them, but he lacks the self-confidence to do so because he's just so run down by them. \n\nNow that you guys are getting married, your money will legally be joint - I'm sure that you don't want your money to be going off to a bunch of spoiled brat gold-diggers who are rude as fuck to your husband and you. While therapy for your husband is key, I also believe some pre-marital counseling is extremely important before you two get married to ensure that you two are on the same page about how his family (and yours, although it may not ever become an issue) will be handled going forward in your marriage. \n\n",
            "Michael needs to go no contact with his sisters for the sake of his relationship with his future wife *and* his own health and safety. I'd say he should go ahead and cut off the whole lot of them because his parents sound like shitty people too , and apparently physical distance wasn't enough for them to get the message. I think it's time for a serious sit down with your future husband, and that you should frame it as not just being worried about yourself, but for him too. He shouldn't be allowing himself to be abused like this. Maybe he needs a professional to help him distance himself from his shitty childhood.\n\n>Apparently their mom and dad has refused to continue to support them to the large extent that they have been the past several years \n\nLol support them in what? Behaving exactly as they were raised to behave? Or maybe their parents felt they would be married off by now and they'd have rich husbands to depend on. \n",
            "From what i read here OP you hit the nail in the coffin with tina she is super jelly, she is jealous that you have her brother, she is jealous you have a better ring reguardless of what it is made from, she is jealous that her brothers life is in order and is progressing and she is stagnate with financial woo's left and right, she is jealous that she cant have her cake and eat it too. I also feel sorry for mike with the way you described his younger years, it must have been super hard for him. ",
            "Michael needs to stop justifying things to them. Telling them the ring isn't a diamond was a mistake. The message should be \"My fiance(wife) is the most important person in my life now. I am prioritizing our financial security.\" If the sisters come begging for money, he should explain that they're free to seek their own engineering or nursing degree, or if they don't want to work they can seek money from parents or their own SO's. He needs to make clear that no more money will be coming from him and he doesn't need to explain why. ",
            ">Apparently their mom and dad has refused to continue to support them to the large extent that they have been the past several years\n\nMichael needs to follow his parent's example - the real problem here is his continued financial support of his sisters, not the ring. The ring wouldn't even be an issue if he weren't underwriting their expenses. He needs to put his foot down and tell his sisters to grow up and start living on their own. Otherwise they will continue to prey on him for the rest of his life.",
            ">Reddit, I'm at a complete loss as to what to do here. Michael is also shocked but not really because he is so used to his sisters' antics. He took my side and I appreciate that but when I talked to him about cutting his family off for good he seemed hesitant. I think he just doesn't wanna create more drama. But I need him to draw hard lines here.\n\nYou are absolutely right - he needs to shut this shit down and stand up to his family.  If they won't stop it he needs to walk away from the bullshit.\n\nI highly suggest going to couples' counseling with a \"leave and cleave\" counselor to help stiffen his spine before you two get married.  it might help if he hears the same thing  you're saying from an expert.\n\n",
            ">Mine, though fake\n\nYou don't have a fake diamond, you have a real moissanite! I have one too and like you I specifically requested \"no diamonds\".\n\n\nI second the premarital counseling idea. My husband and I did it and we didn't even really have any issues that we needed to address. But the counseling helped us clarify our communication styles and it brought up potential issues that we hadn't considered yet prior to parrying. I think it's a solid plan for everyone looking to make that sort of life commitment. \n\nYou wouldn't pick a college without meeting with their counselors and you wouldn't plan your retirement without a financial counselor and you wouldn't buy a house without a mortgage counselor, why would you make the biggest commitment of your life without the same help?",
            "My family is bat shit insane. My mother is a raging narcissist and my sister will do things mass family emails condemning one family member or another. My first husband was terrified of my family and I did everything in my power to keep the contact minimal for him. I eventually divorced (he begged me to keep my family out of it and I did) and am in my first long-term relationship since the divorce. In two years my boyfriend has been around my family a total of 4 days. \n\nYour fiance may have some work to do. Recovering from a shitty childhood and learning to value himself. Whenever I feel guilty about ditching my family I remember how much my friends have been there for me. They are MY FAMILY. But it took me awhile to get there. Give him space but it is his responsibility to do the work necessary to protect his new and frankly most important relationship, you. \n\nHe may find that being married and starting his own family is incredibly healing. I know when I am in bed with my bf and my cats, my family, I am so happy. Having my own \"family\" has made low contact with my birth family much easier. \n\nThese people are poison. If you can find a way to lovingly support your soon to be husband in going low contact while he does some recovery work you can set yourself up for a great marriage. But if the marriage includes these emotional vampires, it's going to be tough. I'm sorry. Your husband sounds like a great guy. I hope he can find a way to truly get what he deserves (happiness) with you, free of the people who only want to use him. ",
            "You fiance is taking your side, I think you need to speak to him about your future and tell him that as a couple you need to come to an understanding financially.  Family helps family out in hard times but his sisters are acting like he needs to pay them an allowance to be related to them.\n\nHis sisters made the decision for you not to invite them to the wedding so simply do not invite them.  Ignore their drama on facebook and speak to Michael about them.  You cannot deny him a relationship with his family but you have every right to tell him if they are going to treat you like that then you have every right not to speak to them.",
            "Michael needs to get into therapy to try to undo some of the damage his family has done to him. I'm guessing that meeting you was the best thing that ever happened to him.\n\nAs for Anastasia & Drizella, the best response is \"Ask our parents for the money, they've always supported you before.\" Although \"Fuck you\" or \\*click\\* also work. I think he's going to need that therapy to learn how to do this.\n\nI think it would be a very bad idea for you to play the part of the heavy. That will bring the family's wrath down on you like a ton of bricks, and they will go on the warpath to get Michael to break up with you.\n\nHe really does need to cut his family off, but he can't hear that from you. It just makes you out to be the monster if you press the matter. It would be better if he heard it from his therapist, but much better if he heard it from himself.",
            "OP, I just had to jump in and say while you've gotten some excellent advice on how to deal with these batshit crazy sisters, please do not doubt the value of your ring.  My engagement ring is moissanite too which I wanted as well, and it is downright beautiful.  Your ring IS real, it's a real moissanite and that stone is not a fake diamond.  I haven't told a soul about mine not being a diamond because everyone just assumes it is one.  They're clearly two different stones, but even if your fiancé proposed with lava rock, there isn't any shame on whatever makes you happy.",
            "My mom has a cousin who actually shined her iphone flashlight on my engagement ring to see if it was real.",
            "They sound like hillbillies. Sorry for this.",
            "You two have a lot to talk about before you marry into this family. I'd highly suggest pre-marital counselling. He may not even realize that this is not normal behaviour. \n\nHe needs to stand up for himself, cut off his sisters, and shoot down any abuse they are sending his way.",
            "Omg these \"sisters\" just enraged me. Gotta go before I start asking how I can harass them on fb. Best of luck, OP!",
            "I would make it a point to discuss cutting his family off and how you are really concerned about their selfish bullshit affecting your future together.   Some family is worth losing an SO over, his are trash that need to be cut out completely.  \n\nHe needs to let them go, block them and move on.  No invites to the wedding or anything, they just need to be out of his life if you want to try and make a future with him. ",
            "There's no reasoning with her. I'd get Michael to block too. If you want, you can do it after the wedding so it doesn't cause a lot of drama before your day. You don't  need that negativity in your life. Be glad neither she nor her sister will be coming to your wedding. Don't concern yourself with people like that. I'm sorry that you have to marry into that family but you will make your life more miserable trying to placate them or reason with them or try to understand them. They were raised this way and the crazy in them runs deep.  There's no changing or understanding that. ",
            "This will be a constant issue in your marriage and only the beginning.  Unless he cuts thrm out ofhis and your life I just see it getting worse.  He is being passive and that is concerning.  Before giving up try couple's counseling.  ",
            "If you've been together for 4 years, haven't you already started your lives together?",
            "Just deleted the sisters from your personal life, each of you contribute a percentage of your income to a joint account and then maintain separate accounts with what's left. Bills come out of joint, personal spending comes out of personal accounts. Joint savings maintains joint control, obviously. \n\nBam, all problems solved. You know where money is going, he can do whatever he wants with his personal amount and it's none of your concern. Money for bills, and money for savings is still there.\n\nI get it that you are concerned with the family, but you've only met them a handful of times. You're letting a tiny piece of your life overwhelm you. Fuck them and screw that. Just let them float downstream. Your real concern is the money, but it's not yours anyway. So again, go with the joint and separate accounts and never ask about his personal account, because your should just expect the worst. Which is that he is giving his family money. People have much worse habits in the world, I'm quite sure.",
            "No matter what the situation is with his family of origin, it is IMPERATIVE that the two of you work out what it means to leave those families and cleave to EACH OTHER. \n\nThis would be an excellent topic for pre-marital counseling. \n\nI have seen more than one relationship end because the man chose his family of origin over his wife, and I have seen other relationships suffer greatly because of the same thing.\n\nThe best thing you can possibly do at this moment is to decide what it means to each of you that your families of origin are now taking second place to the family you are creating together. \n\nDo not underestimate the importance of this. There are many adjustments to getting married and many ways each person has to be flexible, but when it comes to families of origin, it's just so important to figure that out before you're in a crisis. ",
            "Um, you started your lives diverter four years ago.  I find it insane to discount the time you spent together prior to some idiotic wedding ceremony.",
            "Ugh I am so sorry. \n\nI think that before the wedding, you and Michael need to see a marital counselor to talk about this. You two need to be on the same page WRT giving money to his siblings and tolerating their abuse. \n\nMichael himself needs to lay down a hard line: insults and abuse will no longer be tolerated. It's amazing to me that these people think he should give money to people who insult him and his wife! He needs to tell his sisters, directly, that their behavior is unacceptable. If they don't stop, then he should cut them off. \n\nAnd next time they come demanding money (which they will surely do) he should say \"I don't give money to people who insult me and my wife.\"\n\nIf they don't come to your wedding, yay! Why spend even a cent to feed and entertain these two. Their comments about you are just projection- they are the ones who are gold diggers here. Ignore them on social media, vent to your friends about what is going on and enjoy support from them. \n\nIf Michael is not willing to set/hold boundaries with his family and create some distance, then I do think you should delay the wedding. If you do not, these women will be harassing and abusing you for the rest of your life. ",
            "I can feel the toxicity through my screens as I read that. I would just ignore them. ",
            "Well come wedding day, you've already saved yourself the hassle of not having to invite those horrible girls. So yay! But really though, I'd just ignore them from now especially since you're getting married and eventually starting your own family. Your priority will still be your soon to be husband, and for him, you. They're the ones who will have everything to lose because once you guys start having kids, guess what? They're not allowed to be part of their lives! \n\nTalk to your fiancé and tell him you don't want anything to do with his toxic sisters from now onwards! He doesn't have to cut ties with his family but just make it known to him that any family function with them around, you will be more than happy to skip it. And make sure he respect your decision! ",
            "Fuck'em. People like this don't think like real human beings; it becomes much easier to be around this kind of toxic if you remember your Disney movies. These sisters are Cinderella's ugly step-sisters. And, if you read the Grimm Brothers' version of that one, they eventually cut off their own toes to try to fit into her shoes. \n\nLet them yack and ignore all of it. The lack of attention will drive them to extremes and they'll damn themselves in the end. \n\nFocus on your partner. A counselor isn't a bad idea, and take time to set firm boundaries with him. Ideas: loan them only $20 for a tank of gas every X months if asked nicely and keep an account, block them on all social media, exclude them from guest list *at their request* (along with everyone that makes YOUR WEDDING about the Ugly Sisters-in-law), and otherwise, act like they don't exist.",
            "In all honestly, I think Michael should be doing more to insulate you from that behavior, especially considering you've only met them a few times.  He either doesn't realize how normal families behave or doesn't really care.  You need to sit down with him and explain to him how horrible this behavior is and that it's not okay.\nI can't even imagine having a guest in my home and treating them like anything other than a VIP.  The whole thing smells of trailer park to me.\nMaybe it's because I put a big emphasis on family when I was dating many years ago...but I can't ever imagine being married to someone whose family I couldn't tolerate.  I broke up with my last girlfriend because her family was so messed up that I could never picture us together.  My kids having fond memories of their grandparents and aunts and uncles was really high on my priority list.\n\nGood luck.  I really hope you don't have to interact with these psychotic women much more.",
            "Can we see a picture of the ring?",
            "Putting family first?  Those 2 women were put first their entire life while Michael was a behind-the-coucher.   He was expected to be a high achiever, while receiving no family support. \n\nThey're jealous of you, OP, because in their minds you can take their gravy train brother and his money away from them.    They're jealous of your ring, because they feel that they own Michael and his income, and they don't want him spending \"their\" money on another woman.  They're trying to drive you away from Michael by calling you gold digger, by posting shit about you on social media, etc...because in their minds you are stealing Michael and his money away from them. \n\nFamily?  You're marrying Michael, you ARE family.\n\nDo not show them any ring paperwork.  If they want to beat themselves up thinking it's a natural, real diamond then that is their problem.  They're not coming to your wedding?  A win-win situation for you, because you KNOW they'll make drama for you at the wedding, trying to make it all about them.  You don't need that on your wedding day. \n\nMichael needs to stop enabling his sisters by giving them money.  What he has he earned himself.   You need to sit Michael down, and have a serious talk about his family, his sisters behavior, and how this can impact your married life together.   You should also keep all your finances separate from Michael until he gets his act together with his leeching family.   A woman should do that anyway, because with 50% of marriages ending in divorce, a woman should always protect herself in case things go badly some years later.  \n  \n I would cut them off, and out of your lives aftef the wedding.   You can do this,  because you live far enough away from them.  ",
            "You're marrying Your fiancée not them. Tell your fiancée that this is not normal behaviour and where are his parents in all this? Tell the parents to control \" the step sisters\" yup that's what they sound like Cinderella's step sisters!. Your fiancée has to make it clear to his parents and his sister's fiancée that it is not his responsibility to financially support any of them. If the parents want to deal with spoiled brats let them but you and fiancée don't have to. Fiancée is embarrassed by his family hence him not making you meet them. He needs to cut them off.",
            "You need to draw the line with your fiance before the wedding and talk it all out. I don't think this is something you want to understand fully while married.",
            "Premarital counseling might be a good place to talk through all of this. In mine, we had to look for relationship patterns so as not to repeat them in our marriage. If it's a premarital counseling program than there is usually a financial section, which would open the conversation for if you will support family and under what circumstances. ",
            "He should be thinking about his family. He should be thinking about how giving them money is enabling them to goof off in life.  Until they have to take care of themselves they will never learn and get their crap together.",
            "Make sure they don't come to the wedding.  Have security in place to make sure they don't come and cause problems.\n\nYou and your fiancée can have a happy life together with minimal contact from his sisters.",
            ">How can I handle this situation?\n\nThis seems more like something Michael has to do, you can help support him, but it's his family that he'll have to potentially cut off.\n\n>She sent out a mass email to the whole family and announced that her and Hannah will not be attending my wedding nor supporting Michaels marriage to me \n\nAt least they set up the ground work for you. \n\n>but when I talked to him about cutting his family off for good he seemed hesitant.\n\nWell that's a normal reaction, to not want to do it straight away. If he just needs some help convincing himself, you could show him this thread.",
            "I thought there was a problem until I read they won't be attending the wedding or won't be affiliated with your marriage.  Perfect.  But of they do attend, make sure there's two perfect name cards written in diamond lettering with their names on them.  In the children's table, obviously.",
            "Your fiancé needs to put on his big boy pants, tell them off, and stop enabling them. If they continue to pester y'all then cut them off until they learn some respect.",
            "Do not engage with these monsters. Don't respond,....just nothing. How are the finances budgeted in you house? Is your money pooled, separate, or a combination of both? I would have a conversation with you husband letting him know that you are not ok spending any pooled money, or your money on his sisters. Let him use his personal funds for whatever he wants, if that is his sisters so be it. \n\ni would wait to feel out the whole wedding invite situation until you are a little bit closer to the date. if you see them in the mean time, you can say hello, but just walk away if the begin a conversation, stay close to either your husband or someone you trust. IGNORE, IGNORE, IGNORE, do not engage.\n\nWhen you talk to your husband about what is going on, i would advise against things such as \"suggesting\" that he cut off his family. That is something that someone should come to their own conclusion about. What you can do is tell him what you will not be tolerating, if that means that you will not be attending social events, so be it. \n\nLastly, don't throw away a potential relationship with his parents just because the sisters are animals. I'm not saying you should force the relationship, or try to prove yourself, but maybe have them over for dinner, or just try to carve out some low key time for the 4 of you to get to know one another better.\n\n",
            "This has a Cinderella feel to it only your fiancé is the male Cinderella and they are like the evil step sisters fighting about a ring instead of a shoe, no wonder he lives in another state. You need to set some boundaries with Michael now on what you will and will not put up with as far as their concerned, especially about loaning/giving them any money. You can't start a new marriage like that. Good luck :)",
            "I think it would be in your best interest to distance yourself from his family and him distance himself as well. He doesn't owe them so much as the one of day. His family treats him as the scapegoat and his sisters always had everything they wanted. As a result they think the world owes them just as much. Spoiler alert: it doesn't. The world won't and doesn't coddle anyone. So in her still childish mind she thinks the world owes her a bigger ring, owes her money, owes her time. Simply for existing. She hasn't been a good sister and it doesn't seem like she's been a good person either. Neither of his sisters seem to e good people. Rest assure that this isn't about you. This is about their own issues that have been deep rooted in their family since before you and possibly even before the sisters or your fiancé were even born. His parents seem to be the root of this evil. Your fiancé has always been their scapegoat and you're a part of the package deal unfortunately. But who would want such people at your wedding anyways? You go on and live your life. Their selfish ways do not have to affect you. They have been that way since before you got there. You owe them nothing and assure your fiancé he doesn't either. He doesn't need to give in and neither do you. Let them spout names and insults at you. Just know their issues aren't with you. You go on and have your beautiful wedding and you work your ASS off for this future. His sisters don't deserve anything. They don't even deserve the satisfaction of knowing it affects you. ",
            "Good on you guys for getting a moissanite ring. Why start a marriage off with debt? We did the same and have spent the last 10 years saving and making good financial decisions so we can retire in the next 10 years. Don't let all these people and their jealousy ruin your  mood.",
            "I don't know that it's necessarily a good idea to cut contact with his family completely, because eventually they may just use that as a validation of their own feelings i.e. \"See! She got him to cut us off completely.\" I'd say just discuss with your SO the limits you have and how the problems will be handled, such as no money being given to them, no prolonged visits to their house, etc. ",
            "You do nothing. ABSOLUTLEY nothing. This is Michael's family and michael's problem. Michael needs to put his sisters in their place and explain that they need to grow up. Michael needs to make a stand to his family and defend you. \n\n\nIf Michael can't or won't do these things, you may want to postpone the wedding. ",
            "Please have your fiance read your post and these responses. Sometimes it's hard to wrap your head around a problem until it's written out in a clear and succinct name such as your post.\n\nThe comments and advice provided will help him realize that yes his wife is correct, that his family is a bunch of narcissistice assholes.\n\nAlso other posters mentioned JADE'ing. Please both of you research it, memorize it, and work on never doing it again. You are each others family now. Those people are now his EXTENDED family. He needs to realize that they literally have no say, no true importance, are only effecting him negatively at this point, and he can actually live without them and their bullshit and be just fine, in fact, happier. ",
            "wow she is publicly humiliating you and he still gives her money??? Shouldnt you reconsider if this is the right time to permanently involve them in your life? I think you need to reconsider this engagement and maybe hold off the wedding until this gets sorted out. You have to think about how he is treating you by not doing anything. Hes essentially siding with them by not protecting you from this craziness. This is absolute madness whats happening here. And very very unsavory. ",
            "It's time to avoid contact with his family. If he wants to visit, sure, his parents are his parents, but there is no reason for you to go when you know you will just be disrespected. There's nothing saying that the sisters may grow up one day and maybe you could try having a relationship then, but you've already put up with more than most people would. We can't choose our family but we can choose how much we interact with them. ",
            "Michael's parents created these awful leeching monsters and they should be the ones to deal with it. It's not his job or responsibility to take care of them. Maybe their parents should have taught the girls the value of hard work? You guys don't owe them anything. Blacklist them from the wedding and enjoy yourselves. They will only bring drama and will most certainly try to ruin your day.",
            "Now I ain't saying she a gold digger ",
            "\"No,\" is a complete sentence.",
            "They're cutting themselves off from Micheal and forming a divide.\n\nLet them.",
            "Ignore, block, delete, ignore. SO cuts off BOTH sisters immediately.",
            "Your fiancé doesn't want to cut off him family. Ask him to not show you their social media, and work in developing thicker skin. Since they don't live near you and ate not part of your daily lives this should be easy. Any nurse deals with far more difficult people every day.\n\nWhen you visit ignore most of what they say and continue to leave for the hotel when you've had enough.",
            "I wouldn't force your husband to cut his family off completely. It's his family and just because they're horrible people doesn't mean that you should make him have no contact with his family. It has to be HIS choice. Not yours. Otherwise it will build resentment between the two of you.\n\nI would suggest creating a letter to them together and expressing how sad it is that they will not be attending the wedding but it is ultimately their choice and that you respect their decision. Just kill them with kindness. Don't feed the flame and just let them have their crazy over there, away from you. I have crazy in laws as well. I handle them like this and it works because they can hate you from afar and just smile and ignore when you have to be near them. ",
            "Congratulations on your engagement!\n\nMichael sounds great. His family sounds shitty. You'll never make them not shitty, but you can put up boundaries. Have a very serious conversation with your fiancee. It's OK to express these concerns.\n\nAlso, if it were me, a significant flavor of this conversation would be something along the lines of, \"Michael, I respect your past and your family, but if I am to marry you, I need to know I come first. I'm not comfortable with your family looking to us for financial dependency. It's OK for you to help them, but if I'm going to be your partner, I need to see you enact some boundaries with them so that our relationship is protected and can grow. We're not even married yet and your family is putting pressure and conditions on our relationship. I need you to address this if we are to have a healthy, continued relationship.\"",
            "I think asking him to cut his family off is a little too much to ask. Do they deserve it? Yes. However, it's a HUGE deal to completely sever ties with your family, and you should not expect him to do it just because you want him to. He needs to decide for himself that cutting them off is right for him. \n\nYou've told him how you feel, and now it's time to let him work out the right thing to do on his own. Now is the time to do your best to be supportive, even though it's difficult. If you try to pressure him into cutting them off before he is ready, he will only end up resenting you. He's already taken steps to stick up for you, and he's not just doing nothing at all while they abuse you. Give him time. Overcoming a lifetime of conditioning from a family like that is extremely difficult. He's not going to just magically do it one day because you want him to. As long as he's trying his best, that's all you can ask. \n\nWhat you can do is let him know that *you* want nothing to do with them. It is not unreasonable for him to do what's in his power to prevent you from having to interact with the sisters. However, you can't hold him responsible if they pull some kind of shady shit to get around his efforts to keep them away from you. People like his sisters are really good at being manipulative. \n\nIt is none of their business whether your ring is real or not. If he has decided to not give them money, then they just have to get over it. There's nothing wrong with a minimum wage job (I've had plenty myself) but if they're unable to support themselves on that and they're not even trying to get something better, then they have no right to get angry that no one else is willing to support them. \n\nIt's one thing when you're in school, or some sort of training, or trying to improve your situation, but doing as little as possible while expecting others to support you is ridiculous. There were times when  I had three jobs while I was in college. Yes I had help from family sometimes, but I busted my ass to improve my situation, and now I can fully support myself with a decent career. There is no excuse for people like your fiance's siblings. \n\nFinally, if you feel like all this is too much for you, then you might have to consider breaking up. Being married is about supporting each other through thick and thin, and if you honestly think you can't help him through his family situation for the rest of your life, then perhaps this is not the right marriage for you. There would be absolutely nothing wrong with ending it if you think that's what is in *your* best interest. ",
            "Get Michael to show her proof that the ring isn't real, and disinvite her to the wedding if she changes her mind about coming. If I were you, I'd avoid her at all costs. This could be harder for Micheal though, as they are family. He should at the very least put some boundaries up.",
            "It's definitely not classy but you might agree to show her the valuation, meet up with her, hand her an envelope and walk away immediately. Beforehand stuff the envelope with a piece of paper saying \"Fuck you\".\n\nIn all seriousness however, yes, Michael will have to set boundaries. I'm really sorry he has a family that never seemed to value him beyond any financial gain he brought to the family. I don't think going No Contact is easy so you just have to agree on how to communicate with his family on your both's terms (yours and Michael's) - like which mode of communication you are available through, who to contact & whether you both formulate replies together/listen in to the conversation at the same time etc. Definitely don't give in to their whims though, that's just reaffirming what the SILs expected from their school days",
            "He either cuts them out or you walk and they can have your engagement ring. I don't know why people put up with this kind of drama. Your fiance is a door mat and after the way he was treated as a kid it should be a no brainer. If he can't stand up for himself and you I wouldn't stick around. Your whole life will revolve around this chaos. And him giving them money? I'd be furious if he kept doing that after being engaged/married. Enough is enough. His parents aren't paying for the sisters anymore because they know your fiance is a gullible fool who will do it for them.",
            "[deleted]",
            "Everyone has crazy in laws. It's practically a requirement. In all seriousness though, other than having a conversation with your fiance about the level of contact he expects to have with his family and making sure you guys come to an understanding regarding giving money to them, this doesn't sound like that big a deal.",
            "\"she made a grab for my left hand\"  OK- So she kind of assaulted you.  Next time dial 911. Warn Michael that this could happen. You are off limits. "
        ]
    },
    {
        "post_id": "7bv32e",
        "author": "Givena",
        "title": "My [27F] brother [32M] is out of prison after 10 years and I don't know if I should see him. (Update after 1.5 years)",
        "url": "https://www.reddit.com/r/relationships/comments/7bv32e/my_27f_brother_32m_is_out_of_prison_after_10/",
        "score": 2269,
        "num_comments": 50,
        "created_utc": 1510250888.0,
        "selftext": "[My post from 1.5 years ago](https://www.reddit.com/r/relationships/comments/4ry76x/my_27f_brother_32m_is_out_of_prison_after_10/)\n\nI remembered posting here, and decided to give an update after 1.5 years.\n\nTLDR of last post: Brother did crimes which got him sent to prison and that was the start of a chain that destroyed our family and left my parents dead. He's out now. Not sure if I should start contact.\n\nI decided to go and see him. I talked to my uncle first and he told me that my brother is acting great, doing good work and is being very reasonable about everything. He also said he's asked about me but kept his distance out of respect, since I stopped visiting him in prison.\n\nWhen I met him it wasn't easy. I had some unresolved feelings and I ended up shouting at him a little, but also eventually ended up crying in his arms. We talked for hours and hours that day. The more we talked the more I realized how much I missed him and having him in my life, and also how little I knew about our parents. They were horrible to him, really abusive.\n\nOur father used to hit him. I remember him crying in his room sometimes. I always teased him and mocked him for it. I was a lot younger and didn't know what was going on, but I have vague memories that I mostly hurried but now they made a lot of sense. I even remember our dad went to his room with a belt. My mom told me he wanted to see if it fits on my brother's pants. I was 12 I think. I believed it and ever thought twice. No wonder he was acting out and was troubled. I know it doesn't excuse what he did that left him in prison but it adds some context.\n\nWhen I visited him in prison early on, he would always ask me if our parents are treating me well. They were to be fair, they never abused me. Or if they did I don't remember. I thought he was trying to badmouth them but he was worried about me. He apologized to me that his stupid mistake ended up separating us because he had promised himself to keep me safe and to help me when I turn 18.\n\nOur grandma confirmed the abuse as well when I talked to her. She knew about it and did nothing. She told me my mom didn't kill her self because of what my brother did or my dad's repulse, it was over guilt for not doing anything to end the abuse that my brother suffered for years. My view of my parents have changed completely. \n\nTo make it short, we decided to restart our family with a clean slate. We promised to love each other and take care of each other. We've both been to therapy as well. We missed a lot of years but we have a lot of time ahead of us. \n\nIt's so good to have a family again! I've had friends in these times but never had someone who knew everything about me. Someone I could trust and always rely on. And being that person to someone else. Now I have that and it's amazing. We talk on most days and see each other at least once a week. He's still working in the farm with our uncle and is doing a good job. But I convinced him to go back to college and get his degree. He began this semester. He's also staying away from alcohol completely and I'm doing the same. Both our parents had an alcohol problem and he did something horrible while drunk and our uncle has also been having DUIs, people in our family should not be drinking. I never had a problem with alcohol but I think doing it together is just easier for him and me.\n\nSo overall, life is good. And I'm really hopeful for our future! Thanks for your help especially those who gave me the courage to step up and meet him. \n\n  ---   \n  **tl;dr**: Met with brother. Realized there were more going on that I knew. We made our peace and now 1.5 years later life is great! ",
        "permalink": "/r/relationships/comments/7bv32e/my_27f_brother_32m_is_out_of_prison_after_10/",
        "comments": [
            "I'm glad it worked out well for you, OP. I wish you and your brother much happiness and contentment. Your brother, especially since he's been through a lot of crap through this life. ",
            "I'm not crying, you're crying, shut up",
            "I love Updates with happy ending. Thank you for posting this!",
            "This is a great update! I'm so happy to read this. It's great you both have started moving forward as a family.",
            "What a beautiful story",
            "This is beautiful. If your brother needs extra support, see if there are any post incarceration support groups or grassroots orgs in your city. They even often have employment and volunteer opportunities so he can help others get right too, while getting the help he needs. Best of luck! ",
            "This post brings me to tears. I hope you and your brother continue to heal and grow even closer together in the coming years. ",
            "You are awesome. So many people just walk away, so much advice they leave him. But you treated him like family. You learned what his life was like and it brought you closer. I’m happy for you OP. It took guts to do what you did and your life is now better for it. Good job, and good luck in the future. ",
            "My mom killed herself too. It's devastating, and I am afraid of being alone whenever my dad dies. It's great that you reconnected with your brother and are re-building your relationship.",
            "This was incredibly heartwarming.  There is a documentary called \"Healing Neen\" that covers this from a female perspective- unfortunately you'd be hard-pressed to find someone in prison who didn't have environmental factors (especially abuse) pushing them toward that path.",
            "I'm so happy for you that you're both rebuilding your family together. Also, that you both knew enough to seek therapy for the things you've both had to experience. It sounds like you made a really really good choice to reach out to him. ",
            "Congratulations! This is a wonderful result from such a difficult and painful situation. I also commend you both for being strong in the face of alcohol. It isn't an easy thing. Best of luck and happiness to you both! ",
            "I've always been a happily smug only child, now I want a brother. ",
            "I'm at work. read this, onions everywhere. happy for you op. ",
            "I almost never visit this subreddit and haven't posted here in 2 years but your story is very heartwarming and I loved it. I wish the best to you and your brother :) made me very happy for you!",
            "I'm so glad it worked out and yet I am so sad for him.  Also how is he adapting to the ever fast changing pace of technology?  10 years and there has been like 9 iphones that's been out. ",
            "dammit, who's cutting onions in here?",
            "OP, I almost cried reading how your mother did nothing about the abuse ... it hit close to home. I’d advise you and your brother to continue therapy at your discretion. Early, violent abuse plants a seed for compound anger that unravels into adulthood. Many abuse survivors have PTSD and are forced to relive the abuse when triggering stimuli pop up. I am actually not one for labels or playing armchair psychiatrist, just my 2¢ for long term help on such unfortunate circumstances. \n\nThat being said, I’m very happy for you both. Siblings are a huge support through shit family times. My sibling and I are nothing alike, but he has helped me tremendously, regardless. Best wishes. ",
            "Excuse me, I ordered this story without onions. ",
            "This warms my heart. Best wishes for both you and your new family. ",
            "Wow, this moved me to tears.  So happy you have your brother again.",
            "I'm so happy for you OP :\") Glad you were not too quick to judge, and gave him and yourself a chance to reconnect. ",
            "So glad to hear that things are looking up! Good luck with your endeavors, OP!",
            "Really glad to here that all is working out for now.",
            "Oh man OP, I remember reading your original and wondering if there was anything else going on. So happy to hear you guys have reconciled and are healing together. Best of luck for the future!!",
            "That's down right beautiful. Best of luck to you two!",
            "Nice! I'm glad everything's worked itself out! May I ask what kind of degree your brother's going to get?",
            "These are the updates we all love to see on here. ",
            "Damn. Thanks for the update. It's always good to see the other side. I hope things continue to improve in your relationship.",
            "I cannot imagine life without my siblings, so I'm really happy to hear that you found your way back to yours. I hope you both continue to respect, support and motivate each other over the course of your lives <3",
            "Probably one of the greatest updates I've ever read! But I do have a bias for sibling bonds. I have always felt a very genuine sympathy for those who have had to go thru life without a sibling. When my parents went through an abrupt and eventually pretty nasty divorce, it totally shattered our family. But on the other end, it made my sibling and I so much closer and they are my best friends. Finding out your parents have done terrible things feels like you've been fooled, you're childhood was a lie, your foundation of your life is gone - but what was worst was the grief. You don't simply feel betrayed, you feel like someone you love has died and in many ways that is true. The parents you thought you knew no longer exist, and who knows? Maybe they never existed at all. The mutual love within our home and family was just tossed out like garbage. My parents were both so angry and devastated that they totally dropped the ball for a few years. Me being the oldest and only 17 at the time, I knew I had to keep us a United front. \n\nOur philosophy has always been that your parents may fail you, your family may fall apart, everything you once knew and took for granted could be over tomorrow - except for us. We cannot and will not divorce our siblings, that's the true family.",
            "This was such a sweet (albeit very heartbreaking to read what you and brother went through) update!\n\nVery happy for you guys to get a chance at a fresh relationship!"
        ]
    },
    {
        "post_id": "476ub0",
        "author": "husbandandfriend",
        "title": "[update] my (35f) husband (35m) of 10 years went on a ski trip with his gorgeous young family friend (22f). They just got back and I wanted to give a quick update since this sub was very helpful",
        "url": "https://www.reddit.com/r/relationships/comments/476ub0/update_my_35f_husband_35m_of_10_years_went_on_a/",
        "score": 2259,
        "num_comments": 296,
        "created_utc": 1456238219.0,
        "selftext": "here's the original for those that didn't see it the first time. \n\nhttps://www.reddit.com/r/relationships/comments/44czp3/hubby_of_10_years_35m_just_told_me_hes_planned_a/\n\nThe tl:dr of the initial is: husband had a ski trip planned for a long time, guy he was going with cancelled at the last minute. Husband asked his life long family friend who is 22, gorgeous, Instagram model to fill in. I was upset, husband cancelled the trip. I felt guilty and got trip back on with the room upgraded to a suite. And they went.\n\n**update**\n\nSo Graig and Shelby just drove up to the house. Graig is getting ready for work and Shelby is actually taking a nap in our guest room since she drove most of the night. \n\nThe trip went very well and they both had a great time. As for me being insecure, Graig did everything I asked of him to reassure me that there was nothing at all inappropriate going on. He called multiple times a day and we skyped for maybe 15-20 minutes a night almost every night. I got a good idea of the room lay out and saw that even though they were sharing a suite, they both had plenty of privacy. \n\nI did have one moment early on where the reality of my husband sharing a hotel room with an Instagram model in her 20s sort took my breath away but it wasn't Shelbys faullt. Me and our 9 year old son were on Skype with my husband and I saw Shelby in the background wearing a swimsuit getting ready to go to the hottub. When she realized my son was on skype (they have a very playful, almost \"flirty\" relationship) she leaned over my husbands shoulder and said something like \"Hey AJ, I'm going to destroy you in HALO when I get back.\" But her boobs were basically right on graig's shoulder with her ample cleavage in full view. In my brain I was thinking \"buster if your eyes so much as look left...it's over.\" But Graig didn't even flinch which made me realize that to him seeing Shelby in a bikini really is like seeing his sister or cousin.\n\nSo all in all they had a great time. Graig has since left for work and I'm sure I'll chat more with Shelby when she wakes up for her drive across town. \n\nAs for me I've spent the last two weeks really dedicating my self to lose weight, get healthy and be passionate about something again. I've signed up for a 60 day challenge at our local hot yoga studio and have been going every day. I've started using myfitnesspal to count calories (I'm astonished at how much I was actually mindlessly eating for years). And in two weeks I've lost just under 5lbs which makes me feel really great.\n\n\n**tl;dr**: husband just got back from his ski trip with his young family friend. I was super insecure about but it turns out it was a good experience for them and hopefully a transformative experience for me\n\n\nEdit (about 1230 original post was at 7am) I had no idea this would blow up again but thank you again. Shelby just left to go to her apartment after we sat and chatted a bit. She is an amazing girl and I get zero hint that anything went on (just adding this for the people who think she and Graig are shady). She was so appreciative and she's going to baby sit for us whenever we need it and do a girls day at a spa in Denver with me when the ski season is over and her weekends free up.\n\nWhat's crazy is how this and my last posts comments are so split down the middle. To just answer the most common questions comments:\n\n1. I was really kidding about him looking at Shelbys bikini...if he looked he looked but it was still a little shocking to see another woman's more intimate parts so close to my husband. The hot tub pool was for the entire hotel so as far as I know they were never there alone, at least for very long. I should add that Shelby had a towell around her waist.\n\n2. I didn't go or have the option to go because we have kids in school and Graig booked this trip last summer. They were leaving Sunday and his friend cancelled Friday so it was far to late to make two week child care plans. He asked Shelby (as opposed to other people from that group of friends) because she's the only one really on his level of skiing. \n\n3. Upgrading to the suite cost me $50 a night extra and...which was not cheap but trying to get two rooms would have been $450 a night extra. This was the best compromise I could come up with. \n\n4. I'm still insecure but I'm working on it. I'm not sure if I need therapy or need to just get something in my life other than kids/husband to look forward to. I was in quite a rut. The hot yoga has really helped because it's challenging and I've made new friends. \n\nThank you again for all the comments...the positive and the negative. I'm not a great writer so the people who like how I handled this will continue to and the people that didn't like what I did won't--just trust I handled this the best way I knew how.\n\nTo the guys asking for Shelbys Instagram...funny but no.",
        "permalink": "/r/relationships/comments/476ub0/update_my_35f_husband_35m_of_10_years_went_on_a/",
        "comments": [
            "Good for you. From Personal experience, I can tell you that the children of close friends, especially old family friends, can become like family. You have seen them from being a newborn, and as they have gone through childhood.   \n\nSometimes it can be hard to see them as anything but the cute kid that ran around in diapers. They may have grown into an \"instagram model\", but you still remember them as the kid who fell asleep at the kitchen table, while visiting with their parents.   ",
            "I'm happy you two communicated and built a ton of trust out of this trip. Good for you! ",
            "[deleted]",
            "I think you should be pretty proud of yourself lady :) Good luck with the weight loss and life in general!",
            "You're avoiding the most important detail. DID she smash AJ in Halo? ",
            "I'm glad this worked out! You should come join us at /r/loseit! I've lost about 30 lbs in the past 8 months. :)",
            "Firstly, super stoked for you. It sounds like you and your husband are communicating better and better, and (even more impressively) you're rededicating yourself to improving your mind and body for yourself. Get after it, girl!\n\nSecondly, what the hell is \"hot yoga?\"",
            "I have an issue with the OP.\n\nYou keep referring to Shelby as if all there is to her is a hot young body. Like seriously you don't trust your husband because of YOUR own insecurities.",
            "Is this bizarro world r/relationships??",
            "This sub is weird. I like the implication that this dude would just fuck his \"like a sister\" family friend.\n\nIf someone implied that I was going to bang someone that I saw as a sister, I probably wouldn't talk that that person again.  The fact that this implication came from his wife is absurd.  This was all about her insecurities. \n\nI spent the weekend at a cabin with some old friends.  It was a last minute invite, and my wife, knowing she wouldn't be able to go because we didn't have someone to watch our dog, encouraged me to go up because I hadn't seen these people in a long time.\n\nIt was a group, and there were women present.  In fact, I had a bunch of beers while sitting in a hot tub occupied by myself and three other women.  According to this sub, I should have been a cheating machine because, you know, I'm not an adult person in a committed relationship who has a modicum of self control.\n\nThe people still freaking out about this guy going up with a family friend are probably projecting their own experiences/trust issues into this conversation.\n\nWe should start requiring people to have flair regarding their relationship statuses.  It might cut down on all the double-standards and projection that permeates these comments.",
            "Glad folks took the high road but for most folks that's playing with fucking fire.",
            "Err...If upgrading the rooms was an option, why not just get two separate rooms?",
            "Well I'm glad everything turned out ok. I'd still be very uncomfortable if my SO went on a trip with another person like that unless they ARE family. I think you had a right to be so freaked out. ",
            "Sorry, I just don't like this scenario. It's so strange that everyone's ok with this.",
            "OP decides to improve herself instead of getting support from outsiders.\n\nOP has leveled up",
            "That insecurity cant be healthy ",
            "This is one of those rare relationships threads that was updated and gave me a warm feeling inside. Everyone got what they wanted and needed. Well done for looking at yourself OP, its really hard to do and horrible to acknowledge, good luck with your new routine. ",
            ">Graig did everything I asked of him \n\n>He called multiple times a day\n\n>I was thinking \"buster if your eyes so much as look left...it's over.\"\n\nThat poor man.",
            "It's not really a bad thing if a guy notices boobs on their shoulder. Even if you're not attracted to women you can notice boobs that are partly exposed.  \n\nEven if it's a family member you can notice them.  They're a prominent feature.  My younger cousin who I am not attracted to because gross has big boobs and I notice it just because she has big boobs. It's hard not to notice them. ",
            "Insecurity aside and stipulations aside, this was in no way appropriate for your husband to be involved with",
            "Eh. Nm. . Good luck ",
            ">As for me I've spent the last two weeks really dedicating my self to lose weight, get healthy and be passionate about something again. I've signed up for a 60 day challenge at our local hot yoga studio and have been going every day. I've started using myfitnesspal to count calories (I'm astonished at how much I was actually mindlessly eating for years). And in two weeks I've lost just under 5lbs which makes me feel really great.\n\nHere you go, folks....proof that dread game works.\n\nWife perceived competition, immediately changed into full mate guarding mode. \n\n\n",
            "Learn to ski so you can do it with him.",
            "Awesome update, glad everything went well.\n\nGood for you on taking care of yourself as well. It is amazing how working on yourself with translate into other areas of your life.",
            "You have some trust issues that are unrelated to the attractiveness of the third party.  Good for you for using your energy to improve your body and your mood on your own.",
            "Yeah I'm friends with a lot of my friend's little sisters. Some of these friends have left for other cities but I still see their young sisters from time to time.\n\nThey are all in their mid early to mid 20s while I'm mid 30s but I'll I see when I look at them is this little 10yo brat.",
            "[deleted]",
            "Good job getting started on the journey back to fitness, but you might want to know that hot yoga isn't nearly as calorie busting as it seems!",
            ">if your eyes so much as look left...it's over\n\nHoly....  Poor husband! \nI really hope that you will get your insecurities fixed.",
            "Wow, I don't normally comment on relationships posts, and rarely even read them, but i happened to see this one on my front page and checked it out.  This is really cool the way you, your husband, and everyone acted and I'm happy it worked out how it did.  I really hope that my marriage and relationship can be this cool in situations like this where they could easily become a fight...I just hope I would be mature as you and your husband if a similar type of situation ever arose.",
            "I haven't read through all of the comments - but i'm sure this is through a lot of them. Still, i want to say:\n\nI am so impressed with you and I hope to be more like you as i struggle with insecurities and learn to overcome them like you are/have.",
            "Yay for communication. Keep working on yourself and your insecurity. Doesn't matter how old you or how much weight you put on. You never compare yourself to anyone else it, be it a model or a 500lb whale. \n\nPS: It's okay to be insecure. You were perfectly in the right to be uncomfortable with this situation. It's how you handled it that showed you your true characters. Good job! Bravo. And to your husband too for being so understanding about your feelings.\n\nPSS: And also, I know many guys, including myself, who can stay in a hotel room with an extremely attractive person and not do anything about it because they're in a committed relationship. I once went to Vegas with a close female friend and got slammed. (Granted there were other people too) but we never did anything that would resemble cheating. Love > lust and it's not just a fairy tale. ",
            "You still seem to have a lot of jealousy on the back burner. I think maybe you should consult a therapist as well for your insecurities. Sure, everything turned out okay, but I think you should explore where these feelings are coming from. \n\nIt seems as though it's almost painful for you to talk about Shelby in a pleasant tone. \n\nI mean, she is basically a child compared to your husband, yet I feel like most of your negative feelings are directed towards her.\n",
            "Damn girl. 60 day hot yoga challenge. That's awesome. Get yours.",
            "Way to go. I'm glad everything worked out.",
            "One thing confuses me a little. Is he that close only with her or also to others from the *big group of people that aren't related but were basically raised like one big family* that you mentioned in your original post? If he is, I'd still ask why didn't he ask any of the other ones.\n\nI don't want to stir in more questions and I'm also super stoked that you managed to resolve the issue and all is well, but I too (as a few others) have a little devil in my mind that's mumbling to me some iffy stuff.",
            "It isn't all terrible news on r/relationships after all haha. ",
            "Wow, OP! Go you! :D I hope you are successful in your quest to become healthy, and that it will make you feel better about yourself and your jealousy :)",
            "I'm so glad that this worked out! Like many have said, you and your husband sound like you have a very healthy and loving relationship. Feeling insecure and jealous are COMPLETELY normal and I commend both of you for listening to each other and supporting each other. I would've felt the exact same way in your situation (and hope I would have done the same in re-booking the trip) and I think that you're an amazing and kind person and wife for doing that! As long as you are dedicating yourself to losing the weight for YOU, all power to you. Sometimes we all need the push to get healthy, change something about ourselves, or the motivation to start/stop something in our lives. I hope you can put any insecurities behind you, you're a beautiful and wonderful person!",
            "OP, check out /r/keto!",
            "Hooray! Now that everything seems to be working out well, any chance we can find out who this amply-cleavaged instagram star is? You know, for science?\n\n\n\n(Yes. I know the downvotes are coming. And no, I don't honestly expect this to be answered.)",
            "I think you rock!! using myfitnesspal and the hot yoga challenge both sound awesome! stuff like that totally gets me motivated. ",
            "Hooray for self improvement and not letting your insecurities get the better of you or your relationship. Good job =p",
            "So happy for you. This is what a good marriage is built on!",
            "My fitness pal is amazing!",
            "I was going to say if you're so uncomfortable with yourself, why not change it? I'm incredibly happy to see that you, in fact, are. Many people would sit idle, but we owe it to our partners (and moreso ourselves!) to try and be fit and healthy.\n\n\nIf you need help I suggest looking at /r/fitness for advice and tips. MyFitnessPal is great, and although I've never tried yoga my sister loves it and it's great for relaxation and flexibility. Just stay on track, this way you can look bad in a couple of months or so and relish in the strides you've made.",
            "I 100% do not trust Graig. It's generally inappropriate they went away together and even if they didn't sleep together him and her taking a dip in a hot tub one on one is inappropriate enough.",
            "Go you!!",
            "Good on you for not letting your inner gremlin ruin things.  It can be hard to make it shut up sometimes.   It's nice to see updates like these.",
            "Congrats on the weight loss!!!!! Keep going I believe in you. ",
            "[deleted]",
            "If Shelby is an Instagram model, why not use her advice to lose the weight you want to lose? Working out can look daunting if you don't know what to do, having a mentor may be helpful.",
            ">He called multiple times a day and we skyped for maybe 15-20 minutes a night almost every night.\n\nSo because you're insecure his vacation has to have been \"approved\" by you? This doesn't seem healthy to me, but whatever, it's not my life.",
            "I read your original post OP and I'm so glad that everything turned out ok in the end. Your husband is a keeper!! And as for your fitness drive, well done to you! You sound like a really good person :) peace x",
            "[removed]",
            "Fuck that. You should not have let them go. They totally boned. ",
            "This whole story makes me want to cry tears of joy! There should be some sort of best of relationships thread because this would be it. Everyone did exactly the right thing. There is so much love here. It's a breath of fresh air compared to the lack of communication in other threads! ",
            "[deleted]",
            "[removed]",
            "Awesome, always glad to hear a **positive** update in this sub.  Now for this \"instagram\" model.. Care to share her link??  Us internet scientists need more research material! ",
            "[removed]",
            "Don't you have any closer real life friends that actually know the ppl you're talking about personally - then just the endless opinions of us no life internet geek types? Talk about drama lol!",
            "[removed]"
        ]
    },
    {
        "post_id": "3hrsyz",
        "author": "awayaway24601",
        "title": "UPDATE Me [34 M] with my wife [30 F], found somewhat damning messages on her phone. Don't want to believe",
        "url": "https://www.reddit.com/r/relationships/comments/3hrsyz/update_me_34_m_with_my_wife_30_f_found_somewhat/",
        "score": 2261,
        "num_comments": 152,
        "created_utc": 1440107301.0,
        "selftext": "[Original](https://www.reddit.com/r/relationships/comments/3hiybr/me_34_m_with_my_wife_30_f_found_somewhat_damning/)\n\nWell, it looks like many of you were right.\n\nShe has a personal trainer.\n\nYes, thankfully, it actually WAS a personal trainer.  I'm so relieved and you guys are way smarter than me.  \n\nShe came home from work last night and I told her I needed to ask her something, could we sit down and talk.  She looked worried but agreed right away and asked me what was wrong.  I told her I had read her message and asked her to please explain it to me.  Comprehension washed over her face and then a look of pity.  She said she had joined the gym down the street because her work gym is terrible, and she signed up for a personal trainer because they were having a deal and she wanted to be held accountable.  She showed me her sign up sheets and keycard and even pulled up the gym website and showed me her little calendar spots for her training sessions with her personal trainer, whose name is of course Jeff.\n\nShe apologized profusely and said she didn't mean to scare me.  I asked her why she hadn't said anything and she said it was because she wanted to make some progress first, which honestly, is very much like her.  When she's trying to do a project she does not like to draw attention to it until it's done.  I think that \"ta-da\" moment motivates her.\n\nSo everything is ok because I asked her what was up.  I would've updated last night but we went out with friends.\n\n\n\n   \n**tl;dr**: You guys were right THANK GOD",
        "permalink": "/r/relationships/comments/3hrsyz/update_me_34_m_with_my_wife_30_f_found_somewhat/",
        "comments": [
            "Ha, that's hysterical.  Good news.  Thanks for the update!",
            "its really refreshing to see somthing end up not be cheating in this sub.",
            "I'm so glad you didn't just attack her about it! Communication is marvelous.",
            "Win-win! She's not cheating on you amd she's getting in better shape! Glad it worked out!",
            "What a relief!\n\nI can totally understand where she's coming from too.  I like to make progress on new habit changes before telling people about them, for a couple of reasons.  a) What if I fail?  Then I don't have to give disappointing updates to people asking about my progress.  And b) And this is a much stupider reason... then there are few people holding me accountable?  I guess?  \n\nAnyway, I wish your wife luck with her new fitness goals and I wish you both luck together. ",
            ":)",
            "SHE hit the gym, but did she lawyer up?",
            "As a trainer I am now going to make all my texts to client double entendres (sp?). This is too funny.",
            "I read your original post and to be fair to you, it *did* sound a lot like she was texting a sidepiece:\n\n>Her: How am I supposed to drive my car now JEFF??\n\n>Him: I told you I was going to brutalize you\n\nI think a lot of people might have suspected what you did. Glad it was a misunderstanding.",
            "Just glad I was right in my comment on your original......now she will wonder why your going through her phone but that will be another post;)",
            "Great news!\n\nMost damning fitness related conversation I have on my phone?\n\nA running buddy inviting me up to his hotel room for \"Beer and screws\". \n\nI can explain! We both travelled to a 100 mile running race in the winter. We were trading some six packs of microbrews from our respective home towns. The beer I was getting from him was TOTALLY for my husband.....\n\nAs for the screws.....  If you put sheet metal screws in the bottoms of your running shoes, you can get a lot more traction on ice. You can buy them in packs of 100 at Home Depot. He screwed the hell out of my shoes that evening!!!",
            "I can totally relate to her \"ta-da\" moment.  I am the same way, and I didn't realize it until you mentioned that trait in her.  I have had a new wonderful job that I haven't told ANYONE about for like a month because I am worried that somehow I would \"jinx\" myself :P\n\nAnyway glad to hear the news was good!  Take her out to a wonderful date and be glad you (still) have an apparently trust worthy and lovely girlfriend",
            "Boom!!! Called it. I was the third person to post in your initial thread and first to suggest a trainer (yes, I want a cookie! Chocolate chip, please). \n\nAwesome news. Didn't think I'd be right the way stuff turns out on this sub but I'm glad I was. ",
            "I like to hear good news for a change.",
            "Haha that's so fantastic. I just went through a bunch of my trainer's and my messages and Jesus Christ if you didn't know he was my trainer it would be so suspicious. ",
            "The hive mind was right about it not being cheating!?  \nWOOHOO!  \nSeriously good for you. I am glad everything was ok.",
            "Glad it's all good! Win-win for both of you!",
            "Did she laugh when she reread her texts?  :)",
            "She apologised to you, but have you apologised to her? You suspected the woman you love of cheating, snooped on her phone, and posted on reddit before talking to her. A bunch of flowers and a \"sorry I was a paranoid idiot\" would go a long way here. If you were my partner, I'd be very hurt.",
            "[deleted]",
            "I'm glad it means nothing, but come on... \"I told you I was going to brutalize you.\"\n\nThat's a poor choice of words.",
            "It's so nice to see a positive end to a post on here for a change, so happy for you :)",
            "It's nice to see one of these where the person wasn't cheating.",
            "She ain't cheating, AND she's cooking up a nice gym booty to play with. Win!",
            "Finally someone who isn't cheating.",
            "I don't know any personal trainers so I'm not sure how they typically talk but seriously who words it as \"I told you I was going to brutalize you\", surely there are one or two better ways to word this that could make this seem WAY LESS inappropriate.",
            "Why would she have his number and text him? Is that normal? Because it's not where I'm from. ",
            "I hope I never saw another post regarding your wife and the gym guy again and you know why ....\n\nFingers crossed that this was it ! :) Wishing both of you best of luck in life ! ",
            "From seeing the original post is seems very clear that jeff is her personal trainer, and that she is getting good results and enjoying her time with him. \n\nI wish you good luck and hope you work out as well. ",
            "See you I'm six months :)",
            "Happy for you, champ :)",
            "I'm so happy this was the case. I feel relieved for you. ",
            "Thank god you got some closure. Reddit will sleep soundly tonight. For once.",
            "Wait what???",
            "Yes the green was there so easy.  It can be done so it did...",
            "Awesome update, so happy for you ! :)",
            "Every once and a while you will get an update like this which makes you smile. I smiled a little and I am glad everything worked out for the best. ",
            "Yey this is a wonderful update!",
            "You know you must do now.\n\nDelete Facebook\n\nLawyer Up\n\nHit the Trainer\n\nwait no, all is fine. I'm not use to this in /r/relationships.",
            "I'm happy one of these turned out to be nothing. Typically when people come to this sub to ask if their spouse is cheating, they already know the answer deep down and 99% of the time their suspicions are eventually confirmed.",
            "Yay for happy endings.",
            "Lol this is adorable. Glad this turned out to be a comic misunderstanding and nothing more!\n\nI'm going back and reading texts/emails from my personal trainer and I'm thinking, fuck, if his fiancée were the jealous type (and not a trainer herself!) she could easily misread these! We talk about my butt a lot. And recently my groin and inner thighs were very sore, too...",
            "Just an insight - it's actually pretty common for the satisfaction of talking about a goal to be JUST enough that you won't actually finish it, so she's being pretty smart by keeping things to herself until she's really gotten somewhere with it. Glad to hear it's just a trainer =]",
            "Dumb ass",
            "Never have I been so happy to be wrong.  Good on you for not just reacting.",
            "when you say \"WAS a personal trainer\" does that mean he is not her personal trainer any more?",
            "Makes me happy when I see a suspicious cheating post and it was all ok in the end. To many bad cheating posts on here.",
            "so glad to hear it worked out! congrats man",
            "Good on you and your wife OP. Glad to see one of these have a good explanation.",
            "Faith in humanity has been restored.",
            "I guarantee she's fucking the personal trainer, lol. They make all kinds of excuses for poor female behavior here.  But keep telling yourself ignorance is bliss.",
            "[deleted]",
            "I'd still be pretty apprehensive about my wife texting her personal trainer. ",
            "[deleted]",
            "I think there is still some room to be concerned here. She really should have felt comfortable telling you about the trainer earlier.",
            "Be wary of jeff though",
            "[deleted]",
            "Recently I started working out with a female personal trainer (I'm male) and I've told about 20 people already.  I find it odd she never mentioned this to you about when she started seeing him.  Anyone else with me here? "
        ]
    },
    {
        "post_id": "46xing",
        "author": "WalloryMeiss",
        "title": "UPDATE: Me a [25F] med student with my non-medical BF [26M] who won't stop asking questions",
        "url": "https://www.reddit.com/r/relationships/comments/46xing/update_me_a_25f_med_student_with_my_nonmedical_bf/",
        "score": 2256,
        "num_comments": 323,
        "created_utc": 1456091810.0,
        "selftext": "[Original here](https://www.reddit.com/r/relationships/comments/46u765/me_a_25f_med_student_with_my_nonmedical_bf_26m/)\n\nHOLY JEEPERS that escalated quickly!!!\n\nI've never broken up with anyone before. I've been dumped or parted ways mutually but ... I summoned up all my courage and called BF to meet up. \n\nTo those of you who warned me to be prepared for gaslighting...you were spot-on. Thank you for the warning.\n\nI told him I was tired of being pimped at home, tired of arguing about whether it was appropriate for him to pimp me at home, and that I'd spent far too much time fighting him over the issue. I told him while the questions were annoying as all hell, the fact that I'd repeatedly explained to him that it was stressful for me yet he continually disregarded that and tried to shame me into doubting myself was the bigger problem, and that his lack of respect for my comfort was a dealbreaker.\n\nHe informed me that:\n\n1. He knew this was coming because I've always been an intellectual snob and his family had warned him about me from day 1.\n\n2. He'd been wanting to dump me for months but he knew I needed his support throughout med school so he couldn't leave. Because he's a good guy and he would have felt so bad abandoning me.\n\n3. Everyone in medicine either suffers from narcissism, autism, or OCD, so he's glad he doesn't have to interact with me or any of my friends anymore.\n\n4. Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\n5. He wishes me luck dying alone and becoming one of those sad lonely old lady doctors who has to resort to banging my residents for sexual relief.\n\nMy mind is fucking blown. I went home and cried and threw up. What the fuck piece of shit did I fall in love with???? I've never seen that side of him. I'd seen anger but not .... that. I don't know guys. I'm overwhelmed. I really thought when I posted the original question that there'd be more of a debate. Like expected some people to say oh he's just curious it's innocent, and expected to find some people be like tell this dude to STFU. I was really blown away by all of you being able to identify and verbalize and validate what had been feeling so goddamn confusing and shitty over here.\n\nHasn't been the most productive study day, but I'm going to go try and get some work done and at least enjoy the peace and quiet.   \n\n**tl;dr**: Bf way more insecure than I imagined possible. Peaced out. **THX REDDIT <3 <3 <3**",
        "permalink": "/r/relationships/comments/46xing/update_me_a_25f_med_student_with_my_nonmedical_bf/",
        "comments": [
            "His words are nothing but jealousy. He's angry that you're able to cut it in med school and he couldn't. Don't let it hurt you. ",
            "[removed]",
            "> Hasn't been the most productive study day\n\nYou got rid of him, I'd call that a very productive day ;)",
            "[deleted]",
            ">Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\nLawyer here, um… those statements are backwards. Sorry you had to deal with some asshole that lives in bizarro world. It's people like him that make me hate the profession sometimes. ",
            "Sorry you got yelled at he's peanut butter and jealous ",
            "All of the just REEKS of negging. He's trying to get you to need his validation and prove him wrong. Do not back down from this. You did a good thing dumping this guy and you're going to meet someone awesome when you're ready! ",
            ">Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\n\"This person is having heart attack. FOR THE LOVE OF GOD, IS THERE A LAWYER ON THE PLANE? WE NEED TO BEGIN LITIGATING THE AIRLINE FOR SERVING UNHEALTHY FOOD!!!\"\n\n\"Step back, I'm a doctor and can save his life\"\n\n\"FUCK OFF YOU DUMB DOCTOR, WE'RE TRYING TO START WRITING A SUBPOENA FOR THE MENUS!!!\"",
            "Lmao, I'm pretty sure law school grads have been having a hard time finding a job in recent years; man what a clown.",
            "Your efficiency is really impressive and will probably serve you well in med school. Way to cut out the dead weight before a busy work week. \n\nSo, obviously, he was just saying everything he could to hurt you, but he can't be serious about lawyers having it so good. Is he aware of the market for lawyers rights now? Especially ones like him, who make shitty, illogical arguments?",
            "My brother is a lawyer. When I asked him \"why not a doctor\" he said, \"Lawyers don't have top be anywhere near as smart.\" He laughed and went back to his scotch. ",
            "[deleted]",
            "[deleted]",
            "LOL on his point 4. The legal profession is in absolute SHAMBLES following the recession, and unless he's going to a T1 school, he's likely fucked. From an employment standpoint, Doctor >> Lawyer.\n\nSource: Am Lawyer. Am considering going back for a decade of school to become doctor (I have a medicine-friendly major from college).\n\nGlad you are free, he sounds HORRIBLE.",
            "Wow. What an absolute twatwaffle he was to you. Don't look back girl, you run. You run far, far away. \n\nOh, and you know what the best revenge against insecure manbabies who don't like that their girlfriend can cut it in med school and they can't? You know, the kind who need to put said girlfriend down because being dumped feeds into that raging insecurity?\n\nYou go out there and be the best and most succesful doctor you can be. ",
            "Yikes... as a one time pre-med who gave up on the dream somewhere around o chem, I often wonder if I could have turned into a person like this. Admitting that you just didn't have the stuff to cut it in the big leagues fucking sucks, and a lot of people just can't accept it and turn their anger and disappointment outward, like your ex did. I don't think I need to tell you this, but everything he said is projection and is extremely telling of how he feels about his own position in life right now. \n\n\nYou're infinitely better off without this person in your life.",
            "> He knew this was coming because I've always been an intellectual snob and his family had warned him about me from day 1.\n\n\"I've been thinking about medical shit all day. I don't want to think right now. I just want to veg out.\"\n\nWow, what a snob, amirite?\n\n> He'd been wanting to dump me for months but he knew I needed his support throughout med school so he couldn't leave. \n\nI guess \"supporting you through med school\" means \"pretending he is med school.\"\n\n> Everyone in medicine either suffers from narcissism, autism, or OCD, so he's glad he doesn't have to interact with me or any of my friends anymore.\n\nSo is he planning on going back to med school after he gets his narcissism certification? Because it looks like he's gunning for one.\n\n> Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\nOkay, even if Watson comes online in hospitals everywhere *tomorrow*, Watson's a diagnostic tool. He knows that we still need doctors for the actual \"treating people\" part, right? And \"double-checking to make sure the AI didn't make a mistake\"? Watson is not going to be performing surgery anytime soon, nor is it intended to do anything of the sort.\n\nEven if we unlock immortality, people will always have accidents or be getting sick. Doctors will be needed for a long time to come. Lawyers on the other hand will only be needed so long as no one comes up with a better justice system.\n\n> He wishes me luck dying alone and becoming one of those sad lonely old lady doctors who has to resort to banging my residents for sexual relief.\n\nLolling forever.",
            "What an amazing piece of trash. This is a great day for you, you've managed to dump this literal garbage.",
            "This guy is every negative lawyer stereotype out there.  As a wannabe lawyer, please, let me apologize.  Take pride in the fact that you can get a job any time, anywhere.  He is reliant on his stepdaddy to provide him a living.  ",
            "That is a classic example of a bloated fragile ego.\n\nThis man is only happy if he's feeling superior to everyone around him.\n\nHe's the one who will end up unhappy. I've seen this many times in my 40 years.\n\nThese guys social circles gets smaller and smaller because they can't stand to be anything but coddled and stroked. \n\n\n\n",
            "Wooow. What a bitter little man....",
            ">I told him I was tired of being pimped at home, tired of arguing about whether it was appropriate for him to pimp me at home, and that I'd spent far too much time fighting him over the issue.  \n\nFor those of us that didnt read the original, I thought this post was going in a much different direction.",
            "Dude is so jelly he's a gigantic jar of Smuckers ",
            "You're amazing and this loser went for a cheap shot at the end as he knows he'll never get any better than you. \n\nMy fiancé and I are both physicists. We went to the same University. I love physics, my dream was to be an astronaut, but I had to let that go when I became ill. Through laziness and circumstances, I scraped a 2:1. My SO got a first with flying colours. I am now in engineering, while he continues on in physics, my beloved subject. He will probably get a job within the field, I probably won't.\n\nI AM SO HAPPY FOR HIM. I wish wish wish things had been different, but I don't resent him for the way my path turned out. When we talk about physics, it's an equal(ish) discussion. It's interesting, and I enjoy learning from him and debating WITH him. I can use google, I often check my facts if he says something I don't understand.\n\nOne day, you'll find someone like this. Until then, enjoy your off days, you deserve them.",
            "maybe some day he'll walk into your... I dunno, clinic or ER or whatever.... talking about how it hurts REAL BAD when he pees, and then you'll get to tell him he has a new strain of gonorrhea that nobody has ever seen before. Then you'll have to call the CDC and they'll put him in quarantine like they did in that movie ET. And then once a week you can go look at him through his tent and wave at him, or maybe flip him The Bird.\n\nYou hang in there, Doc. One day that a-hole will be but a distant memory and a story relegated to Tales From When You Were In Med School. ",
            "> He wishes me luck dying alone and becoming one of those sad lonely old lady doctors who has to resort to banging my residents for sexual relief.\n\nI know you are upset now, but when you are less upset, please revisit his list, especially this one, and laugh your ass off.",
            "Oh man, I'm getting flashbacks to my very own pre-law ex-boyfriend. He broke up with me, then proceeded to pop Ambien and call/text me for 7-8 *months* afterward to tell me how much he missed me. The goal being, of course, to forget everything the next day while I had to live with the uncertainty and rejection.\n\nHere's some schadenfreude for you though. About 6 years later, he contacted me to ask me to write a letter of recommendation for him to the board because he had committed some petty crime in his youth and needed some letters saying it wouldn't have an effect on his ability to practice law effectively. Yep, that's right. He apparently had no other recourse but to ask me, his ex-girlfriend from 6 years ago, for a glowing report of his upstanding moral character.\n\nIt was the most satisfying \"no\" of my life. You'll likely get a similar one soon :)",
            "> Hasn't been the most productive study day\n\nBut this was a HUGELY productive LIFE day. You got rid of the jerk who made you question yourself and treated you horribly, then proceeded to show you he was 1000x more awful than you originally suspected. \n\n\nLife can only get better now.  All the best, OP.",
            "I've read all of your comments and I have no advice. I just want to say you sound like the kind of person that SHOULD be a doctor. Humble, bright, empathetic, all around has your shit together. I'm impressed with how you're handling things. Being a doctor is hard. Being a patient is hard too, and you'll make it easier for someone. Thank you. ",
            "Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\nThis is particularly hilarious. The discovery process is one of the most easily automated, and is a direct threat to the livelihoods of many lawyers. He doesn't know what he's talking about.",
            "> He wishes me luck dying alone\n\nGotta love that line after a break-up that makes you prefer dying alone than with the person you broke up with",
            "Sooooo...he's a lawyer, lawyers are smarter than doctors, but YOU'RE the intellectual snob?\n\nFFS, you need to go out and get yourself something celebratory to eat/drink and indulge.  You made the correct decision, even thought it was a painful one.  He's a douchenozzle and you're well shut of him.\n\n(Oh, and my Dad is a doctor.  All of the \"lady doctors\" he worked with were married, so I have no fucking idea what he's talking about.)",
            "So uh...where are all these sad lonely lady doctors?  Totally asking for a friend ;)\n\nSeriously...you saved yourself years of therapy by getting rid of this guy",
            "I'd like to point out that his \"rationalizations\" (1-5) are a truckload of steaming bullshit. It says a hell of a lot more about him than you. (I scoffed on your behalf through the ridiculous list.)\n\nCarry on being a BAMF. You don't need him or his stinky emotional baggage.",
            "Great, this world really needs another asshole lawyer.",
            "you have just dodged a nuclear bomb. ",
            "Number 2 made me laugh and number 4 made he picture him when he's older and an ache just don't go away or he's seriously injured... Where's he gonna go? To a doctor. ",
            "He sounds jealous and insecure. Jealousy is sure a green eyed monster. \n\n",
            "> Everyone in medicine either suffers from narcissism, autism, or OCD\n\nIf anyone's a narcissist, it's him.",
            "He sounds super jealous and like he's trying to make you question everything you know to make you feel like you know nothing. He wants you to doubt your success because he doubts his own. Trying to drag you down to his level. Gross.",
            "Right decision, but you missed the opportunity to spam him with legal trivia questions before breaking up.\n\n\nDon't take anything he says to heart, and remember that living well is the best revenge.",
            "From a medical student to a medical student: My goodness, what a douche he is being!\n\nI have had a couple of (bad) friends in the past who are jealous of me doing medicine, and so say things like your boyfriend said:\n \"everyone in medicine is XYZbadthing anyway\", \n\n\"*My* subject is technically harder, why do medics get all the attention?!?!\", \n\n\"Doctors/med students are so shit because they didn't catch my very non-descript illness early enough, explain *why*\" \n\n\"Why is this cure-all quack treatment not on the market. BIG PHARMA. CORRUPT DOCTORS.\"\n\nAnd my personal favourite, coming from a vet student when she found out med students got discount at a club and she didn't, \"A vet is surely more likely to be able to help a person who has passed out and unable to talk\".\n\nIt happens all your life, because people are jealous and think we're getting special treatment. You don't need it constantly from a boyfriend. Did you break up/are you going to? If you do, you're getting out lucky. He should be happy for you, not belittling you.\n\nEspecially considering we get this questioning shit day to day from our seniors and we already sometimes go home feeling small. You need down time and someone who will just listen to your rants about the doctors who make you feel bad and respond with a sympathetic ear/a beer/a shot.\n\nHope you feel ok- smash it! You're worth more than him, he's trying to hurt you to make you feel bad but really, you're going to have a successful career and he's just going to be permanently bitter that he didn't drive himself well enough to do the pre-med classes he needed to do. Not an attractive quality.\n\nEdit: also, I *love* your username!",
            "He couldn't hack med school and you can.  He needs to believe that he is better than you and will justify his failure by bringing you down.  Pretty pathetic really.  ",
            "Just to add some perspective from the man side of things.  This guy is a complete and total jackass!!\n\nMy wife is in med school currently.  I actually have a very established career and am the primary earner in the household.  Even still I recognize how difficult med school is and I support her in every single way I possibly can.  I take care of the dogs, run all the life errands that need to get down, and take care of most of the house chores.  Because that is what a supportive SO does for the one they love when they are trying to achieve something that is very difficult, stressful and taxing.  You don't add to the burden, you take away from it.  \n\nI'm sorry you found such an insecure person with obvious pent up resentment towards you because your success made him feel inferior.  You are better off without that weight dragging you down and don't worry, a truly supportive loving person is out there for you.  You are going to be too busy to look so don't try, but keep your eyes open for when they may appear.  Good luck!",
            "Remember when in school guys would be like \"aw go out with me\" and if you said no they'd be like \"WELL I DON'T WANT TO GO OUT WITH YOU ANYWAY, YOU'RE UGLY\" It's the same shit. He is hurt that you told him bye and so said a bunch of things to try hurt you back. LOL, he's so jealous of you and it's so obvious! Glad you got out when you did!",
            "You have survived the insecure male ego going through defense mode. Congratulations! He is a cruel, small, and selfish person, and good riddance to him. With the way he'd spoken to you before, it's no surprise that he tried to turn around the breakup in his favor. \n\nEnjoy no contact with him, and finishing out med school. Good luck with school!",
            "Law student reporting in: Don't worry, both of our jobs will be replaced by computers soon enough :P Your ex was just in denial. ",
            "\"Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\"\n\nSooooo not true...in the US, there is a huge physician shortage.  You will never be without a job... ever!  Lawyers are a dime a fucking dozen.  My sister is a law grad, passed her Bar exam on the first try any she was working at a fucking tanning salon after law school until she found a job that paid $45,000 year at a non-profit organization.  Your EX-boyfriend is an insecure bag of dicks... you deserve to be with someone who is proud of what you do, not someone who is obviously jealous of you.  \n\nI am a nurse practitioner and really felt for you when I read your original story, by the way.  I get shitloads of medical questions from all of my friends, and I get so tired of the \"well shouldn't you know this?\" if I don't know the answer to a realize obscure  piece of medical knowledge that even a specialist would have to look up. \n\nAnyway, best of luck to you.  Now is your chance to find someone better, who appreciates you and celebrates your successes with you.",
            "I had to \"break-up\" with a friend not too long ago because of these same reasons. I realized he was narcissist and it was becoming a one-sided friendship. Even though I had come to realize this guy was an a-hole, it still left part of my life empty, almost missing the relationship. He tried to reconnect a few times but I knew better. It's one of those bitter-sweet situations. \n\nNow you can focus on yourself, and find someone who appreciates and respects you and your decisions. ",
            "#1 trait of Narcissists is never admitting they are in the wrong and blaming others when they try to point it out. Dude's a fuck.",
            "Happy for you that it's over! He had one thing right--you do need support through medical school, which he clearly wasn't providing! What, was he going to wait and dump you during the walk-in-a-park residency?? You're going to be so much better off on your own and maybe finding someone better someday. Go you!",
            "I'm experiencing formatting problems, so please be a bit forgiving. I took a while to think of what to respond, and came out with a long statement. I mean well, though. \n\n\nDon't waste another second's thought on this loser. Yes, that's what he is, a loser. I usually don't take the judgemental route, but it's right there, for all to see. He's jealous, because lawyers tend to have a bad stigma attached to them, while doctors spend their days saving lives. If it's ok, I'm going to have some fun dissecting his little temper tantrum.\n\n\n1.      He's jealous of your intelligence, girth of knowledge, and ability to use reason and method to prove a point or get work done. His family warned him that you were too smart for him, and that he likely couldn't keep up with you. In order to deal with that, he tried to dumb you down to his level, or try to learn small bits of what you spent a lot of time researching, in order to sound on your level. Second graders do that. \n\n2.      Any guy that refers to himself as a \"good guy/nice guy\" really isn't. They're just trying to convince themselves and the world around them that they have something of value to offer. These types usually have a massive ego and/or sense of entitlement, and end up with nothing to show for it in the end. If he really was amazing, he would have dumped you. He was trying to prove that you needed him, in order to convince himself of his own value. However, you became successful and retained your independence. This made him furious, because he couldn't \"save\" you, or make you look like a project that needed fixing. I've seen people in relationships act like this. He tries to make himself look like a hero in his own mind, in order to satisfy his own delusions of grandeur/hero complex/narcissism.\n\n3.      He's trying to justify the fact that his friends and colleagues are beginning to see him for what he truly is, and distancing themselves from him. It's noted that lawyers and corporate-types high in seniority tend to be the ones to suffer from alpha complexes and narcissism. It's the trait that makes them so successful. However, doctors tend to remain steadfast, professional, and hard working.\n\n4.     Both law school and medical school are likely very hard. However, both are trades, and are important to society as a whole. The difference is that lawyers are kind of a necessary evil. Many start with good intentions, but end up doing more harm than good. Being a good lawyer really means knowing how to argue the law in order to get a desired result, in order to give the client what they want. This isn't always the right thing, and not always the wrong thing. With doctors, their calling,  because that's what it is, a calling, is to save lives, and make a difference in thousands, if not millions of lives a year. If society was falling apart, doctors will be called on way before lawyers. \n\n5.     You can tell that he doesn't think much of you. He showed his hand in a big way, here. This is proof that you not being in the relationship is the right thing to do. The thing is, he's very wrong, and I'll tell you why. Doctors/nurses will always have a steady income, large intelligence, a strong will, dedication, large IQ, and often, a very pretty face/attractive look in scrubs. 9/10 guys I know would instantly go on a date with a female doctor/nurse at the mere mention, never even having met the person. I promise, you'll have tons of options, and will be saving tons of time and cash by keeping that needy, childish loser out of your life. \n\n     Keep working hard, staying strong, and saving lives. Keep the loser out of your thoughts, and do great things. Your value isn't defined by him, but by yourself and your actions. I'm not going to wish you luck, because I feel like you've likely got the tools to turn thought into action, which doesn't require luck. Enjoy life, be happy. ",
            "Wow. Every female attending I've worked with has been single and jonesing to bone every resident in sight due to her sheer overpowering loneliness, your ex is so smart! /s\n\nI'm sure it wasn't funny at the time, but your recap of your ex's horrible comments strike me as hilarious. What a pathetic dude. I agree with the people citing jealousy, he clearly couldn't handle dating a strong and smart lady. Eventually you'll find a partner that loves and respects you for the superpowered lady doc that you are, and it'll be super awesome.\n\nCongrats on cutting that tumor out. Nobody fucks with a med student's down time. Seriously he should be fined for turning your free time into stress time, that shit is *important* dammit! Best of luck to you!",
            "Well I have two comments\n\n1) I had to read your original post bc 'asking questions' didn't seem too awful-but holy cow-he was being a arrogant asshole-contantly making you defend yourself, and \n\n2) Im a lawyer and could not even begin to pass a freshman weed out course for med school.  Med school is so much harder than law school they shouldn't even be mentioned in the same sentence.",
            "> Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\nOn what planet?!?\n\nThere's a **glut** of lawyers right now. Has been for years. Law schools are now being sued by former students who owe a quarter million for a law degree they can't find a job with. Those that can even find a good law job hate their lives because being a lawyer sucks.\n\nMy university churned out tons of grads who went to law school. I personally know at least 15 people who studied law and, except for one guy who got into Harvard Law, all of them regret it. Most have not found law jobs even remotely related to their field. Six years on, they struggle to pay the bills. Those that actually got a lawyer job hate it. The Harvard guy got a good job he enjoys, but he's the outlier for sure.\n\nI got a job after college working for lawyers instead of going to law school right away, and that saved me. All my lawyer bosses practically forbade me becoming a lawyer and told me to run for the hills. Thank every deity above that I listened.\n\nMeanwhile, everyone I know who went into medicine is in demand: doctors, nurses, hell I have a friend who's a large animal vet and you'd think she was a celebrity with how she gets fought over for work.\n\ntl;dr: your ex is gonna have a bad time.",
            "He jelly. So transparently and pathetically insecure and jealous. How unattractive! Good riddance. ",
            "He could not even be more obvious that he just feels so inadequate because you're doing what he tried and failed to do. Instead of being happy for you and proud of you and thinking, wow, I'm lucky to have such a smart girlfriend who loves me, he started trying to convince himself that it's not true, it couldn't possibly be that you, a mere *female* is smarter and more capable than him. So he worked out this whole narrative in his head where actually people who go to med school are stupid, and that the only reason you got into med school anyway was somehow because of his support and etc etc etc. \n\nIt sounds like that jealousy and insecurity ate him up so badly it might have changed him for the worse. Or perhaps he always was an asshole, this just brought it out of him? Just feel secure knowing that you're awesome, did nothing wrong, and that this guy is just feeling shitty about himself and is sadly one of those people who tries to make themselves feel better by shitting on others. \n\n",
            "Glad to read that the surgery to remove that nasty tool asshole from your life was successful :)",
            "WOW. It sounds like he has some serious inferiority complex issues going on. You know how usually insecure people compare what they do to others and say it's better out of necessity to make themselves feel better because they're lacking several inches? Yeah, that's him. I am glad you are out of that relationship because it would've made you doubt yourself when that is the last thing you need. My heart goes out to you, as someone who is applying to med school. You can definitely find someone better.",
            "I hope you realize it's 100% because he feels he's failed. He realizes how much smarter you are than him (intellectual snob, cmon) and is intimidated, which is compounded by the fact that you are doing what he explicitly tried and couldn't do. He's jealous and childish.",
            "Lol omg be thinks law school is harder than med school? I went to law school and my husband went to med school- there's no comparison, my husband took the harder track. \n\nI'm sorry your boyfriend turned out to be a douche canoe.  Now you can focus on studying without his insecure dead weight dragging you down. And then in 5-9 years or so, laugh in his face with your sweet 6 figure salary.",
            "Listen, this asshole has cleared up so much more room for you to put towards school. He was a crab who wanted to drag you down back into the bucket because he couldn't make it. My fiancé is in med school but we build each other up. I understand if we can't talk for days and we trust each other completely. You are young and will find someone who makes you as much of a better person as you make them. ",
            "Holy shit. He clearly didn't respect you or the hard work that is required to get through med school. I know it isn't easy to go through, but you made all the right moves for you. Good on you for that. Much internet love and hugs to you.",
            "Looks like you just dodged a bullet there.",
            "I want to punch your ex in his face for you. His response really pissed me off and I don't even know you! Better die alone happily than depressed with a douchebag like that. You'll find someone who actually loves, respects and supports you one day, OP. I have no doubt. Good luck with med school!",
            "Well then. Someone's mad that someone in med school told him to give up because he was a failure. Well done for leaving that piece of shit. Proud of you, OP.",
            "I didn't see the original before I read this. All this talk of being \"pimped at home\" was rather worrying at first... :P",
            "Man, so sorry. What a piece of shit. Like seriously, he is a huge piece of crap. Don't even give that miserable excuse for a human being a second thought. It baffles me that someone could be that cruel to their girlfriend. I feel sorry for anyone who has to interact with him in the future. ",
            "You're going to be so much happier :)",
            "Delete Exercise. Add Facebook. Drink Heavily.",
            "What a piece of shit. ",
            "Imagine the surprise he is going to have when half of the people from his law school won't be able to find a job. Unless he goes to a top 15 program, he better hope he has some family with connections to firms. I wouldn't worry too much since I think he said all of those things out of insecurity. Your life will be better without him in it. Cheers",
            "Holy shit I'm so so so sorry he responded like that!",
            "He is studying to be a lawyer!? That, right there, was your first problem. So much sympathy! So many hugs! Never date (or marry) a legal operator has become one of my dating rules. I feel for you.",
            "holy moly ",
            "Wow. That's some next level insecurity and jealousy. You definitely do not need that, nor dererve it. It is entirely his issue, and the further away from his bullshit you are the better. Ugh, what a smug creep.\n",
            "He has some serious issues. You are a million times better off without him. You keep doing you.  You go girl!",
            "Good work!  I'm sorry it came to that.  It's probably going to hurt a bit nonetheless, but when it does, remember you're better than that, and now you're in a much better position to keep away from folks like that in the future. \n\nGood luck and kick ass :)",
            "Wow, he's so incredibly mad and furious at himself. He loathes you, because he sees his own failure to get into medical school reflected in you. He brings you down, so that he doesn't have to suffer alone and feels better knowing he can put you in place.\n\nI'm glad you sought confrontation, because if you had allowed this to go on, it could interfere with your career and worse. He has a lot of work cut out for him, because he will never find happiness unless he can let go of that rage. You on the other hand are headed to a great place. You're better off without this guy and you will find what you seek I'm sure.\n\nBest of luck!",
            "Wow, he's seriously jealous and insecure. I am so happy that you're out of that one. Keep away from this weirdo.",
            "Breakups bring a side out in people that we don't get to see very often. My ex turned into a monster, and it sounds like yours did too. I hope you come through this experience stronger for the ordeal. If you need someone to vent to, please send me a pm.",
            "My god does he show his true colors. He's ridiculously jealous that you made it in med school and he didn't. I could go on about what he said but what's the point? I think it's pretty clear you thankfully dodged a huge bullet. \n\nI know it's sad breaking up even when the guy (or girl) is a jerk but once you're over the initial pain, I think you'll feel so much better and hopefully less stressed.",
            "Wow, that's a whole vineyard of sour grapes this douchecanoe is peddling.\n\nLiving well is the best revenge, my friend. Move onwards and upwards.",
            "Dodged a loser there.",
            "I'm sure it's been said, but he ws completely insecure with himself after he got booted and you didn't.  he grew resentful at you because you were, in his mind, smarter and more capable then he is so, instead of bringing himself up to your level, he decided to try to bring you down to his to show how much better he was.  \n\nTypical bully behavior.  ",
            "He's just saying lies to convince himself that he was right. Deep down he knows he is shit and he just showed that side of him.",
            "Your ex-BF was a dick, good riddance. ",
            "I think you handled this exceptionally well. Good luck with medical school. ",
            "It's always shitty to break up, but clearly it needed to happen\n\nOn to the future OP :)",
            "This perhaps isn't helpful after hearing such a hurtful speech from someone you thought loved you, I'm sure it was awful. But I just want to say I'm genuinely just laughing at him for being such a fool, the things he has said are utterly ridiculous. I hope you can look at it that way soon!",
            "I don't want this to come off as being irreverent to your issues, but I got a good chuckle out of the 'lawyers are smarter than doctors' line. I love been in the legal field for 10+years, but God damn are doctors on another level.",
            "Holy crap talk about bullet dodged. ",
            "Sounds like a typical r/niceguys - as long as I get what I want it's fine. If you call me out on inappropriate behaviour, you're wrong and I'm nice. \n\nCongrats for being shot of the idiot and IMO doctors are way smarter than lawyers and trust me, I'm a lawyer!  ",
            "Ha.  What an asshole.  You should have thrown it in his face that he's a pathetic med school washout.",
            "Learn from this experience, take some time to think about your relationship from as objective a place as you can. Identify where you failed (yes it is important to take personal responsibility for the relationships you chose to keep) to identify red flags, shut down bad behavior, set boundaries, etc. \n\nThis isn't to say that you are the only one to blame for being in a bad relationships BUT it will help you answer the question:\n\n>What the fuck piece of shit did I fall in love with???? I've never seen that side of him.\n\nThe key to take away from this is that you have seen this side, you just did not know or did not have the tools or experience to identify what was happening. This is a particularly female issue, women are still very much pressured to make concessions, be nice, be understanding of the \"flawed\" men in our lives. Being a supportive partner who pushes growth is one thing, enabling a shit head to the detriment of your emotional health is another. \n\nRemind yourself that while this experience was not fun, it was valuable. ",
            "Odds of him making it big in a law firm that'll pay 200k+ and being a snobby lawyer who looks down on people? <1%. Chances of you making at least 100k and saving lives in the process? 100%!! Go get it!!! And fuck him. Don't classify all males to be so insecure about thier path in career. Career and relationship should not coordinate as a competition. ",
            "Please please don't see this as a defense of your ex bf. Sounds like he's got some major insecurities and you will definitely be better off without him. \n\nI just wanted to address what he said to you in a way that hopefully helps you dismiss it.   People who are hurting themself will often lash out and hurt back in the easiest way possible. There's ZERO validity to any of the 5 numbered points in that list. Do not for a second think that there's anything there that you need to look at in yourself, it's all bullshit shoveled in order to hurt you. ",
            "SMH, what a loser.  Each an every one of his points sound like an immature little boy throwing a fit and trying to come off as superior after learning he was being dumped -- though I guess, that's exactly what he is.  You've dodged a bullet, congrats!  Of course, sorry you had to go through that.  You're totally better off, though :)",
            "I had to log in to just make the note--he thinks Law School is \"so much harder than medical school\"--but he couldn't get into Medical school. I mean, c'mon.",
            "Good for you! Your life is about to take a turn for the better now that he's out of it!! Good luck on your bright future! ",
            "Sounds not just like jealousy, but he has very little self-esteem. I'm sure he's the type of person who gets angry if his spouse earns more than he does. \n\nI bet you'll find someone very nice and intelligent who *actually* supports you.",
            "Holy shit, thank god you got rid of him now.",
            "sounds like a clean tear for /u/wallorymeiss",
            "You are so much better off. Even if in this moments it's hard to see. Also, that feeling of \"who is this awful person and how did I ever love him\" is probably going to get worse before it gets better. As you let him go, you'll start thinking of all these things that reek of douchebag behaviour, and at the time you let it slide but now, it really grinds your gears. Hooray! ",
            "Hey, replying to a dead thread but I just want to say my wife is a resident in anesthesia right now and you should be REALLY GLAD you ripped this bandage off before starting your intern year.  If you think you don't want to fight and argue and deal with shit at home NOW, you'd have literally poked his eyes out with a hot fork during your intern year.  Seriously.  My wife wants me to cook dinner and put something good on the TV and shut the fuck up, and I do it, because she works 85 hours a week.",
            "I was with someone for 7 years before realizing he was also a gaslight and basically insane.\n\nHe would say I did things and behaved in ways that I knew I didn't, because they simply weren't things I did.\n\nSomething like: I always helped him find the best airline prices for his work trips, but he insisted I called him incessantly and tried to keep him from going on the trips. It was the equivalent of him trying to convince me that my eyes were green.\n\nHis gas lighting was quite poorly done so it would just infuriate him even more because I couldn't get upset. How can I get upset when he's saying such nonsense, right?\n\nGlad you're well :)",
            "Holy shit. Been an attorney for five years, and taken two bar exams. Law school is *not* harder than med school, and it's not really close. ",
            "Send him a link to that chatbot that fills out traffic ticket paperwork for you. That'll sure put him in his place.\n\nYou'll feel like Matt Damon from Good Will Hunting. \"How do you like them apples?\"",
            "I still don't understand what gaslighting means. What is it? Examples on Google searches aren't that great. ",
            "Whew - you are very fortunate to have found this out now instead of later!! \n\nYou take care and I wish you all the best in your life!\n\n\n*Nana internet hug*",
            "Aldo, op don't worry about finding someone.  Maybe not another physician though, two physician households are very tough, neither of you will have much time.",
            ">lawyers are smarter than doctors\n\nHow in the world did you keep a straight face when he said that?\n\nHe overlooked the fact that most people like doctors whereas I don't know anyone that likes lawyers. ",
            "It sounds like you've dodged a bullet - or maybe a cannonball. What a POS. It sounds like you're going no contact, and I hope you do. I'm glad you made the healthy choice for yourself, and that you cut him out when he showed his true colors.\n\nI can tell you know he's totally full of it, but as a lawyer, this part made me lol:\n\n> Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\nThis is absolutely hilarious bullshit. Seriously laughed out loud when I read it.\n\nLaw school is not harder than medical school. Law school might be harder than med school *for some people*, and vice versa. But it's just silly to say that an academic course of study that lasts three years (in the US), and where the third year is widely considered a joke, is harder than a four-year program followed by at least one residency. \n\nIt's also idiotic to say that lawyers are smarter than doctors. There are some lawyers who are smarter than some doctors, and some doctors who are smarter than some lawyers.\n\nFinally, the idea that \"he will always be needed but [you]'ll be replaced soon by Watson\"? Wrong to the point of deluded. All he'd need to do is spent 30 seconds googling \"legal job market\" to see plenty of doomsday predictions. The Bureau of Labor Statistics agrees, predicting that legal jobs will see about average growth (6%) through 2024, while jobs for physicians and surgeons will grow \"much faster than average\" (14%) over the same time period.\n\nFinally, pairing this:\n\n>He informed me that ... I've always been an intellectual snob  \n\nwith this?\n\n> Law school is harder than medical school, lawyers are smarter than doctors\n\nLol. Again, speaking as a lawyer, guys like him are where lawyer jokes come from.",
            ">To those of you who warned me to be prepared for gaslighting...you were spot-on. Thank you for the warning.\n\nOnce again, **this is not gaslighting**.  Gaslighting is so much worse than anything happening in this post, and when you use it as a fancy way to say \"lying\", you degrade the meaning.\n\nAt this point it's almost a losing battle.  People in this sub like buzzwords too much, and actual real life gaslighting just doesn't come along often enough to satisfy their need to use the word.\n\nIt's unfortunate that when someone comes for help trying to deal with actual gaslighting, the word won't have the gravity it deserves.",
            "Consider yourself lucky!\n\nGood luck in Med School!",
            "The worst part is that his shitty, shitty behavior causes you to seriously question yourself.  How did you end up with this asshole?  What did you overlook?  Were there signs?\n\nIt causes you to be super vigilant when you finally get out there again. Scary, right?  \n\nYou sound like a smart, funny person who is handling this all well.  I'm sure you will land on your feet.  Good luck, OP.",
            "haha if he's lucky, he'll be an ambulance chaser.  Law is hard and lawyers are a dime a dozen.",
            "Really sorry you had to deal with all that. It's so clear that your ex is trying to rationalize away his own failure to get into med school, and a good person doesn't say that kind of shit during a breakup. Don't be surprised if he reaches out to you again. ",
            "Sounds like your typical loser who thinks attending law school makes them a genius. ",
            "Aww don't feel bad :(\n\nThis is just one of those things young women have to go through to calibrate our bullshit meters. By the time you're 30, you'll be able to spot creeps at 50 paces!",
            "Hahahaha, lawyers have largely been replaced with fill-in-the-blank forms you can order online or pick up at Staples.\n\nHey, if he's lucky maybe he can find success opening one of those $249 Divorce \"Spouse Signature Not Required\" centers.  But probably not, because those places come and go frequently--seems there's not enough demand to keep 'em around as a permanent fixture.",
            "He wishes me luck dying alone and becoming one of those sad lonely old lady doctors who has to resort to banging my residents for sexual relief.\n\nIf I change the words 'sad and lonely' with 'sexy and luscious' and 'resort' to 'is so hot she can't avoid' and you're living out my fantasy. ",
            "Wow he is such a nice guy. \nI bet all of his crazy just hit you in the head like a rock eh? It sound like he felt inferior to you and was constantly trying to make you look/feel bad or like you were crap because you don't want to look into medical stuff all the time. I hope you find someone awesome in the future OP",
            "A+ username. \n\nI'm a med student married to a lawyer (an incredibly smart and talented lawyer who works his ass off). He just watched me take Step 1, and he'd be very happy to refute point 4 for you. \n\nKind, intelligent people fall for assholes ALL THE TIME, because the more adept assholes are good at sucking you in by revealing their assholish ways slowly, and kind people give them the benefit of the doubt. ",
            "Well I'm glad he's a med school failure because his bedside manner would have been fucking atrocious.\n\nHe's a jealous shithead who could never do the marvellous work you are doing. Be proud of yourself for what you're doing academically and what you've achieved personally. He's just a turd you wiped off your boot and kept walking. xo",
            "Sour grapes. You're breaking up with him? Oh, it's fine because he didn't want to be with you anyway. Can't get into med school? Whatever, doctors are stupid anyway. Restaurant doesn't have coke? Actually, Pepsi is better everyone knows that. He's pathetic. I hope you can see that. ",
            "WOW. What an insecure little asshole. My guess is he'll be the one living alone due to all that bitterness (God forbid he never passes the bar, lol). He's just infected, damaged tissue, and required debridement from your life. \n\nGood for you though. Keep kicking ass in med school, and enjoy the relief and peace of not having to carry his baggage around (and not having someone constantly trying to undermine you).  Now you're free to move on, and when you're ready, to settle for nothing less than someone who mutually respects, encourages, and appreciates you. ",
            "Lawyers are smarter than doctors. Lol",
            "Jfc I'm the same age as you and my BF is in medical school. I couldn't fathom doing this like I know the levels of stress he's under at school/the hospital so why would any sane person do this??? You've definitely made the right choice, OP. Furthermore, yes you're lucky to be in medical school but your abilities are what got you there. Don't discount that! Good luck and I know you'll find a partner who actually loves and supports you! ",
            "My husband is an M4 and we started dating right before he started med school. Dating and marrying a med student is *brutal*. It's really, really hard. You hate to be totally understanding of the demand (it took me a while to get there) and be willing to give up everything for a life with a med student/resident/attending. \n\nWith that in mind, this guy sucks. Even if you didn't break up with him now, you would have soon. Dating a med student is crushingly painful and you have to be committed. He wasn't. At all. Thank your lucky stars you're out of this before the next big obligation, whether that means Step 1, Step 2, the PE (assuming you're a US med student...), or whatever that he's gone gone gone. Med school will keep you busy. You don't need him. ",
            "Congratulations on being rid of that jealous asshole.",
            "Fuck him, go finish med school and then go find yourself another doctor! ;) (or not, if that's not your thing) ",
            "Narcissists do not take rejection well. You bruised his ego by dumping him, so he tried to put you down worse. Be glad he is out of your life.",
            "He was angry, upset and jealous. We all say things we don't mean when we're overrun with tons of emotion (Although usually not to that degree). Trust me, he doesn't mean any of it and will regret saying it... At some point. Forget about him and move on with your life. ",
            "This guy sounds like a real piece of work. Good thing you bailed when you did.",
            "Maaaan that was so childish and Lame of him. Why would you cry he said nothing substantial in that exit rant! He basically just tried to shit on your accomplishments and hurt you in such a feeble way. And it wasn't even good. Yeah it's all jealousy like wow,  you're better off without him obviously ",
            "Keep in mind, this is after the break up. She was going to do it whether he said all of this or not. \n\nI'm not even saying the guy isn't an ass. I just think it's incredibly stupid to break up with someone over questions. ",
            "Sorry to hear about that. You will eventually run into someone who is at the same level of intelligence and whom cares for you vs. tolerates your existence. You don't need that stress. Good luck from a fellow OMS-II.",
            "Oh man, his comment number 4. You're in med school. You're going to be a doctor. You ARE going to get a job after school. The field of law is over-saturated with lawyers, he will be much more likely to not get a job. Sucks to be him.\n\nDon't worry, when this is all over you'll have a great job, be able to help people, and more than likely be in a relationship with a man who isn't full of hate.",
            "I think that was the conversational equivalent of a bad acid trip. It would be an understatement to say that this is a seriously disturbed and delusional individual. So glad you got out of there and are not having to deal with that any more. Hope you are doing well and enjoying your chosen medical field :)",
            "> Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\nloooooool what? This guy is not only a nasty piece of work, but also lives in cloud cuckoo land. ",
            "Good for you Mallor...err Wallory!\n\nBest of luck in med school.",
            "Sorry about your situation. Third year medical student here so I can relate to some of the stress you are facing. career choice debate aside(lawyers have a 50% unemployment rate when they graduate lol), he sounds very insecure and childish. If he doesn't like you for how smart you are then he's probably not right for you in the first place. Better now than when you get marry. \n\nPS: love your name, hope you didn't get mallory weiss from throwing up :D",
            "Dat projection doe.\n\nSeriously though aside from being a general douche bag his bitterness on failing out of med school is so loud.",
            ">4. Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\n\nPAHAHA. Am current law student. Am dating med student. We argue all the time over which is harder. I say med school is harder. He says law school is harder.\n\nThis isn't a contest. Who cares which is \"harder\"? (Plot twist: I'm right. Med school sounds scary af.) And I don't see Watson replacing Lawyers or Doctors any time soon.\n\nIn any case, I'm glad you're free of him. He sounds like a toolbag. I don't know what year you are, but good luck! I'm rooting for you!",
            "It's hilarious that he thinks lawyers are somehow more employable and will earn more than physicians, who earn easily twice as much as lawyers but more like 4x or 5x.",
            "Wow what a douche bag. I have a theory that this is exactly why do many doctors end up marrying doctors, they're the only ones who understand the type of strain caring for so many sick people puts on you. Work stays at work, home time is for mariokart",
            "\"WalloryMeiss\" - I see what you did there :P",
            "> 4.Law school is harder than medical school, lawyers are smarter than doctors, and he will always be needed but I'll be replaced soon by Watson.\n\nHAHAHAHAHAHAHAHAHAHAHHAHAHAHAA\n\nThat's fucking hilarious. I'm a recent LS grad (commented on your first post too) and law school is not that fucking hard. It's hard for the first semester, when no one knows WTF they are doing and there's a ton of pressure the month before finals but other than that it's easy as fuck. This guy is such a prick.\n\nETA: not to mention the legal field is struggling SUPER HARD right now and went through an enormous bubble burst in 08-09. There's a HUGE oversupply of attorneys compared to the # of JD-required jobs out there. \n\nOP, I'm sorry that your boyfriend is such an ass, but I'm glad you found out and dumped him. Everything he said is a total lie, and I hope you know that. He was only saying it to try to make you feel bad about yourself. What a fucking jerk...you're so much better off without him.",
            "I'm going to be honest with you and not say anything to make you feel better. It won't get better, once you start residency it will only get worse. You will have very limited free time, you will always be tired. It will affect your relationships poorly. It's pretty difficult to build a meaningful relationship like that, it takes a lot more work and a partner who is in it in for the long haul. Get used to things sucking for awhile. You'll hear this from most every medical resident who is in the dating field. ",
            "This seemed like a really stupid reason to break up honestly. "
        ]
    }
]