[
    {
        "post_id": "4fzp6t",
        "author": "th0wing",
        "title": "(Update) I [23F] just met my boyfriend's [26M] family and realized I slept with his brother [20'sM] last year.",
        "url": "https://www.reddit.com/r/relationships/comments/4fzp6t/update_i_23f_just_met_my_boyfriends_26m_family/",
        "score": 2249,
        "num_comments": 145,
        "created_utc": 1461348488.0,
        "selftext": "[Here is my last post](https://www.reddit.com/r/relationships/comments/4fu74o/i_23f_just_met_my_boyfriends_26m_family_and/)\n\nSo I already wrote a short update in the comments of my previous post but I thought I would do a new post since it's probably easier to follow.\n\nI knew that I had to tell Eric about what happened. He told me to come by his place after work to order in food and watch the taping of Survivor from Wednesday night (lol don't judge us!). I got there at around 6 and he asked if I wanted Chinese, pizza or Thai but I told him we needed to talk first before carrying on with our night.\n\nI sat him down and explained to him that I loved meeting his family yesterday but I needed to tell him something. I explained that year, before I met him, I met his brother at a bar and we had a one night stand. I told him we never exchanged numbers, don't have each other on social media and never saw each other again until last night. I made sure to tell him that I didn't want to bring it up yesterday since it was his birthday and all, but he had a right to know and I understand if this is something that makes him uncomfortable. \n\nHe looked pretty surprised and was kind of quiet for a few minutes. He then said I must have felt a little awkward yesterday but I definitely didn't show it, to which he thanked me for. I asked him what his thoughts were and he said \"well, I'm not going to lie and say that this isn't weird, but it's not exactly a deal breaker. I just need some time to think.\" I told him that I would give him some space tonight and he agreed and thanked me for being honest.\n\nI left and we didn't talk for the rest of the night. He did take it better than I thought he would but I for sure thought that this would end things between the two of us, especially with the silence. We both had the day off work today and he called me this morning shortly after I woke up and asked if he could come over. He showed up about half an hour later and told me that, after thinking about it all last night, he realizes that it was just a one time thing, the past is the past and he really likes where we're headed, so he would like to continue to pursue things, as long as I felt comfortable. Eric said he also talked to his brother last night and his brother definitely recognized me but again, said it was a one time thing and that we make a good couple and there's no lingering feelings of lust or anything. Eric then made a joke about his brother having good taste, which led to him pushing me onto the bed and having sex with me, haha (asserting dominance? marking his territory?)\n\nAll seems to be well now! I have the next four days off, which is rare for me as a flight attendant, so we're actually going on a spontaneous weekend trip :) \n\nThanks for all of your advice guys! I appreciate it!\n\nTLDR: I told Eric that I slept with his brother and he was ultimately cool with it. All seems well now! \n",
        "permalink": "/r/relationships/comments/4fzp6t/update_i_23f_just_met_my_boyfriends_26m_family/",
        "comments": [
            "Well done! Now never bring it up again, and if he's honest in his thoughts, you two should be over this and moving on with each other.",
            "I will say this and I hope you take it to heart.\n\nNever mention this again.  Not in a joking way, and most definitely not in an angry way.  This is not some funny thing that happened, and its not a tool that you can use to hurt him.\n\nSo should you choose to bring this up again in any fashion, don't be surprised if it ends the relationship.\n\nIt happened, it was a one time thing, all parties involved should just move on and never speak of it again.  Nothing good can come from rehashing this.",
            "It's nice when normal people show up on r/relationships and demonstrate how to deal with problems normally.",
            "[removed]",
            "Can you believe Tai at Tribal? LOVED IT",
            "Hi five OP! \n\nMost would have just kept their mouth shut and prayed it never came to light... Then come slinking to /r/relationships after it blows up in their face.\n\nYou showed that you're up front and honest even when it's difficult, *and* there's nothing forcing you to be. People like you are hard to find, he's smart to stick with you despite the awkward situation. Sounds like he's already able to see some humor in it even =)\n\nBest of luck to you both!",
            "Great update!  I'm glad he took it so well.  BTW no judgment on Survivor.  If you haven't already, you'd better get around to watching that episode from Wednesday!",
            "That's.....not what I was expecting. I mean, after all this time, I'm shocked that Survivor is still on.",
            "Just to make you feel better...I married my husband in 2015. It turns out...I went on a date with his (fraternal) TWIN BROTHER in 2008. They look nothing alike and we didn't even kiss...but that was one helluva awkward best man speech.",
            "I think it's a green flag (is that a valid expression?) that he empathized with you (realizing how you must have felt awkward) instead of making it all about him.",
            "I have a buddy whose wife hooked up with both of his older brothers before they even met. Was a hilarious running joke for awhile but everybody is cool with it and they're expecting their first kid. It's one of those things where there's a shitstorm or there isn't. Glad things went well for you.",
            "[removed]",
            ">watch the taping of Survivor from Wednesday night (lol don't judge us!)\n\nToo late. I am sooo judging you.",
            "Awesome!  I'm happy for you.  You did the right thing.",
            "Hey. Survivor is the best show on TV. Nothing to be ashamed about.",
            "nice job doing the right thing. there  was a previous post about someone thinking not to bring up this exact situation, and it was pretty damn stupid.\n\ngood on you for being honest.",
            "Your bf is some guy",
            "I am glad it worked out. Now they are both eskimo and biological brothers. ",
            "Your boyfriend sounds awesome, and I like how well the both of you handled this awkward situation maturely. I wish the both of you the best!",
            "OP, you handled this correctly and it's great that you, Eric, and his brother are being so mature about it. Nicely done!",
            "#TeamEric\n",
            "Dint realise Game of Thrones aired early...",
            "[deleted]",
            "But who's bigger? Okay sorry. Had to put that out.\n\nHappy that worked out for you. What a great ending. Kudos to your boyfriend for being a man and a grown up about things.\n\n> Eric then made a joke about his brother having good taste, which led to him pushing me onto the bed and having sex with me, haha (asserting dominance? marking his territory?)\n\nThis is the best isn't it? As a guy, I can say that I'm much more prowess after certain situations. ",
            "YAY happy endings!",
            "Small world we live in haha, glad you managed to work things out and have a few extra days off to spend together before going back to work :)",
            "I'm glad it went well!! Sounds like you have a wonderful relationship going!! Super happy for you!",
            "Glad this worked out for you. Many relationships would have ended over something like this.",
            "Pretty smart to tell him right away OP.  I can only imagine that the reaction would have been very different if you waited.",
            "HAHAHA!",
            "Wow awesome op! I did not expect this to go as well as it did, but im glad it all worked out for You! I know for a lot of guys it would have been a deal breaker, i know it would have been if it happened to me. Your bf is definitely a keeper for being so open minded :) All the best! ",
            ">watch the taping of Survivor from Wednesday night (lol don't judge us!). \n\nJust had to say, awesome taste there OP! I get the judgment too but   it's my fave show as well, by far, and there's a reason it's at 32 seasons now :D\n\nWho's your fave to win? I have a newfound respect for Aubry.",
            "Happy for you guys! And how good was Survivor this week right?? Tai is savage! Loving it. ",
            "Hey OP great work! I will nearly always say communication is the key to relationships and you've done a great job here salvaging would could have been a mess.",
            "Well, what did you pick when he asked about take out food? Pizza, Chinese or Thai?",
            ">watch the taping of Survivor from Wednesday night (lol don't judge us!). \n\nWhy would anyone judge that? It's one of the best TV shows ever.",
            "My fiance was married once - she divorced him to marry his little brother. Family drama at its finest...yeah, be sure this doesn't come up, at all, again. ",
            "This is so similar to what happened to a friend of mine. Only difference is that my friend had his first time with this girl, who later ended up as his brother's girlfriend. Both couples have been together for years now, and they seem very happy.",
            "The brothers are now eskimo brothers. No problem there!\n\nLOL",
            "Yessss, I was waiting for this update! You're both awesome for how this was handled and I'm happy for ya :D",
            "this will eat at him slowly , dont be surprised if this relationship has just turned into a casual dead end deal",
            "Ain't no fun if the brothers can't have none.",
            "I'm glad your boyfriend is more reasonable than some of the people on this sub. ",
            "Thanks for the update! I'm glad it worked out. ",
            "You did the right thing, have a great trip!",
            "but did he pee in your bed to mark his territory tho?",
            "Imagine if it turns out to be some turn on for him?  Could be pretty awesome for you! ",
            "This would be way too weird for me",
            "Your dude is pretty strong willed. Not going to lie if you dropped this bomb on me it would be a dealbreaker for me 100%. \n\nGood on you guys for being able to work it out. ",
            "Classy",
            "Haha, I love sluts :)",
            "I'm really glad things worked out for you and Eric! ",
            "> which led to him pushing me onto the bed and having sex with me, haha (asserting dominance? marking his territory?)\n\nSo just fyi, the \"asserting dominance\" thing here is kinda not funny, and not even accurate.  You could look at this situation as \"he's having sex with me to show me his acceptance of the situation, that he's over it and things are cool with us\".  Which is nothing like dominance.\n\nGuys get accused of acting \"dominant\" a lot, when dominance has nothing to do with it.  I don't mean to be thin-skinned about this, and I know you probably meant the best.  But please understand that this kind of stereotyping can be just as off-putting and reductive to a guy, as similar things are to women (like equating wearing a revealing dress with being \"slutty\" or something).\n",
            "Well done OP! ;) also brothers who share are brothers who care. "
        ]
    },
    {
        "post_id": "3rkml5",
        "author": "throwawaypromdate1",
        "title": "[Update] [17 F] got asked to prom by a guy[18 M] who may want to get me drunk and take advantage of me",
        "url": "https://www.reddit.com/r/relationships/comments/3rkml5/update_17_f_got_asked_to_prom_by_a_guy18_m_who/",
        "score": 2241,
        "num_comments": 311,
        "created_utc": 1446687758.0,
        "selftext": "Link to the original question: \nhttps://www.reddit.com/r/relationships/comments/3l4s00/i_17_f_got_asked_to_prom_by_a_guy18_m_who_may/\n\nHey all :) Some of you helped me out a while back, so I'm here to give you a short update! \n\nThe night started off pretty great with Jake being super cool and all. We went to dinner with some of our friends, got a shared ride, and all that fun stuff. We got to the dance and danced for a while, and he didn't do or say anything creepy. His friend, lets call him Paul since I have no idea who he is, showed up and said something in his ear, and Jake told me that there was a party and we were going. I said no, mostly because I am not comfortable with going to a stranger's party filled with people I don't know. Jake tried to convince me to go, and I kept saying no, until he was really upset. I told him I don't mind him going, and he got pretty mad. He said that I was boring and everyone fucks on prom night so I should too, which was pretty random since sex wasn't even on the table, and that I was making him look bad. He tried to pull my arm but a group of girls next to us told him he needs to leave, and he did. \n\nSo overall, it was an okay night. It sucks I couldn't hang out with Jake all night, but I did meet some pretty cool girls who let me hang out with them the rest of the night! Overall, it was pretty fun, and I didn't die or get pigs blood dumped on me by John Travolta!\n\n   \n**tl;dr**: Jake was an ass, but people are nice",
        "permalink": "/r/relationships/comments/3rkml5/update_17_f_got_asked_to_prom_by_a_guy18_m_who/",
        "comments": [
            "Actually, it's AWESOME that you didn't hang out with Jake all night, because you got to hang out with some friends who really care about you AND you were so strong and self-reliant that now you know you can always stand up for yourself in the future! You did awesome OP!!",
            "You handled the situation well. I'd recommend staying away from Jake from now on.",
            "Jake is a LAME-O. \"Everybody has sex on prom night?\" Oldest line in the book. And no, no they don't. Good for you for standing your ground. Having sex because someone wheedled and tried to manipulate you into having it is no fun at all. ",
            "The fact that he physically grabbed your arm in an attempt to drag you somewhere when you've made it clear you're not going anywhere is very scary. \n\nYou (and everyone else) deserves to be treated with respect and this asshat had no intention of respecting you, your thoughts, or your own body",
            "[deleted]",
            "\" It sucks I couldn't hang out with Jake all night\" \n\nNo, it really is not. He is an ass who wanted to take advantage of you and who tried to physically drag you out of a party after you refused him because he wanted his way with you. SO MANY RED FLAGS! Do not hang out with this loser anymore.\n\nBy the way, NO ONE I know had sex on prom night. The majority of people who attend Prom likely do not have sex on Prom night unless they happen to be an actor in a film that involves the Prom. Jake is a moron.",
            "Good for you. Stay away from Jake. ",
            "No respectable man will ever make you feel down because you didn't want to do anything that made you uncomfortable. Remember that, please always remember that. When you are ready to take it to the next step with someone you are comfortable with and care about, it will all feel right. No pressure from him or you, everything will fall into place. You sticked to your word,  and unfortunately a lot of young girls don't have that same power to say no. I congratulate you that you pass one of many tests that will come your way, but by sticking to your gut and not being pressured to do something you don't want to do, you will do great. Good luck with a lot of fun years to come your way :)",
            "Haha, yes. The entitlement of some guys is kinda ridiculous.\n\nI remember when I was in the car with my date he started dropping unsubtle hits about how he'd like to lose his virginity. He also took me on a tour of his house and made sure to show me his bed.\n\nLuckily this was all before prom. So I said, \"that's nice\" and \"I've promised God I'd save my virginity for my husband\" (that was the best think I could think of to say X-P)\n\nAnd got my parents to pick me up after prom. He ignored me for the rest of the year. You'll have that to look forward to...",
            "First of all, let me say that I'm super glad you are safe, and that nothing bad happened, you stood up for yourself.  \n\nI find it slightly hilarious that Jake thought you were an \"easy lay\" and got completely, utterly, 100% shut down.  It just...makes me giggle in an evil, maniacal way that a douche-bag was not able to go through with his douchy plan.   All thanks to the power of one high-school girl standing up for herself. \n\nYou rock, OP.  ",
            "> It sucks I couldn't hang out with Jake all night\n\nNo, it doesn't, you dodged a rapey bullet. That doesn't 'suck'.",
            "I love groups of girls like that. They can be so protective and it's so awesome when they help others like that.",
            "OP, your best friend Mary definitely has your back!  Kudos to her.\n\nAnd good for you telling Jake to F-off.  ",
            "Screw Jake\n\nOn second thought...don't screw Jake.\n\nI'm glad that you met some awesome girls and your night didn't get ruined.",
            "Why does it suck you didn't get to hang out with Jake all night? I'm so confused ",
            "Any guy that would try to take you somewhere by force isnt worth your time. Dump his ass asap and cut contact",
            "Good instincts. ",
            "Any guy who thinks he's entitled to sex on prom is a fuck boy.",
            "Trust me girl , not everyone gets laid on prom night . \nSource -18 year old.",
            ">Overall, it was pretty fun, and I didn't die or get pigs blood dumped on me by John Travolta!\n\nI have a feeling you're going to do just FINE in life.",
            ">I told him I don't mind him going, and he got pretty mad. He said that I was boring and everyone fucks on prom night so I should too, which was pretty random since sex wasn't even on the table, and that I was making him look bad. He tried to pull my arm but a group of girls next to us told him he needs to leave, and he did.\n\n\nGood on you and good on those awesome girls who helped stick up for you! This just brightened up my day to know that young people [especially girls who tend to be catty - at least when I was in High School a few years back] will step up and help enforce \"no means no\" mentality.",
            "What \"prom\" is in November?",
            "> It sucks I couldn't hang out with Jake all night\n\nUhhh I think it went way better since you didn't.",
            "> He said that I was boring and everyone fucks on prom night so I should too\n\nI thought only girlfriend and boyfriends fucked on prom night, but times might have changed since ~15 years ago. I'm super proud of you for standing up to him and even happier that group of girls was near you. ",
            "Good for you turning him down and sticking to it.",
            "I'd go so far as to say you were supposed to be the entertainment for the night for Jake, Paul, and the rest friends at the party.  Stay away from him and his 'friends' because they have little empathy.  Their 'traditions' are to degrade people.  If you haven't told your parents about this you should.",
            "Jake is a complete douche. A gentleman knows how to show a woman respect. Jake is not a gentleman. Stay away from Jake.",
            "Jake sucks, awesome job handling the situation though!",
            "> but I did meet some pretty cool girls who let me hang out with them the rest of the night!\n\nThis is the best part.  Try and stay as close as you can with these girls.",
            "Jake sounds like a rapist. ",
            "> It sucks I couldn't hang out with Jake all night\n\nNo. No it doesn't. You have no idea what kind of bullet you dodged there.",
            "Good for you.",
            "The fuck did you go with him in the first place?",
            "WTF has prom in November. ",
            "Good job on not succumbing to peer pressure!",
            "Awesome job holding your own. You can ALWAYS say no to any situation your not comfortable in ",
            "I didn't fuck my date on prom night.\n\n\nWe stayed together and several years later got married. What's wrong with that guy?",
            "Just tell Jake that as an 18 year old he can fuck a minor and then go to jail to be the minor getting fucked",
            "Wow, what an ass. I find it so difficult to believe that people like Jake exist. He sounds like a bad 90s movie character. I'm thinking Paul Walker's character from She's All That actually.",
            "> it was an okay night. It sucks I couldn't hang out with Jake all night\n\nNo, it sucks that Jake was an asshole.\n\nGlad you stuck to your guns and got some backup!",
            ">It sucks I couldn't hang out with Jake all night  \n\nIt's a very good thing you didn't. He was already pulling at your arm. Other people had to step in to tell him to step off.  \nWould he have stopped escalating if other people didn't stop him? Would he stop dragging you in the dark room of some randoms house?  \n\nRepeated for emphasis: **It's a very good thing you didn't spend the rest of the night with Jake.**",
            "u just dodged a bullet, you should always stand your ground.",
            "why is your prom in  november? ",
            "\"Pigs blood dumped on your by John Travolta\"? Is that a mixed Carrie and Grease reference?",
            "Glad you did ok. I wanted to add that you should always pour your own drinks.  There are some messed up people out there.",
            "Wow, Jake is a dick. Stay away from him.",
            "You did the right thing! Great job.\n\nNo means no. Although it seemed like the no you gave him was pretty clear, it's a good thing that other girls were around to stop that.\n\n",
            "tl;dr: Jake was an ass, but people are nice\n\nJesus you sound really sweet. No wonder this guy thought he could take advantage. But yes, he's an ass. Keep being sweet. ",
            "I can't believe he tried to use the \"c'mon! everyone's doin' it!\" line on you. That's like something straight of an old anti-drug use peer pressure video. ",
            "good shit for standing up for yourself",
            "If John Travolta did dump blood on you though, it might mean you're telekinetic. Which is way cooler than awkward prom sex.",
            ">\"Everybody has sex on prom night?\"\n\nEVERYONE EXCEPT YOU, BUDDY.\n\nGood job shutting that prick down.",
            "it sounds like the plot to a bad teen movie.",
            "\"It sucks I couldn't hang out with Jake all night\" Seriously, after \"everyone fucks on prom night so I should too\"?",
            ">So overall, it was an okay night. It sucks I couldn't hang out with Jake all night\n\nseriously?",
            "That line is bs. I only know of one couple that actually banged on prom night, and they were teachers. I'm glad you had fun and stayed safe!",
            "Jake is a sleezeball. No, not everyone has sex on prom night. I didn't, (had been dating a girl for about 6 months at that point) and I still had fun. I don't recall many people I was close with hooking up with their dates either. Glad good things still came out of a dumb situation for you though! Now more fun times can be had with your new friends also!",
            "Jake from state farm? She sounds hideous!",
            "Went to prom twice, didn't have sex either night. I was a virgin for the first few years in college and I don't regret it at all. \n\nBy the way, \"going to a party\" was his way of getting you out of there so he could take advantage of you. That's why he suddenly got mad about sex, because the only party he was planning on going to was one in his pants.\n\nGlad you had fun, OP!",
            "[removed]",
            "That guys' not gonna get laid at all in college (and possibly afterwards) with that kind of shitty attitude and mentality about women.",
            "If I had a daughter, which I hope I never will, I would be extremely proud in what you did.\n\nToo easy for girls to claim ignorance then put themselves into terrible situations then be told by everyone around them that it wasn't their fault at all when something bad happens. Things like that are a discredit to smart girls like yourself.",
            "I'm so glad those girls were there to back you up. I hope you all stay friends, those are the kind of people who will have your back. ",
            "Jake is a horrible person.  Please dont see him again.",
            "Fuck Jake. Not literally, more like he's a scumbag who needs to be away from you.",
            "Darn I was hoping for an ending like she's all that.  But glad you had fun and stood your ground! ",
            "Lucky you.  I never went to my high school prom and I regret it. ",
            "Word of advice: anyone who doesn't take no for an answer isn't worth knowing. ",
            "You don't deserve to be treated like that, and what he did was wrong on every level. Real friends like and respect you for who you are, and they will also respect your boudaries. Good on you for taking a stand and being safe; and don't worry about Jake - that guy's just a huge scumbag.",
            "Good for you. You don't need people like Jake in your life. ",
            "Sounds like he's a dick, you did good to do what you did. ",
            "Christ, what an asshole loser. ",
            "Daaaaaamn! That Jake character is your typical dickish jock right out of a teen movie! \n\nGood for you for standing up for yourself and not going with him. You know he totally rolled up to that party looking like a massive asshole and I bet his bro friends totally gave him a hard time. I LOVE this update. You seriously win today.",
            "Eesh, what a butthurt dickwad. Sounds you cleverly negotiated your way around a dangerous situation. Well done!",
            "You need to stop talking to this guy now. If hes grabbing your arm before hes had a drink think of what he might do if you say you dont wanna have sex. Fuck that kid he sounds like a douche bag who gets mad if a girl doesn't want to go to a party? If he said you're boring hes obviously with the wrong person. ",
            "Yikes! Scary. So glad you put your foot down and others told him to bug off.\n\nPressure for sex is never cool and I can't believe those guys *expected* sex just because it was prom night. No, not everyone has sex on prom night. Just because he wants to doesn't mean she has to. He should've communicated beforehand on what he was looking for, then she wouldn't have had to deal with him at all ",
            "> but I did meet some pretty cool girls who let me hang out with them the rest of the night\n\nThat right there is my favorite part of the story. Oh, and the part about you not getting raped, of course.",
            "*Sucks that Jake turned into a douche\nFTFY",
            "Fucking high school. Good job!",
            "Shout-out to the girls who had your back.\n\n\n\nAlso TIL that John Travolta was in Carrie (never saw the original).",
            "It doesn't suck that you didn't get to hang out with him more, the dude sounds like a creep. He's probably gonna act like a bitch to you now because your rejected him and probably try to spread rumors but better that than letting him take advantage of you.",
            "I feel like this is completely fake.",
            "wow, he sounds like a psychopath lol",
            "This sorta sounds like a high school girl fantasy.",
            "Glad you had fun, too bad he was a douche ",
            "Jake is a dickhead. Glad you had fun!",
            "Glad you took the advice in the original post to heart.  Sounds like you had a great time, regardless of Jake. ",
            "You have dealt with jake trying to pressure you amazingly!  Hanging with him all night would end up badly.",
            "It's great that you had fun despite your date being a dick!",
            "God damn. \n\nHe was so intent on fucking that he tried to physically pull you away in a public place. Thank GOD you heard about his intentions beforehand and stood up for yourself or who knows what he woulda done in private with some booze in him.\n\nDon't be sad you didn't spend the whole night with a potential rapist OP :) But I get it it's high school and it's nice when the opposite sex takes an interest in you (hell that's still pretty nice). Don't worry OP there are way better guys out there!",
            "I've met four jakes in my life and I never liked any of them ",
            "Wow. You handled it that well? I'd like to congratulate you on one of your first major steps into adulthood. You're already doing better than most Redditors, in fact! Well done, m'lady.\n\nOh, fuck. I said the ML word again :(\n\nGod damn I still need practice on this grownup shit.",
            "Wait, why the F would you WANT to hang out with Jake all night? what an ass.",
            "I'm so proud of you,  even for writing your original post.   Lots of girls your age would've been all \"Omg,  Yay!  I don't want him to think that I suck so I'll probably sleep with him\" or even get themselves in a situation where saying 'No' will be too late.   Good on you for not going along with him and his mates.  I hope you continue to carry this sense of smarts with you.  =) ",
            "I bet jake sleeps with a night light on.",
            "r/thathappened",
            "[removed]",
            "Young girls of reddit. If you have a bad feeling about a guy you're going t be right 99% of the time. Walk away. Stop making these mistakes. I've heard it from every girl I've ever been with and it's getting old. Thankfully the his girl has a head on her shoulders.",
            "Your username is especially relevant. ",
            "ah young love. Then I could get away with a lot of crap that doesn't work anymore when you get older. There's always some jackass who ruins it for everyone.",
            "\"I don't feel comfortable going to a party at a strangers house\" lmao grow up ",
            "so you know that jake is an ass but it still sucks that you couldnt hang out with him the rest of the day.\n\n\n\nokay.",
            "Sounds like you should go and do whatever he tells you ...",
            "I think it's a great thing the way your PROM night ended. I see people commenting on Jake being a penis, an ass etc. I'm not sure I would go that far and here's why. I'm not defending him, but we have to realize Jake's behavior is indicative of how boys (who become men) are socialized. If anything we need to change the way we view PROM and a young man's role on that night. A quintessential cited example: American Pie\n\n",
            "I think it's good that you did things the way you wanted to but I will say that it's important to strike a balance. \n\nI've known a lot of people who didn't venture outside their comfort zones in their youth and they end up going completely off the rails. ",
            "[deleted]",
            "> which was pretty random since sex wasn't even on the table\n\nin your mind. unless you explicitely say this, it's a pretty reasonable assumption that sex is at least a possibility.",
            "[removed]"
        ]
    },
    {
        "post_id": "34st7y",
        "author": "LucyDiamondSky",
        "title": "Me [16F] with my Mom: 32F. She decided she doesn't want to be a mom anymore. Sending me to live with my aunt. UPDATE 1",
        "url": "https://www.reddit.com/r/relationships/comments/34st7y/me_16f_with_my_mom_32f_she_decided_she_doesnt/",
        "score": 2238,
        "num_comments": 278,
        "created_utc": 1430722648.0,
        "selftext": "http://www.reddit.com/r/relationships/comments/2cpu6m/me_16f_with_my_mom_32f_she_decided_she_doesnt/#\n\nI just wanted to give an update. I forgot I had even posted on here with everything going on. \n\nI ended up going to my auntie's. She came and packed up my whole room with me and drove me to her house. It was really hard, because my mom was already talking about selling the house and moving to some other city, so she could start her life. \n\nI still have a lot of pain from what she did, but living with my Aunt and Uncle has been a great experience. Mr. B (my boss) got me a job at a Subway where my Aunt lives. I really like the people I work with. \n\nI started dating someone at my new school and we have been together for 5 months. Dan (17m) is great and we are in the same grade (he just turned 17), so we had the whole year together. School is ending in a few weeks and we have plans to go to the beach with my Aunt and Uncle for a week. \n\nI met some new friends and got involved with Volleyball and took part in drama. I also am Assistant Treasurer, because I was able to talk to the teacher in charge of the group and said I wanted experience. When she saw my transcripts, she said I could assist the girl who got the position. The girl (Joleen) is actually really cool and we became pretty good friends.\n\nI still keep in touch with my friends from home, but I really feel like I have a great support system now. I haven't told anyone why I moved here just yet, minus my boyfriend, because its too embarrassing. And I don't like to talk about it. \n\nI was doing really good and had decided I didn't really want to see my mom again. Because who abandons their own kid? \n\nMy mom came up last week and she has been waiting around to see me. I didn't know why until Saturday because my aunt finally told me, because my mom barged into the house and refused to leave. Auntie asked if I wanted to talk to \"her\" and I told her I would. \n\nMy mom said she was so sorry for the way she treated me, that she wanted to know if I would move back for my senior year. She said we could pack up anytime I wanted. \n\nShe then asked my aunt if she could stay in the guest room. \n\nMy aunt said the room was mine. \n\nMy mom said \"Lucy doesn't mind sharing.\" \n\nMy mom tried really hard to get me to chat with her alone, but Auntie stayed with me. It came out that my Mom wanted me to come home because her boyfriend left her and she blew through her money.\n\nAuntie told Mom she needed to leave and then told me that my mom had been calling her about the check my birth father sends her. I guess she contacted the lawyer, said I was in her custody, and my mom signed the papers my aunt asked her to. Mom didn't realize it meant the check was coming to Auntie, who said she put most of it into a savings account for me. \n\nThere were some things she needed money for and I am grateful she is paying for me and keeping me. It could have been so much worse. \n\nI guess the checks were pretty big. \n\nSo I just told my mom not to contact me again. It hurt, a lot. The only reason she wanted me around was because of a check. \n\nThat said, I guess my aunt has my father's number. She said he wants to talk with me when I am ready. So there is that.\n\nI am not sure what to do now? It just hurts.\n\n\n   \n**tl;dr**: Been really happy, until my mom came back to get me to live with her because of my check.",
        "permalink": "/r/relationships/comments/34st7y/me_16f_with_my_mom_32f_she_decided_she_doesnt/",
        "comments": [
            "Courage, you're a strong lady. That really sucks, and it hurts to be treated the way you have been. But your Aunt certainly came through for you, and you are going to have a brilliant life ahead of you. Stay strong, and keep your head clear. \n\nI don't know how you get along with your dad, but give him a call, maybe you can rekindle some sort of relationship? At any rate, I am proud of you for standing up to your mom, it had to have been tough. Stay who you are, and let this serve as a road map for how you don't want to be. ",
            "Your aunt is amazing.  If you can, get or make her a nice card for Mother's Day!\n\nYou're doing good, and good for you for sticking to your guns.  Since your aunt seems to have pretty good judgement, you could always ask her for advice on how to handle your father.  It would be interesting to hear his side of the story.  \n\nThat being said, it's completely up to you if you want to meet him now, or maybe later when you're older and more on your own.  \n\nIt sounds like you're in a great place with your new school--have a great summer, and a great senior year!\n\nedit: words",
            "Real MVP is your aunt, damn.\n\nPutting all that money in a savings/college fund. She knows what's up. ",
            "Just to reiterate, her leaving you says absolutely nothing about your character and tells you everything you need to know about hers.  She obviously has some sort of mental/financial issues, but none of which are your problem anymore.  Your aunt is the parent you both need and want.  When and if you're ready, you can try to see if your dad is worth bringing into your life.\n\nYou're being really strong and awesome; don't let anything your mom says or does throw you off the wonderful path before you.",
            "If you feel that your mother is only interested in seeing you for money then you need to protect yourself. She might try to use your identity to open up credit cards or use your goverment information to collect benefits in your name. (In the U.S. Social Security fraud happens all the time.) Speak with your aunt and uncle about this and you should all find imformation on how to protect your identity in this situation. This is a very real possibly. \n\nEdit: as /u/shitjoesays has pointed out, if your mother does something like this to you it can effect you for the rest of your life. ",
            "You're unlucky to have such a shitty mom, but you're really lucky to have such an awesome aunt.",
            "Auntie deserves the biggest hug ever.",
            "[removed]",
            "Some of the hardest and most liberating realisations most of us come to are that 1) our parents are human beings who make mistakes and bad choices; who fuck up sometimes or are just shitty people; 2) you do not owe somebody something just because you share DNA and 3) family is not always related to you by blood. You learned the first one earlier and harder than most, but when you truly feel the second one you can embrace the third to make your own place in life with the people who nurture you instead of burdening you.\n\nThis is supposed to hurt, because it matters. But it doesn't define you, and it needn't hold you back. Acknowledge and appreciate the people in your life who care for and look after you. Decide now to become a better human being than your mother is, both because of and in spite of her.\n\nGood luck. ",
            "You are truly an amazing young woman.  You've been through such a difficult time, and  yet you've made the most of it.  There are people twice your age with many more advantages who don't do half as well as you have thus far in your young life.  Be proud of yourself!\n\nWith regards to your dad... is it possible your mother was actually keeping you from seeing him?  That she lied about things, perhaps to both of you?  It might be interesting to compare notes with him to find out where the truth actually lies...\n\nIt sounds like your auntie is your staunchest ally.  Perhaps ask her if she thinks it's possible your mother stopped your father from seeing you... she may have some ideas and been waiting for you to ask.\n\nIn any event, you should only see your father when YOU feel ready to do so.  Perhaps you could ask your aunt to call him and see if you could have his email address.  That way you could chat via email, at a pace you are comfortable with, taking the time to digest his emails and formulate your response.\n\nAs for your mother... well... something inside of her is clearly broken.  That's not your fault and is no reflection on you.  You just keep taking care of yourself and letting your auntie take care of you.  Your mother can sort her own crap out, or not, as she sees fit... but there's no reason YOU have to be exposed to her unless you want to be.  \n\nYou have a fantastic future ahead of you, and it will be of your own creation.  That's priceless.",
            "Mother's Day is this Sunday (May 10th).  Get your aunt something nice.\n\nAnd think about talking to your dad.  I'm in agreement with the others that think your mother has more to do with his lack of contact than he does.\n",
            "I actually went through something really similar, only it was my grandmother that took me in instead of my aunt. Speaking from personal experience, I really, really, highly suggest you do not have contact with your mother. At any point. \n\nShe may show up at a family gathering and cry about wanting to talk to you, or show up drunk in your life somewhere own the line. Ignore her like she has plague fleas that can jump miles in one bound. \n\nAlso... at some point you may want to talk to someone about what happened and how it makes you feel. I highly suggest a professional. You don't want to become so blocked up with feelings that you can't really hold it in. \n\nGood Luck! You are already on the way to a better life.",
            "I see it's already been mentioned but I want to really stress heading over to /r/raisedbynarcissists. My birth giver dumped me at 2 years old because she also didn't want to be a mother anymore (she said it  was too hard after my dad and sister died). She left me in a home where she knew I'd be abused, and never looked back.\n\nThat kind of thing screws with you a bit. The subreddit I mentioned has helped me to realize that 1. I'm not alone and 2. I am not worthless. I wasn't abandoned because there's something wrong with me, but I was abandoned because there's something *very* wrong with her. \n\nThe same is true for you. You're working hard in school, making good grades, worrying about college, working a part time job...you're basically the dream-teen. Like, I hope my kids have it as together as you do when they're your age. I'm sorry your mother doesn't recognize that, but don't stop recognizing it in yourself, not even for a moment. You are amazing. \n\n\nAlso, it's up to you since you have so much going on in your life, but if I were you, I'd hear what your dad has to say. It's possible he's stayed away because of something your mother said/did (like maybe threatened him or something). I'm not saying get your hopes up, I'm just saying, you now know what kind of person your mother is, it may be worthwhile to know if she painted an accurate portrait of your father. You don't have to commit to anything but a conversation and then take it from there (if you want...you're also within your rights to not even have a conversation!)\n\nRegardless, it seems you are very smart and very strong, and with or without your parents, you have your aunt and your own strengths, and I imagine your future is very bright indeed. Best of luck. ",
            "Your father has continued to send you checks. A lot of men don't go that far. Whatever else, he respects his duty to you. Perhaps consider following up on that, once you are in a healthy place mentally.\n\nOtherwise, you've done very well and I wish you nothing but the best.",
            "Many, many hugs to you. \n\nI know it hurts a lot,  but sometimes the people who are our biological parents are just not fit for purpose. Thankfully you have your aunt to love and support you. ..and possibly your father,  who may have been kept away from you on purpose by your mother. \n\nCheck out /r/raisedbynarcissists - your mother sounds like one. ",
            "Wow you have on hell of an amazing Aunt. Glad things worked out for the best! You don't need that woman in your life, your Aunt is more of a mother to you than it sounds like she ever was.",
            "I'm sorry to hear this. My mom was the exact same way. She would try to come and go from my life as she pleased, and usually for her own benefit.\n\nWhen he own father died she came to the funeral but didn't get anything from the will, and then left us all again. Her mom (my grandma) said she wasn't the least bit surprised and that my mom will probably come around again when my grandma passes away (as she has cancer and will pass in the next few years ).\n\nIt's sickening to know you're just part of someone's selfish agenda. But these people never change. It's best to just cut them out and not give them a chance. I felt so relieved when I finally told my mom off and blocked her from everything.",
            "[deleted]",
            "I know you don't know me and this means nothing, but I'm proud of you and expect great things out of you in life. Your mom can pound sand. ",
            "\"I didn't realize that the money that goes toward supporting my kid would stop when I don't wanna be a mom anymore.\"\n\nJesus Christ.\n\nOther than that, I'm glad things are doing better. Don't pay any more attention to your time. I've spent years hating my mom, and I have to tell you that it isn't worth it. Cut her off and do your best to continue with your life.",
            "First off, I think you're handling this situation with incredible maturity and strength for a 16 year old.  This is a really, really tough situation for any child to handle.  The emotions you're feeling are 100% normal and I think it makes sense that this situation would hurt.  As I'm sure people told you the first time, it's important to remember this isn't the result of you doing anything wrong or not being enough, it's about your mother's issues.\n\nYour aunt and uncle also sound amazing and like they have your best interests at heart.  You are very, very lucky to have them, as I am sure you already know.\n\nAny chance you're able to talk to a therapist through school or that you aunt and uncle might be willing to let you use some of the money from your birth father to see someone?  I've found they can be really helpful to work through your feelings about the situation as well as give you tools to handle your mother in the event she shows up again in the future, which seems likely.",
            "You are with people who love you and who have your best interests in mind.  You are where you need to be.  Down the line, this will all make sense somehow.",
            "I have a scumbag parent like your mom. I disowned him and never looked back. Just wait until you become a parent. You'll understand your mom even less because you won't be able to imagine how she could do these things to her own child. That's where I'm at. My father is a distant memory and I am happier and healthier leaving him there.",
            "Sounds like your aunt is a great woman and your mom is a piece of shit. \n\nDo not under any circumstances give your mother money. Shes a leech. ",
            "Dear God girl, STAY WITH YOUR AUNT!!!!!!!!   \n\nSave most of your child support money for college/technical training!!!\n\nMaybe use a little bit to help cover your Aunt's costs if she needs it.\n\nDO NOT have unprotected sex with your boyfriend!!!  Do not repeat the same cycle as your mother and become a teen mother!\n\nGood luck :)",
            "What do you know of your father? I'm curious how it came to be that he has been sending you huge checks on a regular basis without ever actually talking to you.",
            "Your aunt sounds like an amazing person!!!\n\nAs you move forward in life, remember to stay in touch with her and let here know that you really appreciate all she has done.",
            "Good for you for staying strong-and give your aunt and uncle a HUGE hug form all of is who say good for them.\n\nSO glad you are happier and secure now",
            ">It just hurts.\n\nI'm old enough to be your dad and in life, what you said right there... There's no way around it sometimes. I'm going through something really shitty too but I'm trying to look at it as an opportunity to provide a better life for my kids. Hang in there. Don't be afraid to ask for help when you need it. Or a shoulder to cry on.\n\n>That said, I guess my aunt has my father's number. She said he wants to talk with me when I am ready. So there is that.\n\nI'm going to bet that your dad left because he saw how toxic your mom was. It doesn't excuse his absence from your life, but, you may be able to build a good relationship with him. He WANTS to talk to you. I'll take a guess and say he's probably wanted to for a long time, but your mother wouldn't allow it.",
            "It is possible your Mother interfered with your Dad's and your ability to have a relationship.\n\nIf I were you - I would give him a call.\n\n\nYour Aunt is a good person. Seriously. Give her a big hug!\n\n\nMy guess is your Mom has some serious issues in her life that you really shouldn't be made to be a part of.  Telling her not to contact you is wise. You can always contact her if and when you decide you have a need to communicate.\n\n\nI am so sorry you have had to go through such an experience at such a young age. It does seem as if your new surroundings are positive though, so that's great! :)\n\n\nYou take care.\n\n\n*Nana internet hug*",
            "\"Lucy doesn't mind sharing\"\n\n*twitch*",
            "Your mother sounds like an awful parasite of a woman.  Live with your aunt and don't contact her, she sounds like a great lady.  Go to college, get a good job and live your life.  It seems like you're already light years more a better person than your mother.",
            "I suspect that her boyfriend left her *because* they burned through whatever money that she had. Regardless, she isn't worthy of the title of being called \"mom\" or \"mother. \n\nI think you are doing really great, and that you should continue to be great. You have been kicking ass, and taking names. I hope you have a wonderful summer, and enjoy the down time. \n\nYou got steel in your spine, you are an exceedingly strong young woman. Good job, and good luck!",
            "Your aunt is an absolute rock star. ",
            "Your aunt is a strong, amazing woman. I have no doubt that you will become the same under her guidance.\n\nOn an unrelated note, your title reminded me of the movie Lilya 4-Ever.",
            "Half her age yet twice as mature, hats off to you.  And to your aunt as well.",
            "Wow, your mom is a piece of shit. She did you a favor by removing herself from your life.",
            "As a lot here have already said : your aunt is awesome. You won't have any brother or sister. Which means you won't ever understand what your aunt really did for you, and you are far from really knowing it right now.\n\nBut one day, hopefully, you'll have children. A real family. And maybe that day you'll understand what it is to stand for your child against someone or for something. And that day, you'll remember that your aunt stood for a child which is not her own child, against her own sister. Maybe that day you'll understand what it means.\n\nJust let her know that you are grateful for what she did/does, i'm sure she doesn't need more from you. I read about the mother's day dinner, it's very nice of you, i bet there'll be tears ;)\n\nFocus on your life and the ones you love, you don't owe your mother anything from now on.",
            "I'm going to play Armchair Shrink for a minute here and recommend you do some research on Narcissistic Personality Disorder. It will help you better understand your mother's behavior and help you cope and make decisions regarding you and your mother's relationship.",
            "Holy shit mom, way to put an exclamation mark on the fact you only want to use your daughter for the paycheck that comes with her.\n\nOP - trust me, this says way more about your mom than it does about you.  I could see how this could affect your feelings of self worth, but please don't let it as it's not about you at all.  I suspect you mom has driven a number of people away with her leeching, she's probably driven them all off and now you're the only one left.  If anything, take it as a compliment that she did value enough that you're the last person she tried to suck the blood out of.",
            "Most full grown adults couldn't handle this situation as gracefully as you.  I'm so glad that your aunt and uncle can provide a stable home for you.  I hope you have a great senior year.  \n\nI don't mean to lecture but in the US, your status as regards your mother entitles you to extra financial aid.  Seek it out!",
            "Chin up buttercup. Just the fact that you're making it through all of this, let alone seemingly doing pretty well for yourself, is nothing short of incredible. You must be an amazing person, and all I can say is: keep on keepin on. \n\nI don't even know you, and I'm only a couple years older than you, but I'm fuckin proud of you. Some days I think I'm having a rough time for stupid petty shit, and hen I read something like this and it sets me straight. So yeah, way to be a badass. \n\nEDIT TO ADD SOMETHING: it's easy as a young person to think, \"what did I do that she doesn't want me anymore?\"  This is NOT your fault, don't ever even let that thought enter your mind.  This is her acting too irresponsibly and selfishly for a 32 year old with a teenaged daughter.  This is NOT your fault.",
            "You're welcome at /r/raisedbynarissists anytime.  Your Aunt is your Mom, if not your birth giver.  Hugs.",
            "I wasn't around for the original submission but I'm glad to see things are going so much better for you now with your aunt. Your mother has her own issues that she will have to work on, but you keep doing what you're doing right now.",
            "I'm so happy to read this update! When I read your last post nine months ago, I was nervous for what you were up against, but I had a feeling that you'd come out on top. And you're doing wonderful! I love being right! :) \n\nI think seeking a therapist to mourn for the mother that you SHOULD have been born to might help you cope with this latest curveball she threw at you. I could write a very long paragraph bitching about her, but there's no point. You know better than anyone here. \n\nAlso know that just because she's your mother, doesn't mean that she's not a Grade A asshole first, and it's your right to establish a family of choice. Don't convince yourself to get warm fuzzy feelings for her JUST because of DNA. Your FAMILY should treat you better, not worse, than a they would treat an acquaintance or stranger on the street. She's shown you that you owe her nothing. \n\nPlease update us a year from now; I'm really curious to know about how your senior year goes, and what kind of college you decide to go to. :)",
            "Omg, you are a very strong woman. Glad to see you have such a great aunt and uncle. Stay strong love and when/if you are ready your aunt has your fathers number.",
            "Soon, you will be 18 and the checks will stop coming. Stay with your aunt until then, she clearly cares a great deal for you. If when you're 18, your mother continues to ask for contact, you will know it is genuine and not about money (that money, anyway). But know that you have family that love you and want the best for you. Lean on them. You're much stronger than you realize.",
            "You have an incredible amount of initiative and poise in all of this! Congrats on seeking out the assistant treasurer position, and getting involved in volleyball and drama at your new school. A lot of people in your position could easily become withdrawn and bitter - you are clearly continuing to let people in and have great experiences that will set you up for a great future.\n\nYou mom sucks. You can't choose your family. Shitty parents can really mess up their kids. It is outstanding that you have your aunt and uncle and the support system you talked about. Your mom seems like she will drag you down if she can - so don't let her. \n\nThe fact that she bailed on you and wants to use you for child support checks is NOT YOUR FAULT. This is all on her. You sound like a fantastic person, and I hope you see that from the other positive people in your life. Your school likes having you involved, you are in a solid relationship, the rest of your family is looking out for you, and even your dad might be ready to reach out and get to know you. Your mom's shit is all on her. You did absolutely nothing wrong. You are worth knowing and loving, and she just doesn't get that. ",
            "Wow, stories like this should remind us how hard and harsh the world can be. It is great you are doing well and I hope you continue to thrive. You are lucky you have your Aunt. It also reminded me my problems are that seem large are not when someone like you deals with such  serious issues, we can still learn, even we are older. Thanks for sharing. ",
            "LoL your mom sure is a gem. No wonder your dad left. You should contact him, sounds like he has an idea of how shitty your mom is.",
            "Sorry I had a good laugh at your mom's stupidity for not realising what she was signing.\n\nWell done YOU for how you have reacted and how well you have grown as a person.\n\nYour a great testament to hard work and graft and with the support of your Aunt, you'll be a great adult. \n\nThanks for the really good update, keep on this path.",
            "I went through something vaguely similar as a child. My mother was never a figure in my life after the age of 8. She choose a life of partying over raising me. My father was ill equipped to raise me and had his own substance abuse issues. While my father was there, he never truly raised me. My grandparents raised me and provided me with many opportunities that I would never have had the option of exploring without them. I will never be able to express my thanks to them enough for everything that they have done for me. My mother tried at times to get in contact with me or take me out for a birthday or such, but she always failed to show up. Eventually, I gave up even trying. She was murdered a few years ago after one of her binges out partying. While not completely relevant, it made me realize that while I was upset that she could never get her life turned around, I grew an even greater respect for those who were there for me throughout my life.",
            "Your dilemma sounds like a Disney princess story in the making. Unfortunately, she'll always be your mother whether she wants to or not, only now she's a manipulative greedy bitch as well. Props to your aunt for being better than your \"mother\" was, and good for you for dealing with this nonsense maturely.",
            "That's awesome that you have your Aunt who is willing to do all of this for you.\n\nYour mom can go literally eat a big bowl of dicks.",
            "Wow, your mom can go fuck herself. \n\nHonestly this all sounds like it was for the best, she does not sound like someone you should have in your life.",
            "Props to your Aunt and Uncle for doing this. \n\nYour mother might be the reason that the  relationship between you and your father is crap. Definitely call him.\n\nYour mother will always be your mother, but I think you made the right decision to tell her not to contact you.\nMaybe later on when you're older and on your own you might want to contact her again. But right now she will probably do more harm than good.\n\nHave fun on your trip! ",
            "Your aunt is awesome and you should do something nice for her for mothers day as she has been more of a mother to you than your own mom.",
            "Definitely a good move to stay with the Aunt instead of the Mom. It seems like she's only in it for the check. This is my more suspicious side talking, but maybe get a look at that savings account the money is going into.\n\nSpeaking of the money, it seems like your father has been sending it for quite awhile. There may be a perfectly good reason he isn't part of your life, but the reason could also have been your mother? Obviously this is totally up to you, but it may be worth it to give him a call during this transitioning stage of your life. He may turn out to be a more worthy parent.",
            "Your aunt is the bomb-diggity. Like I wish I had aunts like that.",
            "Congratulations on being strong.  Your mom isn't doing this to you, it's about her, it isn't a reflection on you in any way.  Keep this in mind at all times.  Hold your head up, don't be embarrassed or ashamed, you can't be and aren't responsible for the actions of other people, even your mother.  \n\nIt seem like your aunt and uncle are caring for you properly.  I would have your aunt contact your father and let her get the story from him  about why he's been absent for 9 years.  I might have do to with your mom, if she threaten to accuse him of abusing you he might have been left with no option but to cut off contact and keep writing checks.  He could have his own problem.  After your aunt speaks with your father ask for her advice.  If she thinks reconnecting with your father would be a good thing then it probably will be, if she doesn't think reconnecting with him is a good idea, then just forget about it for now and focus on you.  ",
            "Well, at least she's honest about it. But the bottom line is, she wants you back because of the money... Or so it seems. I'd dare say she's using you.\n\nDon't give in. She abandoned you, and only comes crawling back for your money. I'd highly recommend cutting off contract between the both of you for at least the time being.\n\nAlso, props to your aunt. Give her a good hug.",
            "This is the way is goes sometimes... you don't pick you parents.  And as a child from a shitty mother, I know what it's like.  Everytime I see a women who's obviously unfit to be a mother I think of my mom and what I went through.\n\nJust know, you can't pick your parents, but you can pick your life.  It sounds like you've got a good thing with your Aunt.  That's awesome.",
            "I'd say wait till you're out of highschool, kudos for getting a job, stick with it for as long as you can.",
            "Wow... this is both heartbreaking and inspiring. As a dad of two, I'm very proud of you for how you've kept your head held high and are living your life. \n\nThe day will come, where your mother will regret her selfish actions. Be sure that you live to the fullest and don't for ONE DAMN SECOND feel any guilt or remorse. You deserve better than what you were given and thank goodness you are getting it from your extended family.\n\nAll the best. -**H**",
            "Fuck it even if she's your birth mother, that doesn't make her your real mother, good thing you cut her toxic self out of your life. Appreciate your aunt and uncle and never forget the opportunity they provided you, they are your real parents.",
            "Wow, that's a lot of shit all at once, especially for your age and pressures. You're already more worried about college than you need be (top post in your first post is right) and it sounds like you might be prone to these sorts of things gaining downhill momentum. You're still in a new situation and you ought to get strong roots and master it before dealing with your dad. You need time to even accept what your mom actually is now that you know it.\n\nYou've got plenty of years left in your life and you can take things slowly. No need to rush. Close the chapter with your mom, put the book down and file it away before opening a new one. When you're ready to contact your dad, make it part of a new chapter in your life and have the old one be distinctively closed. ",
            "Is there any reason not to call your dad ? Why wasn't he present in your life ? We don't know your dad's history but if your mom told you bad things about him, keep in mind what kind of mother you have and she might have lied about him. Listen to his side of the story at least.\n\nIf you find your story is too embarassing to tell your friends it's okay, but remember it's your mother who should be embarrassed by this, not you. She sounds really dumb, you're better off without her. You seem to be building your new life just fine. Look at the bright side, you live a stable life with wise people, still have all your chances to get into a good university, and maybe you can get in touch with your father and bound with his side of the family. The pain will go away with time, and in the end you'll realize how lucky you are.",
            "Go all out for your aunt on Mom's Day this Sunday.\n\n/$0.02",
            "I'd imagine your mom kept your dad from you. Give him a call and say hello.",
            "You seem to be doing quite well. It hurts now, but we are all confident you are going to have a bright future. And your aunt is really awesome. ",
            "Sounds like you're doing great.  Sorry to hear about your mom but you're doing well, keep it up!",
            "I am so happy to hear you are doing so well at your new school!! \n\nI'm sorry about your Mom. That's incredibly shitty to be so used right to the bitter end, BUT you are SO blessed to have an Aunt who cares so much about you!",
            "I'm glad you're safe at your aunt's.  It sucks about your mom being so awful, but I'm glad you're someplace safe with people that care about you.\n\n",
            "Wow you're hella strong, many people would've went back with their mom if this situation arose. Just keep your head up and keep climbing, you already have a strong grip and you're not about to let some money hungry asshole drag you down.",
            "I am so proud you took your toxic mom out of your life! I think your aunt is a great person for putting the checks into a savings for you and it's really great that you didn't go with your horrible mom!",
            "Keep your head up kiddo and stay positive",
            "Hey OP, you made an amazing life for yourself, you did that. No one else did. Contact your father if you'd like some relationship with him if you aren't on bad terms. Who knows, it might have been your mother hiding letters and what not as other people have said. Trust me, having divorced parents is hard as they can try to under mine each other, but it's never too late to try to have a relationship. The same way you made a new life for yourself, take charge and do what you want to do. Oh and id like to offer myself as a resource in case you'd ever need someone to talk to anonymously. Good luck! ",
            "Wow. I just want to say you're amazing. You've come through a hell of a lot. I'm glad your aunt has been there for you, that is true love for you. Keep on being an awesome person and you'll do well in life.",
            "My goodness you are tough.\n\nI'm glad that things are looking up for you, and I'm sorry your mother had to show her shitty face again and tarnish a good thing.\n\nYour auntie sounds like a wonderful woman, and a much better mother than your own.\n\nGood luck, I'm sure you'll do the right thing as it seems you have this whole time =]",
            "Just remember how you felt in your first post, and how things have worked out for you up this post. Things can continue to improve for you like you have if you keep a positive attitude and the courage you've had so far.\n\nIts going to hurt, but it sounds like you're in a very good situation now, and no one can ruin it without your permission.",
            "Your aunt is a hero. Stick with her.  \n\nIt sucks to go no contact with your mom at such a young age - but you can do it and you should.  I moved out of my parent's home when I was 17 due to ongoing abuse (my choice though). What I can look back and see is that I have resiliency, strength and a grasp on reality that I wouldn't have had if I would have kept living with them.  \n\nThis will make you a better person. Don't ever doubt yourself. \n\nYour mom is a horrible parent. Your aunt is smart to stay by your side because if your mom gets you alone she will try to make you feel guilty for \"abandoning\" her.  Don't ever let your mom manipulate you into guilt for her own fucked up actions.",
            "I'm just so glad your aunt is a good person, and helped you get through what could have been an awful situation. For how she handled your mom, I just want to give her applause.",
            "Your mom sounds like an absolute mess. I'm glad you have your aunt - and it sounds like you are doing everything exactly right... building a new support system, doing well in school and extracurriculars. \n\nRemember that none of your mom's crazy is your fault. She needs professional help and that is not your responsibility or - thankfully - your problem.  Stick close with your aunt. It's clear she wants what's best for you.\n\nIt's hard, but if your mom is really a narcissist (as others have suggested), this is going to be an ongoing problem unless you practice setting up really strong boundaries now.  There's a good chance she'll take another shot at dragging you back into her Whirlpool Of Misery once you're 18 and out of your aunt's house.\n\nAlso, just a heads-up - there are going to be people in your life who try to guilt you about your lack of a relationship with your mom.  They'll imply that it's your \"duty\" as a daughter to forgive her or try to mend the relationship.  These people are assholes and idiots.  You are not obliged to do anything for this woman who tried to throw you away because she had a new boyfriend and wanted to be free of responsibilities.  She had a chance to have a relationship with you and blew it for the sake of some novelty.  From now on, that relationship is on YOUR terms.  \n\nMaybe at some point you'll want to try to rebuild it.  Maybe you'll decide that she's not worth the trouble.  You are the ONLY person who gets to make that call.\n\nAs for the others chiming in about your dad... meh. Again, it's your call. You have an awful lot of stress and emotional upheaval in your life right now. Maybe he's a great person, maybe he's a total trainwreck like your mom.  Probably he's a human being who's a little bit of both, and most likely he's not going anywhere.  Chances are good that you have a long time to decide whether or not you want to have him in your life.  Make the decision that's right for you, when you feel it's time to make it.  ",
            "You made the right decision. It sounds like your aunt and uncle care about you a lot, and you seem to have thrived in every part of your new life; your mother made a flippant decision before, and it sounds like she wants you to come back to her so that she can get her hands on the money that your father means for you to have.\n\nCongratulations on adapting so well and making such mature decisions!",
            "Your Aunt and Uncle rock. Enjoy their company. Learn what they are teaching you (how to be part of a caring family.) Tell them you love them and appreciate them every chance you get.\n\nYou shouldn't feel bad now, you should feel ecstatic. You are now with people who love you and want you in their life. That's a big ole plus in the win column.\n\nI'd talk with your father. There's a chance that he was driven out of your life by your mother.",
            "Lucy you're so brave and strong!!",
            "Since your mother couldn't wait TWO YEARS to re-boot her life, she misses out knowing you now. What a loser. You keep doing what you're doing, and thank your aunt for taking the reigns your mother dropped.\n\nYou know, I can't help but notice that your mother is only 16 years older than you. I am sure that plays into this scenario (not to excuse it, but only to understand)... she probably \"missed out\" on a lot of things her friends were doing in their late teens/early 20's because she was raising a child. She made a choice there, though, and she clearly was not willing to see it through till the conclusion. I just can't believe she didn't quit sooner, or wait until you were off to college. Two years to the finish line, damn.\n\nAnyway, best of luck to you. Thanks for sharing your story. You are awesome, keep your head up, and have a great life. You have earned it.",
            "Hey man, you made it out, now stay gone. ",
            "Mom, this isn't a fucking job. There's no two week notice, no paid vacation, no 401k. You're a fucking mother till the day you die, be one.",
            "Your aunt and uncle are being wonderful parents to you, they are gems. Unless your dad is some crazy criminal that you want nothing to do with, give him a chance and have a talk with him. When one door closes, another one opens.",
            "It sounds like you finally have an amazing mother figure in your auntie. Seriously. She sounds like an wonderful woman. This is her sister she is standing up against because she loves you and realizes what your mother is doing, is wrong. The fact that she has made a savings for you is incredible. Many people with totally normal, caring parents do not have that. As you said, she could have used that money and she is putting your needs first. That sure sounds like a mom to me. \n\nPerhaps you will never call your auntie \"Mom\", but that is inconsequential in the long run. She is there for you in the way a mom would be. Of course it hurts to be rejected by your birth mother, especially in the way yours did. It's okay to feel hurt by that. And perhaps some counseling will help you better deal with those feelings. \n\nIt sounds like, in a way, your paths were supposed to cross in this way. She couldn't have her own children and you couldn't have your own mother, you were meant for each other.\n\nAs others have said, your experiences will only help you and build your character. You are already triumphing with a good support system. You're an extremely impressive person, a fact that seems to easily come across to people you meet. \n\nNever, ever feel as though this is embarrassing. It's not. And there are probably a lot more people at your school who feel abandoned by their families in one way or another. So if ever you feel compelled to talk more about this experience, don't hesitate due to shame. The only shame here is with your birth mother. There is nothing wrong with you. You had nothing to do with her abandonment whatsoever. ",
            "Wow I'm so sorry your mom did this to you.  But in spite of this it looks like you are worlds ahead of where your mom was at 16.  Keep up the good work so glad you have other family who show you they truly care about you!",
            "ugh...makes you wonder where the checks for the last 16 years all went. Money can really bring out the asshole in people.",
            "Darling, you're just going to have to keep on trucking. \n\nParental problems are really hard, and they're much too prevalent in today's society where parents just want to be kids again. A lot of us have parents that got into the game when they were way too young, and some of them never though to grow up. We're chemically bonded to our parents because they made us, and we'll always carry a piece of them around, but as long as you have a good support system, and keep on with your hobbies and extracurricular activities (and your grades, young lady), then you'll be okay.\n\nAt sixteen, anything can feel like the end of the world, but once you get older, you realize that it's not what happened to you that defines you as a person, but how you handle it, and I think you're handling it just fine. Just let it go and continue discovering yourself.\n\nTL;DR You'll be okay as long as you focus on yourself and what really matters in your life going forward.",
            "Make sure that money is going into YOUR account.  ",
            "If you want to be a drama director, you should write a play (and be the director) about a young lady who was alone against the world after her mother left her. How it all revolved around her and the transition of having a stable life to achieving the perfect life!",
            "Wow, what a great kid you are! If you were my daughter I'd be super proud. Sounds like you're handling the sewage in your life with panache. If you stay on track things are just gonna get better and better. Way to go! Keep it up! YOU GOT THIS.",
            "Sounds like you are moving in the right direction! Good for you! Never speak to your mother again, ever.",
            "Fuck that, stick by your Aunty, she's being a better mother than your birthing receptacle ever was. ",
            "You sound like you are handling this very well. I'm so glad you have an aunt who was able to step up to the plate. ",
            "I never read your original post but your story sounds alot like mine.  \n\nMy mom left because she had poor parenting skills and couldn't deal with teenagers.  She also suffered from depression and used drugs as a way to medicate her depression.  I had 3 older sisters who had all run away from home in their teens.  I was adopted by some friends and my mom ran off to live with a boyfriend in Mexico.  I'm not angry with my mom.  My life turned out good despite her.  We've spoken on the phone a few times but I haven't seen her since she left me almost 20 years ago.  I'm going to visit her for the first time next month.",
            "Your mom is still your mom, even if she's not the mom you would have picked had you a choice.  We are biologically driven to have a bond with those related to us, and it is painful when that bond is broken or betrayed.  But it sounds like having your mom in your life would do more harm than good in the long term.\n\nYour Aunt sounds like a rock star.  I've worked with children and teenagers who have been in situations where a parent has sent them to live with a relative, and few have turned out so well.  The best recommendation I can give is to keep kicking ass like you have been, and be proud of the new life you have built.",
            "I just want to say: how awesome is your aunt? Not everyone would do what she has done for you! Be strong and I would bet your aunt is more than willing to be a shoulder to cry on if needed.",
            "So sorry that you are going through all of this and that your Mom, is so messed up.  I myself do not have a great relationship with my Mom. I can not complain about her not being a good Mom, she was when I was growing up, she spent time with me, took care of me, got me anything and everything I needed. It was when I started wanting Independence that we started having issues. My mother is a very difficult person, expects a lot from people and becomes angry and mean when she does not get it.  She has stated on more than one time that she did everything for me when growing up now she expects me to basically do everything for her . She lives by herself because I do not want her to live with me (If it was up to her she would), I can never do enough for her, no matter what I do, she always complains that I did not do enough. We are constantly fighting, shes' always criticizing me and my life and my choices. It's not easy, have not broken relationship with her because she's elderly now and part of me feels bad for her, since she has no one else (shes' basically driven everyone else away).   Just to let you know you are not the only one with a crappy Mom.  Wish you the best and keep going you are a great person, your Mom is the one with the issues, not you. ",
            "Your aunt is a good person. Have fun on your beach trip!",
            "I had to go through a move similar to yours going into my junior year. 300 miles away. Although the reason for my move wasn't as heartbreaking (my dad had to transfer jobs), I can relate to moving as a teenager halfway through high school. It's was one of the toughest things I had to go through, but I can look back now and say it was for the better. I met some amazing people and life threw some great things my way out there.\n\nIf you're still concerned about the college aspect of the move, don't worry, because you won't be screwed over. Keep doing well in school, and it'll still pay off greatly.\n\nYour aunt is a wonderful person, and you are very courageous in dealing with the situation. Keep your head held high and pushing on. You have a great support structure around you and a loving family.",
            "This is all terrible and yet really inspiring. I think you are doing really well for your age and give that aunt a hug from me! So glad you fell into the arms of someone who cares.\n\nAlso you are learning some of life's lessons really early and that is that no matter how horrible things get they can turn around really fast too, and the other is to throw out all negative people. Life is too short and there are too many really great people to waste your time with the negative ones.",
            "I'm so sorry for everything that's happened to you. Your mum has been so horrible and It must hurt so much but remember that you're very lucky to have your Aunt who obviously really loves you. You have family that cares for you and don't forget that. It must be really hard to decide what to do but I would definitely stay with your Aunt, no matter what if I were you. She seems very stable and like someone you can rely on. Good luck!!!",
            "What is a class treasurer?",
            "I'm giving you a hug across the Internet. Keep your head up and work on all the good things in your life. I'm sorry your mother isn't the mother you needed. It sounds like you might have one in your Aunt.",
            "Your aunt is a god damn rock star. I know it must hurt so, so, so, SO much but you're already in a much better place and in much more capable hands than when you made your first post. You already know you can get through a hard time, and you already know that you have a very loving support system all around you.\n\nWhat do you do now? You keep on keeping on. Don't deal with your mother anymore. I'd say to see your dad when you're good and ready. Chances are, your mother was the reason he hasn't contacted you.\n\nGood luck with everything. You are so strong and so loved.",
            "This sounds like a recipe for a Lifetime movie. The good kind with a happy ending. You have an awesome aunt.",
            "You made so many right choices I don't know where to begin. Good on you for not giving into your mother. Also, you have a great aunt; much respect to her.",
            "Oh, this must hurt so much. I am so sorry. You do sound like you are very strong and making the best of this. I'm really happy your Aunt had the foresight to know your Mom shouldn't be alone with you, it's really good she is looking out for you. I hope you continue to be taken care of, you deserve it.",
            "Sometimes, the parents is not who have birth to you, but who's there for you in the hardest moments. Your aunt/uncle are great people and you'll become stronger and a great mother to your future kids.\n\nStay positive!!! ",
            "Hang in there OP. Keep your chin up. You are strong.",
            "You are an incredibly brave individual. I can't understand how you feel, but I know it must hurt. But honestly, how your mother has treated you, you're making all the right decisions. Nobody, not your mother or anyone else, should ever use you for money (especially not your own mother, of all people.)\n\nKeep your chin up and keep being as brave as you are. Kick your mum to the curb and keep on with your new life. You absolutely deserve it, and she absolutely doesn't deserve you.",
            "Wow, this is tough. You sound strong and I am proud of you. Weird as it sounds because I don't know you. I hope you have a wonderful life and someday forgive your mother, not for her but for you and your healing process. I am glad you have such a good family. Hang in there. ",
            "Cutting ties with toxic family members is never easy, but I always wish I had done it sooner. In a few years, the pain from this will have receded to a manageable level and you will be so grateful you did this for yourself. You're smart to have made the decisions that you did, and I hope the best for you. You deserve people in your life who will value you more than a check and more than their childish whims. It might not mean much, but I'm really proud of you.",
            "congratulations on taking this so well. Of course it hurts and is embarrassing and all that, but you seem very mature. Much more so than someone who has not had to deal with anything like this. Because you have had these experiences you will have an advantage starting college next year. You'll be surprised by how many of your peers are completely unprepared to make their own decisions and deal with their emotions on their own. \n\nYour aunt seems like a tough cookie too, go auntie!",
            "You're killing it at life kid, just so you know.  It sounds like you've handled this with great maturity and aplomb and you've made the correct decision with your mother.  Don't get roped back in by her and you're gonna be just fine.",
            "No offense, your mom sounds toxic and like she may be a sociopath.  Avoiding her would probably be for the best.",
            "I'm so sorry you had to go through this, but it sounds like you're in a better place now with your awesome and supportive aunt and uncle. My mother did the same thing to my brother and I, except I didn't have anywhere to go so I got my GED and went to one of those for profit colleges (big mistake) and I've been on my own ever since. \n\nI would strongly recommend trying therapy again, and if it doesn't feel like it's working for you, try different therapists until you find someone that clicks. You sound much stronger and level headed than I was at your age but if you were raised by this type of horrible person, you might have some issues you're not aware of because of it. Best to nip those in the bud rather than end up suffering later in life. I'm finding myself having to completely turn my life around at age 30 and my biggest regret is not getting help sooner. I had no idea how bad my upbringing and being abandoned by my mom messed me up until recently. \n\nIt sounds like you've got a great future ahead, and I'm rooting for you!",
            "Stay strong. There will always be people in your life that know you are worth so much more than any piece of paper- doesn't matter which squiggly lines are printed on it. You are awesome. It sucks that someone who should see that can't see beyond themself, but life is neather easy or fair. ::hugs:: I wish you the best, LucyDiamondSky",
            "You know, at first your story sounds kind of sad, but then it sounds amazing.\n\nYour aunt is awesome. I am sorry for what your mother said and did to you, but it sounds like it doesn't run in the family.\n\nMy mom always said every family has a black sheep (and trust me, we all know who is the black sheep sister in my family -- same aunt who use to steal from my mother and my mother would just say \"I know, but she's family\").\n\nThe important thing though is your aunt is kind and generous and your family isn't all totally lost. In the end, I think this is an amazing story being written.\n\nI would definitely listen to what your father has to say. It may turn out to be something gorgeous. (I have lots of ideas, but honestly, now's just not the time for random ideas... Maybe for example your father never came around because it was your mother who told him to leave, etc).\n\nAnd we're all proud of you for standing up to your mom. That took courage and strength beyond your years. That's amazing. You're amazing.",
            "Wow. I'm 18 and male and I'm in a very similar situation except I left my dad  5 months ago and I get almost nothing from my mom who is poor. It sucks to be honest but it's manageable. I really recommend tons of scholarship writing to help improve your quality of life in the near future. If you wanna talk more pm me. I'm on my mobile so this message is a little too concise! Good riddance and good luck with you mom! My dad came over to borrow money and we (aunt and uncle) shot him down. Stick with your plan about improving the quality of life for number one (you)! ",
            "Take on the Maury show. They love this stuff.",
            "dang, that's a rough story, but you seem to be in good spirits and have a great living situation now. I'm sorry this happened but it might have been the best thing. Best wishes\n\nand I think you did the right thing with your mother, you sound more mature than she is",
            "I know you will be 10 times the mother she ever was, when and if you ever decide. You're worth more than a paycheck, you aunt clearly sees this and loves you very much.",
            "You should really crosspost this to Raisedbynarcissists.\n\nThat said, I'm really sorry you have such a spectacular idiot for a mother. If she can't see how amazing you are, then that's her problem :( You sound thoughtful, sweet, and strong. I hope everything just gets better and better for you.",
            "I've been in your position. Unlike you, however, I didn't have a supportive, loving, enviroment to call home. \n\nYou're in a very fortunate position and even though it hurts like hell, you'll be better off for it. \n\nDon't let what happened consume you, you can still love your mother and not want to be associated with her. Don't become bitter and angry, even though you have every right to be angry, don't let it consume you. \n\nFocus on your life and forge a strong bond with your aunt and uncle, they'll help you in ways no one else will be able to. ",
            "I wish I had some really amazing advice to give you that would make all of this less painful for you, but I don't. My younger sister (and I, to a degree) went throught the same thing with our mother. She kicked me out at 16, so I went to live with my father and started dealing with the psychological fallout of all the years of abuse from her. A year later, when my sister (who had not been similarly abused) was 16, our mother decided to marry her boyfriend and move across the continent--without my sister.\n\nShe and my sister had gotten along really well, so my sister took it very hard. She couldn't understand why she couldn't go with our mother or why the couple was moving. She also came to live under my father's care and spent the rest of high school as a seemingly different person. She got into drugs, her grades tanked, she withdrew socially from the rest of the family. She didn't want to talk about it with anyone. It really messed her up, and now, ten years later, she's realizing what our mother did to her was terrible and going through a healing process similar to mine.\n\nThis kind of thing can really mess a person up; my sister didn't really have an emotional support network after our mother left. She didn't have someone like your auntie to validate her and stand up for her. She didn't have the social and academic means that you have to enrich her life and help her find value in herself. You seem to really have made something decent out of a shitty situation. Please keep it up. Continue to talk about your experience, do well in all your pursuits, and definitely keep your auntie close.\n\nYou've had to deal with some serious shit from someone who was supposed to treat you better, but it sounds like you're going to emerge from this a stronger person. I hope this doesn't negatively affect your future relationships, but you seem like you have many resources and supports in place to live a healthy life. I wish you all the best. Stay strong!",
            "You are doing so great. You are so level headed and mature that I have no doubt you will do fine in life. Sometimes adults fail the people who rely on them. This is not a reflection on you but on them. Your mom may have dropped the ball but you aunt has been more than willing to pick it up. Focus on that instead.\n\nBTW I used to prepare applicants for college and grad school, and I can say without a doubt that you have what it takes to succeed. Let me know if you want any help with your college apps. I no longer work in that field, but I will gladly help you anyway I can.",
            "You have taken a very awful situation and handled it better than many adults would. I hope you maintain a good spirit and continue growing as a person. You have done so well. \n\nAnd you aunt is a saint of a soul and deserves all the hugs and love you can give her. ",
            "No need to be hurt; if your mom only wanted you because of a check, then that means it is literally the only reason she wanted you, which means it had nothing to do with your personality or anything about you; it means that this doesn't mean she doesn't like you or anything of the sort; basically, your personality is irrelevant and her reasoning has nothing to do with you, so it can't possibly be anything you have done or any way in which you have acted, so you can then not worry about it as long as you like your aunt.",
            "Talk to your dad. ",
            "Think of her as mentally retarded... \n\nBut if a mentally retarded person hits you or stabs you, it will still hurt.\n\nKeep her out of your life but don't let her actions affect you too much"
        ]
    },
    {
        "post_id": "4eume9",
        "author": "Piss-poor-excuse",
        "title": "Me [28 M] with my wife [28 F] 6 years, she thinks I'm going to leave her because she's infertile. [UPDATE]",
        "url": "https://www.reddit.com/r/relationships/comments/4eume9/me_28_m_with_my_wife_28_f_6_years_she_thinks_im/",
        "score": 2240,
        "num_comments": 125,
        "created_utc": 1460686508.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/4donef/me_28_m_with_my_wife_28_f_6_years_she_thinks_im/\nOriginal post.\n\nSo I'm back not sure if anyone remembers me but I took everyone's advice to heart.\n\nSo my wife was in our room still in bed crying I wasn't sure what to do but I had an idea. I went in to our room and, sat next to her and held her for a little bit and calmed her down.\n\nAfter I asked her to get dressed because I wanted to take her somewhere special. (The restaurant I took her for our first date surprisingly I remembered after all this time)\n\nShe didn't know where we were going but once we got there she got all giddy and happy. We ate and, talked for a bit and listened to the music she seemed happy which is all I really want.\n\nWe went home and I told her I wanted to talk to her.(I wrote down what I wanted to say)\n   \nHere's what I said.\n\n\"Ever since I first met you I knew I wanted to be with you forever, I just couldn't find the words to express it.\n\nYour my world there's nothing that could ever replace you out of the billions of women your special. Because your one of a kind, sure there's other women out there but in my eyes they don't compare.\n\nYour my companion my partner my teammate, and I'll always be here to pick you up when your down.\"\n\nShe cried a lot more and she she calmed down she wanted sex but it was different. It was slower and, calm we looked into each other's eyes until the end.\n\nI reassured that I'm not going anywhere and that I married her and made a commitment to her. We cuddled the whole night after.\n\nI talked to her more the next day about some therapy and she agreed as long as I go with her. (She doesn't want to do it alone) \n\nAs for the whole \"children\" subject I'm going to wait a little bit until she's feeling better. Right now I don't think talking about kids would benefit her anyway.\n\n\nWe also talked about traveling in the future seeing some places and experience things together. Other than that she seems okay now I know she's not fully feeling better but she's happier a little.\n\nHonestly having kids didn't really matter to me as long as I have her I'm happy. But there's the update not too long but that's what happened these past few days.\n\n\n\n\n**tl;dr**: talked to my wife and reassured her that I'm not going anywhere we also talked about therapy and future plans.\n\nIt's all getting better now.",
        "permalink": "/r/relationships/comments/4eume9/me_28_m_with_my_wife_28_f_6_years_she_thinks_im/",
        "comments": [
            "You sound like a sweet guy, and I wish you the best. Good luck with getting everything sorted out. ",
            "Jesus you're a good husband. Everyone on this sub better take notes. This is how an update is supposed to go.",
            "Great job!  I also couldn't \"give\" my husband a child.  Let me give you one piece of advice.  don't go out to a meal on mother's day.  It's awful--mom's getting a flower from the restaurant, families all out celebrating.  Lots of babies around. We also stay home from church on Mother's Day.",
            "I actually cried reading this, I can't imagine anything you could have done that would have been more perfect. ",
            "You are not only an amazing husband but an amazing human being as well. Seriously, if there were more people like you in the world, we'd all be a lot better off.",
            "48 year old guy here. I don't think that could have been handled more beautifully. Nicely done.",
            "I was in your shoes exactly. My wife and I tried for years to have a child and we had the same issues. \n\nIt's really common for people that were in our situation. Fertility issues change a marriage, good or bad. It will make you two come together more or destroy your relationship. You guys seem to be on the right path. \n\nMy advice is to travel and have some fun. That's the main reason you got married to each other, you enjoy the company. \n\nNow here is a warning, this will not last forever. You guys are young and wanting kids only get worse as you get older. If you really want them, get in the adoption process now. It will take several years anyway. There are foreign adoptions and domestic foster adoptions. \n\nIt sounds like you two would make great parents and not to explore that possibility would be a shame. \n\nAlso, you never know what will happen. We went through 3 IUI and 7 IVFs to try to have a kid. I was looking a purchasing a 28 foot Grady White boat when we got the news my wife was pregnant. Now we have a 9 year old daughter and no boat. \n\nGood luck.   ",
            "That is so sweet. I love happy updates. ",
            "You handled this really well! I think it bodes well for your marriage and am wishing you both good fortune moving forward!",
            "Wow you marriaged the shit out of that. Your wife is a lucky woman. You guys are going to work through this and come out the other side even stronger for it. ",
            "That's so awesome and sweet! But the grammar nazis in me is really upset by the use of your so many times instead of you're",
            "You are a good man and a good husband.",
            "My mother couldn't have kids. She was also infertile. But she loved kids. She adopted me and my sister from Korea and raised us as one of her own blood. Adoption is a very good alternative :) don't give up the thoughts about kids, there is a way",
            "*You're\n\nI'm sorry.",
            "Infinite husband points to you! ",
            "As a woman who went through this in the last 1-2 years, you're going to need to do this again.  Processing that HUGE change in expectations takes time, and the thought of it being your \"fault\" is hard to work through.  The temporary depression is real.  And the scary thoughts of \"what if he changes his mind\" \"what if he's still working through it and decides to leave\" are recurring.  They will lose intensity and frequency over time, but be aware that they will come again for a while.\n\n\nBut the way you dealt with it was perfect.  Just be aware of her emotional state for a while, and if you need to up the romance or encouragement, do it.\n\n\nAlso, be aware of your own emotional state for the next year or so.  You're going to have to process this, too, and you don't want to say something you regret later while you're working through the grieving process.  You might need a bff to work through things like denial and bargaining stages, because telling a friend you wish there was a surgery, an option, go back in time, whatever, is going to be okay, but saying it to your wife is going to hurt her and she may feel you're blaming her and may start the \"is he going to leave me\" thought process.\n\nI wish you patience and happiness, OP.  Your relationship will make it through this. ",
            "Taking her to your first date spot... fucking brilliant.",
            "I really enjoyed this update, OP. This one really hit home with me as I commented on your previous post saying I felt exactly how your wife felt. I'm so glad there are men in the world who are like you and I hope I come to find my SO is the same.\n\nGood job and I think what you told her was beautiful. I would've cried too. :')",
            "You handled that like a boss. You're a good guy and she's lucky to have you. ",
            "Man, your speech to her even made me want to cry. You're a good man OP. So nice to see a loving, devoted partner on here. I'm glad to hear she's doing better.  Wishing you two well!",
            "That's perfect. :) as a woman who is infertile I had the same worries. It meant the world to me when my husband made me feel special and loved. You're a good hubby. Well done.",
            "You handled that very well, and I'm really happy for both of you.\n\n...That being said, the contraction of \"you are\" is \"you're\". ",
            "'clam' is a great typo, given the context.  \n\nKidding aside, you sound like a wonderful guy.  I wish you a wonderful life together with your wife.",
            "As a woman going through similar issues I can relate to her tears. Please continue to be the strong husband you are she so badly needs it. Please don't criticize her for her feelings (I'm not saying you are, just being cautious) I hope therapy works out for her. It's something I need to start looking into as well. ",
            "Well if you guys change your mind you can always pay a surrogate or addopt.\n\nHer being infertile doesn't mean you guys win't have kids and a family a few years down the line.",
            "*-Reads what you said to her-*\n\nI will not cry at work! I will not cry at work! I will not cry at work!\n\n*-Blinks tears away-*",
            "She's a lucky lady. You're a lucky bloke.\n\nFist bump.",
            "Concentrate on the upsides of no kids. That may sink in for her",
            "You really did a great job. What a sweetie. I hope she feels better in time. ",
            "You the man.",
            "You're an amazing husband.  She is lucky to have you.\n\nIf it turns out you cannot ever have children and you don't adopt, I hope you and your wife can be happy with your family the way it is.  I don't want children myself and I know there are many wonderful opportunities my partner and I will have because we won't be held back by the financial and time constraints of kids.  Focus on the positive!  Children are wonderful, but there are so many ways you can be involved in a child's life without having given it to them.",
            "Good call OP. Every step of the way. You're a stand up guy.",
            "Oh my goodness. Those words were so perfect and beautiful, a real gift. OP you are a treasure.",
            "Wow, seriously, not many guys understand what you said up there. Myself being a guy, I can say I have friends who miss that entirely. \n\nRight on, brother. Keep being the poster husband.",
            "You are a keeper and an awesome husband. You handled this beautifully and your wife is lucky to have you. Hope you guys have a very happy future together!",
            "Well if the urge of ever wanting kids in your house, just get pets or adopt a kid :D ",
            "You're a great husband! So sweet. Now excuse me while I hunt down that onion laying somewhere around the house...",
            "<3 OP, thanks for being such a good partner.",
            "Travel and do all the things you couldn't do with kids, and if in the future, if you decide you both want kids, I hope you consider adoption. ",
            "D'aww super cute. Just avoid the movie Up by Pixar. ",
            "Look on the bright side of things, no worries about condoms or pills for the rest of your life.",
            "You did the right thing! You both are still so young, enjoy it!",
            "I cried lol This is so beautiful, you guys are going to always make it out of every rough spot, I can tell. I wish you all the love and happiness in the world.",
            "Meh, if you want kids just adopt anyways. What's the harm? And it's certainly better for the world than making a baby since there are plenty of kids out there to adopt.",
            "This is one of the loveliest things I've ever read. Your wife is so lucky to have someone like you in her life. :) I wish you two all the best.",
            "If you want kids but can't create any, why not adopt? ",
            "[deleted]",
            "I GOT TEARY EYED. YOU TWO ARE AMAZING.",
            "When we were going through this, my husband would say, \"you're enough. I married you because I love you, and want to spend my life with you. I would love to have kids with you, but it's not why I'm here.\" I was so afraid, not that he would deliberately leave me because I couldn't get pregnant, but that he might just cheat on me because shit happens in long relationships, and he'd get the other girl pregnant. \n\nAnd I'd like to second the advice of staying home on Mother's Day. Or plan a vacation to somewhere adults-only. It's a gigantic reminder that you're missing out on something you wanted. Drink a lot. Watch shitty movies. Cry. It's OK. It sucks, but no matter what happens, it's going to be ok.",
            "*applause*",
            "This is a huge blow, but you handled it as well as you could have, and probably far better than I would. Good on you, and I hope you both have a long happy relationship.",
            "This made me super happy :) I'm glad you guys are doing well!",
            "Adopt if you want kids.",
            "You could always go get a vasectomy and then say you're both even. ",
            "Tell your wife that for some guys, she's the ideal woman. If I was married to a woman like yours, I would not be contemplating getting a vasectomy in the coming months. I've never wanted children so an infertile woman is who I want to marry. ",
            "I'd recommend getting a second opinion after she's recovered a bit, just to confirm. \n\nMy SIL was told years ago by a doctor that she was completely infertile. She went to another doctor, who reviewed her record and retested her. New doctor said that there was no reason to believe she couldn't conceive. My SIL just gave birth to a healthy 9lb baby boy a few days ago, and she and my brother weren't even trying. It's only one case, but always see multiple doctors for stuff like this.\n\nAnyway, you are doing everything right. Your unwavering love and commitment will definitely help her through this. Work on yourselves and your relationship, and hopefully the other things will fall into place. :)",
            "You'll probably leave her. Time makes fools of us.",
            "Tell her she is actually a godsend. Now start frequenting r/childfree ",
            "I don't see why she's upset; she should feel lucky.",
            "You know theres other methods, surrogate mother, adoption, ect",
            ">**tl;dr**: talked to my wife\n\nWhy did you need reddit to tell you this? I'm so confused\n\n",
            "[removed]"
        ]
    },
    {
        "post_id": "1bq2t7o",
        "author": "ThrowRAproposing",
        "title": "My (25F) best friend (24M) proposed to me. I’m confused and mortified. Where can we go from here?",
        "url": "https://www.reddit.com/r/relationships/comments/1bq2t7o/my_25f_best_friend_24m_proposed_to_me_im_confused/",
        "score": 2235,
        "num_comments": 340,
        "created_utc": 1711650497.0,
        "selftext": "\nTLDR: My best friend off 2 years seems to think we’re in a relationship and decided to publicly propose to me. I have no idea what to do.\n\nFrankly I’m still in shock that this happened so this might be all over the place. Bear with me. All fake names etc etc.\n\nJordan and I met in University two years ago. We both started at the same time and because of our ages we were both considered ‘mature’ students. So we quickly became firm friends as we shared a dorm and we’d joke around together about us being old enough to be considered ‘mature’ in our early 20’s. We weren’t on the same course, but given we lived together, we would hang out pretty much all the time whenever we didn’t have a lecture. We joined a bunch of societies together, went drinking every weekend together, etc etc. It was a pretty sweet gig because it meant we were at least never alone. Obviously we made other friends, both alone and together, but we were always each other’s #1 at the end of the day.\n\nAt the moment we’re on spring holidays for Easter. And while we haven’t hung out constantly, we decided to make plans to visit each other’s hometowns, because we’re from very starkly different places.\nToday, we went to mine. Mine is a big city central. \n\nThis morning we went there and were wandering down the streets, doing some sightseeing, because he’s never been. \nThere’s typically a lot of street sellers here, trying to sell you everything from hotdogs to fluffy pokemon hats. I decided I wanted to get a caricature done. I’ve never had one and I thought it would be funny to get and hang over my bed when we got back for term. I asked Jordan if he wanted to get in and he refused. No worries, so I sat down to get it done.\nThey don’t take very long, 5/10 ish minutes, so I stayed looked straight forward at the artist the entire time. He finished the caricature, I loved it. So obviously I turn to show it properly to Jordan.\n\nWhen I turn though I literally don’t even know what to say. He’s down on one knee holding up a ring box. I don’t even really know what he said, if he did the whole like proposal speech thing because I was so confused, I was barely paying attention.\nRemember again, this is a super busy tourist city, so this has drawn a mini crowd now, coming over to cheer us on.\n\nI couldn’t help but burst into laughter. To be honest, I thought this was some kind of odd prank type thing. We never HAVE been ‘prankster’ types or whatever but I couldn’t come up with a reasonable explanation. So I just laughed and laughed and laughed. Until I looked at Jordan and he looked genuinely heartbroken.\nSo obviously I asked him something along the lines of ‘You’re not being serious?’. \nThis is the only thing I remember him saying. He shut the box, stood up, shrugged and said ‘I guess not anymore’. And walked off.\n\nThis left me standing pretty awkwardly in this gathered crowd of people, a lot of who were giving me dirty looks, which made me incredibly uncomfortable. \n\nThe plan was to meet back up a hotel that we had booked rooms next door to one another. So I figure that’s where he’s going and head back that way. But he’s not there. So I wait and I wait, and he still doesn’t return.\n\nI text him out of concern, this was at 1:15pm (it’s currently 6:20pm as I’m writing this) just asking if he’s okay. \nHe responds with a LONG message back (which I would post, because it’s an odd read, but I won’t out of respect for his privacy), in which he basically accuses me of leading him on, asking why I didn’t ’break up with him sooner’, saying I had ‘publicly humiliated’ him and that he ‘thought I loved him the same way’ and that he felt our ‘relationship was strong enough to consider taking the next step’.\nNow this is completely out of left field. I literally have got no idea where in the world he’s got this idea from. The closest we’ve ever physically been is a hug hello and goodbye. I’ve never even jokingly flirted with him (for exactly this reason, I’ve had too many friendships collapse because they can’t tell the difference between serious interesting and joking banter in friendships, so I’ve been extra careful to not). We’ve never kissed, never been on a date, never had sex. I do not find him physically attractive and I wouldn’t want to be in a relationship with him.\n\nI don’t understand where on Earth he’s got this idea that we are. This isn’t something he’s ever bought up before this and I’m genuinely bewildered.\n\nHe hasn’t returned to the hotel yet, I periodically knock to check, and I’ve been listening out for him walking up the hallway or anything. Nothing. I haven’t responded to his long paragraph because honestly? I don’t know how to.\n\nI’m just so stunned and taken aback that I genuinely have no idea where to go from here or what to do.\n\nI haven’t told anyone I know in person yet, mostly because I don’t want to bring this up to people who know Jordan. So here I am turning to strangers on reddit instead.\nWhat in the world do I do 😭",
        "permalink": "/r/relationships/comments/1bq2t7o/my_25f_best_friend_24m_proposed_to_me_im_confused/",
        "comments": [
            "Has he ever been in a relationship before, like actually had a girlfriend? ...Is he like the type of fundamentalist Christian who believes in no kissing before marriage or something?\n\nI don't know, my instinct would be to ask him to talk with you, and have it out pointing out all the ways in which you're not actually dating (never asked each other out on a date specifically, no physical intimacy). Like, when does he remember this \"relationship\" being official? \n\nBut then again, he's possibly off his rocker a bit if he's created this delusion in his head. \n\nI think you're going to have to walk away from this friendship. Can you reach out to any mutual friends and ask them their take on this? (If you trust them not to gossip.)",
            "[deleted]",
            "That is just straight up delusional behavior. He built up an entire relationship with you in his head and decided it warranted *proposing to you in public.* Nevermind the fact that even for devoted couples, marriage should be discussed and agreed upon before anyone proposes to anyone. You need to tell him you're just friends, you've always been just friends and you can't and don't see your relationship any other way. Frankly, I'd do it in a text just in case he handles it poorly and decides to do something unpredictable from having his grandiose delusions shattered all at once.",
            "I want to reiterate not to discuss this with him in a private place like your hotel room. Go somewhere public. He’s delusional. That can be unsafe for you. You never saw this coming and I would hate for anything else to happen that you didn’t see coming. Please keep yourself safe until you figure out wtf is going through his head. This is really wild and I hope you give us an update when you figure it out!",
            "OP this is so left field, respectfully, surely it's some type of mental breakdown?",
            "You gotta walk away this is nuts. I wouldn't even give him a chance to stay a friend.",
            "So You've never kissed or had anything more intimate than a kiss and he thinks you're in a relationship? Honestly that's concerning and it's not your fault for not being a mind reader",
            "Like not ironically or joking or anything—he should see a doctor. That’s actually really concerning.",
            "Could it be he’s going through a manic or delusional episode? That could explain it. In that case he needs help asap. Do you know his parents?",
            "Do not meet him up at the hotel room! Maybe he’s just confused, maybe he wouldn’t do anything, but I wouldn’t risk it regarding how delusional he’s being. Just leave and propose to meet in public at another date, because this is not someone right in the mind.",
            "This is crazy. Please post an update. I hope you remain safe and he gets some help",
            "I am so sorry you are going through this. You obviously really value his friendship and regardless of what happens next, you will be grieving the loss of your best friend. \n\nThe craziest thing for me is this: did neither of you date or sleep with anybody else the whole time you’ve been friends? Have you ever suggested to him that he should go talk to the cute girl in the library or told him you thought that the guy at the bar was hot? To be clear, I 1000% believe that you did not lead him on and I agree with everyone else that he is delusional but how did the subject of dating (other people) NEVER come up? How did you introduce each other when meeting new people? You must’ve said “this is my friend Jordan” at some point. This man needs serious mental health help ASAP.",
            "Ummm. You are roommates. It’s news to you that he even had romantic feelings for you, let alone thinks you’re in a relationship. Honestly, what he did was super shitty. This is a him problem. I’d leave him be and wait for him to contact you…if you even want that. Just know this friendship is over.",
            "I don't know what the wall of text he sent you said, but I do think that you should use this as an opportunity to state your position in writing before he gets more of a chance to derail his perception of reality. He seems to think that he's in the right to feel embarrassed and that this isn't something that he brought onto himself.\n\nI think that you should definitely answer his text with boundaries and, honestly, a bit pissed off. You can totally be worried about someone you care for while also being stern about what just happened and how much he jumped to conclusions despite ALL the evidence against it.",
            "He's clearly delusional. I would text him back a long message explaining that you're just friends, and you have no idea how he got the idea that it was something else. Basically, explain it the way you did here- no physical intimacy, no dating, nothing. \n\nI know it's shitty to do over text but he sounds unstable. I can't imagine him taking this well.\n\nI would hate to see what would've happened if you had ever gotten a real bf...",
            "> he felt our ‘relationship was strong enough to consider taking the next step’\n\nPretty sure the “next step” would be a kiss, not a fucking engagement ring",
            "This is honestly very scary, please be safe",
            "Please make sure that someone else, like a trusted friend or family member, knows what’s going on and where you are. It’s just better to be safe than sorry. \n\nPlease also update us on what happens!",
            "The fact that you guys never dated and he accused you of leading him on tells me he was just biding his time.  I’m sorry.  Please be safe.",
            "Well the only possible answer now is to get married.",
            "Boom - major distance starting now. No more living together, no more hanging out one on one, no trips together even in separate rooms. Don’t text him, but leave him unblocked unless he gets too unhinged so that he might let on what his whereabouts are. Tell your friends about this. A guy that will try to impose his romantic fantasy on you definitely is a risk for a revenge fantasy, too. You need to be safe. I know you’re probably thinking, “but I know him, he wouldn’t do that.” The fact is, you’d probably have said the same a week ago if somebody had said, “what if Jordan proposes to you on this trip?” You don’t know the inner workings of his mind.",
            "I would only meet with him in a public place. I would be concerned he is developing schizophrenia or some other mental illness, he's the right age for it .",
            "There's no saving this. \n\nBut please do tell other people in your friend group, otherwise he will lie to them and try to ruin your reputation.",
            "Two guesses.\n\nThe cynical side of me (which is the stronger side) is that Jordan is gaslighting you - real, actual gaslighting, not internet gaslighting. He's creating this narrative that you've been in a romantic relationship - or at least that you've been \"leading him on\" - in an effort to convince you that you really did have something that you are obligated to act on. \n\nThe...less cynical side is wondering if maybe something is very odd with Jordan - perhaps he's not good at social skills and signals, or has some sort of psychological disposition to read way too much into everything.\n\nEither way, it kind of doesn't matter. You never dated, you don't love him, and you don't want to marry him. If he truly thought the relationship was 'strong enough' to take you to the next step, then he would've talked to you about it! Proposals are not supposed to be surprises.\n\nPersonally, I would text him back with exactly what you said here (so you have a textual record, and so that you can lay it all out). We were never in a relationship, so there was nothing to break up. You did not publicly humiliate him; he humiliated himself by asking you to marry him out of left field when you were never in a romantic relationship. You never had a remotely romantic or sexual relationship with each other, you've never talked about marriage before, you've never even kissed him - why on earth would he think you were dating, much less close enough that you were ready to get *married?* \n\nAlso, fuck those people who were giving you dirty looks. A woman is not obligated to marry a man just because he asks in public, and they have no idea what's going on.",
            "The guy is clearly delulu. Sorry, the friendship is over. From here, he's going to either completely disappear from your life, or he's going to make up lies about everything to save face. I hope for your sake it's the former",
            "Sounds like he was fantasizing on one hand and with the best friend and living together he had confirmation bias that you had also felt the same way.   Maybe in time you guys will have a friendly relationship again but right now just need reality to get through to him",
            "This seems really weird.  Were you FWBs?  In the 2 years that you were friends, did you ever date other people or talk about people you were attracted to?  \n\nTrying to understand why he had assumed you were in a relationship.",
            "Please stay with your parents, you are not safe atm",
            "Is he from a patriarchal culture? Have you had any relationships or flings while you guys were roommates? And what was his reaction to that if so?",
            "Wow, I consider most of what I read on this sub to be fake and even if this is too, I'm hooked. Can't wait for the follow up",
            "Well… this interesting. He’s delusional. There’s no way a sane person could assume you were together. Try to be safe, as he might be unpredictable once you talk with him. Start making arrangements to change roommates. This sucks big time, I’m so sorry.",
            "He isn't well. You did nothing wrong, and he turned it into something it wasn't. This is like stalker behavior. I'm worried about your safety. Don't talk to him alone, always have someone with you. Cut your trip short and go home.",
            "Don't feel bad for hurting his feelings. \n\nHe didn't even consider yours when he decided to publicly propose in your hometown knowing this could unfairly pressure you to saying yes...and then what?? \n\nHe made you feel uncomfortable and now he just ran off leaving you worried. \n\nThis is manipulative behavior and might not be the friend you thought he was. He doesn't seem like he's in his right mind and hasn't even had one conversation with you about anything.",
            "Plot Twist: you're the delusional one and you're mentally blocking out all the memories of being intimate and in a relationship with this guy for two years and Jordan is totally hurt and confused (basically Jordan's perspective).",
            "the fact that you guys are sleeping in seperate hotel rooms should have told him something",
            "It's wild that he went from you guys being roommates to that meaning you are in a serious enough relationship that he proposes! You sleep in different beds, you have zero affection. How could he possibly think this would have been a good idea?! I hope he comes back so you guys can talk this through. I'm interested in hearing his train of thought.",
            "I had this happen twice when I was younger. \n\nThey have created an entire imaginary relationship in their heads that never involved me in reality. Both times it was a total shock to me as I thought one was the boyfriend of my flatmate, and the other just a guy in our friend group (I didn't even know the correct name of the second guy when he proposed in front of all my girlfriends).\n\nNeither time it happened to me did the relationship continue, both guys never spoke to me again. The friendship, from my point of view, was just a lie - they were only in it for the imaginary girlfriend/wife experience.  It made me very wary of ever being friends with men again.",
            "Shame on the people giving her dirty looks. A woman who is proposed to in public has every right to say no. Imagine being put on the spot like that. My fiance proposed on the sidewalk. Some guy walked by, but that's it. I'd have been so scared if there were a bunch of strangers watching, and I wanted to say yes.",
            "I’m so sorry you’re having to deal with this. I second every person who has told you not to meet in any private place like your hotel room. \n\nI would come up with some things to mention to him about how YOU see a romantic relationship (i.e. being asked if you want a relationship, basic physical touch, more intimate physical touch) so that he can see your criteria for a relationship and his are not matching up.\n\nI would even mention that marriage isn’t something you take lightly and that you have quite a lot of milestones you would need to reach with someone before a big decision like that. Make it clear you have not had those milestones met by anyone hence the confusion. And if he’s such a good friend of yours then you thought he would talk to you about it before jumping in. \n\nI’m not saying you should do any of this so that he will think he has a chance but more so it can be a “misunderstanding” to protect you until you and he are FAR away from one another. You being alone with him is THE WORST thing for you so any way to speak to him gently when he’s being delusional and get out of this situation without him getting aggressive is the way I’d go.",
            "I just want to say I’m sorry OP. \n\nIt hurts to think someone is your genuine friend and then to find out that had ulterior motives the whole time. Or to find out they’re apparently fully delusional.",
            "You need to tell someone you know and trust, just to be safe. Don't let a bunch of strangers on Reddit be the only people who are aware of the situation. But also update us so we don't worry, ok?",
            "Do you know how many/how strong his friendships are outside of you?\n\nI think both the \"psychotic break\" and the \"sheltered/genuinely thought this was a relationship\" options are both on the table.  What would lean me more to the latter is if he doesn't have a single friendship that comes close to the level of emotional intimacy that the pair of you have had.\n\nTo quote the great Dr. NerdLove:\n\n\"Part of the reason for this is entirely social; men, specifically are socialized to equate emotional intimacy with romantic and sexual intimacy. From toddlerhood to puberty, boys tend to be gloriously open-hearted; we love and adore our friends and think nothing of it. But almost from the moment we hit puberty, we’re bombarded with lessons that teach us that the sort of open-hearted, freely expressive sort of affection we have for our friends – especially our male friends – is bad and wrong and signs of weakness or “being girly”… or worse...So when straight cis men become close friends with women… it feels entirely different than a lot of male friendships. It’s frequently more expressive, more emotionally intimate in ways that we have been taught to associate almost exclusively with romantic love… or at least with the possibility of sex, in any case.\"\n\nIf he is your only source of emotional intimacy, he's been too bought in to this socialization, and he's generally kind of sheltered (which coming from Northern England he absolutely could be), then it's totally possible he mistook \"a healthy and emotionally fulfilling close friendship\" as \"romantic interest\" straight up.",
            "what happened when you met his girlfriends?  \n\nwhat happened when he met your boyfriends?   \n\nthis has been going on for 2 years.  long enough to know better but short enough to move on and learn from it.",
            "This is a wild story! I’m so sorry that you’re in this situation. As others have said, speak to him about this over text or in public. There is at least some level of delusion going on here. Stay safe and keep us updated!",
            "What on Earth? Are you or he super religious where you don't believe in even kissing before marriage? I honestly don't know how someone could think they're in a relationship with someone who they've never kissed or even held hands with. I know people are jumping to him having some kind of mental break, or brain injury or something. He had a ring so this obviously wasn't spur of the moment, which honestly makes it scarier. He fully went out and bought a ring and waited for what he thought was the right moment to propose. Yikes. Be safe OP.",
            "I'm sorry OP but I think you need to end this friendship. I guess you could try to salvage it but this guy seems really strange. I've had guy friends declare their love for me when we weren't dating, so I know they can get feelings, but those guys knew we weren't dating and I guess were shooting their shot. I guarantee your friend thought you'd been on numerous dates as I had guy friends refer to us hanging out literally going to McDonald's as dates so in his head he thought these were undeclared dates. \n\nIt sucks if you lose a close friend but idk that behavior is just so strange and delusional to me. It does not seem like someone well would act that way. I really think I'd just distance myself from him.",
            "Oh god. I’ve had this kind of shit happen a lot. I am so so sorry. It’s weird. So weird. I hope things are okay in the end.",
            "pls give us an update!",
            "Is it inappropriate to ask for an update on this matter? Very curious as to what he thinks and what he says and does next. Please stay safe! ",
            "I had something similar happen but with a gaming friend online. He showed up in my city unannounced after I rejected him (politely) two months prior and insisted on seeing me. He was my friend so I did, and I ended up having to house him, feed him, and reject him all over again in person a second time (first time we had ever met irl). Was very awkward when I dropped him off at the airport and he begged me to let him stay. We hadn't spoken in those two months so he had no idea when he came to my city that I was seeing someone else, with whom I am now engaged. Haven't talked since.\n\nSome men do just be a bit confused, I think.",
            "Any updates? Hope you’re okay and safe.",
            "Is this a cultural thing that he might misunderstood it. I know it's a far fetch....",
            "Call your flat makes and see if he made his way back to them. Also talk to any of them that don’t have gossip tendencies and see if one or two of them could come to the city to hang out until you go back. You definitely should not be alone with this man.",
            "Not to be dramatic, but this sounds like a beginning of a true crime show. I know everyone posting here has already given you warnings, but really try to be extremely cautious with him. Talk to your other close roommates about this too, not only so they know but also so you can get perspective about what he has said in the past when you’re not around.\n\nI’m not sure if you have this kind of closeness, but are you aware of him ever having any mental health struggles in the past? Or when he retells stories that you were present for, does it ever seem like he’s adding in details that weren’t true? I forget the term, but there’s something brains can do where they rewrite memories/mix up memories and the person believes the mix up is true (similar to what happens with a lot of alien abduction stories). \n\nOverall I’m just so sad this happened to what seemed like a really close, trusting friendship. It reminds me of a friend my sister had in college—they would do everything together but never had any flirting/physical touch/romantic communication. Then in her sophomore year she started drinking more and going to fraternity parties. He literally sat her down like an angry parent, told her she had really disappointed him and that she had no value to him anymore because there was no potential to be romantic partners because she had a drink every so often. She literally had no hint that he was interested in her and she definitely was not interested in him that way. And yes, he literally used the term “no value.” Not as crazy as a proposal, but the delusion and entitlement feels very similar.",
            "It sounds weird to say, given that nothing has happened between you two, but I think this is actually a *bigger* red flag than if something *had* been going on between you two. This is a wholesale denial of reality. He is - and I'm not using this word as hyperbole, I mean it exactly as intended - *delusional*.\n\nYou absolutely should have a conversation with him, but I highly recommend you do it somewhere public, or you do it over the phone. If he's *this* detached from reality, I worry what he might try if you're alone in a room together.",
            "Has he seemed off at all lately? I’m wondering if it could be that he just developed schizophrenia, it often sets in during late teens to early 20s. Purely conjecture here but I’m having a hard time coming up with any explanation that makes sense.",
            "Honestly, you need to pack up your shit and leave. Don’t even bother trying to talk with him. Contact your dorm advisor, tell them you need new room pronto. Explain to them what happened, and you’re worried for your safety\n\nHis behaviour does not sit right with me. This has all the hallmarks of him doing something horrible to you out of anger/shame. Dont end up as tomorrow’s headline",
            "Ive read about people with bipolar proposing to friends during a manic episode but they don't typically plan it out enough to have a ring ready.\n\nThis honestly really scary OP. Are you still living together at uni? I seriously worry what someone this separated from reality is capable of doing once their version of reality is rejected.",
            "He sounds genuinely delusional, or perhaps deliberately self-deceiving. He was so busy imagining what he wanted with you, that he completely ignored who you actually are and what your relationship actually is.\n\nDon’t blame yourself for this. This is 100% on him. You haven’t “miscommunicated.” He is either genuinely mentally unwell, or just wildly incapable of seeing you as a human person with your own interiority that is just as real as his.",
            "This guy is mad at you bc HE misinterpreted the relationship. Stop trying to save his feelings. Stop feeling guilty. You’ve done nothing wrong. BE INDIGNANT! How DARE he? “This is YOUR fuck up, not mine. If you actually thought we were in a relationship, then I’m worried about your ability to see reality & not live on a dream you made up in your head. Ive done nothing wrong. NOTHING but you’ve ruined a great friendship & I urge you to seek counseling bc something is wrong w your reality perception.”",
            "Oh hell NOOOO. I’ve had guy friends go from 100% OBVIOUSLY platonic, to thinking we’re in a serious relationship out of nowhere. And then getting very upset that we are NOT on the same page. \n\nYOUR POST ACTUALLY MADE ME MAD. I’m so sorry this happened to you, in public. I honestly believe he was trying to pressure you into saying yes. FUCK. NO. \n\nMy only advice is to distance yourself. He’s going to guilt trip you for the next 3 years.",
            "I’ve heard of this type of thing before!! It was on one of the manosphere podcasts! The lonely man is supposed to propose to/ wish happy anniversary one of his close female friends and the objective is that maybe she’ll just go with it and then he will have a girlfriend/ wife",
            "Update me please! Hope everything is okay",
            "You need to tell someone you trust because that kind of delulu behavior can lead to something pretty bad.",
            "what the hell.. this is insanity, i’m so curious what is going on inside his head??? I hope you can have some sort of conversation with him to maybe get some clarity, but damn..",
            "This is a bit alarming. The fact you guys have never been physical or even discussed marriage, or what you'd want in life, like kids, family ect ect, is really trippy. That fact he proposed with no discussion about life plans really shows how detached he is. Good luck, Be safe, and I hope you can recover your friendship!",
            "Sorry you're going through this and hope you stay safe and he gets the help he needs",
            "Ya this dude is alot crazier than he shows you.  I want you to think back.  Do you remember moments he ever got mad at you hanging out with other guys or anything where it felt he was possessive over you?  The best thing for you both is for you to lay it out to him and that you just don't have those feelings for him and didn't know he had feelings.  Just now this could wreck the friendship as he might not accept no as an answer.  He might also agree to just be friends but continue trying to make you love him.  He also might just end the friendship.  Unfortunately this happens and you cannot control his actions.  I can't see anything that he could have misread.  At the moment let him cool off and pout.  The more you text/call and worry the more it strengthens him.  You ever seen (or experienced) those videos when young kids threaten to run away?  If the parent cries and begs the young child then the child has gotten the reaction they want.  When the parent responds with \"well take care,\" and goes back inside the Child immedialty abandons that idea.  Currently you are giving him the reaction he wants.  I would stop searching and let his phone go silent.  That silence will allow him to calm down and make him come back to the hotel.  Good luck",
            "I’m dying of secondhand embarrassment at the thought of the public proposal. What a completely bizarre thing for him to do. And to jump right to a proposal?? So completely strange. I’m honestly worried for you. Please see if you can find a different housing situation asap.",
            "End this friendship. What the hell is wrong with them to think this appropriate behavior. They are unhinged. Who proposes when you aren't even going out?",
            "Thats absolutely insane",
            "Has this guy *actually* had female friends? \nYou described a platonic friendship. He proposed. This is not normal. Honestly op I’m laughing but I’m like the dog in flames meme for your sanity and safety. \n“Hmmm yes, this is alright. This is okay” chuckles nervously*”\n\nThis is completely delusional dude. Y’all kids on top of this.",
            "This is full on stalker level of delusion",
            "I'm honestly not even sure what to say. Do NOT meet with him anywhere private (better safe than sorry). Since you're in your hometown, can you stay with someone?",
            "This is extremely alarming. Please consider that this person may be going through a mental health crisis, it certainly would look like delusion. I seriously recommend to put space between yous and look for somewhere else to stay. This person sounds like they maybe need a clinical intervention of some kind and I’m concerned for your safety - as are many others commenting OP.\n\nPlease tell your close family and trusted friends exactly what has occurred. Please regularly check in with them. Like others have given advice on your post, your safety is paramount and nothing about what you have described is normal. For now go speak to the hotel and ask to change rooms, tell them if you feel it’s necessary.",
            "This is terrifying, be safe",
            "Girl run! All the red flags are flying!\nTo quote a podcast \"stay sexy and don't get murdered\"\n\nDon't let him guilt you into being alone.\n\nOmg! What if he wanted to show up back home ENGAGED! what if you became stranded in a strange place 😳 my brain has activated horror movie mode.\n\nShare your location with trusted friends/family - stay safe",
            "I don't think this is a you problem OP, nor your issue to solve, but I would understand if you are concerned about this oerson. Has Jordan had any head injuries in the last few weeks? Even one that seems mild? Or has he shown any neurological ticks that may indicate a serious medical issue, such as using the wrong word suddenly, or \"buffy speak\", dilated pupils, or complaining about not being able to see or hear clearly. Had he had disrupted sleep or been clumsy?",
            "I would love to get an update too. I hope he is just off his medication/having an episode. Because then at least, it’s excusable and preventable and maybe your relationship can stay in tact. The other possibilities aren’t great.",
            "i had a friend do the same thing, instead of random group, ALLLL of his friends. thought we were inna relationship. no proposal but announced me as his girlfriend & i had to cut ties right then and there. stay safe sometimes people can get kinda crazy",
            "Oh man, this is such a sad situation. It's such a shame because loads of women are careful not to be too friendly to men in case they get the wrong idea, and this reaffirms that.\n\nI'm sorry this happened. As a man who has tons of female friends, no matter what he says, it's not your fault. Things have been pretty clear. He should have talked about how he feels, your bewildered reaction and nervous laughing is an understandable reaction, and even now you're being a good friend.",
            "He’s not your friend. Drop him.",
            "Unfortunately some people are lonely and can't read social cues. As soon as someone gives them attention they create a fantasy in their head and it can sometimes result in delusional behavior like this. \n\nUnless you're leaving out details, you didn't do anything wrong.",
            "I’ve not seen anyone else suggest it, but please let at least 1 person in your life know, share your location, etc so they can check in on you for all the same reasons it’s not a good idea to talk to him alone in his hotel room.",
            "You mourn the loss of a friendship that never really existed because he had designs on you probably from the beginning. If he's anything like many, many of my male friends, he will cut himself completely out of your life now that he knows you're not interested. I'm sorry this happened to you, op. It's heartbreaking to lose what you thought was your friend.",
            "Say NO. He's been working you, and he thought he was at the finish line. \n\nIt's really up to you. A public proposal is a desperate move. It's the Hail Mary of trying to force a relationship. If a woman (I'm a dude) proposed to me in a public place I'd be mortified.\n\nYou're not into him that way. Just say no, and don't have a several hour crying session with him. He will take it the wrong way.\n\nYou're in breakup territory.",
            "Have you ever had sex with him or partake in romantic / flirty / sexual activities of any kind? I’m just trying to figure out why he’s so delusional ",
            "He sounds mad disrespectful. Putting pressure on you by proposing in front of a crowd. Never ever asking you out on an actual date. Never ever giving you flowers, not ever taking you out to dinner. Low effort guy trying to tie you down before graduation.\n\nLose him. You can do better. He's not your friend. Travel back home without him. Don't wait for him. Don't seek contact with him. Avoid this guy.\n\nMarry someone who actually treats you with respect and has the balls to ask you out on many dates, first, and actually takes the time to build a relationship with you, and does not pressure you to 'give him an answer' in front of a crowd of people.\n\nHe walked straight into that one himself. If he didn't want to get laughed at, he could have proposed to you (or asked you out) in private, privately, or just not in such an overblown public manner. No one asked him to do that.",
            "I'm a bit late and I'm sure my comment will probably get lost. But this is exactly why you can't be friends with \"odd\" people. You can't feel sorry for them. They will take your kindness for granted and take advantage of you. Every guy I befriended because they were a bit strange or \"geeky\" turned out to become completely obsessed with me and convince themselves that we were in love without us having any kind of relationship (no flirting, kissing or sex). They've all turned out to be creeps. \n\nThis guy is a definite creep. To propose to you is just too crazy for words. Makes you wonder what else he is capable of doing. \"Normal\" people usually discuss marriage before a proposal, and \"normal\" people also have a freaking relationship before becoming engaged. \n\nCut all ties with this guy, it's clear you don't have the same idea. The fact that he is blaming YOU for rejecting him is just the ultimate NOPE and ick and that's all I need to know. Please drop him and unfriend him. He is unhealthily obsessed with you.",
            "If this is real, this type of relationship delusion is definitely a red flag. Might be alarmist, but I honestly think it'd be wise to try and transfer colleges because that type of delusional relationship ideation is usually heavily linked to stalking.",
            "i think he may have a mental problem, like seriously, where he’s developed a relationship of something from nothing…\n\nget out of there immediately, and don’t look back\n\neven if he was your best friend, it’s clear he’s not seen you like that at all and he will continue on this path",
            "I feel like I’m watching a lifetime movie unfold in real time. I’m invested now.",
            "This feels like a medical/mental health emergency.",
            "He went full on anxious attachment. I'm anxious attachment and currently in a situationship that can't progress because she has a lot of trauma to process first, BUT the point is I got delusional. We went on dates pretty regularly, I hang out at her house at least once a week. We call almost every day after work. She cooks family dinners for me, her daughter, her mother and me, at the point every other week or more. I'll spend whole days at her place doing mundane stuff like cooking, cleaning, laundry. And we have sex. And yet we are miles upon miles away from marriage. \n\nBut we talk it out, when I get caught up in my feelings towards her, we set boundaries together. She listens to everything I spew out and sometimes it's really mean, but we talk it out before I spiral into a \"she hates me and is going to ghost me\" mode. Your friend spiraled \"This will be so romantic and she's going to stay by my side for the rest of my life and never leave me\" I've never gotten that far, but trust me it's easy to get there in 2 years especially if you've never talked about your relationship or what you \"are\".",
            "Omg, wow, I wouldn't put up with that manipulative behavior.  Hopefully you can tell him that you both have always been just friends and drinking buddies and you never gave any indication that you were ever more so you have no clue why he proposed to you in public like that. Tell him it's his fault for creating a fake relationship in his head and how you reacted in public was not embarrassing him but that he embarrassed himself by surprising you with a proposal out of left field when you never talked about being more with him.\n\nI would say he humiliated you in public with a public proposal and the way people gave you dirty looks like that you wouldn't ever forgive him for doing that and wouldn't stay friends anymore after that.\n\nI hang out with my guy friends who are just friends exactly the way you hang out with your platonic good friend and neither of us ever pretended to be more because we're both with other people and we never hugged at all, either.\n\nI wouldn't put up with this nonsense from someone who you have been hanging out with as just friends and that you were kind to him to at least be a friend to go places with if neither of you could find a partner or someone else to go with.\n\nI'm shocked as well reading your post that he would do that to you in public.\n\nAnother person once tried to pretend to be with me even though I never told him I was interested when I wasn't and I shut that down real quick and said if a former friend was going to act like that I didn't have time for his mind games and I flat out told a former friend I never gave him a single hint as something more so I have no clue why he was hitting on me out of nowhere when we always talked as just friends.\n\nHopefully, you can tell him he's the one who is in the wrong and now he ruined a friendship. /u/ThrowRAproposing",
            "Get your stuff and leave. Don’t confront him. Just leave and cut him off. He’s unhinged",
            "Well, on the bright side, at least you got a funny caricature out of it! And hey, at least now you know that Jordan has some serious feelings for you - even if they are completely one-sided and based on a misunderstanding. Maybe try talking to him and explaining that you value him as a friend but don't see him in a romantic way. It'll be a tough conversation, but better to address it now than let it fester and potentially ruin your friendship. And who knows, maybe he'll eventually look back on this and see the humor in the situation. In the meantime, enjoy your holiday and try not to let this awkward moment ruin it!",
            "Wow and I thought I was delusional. Definitely not like this. Idk what got him to think that either. ",
            "This LITERALLY sounds like an opening scene for a romcom.",
            "Does he have a mental illness?\n\n\nAre you safe?   \n\n\nAlso in all this time what about your relationships.  Have you had a boyfriend or dated?",
            "Tell him he's got competition! I've never met or seen you, but will you marry me? ;)",
            "OP, the most important thing is to not treat him like he's crazy. He's already down in the dumps and had his \"reality\" come crumbling apart. You can ignore the people telling you that he's going to try to wear your skin. They're jumping to conclusions just as much, if not more, than he was. This is your best friend of 2 years, and he's confused. Hell, he may just remember a drunken conversation you two had or something, and it all stems from that.\n\nYou need to be honest with him and explain what you explained here. You need to be direct and say that you never thought of this as a boyfriend/girlfriend relationship and ask him why he assumed it was. Most likely. He viewed things as dates that you didn't. Hell, these days a lot of people get married without going on any sort of formal date. I know that's how my first marriage went down. Even for my new marriage, I think my spouse and I went on like... one date when we first met.",
            "Ok really weird but ffs answer his msg even if just to say to come back and talk. \n\nIf you don’t actually want to see him then leave the hotel and head home after msging Jim what you are doing",
            "When I was reading your post, in a lot of ways it sounds like you are a couple.\n\nYou did everything together...  maybe you do not see it as a relationship, but it does come across as one.\n\nIf he is at all on the spectrum, it could DEFINITLY seem like a very respectful relationship.\n\nMaybe you missed the signs form  him that he was into you at the same time he read your interactions as someone who cares for him.\n\nYou might want to look hard at your friendship,  maybe it is more than you are thinking and maybe it is less than he was.  \n\nIs he a bad guy?  Is he someone you would be against dating?  \n\nI will say, the best long term relationships can start as solid friendships.\n\nkeep us updated.",
            "This guy is crazy…I would want to be friends with him anymore. Personally, I’d rather be alone than have a guy friend that thinks he’s THIS in love with me when we haven’t been intimate at all. You must be really cute, though, if you keep running into this problem. :3\n\nSeriously though, you should go home (take a plane, drive, whatever) and let him know that it was absolutely not okay for him to do that. He publicly humiliated YOU. Detail everything wrong with this situation and go back to the people that really love you.",
            "I mean you're not wrong, and laughter is a completely normal response to something shocking, so give yourself grace there.\n\n\nYou're also doing good not to try to call friends immediately and tarnish his rep. You can talk to family though, for sure.\n\n\nFirst thing, you need to get through today and the rest of the trip. try to just get him to let you know he's ok and tell him you can talk or not talk at the hotel, whatever works for him, you just want to know he's safe and you've got a pizza there waiting when he's ready. (Get a pizza, or whatever).\n\n\nThen just move through this trip as best as possible and take his lead on talking about it. He's likely humiliated and very sad. So just be kind and get him on his way back home so he can go rebuild his life.\n\n\nYou need to put it straight that you're not in a romantic relationship, but maybe not today. Maybe that's something for the written word. You do deserve to have your say about being really confused, because you weren't in a dating relationship and there was no physicality and no conversations about dating. But he's not going to be able to hear it right away.\n\n\nThe friendship is over, almost certainly. And you will eventually need to do damage control with your social circle, but think of a way to put it that kind of gives him a chance to not be publicly mocked.\n\n\nHe's really quite delusional but it is a romantic thing to think of marrying your best friend. If he's very shy or sexually uncomfortable one can see how he might have built something different in his head than what is reality. Oh, it's really sad!\n\n\nBut yeah. What you need to do is get him through the rest of the trip safely and send him home. And then clarify what you experienced in this relationship.",
            "As far as him not having any other place to go but back to the hotel... No. There's a lot of places he could go. Most of them aren't good, so perhaps you should check some hospitals.\n\nI'll say this: I had a friendship with a girl when I was younger that I *thought* was a relationship. We were each other's number one. We hung out daily. I was a year older and when I went to university, they would call me almost every day to say hi and tell me they missed me. We said \"Love you\" at the end of every phone call. We were never intimate because, as I thought at the time, we both wanted to wait until we were ready. We kissed on the cheek but never more than that. \n\nI came back for holiday and my friends were going to have a little birthday party in my honor. She showed up with a guy. I didn't really know what to think or what was going on. \n\nShe told me that this guy was her boyfriend and they had been dating for a month. Prior to this moment, she hadn't mentioned him *at all*\n\nI was humiliated. I had saved up money and bought a very pretty necklace with her birthstone in it. I had planned a surprise trip to a resort town a few hours away where I had reserved a romantic cabin in the woods and I wanted to finally be intimate. It all just ended immediately. I left my own party, avoided her for the rest of the break, and spoke to her only twice more. Once, when she called me to clear the air and another when she came by the next time I was home so that she could return my things.\n\nLooking back, I see now how I misread so much but in the moment, it was my delusion coupled with her need for adoration that made me think we were a slow burn romance.\n\nI don't *not* believe you. This does sound a lot like someone grossly misread the situation but the glib tone with which you're responding to people here might indicate that you maybe aren't the best at empathy or being particularly thoughtful of other people's emotions? Maybe you always knew, deep down, but it was comforting and fun to have a shadow boyfriend for moments when you'd have otherwise been alone? If you had hookups that didn't go anywhere, it seems like you either couldn't form a romantic relationship or didn't want one. If you had someone doing for you everything that a boyfriend would, excepting intimacy, maybe you had a little more responsibility in this than you think?\n\nAt any rate, the best thing for *both* of you is to hard stop the friendship and go your own ways.",
            "I must admit it's kind of strange that he'd propose without even having dated or kissed you.  Perhaps he's very old-fashioned, in which case it might be out of turn as far as he's concerned.  All you can really do is explain to him that marriage isn't your goal and not what you want.  It will probably end your friendship and that's unfortunate but that's really all you can do.",
            "he might be delusional to a degree obviously, but i think this happens more often than people realise between younger people. i think if you decide to take this stance of him potentially being dangerous based off on this advice, then it's better you just cut him off completely imo. \n\nhe's gonna sense and tell, the next time you meet, if you are scared of him. it's just gonna break his heart even more and make an already, clearly, confusing situation worse. \n\nclearly, us guys have a responsebility to pick up on and interpret signals and communication correctly from you girls. but honestly, i dont really buy into your story that you never picked up on him sending you ANY signaling of being into you romantically before this happened. if that's true, then you are clearly somewhat delusional as well, and frankly, a bit immature and naive. just like him.",
            "The level of unnecessary detail in this story is remarkable.",
            "[removed]",
            "[removed]",
            "Either you lead him on or he's delusional"
        ]
    }
]