[
    {
        "post_id": "3c07ey",
        "author": "Relationships_Mods",
        "title": "In regards to going dark",
        "url": "https://www.reddit.com/r/relationships/comments/3c07ey/in_regards_to_going_dark/",
        "score": 2227,
        "num_comments": 15,
        "created_utc": 1435939693.0,
        "selftext": "We stand behind the other subreddits who want better mod tools and support from the Reddit admins, but we also understand the need for this community to remain active for those seeking help with their relationship problems. While we stand behind those seeking better mod support, we are choosing to remain public for our subscribers.",
        "permalink": "/r/relationships/comments/3c07ey/in_regards_to_going_dark/",
        "comments": []
    },
    {
        "post_id": "337ezx",
        "author": "Pseudoptics",
        "title": "UPDATE: My [23M] friend [20F] invites/begs me to accompany her on unnecessary shopping trips then asks me to pay for gas.",
        "url": "https://www.reddit.com/r/relationships/comments/337ezx/update_my_23m_friend_20f_invitesbegs_me_to/",
        "score": 2222,
        "num_comments": 237,
        "created_utc": 1429509126.0,
        "selftext": "[Original/Exposition](http://ud.reddit.com/r/relationships/comments/32r9i3/my_23m_friend_20f_invitesbegs_me_to_accompany_her/)\n\nAs stated before, her actions are relatively recent. She hasn't been a bad friend since I met her. She's one of those \"SuperWhoLock\" theatre push-over tumblr gals (her words, not mine). So this took me by surprise. \n\nI decided to sit her down in a public place and speak with her about the issue. I told her that I don't have a lot of money and I won't flip the bill on trips she invites me too. \n\nOf course, she got angry. She stated that I shouldn't *use* her and I was a bad friend. \n\nI ended up giggling in reply, as I do this when I'm nervous. This infuriated her. \n\nShe went on a long winded monologue about how she knows my *type* and how since she's from Long Island I think she has money. Blah blah blah. \n\nWhen she finally stopped, I informed her that that was not the case. I explained that I don't care about her parent's money, but our friendship. After further discussion, she started to tear up. \n\nTurns out that though Mommy and Daddy bought her the car AND was providing her with gas money (an allowance, per se), she was saving up for something she wanted. This *something* was a five thousand dollar trip to have her online boyfriend fly up this summer and to put him in a ritzy hotel. Her parents didn't approve of her relationship, so they would not fund it. \n\nApparently, she has been hustling people out of their money in order to fund the trip, while continuing her luxury lifestyle. \n\nI believe she expected me to feel some sort of sympathy for her. She was teary eyed and sniffling about *true love* and how she is doing this to meet the *one*. But I couldn't take it. \n\nI ended up explaining to her that she cannot use people as human ATMs. And that even though she is a nice girl, I don't appreciate her doing ugly things. \n\nShe babbled on about how I wouldn't understand because *love* or some shit. \n\nI sighed and ended my friendship with her on the spot. I've spent a lot of time with this girl and collected several good memories, but someone who refuses to see their own wrong doings is not for me. \n\nTL;DR: Confront friend about using me. She denies it, saying I'm using her. She reveals why she was using me (and others). I end the friendship when she refuses to see the error of her ways. \n\nEDIT: Wouldn't really classify her as a \"Tumblrina\". She likes tumblr culture, but she isn't as radical/insane as the ones I've seen online. \n\nEDIT 2: Still very much Gay. ",
        "permalink": "/r/relationships/comments/337ezx/update_my_23m_friend_20f_invitesbegs_me_to/",
        "comments": [
            "I often wonder what the ceiling is for people like this in terms of personal growth.  I know a lot of people who were entirely self-centered and ridiculous like this in their teens who turned it around and became mature, great humans.  However, I have not met many people who were able to grow past such behaviors after they hit 20.  I don't know if it's some sort of critical period, or if I'm just entirely wrong, but it just seems like when a person is still treating other people like props in their life by the time they're supposed to be at least somewhat personally independent and responsible, the future is bleak.\n\nLet's hope that your ex-friend learns how to be a regular human person sometime in her future.  However, you're making the right move not waiting around to find out if she does.",
            "She's toxic, good for you for ending your friendship (which it's debatable if you could call it that)",
            "Many selfish people simply do not realize they are selfish.  They think people just don't understand their needs.\n\nBut once you start lying you are a next level shitbag.",
            "Why the hell does he need to be in a nice hotel? I've stayed in so many shitty hotels to be with my fiancé, because we're young and we know it's fucking stupid to blow money like that. It's being together that counts. Ugh.\n\nCongrats on dumping a greedy, stupid, *and* selfish friend!",
            "What the hell, I was not expecting this story to end like that. I thought maybe she was just highly inconsiderate. But stealing money?! Why wouldn't she just ask her parents for money pretending it's not for her bf instead of creating this plan to steal from her \"friends\". This girl is going to end up alone. Still super sucky though, breaking up with friends is rough. Good for you for standing up to her. ",
            "Good for you for being upfront and honest about your issue with her. And for ending the friendship when she refused to admit to any wrong-doing. I wouldn't want to be friends with someone that thought it was okay to use people as human ATMs. It's a huge red flag. \n\nIf she's willing to basically trick/guilt you into accompanying her on these excursions just to ask for 'gas money', what else is she capable of? The fact that she clearly planned this money-making strategy out is freaky enough. Who sits down and thinks to themselves \"I need money..what's the easiest/fastest way to do it?\" Manipulative as fuck. ",
            "> I ended up giggling in reply, as I do this when I'm nervous. This infuriated her. \n\nI actually loved that you giggled, as that was the perfect response to her ridiculous statement.  Good for you all the way on this one.",
            "> she was saving up for something she wanted. This something was a five thousand dollar trip to have her online boyfriend fly up this summer and to put him in a ritzy hotel. Her parents didn't approve of her relationship, so they would not fund it.\n\nI a few questions for her but I can wait until she shows up on /r/relationship",
            "That's...interesting, I suppose? \"I need Money, but don't want to save my own, so I'll take it from whoever is dumb enough to befriend me\"\n\nGood way to die alone and friendless. ",
            ">She stated that I shouldn't use her and I was a bad friend\n\noh man this part made me giggle. honestly glad you got that all sorted out and decided to end that \"friendship\". \n\ni hope she doesn't suck too much money out of her other victims.",
            " OP I don't think it had many up votes but I said this on the last one. And this is a lesson that I have learnt and a thing you may notice that people do in the future. Some kids that come from money and have an expense that their parents won't pay, are so used to viewing people as a cash source, not a job, and \"earning\" money not from their hard work, but just being them. Confronted with their parents not giving them money will figure out ways to get it from others. All of a sudden every favour they did you ever will need you to pay them back, or they will want back items that they gifted you years ago.\n\nIt's unfortunate that your friendship had to end, but you have also learned a behaviour you can keep an eye out for in the future and save yourself further heartache.\n\nAlso I find it ironic that she is worried that everyone thinks she is a moneybags, when clearly the guy in this long distance relationship does and is exploiting it.",
            "That...is utterly ridiculous and very nasty. I come from a wealthy background and non of my childhood friends have ever tried to use others as human ATMs. This is not some bizarre misunderstanding of the value of money or other people's income brackets - this is her being a nasty human being and not seeing you guys as human, but in terms of what you can do for *her*. This flies straight past \"selfish\" and lands squarely on \"narcissistic\". Good for you OP for ending the friendship. I don't think this person really understands what friendship even is.",
            "[deleted]",
            "haha what a bitch. Rich kids just dont understand why money can be a \"big deal\" to some people, even when they need it.",
            "Finally, an OP that has the spine to do what is needed and does not let herself be treated as a doormat. That whole \"plan\" of hers and how she is ripping off her friends to fund it is just so wrong and stupid on so many levels. People who try to pull off shit of this caliber got issues and will more or less always try to pull off something equally or more retarded down the line. Good riddance.",
            "Why doesn't she just become a Uber driver?",
            "Wow!!! That is crazy!!! She wants to fund \"this online\" guy who she has never met airfare/hotel?!? She had the gall to ask her parents to fund it!?!? OMG!!! Honestly I kinda want to know how it turned out for her??? Bet this guy is a hustler too!!! ",
            "Angrily accuses you of using her; admits to using you and other people as well.\n\nWow. I just.. I don't even know. That's next level asshole right there. Not top tier, but next level for sure. It would probably be easier and quicker for her to just get a part time job.",
            "> how since she's from Long Island I think she has money.\n\nAs someone from Long Island... what? Is this a thing?\n\nAnyway, good going, OP. Life is too short for friends like that.",
            "As someone from Long Island, lol what? Is there some sort of reputation that we're rich or something? I can guarantee you that the really rich people on LI are not even full time residents and only come out for the summer.",
            "What this girl needs to do is become an Uber driver :-)",
            "She's stuck in her own little world, and won't see sense most likely until shit hits the fan big time for her. But you will be long gone as a friend.\n\nUnbelievable. Toxic. I'm glad you stood your ground and confronted her.\n\nGood for you!",
            "Bravo mate. It is always something else that makes you very upset. It wasn't your laugh. It was that she already knew, maybe subconsciously, that what she was doing was wrong. At least I deeply hope she realizes that what she is doing is just a ludicrous way to treat people.",
            "Wow, the nerve. LOL",
            "Were you tempted, even a little bit, to give her the link to people discussing how self-centered she is? The internet is a crazy tool, and might be one thing that could break through the impenetrable cluelessness that your friend is showing here, regarding how self-centered she really is.\n\n",
            "Superbitch got dealt with hard, good job man. ",
            "[deleted]",
            "What the actual fuck? How dare she accuse you of using her? I'm glad you showed this bitch the door. Also: I hope she gets catfished.",
            "Now I aint sayin she a gold digger...",
            "If this is *troo wuv*, why can't this boyfriend pay his own way? Or meet her half-way? \n\nSeriously, the *gall* of this girl, charging her friends just so she can pay a stupid amount of money for a stranger to come to town? Good on you for cutting her off.",
            "> \"SuperWhoLock\"\n\nYou'll be better off without her.",
            "She's a sociopath or dumb.\n\nWould have been much easier, if mommy and daddy are paying for everything to just hit the cash back option when you buy things, and put the cash into a savings. That way mom and dad just see normal purchases and no odd withdrawals, along with keeping your friends from paying for you stupid shit.\n\nWhat a fucking bitch.",
            "I'm so glad you are through with this girl. Some people are asking  why she has to put him up in a fancy hotel. I'll take it even further and ask why the hell is she paying for him to come in the first place? Please keep your ears open and have someone check him out for us if he ever shows up. That's the update I'd like to see.",
            "One one hand you did the grownup responsible thing, on the other you will never get to see the train wreck that will follow meeting dream guy off the internet.\n\n",
            "Funny she never considered getting a job. ",
            "Hopefully one day she will realise she threw away a good friendship because of her selfishness, and use this realisation as a tool for growth. Hopefully. \n\nAnyway OP, well done on standing your ground and communicating openly. It can be hard for people, when put in the position she put you in, not to cave into the guilt trips.",
            "She is a complete moron, and a hypocrite at that. She's willing to throw her friends under the bus for some guy whom she has never met?",
            "I don't vote a lot but girl you did this shit like a professional",
            "Send her on a trip to Belize.",
            "Sounds like you're making wise decisions. This person was never truly your friend.",
            "dodging a bullet on that one. shes the type to not make any contact to you unless she needs something.",
            "How the fuck is she a \"nice girl\". Accusing you and other people of trying to \"use\" her, but in realty she is using everyone around her. I can't comprehend how you perceive her as a nice girl.... ",
            "Sociopath. Good on you for separating yourself.",
            ">She stated that I shouldn't use her and I was a bad friend.\n\n*Proceeds to use you and others.*",
            "Wow.  Just wow.  The mind boggles.  You are so better off having someone with a skewed world view like that out of your life.",
            ">She's one of those \"SuperWhoLock\" theatre push-over tumblr gals (her words, not mine).\n\nAs soon as you said this, I figured she was a Tumblr user. And I don't mean \"user\" in the sense of a \"computer user\", but \"user\" in the sense of how she views people.\n\nSure enough reading through it...\n\nWhat's funny is the guy on the other side of the world is using her as well.\n\nBirds of a feather, as they say, flock together. Or, more aptly:\n\nUsers gonna use\n\nNow you're no longer friends with her. Because you're not like her. Good! ",
            "She's delusional. ",
            "Your 'friend' is a retard, stop hanging out with her. ",
            "Why didn't/doesn't she just get a job...",
            "She is not a nice girl. Nice people don't use others for money.\n\nAnd who wonders if this online boyfriend is running a con the ex-friend and will be $5000 richer?",
            "good on you for getting rid of this kind of trash.... i had a friend whom i tried to help out and get her out of her bad decision making habits, turns out ... she quite enjoyed doing things her way even if she ruined peoples lives and their emotional welfare because she got to have her way.\n\nYou did a great thing, you saw the situation, addressed it, and figured it out within minutes and walked away rather than wasting time,money and breath on a waste of space.\n\nGood on you, indeed",
            "I spent quite a lot of time in Long Island. The most valuable lesson I learned from it is that you shouldn't spend much time with people from Long Island... I never really got how people can act like her, but this isn't the first time I've heard of or seen something this weird there. ",
            "Someone that browses /r/Tumblrinaction post a story about a over entitled, self centered, tumbrina? Shocked I say. ",
            "Congrats on eleminating a toxic life element.  Be well bro.",
            "You did the right thing. Funding a stuck-up long island girl's relationship desires is so NOT something you ever need to be doing. Ugh. People like this make me sort of sick. ",
            "Oh good god. She sounds like a frickin' tumblrina. You dodged a bullet ending that friendship. It'll only get worse",
            "WHAT?!?!?!? This is just horrible! She obviously knows that what she is doing is wrong, since she can tell you that you are a bad guy for just thinking that her parents are rich - when they are and she is using you!! Woaw I am happy you ended your friendship or what ever it was! Friends don't take advantages of each other and they sure don't steal money to see their boyfriends. True love is really bad when it makes you betray your friends! ",
            "I'm proud of you, dude. Hopefully this makes her understand what she's doing isn't okay. ",
            "Wow!!! That is crazy!!! She wants to fund \"this online\" guy who she has never met airfare/hotel?!? She had the gall to ask her parents to fund it!?!? OMG!!! Honestly I kinda want to know how it turned out for her??? Bet this guy is a hustler too!!! ",
            "At least she didn't save up to go to Costa Rica.",
            "Only two types of people on this planet could take advantage of someone and then say they were the victims",
            "Ugh, there was a girl I worked with that would never buy her own food.   Nobody invited her anywhere after I called her out on being cheap. ",
            "She's full of shit, you did great.",
            "> She went on a long winded monologue about how she knows my type and how since she's from Long Island I think she has money. \n\nThis, followed by the truth made me laugh.\n\nGood for you standing up for yourself.",
            "Good for you. She sounds spoiled and toxic and you can do better.",
            "Op, are you out of your fucking mind?",
            "you might have considered her a friend, but she clearly considered you a doormat.  Kudos to you for breaking off the friendship, what she did to you and her other \"friends\" just proves that shes doesn't care about anyone but herself.  ",
            "Good for you man. I know that must have been tough, but I've learned how important it is to not let yourself have negative friends hang around in your life.",
            "You are driving a used car.  With a driver that's being used.",
            "Came here to advise discontinuing friendship, and see that you're already on the ball. Wise choice sir.",
            "Well, that is straight up sad. She will inevitably be completely disappointed by her oh-so-true love, and all she will have left by then will be regrets. \n\nGood for you for not putting up with that shit, though. ",
            "This is the stupidest thing I've read today. ",
            "I hope you tell her other friends what she is doing. ",
            "You know, if you continue to base friendships on the *form of social media* they use - especially when you seem to be saying that \"prefers female-friendly media\" means \"totally subhuman worthless waste of space\", this is going to happen again and again, because you're using superficial, arbitrary, and goddamn batshit lunatic standards to judge people by. No wonder you fell for this chick.",
            "Now you need to block her from your phone and social media. You don't need friends like that. ",
            ">She babbled on about how I wouldn't understand because *love* or some shit. ",
            "Anybody who would use you like that and then try to manipulate you about it is not a friend. People like that only care about themselves.  ",
            "Ugh Long Island. Let that be a lesson right there. ",
            "Sadly, this is what the professional victims the tumblr people look up to are teaching them. All these people they think are role models are exhibiting this kind of behavior to the extreme. Everyone's just trying to use each other in a web of reliance. ",
            "Online boyfriend? Many of my friends had one and they turned out to be a scammer.",
            ">Wouldn't really classify her as a \"Tumblrina\". She likes tumblr culture, but she isn't as radical/insane as the ones I've seen online.\n\nsounds like she very much is, actually",
            "Dude you sound like a boss. If you come to Canada I'll buy you a beer. ",
            "You poor bastard. XD\nOn the plus side, you now don't have a shitty friend taking your cash! :D",
            "If she was *in love,* she would sacrifice her own petty spending to save that money up.",
            "I know this might be a bit late OP but I would warn your mutual friends that you were taken advantage of by her in this way.",
            "Please someone tell me why she can't just get a job? Plenty of students work and study....",
            "TIL \"SuperWhoLock\". Now i need to go scrub my brain with steel wool.",
            "I'm sorry you lost a friend in this situation, but it sounds like she is not a good person, so you didn't lose much. Hold on to the memories, because that \"nice\" girl doesn't exist. Good for you for not buying into her bull shit. If you guys share any mutual friends, I'd give them a heads up to her games. She flat out admitted she's using people, so maybe if enough people break contact she'll realize what a piece of shit she is.\n\nWhatever she does, don't ever take her back. Manipulating liars don't change.",
            "> She's one of those \"SuperWhoLock\" theatre push-over tumblr gals (her words, not mine).",
            "> She's one of those \"SuperWhoLock\" theatre push-over tumblr gals (her words, not mine).\n\nGross.\n\n> ...she's from Long Island\n\nGross.\n\n> ...five thousand dollar trip to have her online boyfriend fly up this summer and to put him in a ritzy hotel. Her parents didn't approve of her relationship...\n\nFucking gross dude.\n\nSo, we have a spoiled rich girl taking advantage of other people's kindness to fund her sexy getaway adventure for some idiot boyfriend that her parents don't approve, probably because he's just as much of a jackass as their daughter. Awesome.\n\n",
            "All tumblr people are insane and save up their money to meet their other tumblr soulmate. And they're insane.",
            "Wow- this is throw-your-drink-into-her-face level BS right here. This basic bitch needs to go. Nice work",
            "I'm proud of you friend. \n\n",
            "woman uses man, more at 11.",
            ">Wouldn't really classify her as a \"Tumblrina\". She likes tumblr culture, but she isn't as radical/insane as the ones I've seen online.\n\nI bet she is, but you don't see her when she's anonymous.",
            "She's not worth any effort. Really. Get on with your life, and with your real friends. ",
            "Good for you for knowing what you needed to do and doing it. ",
            "\"friend\".  Move on.",
            "Wow.\n\nWhat a Crazy Underhanded No-good Turd.",
            "what a spoilt drama queen",
            "She doesn't sound like a very \"nice girl\" to me...someone who selfishly uses fake friendship as a way to shake people down for cash isn't very nice. It's dishonest and greedy.",
            "Err.. I think you give this girl far too much credit. She lies, steals and then what's worse has the gall to attack you when you call her out on her utterly disgusting behaviour. Give it some time.. I think after your rose-tinted glasses have melted away you will see this girl for the completely vile bitch that she is.",
            "*You* were using *her*?!  You  need new friends.  Wow.  ",
            "S.o.D's Toxicity begins to play and OP begins a one gal mosh pit to celebrate victory",
            "WOW. Was not expecting her to be doing that, good find Sherlock!",
            "> She babbled on about how I wouldn't understand because love or some shit.\n\nLOL'd at that one.  Bravo",
            ">She stated that I shouldn't use her and I was a bad friend. \n\nDirectly followed by \n\n>she has been hustling people out of their money in order to fund the trip, while continuing her luxury lifestyle. \n\nWow. Just wow. She sounds like a spoiled, selfish, child. You made the right move on this one. Hypocrisy is a horrible trait in a person, let alone a friend. ",
            "Well done!",
            "It is so refreshing to see someone on this subreddit who is decisive and takes advice well. Most posts I read are so frustrating because people let others walk all over them. I have nothing but applause for you. Your friend wasn't really a friend.",
            "Euhhm,  how do I describe her using diplomatic wise words : that was real a bbiiiaaatch",
            "I can't understand the attitudes of people like this. When you confront them they deny it...you push enough and they break down with tears. Its like they're expecting a play for sympathy will get them out of trouble. Its unfortunate but I have only met girls that pull this kind of shit..however I would guess that girls are the only ones that can get away with this particular strategy. Any guy would likely have their shit called out on immediately. Lesson for everyone call people out on their shit. It will make the world a better place.",
            "Oh wow. That's really bizarre and shady. I'd honestly give this girl some space, and maybe consider talking to her again if she gets get head on straight at some point. That said, what SUNY School do you go to? The Long Island thing tipped me off (lol), and I've met a lot of girls just like her here on Long Island, (we're not all rich, actually haha), and specifically on some of the SUNY Campuses. ",
            "friend\n zone",
            "Wtf is Tumblr...can I actually meet bitches on there?",
            "Good riddens.",
            "this seems really fake.",
            "She sounds like a girl with borderline personalities disorder and bipolar.\n\nI know because my girlfriend has both of these disorders and does the exact same thing.\nThese people scam EVERYONE out of money that they know. ESPECIALLY men. They mainly scam men who sleep with them so if you are sleeping with them expect to fit the bill for everything. And expect her to expect you to do this. \n\nMy advice is, YOU HAVE TO MAKE A CHOICE, RIGHT NOW. are you willing to be her friend despite her accusations OR is she a person you can live with out?\n\nYour choices are: 1) stay in her life as a PLATONIC FRIEND and stop paying for her and understand that she is MENTALLY SICK and that this is why she does what she does OR 2) CUT ALL TIES, Before she wastes your life with her drama and untrue accusations\n\nshe might not have a mental disorder she could just be a drug addict (drugs include alcohol, inhaling nos/computer cleaners ect) \nIf you are sleeping with her, in a way she's right when she says you are using her. So to get away from that, you need to keep the friendship platonic (no sex, no kissing, no flirting, no touching of any kind And no seal activity or talk whatsoever with each other).\n\nDon't sleep with her even if she begs. This will only lead to more drama. These types of people have no filter and don't care if they embarass or endanger you and will embarrass/endanger u",
            "And like all posts from /r/relationships that make it out to the wilderness of /r/all, this one is obviously the result of a shoddy creative writing assignment. Or, at best, fan fiction about OP's own life.\n\nDo you guys upvote this stuff as some kind of smokescreen, so we don't see your real conversations?",
            "Does she give you head? If so, pay for the gas. If not, ignore her indefinitely."
        ]
    },
    {
        "post_id": "2dhcff",
        "author": "guzzump",
        "title": "[conclusion] Me [42 M] with my wife [32 F] 3 years, meeting up with a man I don't know.",
        "url": "https://www.reddit.com/r/relationships/comments/2dhcff/conclusion_me_42_m_with_my_wife_32_f_3_years/",
        "score": 2217,
        "num_comments": 169,
        "created_utc": 1407968702.0,
        "selftext": "Original post\n\nhttp://www.reddit.com/r/relationships/comments/2d7v2a/me_42m_with_my_wife_32f_3_years_shes_meeting_up/\n\nYesterday's update\n\nhttp://www.reddit.com/r/relationships/comments/2dd1kd/update_me_42m_with_my_wife_32f_3_years_shes/\n\n\nToday's conclusion.\n\nI read all of the comments and I must say, you had me convinced that she was cheating. I know most suggested spending money on lawyers/gps/private investigators and stuff but I needed to know for myself so I stuck with the original plan.\n\nAs she was getting into the car I came out and said \"hang on, I'm coming too. I've been thinking about losing weight and you don't want to be married to a fat fuck like me.\"\n\nShe laughed and said \"don't be daft, you're not fat! But it will be brill if you join too, then we can do the sauna '  stuff.\"\n\nSo we set off in completely a different direction of the gym. I asked her about the local gym and she laughed again and said \"How much money do you think we have!\" apparently the gym near us is really expensive.\n\nThen the best bit: she then pulls over and out of this house comes the guy ('Steve') built like a boxer and climbs into the car and another, slightly smaller. As soon as they get in all my worries disappear. This was Steve pronounced 'Thteven'; as camp as they come and then proceeded to flirt WITH ME! The other guy was his boyfriend.\n\nWhen we got home later I asked her about him on Facebook and she said \"if I said I'd emptied the bin he'd like it!\"\n\nThen I showed her the Reddit posts and she laughed and said why didn't you just ask me who he was. And then she laughed again when she read I went to the wrong gym.\n\nShe said some unflattering things about one or two messages but I don't care. All is well.\n---   \n**tl;dr**: Wrong gym, gay dude.\n\nEdit: I'm a little overwhelmed by the massive response this got. I thought there were just a few people following the story. My gut feeling was that there was nothing wrong because everything else just seemed so normal like I said in the first posts. I feel a bit bad (and a bit daft) about checking up and misleading her but she just found it funny. \n\nWe don't normally go into detail about who we are with and where we are going. I play football and she's probably met 2 of my friends and would have no idea who I collect in my car when I go. She doesn't hang out with him. They attend the same 'box-fit' class and sometimes she's picked him up en-route. \n\nAnyway, that's it. I can go back to using my proper account now. Thanks everyone, including the ones who tried to convince me I was practically divorced and broke.",
        "permalink": "/r/relationships/comments/2dhcff/conclusion_me_42_m_with_my_wife_32_f_3_years/",
        "comments": [
            "Wrong gym. And don't forget you heard it [here](http://www.reddit.com/r/relationships/comments/2dd1kd/update_me_42m_with_my_wife_32f_3_years_shes/cjobtrw) first!\n\nSeriously though. I'm genuinely pleased for you. ",
            "Oh man, I am so happy for you! See not all of us were wrong. High five good sir! ",
            "You sir have just lived a romance comedy",
            "[deleted]",
            "The original comment was edited in the summer of '23 to protest against Reddit's greedy corporate actions against the Reddit community, you know, the people who joined, commented, and volunteered to make Reddit as awesome as it was at its peak.",
            "I love this tl;dr.  I'm so very glad this turned out well for you man, my SO has gay friends as well and I must say it's definitely a reprieve when you meet them for the first time.  It seems so silly to worry when all internal feelings and logic feel flipped upside down when something walks like a duck and sounds like a duck but turns out to be a gay dude and his boyfriend. \n\nCongrats sir, have a long a happy life together!",
            "LOL hilarious, goes to show some redditors are way to happy to jump the divorce gun. ",
            "This is why you don't go to reddit for relationship advice. ",
            "I really wondered if you had the right gym! I know that when I was shopping around for one I went to five or six to try to find one that wasn't ridiculously expensive.\n\nI hope that next time you're feeling a doubt, you're confident enough to just talk to her! She sounds like a great woman. :)",
            "I love how most people assume cheating and come up with insane plots, lawyer, gps. Etc. when simple communication will fix most things. Good for you for being your own person and keeping a level head. ",
            "Ahahahahahaha thank christ for that! I love a happy ending me!",
            "[deleted]",
            "Hopefully this deters the all-star team of people who immidiately put \"He/she's cheating, run for your life\" on every single thread in this sub.",
            "And you didn't break up with her?! Why do you bother coming here if you won't take the advice?",
            "bah. i'm too cynical.. ",
            "I'm pretty sure this was on an episode of Reba.",
            "Ahahahahahhaha!!!!!\n\nBest outcome ever!",
            "She's cheating on you with two gay dudes",
            "This subreddit always advocates breaking up and thinking the worst. Always. Some girl will come on here complaining about a small fight and the top 3 comments will be \"He's a fucking asshole, dump him\" or \"this speaks volumes to how he sees you. You deserve better.\" \n\nI'm not sure how any of you have lasted in long term relationships, but I'm glad everything worked out for OP.",
            "Good thing you didn't follow the path reddit was pointing you towards... This is an awesome and funny ending! ",
            "3 Weeks Later.....\n       \nMe [32F] with my husband [42M]. He's meeting up with my gay gym friend Steven to \"go to the bar\". Not sure what they're doing there...\n      \nBut seriously, very happy for you!",
            "That is such great news, and well done to your wife for being so great in how she handled everything",
            "This is why you don't listen to people in this sub. They'll always say she's cheating.",
            "I'd recommend apologizing to your wife and communicating with her about your fears.  If you do it right, she might make at even a subconscious effort to communicate and prevent panic in the future.  But I'm really happy everything ended well OP",
            "Haha!  What a happy yet hilarious conclusion.  I'm glad your wife is such a good sport about things, and that your worries were for nothing! Right on.",
            "So happy that at least one of the times people jumped on cheating they were wrong!!! So happy for you!!!",
            "This just further proves my point of /r/relatuonships being so dramatic. Greatest update to date",
            "TL;DR never heed top upvoted advice in this subreddit. Or at least just take it with a huge grain of salt.\n\nWe don't know the players in your game, we don't know if you left out details, etc. etc.\n\nAnd since everyone that participates in this subreddit is one or more of the following: A sheriff, a drama/gossip vampire, an idiot/troll, someone with a chip on their shoulder, etc.\n\nIt's even harder to take advice seriously since people aren't coming from a real professional perspective. They aren't a therapist or psychologist, all they have is their anecdotal evidence from their life and their friends, where the common variable is themselves and is unchanged.",
            "[deleted]",
            "Oh man, when I saw the title I was already feeling dread. (I hate sad endings.) But after reading the post I literally laughed out loud.  (Op, you've been messing with my emotions!) I am so effing glad that it was nothing and that you and your wife were able to read the previous posts and laugh about it.  Thanks goodness! :) ",
            "You should have just asked her in the first place. Communication. Do it.",
            ">including the ones who tried to convince me I was practically divorced and broke.\n\nYup, that sounds like most of this sub.  Glad you had a positive outcome!\n",
            "Awwww. I like it when Reddit is wrong.",
            "Oh man what a relief. So glad everything worked out for you and your wife, OP :)",
            "what a twist!",
            "Ha! I'm in god damned tears! If this a true story tell your wife I owe her a drink and a humble apology!!",
            "Its a a ruse. Shes telepathically linked to him. And he had a roommate who is gay. He does this quite often. ",
            "This might be one of my favorite moments I've witnessed on this sub. To quote your wife, this is \"brill.\" Great story! ",
            "\"Brill.\" ",
            "I'm happy that everything turned out fine for you two :) ",
            "WOAH! a good ending! Good for you! it brings a sliver of hope lol.",
            "Bahahh Thteven. That's awesome. ",
            "Love it! Glad it turned out great for you guys!",
            "Best update ever",
            "Awww man I laughed sooo hard at the end of this. This might be the BEST ending I have ever seen in here or at least the most hilarious.",
            "Well, damn. I was all sad for you and now I feel foolish. I'm glad it worked out for you both!\n\nThis is just one of those times when the subreddit misses the mark. I'm glad that your marriage is safe and unharmed. I wish many happy years for you both!",
            "I'm really happy everything worked out!",
            "Hahaha!Congrats dude. \n\nHad us worried there for a bit!",
            "Oh thank fuck. I read your earlier posts man and my heart was breaking for you. <3 so fucking glad you came out of this okay :)) All is well.",
            "Awesome, thats a great ending. I'm happy for you!",
            "restored faith in relationships and gummy bears.",
            "What a fabulous update. Glad you didn't listen to the \"she's cheating\" and went with your gut.",
            "Brilliant plot twist. I was all too sure she was cheating. Posts like this give me hope for relationships.",
            "There's got to be a meme for this!",
            "Mother of fuck, what a great ending! Holy shit on toast... that's like winning the fucking lottery right there. ",
            "*sniffle* I always love a non-breakup ending.",
            "This a breath of fresh air. Congrats!",
            "Holy shit man I'm really happy for you. ",
            "I just hope other redditors who confront their SO's can read this thread and see that *this* is how a person who has nothing to hide reacts instead of getting all defensive.",
            "I just read all of these. This makes me so happy for you.  Things sounded do bleak, happy one of these ended up great. Sounds like you guys have a strong relationship. #blessed ",
            "Goes to show that the first and best thing to do is trust, and ask questions.  Jealousy is mainly an insecurity, but your partner can't help you if you don't enlighten them.\n\nThis isn't to say that cheating doesn't happen, but we're unlikely going to be able to tell from a reddit post beyond the people actually involved.",
            "You're welcome. I'd never assume a poster would get a basic fact of a situation, like what gym she goes to, so wrong. ",
            "Today four words made my day:\nWrong gym, gay dude.",
            "i say troll post BUTT\n\nI am a man who can eat his words and say I apologize for being wrong and congratz lose that fat get buff and if some other dude comes around you can very easily pick him up and put him down",
            "Sometimes, sometimes 2+2=5, and it's a happy day when it does. ",
            "Reddit hasn't been this proud since the Boston bombing. ",
            "I'm so happy this ended well for you! Totally unexpected.",
            "This just made me soo happy!! Glad to see that it was all nothing.  :)",
            "That is awesome!  Great news & good for a laugh.  Sounds like you are with a good, loving person with a great sense of humor.  Glad you're not too much in the dog-house either!  ",
            "I'm sorry for laughing at your unfortunate circumstance, but this is pretty funny. This is the best possible outcome :) I'm happy for all of you",
            "Good news. So happy it turned out ok!",
            "thank God you didn't freak out. ",
            "Totally didn't see that coming.",
            "I was waiting for this update, great story, the outcome was really good for you! I'm glad you had the trust with her to actually go with your gut and check it out for yourself! But anyhow, this story gave me a good laugh =) All the best.",
            "Glad you didn't freak out at her and it all turned out well!",
            "At least this will be a funny story for both of you in a few weeks (hopefully).",
            "I'm really glad we were wrong. I hope it's all smooth sailing for you from here on out!",
            "Dude, maybe your wife is gay!",
            "I am glad this all worked out for you. Best update of the day! ",
            "She could've let you know beforehand.",
            "Dude this wonderful news. Now go have steamy sex with your wife.",
            "A truly epic saga\n",
            "Great read, happy that things worked out for once.",
            "Awesome :)\n",
            "I read the fantastic conclusion with trepidation. Delighted to find that my thoughts and suspicions were wrong. ",
            "this was the first one i read, as the other two didn't appear. reading the other two, and obviously in retrospect, this is a pretty great romcom movie idea. i'd watch it.\n\nof course, what was needed was a little anger on the wife's part, so that you two could patch it all up and laugh in the end. instead of just laugh.",
            "Am so glad this turned into a funny story rather than a broken home.",
            "Best update ever. Congrats :D",
            "Oh man, I'm *so* glad you didn't do the keylogger suggestion a couple posts back.",
            "I know I'm late to this post, but I'm happy for you man. It sounds like you have an awesome wife who's more than willing to reassure you that there's nothing to worry about. I mean, she didn't freak out when you showed her the reddit posts. I wish you nothing but the best.",
            "I dont possibly think there could have been a better conclusion. ",
            "This could not have ended happier.  I am so sorry we all jumped to the wrong conclusion.  My recommendation of going with her panned out though, didn't it?",
            "I am very happy for you",
            "Yahoo this story is awesome!! Made my day. Thank you!",
            "That's fucking awesome. Congrats, dude. I'm glad you did a little of your own investigating first. If only this would teach Reddit to stop jumping to conclusions when we don't have the full story...",
            "For some reason people in this subreddit like to jump to the worst conclusions. I see so many posts where a wife and husband are having minor issues and people just tell them to divorce. ",
            "I'm glad all is well. I read your original post and am very disappointed in the comments there. Your SO is allowed to have friends of the opposite sex! Doesn't mean cheating at all.",
            "I remember seeing these threads and thinking everyone was jumping to conclusions.  I'm glad everything worked out great! ",
            "It's good to hear a positive outcome for a change here on Reddit; usually the reality is downright nasty.\n\nThis clearly represents the minority of cases one reads about.",
            "I got a good belly laugh out of this. Let's me know to get more info next time eh?",
            "This sounds like the ending from a sit-com. ",
            "Is 'daft' and 'brill' even words anymore?? I don't get that part. ",
            "OMG, /r/Unexpected .\n\nI'm happy for you mannnnnnnnnnnnnnnnn.",
            "LOL, this is awesome!  /r/relationships: The only subreddit in which I love being proved wrong.",
            "Ive been quietly following this since the start and this made my day. So glad it wasn't anything serious and turned out to be so hilarious. Hopefully this becomes something you two can laugh about. ( my so and i have things like that...not as intense tho..that have become running jokes in our relationship). :) ",
            "Six months later the wife joins Reddit and asks if her husband is having a gay affair with her gym bunny friends... \n\n*Sad trombone waaahhhh...*\n\nGood on happy comedic hijinks ending though! ",
            "To be fair, your own paranoia colored the comments you received from Reddit. (Plus it wasn't clear that you weren't even sure what gym she attended.) \n\nThat said, good for you (both).",
            "Plot twist: You are now cheating on here with Thtevan",
            "> tl;dr: Wrong gym, gay dude.\n\nHah! Glad everything turned out ok!",
            "AWESOME! Glad it wasn't something awful :) High five for having an awesome wife!",
            "Awesome. Just awesome!",
            "**BAHAHAHA!!!!**\n\nI am so happy this story had a good ending! Cheers!",
            "Just goes to show things aren't always what they seem, especially when people are quick to jump on the 'they're cheating' bandwagon (although, obviously, with those 'symptoms', 9/10 it usually is); but here's to an awesome future :) glad everything was genuine.",
            "That's awesome! Glad to hear it. It was an Oscar Wilde ending.",
            "Your wife sounds like a cool lady and your interactions put a smile on my face. Finally a happy ending on reddit lol",
            "Glad it worked out well.",
            "I'm really happy for you and glad this turned out so well! C:",
            "It is always good to hear positive conclusions like this. Your wife sounds awesome!",
            "HOLY SHIT OP. IS THIS A JOKE? ",
            "Love love love this update! Glad to hear it was all a big misunderstanding. ",
            "Oh OP! You made my day! Happy for you! laughing with delight! Thanks for sharing!",
            "Haha hooooly shit I'm so happy for you.",
            "Hahaha, I think this is my favorite update EVER!",
            "Or.  This was the plan all along incase you cought on.  She text the guy and said.  He's coming with.  Act gay.  You've been foiled my friend.",
            "No offense at all but use this as a warning sign.  If your wife is that much younger than you and spending her time to get in shape, so should you.  Working out can strengthen your bond and will show her your making an effort instead of spending time accusing/ essentially stalking her.\n\nSource: someone who has been dumped because I spent my time accusing people instead of recognizing my low self esteem\nAnd improving it.",
            "Wow, OP was a bigot this whole time, good shit. ",
            "You are the 1%.\n\nReally happy this worked out for you, and your wife sounds really understanding. ",
            "I dunno.  Give it long enough and she might want to try to convert him.  "
        ]
    },
    {
        "post_id": "iyx7ew",
        "author": "holmes4711",
        "title": "How do I tell my best friend (both F20s) that I want to stop exchanging Christmas presents?",
        "url": "https://www.reddit.com/r/relationships/comments/iyx7ew/how_do_i_tell_my_best_friend_both_f20s_that_i/",
        "score": 2220,
        "num_comments": 325,
        "created_utc": 1600953916.0,
        "selftext": "Throwaway account. TL;DR at end.\n\nMy best friend is a really great gift-giver. I know that she plans gifts really far in advance and always dedicates so much time & thought into them, and I am so grateful for every gift I have ever received because I know how special they are. She'll often take something small I said from years back and make a really meaningful thing out it, and I know she enjoys gift giving and it is clearly one of primary ways she communicates her love for me and others. \n\nI just can't keep up. I've never been a really good gift-giver. I often really struggle with forming ideas for upcoming celebrations, and until I'm really under the pump, I come up empty handed until I find something just alright or I repeat a similar schtick of \"reasons why I value you\" presents. \n\nThis just means that I feel so much stress every time I have to celebrate her birthday & Christmas, especially because I would have received something completely out of this world. I really just feel like my gifts pale in comparison. It's getting to this stage where we've been exchanging presents for 8 years and I'm honestly just starting to feel like I'm running out of steam to keep up and continue thinking of other ideas. It is also hard because I'm neither here nor there when it comes to receiving gifts. I can recognise the hard work and love, but I don't *need* to receive gifts to know that I'm loved, and so I worry that I don't reciprocate my love well enough because my presents never feel at her level. \n\nI want to express to her my gratitude for her gifts but ask that we just stick to one a year, on birthdays, because Christmas and the occasional Valentines' Day is too much for me. I have been able to move away from gift-giving with other friends by just casually mentioning it or just mutually ceasing present exchanges, and we now opt for spending time with each other - something I love. I just don't know if this would be really insensitive or soul-crushing because it's not about her or how good of a friend she is, but really about my insecurity and my differing ways of communicating love. \n\nI know I've got to have the conversation, but does anyone have any tips or advice for how I could communicate this in a tactful and non-hurtful way? \n\nTL;DR: my best friend is a great gift-giver and expresses her love through that, but I don't and so I feel my gifts are incomparable. I want to only exchange presents once a year and opt to spend time with her for other celebrations but don't know how to deliver this in a sensitive and thoughtful way.\n\nEdit: thank you all so much! I'm trying to get around to reading all the comments but I just want to say that I appreciate everyone's perspectives and input. It's really been helpful for me to consider different ways of having the conversation and problem-solving our way to a more mutually agreeable situation. \n\nAlso, yes, she's definitely the Leslie Knope in this instance. Maybe I could suggest \"Knope-resents 2020\" HAHAHA please laugh",
        "permalink": "/r/relationships/comments/iyx7ew/how_do_i_tell_my_best_friend_both_f20s_that_i/",
        "comments": [
            "\"Hey, guys, this year has been unusually rough on everybody's mental health, including mine.  I want to suggest that instead of physical gifts this year we do something special together to celebrate our friendship, like ice skating/spa day/wine tasting/etc [suggest the activity you most would like to do but have a backup just in case].  I can start doing the research now and we can try to plan it for early December?\"",
            "Personally I sound like you're friend - I LOVE giving people gifts and it brings me so much joy than actually receiving a gift (not to say I don't appreciate presents because I do very much no matter how \"pale\" they seem in comparison) \n\nGiving a gift means more to me than just spending money on someone I love and if my friends felt they couldn't \"keep up\" I would want them to talk to me about it but please keep in mind that she may enjoy the act of gift giving and not be bothered by the kinds of gifts you get her as at the end of the day, you have thought about her! It makes me happy just to know someone has thought about me rather than what the gift actually is. \n\nI honestly wouldn't think too hard into it about not getting her gifts of the same level as we are all different! She probably loves you just for thinking about her and getting her something! \n\nIt would definitely upset me if my friends didn't want to accept anything from me in terms of gifts as it really is the way I process my affection and love for people. \n\nHope it works out for you but communication is key with keeping a good friendship alive! X",
            "This is literally the plot of a Parks and Rec episode. Leslie is super thoughtful and over the top and Ben and Ann can't keep up. Season 5 episode 19. Watch it for some good ideas on how to navigate your situation!",
            "I don’t know if you’ve ever heard of love languages, but giving/receiving gifts is a love language.Like you said, it’s the way your friend communicates her love for others and it’s very likely that receiving thoughtful gifts from others is meaningful to her. I am definitely one of those people like your friend. I think you should be careful to explain how you feel really to your friend, because if you don’t it could really hurt her feelings. I’m not blaming you in any way because I understand that gift giving just isn’t your thing. But for people with this love language a disinterest in gifts and low effort gifts can be interpreted as a lack of love/interest itself. Like I said, please explain how you feel to her carefully and in depth, and acknowledge that you are grateful for her gifts. Like someone else mentioned, maybe suggesting spending quality time together as an alternative is a good idea to emphasize that you still love and value her. If she insists on still giving you gifts without getting one in return, please consider letting her do that. As someone with this love language, it took a while for me to accept that giving gifts isn’t the way everyone expresses love, and I had to accept that low effort gifts from friends didn’t mean they didn’t love me because they show they love me in other ways. Giving them gifts they love brings me so much happiness anyway. Hopefully after you discuss this with your friend she’ll understand too!",
            "I would not feel obligated to give something in return. Or you could even stick to something very easy like a gift certificate to a place she loves. Unless she has said something about your gifts not being up to scratch (doesn't sound like she has) I don't think she's looking for you to live up to her level of giving. People who put a lot of thoughts into gifts like the giving. I have several friends I gift to who don't give in return and it has never occurred to me to be bothered by it because I don't consider that the point of gift-giving.\n\nI would just talk to her about it. Be honest that you feel your gift-giving is inadequate compared to hers and you love and appreciate how much effort she puts in, but that gift-giving is not your thing. She will probably tell you that she loves giving gifts and you equally reciprocating is not important to her.\n\nOne thing I want to mention. I don't think you're an asshole for feeling this way, but in a sort of backwards way, if this is what she's good at and how she shows affection, it's a little selfish to ask her to stop because you feel you can't reciprocate. Everyone shows love differently. Of course, if her gifts make you uncomfortable, of course you can ask her to stop. But if you're just stressed because you can't give in the same way, let her keep doing it and work on taking the pressure off yourself.",
            "She sounds like a lovely friend! I too have trouble accepting gifts. I feel awkward receiving them, it often feels like someone is trying to buy my affection, and I hate showing affection by buying something. \n\nI've talked a lot about this with my therapist and the conclusions that I came to are:\n\n1) That I need to allow people (that I want in my bubble of course) to show love for me and that I am worthy of this affection even if it feels like I don't deserve it or I don't reciprocate in some way\n\n2) Be open and honest when you are uncomfortable, like if I am feeling awkward and I'm not grateful enough simply saying \"I really love what you got me, I'm just super awkward about gifts! I truly love it though\" or if you don't understand or appreciate why they got that particular thing, say \"oh wow! What's the story behind you gifting me this?\"\n\n3) Meet your loved ones half way. Maybe ask her what she values and if she doesn't value gifts the same way she loves giving them, get her a cooking class or tickets to a show or even a gift card with a note. Relationships (even friendships) require give and take. It just depends on how much give and take that each party is comfortable with. \n\nI hope this helps! I am still working on this myself 😊",
            "I love giving gifts, and I really love making people gifts. It makes me happy. I do not require the same effort in return at all.  Unless she has expressed disappointment over your gifts in the past, I wouldn't stress out so much about matching her gifting energy.  If you are truly worried, just ask her how she feels, or better yet, just ask what she might want or need and go from there when choosing a gift; not everyone needs 100% surprises.  My SIL just started college and we wanted to give her something special.  She decided to buy something for her dorm room, and asked us to reimburse her for it.  It might not be the wY I generally go about things, but it was what *she* wanted.",
            "As a person who LOVES to give gifts and makes/buys things in advance: I promise it brings ME joy to give you a gift and to see you to give it to you. I don’t even really want anything in return. I know that can make people feel guilty but that’s how I feel!",
            "is your best friend Leslie Knope because this is literally the plot of an episode of Parks and Recreation",
            "I think you should talk to your friend about how hard it is for you to keep up with her and give her the kind of gifts she gets for you.  However I also think that your friend may enjoy coming up with those gifts because she enjoys it and if you said “I can’t keep up” it’s possible she still may want to keep doing something for you or is fine with you getting her something small.  I think talking with her would be the best way forward to start with",
            "As someone who loves to give gifts and put lots of thought into them, most of the time I'm happy to even just receive a gift in return. It makes me know that you were thinking of me and put at least a small thought as to what I may enjoy. \n\n\nI suggest talking to your friend honestly and getting their opinion on how they feel. Just be honest with them about how you're feeling and that you want to know their feelings too. Then you can come to some sort of arrangement with a better understanding of each other.",
            "Have you spoken to her about this? My best friend is like this. I'm.... very much not. For years I just felt awful because she'd be sending me spectacular things. I would just send her little things I found that reminded me of her, but never anything extravagant or that I put a ton of thought into. Finally I spoke to her about what I felt was a horrendous quality discrepancy and her gifts being so much better than mine. She told me the gifts I give her are actually some of her most treasured possessions. \n\nBecause she loves gift giving so much, a lot of other people felt the same way and just... stopped giving her anything. Their logic being why bother, they can never compete with what she'd give them, as if it's a competition. And she just took it in stride because she's an angel of a human and honestly never expected anything in return for her gifts. Turns out though my little things wound up meaning a lot to her.  My trick is don't aim to buy for specific events. Just... go about life. And if you happen to be in Target and see a $3 teacup that's her favorite color or whatever, get it. Oh a little beanie baby at a thrift store that's the same breed as her dog? Perfect. \n\nHell sometimes receiving a box of tiny little things is way more fun than one huge present. So you can do something like that. A big box of assorted candies and silly fun toys is always a winner.",
            "So have you ever heard of the 5 love languages? This can translate even if you arent in a romantic relationship. Gift giving is a way she shows her love and its ok that that doesn't mesh up with your way. How do you like to show someone you live them? Maybe it's a dinner or quality time? Maybe it's that hug when you guys see each other after not for a few weeks or days. You don't have to give gifts to show you love her and appreciate her as a friend. Do it how it suits you. Be honest about it and I'm certain she will appreciate the way you show your love to her.",
            "I bet she has a running list. That’s how I do it. I take note of every little thing a loved one says or mentions wanting and build a list of it. My husbands list has around 20 items on it at any given time and when Christmas or a birthday hits, I just have to choose from it. I do this for my parents, siblings, and in-laws. \n\nI’d guess if your friend is like me she really enjoys giving the gift. Maybe consider continuing and either try the list idea for better gifts or just get comfortable with the fact that being an epic gift giver probably brings her a lot of joy and has very little to do with what she gets in return.",
            "Is ur friend Leslie Knope",
            "Instead of exchanging gifts, my best friend and I exchange homemade cards for birthdays/Christmas with a letter inside. The cards are like a time capsule of our friendship, so we both try to include memories of the year and inside jokes that are relevant.\n\nIt’s a lot more heartfelt than an elaborate gift, and also something meaningful that we both keep and look back on every once in a while.  \n\nWe also make each other “friendship” cards - when one of us is feeling really down or going through something, the other will make a card to remind the other of all of the things we love and fond memories to cheer up the other.\n\nIt’s honestly the most meaningful thing, and I can’t recommend it enough. You’re more likely to keep a card than a gift through the years - as we get older, I don’t want stuff. Just tokens.\n\nMaybe suggest a similar exchange? Then your friend can use her loving gift giving energy, and you can spare yourself the stress?",
            "I’ve been through a similar situation with my two best friends. One of them is just the world’s best gift giver (A), and us other two (me and B) are struggling to keep up. Friend B talked to each of us separately about moving away from physical presents to experience-based ones. B and I now do that (nice dinners and massages are our new favorite activities together). \n\nHowever, one of friend A’s primary love languages is gifts, so we compromised by getting her to send us lists of either specific items or categories of things she’d like each birthday / holiday. Now, our primary “gift” is doing the research to find the perfect option for that category, instead of trying to guess what A has and doesn’t have. \n\nIt’s still some work / stress, but I respect that we each have different love languages and want to make sure she feels loved so am willing to put in the effort.",
            "Last year my friend group tried to transition into doing a secret santa but doing that really highlighted who cared about giving gifts and who didn't. I technically still haven't even received mine despite the fact I got the person I disliked the most but I gave them a hand painted picture frame that had her and my friend and their dog in it, plus some of her favorite candy, the lip balm she asked for, $5 Starbucks gift card, and wrapped in her favorite color. So this year we're simply doing nothing and we all acknowledge that any gift giving is not expected to be returned which I'm fine with, I like giving gifts and I honestly don't ever expect anything more than a thank you. That said it sounds like you've gotten great suggestions already about this friend and I think it's important to just be honest with her if you can't get her to compromise on giving you a gift. If I were you I'd tell her you have no problem accepting a gift if she insists but you'd prefer your gift to her in return be time spent together or a handmade card. Maybe you two can do a craft day and make items out of clay for each other or paint something? Good luck!",
            "As someone who’s primary love language is gift giving, I know i’m a great gift giver and I also know that in the process i’ve definitely had people feel like i stepped them up on gifts or that they can’t compete. But here’s the thing I HATE RECEIVING GIFT, HATE IT HATE IT HATE IT. So when I had a few friends come\nup to me with this similar issues, I was so relieved! Most people whose love language is gift giving will completely understand where you’re coming from and bc were so what at what we do we’ll come up with other gifting ideas. Like just giving homemade cards, baking for each other, only 1-2 gifts each, stick to a theme, taking each other out to dinner ect!",
            "With friends I adore but are difficult to give gifts, I usually invite them to lunch or tea time at their favorite places. Of course, my treat. They are always really happy and I love that we can spend time together",
            "I have a similar dynamic with my best friend, where she is the gift giver and since I’m not so good at it, but I am good at planning shared experiences, I take her out on a little well-planned date for her birthday and she gives gifts on mine. It works out perfectly and we both get to express our love in our special ways.",
            "Look into love languages. Mine is very much physical touch but my best friend is receiving gifts. I’ve become a really strong gift giver because that’s her way of feeling appreciated. My spouse is a words of affirmation person and I struggle to remember to do this when the physical touch is more filling to me. \n\nMy point is though that while my best friend would never expect gifts I know little things fill her cup so I do them for her and I never expect it in return because we have the relationship where we’ve talked about love languages and how to help fulfill each other. Same with my spouse. I make reminders in my phone to tell him I appreciate him and I know he makes the effort to hug me more. It’s not just for me, it’s for the relationship. \n\nYou need to sit down and just tell her. I can see that gift giving/acts of service seem to be your way of expressing love. I love the detail you put into this but I’m really more into quality time, is there a way we can combine these, so we are both feeling fulfilled?",
            "I’m in a similar situation with two friends, and I got around it by suggesting we do something together (for Christmas or birthdays) like a meal out or an activity like ice skating or a museum.\n\nThey both liked the idea and got me off the hook.\n\nExperiences over gifts, every time!",
            "I think that what you want is very reasonable and makes sense. I'd also caution that even though you need a break, your friends love language won't change. For instance, my mother in law's love language is gift giving. One year on her birthday we had flowers delivered to her work and then picked her up from work and took her to dinner at a place she'd been dying to go. We had lovely time and spent a decent amount. The next day she expressed she was sad she didn't get a gift. \n\nShe enjoyed the time spent and the thoughtfulness but she really sees physical gifts that are wrapped as the ultimate expression of love.\n\nI would suggest that you have the talk with your friend but consider a compromise. Would they've ok telling you exactly what they'd like? Then all that's left to you is to wrap it nicely.  Alternatively, would they've happy with small presents that probably are very affordable but something they need?  I have found that with my mother in law, if I wrap up bath towels and other boring but needed things she's very happy. Alternatively wrapped gift cards work for her.  \n\nI absolutely am on your side when it comes to presents. I don't care. But I know that some people value gifts the way i value time spent. So, maybe something like making an itinerary of a day you'll spend together but presented as a present could be a compromise. Lastly, I don't believe presents need an equal value. If she loves to give big things let them. But don't stop putting in any effort. Just know effort put into time spent might not be as valued as effort into giving a smaller easier gift.",
            "I suggest you have a talk with her and see how she views receiving gifts and if it's the same as giving gifts. I'm making a reference to the five love languages, and I know we usually talk about romantic relationship but she is your best friend so this is still relevant. Maybe mention and clarify that you appreciate all the hard work she puts into giving gifts to you but you have trouble doing the same because that's not necessarily how you express love. She could keep doing it since she loves it but maybe make her understand that you might express your love differently (have different types of gifts, spending quality time during her bday, xmas, give random gifts when you think she will like something, etc) \n\nI don't know if you get what I mean haha",
            "I think the best idea for how to solve this was already up there (do something together instead of gift giving), but I wanna add my voice to the many thoughtful gift givers here:\n\nAlmost none of my friends are as good at gift giving. They just ask me what I want, give me their price range, I pick a thing, they put a nice postcard with it, and I'm absolutely happy with that. Or they just take me out to dinner, or the zoo. Or have a movie night with me for my birthday. It literally doesn't matter. I'm just happy that I get to be creative for them. They show their love in so many ways, this is one of mine.",
            "I would be honest with her; it sounds like she enjoys giving the gifts to you! I wouldn’t stop her from doing it, just express to her that you really appreciate the gifts she gives you, but you express your love in other ways. Everyone has different ways to give/receive love. Let her know that you show your love in other ways, and you hope she is receiving your love.",
            "Is your friend Leslie Knope? Lol you sound like Anne Perkins. (Parks and Rec)",
            "So your friend is Leslie Knope?",
            "Why don’t you just tell her you feel like you can’t keep up with her and you know you’re a little crappy at gift giving and let her keep doing what she clearly loves to do for you?? She would probably be fine with a keychain or a gag gift if your love language is clearly something else (and you put effort into THAT way of showing her you love her, which you probably already do) \n\nI don’t think you should ask her to stop doing this, especially because she does it so well and it’s her thing. I think you need to understand that you DONT have to measure up or compete. You are allowed to be different kinds of people and show love in different ways. Honestly I think it would hurt her feelings and take something away from her.",
            "I don’t have advice to give on how to cease, but as someone who loves to make personalized detailed gifts like that, there is such joy in giving someone something you know speaks to a small part of them and makes them feel special. \n\nAbout twenty years ago I made an (ex-)bf a huge basket of Easter eggs in his teams colors, and wrote an inspirational quote from different sports legends on a piece of paper in each egg. He’d been down and unmotivated and I wanted to help.  He actually contacted me recently and said he still had it! I figured he would toss them... plastic eggs? \n\nI couldn’t name any of the gifts he got me, and that’s fine. I don’t really care about all that. I’m happy I brought him some joy at the time! I’m sure your friend feels the same when she gives you gifts that are just for you!",
            "Look into love languages. It may be that her language of expressing her love for you. I’m in similar situation with my best friend. She always goes out of her way and gives me great gifts and I’ve been straight up with her from the beginning about it, like I’m not a good gift giver at all and I often don’t have the budget for it. She doesn’t care, her love language is giving gifts, not always receiving. She just enjoys the knowledge that she did something I loved. You guys could talk about this, and just be like if you expect reciprocation I don’t have the talent you have with this. But if not giving you gifts stresses her out just let her give them!",
            "I'm not even hoping OP will read this, but...when you wrote that you love spending time with friends instead, i was like 'what if you take her somewhere as a gift every time then? Like...museum, aquapark or something else and pay for tickets and/or food?' I think that would suit you both. She will get a gift in a form of beautiful forever memories and you wouldn't have to make her something extreme and complicated :)",
            "Oh man, I relate to this so much. I have massive gift anxiety - both giving and getting, honestly. I eventually just told the people I'm close with/in gift-giving proximity to the truth and asked if we could start doing experiences together instead of giving gifts and it's worked really really well!  Personally, no one has been anything but understanding and everyone has actually really liked that we're doing something together instead of exchanging gifts. For example - with my brother for birthdays etc we take the other out to a restaurant neither of us has been to (we're both into food), for the holidays with my family we do the white elephant gift thing and order lots of take away and just hang out, with friends maybe we go see a concert together, etc.",
            "Some people just really like to give gifts. That’s okay. Let her know it’s not really your thing and maybe do something else like take her to dinner",
            "I had to lay down the law on this with both my and my wife's family on gift giving.\n\nI told all of them. We are not doing gifts anymore. There are way too many kids and husbands and wives.\n\nIt will be an awkward conversation, but you will find that she will get over it.",
            "Show her this post and tell her you wrote it.",
            "Love Languages, the book, explains how people show they care. Some people are gift givers as it makes them happy. Just a thought that this may be your friends love language. \n\nThat aside, quality time and experiences together are beautiful gifts.",
            "[deleted]",
            "My best friend is similar, except with her it’s mostly expensive gifts. She’s bought me things like a Michael Kors purse, Kate Spade jewelry and Quai sunglasses. I sometimes can successfully get out of the expensive gift exchange by suggesting a nice dinner out or a weekend away somewhere. I’m not sure if this would work for you because it doesn’t sound like her gifts are necessarily expensive but I’ve also successfully negotiated price limits for Christmas with her. For me I’m comfortable spending $50 but I don’t want a $300 purse because I don’t financially feel comfortable with that. My friend has been very open to suggestions when I make them as long as there is something commemorating the holiday or event. I think it would make her sad if I just wanted to eliminate gifts all together (and I do enjoy exchanging small presents) so it seems like a good compromise for us.",
            "As someone who often is the “great gift giver” I do encourage you to find a middle ground. I can totally understand that you’re overwhelmed with the thoughtful gifts, but as you said, this is also her way of expressing that she cares about you. I imagine she doesn’t need you to match her thoughtfulness in the same way, so maybe finding a way that you can each express your affection where you both get to play to your strengths is the answer. I would be honest with her and tell her how wonderful her gifts are, and share that you really genuinely appreciate them and what it means about your friendship but that, if it’s okay with her, you’ll show it in a different way. I recommend purchasing quality time experiences as her gift. Give her a card that says, “I’d like to take you out to this new restaurant to celebrate your birthday. Dinner is on me!” or “I’m hosting a [insert her hobby or shared interest here] party in your honor”, or “Merry Christmas! Let’s go get mani / pedis together!”  \n\nThere are ways you can both show how much you care for each other without having to match the gesture exactly.",
            "Similar to other suggestions but you can use this shift to start new traditions! Instead of gift giving maybe you have a potluck dinner where you both (or other friends as well) bring something and have a friend's christmas dinner!   \n\n\na couple friends and i made the decision to stop giving gifts a while back and a big part of it was financial reasons cause we were all students but also just to take the overall pressure off!",
            "Ann Perkins? Is that you?",
            "I show my love by giving gifts. I don’t expect my friends/family to reciprocate. It gives me joy to see them enjoying the gift. She may feel the same.",
            "Just be careful when you talk to her. She may see it as a criticism on her gifts, which will make her feel bad about her efforts. (I’m a gift giver myself, and when people reject gifts or have a lackluster response, I can really be hard on myself.)",
            "Your friend may LOVE everything about giving a gift but doesn't really care if she gets one. So before depriving her of gift giving, show her this post and say it was from you. Then suggest you will be giving her the gift of time - take her to a nice cafe and spend time with her. And ask her what she'd like to do. She may be just as relieved as you. But if she wants to continue, let her and she'll know you'll be having a lunch with her instead of a gift. Then you both win. \n\nYour gift may be allowing her to continue giving you a gift.",
            "I honestly would just say everything you said here and tell her how you feel.\n\nMy roommates are my best friends and we rotate dinner days. One day one of my roommates sat us down and said he felt a lot of pressure on his cooking day and that he wasn’t as good as a cook as the other three of us. We told him we didn’t care so long as he cooked. We’d eat chicken fingers if that’s what he made. Point is that he was putting all that pressure on himself. Similarly just because your friend is a good gift giver doesn’t mean she expects you to be as great as her at giving gifts. I always give thoughtful gifts and expect nothing in return. I do it because it makes me happy to make others happy. I don’t need anything in return. If your friend is a close friend she will get it. Had one of my roommates told me they felt pressure to get gifts and wanted to stop, id say I’m still giving you a gift but in return you can do something fun with me like go to dinner. So much less pressure that way and then you don’t feel bad. Etc",
            "Everyone here is missing the point. You don’t want to do it.\n\nJust tell her you love her, but can’t keep up. It’s making you uncomfortable, so you’d like to just keep it to birthdays.",
            "This doesn’t have to be about the gifts. You can make it about different love languages. Your love language is not gift giving. It’s not natural for you and it produces a lot of anxiety. Your friend on the other hand loves it and it makes her happy. Value that difference and communicate your way of expressing your love. For me it’s quality time. I‘M not a gift giver. I am a time and activity giver. Let me plan an adventure any day. Botanical gardens? A hike in the woods? People watching at a festival? Yes yes yes!!!",
            "Ya know, what you wrote here is actually pretty good. Tell her honestly how you feel. She seems to like it, you dread it. My best friend is also an amazing gift giver, and I’m shitty at it. She likes to do it. Me, I’m really bad (unless you’re my mom). Honesty is a pretty good way to go.",
            "I'm also like your friend. It's really not about the gift. It's about the thoughtfulness. I tend to buy gifts way in advance not because it's an elaborate plan but because I see a thing and the thing reminds me of you and I just want you to know that you're thought about and loved. I don't care what I get in return. The smile on your face when you open it is my actual gift. \n\nI can say with all certainty that if you told me not to get you gifts, I would still give you gifts but just not give them to you on the holidays. Care packages are my jam. If I knew it stressed you out I would feel terrible but there are ways to get around it. I'm sure your friend already knows she's better at giving you gifts, why not be honest with her and just say hey, I love you, you give the bestest gifts and I feel like my gifts never measure up to yours. Can you help me and give me a list of things you'd like? Or set a spending limit. Just saying you can't afford to do gifts would not stop me from buying you something.  I always tell my friends I have zero expectations of reciprocation. They know it's just how I say I love you.   Jesus, I hope they all know. I'm going to go check in with my friends to make sure they aren't stressed about my gift giving.",
            "I love gift-giving. If my best friend told me not to get her a gift, I probably would still get it for her, because it's something I love doing, it's one of my love languages. I have been told to not give gifts before and honestly, I hate it, it's one of the few things I feel I'm really good at. A couple of years ago my best friend approached me she said, \"I love the gifts you give me so much, it stresses me out because I can never do you justice, would you consider making me a list of things you want, like the exact thing you want?\"  \n So all year anytime I want something, but I just can't pull the trigger to buy it, I add it to an Amazon wish list all year for her. I love board games so that's mostly what my list is these days, and I love it, I get something I really want, and she doesn't have to stress - most of the time she just has Amazon deliver it to me so she doesn't even have to wrap it.",
            "Do experiences rather than gifts.",
            "Normalize low maintenance friendships. I can tell my friends marry Christmas ya filthy animals and that’s good enough.",
            "A lot of people are suggesting activity gifts instead of physical ones and I have to add my two cents in for it! \n\nStarted doing this with some friends and it is so enjoyable, I have those memories to cherish forever with them. \n\nIf your friend loves gifting, taking her out as your gift will be such a treat. I think communicating with her is key and if she is that good of a friend she will listen and see where you’re coming from. I wish you luck!",
            "Ask her now to book a trip or a day together that the two of you can plan instead of exchanging goods. Frame her a picture from it and write her a gushy Christmas card when the time comes.",
            "An actual post in here that is real for once.  Congrats.",
            "I think a good compromise might be choosing to exchange birthday gifts OR Christmas gifts but not both. In adulthood, that’s what my closest friends and I do. My local BFF and I only do birthday gifts and then my longtime best friend group only does a Secret Santa every year. It saves time and effort, but will still allow your friend to get you something! And if you can’t find the perfect physical gift for her, something experiential is usually a hit! For example, getting mani/pedis together, going to a wine and paint night, concert tickets, etc.",
            "Why don't you do what the older people in my family do? There too many of us know and so many kids under 18. So now when you hit 18 you join the gift game.\n\nThere are only three rules \n1. You all agree to a low amount of £5-£10 that you HAVE to stick too.\n2. The gift has to be either weird or useless but always funny and silly, the more useless but amusing the better.\n3. Unless it's inappropriate (some have been a little none child friendly) you must use it at some point either at the party or post a pic showing you've used it if you're away for Christmas.\n\nIt's almost become a competition at this point and gives everyone a fun time gift shopping and a good laugh opening your gift.\n\nMy mum won last year by getting her brother a set of reusable, flashing ice cubes. That doesn't sound that fun but what he didn't know was that once you poured your drink in and they got wet each one played a tinny version of the tequila song on a loop often starting and ending at different times. See useless, mildly annoying yet very funny!",
            "I'm just like you.  I'm a terrible gift giver.  Other than my mom, who is easy (jewelry, scarves, flowers, candles, etc - typical mom gifts) I have the hardest time shopping for people.  I hate the stress and the pressure - I think it's why I hate Christmas so much.  I would much prefer to spend time together or buy dinner or something.  My love language is quality time and giving/receiving gifts is my lowest ranked love language.  My brother is kind of like me too and we came to an agreement that we won't give gifts just b/c we have to but if we ever see something that the other would like, regardless what time of year it is, we'll buy it.  It takes the pressure off of needing to have something by a certain day.",
            "I told my friends this and it worked like a charm. \n\n“ everything I want, I have. If I don’t have it, I can’t afford it, if I can’t afford it, you can’t either.”  It was short and sweet. We still get stuff for kids but no adult gifts. Even with my kids, I’ve made it clear that what I want from them is their time. Not more stuff and for the same reason.",
            "I'm the gifter in my friendship and one notable year I bought her a tablet as she was considering going to school for animation and she bought me a Costco jug of chopped garlic lol. And I loved it! It was hilarious to be handed it in a nice restaurant while she was blushing furiously and crying laughter and it was beyond useful. There's no measuring between friends, it's entirely in your head.\n\nBut it's also fine to stop, too. We skipped last Christmas because she was too tight on funds, one year I gave nothing as I was too broke, some occasions we'll just have a movie night, one she made me a scavenger hunt, sometimes only one of us gifts. It's truly not a worry, just share the pressure with her and it'll all sort itself out.",
            "Can you gift her with experiences? Like a trip somewhere, the zoo, skydiving, a concert or music festival, a beer/wine tasting, a fancy restaurant, lessons in something she's interested in, go out for drinks, maybe tickets to a sports game or something? \n\nSince it means a lot to her, maybe tell her how amazing she is at gift giving and you can tell how much thought went into it. You may not be good at it yourself, but you always appreciate the thought she put into it.\n\nGift giving is definitely my love language. I get it. Some people just don't know what to get me, but it still makes me feel loved if they put a tiny bit of effort in to show they were thinking of me. Even favorite candy makes me happy. Some people put lists in their phone and add things your friend likes or mentions, their hobbies, favorite stores or sports teams, etc. It helps for Christmas and Birthdays and I know it can be very overwhelming to shop for gifts, so it's a good reference point. \n\nThe biggest thing for us is just wanting to see how happy and excited someone is when they receive their gift. It really is more about how happy we can make people. It we get a small reaction we feel kind of disappointed, like we didn't do well enough. You can tell her you don't want to do gifts this year, but she's definitely going to do something anyway, because you mean a lot to her. Neither of my sisters want to receive or give gifts and honestly, it makes me sad. Just do what is most comfortable for you but let your friend know how much you appreciate her thoughtful gifts.",
            "For me, I LOVE gift giving, but the act of wrapping gifts stresses me out to no end because I suck at it. Think easy to open for a toddler, but not purposely. I just can never get the paper tight without causing a rip. In your case, I'd suggest a yearly girls day to a spa. Maybe November/December as a \"yay, we got through the stresses of yet another year, let's relax.\" type thing.",
            "Clearly gifts are not your love language. Send her a link to the \"love languages\" and say \"Hey, you're the best and I am so glad you're my friend but I've realize... gift giving is just difficult for me. I so appreciate you and if you want to keep doing it, go for it, but can I instead offer to do x for Christmas with you instead?\" For x, if you are a \"quality time\" person like me, suggest some activity you can take her on around the holidays. There are tons of ways to show you care outside of gifts, and hopefully your friend will understand if you approach it from a place of love. It's clearly not about the money or the time, it's just not the way you like to operate. \n\nOne of my best friends is a very good gift giver. I like you am not. She still buys me gifts sometimes, I rarely get her gifts. But we're open about it and I do other things for her, like I will always make time to do whatever she wants for her birthday. Even if it's last minute, I'll be there for cocktails, or dinner, or whatever. It works just fine as long as you both get where the other person is coming from!",
            "I'm a gift giver and I love planning gifts months to weeks in advance, it's just so much fun for me.  It makes me sad when people want me to stop giving gifts, my list of people to give gifts to just decreases over the years as friends move in and out of my life, relatives die, etc.  I love having people in my life I can show appreciation and love to. \n\nHaving said that, I'm very picky about receiving gifts.  I often tell people who want to buy me gifts in return to get me gift cards for the movies, for fast food or coffee OR for my favorite big box craft store.  I don't need the same effort I put in but I love when someone is nice enough to give me a gift card so that on a bad day I can treat myself.\n\nIn the end, its better just to talk to her and come to a compromise or see what she has to say about it.",
            "Some people just have that special compartment in their brain for excellent gift planning. I don’t and therefore usually overcompensate with really expensive garbage nobody needs.",
            "Omg I feel you! I’m a terrible gift giver - I can never think of good ideas - even the ideas I am happy with when I’m buying somehow turn out not to be as good as I’d hoped when I’m actually giving the gift and then see what they’ve given me. I always seem to be out of sync with the other person on what ‘level’ of gift we should be giving and the whole thing has me feeling woefully inadequate and fairly socially inept!\n\nBut, it’s also not that important to me... so I’ve phased it out with most of my friends/family who I know won’t mind.\n\nAlthough, I still have a couple of friends who seem to really find it important and are really great at gift giving - so I kind of muddle along with those. I try and make up for it a bit with some really lovely cards to go with the gifts (I’ll do cards with photos of us both on the front and make sure to write a really personal note) and I make a point of sending chocolates/flowers/books/wine to any friends who I know really communicate through gifts if they’re sick or have some good or bad news. Someone else mentioned love languages, and I hope that when that’s someone’s love language the fact I send little gifts throughout the year makes them realise how much I value them even if I disappoint terrible for birthdays and Christmas! \n\nThere’s been some great advice on this thread though - which I’m definitely going to be incorporating.\n\nEdit - the lovely cards thing is an ongoing project cause you have to make sure you take a photo with them each time you meet up so you have something to put on the next card!!",
            "Is it a money thing? I would just take her out to lunch. But other than that just be straight up. She probably wants to give you gifts regardless which is fine.",
            "I do experience gifts now tbh. Life's crazy and treating someone to a day of fun can be such a treat. Either paying for a day of something or just planning a whole day can be an amazing gift! Or paying for a class together, paint nights can be cool",
            "> I know she enjoys gift giving and it is clearly one of primary ways she communicates her love for me and others.\n\nPeople who give gifts to show their love don't usually expect reciprocation of the gift as much as the love. Let her show her love her way and you can show your love your way. \n\nI would careful about asking her to stop doing something that she does to show her love.\n\n>I have been able to move away from gift-giving with other friends by just casually mentioning it or just mutually ceasing present exchanges, and we now opt for spending time with each other - something I love.\n\nWhy not give her gifts that involve spending time with her? Take her some place she loves and treat her to a nice outing? Have her over and cook her favorite foods? Help her in her yard for an afternoon? There are lots of ways you can show love and make a gift without it being a physical object.",
            "Love the idea of spending time to be your gift, but be careful to not take the joy of her gift giving away.  \nMy work team is reading the 5 languages of appreciation in the workplace, and it is helping me with this exact situation !  One of the languages is Tangible gifts so it really goes into this well. The original is more on personal relationships “5 languages of love”  and I want to read that one next",
            "> How do I tell my best friend (both F20s) that I want to stop exchanging Christmas presents?\n\n\"I want to stop exchanging Christmas presents.\"\n\nDirect communication is not unkind.",
            "She’s your best friend. Just sit her down and be honest. Tell her you love her and cherish the gifts she’s given you and you’ve tried hard over the years but gift giving isn’t your love language or strong suit. Tell her honestly that while you love the effort she puts in, having to match the thoughtfulness or generosity or effort is really daunting and ends up stressing you out. Maybe let her know if she wants to keep up the gift giving because it brings her joy that’s totally cool but you’d appreciate maybe a joint planned activity in lieu of a gift for the next few holidays.",
            "“My friend Leslie Knopes me at holidays and I don’t know how to tell her to be more like April Ludgate.” 🤣",
            "Start giving them donations in their name to charities/causes they care about.\n\nIt's an easy way to get the gift obligation out of the way, and either they'll love it a lot and you can stop feeling guilty about not getting them anything good in return, or they'll start to build up resentment that they keep buying you nice gifts and you don't get them anything \"real\" in return and they'll just stop giving you stuff eventually.",
            "I know you’re struggling but from a person who doesn’t have anyone to give gifts for nor anyone gives me a gift, I would like to have something like this. So although you may not like it now, once gone you might end up missing having a friend to exchange gifts. But you do you",
            "Perhaps a phone call? \n\nLet them know how its making you feel, if she puts that much effort into gifts it means she genuinely cares for you. \n\nI'm very similar to her, my love language is gifts and showing people my love as such. I'd feel really upset if a close friend felt pressured to give me a gift. I'd rather just buy a dinner at one of our fave restaurants and spend time with her.",
            "I think you should tell her the truth. Tell her she gives such amazing gifts an its really upsetting you mentally not being able to give her some thing as good. May i suggest that instead of gifts make memories like go on a two day vacation thing together or go for a hike an get lots of pictures together an have a blast. She sounds like an amazing friend who I'm sure will probably understanding, i really do suggest the memories thing tho. I hope this helps",
            "I totally understand where you are coming from but on the other hand my love language is definitely gifts. I love finding the perfect thing for people that compliments them and what they like and if it’s something she enjoys I wouldn’t say no to it. On your end, maybe you can adjust to something different. My grandma always used to write in a card “this is good for brunch on me.” Or something similar. Other times people would put in a gift card and say “for your next movie night.” If you feel like your gifts are lackluster know that she most likely doesn’t notice and you have options to switch things up.",
            "This is like a real life Leslie Knope and Anne Perkins situation",
            "[deleted]",
            "Perhaps you could change the way you \"gift\" her by instead of giving her a present taking her out somewhere new and special. like, not just once. Make it your thing! tell her that the best gift she could give you is her company and tell her that from now on instead of always giving her an actual present you will pick her up and go somewhere new and adventurous. I'm thinking amusement park, hike up a mountain, zoo or something else. That way you get to spend time with your friend, which is what you said you enjoyed in the first place. But the main point is, your gift and hers won't be comparable as you're giving her and experience rather than a material object. Oh and pay for everything of course as the day out is YOUR gift to her.",
            "Downgrade to a card exchange. Easier, cheaper, more personal depending on what you write.",
            "Maybe do a service day together. Like buy some stuff for a animal shelter, homeless shelter, or woman’s shelter to donate and spend the day volunteering there together. Start a new tradition.",
            "I have had friends ask me what I wanted for Christmas/Birthday. Would your friend consider that \"cheating\"? \n\nIf not, maybe (in the future), my present to you will be to treat us to dinner at this nice restaurant that I think we will both like. \n\nClearly, she is getting pleasure from giving you gifts. \n\nYou might explain how you feel and see either she could either give you hints, accept an activity/meal or would prefer not doing anything.",
            "my best friend and i have lost steam on present exchanges and now just take each other out for fancy meals at nice restaurants we usually cannot afford lol. it's actually great and we go to different parts of town we would have never gone to and we have a lot of fun just being in each other's company.",
            "I've done the same with my friends, last year we phased out present buying. But I think a nice token gesture would be fine. My idea for this was for us each to find the ugliest/weirdest item under £5 in a charity shop, which could be fun. Haven't implemented it yet, but hopefully one day!",
            "I straight up told my friends i couldnt afford presents anymore and they ended up agreeing it was too much money to buy every friend presents.\n\n&#x200B;\n\nSo we dont bother, even with cards! we still love eachother but dont worry about the BS of presents and cards.\n\nHonesty will always work if theyre real friends \\^\\_\\^",
            "She is really into this and it gives her Great Joy. Why would you take that from her? My sister does this. I don't Attempt to compete. Do You. She Is not looking for reciprocity.",
            "*Sheldon Cooper has entered the chat*",
            "I am the gift giver in my group. I looooovveee finding stuff that I think people will like big and small, but I don't need them to give me stuff back. I will also spend a long time thinking of an appropriate gift and sometimes be pulling strings to get it to work like months in advance. For me, I just really like when they show up at events when I invite them(tho I won't say no to presents, but they definitely don't have to be thought out as mine are, if they thought of me at all, that is worth it to me). \n\nLike everyone else here, I think offering an experience is often a good substitute. For a friend, I was happy just to have them come hang out with me. Another friend really wanted to give a gift back but got anxious about buying the wrong thing, so I sent them a link of something I wanted and had them buy that. I've also given a list of 3/4 items so they could pick and it would still be a \"surprise\". \n\nI am not trying to guilt here or anything, but your friend might be really hurt about being asked not to give presents anymore, they might really just want to show they care rather than expecting something back. I would be, even if I understood, this is definitely a tough situation that requires conversation.",
            "It sounds like you and your friend have different love languages and it might be worth having a conversation about this as neither of you are doing anything wrong. She is a gift-giver and you sound like a quality time person, or even maybe an acts of service person. You should address this to state what your guy's expectations are in your friendship to give and receive love. If that means that your friend values giving gifts maybe more than needing to receive them than that helps your dilemma immensely.",
            "I love Christmas gifts. I love giving them, I love opening them, I love seeing giant piles of them under the tree every year. I've already bought two presents for this season and its freaking September. (They're not wrapped yet)\n\nHave you considered asking her to make a list for you? Even Santa Claus, who's literally the magic embodiment of gift giving generosity, asks for suggestions. It sounds like you aren't having an issue buying gifts, but actually deciding on a gift. If you had a suggestion list to work from, it might take some of the stress out of it for you. And of course she wouldn't expect you to buy the whole list, but you could choose 1 out of 10 or so suggestions that makes you happy to give her, so she is still surprised by your choice.\n\nMy family shares our Amazon wish lists with each other around Thanksgiving, so the duplicate presents problem is solved as well. And I'm still pleased when my brother buys me a book, and my mom buys me a board game because they chose to get me those things instead of a lego set or a scarf which were also on the list.",
            "Literally, word for word, what you wrote in your TL;DR. Say that.",
            "The way to stop exchanging is that when they give you something , don't get something back.\n\nif they don't get it the first time then that didn't happen a few more times and eventually they will realize that they're the only one giving, and then they may stop\n\nBut at the same time , don't expect that you must be also giving some kind of expensive or well thought out gift.\n\nSome people enjoy giving you the gift not necessarily carrying that much about what gift they receive from you .  they like your happiness when you receive their gift they don't necessarily care about the kind of gift you give to them",
            "As someone who has love languages that are both quality time and gift giving I love doing things with people I care about and I love giving gifts. For me, gift giving is about figuring out something in their life that they need, will love, and can use all the time. It’s a physical reminder of our relationship just like the time spent is creating new important memories with that person to build on the relationship. Both are important. \n\nI would suggest you and your give each other different kinds of gifts that will serve both of you. Let your friend give you a gift that you make together or that requires that gift of time, and give her a gift of quality time with a special activity that can include a physical souvenir from the day. You both are able to communicate your love languages in ways that feels best to you while honoring each other’s feelings.",
            "Is she a Virgo?  My relationship is the same with my BFF. It’s stressful. I need this advice also!",
            "As a really great gift giver myself (and someone that does it sometimes without reason or cause for celebration), I give gifts with zero expectation of reciprocation. I give gifts because I find things that I know someone would *love* and it brings me joy to bring them joy.  If someone told me they felt pressured, I would communicate the above to them and apologize if I ever unintentionally pressured them to feel like they needed to keep up.  There’s a good chance your friend feels the same!",
            "I don’t know your friends, but this year has been hard on everyone and I believe she will understand. I’ve had really similar problems to you and addressed them with no friendship fallout. All of my friends and family were incredibly understanding and loving. With my family we exchanged hand made gifts only, which I know isn’t exactly the same. But I encourage you to be open and honest (but also kind and gentle) with friend.",
            "Girls weekend getaway! Everybody contributes a little something.",
            "Is your friend leslie knope",
            "**BEST ANSWER**\n\nTell her you suck at giving gifts and cannot keep up, and you feel bad as her gifts are always the titz at the ritz (or however you say \"really good\").\n\nThis both compliments her, exposes a minor vulnerability in your self and shows you are willing to confide in her. May even get you in the sack with her but make sure you actually want to go there... or use this to solidify the friend zone she is in.",
            "Look up love languages. Gift giving is big for some people so I really hope you don't tell her not to give you a gift. Instead, focus on what to are good at. The other love languages are actually of service, quality time, words of affirmation. Do you gravitate towards any of those? Maybe you can plan a fun activity for you guys to do together, write her a card or letter or get her a voucher for something. Like if she doesn't like to clean, you can get her a voucher for a cleaning service.",
            "As someone who loves to give my friends gifts, I never expect one in return. I even make sure to say that so there isn’t any anxiety over it. Does she expect gifts in return? Or is that just something you feel the need to do?",
            "If they’re ur close friend just talk to them about it. They won’t be offended if y’all relationship is that good, especially if they’re getting you gifts every year. I’ve been friends with some people for 10+ years and they haven’t ever thought of getting me a gift and that’s fine bc I don’t care 🤣",
            "This might not work in your friend dynamic but my friends & I have agreed years ago that if you want to give a gift, you may, but do not expect one in return. We play wargames together and we often build custom models & paint them for each other and we got to a point where we felt guilty about it. \n\nEver since then we still sometimes gift each other things but we know not to expect anything in return and I can say we've been much happier for it.",
            "Sounds like you’re friends with Leslie Knope. Go the Ann Perkins route.",
            "Tell her you have embraced an xyz mysterious religion which is minimalism oriented which is why gift exchange etc is a sin and would hurt/is against your religious beliefs\n\nXyz can be any fancy name you wish to choose.",
            "I think the important thing to understand with gift giving as a love language is you’re not necessarily expected to reciprocate. I give gifts to my friends and rarely get gifts in return but I do get quality time, acts of service, or words of affirmation from them. Your friend isn’t gifting to get a gift back and it’s ok for you to express love for her differently.",
            "There are good ideas about how to communicate this in other posts. I'd like to say that if giving gifts is how your friend shows love and she is hurt by not being able to express her love in this way, there may still be a compromise. You could agree that you'll gratefully receive her gifts and in exchange you'll plan a special day for the two of you once or twice a year. An experience of some kind. It doesn't even have to be something expensive: It could be a hike to a pretty spot, or a trip to a garden, or an evening star-gazing. That way you get to show your love through quality time and she can feel it as a gift.",
            "Why don't you just talk to her about it? Friends can talk about this stuff and there's nothing rude or ungrateful about bringing it up. Mention that she gives amazing gifts but that gifting isn't your strong suit and you're worried that you're letting down your side of the gifting relationship so it's causing you stress. Don't do it during a gift-giving event. Do it during a chill moment when you guys are just chatting. \n\nIt might be that she gains enjoyment from giving gifts and really just doesn't care about getting gifts in return. Some people genuinely just enjoy finding and giving the perfect gift. Getting the perfect gift in return might not even been something she is interested in.",
            "Since she clearly loves the thought process and creativity, suggest that you both donate to a charity in the others’ name. And she can use her creativity to find the most unique or underserved charity or ones that have particular meaning to you. It’s a win-win for all involved. You may end up enjoying the process when it’s for something so helpful.",
            "I'm a gift giver too and what my non-gift giver friends do is give me an experience in return. So we go to the zoo, or try something different or just hang out and they buy me dinner. I'm always happy with this because I know this is their way of showing me they love me.  Just like how I do it by giving special gifts.",
            "A group of friends and I did gift exchanges for years. I hated it because of the stress I felt to get a good gift for them. We even went so far as to create a shared Dropbox folder and putting lists of what we each wanted. Still hated the situation. I finally had a talk with everyone about how much it stressed me out. I told them I’d rather just get together for a meal or something and hang out cause being around them was more important. And now that’s how we do it.",
            "I’m just like your friend and I think the best advice I could give you is to Be honest with her and tell her what you told us through your post. Just be prepared that she may continue to bring you gifts anyway because that’s how crafty gift givers roll. It’s not about a contest of who can give the most crafty creative gift. Literally people like us don’t care if we get anything in return. We thrive on creativity and making others happy.",
            "Find a mutual charity you can support....make matching donations.  You both can feel great and help a struggling org.",
            "I has something similar with my brothers. At one point, I just pointed out that all we were doing was exchanging gift cards, none of our kids were kids anymore, and the best part of the holiday was being together. I let them know I would no longer be buying gifts, I truly preferred not to get any as well. After one somewhat awkward Christmas, it never came up a again. That was 10 years ago.",
            "Just tell Leslie that you value her presence over gifts and in lieu of a gift you would like to spend time with her",
            "So I am your friend. Meaning I act like her. If she is like me, her true joy is from bringing others joy with presents and receiving presents isn't as fun. Like I like it and all but if all the people who I buy gifts for assumes I am keeping score, that would break my heart. I buy gifts as an extension of my heart. Other people show me love in other ways. You get to choose how you express that love you feel for her. I would be legit surprised if she was mad you aren't as into gift giving as she is.",
            "Neither my fiancé nor myself are great at present-giving, so for our anniversary, Valentine’s Day, and some christmases, we both take the money we would have spent on our gifts and combine them to pay for an experience we plan together. Sometimes they’re day trips, sometimes they’re weekend trips, but they’re always so much fun. It’s much less stressful than trying to surprise someone with the perfect present because you get to have fun planning the trip together, and you get to share the experience together. I’d suggest sharing your feelings with your friend about how stressful it is for you and how it makes you feel bad that you’ll never be as good at it as she is, and you would much rather spend time making memories with her instead.",
            "Just tell her you cant \n\nSome people like this just like giving gifts, they dont except one in return always. \n\nSome years I do this for friends, some years I don't, some years they do, some they dont",
            "Here’s the thing though, I completely understand where you’re coming from but I’m exactly like you’re best friend. I’ve already started buying Christmas presents and put a lot of thought into every present I give. Gift giving is also one of my love languages in terms of how I express love to those I care about, I think that might be the same for your friend. Have a talk with her because stopping gifts completely might mean cutting off a way she expresses love.",
            "Really great idea was mentioned and I agree.. spending time together instead of gifts..   A couple years ago my friend and her 2 daughters (around your age) agreed to this..  They go to the city, see theatre or just a nice dinner together instead of birthday gifts.  Last X-mas my side of the family agreed to 'no gifts'---  none of us need anything so we just get together and no gifts-- except for the younger kids.",
            "I feel this. My fiancé’s mom is a huge gift giver, to the point that it’s like 10 things to unwrap every time and they’re all just stuff I don’t need. It feels really materialistic and makes me uncomfortable, to the point that I dread holidays. I’d love to say “let’s do donations in each other’s names this year” instead of physical gifts, but I know that would hurt her feelings.",
            "Does she expect you to gift her back? I like gifting but don't mind if the person gets me a gift back (actually it can make me a little uncomfortable unless it's something simple and cheap). I would not like if a friend didn't want me to gift them because they felt obliged to give one back and would just want an honest conversation on the matter. If they told me they'd feel they had to give me a gift in return even if I had told them not to I would stop but my preference would be to keep giving gifts and they not give me gifts.",
            "Ask her if it’s ok you give her a card? Tell her you love and appreciate her gifts, but you just do not get into it as much as she does.",
            "I recommend not having that talk honestly. I love gift giving and don’t expect much back, I put kidney time and effort into presents from my bf and I expect little in return. I like the feeling of gift giving, I get happiness seeing the person excited, feeling guilty you don’t have the same eye for gifting doesn’t sound like a. Good reason to dump the tradition",
            "Why does it matter to you that you can't match the material value of give they give you? Be humble, admit it to them tell them straight and tell them how much you like their gifts how much you would like to do the same for them. People don't always want back something from you. Only live and friendship. Tell them.",
            "Gift giving should never be \"stressful\" even though most of the times it is.\n\nInstead of stoping gift exchange (which your friend clearly loves to do) just tell her how difficult you find it to select gifts! I am sure she will understand... You can just gift her normal things like accessories, expensive self care creams etc.\n\nGift giving is about emotions. It doesn't matter what you give! Just tell her the same thing you've told us!! Trust me.",
            "It's not a competition, don't be lazy \n\nSource:i have gift giving love language. I would be disappointed that my friend who knows it means alot to me would try and find an opportunity to end something that made me feel happy and a connection to her.giving presents is about the other person, not you. So you don't like it, but it makes her happy.if you don't want to make her happy, address that problem.",
            "This why if you want a gift from me you need an Amazon wishlist",
            "I really hate gift giving to and receiving 🙃 I'm very cheap so I don't spend alot of money to begin with and I don't have alot of things either. So alot of the things I receive either end up In The trash or in a salvation army box. It's very hard when Christmas comes when I have nieces and nephews And my kids are showered with gifts. I'm no help at all but didn't want you to feel alone lol",
            "\"I want to stop exchanging Christmas presents\"",
            "You tell them you want to stop exchanging Christmas presents. Next!",
            "Are you sure your best friend isnt like...in love with you 😳",
            "I am disheartened by all of the comments telling you to just accept the gifts because it makes your friend happy. You don't want to receive gifts, that's your boundary. You shouldn't have to feel bad every Christmas and birthday, and accept behaviour you don't want, to keep the peace with an overbearing friend. \n\nAttention gift givers: It doesn't matter how much YOU want to give people things. If receiving your gifts makes people uncomfortable, you are NOT being as loving as you think you are. Loving people means respecting their boundaries, not forcing stuff on them to make yourself happy. That's manipulative. Gifts are meant to make the receiver happy, and if your giving makes them upset then you're not thinking of them at all, you're being selfish. \n\nImagine if the issue was hugging. Should you let people hug you even if it makes you uncomfortable, because hugging is their love language? Would any of you be telling OP to just submit to physical contact she doesn't want?\n\nOp, stick up for your boundaries. Tell your friend no more gifts.",
            "[removed]",
            "„Hi Karen. I want to stop exchanging Christmas presents.” You welcome"
        ]
    },
    {
        "post_id": "3t5h7x",
        "author": "throwawaynewlysingle",
        "title": "I [27M] had been with my now ex [27F] for ten years, I proposed last week during a trip to St Lucia, she told me she'd been cheating, /r/relationships, how does one move forward after a decade being with someone then getting screwed over in the worst way possible?",
        "url": "https://www.reddit.com/r/relationships/comments/3t5h7x/i_27m_had_been_with_my_now_ex_27f_for_ten_years_i/",
        "score": 2217,
        "num_comments": 427,
        "created_utc": 1447764927.0,
        "selftext": "Sorry about the title length, it just sort of came out.\n\nI had been with Carrie for 10 years, best friends since we met at the age of 12 in high school. We had tons of amazing memories, we've traveled to several countries together and made long term work for 3 years while separated due to studies. (Though now I'm having trouble believing anything was real).\n\n\n\nLast Thursday I proposed to her in St Lucia, (Not in front of anyone mind you, I wanted it to just be private). She didn't say anything and I was thinking, oh shit, did I say or do something wrong? She started crying and said she had something to explain to me. She didn't want to marry me because she'd been sleeping with the co worker she said was 'just a friend' for around 3 months. \n\n\n\nShe said she rationalized it was just a thing that would pass but it's continued and she said she loves me so much, more than I'll ever understand, that I've helped her so much and she doesn't even know why she has done this. She said she loved me too much to marry me knowing she'd done what she did.\n\n\nShe doesn't love the guy, it was just sex and she had been trying to stop the affair but I proposed before that happened and she said she knew when I was kneeling that she couldn't marry me, not after everything I'd done for her, so she told me.\n\n\nI feel like my whole world has shattered. We had an awkward flight home on Friday evening and haven't spoken since. She has tried calling me but I haven't answered and I have until Monday off, so I'm just here.\n\n\nI've barely eaten, I feel like there's a black hole in my stomach draining everything I have mentally. I can't wrap my head around the fact that she was cheating, that she lied, that she hid it from me.\n\n\nMy sister apparently had some words for her. I'm trying to pretend I'm okay but I'm not. Every morning that I've woken up since last week Friday morning has just been bleak.\n\n\nI love her so much but I've no intentions of getting back together, I don't think I would ever be able to trust her again much less forgive her for a very long time. My best friend brought a six pack yesterday and we drank in the evening, I cried my eyes out in the shower last night. I never cry, not even when my mom who I was extremely close to passed away, but I was sobbing like a child last night and honestly I would have loved if my mom had been there to tell me it'd be okay.\n\n\nMy sister brought over some breakfast this morning and basically made me eat because she knows I haven't really been eating lately, zero appetite.\n\n\nAnyway, I'm sorry this post is so incoherent. Any tips for someone on how best to move forward and where to go from here? Because I've got nothing, no ideas, no clue. I feel like a zombie.\n\n\ntl;dr girlfriend of ten years admitted to cheating for the past several months when I proposed, we're done but I have no clue what to do now, my life revolved around this woman for over a decade, she was my rock and my everything and all that just died a little under a week ago",
        "permalink": "/r/relationships/comments/3t5h7x/i_27m_had_been_with_my_now_ex_27f_for_ten_years_i/",
        "comments": [
            "This might sound harsh but I mean it with the best of intentions; be thankful that this all came to light when it did and not when you two were married. Use this time to explore life and indulge in your hobbies and interests. It's very painful when a loved one betrays us, but you need to remember that you have a very bright future in front of you, don't waste it on someone who doesn't/didn't respect you. Perhaps when you're feeling up for it, organise a nice night out with friends and family, try not to lock yourself in a room and dwell as that will only make you feel worse.",
            "This is a quote from a post long ago I saved... I hope it helps you.\n  \n> The fucked up thing is that this is great. Every bitter moment of disillusionment brings you closer to truth. In your case, it brings you out of a shitty relationship and leaves you open to being in a good one. \n\n> We cling to our old pain, we don't want it to go because we are attached to it, because we are afraid of an unknown future without it.\n\n> The truth is, when we do this do this we are clinging to an anchor that holds us at the bottom of the ocean. We are denying ourselves the growth we need.\n\n> There's absolutely nothing wrong with this. You are totally allowed to feel the pain, cry in the shower, get drunk and scream your rage at the God you don't believe in. Do that. Feel that pain, dive deep into it.\n\n> For about 72 hours. You have till Friday to wallow in self pity, tell everyone how unfair it all is, and bemoan the injustice of being treated so poorly by someone you treated so well.\n\n> But come Friday I want you to start thinking about how it's better to be without her. Realize that she is likely to always be like this, she probably isn't going to suddenly stop cheating on people, she isn't going to stop pulling shit like \"X has my permission to punch me in the face and blame it on you.\" \n\n> Instead of thinking how hard it is to not have been cherished the way you want and deserve to be, realize that it's much harder to go through life not able to love and cherish people. She used you, she's never going to be able to stop wondering if her next lover is using her. She lives in a world where deceit is a part of love, and you just got out of that world.\n\n> Think about that, you just got out of that world. Now you're free. Now you can find the next stage of your adventure. Maybe it will be the last stage, maybe it will be another false start, but it will be new and different. \n\n> Now you have an opportunity to redefine yourself. \"Hit the gym, throw yourself into your work, reconnect with your loved ones.\" Or, if you want a little less B.S., don't expect to be happy. Instead work on creating the causes and conditions for you to find happiness. Take care of yourself and the things you love, be interested in personal growth, and have a lot of fun. Eventually you'll lock eyes with a special someone, and then a few years later you'll laugh about how some ex of yours cheated on your for months, and it probably saved you a few years of a dysfunctional relationship.\n\n**I love you brother, you got this.**\n\n****edit - Original Author****  \n  https://www.reddit.com/r/tifu/comments/30mcl3/tifu_drinking_with_my_girlfriend/cptxtmr",
            "Hey man, I went through something similar last year, and I can assure you things will get better. It hurts right now, and its totally understandable to feel lost, you're gonna feel like that, and you're going to feel all sorts of emotions in the time to come, you can't fight it, and you can't beat yourself up over what happened it wasn't your fault. \n\nWhen I was in your position I moved on autopilot, I kept my routine, I ate when I had to eat because I had to focus on something, I did work when I had to, and I reached out to my friends, especially when I felt like I didn't want to be around anyone, I'd call them, or text them, just something to get my feelings out and know that my friends had my back. Do that, reach out to your friends, lean on them, and talk with them about anything. \n\nIts kind of funny, I mean it hurts right now, but in time you will see that this heartache you feel right now is just the beginning of a new adventure for you. \n\nYou will be just fine, and you will get through this. ",
            "A common misconception in all the world that gets thrown around a lot is \n\n\"Eventually you'll find someone better, you'll find somewhat that treats you right\"\n\nWhen you've just left somebod you were with for 10 years, this does not do a whole lot of good, IMO.\n\nYou will be happy again, because eventually *you will be happy with yourself*. You need to be happy as an individual before you are happy with someone else as a couple.\n\nWill you eventually find somebody else? yeah, odds are ya will. But at this very moment thats not entirely important. Focus on you, become a happy you!",
            "Grieve. She was a big part of your life for a long time. It is going to hurt. It will take time to heal. Let yourself feel what you feel and do whatever you need to in order to mourn the future you were going to share.\n\nUse your support system. Stay in touch with friends and family that care about you. Don't isolate yourself.\n\nPick up a hobby. Stay active. \n\nAnd finally, let go of any contact with your ex. Block social media, delete her number, etc. Allow yourself to move on.",
            "Firstly, I'm so sorry to hear this and I can't imagine how you're feeling. You have to take things one day at a time. This must be a huge shock and so it's really important that you look after yourself at this time. You need to get up, shower every day and try and eat food to keep yourself healthy. Also, drink some tea, it's a surprise how much a cup of tea can be like a warm hug. As much as what you probably don't want to, you need to do this. What kind of financial situation are you in? Can you look at getting a new apartment? You need a fresh start and staying in the home you lived in together is not a wise idea. You need newness and a place that isn't filled with memories. Set yourself daily tasks i.e. today look at two new apartments. You need to tread slowly as this is such a traumatic time but slowly building yourself up to this is a good idea. You will be ok. You will get through this. One of my favourite quotes is, 'if you're going through hell, keep going'. You will find your happiness and the happiness you deserve. Where is Carrie staying at the moment? Could you have your sister or best friend pack up her stuff so at least in the interim it's all removed from your house and you don't have reminders or alternatively, because she's the one that did this horrific thing, could you stay somewhere with your best friend or sister and leave her to figure out the apartment? If not, I would move your mattress to your lounge room, just to stay out of your bedroom. Silly I know, but little things like this help. Again, I'm so sorry to hear this has happened. Sending you lots of strength at this time! ",
            "The best advice I have for you is, that it will suck for a while, but eventually, you'll get over her, meet someone else, marry and be glad you found her. Your ex will just become the girl you once loved that fucked you over. Have zero contact with her. Closure is a myth, and is overrated. Cut her out of your life immediately. Lean on your friends and family for support. Think about seeing a counselor. Get busy doing things that make you happy. Go be selfish for a while. Hit the gym, take up new hobbies. Get active. Get busy livin' or get busy dyin'. ",
            "You move forward by blocking her on everything, hitting the gym and reconnecting with old friends and hobbies.  Then its just a matter of time.\n\nDid you know, for instance, that Fallout 4 and the Planets update of Space Engineers both just came out?",
            "This comment will get down-voted to non-existence, but it appears it is still taboo on these types of threads.\n\nYou don't *have* to throw away those 10 years. Marriages and relationships have been known to survive affairs. \n\nFrankly, the fact that she felt the need to tell you, so much that she couldn't hold it back, the moment you proposed, is a sign of some level of character that is worth noting.\n\nMost redditors will say \"once a cheater, always a cheater\" but really there are degrees of cheating and this fact is lost on the hivemind.\n\nThere *is* a difference between your girlfriend (not wife) having an affair with a co-worker and your fiance blowing the best man, behind the barn, during your wedding reception.\n\nThere is a great deal of info out there on how extramarital affairs have been overcome, and how some people have reported them as improving a relationship in the long term. Just google \"can a couple overcome an extramarital affair\"...\n\nI agree that total cut-off is appropriate right now. For at least a couple of weeks. But if *you* feel, deep down, like you actually think this woman can learn from her mistake, and if *she* wants to try to re-build your trust and respect, then I think anything is possible.\n\nThere may be conditions you have to impose on her... for example, leaving the job where that guy works. I think that is reasonable (as is, obviously, cutting off all contact with him, for-absolutely-fucking-ever).\n\nBut keep in mind that, going forward... *if* you want to try to rebuild your life with her, then one day you would have to forgive her. If you want her to work on rebuilding your respect, you also have to refrain from hitting her over the head with this \"you cheated!\" stick for the rest of your lives.\n\nJust think about it. Reddit will tell you that if she doesn't lose you, she didn't learn her lesson. I don't believe that is always true.\n\nEDIT: I wrote something unclear \"one day you really do have to forgive her\" above. It should say \"*if* you want to try to rebuild your life with her, then one day you would have to forgive her\". (Never-forgiving is definitely an option, and would be be perfectly fair in this case.... but it is not an option if he and she want to try to overcome this affair). I have edited in-place too.\n",
            "I am you from the future, here to tell you that everything will be OK.\n\nI am 33.  About 8 years ago, I went through a very similar thing.  Found out my long-term GF had cheated on me multiple times over the course of the last year or so of our 5+ year relationship (though, in my case, the GF didn't volunteer the info, it came out unexpectedly).  I was shattered.\n\nI remember feeling a lot of the same emotions you've described: the black hole in the stomach, the confusion, the pain, and the feeling of being lost -- not knowing how to move on or even which direction was up.  It was utterly disorienting.\n\nI remember knowing logically that I had to break up and move on, but not knowing how to do that.  Not knowing how to live my life without her.  As you said, you've built your life around her.  I remember also, in low times after the breakup, considering reaching out to her, but I never did.\n\nI never spoke to her again after that.  At first, I took some time and focused on me.  It helped that I was in grad school at the time, but whatever career/schooling you are pursuing right now, just dive in.  Gradually, I began seeing other women, but for 2+ years, I never got serious or emotionally invested with anyone.  Feel free to have a series of flings, when you are ready.  \n\nIn a way, I was shut off from the world, emotionally.  Now, I think it's okay to do this, maybe even necessary, after such a trauma.  But this part is important, -- as you're floating adrift, DON'T LOSE SIGHT OF THE SHORE.  Don't succumb to the notion that all women are rotten, or all relationships are doomed.  You are a sensitive, caring, and thoughtful person, and you've been hurt by someone who should have been in your corner.  But don't let that blind you to your own sensitivity and kindness.  Eventually, after focusing on yourself for awhile, you're going to want to step foot back on the land and give things another try, so you'll need to keep that part of you alive.  Just protect it for awhile.  There are women out there who are deserving of it, and will reciprocate it.\n\nEventually, you'll look back on this relationship with some regrets -- you'll wish you hadn't \"wasted\" so much time with this girl, etc.  But it will no longer be crippling or debilitating.  You'll move on to better things.  As someone else said in the comments, you're now free of this world where relationships are based on deceit and mistrust.  You're young, and you've got so much life ahead of you.\n\nI have now been married for 2 years to the most loving and caring woman I've ever been with.  I couldn't imagine spending my life with anyone else.  ",
            "She didn't screw you over in the *worst* possible way. She told you rather than let you marry her without knowing. She's fucked up but she is not the worst, there's plenty worse out there.  Probably don't wanna marry her though!\n\nOne day when you are an old man  you may reach the stage where you feel only pity for her and no anger. Until then, you need to concentrate on moving on and learning to enjoy life again.",
            "You've got 10 years of new ladies to catch up on, bro.  ",
            "It's not your fault.  ",
            "Hey brother, I know a ton of people has told you this, but you need to trust us on this one: it will get better. I went through a breakup with my high school sweetheart 4 weeks ago. I've known her for 10 years, dated for 7. We were even engaged the last one month of the relationship. But she broke up with me, for reasons I'm still trying to come to terms with. Don't try to repress your feelings - anger, frustration, sadness, emptiness - feel them all. Cry in the shower if you need to. Scream at the top of your lungs if you need to. Don't pretend to be okay. Nothing wrong with showing weakness. We're all humans after all. I'm so sorry you have to go through this, but I know you'll get through this. Spend time with family and friends. Grab drinks. Play pool. Drive around with friend. Overtime, the time you spent with your ex will be good memories that you can smile back on. You're  still 22, plenty of time to explore yourself and the world. Good luck pal, PM me if you need anything. ",
            "I find it weird how people can say they're 'trying to stop affairs'. Either you cut or you don't. Anyhow, my advice is pretty similar to most here: DO NOT CONTACT or let anybody try to coax or bully you back into the relationship. Hit the gym, eat well, try not to indulge in booze TOO much, read some good books, reconnect with friends and family. Go through the motions. ",
            "Read [my story](https://www.reddit.com/r/relationships/comments/3nh85m/my_girlfriend_27_f_of_11_years_told_me_27_m_that/cvo1vpz) .  It *does* get better.  Be strong.  Work-out the stress.  Take care of yourself.  And, when you are ready, and show the confidence of a man who knows who he is, what he wants, and where he is going - a beautiful thing will happen.\n\nJust be glad you found out before you married her.",
            "Travel brother, save up some dough and leave the country, maybe go overseas to study abroad? Go have some fun and clear your head at the same time.",
            ">She said she loved me too much to marry me knowing she'd done what she did.\nShe doesn't love the guy,\n\nShe has oats to sew and doesn't want to get married.  Instead of telling you this, she chose to cheat.  She may not love this guy, but she also doesn't love you.",
            "[deleted]",
            "I wish I could give you some advice that would stop the hurt, allow you to get over it immediately and move on....but I don't have anything and I don't think anyone does. \n\nAll I have to offer is internet hugs.\n:(\n\n",
            "Hey man,\n\nJust wanted to say that I really don't have any earth shattering advice, because honestly, there is none at this point in time. My SO and I of 8 years ended our relationship out of the blue a few years ago. She told me that she didn't love me any more. Every single thing you have described I have been though. I cried in the shower, I cried before i went to bed, and i cried i the morning when I woke up. Keep in mind... I don't cry, ever... This was a new experience for me. Once the crying stopped I felt the dark lingering emptiness weighing me down everywhere I went. It was terrible. All I wanted to do was talk about her, the breakup, how miserable i felt. Eventually though, your friends get tired of hearing the same shit over and over so you're left by yourself in bed at night with your own thoughts. This went on for MONTHS. Along with loosing 15 lbs, I also lost all motivation to do anything, including school work. Yeah... I was going to school at a very expensive university and I couldn't even find the motivation to go to class. That was my low point. Once that happened i realized I hit rock bottom. One day I got up, got dressed, and went straight to the University Councillor's office and made an appointment. I ended up seeing this lady for 3 months, and she helped me get my shit together. It helped a bit, and i was at least able to start going to lecture again. She told me to start working out, so I did, and it helped. She told me to go out and get a new haircut, get some new clothes, so I did. She told me to learn how to cook. I didn't have any motivation to eat still at this point, but I did it anyway. Basically all these things were to get her off my mind, and to find some new things I've never done with her before, and to start liking myself again.\n\nAnyway, not really sure why I posted, besides letting you know that I don't wish this sort of long term breakup on my worst enemy, and that there's always people here that can relate and talk to. I wish you all the best man. ",
            "visit a monastery, drink excessively, go to a professional sporting event, look upon people with children and meditate on how bad it sucks.... be glad that is not you. Smoke some weed, start a monthly autodraft to your savings account based on how much you spent on her and see how fast it adds up! Buy a video game and eat a bunch of pizza. Try skydiving... that will really give you a new perspective... join a gym! But most importantly WATCH SPAGHETTI WESTERNS, LISTEN TO WARREN G and GET THAT DICK WET! the rest will come out in the wash.\n\nEnjoy life man... remember that relationships evolve, you are not with the same person and you are (likely) not the same person. Regardless of the person, they will change but the face stays the same. It doesn't matter who you spend life with, just be sure that it is with someone worth your time - this is all we have.\n\n(Are you rich and was she really hot? - just stick with the playboy lifestyle for a while lol)",
            "Honestly, it sounds like you have everything under control.  \n\nYou are gonna feel pretty shitty for the foreseeable future.  Just know that it eventually passes.  Wake up in the morning and, if you need it, have a good cry.  Limit yourself to less then 10 minutes and then get on with the rest of your day.  Rinse and repeat as needed.\n\nSo a byproduct of being mentally depressed with be physical depression.  In a sense, the lack of appetite isn't a terrible thing.  Your metabolism is gonna slow and you really don't want to come out of this breakup 50 pounds overweight.  That said, DO EAT.  Just be conscious about it.  If you don't already belong to one, join a gym.  Make a schedule and STICK TO IT.  The exercise will give your endorphin level a boost and make you feel better.  And if you're having a hard time finding motivation, use the massive quantities of anger that will start to manifest itself over the next few weeks.\n\nThe ABSOLUTE most important thing to remember here is:  **Do not let this experience define you as a person in your future interactions and relationships.**  Just because one woman cheated on you does not mean that the gender as a whole is dishonest.  Don't become bitter.  And just because she cheated on you does not mean that you somehow failed to live up to some unspoken bond between you.  A person's action towards you, whether good or bad, are 99% of the time based on who THEY are as a person, not who you are.\n\nWhether you decide to get speak to Carrie again or not, you need to forgive her.  This is not for her benefit, but for yours.  I'm not suggesting that you take her back or anything like that - I'm just saying that you need to recognize that she made a mistake and knows that she hurt you.  Hell, you don't even have to tell her you forgive her, just make sure you know it in your mind.\n\nAnd as for wondering if the last ten years was a lie... bullshit.  Just because she fucked up doesn't mean that she was playing some long con on you.  The fact that she came clean about it means that she cares and respects you enough not to lie about something so important.  That doesn't change the fact that what she did makes her a total twat-waffle, but it does mean that the entirety of the last ten years was not a lie.\n\nYou're only 27.  Life isn't over.  There are over 7 billion people in the world and at least half of them are women.",
            "[deleted]",
            "Zero contact. ZERO. She knowingly did this, don't accept that \"oh, it just sorta happened and I really meant to stop hopping on his junk, but gee, I just couldn't make him stop being so attractive, lol\".\n\nIt totally and completely sucks. the sooner you admit that and get through it, the better.\n\nGo solo for a while, figure out who YOU are and what YOU want to do in life, regardless of whether there's a girl. You must build the Self and let everything else fall into place. \n\nYou're 27: you're young. It sounds like you have a decent job. Keep doing great at work. Improve yourself mentally and phyically. Try an Arnold Schwarzenegger workout routine for 8 weeks just for shits and giggles. Read the Art of War for the hell of it. Don't look for women. Don't avoid them either. ",
            "You don't want to hear it but time. It hurts like hell right now and it's going to hurt for a long time. But it will get better. And you'll feel better. And you'll slip and all of a sudden it will feel terrible. But it keeps getting better. \n\nI'm so sorry you're going through this. ",
            "You have the right idea about not wanting to get back together, but you need to realize that the desire to do so may never really fade. Ten years is a really long time to be together, especially from such a young age. It is your home base, your safe space, and the temptation to want to try again might become overwhelming as time goes on. \n\nDo not do this. She does not respect you and does not deserve a chances. ",
            "You may not see it now, but in a year's time you'll be happy about the massive bullet you just dodged.  Clearly she was nowhere near as invested in you as you were in her.\n\n\nFocus on yourself... and stay healthy, because it really is pointless to punish yourself in this situation.  I promise you will find someone who puts you first.",
            "Been there, but for different reasons.\n\nYou talked about the death of this relationship, and it basically is like a death.  You need to take some time to grieve for the end of this part of your life. Watch your favourite movies, drink your favourite beer, eat all your favourite foods, just indulge yourself. Do something small and mindless like put together a puzzle, or pick up a colouring book and crayons, just something relaxing. It's ok to be miserable for a while, it's inevitable when something like this comes to an end.\n\nThe important part is that at the end of say, a week, you pick yourself up, dust yourself off, and realize that you WILL be ok. ",
            "[deleted]",
            "This is an opportunity to meet your true love.  She wasn't.  I am so sorry this happened, but it happened to me and I'm stronger for it!",
            "My ex broke off an engagement after an almost 7 year relationship. It was challenging at the very beginning but it's one of the best things that ever happened to me. \n\nTake it as an opportunity to focus on yourself for the first time in 10 years. Throw yourself into your work or studies, clean up your diet, exercise, stay busy, pick up new hobbies or use your extra me-time to pursue existing hobbies. If somebody invites you to an event just say yes. You have nobody to check with, you have no other responsibilities, just do it. It's an opportunity to meet people and do things you might not have otherwise done. It can be lonely sometimes but it's always exciting - there are new opportunities everywhere.\n\nBasically you can choose to spiral downward or improve/reinvent yourself. Live well.\n\nI ended up meeting my wife/mother of my children at the gym doing just that.",
            "I'm sorry man, this just sucks ass. The only thing that'll help is time.\n\n\nFind a new hobby, new video game, join a gym and lift some iron, something to help pass  the time. \n\nJust don't to anything self-destructive, and do your best to stay healthy. Appetite or not you gotta eat. You don't want to become a burden to others. Your family and friends seem there to help, so you can rely on them for a while.",
            "Be glad she had the decency to tell you before marrying you, at least. Not sure how she tries to justify it being a phase or loving you so much as you don't do this to people you love. Mine wasn't as long but my ex basically left me for another guy that she wanted to bang after 5 years of being together. There's no secret solution or anything that will take away your pain. All you can do is start focusing on yourself. Work out, go out with friends and do anything that you enjoy and makes you happy. It is ok to grieve for a day or two but the worse thing you can do is isolate yourself and push everyone away. You'll have the urge to try and fix things with her and maybe take her back, ignore the urges. She's not worth your time and you will never trust her again. Cut all contact with her and don't talk to her ever again. It will take a while but you will start to feel better and eventually be back to normal. Hang in there and take it one day at a time. Learn to be happy by yourself, it'll only make your next relationship better.",
            "Look at the bright side. You could have spent your life raising another mans child as your own.",
            "My girlfriend of six years, wife of one year, admitted cheating and left me for the other guy. \n\nLet me tell you: you ARE gonna be OK. Just not now, and not tomorrow. Now it's the time to cry and let it all out. \n\nSounds like you have a great sister and some nice friends. Let your emotions out. Talk to them. Tell them, and tell yourself, how you feel. Stop contacts with your ex. Let her go. This is a loss and mourning is fine ; I actually believe it's the only way out. \n\nOne year ago I was miserable. I started running like I never did before ; doing triathlons. Picking up good eating habits. After some months, when I felt ready, I started using tinder - honestly more for checking it out. Turns out that there was this great, great girl who was also single :) and we are now dating and deeply in love. She's the greatest thing that happened in my life - I am astonished at how much I love her! \n\nLife is a beautiful roller-coaster. Hang on when you're down, knowing that you'll be up again soon. \nLots of sympathy from Switzerland! ",
            "There's an article on TED called \"Why Happy Couples Cheat\". Please take a look at it. I hope life works out for you. Cheers.",
            "I've been in a similar spot, when I was just younger than you. Had been with my gf for 6 years from 16 to 22, got engaged, and she cheated.\n\nI felt like I had basically wasted those years of my life, which were supposed to be some of the best. Truth was, I learned more about myself and what I wanted out of life and relationships from that experience, and the years that followed, than I could have ever learned otherwise. \n\nI moved away -- 1,000 miles to New York, where I didn't know a single person, and I went from there. I met new friends, tried new things, and learned to enjoy life without that crutch of being in a relationship. \n\nAnd a few years later, when I absolutely least expected it - when I was truly happy just enjoying my 20s with my friends, I met this girl that turned me upside down. And she was so different from what I thought I had wanted when I was in that defunct early relationship. \n\nSo what do you do? Make yourself get out of bed. Start there. You're going to have pain - that's part of being alive, man. Mourn the relationship you've lost, but put it behind you and start your new life. One day you'll look back on this time with excitement, because this is where it all began!!",
            "You've been a catapillar. Be a cocoon. And then be that butterfly. ",
            "Be glad you didn't marry her. ~~lawyer up~~ delete facebook, hit the gym. Buy a motorcycle and take a safety course. Discover new things. Explore life around you. Rediscover yourself. And whatever you do, if you ever find yourself looking to talk to her again to rekindle things, JACK OFF BEFORE YOU DO IT. Whatever you do, don't ever look back at her. Keep your eyes forward, and cherish the memories you had. You still have a good life ahead of you. It's up to you to make a new man of yourself and find new love. \n",
            "Don't succumb to the sunken cost fallacy.  \n\n\nYes, you've spent 10 years of your life with this woman.  Just because you've spent time and effort into the relationship with her doesn't mean that you should continue to do so because you've \"started down that path already.\"\n\nYou WILL find someone else, your life is NOT over, and GREAT things still await.  It's tough, and it will be.  Take this time to concentrate on you and do the things that YOU want to do and you'll be fine.",
            "Ten years is a long time - it will take time to come to terms with the betrayal and the fact that she is no longer a part of your life.  She is likely to try and manipulate her way back in, do not allow this to happen.  Remove every attachment, unfriend mutual acquaintances and sever all ties.\n\nDo not let anger drive you to do anything stupid, always try to maintain the higher moral ground.  Be wary of alcohol during this time.  Reach out to those who are close to you, you will find surprisingly sage advice close at hand sometimes.  Observe the kindness of random strangers and the effect it has you - also remember this in future when you are back on your feet.\n\nLet yourself cry, let yourself shout, let yourself wallow in self pity, allow yourself to feel the flow of emotions.  Friends will tell you to get over it sooner than you are ready - you'll know when you're ready.  Healing happens naturally and organically - open your mind now to all the possibilities your relationship might have excluded (travel, activities, different foods, whatever).\n\nSorry to hear about your situation.  Things will get better for you and looking back one day this unbearable pain will be a distant memory.  You'll also be grateful you escaped when you did, because you've still got the rest of your life to enjoy.",
            "Hey bro sorry to hear this, it's every guys worst nightmare when in a relationship.  But at least she didn't marry you and take half your shit and half your paychecks for the next 18 years.  Be thankful as hard as that may seem.  Stay single now brother.  Women aren't worth it these days. ",
            "I would suggest getting her off your phone and social media accounts to help you move on. Other than that, there is not much that you can do. I've been there before. Only time can help.",
            ">She said she rationalized it was just a thing that would pass but it's continued and she said she loves me so much, more than I'll ever understand\n\nNope. She should have never it get that far. Can't trust her, more so after the *10 years* you've put into the relationship. Pack your shit, delete Facebook, hit the gym. \n\n>I feel like my whole world has shattered. ... I've barely eaten, I feel like there's a black hole in my stomach draining everything I have mentally. I can't wrap my head around the fact that she was cheating, that she lied, that she hid it from me.\n\nWell you had your trust betrayed, and your future plans thrown into complete turmoil, so that is to be expected. Your best bet is to surround yourself with friends, throw yourself into your job, or find a couple new hobbies to occupy your time - and more importantly your mind. I would also recommend going and seeing a counselor for a while. It will help you talk though your feelings and let go of any emotional baggage this has caused you. ",
            "As difficult as it is to do so, glean only the positives from this. \n\nA) You found out before you got married\n\nB) Sooner rather then later, right?\n\nC) You're free to find a lady that isn't a complete douche",
            "\"There's no better foundation than rock bottom to set up your roots and regrow\" There is a large amount of negative emotions going through your mind right now and it's understandable. The person you believed you could trust and loved just betrayed you in the worst possible way. Take time to grieve, let all that emotion out, hit the gym or any other hobbies you may have to channel it into something productive. But, I can not over emphasize this enough, her cheating was not your fault!!! She decided to destroy what y'all had for 3 months of just sex, do not for any reason even think about taking her back!!!",
            "You need to realize that none of this is your fault. If you have been a loving, trusting and faithful boyfriend, then you did all that should be expected. Her actions are a representation of her flaws, not yours. Her actions, even though they are hurting you, are the result of her choices. Unfortunately, this is just how life is sometimes. We do our best, and can hope for a good outcome, but we ultimately have no control over other peoples choices or actions. Control what you can control, yourself and how you respond to this.",
            "You're young enough that you'll bounce back from this. Trite, but true. If you haven't been single since you were 17, then there's a whole world out there of carefree times, not necessarily romantic ones, which await you. Always wanted to live abroad for a few years, but couldn't make it jive with a serious relationship? Now you can. The silver lining is that, for the first time in your adult life, you can live for you. It'll get old, but first it'll get new.   ",
            "I think there's a line from Sleepless in Seattle that might be appropriate here . . . something along the lines of, \"you wake up, breathe, and keep breathing . . . and you do that every day, and eventually it starts to hurt a little less.\"  \n   \nThere's no short cut or easy way through this, and, if there were, you'd probably be short changing yourself if you took it.  You need time and you need to feel the hurt.  In the long (meaning: looooooooooong) run, you'll be a better/stronger person for having had your heart broken . . . as long as you can keep it from making you bitter and broken.  And again, I think time is the only cute for that.\n   \nI'm so sorry this happened to you.  As shitty as it sounds, I'm actually kind of impressed that your ex did care enough about you to not do any *more* damage.  She didn't have to come clean.  She's lied this much, she could have kept going with it. \n    \nI'm not sure if that's any consolation though.  It's a really fucked up kind of \"care\" she showed there that was probably the kindest thing she could have done under the circumstances.\n   \nBut still, fuck her anyway.\n   \nBottom line though, it's ultimately better that you know, and you CAN and WILL move on from this.  Never speak to her again unless it's to let her know how much she's hurt you (she's entitled to witness the consequences of her actions - but still, try to maintain your self respect and class).  Don't let her explain, justify, or rationalize her actions; nothing she says can change what she did.  \n   \nAgain, man, I am so sorry she did this.  People really, really suck.  A lot.  \n   \nYou will survive this, and you will come out a better/stronger/more interesting person on the other side.  Bro hugs and if you need someone to send booze, let us know.",
            "Consider seeing a therapist; really helped me work through some tough times. Definitely join a gym, if you don't know how to work out, do something with classes, like crossfit or kickboxing. When you're ready, try using tinder or OKcupid, easy low barrier way to start talking to new people .\n",
            ">I never cry, not even when my mom who I was extremely close to passed away, but I was sobbing like a child last night and honestly I would have loved if my mom had been there to tell me it'd be okay.\n\nDeath  as painful as it is, she did not die it to hurt you. It wasn't in her hands to leave her son.  While much more permanent than infidelity, there is an inevitableness to death. It is not the case with infidelity. She hurt you intentionally multiple times on purpose.\n\nMaybe infidelity is similar to death in one sense. It is the death of the person who once loved you back. The person who loved you wouldn't do this kind of  stuff. It wasn't even a one time drunk thing.",
            "Cut off all communications with her. The first few months are going to be the hardest.  It'll get easier just hang in there. It sounds like you have a good support system with your sister and friends. Just keep yourself occupied with work or whatever. Good news is you can sell that ring and buy yourself something nice. ",
            "The best advice I can give you is to spend a lot of time with your friends and family. They know what you're dealing with most likely and I'm sure they would be there for you. As you said your friend came over with beer and your sister came over with breakfast. They want to help you and want you to feel better. So take advantage of having people that love you. I don't mean that in a manipulative way I just mean that they want to help you, so let them. And you can most likely lean on them when you need it. \n\nI wish I could say that I know what you're going through and to some extent I do but 10 years is a long time. \n\nMy ex and I broke up and I found out she was dating a coworker the next day, so there was something going on. It sucks to know that someone who supposedly cares about you can go behind your back like that. But the thing to remember is at least now you don't have to be with someone that's a total scum bag. Sure, you loved them. But you don't love what they have done and that's something to remember. When I'm feeling shitty I just remind myself of what happened and that I am better of now. But I also wasn't blind sided with my situation. \n\nIf you need someone to talk to though you can private message me. I know I'm just an internet stranger but if it'll help then go for it. ",
            "You don't just \"get over\" something like that. That's fucked up. It's soul-crushing. It's reality altering. You don't pretend it's okay. It's not.\n\nWhat you do is this. You go to therapy. You learn about yourself. You learn about people. You learn that not everybody can be trusted, some of them are just as soulless as she was. But there are good ones out there. You discover that you deserve so much better than the way she treated you. You look for somebody better and you don't settle for less. You respect yourself. You learn that you are worth much more than she thought you were worth. She doesn't decide your value: you do. You know who you are. You know you deserve better.\n\nSeriously, fuck her. I'm sorry that happened to you. I hope you can forgive yourself for letting her waste so much of your life. You still have many good years left, find a way to enjoy them.\n\nIf it was me, I would never speak to her again. She's not worth the potential pain. She doesn't get to do what she did and continue to play you like it didn't matter and didn't mean anything. This isn't about her anymore, she lost any right to your consideration as soon as she cheated on you. You don't owe her a damn fucking thing.",
            "At least you don't have kids. You are actually fortunate she told you.\n\nMove on. Make strong male friends and don't let them go for a woman.",
            "It sucks man. Hearing that from someone you love is probably the worst thing you can ever hear.\n\nSilver lining time. One, she told she you was cheating. That almost never happens. They usually lie and lie even when caught. Two, she actually thought about you instead of just herself when she said No. Most cheaters and people in general would have just said Yes so they could be married to someone who loves them and then just cheat on them on the side. That is the norm.\n\nSo I understand you are devastated but it could have been much much worse. She could have said Yes and then lied to you for years, maybe even your whole life. That would suck much worse than this does now.\n\nCan you trust her again... I would ask anyone can you ever really trust anyone? I mean isn't the idea of trust itself kinda like the idea of heaven. Like yeah that would be cool if good people went to this awesome place when they died, but who the fuck believes that. I view trust as the same thing. It is just some fantasy we create in our minds that assumes a human being will always stay the same. Human beings are constantly changing, so to think you could trust anyone about something like desire or sex doesn't make any sense to me. \n\nWhat matters the most I think is whether both of you really want to share your lives together and will that be additive to both your lives.  To me that is much more important than love, sex, cheating etc. Are you going to make each other's lives better? That is the key question. Let this shitstorm blow over for a few months. Then you both can think we a clear head.\n\n",
            "I was in a similar position -and right around your age, too! \n\nI moved closer to family, changed jobs, did a bunch of \"casual\" online dating. Was great. With hindsight, I realized that my previous LTR was toxic. I lacked the experience and perspective to see it at the time, but I was meeting many new people and figuring out the different ways people treat each other. Dating in parallel allowed me to quickly recognize and nope away from many truly awful women. \n\nToday, I'm happily married and we have two children. Life feels like a dream now and looking back... the 10 years with my ex were the darkest in my life.\n\nDon't mourn for the 10 years you've lost. There's nothing but blue skies ahead of you. What are you going to do with your youth and freedom?",
            "It took me four years to admit I needed therapy after I was cheated on. Don't wait like I did, find a therapist right away so they can help you. ",
            "One thing to realize is that you will have to go out and make mistakes as well.\n\nWhile everyone else was out and figuring adult lessons of dating, you just missed that stage. Honestly you need to just find something you enjoy doing to occupy your time before you start trying to go after other people.\n\nThis is why the \"hit the gym\" advice is so prevalent. It helps you in the dating scene and can also take as much time as you want it to. (I was running 10 km a day or more when I was single)\n\nBut really, just find a time intensive hobby to better yourself. Deal with the new world of dating after that.",
            "I just made an account on reddit on impulse; I decided to give google a whirl because I've been feeling a bit shitty recently and obviously, the answer to all my problems is the internet. After typing in \"reddit\" and \"relationships\" i was brought straight to this page. The moment I saw your post all my woes straight up evaporated into nothingness because this right here is just brutal. \n\nYou'll probably think none of us understand the pain you're going through and you're probably almost completely right (but for a few other unfortunate souls out there); but for what it's worth, I hope you get through this alright. Keep on moving. It hurts less if you keep moving. You'll be fine in time. Be strong OP you can do this! ",
            "I love you so much, you can't even comprehend! But I had sex with my coworker. \n\nI don't understand this...\n\nOP, I wish you the very best! ",
            "First thing you need to do, is to forgive yourself and work on being able to trust yourself again. This can take a lot of time, so be patient with yourself. It's ok to have bad days, and I would be lying if I said they won't happen. \n\nWhat helped me most through heartbreaks in my life (not at all comparable to this, but I feel the base formula will still work) is to love and allow yourself to be loved by those who have always been around and loved you. Those people that may have had to take a backseat at times, but have undoubtedly been there for you and loved you since the beginning.  Feeling what you are going to feel is going to happen no matter what you do, but having a support system of love around you helps to make it through that. \n\nRight now, try to be functional. Take a shower and get dressed. Take pride in these little things, because they take big effort. As time passes a little, try to focus on you. Go workout, go out with friends you've made excuses not to go out with (be responsible though and have plans for a driver), try new things (rock climbing is an activity that takes physical exertion and problem solving, it is very challenging but very rewarding and the people at rock gyms are incredibly nice and helpful.) Give it a try, give a lot of things a try. This creates quality time with yourself, seeing what you like. What you don't. Gives an opportunity to self reflect, learn and grow. \n\nFinally, the last part is learning to trust yourself again. Admittedly I'm still working on this, but I'm not worrying about it not happening anymore. You may not trust your own taste in women, you may try to analyze what in your ex you missed that caused this pain. THIS IS NORMAL, and something you'll have too look into for yourself when it happens. Just know that just because this happened in this case doesn't mean your taste in women will lead to this pain. \n\nThere's no specific right way to cope. Everyone is different, but there are destructive ways in trying to cope. Love yourself enough to recognize if what you start doing is not healthy. \n\nOp, you sound like a really genuine guy, and some girl will be lucky to meet you someday. This process is a good chance to focus on making yourself better for yourself, and in that process, someone someday will be so thankful you did. But more importantly, you'll be thankful you did.\n\n",
            "This is heartbreaking to read. I can't imagine the pain you must be feeling. I can only offer the hope that in time, things do get better. You will become a better version of yourself. As others have suggested, take this time to focus on your passions, your career, your family, and your friends. Life is very short, every moment should be utilized to its fullest potential. Be grateful for every moment you have in this world. If you feel like talking to someone, I am only a stranger, but I care. ",
            "It hurts.  It's going to hurt until, little by little, you can stop thinking about it.  I've been pretty much exactly where you are now- proposal, confession of cheating, breakup... and unfortunately, there's nothing anybody could do or say to make it hurt less.  It just didn't work that way.  But, in time, you start to think about it less, and less, and less.  Until you get your life back.  \n\nThat is an inevitability.  There's nothing anybody can say to make this hurt less right now, but please know you WILL NOT always feel this way.  Guaranteed, this will stop.  Takes a while, but it will stop.  One day you'll be all better and you'll look back and realize this doesn't even hurt anymore, and you never noticed exactly when that happened.",
            "Oh, and see a therapist. Seriously. ",
            "Wow, OP - that's horrible. Very sorry for what happened. My advice may seem harder to do, but I think it's the right thing to do to protect your heart and your future - stay single for a while. Don't try to get someone to fill that void because it won't work out. It's not fair to you or that person. As people have said, working out, etc is all good advice. Take care of yourself. Ride it out by diverting your attention elsewhere. And definitely go no contact. There is no magic bullet - we've all been there in some form or another. And within the next day, someone will be posting their story along the same lines here on reddit. You're not alone - it happens to the best of us. Best of luck to you.",
            "I was engaged to a woman and two weeks before our date with a photographer and all the wedding stuff all lined up I caught her cheating on me.\n\nIt will wreck havoc on you for some time to come but know this. There are people in your life who do thanklessly care and love you and DON'T go around behind your back hurting you. There are also plenty more out there who will do the same. You need to rebuild yourself to the point of trusting and loving others before you can get back into a relationship otherwise you may salt your own wounds.\n\nProlonged contact with her will also reset your pain. Every time you hear her out you are reliving the experience and putting yourself through hurt again, which will only draw out the recovery that much longer. You need to be able to look ahead at a path with yourself alone moving towards goals- career, family, whatever, and find out what will get you there and pursue it.",
            "I know it sounds cliche but one day at a time. Try to take pleasure in some small things each day (How good something tastes, how soft your pillow is when you lay down) and work hard at everything you do. Try to make yourself better every day. The rest works itself out.",
            "Bunker down. Pick up some hobbies or discover some. Force yourself to the gym. You are in for a long fucking ride where every day begins with the same empty feeling in your stomach and pain in your sternum. That's heartbreak. There's no remedy, no solution. You have to endure. Just endure. You'll come back from this, you'll obviously find someone new, it's just going to take a lot of time. The hobbies/gym/work are things you do to get from point A to point B.\n\nGood luck.",
            "Technically your marriage was saved\n",
            "You've been together for a long time. Maybe you both know what love is, maybe you don't. You've been together so long the comfort of the person that...not complete's you but makes life comfortable to get by can be confusing. You want excitement and those highs of a new relationship..but love is king..How do you hold onto both? Your gf did not know. She tried a new relationship to feel those exciting, unexpected, new and fresh feelings you get. It's a wonderful high that makes you feel like the world is right and great and everything is better or getting better. But it's a feeling. It's great but depth is what lasts. Being together SOOO long, she got enticed by NEW sparks.\n\nWhat to do?\n\nCheat?\nLeave her?\nStay and carry resentment?\nStay and forgive?\n\nAll I can say is that each come with there own potentials and pitfalls. But on a simple assessment without an in depth knowledge of each of your lives and the wants and needs that you and her may not realize you need or want I would say...\n\nBreak up with her. Tell her you need to really just step away and explore your options. She's not ready to commit even though the relationship is going on this long. I can only guess the reason why someone would cheat behind someones back they love is because of 2 things.\n\n1. Staying with you MIGHT be what she wants, but is security holding me back from seeing if this is REALLY what I want?\n\n2. She loves you but doesn't want to hurt you while she figures out these feelings.\n\nShe gambled on trying to find out and its blown up in her face..My advice?\n\n1. If she hasn't already dropped the other guy completely realizing her mistake, leave her. She's still holding onto her options which is selfish.\n\n2. If she did dump the other guy, dump her too and tell her you need time alone to figure things out and if she can wait give yourself time until you think you might want to try this again. If she can't wait for your Yes or No for a possible second chance because she realizes she made such a mistake. Make it clear there are two people in this relationship. She wanted to know if you were what she wanted...the wrong way. Now you need to see if you want HER...the right way. If she's selfish and wants an answer: DUMP HER. She's selfish and her unsatisfied feelings WILL return with an eventual conscious or unconsious realization of your weakness for her. She being weak in judgement herself might bore and try to search her feelings out..on your time.\n\nLet me know bruh...\n",
            "Can't add anything that other folks haven't already posted here, but, as someone else who doesn't have both parents around: \n\nThis is going to be okay.  It's going to hurt for a while but it is not a cliche that you will come out of this better and stronger.  Your mom isn't here to tell you, so someone should.  This is going to be okay.  \n\n",
            "Ex wife did this to me. You taking her back and/or pursuing her will only convey to her that it's okay to cheat. \n\nI took her back... she did it again. The second time was so much worse. Focus on you, a hobby, and meeting women  (when you're ready)\n\nIt does get better... but it will take alot of time. I feel for you!",
            "I had something similar happen to me. We were together ~7 years, although there was no proposal. I went home to visit my parents for Thanksgiving and she told me I should just stay there. Turned out she found some other fella. \n\nMy situation was different in that I moved to live with her during college, about 5 hours from home. Luckily I had already graduated by the time this went down. I had to move back home, had no job lined up, no real idea of what I was going to do. \n\nI'm not a super emotional person. I was able to process it logically pretty shortly after it happened. Sure, she wanted to split, but there are billions of women in the world. I don't believe in \"the one\" or soulmates, anything like that. So you look at the relationship for how it really was. There are always negatives and positives. For the purposes of getting over a relationship, it's easier to focus on the negatives. When you've gotten over the initial shock and sadness, it's pretty easy to readjust and do things you enjoy for yourself. Embrace the freedom you'll have for the next little bit before you inevitably find someone else who will likely be better for you in the end than someone you met when you were 12.\n\nPeople change as they grow, especially from preteen to adult. Now is your time to really figure out what you want without worrying about someone else's feelings. It's not really that bad. You'll miss her now and again, but if you're keeping busy, it will go away pretty quickly.\n\nI still talk to my ex now and again, and we're friendly, but I almost never think of her at all. Like, even that she exists. She's just not a factor in anything I do. I ended up finding and marrying someone who is much better for me. We have three kids, a house, pets. Life is good.\n\nDon't focus on the sadness, don't focus on what you miss. Focus on having fun for yourself, and when you think of her, think of all the annoying bits of her for now.",
            "Hi, this might be a long shot in the dark and can potentially be quite triggering since wording is a bit dodgy (I know it was for me) but there's a really interesting podcast on why people cheat and sometimes without any particular reason. It's an episode on Sex Nerd Sandra called cheating, I would recommend listening to this\n\nThis is an unpopular perspective and I am going to suggest it since you described your relationship in a positive way prior to this occasion. It's important to consider especially since you guys have been together for a decade and you were planning on spending the rest of your lives together. \n\nSometimes people just fuck up and make stupid mistakes. There is no doubt she betrayed you. The mistake she made was not communicating her desires with you as they arised and being misled by lust instead. So the red flag here is the lack of open communication .. Why did she not feel safe enough in the relationship to voice her attractions towards this co-worker, what environment do you both create when you discuss potentially hurtful fantasies and scenarios? If you listen to the podcast it will clarify it a little bit better.\n\nI'm terribly afraid of being cheated on and it's easy to demonize those who have and I thought that I would have zero tolerance for it always, but the podcast has cleared up some myths and made me more accepting towards the possibility and less anxious.\n\nMy granparents are the most in love couple/team I know, together from the age of 21 to now in their 70s. They dote on each other, travel & party together. Along their journey they also had to deal with one partner straying. It hurts, but love and compassion softened it\n\nI think now, only time will be able to tell. All is not lost though. Whatever happens, Things will get better \n\n\n\n",
            "First of all, I don't know you. But I just wanna give you a huge right now. I feel for you. I feel the pain that you're currently feeling right now. The pit inside your stomach, the void in your heart, that lump on your throat when you swallow. Surrounded by darkness, you feel helpless, you feel betrayed, you feel like you just want everything to be normal again. Let me tell you right now, it won't be the same again. \n\nPick up a vase, raise it, drop it. It shatters. Of course it's possible to reconstruct it, but it will never be the same again. We will be broken, we will have insecurities, we will have doubts. And this is all because of what has happened to us. But that vase, if rebuilt properly, will always be able to carry flowers, just like before.\n\nThis is an internal struggle we, the *cheatee*, have to go through. I've been in your position, but I guess yours is so much more to endure than mine. I loved this girl and we were together for 6 years. She went to Canada as an exchange student and she never came back. Eventually, I learned that she cheated on me while she was there. No closure.\n\nI was lost. I didn't eat, sleep, work. I couldn't function like a normal human being. I cry every hour, even at work. It was the most painful thing I've ever experienced in my life. I just wanted everything to be right, but, it just takes time.\n\nI love the fact that you have no intentions of getting back with her. It might be the popular saying in this subreddit but \"cheaters will always be cheaters\". They were capable of it before, who says they couldn't do it again?\n\nHere are some things I suggest you to do: \n\n* Remove her from your life. If you live together, get a new place of your own. Somewhere far from where she is. Anything that reminds you of her, get rid of it. Save up for the things you have to replace. **DO NOT STALK HER**\n\n\n* Surround yourself with friends and family. They're the best and they will always be there for you. I cried to my parents when this happened to me and they were always there whenever I needed them.\n\n* Grieve. Cry your heart out. Sing to your favorite songs while tears fall down your face. Blame the world for all its bullshit and hate the fact that shit has happened to you. \n\n* Hate your ex for cheating, hate the guy she had an affair with. Make yourself feel better because right now, we are not concerned about them. We are concerned about you and what makes you happy. \n\n* You will feel lonely. You will miss the intimacy that you had with your ex. It is normal. The feeling of being a single guy will be foreign - but man, learn love yourself. This is the fastest way to recovery. \n\n* Start working out if you don't, you feel amazing. /Subscribe to /r/fitness now. Or do something new, get a hobby.\n\nRecovery will not be easy. It will take time and a little bit of brainwashing. But for me, the most important part of all is forgiving. You forgive not because you want to, but because you need your peace. Forgiveness cannot happen immediately - you cannot force yourself to forgive someone - it will just come naturally. Forgive because you need your peace.  Cherish all the good things that happened in your relationship, re-evaluate everything, and learn from your mistakes if you have any.\n\nClose the chapter of your life with her and start a new one, eventually with someone.\n\nI broke up with my ex April 2012 through e-mail because I needed to have my closure. I worked on myself for 5 months, then I started dating this new girl who was perfect for me. The new girl and I were together for a couple of years until we decided that it wasn't working out... What I'm trying to say is that, there will be people out there man. You just have to stay strong and find the good in life. PM me if you need someone to talk to.",
            "I'm sorry this happened to you. Take time to grieve. Keep up your health. Try to go out and enjoy the sunshine. \n\nThink of it this way: what if she had said yes, married you, have kids, then come clean. She didn't love you enough to refrain from cheating on you. Thank the stars you found out this truth early enough not to have bought a house, have kids, etc.,together. \n\nI'm sorry this happened to you. ",
            "I'm sorry this happened to you. Breakups are brutal, and this one especially so. The advice I'm about to give you is something I've realized after a few painful breakups. I've posted it on reddit before and I feel like it might help.\n\nEveryone is constantly imagining their own future - where they'll live, what they'll be doing, what kind of car they'll drive, who their friends will be, what kind of hobbies they'll have, if they'll own a dog or not, the dog's name, etc. Every slight variation creates a different potential future. An infinite number of potential \"future-yous.\" The longer you're with someone the more of your envisioned potential futures they occupy. In your case, having been with this girl for ten years, she was probably the anchor point in damn near every potential future you envisioned for yourself.\n\nMost of those futures probably involved the job you've got and the city you're in. Some of them might have involved a new career, another round of school, a new city, maybe a new hobby, a pet, an extended road trip, or any one of a million other things - you daydream about a subtly different potential future hundreds of times a day, I'm sure. But there was one consistent thread through all of those futures you envisioned: she was there. \n\nShe would be there to help you move. She would be there to encourage you when your new job got hard. She would take your new dog for walks, she would take a painting class with you, and she would take shifts driving on your road trip.\n\nWhen she cheated on you she took all those \"future yous\" and killed them. They can't exist as you imagined without her, and now you can't envision yourself doing anything at all because no matter what you thought was going to happen to you, you knew she was going to be there. When she left she killed all of your envisioned future-selves and now you don't see any future for yourself at all. It's crushing.\n\nYou're mourning the future you thought you'd have. \n\nSo what you need to do now is start making plans - create new future-selves. It doesn't have to be a grand scheme or a long term plan. Maybe you sign up for a dance class, or a gym membership, or write a short story, or even something as simple as buying a new sweater. These little things will help you see a future for yourself, even one as near-term as waking up tomorrow. It's going to take time to fully repopulate your stock of potential future-yous, but eventually you'll have just as many as you did before the break and you'll find many of them are just as good, if not better, than the ones you envisioned with her. \n\nSorry to tell you man, but it's gonna suck for a while. Rub a little time on it though, and one day you'll wake up and you won't think about her, or you will but it just won't hurt so much. Good luck. ",
            "I'll buck the trend and suggest you both try to work on the relationship. It was obviously good enough you wanted it to be permanent. She obviously loved you enough to not keep lying to you. Too many people throw away something that could be great because of mistakes that can be fixed. We're all flawed, we all make irrational and sometimes devastating mistakes, and we can heal from them and build something better. I know I've been there and come through it. Don't let yourself or the woman you love go through a lifetime of what-could-have-been and guilt and remorse. Take time for yourself. Think about what you want out of life and then talk to her about whether she can honestly provide that and what steps you both can take to get there. ",
            "Well your sister sounds awesome, so you've got that going for you. You will rebuild.",
            "been there.  But my relationship was 3 years engaged for 4 months then I found out she was with her ex boyfriend.  \n\nLike others said be thankful it happened now.  All I can tell you is that you have to be a bit selfish right now.  Only do what you want when you want.  Sounds like you have a great sister though helping you through it.  That will make a difference.  I had my Army buddies....you'll pull through.",
            "No kids?     \nNot married so no lawyers or divorce if you split?    \nYou take the time you need to deal with the suprise and betrayal but hopefully you can use the above points to get back on your feet a little faster",
            "You dodged a tremendous bullet, and honestly it is incredibly fortunate that she had the wherewithal to do the right thing and not hide her wrongdoing from you in that moment. I'm sure the guilt overcame her and she realized how much she'd hurt you by trying to hide it longer, which doesn't in any way excuse her infidelity, but it shows at least that she knew to do the right thing before it was too late. For that, you're lucky.\n\nI'm sure you're absolutely gutted right now, and understandably so. It's going to be hard. There are going to be nights you want to take her back, there are going to be nights you want to murder her, there are going to be nights you wish you'd never met her, there are going to be nights you want to go and fuck every other girl on the planet. But in between those bad nights will be days that get easier, days that start to feel okay. You'll hang out with friends more, you'll pick up a new hobby, you'll find yourself thinking of her less and less, you'll begin to feel like you again. \n\nSure, it won't be a steady uphill climb. You'll have setback days and nights. There will be times you'll feel like you took a step forward and then three steps back. That is natural. It's part of the healing process. What you need to focus on right now is you. Work on making you the best version of yourself. Not for her. Not for the next girl. For you. Be the man that your mother would have been proud of, because she wouldn't want to see her son kept down by the girl who cheated on him. You have the ability to take a horrible heartbreak into the best thing that ever happened to you in the long run. It won't be easy, but it will be worth it. \n\nIf there's ever been a more solid piece of advice for me to give people in your situation, it's been this: one day at a time. Don't give the bad days a lot of weight, don't let the good days make you think you're prematurely out of the woods. If a day goes well, great! Try to keep that positive momentum. If a day goes badly, it's over and done with, now tomorrow is a fresh start. You take that approach every single day and before you know it you'll be in the next great stage of your life and this will be a healed wound that you grew stronger because of. \n\nGood luck OP, all the best.",
            "For the first week I got high and watched Always Sunny in Philadelphia all day to distract from the pain. After that I manned up and moved on. I doubt this helps but we all deal in different ways. Good luck. ",
            "Time to fuck ten hotter women.",
            "\"Nothing helps getting over someone faster than getting under someone else.\"-/u/Mattthescreamer.",
            "Well I'd send her the bill for a ruined holiday, for a start.\n\nI guess it was honest of her in that when it came to the crunch she fessed up - you'd not have known otherwise. So kudos for that. I can only assume she admitted it because she IS really in her own little way committed to you emotionally, Otherwise she'd perhaps not have mentioned it. So it is probably reparable, but IMHO not worth repairing for you: cheaters keep cheating, and it'll break you.",
            "Ask yourself why she did it. If you know, you haven't said. Why something happens makes a difference, IMO. At least you can use this to perhaps learn something from this. \n\nTen years is a long time. I know its humiliating finding out when you propose. Is it possible that you can salvage this thing?",
            "Time will take care of it. Focus on doing things that make you feel good.\n\nIt was better now than ten years from now, married and with kids.",
            "Damn it dude. Hugs for you. You've invested so much time into her that it I can't imagine how bad this hurts. \n\nYou need to know you did the right thing. Let me suggest that you don't close yourself off. Confide in your sis since she had your back if you feel comfortable with it. Bro she had your back. Surround yourself with your closest friends.\n\nAlso please seek counseling. I think it could help a lot with coping with this right now. \n",
            "It is going to take time to heal from this.  \n\nKeep family and friends close.  They are your help in the healing process.  Grief can be a terrible thing, but it will get better.  Block her on social media and your phone.  ",
            "Damn man.  You're in a tough spot for sure.  Having dealt with some heartbreak kind of recently, I can't imagine what you're going through with a relationship/breakup of this magnitude.  In my experience, the only guaranteed thing that will help you heal from this, is time.  I know you just want the pain to end, I can only imagine how unbearable this whole thing feels.  But try to think about it like a broken leg.  It doesn't heal overnight, or in a couple days.  It takes time.  You have to not give up and keep going.  Though unlike a broken leg, a doctor can't just give you medicine to numb the pain.  That's something you have to do on your own.  The best painkillers for heartbreak in my experience are the cliches:  \n\nIf you aren't already, start working out.  Run, lift weights, start playing hockey, whatever.  For me, especially when I'm down, working out is one of those weird things where i REALLY don't want to do it, but then once I do workout, I'm REALLY glad I did it.  Plus, if you keep it up, then you get jacked, which is pretty awesome.\n\nHang out with your friends as much as possible.  Even hang out with ones that will let you complain about the ex over and over.  While it's counterproductive to dwell, healthy venting is a good thing.  But also try to laugh and have fun with them as much as you can.  Personally, I avoid booze in these situations, as it tends to be a guaranteed formula for \"miss my ex\", but in some cases drinking with friends can be great.\n\nDive into your hobbies even more, or add some new ones to your already impressive collection of hobbies.  It's hard to be sad about your ex when you just finished building a muscle car in your garage.  Or finally perfected that martial arts move you've been working on.  Or playing the new Fallout.  Or discovering a new kickass recipe to try in the kitchen.  \n\nTurn up the focus at work.  We all get bored at our jobs sometimes and that's prime think about the ex and get sad and unmotivated time.  So you need to do your best to not let that happen.  Challenge yourself to pick up the pace at work and not only will you avoid thinking about your totally lame ex (who is in fact, totally lame) but you'll also look like an even more badass employee.  \n\nFinally, avoid social media, or at least block/hide she who shall not be named from appearing in any kind of feed or whatever.  Nothing ruins a kickass day than suddenly seeing your ex had a rough day, but is happy she went to Bill's Badass Subs for lunch and oh my god you guys used to go to Bill's all the time and she hates pickles but would always get one on the side because she knew you liked them and OH SHIT YOU'RE SAD NOW.  So yeah, make sure that shit doesn't happen.\n\nIt fucking sucks.  Massively.  It's like a kick to the nuts every 5 minutes.  It feels like it will never end.  And it won't unless you move forward.  That's how you get to the light at the end of the tunnel.  Move forward.  Even if it's an inch or a millimeter at a time, you will make it eventually.  ",
            "It's ok to have those feelings and be sad and hurt and even to cry. Its cathartic to cry and have a physical release of sorts. Let the feelings come but don't let them consume you. You obviously have people in your life that care about you and your well-being, don't push those people away!\n",
            "This is a terrible situation, but on the bright side it sounds like you have an amazing sister. As someone who recently lost their only sibling, don't take your sisters friendship for granted in a time when you need her most.",
            "I got cheated on pretty hard by my ex of a decade. Here's what got me through.\n\nI'm not going to sugarcoat it. You're going to be a fucking mess for a while. I'm a manly man, but I cried like an angry baby. A lot. I still get misty eyed now and then when I think about it. And it's been almost three years.\n\n* Just focus on what needs doing day-to-day and try not to dwell on the pain. In the words of Freddie Mercury \"The show must go on.\"\n\n* Stay off the booze. Booze makes you sloppy and likely to do something stupid. If you do get hammered do it  with people who will keep you in line.\n\n* Hit the gym. Seriously. Your life is going to seem unanchored for a long damned time. Physical activity will wear your body out, help relieve stress, and keep your emotions from overwhelming you.\n\n* Give yourself plenty of time before getting into another relationship.\n\n* It's gonna take time to heal. You're going to be sad, lonely, angry, jittery, paranoid, restless, and about a thousand other emotions all at once.\n\nFinally, remember to take it one day at a time. Trust me, things will get better. ",
            "You might consider talking to a therapist about why she did what she did.  Being betrayed hurts, but getting some understanding about what could be going on in a way that she couldn't help you might make moving on easier.  \n\nYou guys started dating really young, through the period of many people's lives where they form their sexual identities. It's very hard to have a monogamous relationship through this time.  I'm sorry this happened, but I believe her when she says her actions were inexplicable to her.\n\nUnderstanding why she did what she did will also help you to trust again in the future. Good luck.",
            "You need to stir away from her. If she cheated on you now when everything is rosy who knows what would've happened when things became real tough. Like when you were married and had the pressure childcare can add to everything. ",
            "All of Reddit will tell you to dump her, but not me. Look, can you two heal from it and learn to trust again? Ten years and knowing someone from age 12 is way too long to be dating because you've grown so much as people. No one is the same near 30 as they were near 20. I'm more surprised you didn't cheat too - variety is the spice of youth!\n\nIf you two truly love each other, start over. DON'T MARRY but do try dating again. Maybe a new start. See if you like each other as truly honest adults ",
            "OK.  The first step here will be the most emotionally wrenching, but it also has the potential to add the most value to your life in the future.\n\nSit down and write all your feelings down in a letter to yourself (or address it to your mom).  Write down how much you hurt, write down how much you wish your mom was here to help, write down everything you are thinking and feeling.  Be as rambling as you want to be, just include everything.  When my wife cheated on me my letter was 14 pages long.\n\nTake the letter and put it in a safe space where no one will ever find it (I used my safe deposit box).  The reason this letter exists is for months from now, you'll have forgotten what this feels like.  It's human nature not to hold onto negative emotions or it makes us crazy, the side effect of that is that we often make the same bad choices over and over.  Some day in the future you are going to want to get back together with her.  Before you make any choice about any kind of relationship with this girl, you read this letter. \n\nI also found that writing all my feelings down made me feel a lot better.  As if I had a long talk with someone and got all my negitive feelings out.  I still had them, but I felt better for having communicated them, even if it was not going to be read by another human. \n\nSo the letter is step 1.  Step 2 is adjusting your lifestyle to fit a new template.  Find something in your life to change.  For me that was changing apartments.  I then decorated the new place to my tastes alone (the first time I've ever had a space of my own).  I know that might not be the answer for you, but find something concrete that you can change and live with every day.\n\nSince it's easier to make big life changes when things are already disrupted, this is also the time to change eating or exercise habits (if that's a problem for you).  You're building new life patterns anyway, so they might as well be healthy ones. \n\nObviously don't contact your Ex.  You don't have kids of anything so you can go \"no contact\" and it's easy. ",
            "People go through massive changes between 17-27. No relationship SHOULD last throughout those years. You are both completely different people than 10 years ago and likely grew apart in many ways, not to say you didn't still have positives about your relationship, but you were kids and now you're adults and it's time to really understand who you are, and find someone more compatible with this new knowledge.",
            "[removed]",
            "Don't throw away the whole table, try fixing the leg first. \n\nI doubt so many of these guys have been in a relationship that long.\n\nI recently married my SO of 9 1/2 years, and we've seen some shit, man. But none if it was worth throwing away almost 10 years if our lives. ",
            "[removed]",
            "Hey man, that's a tough situation, it's totally okay to cry about it.\nIt'll be a really tough time, and it'll take a lot to get things back to normal. But know you're not alone, there's always random Internet strangers to talk to.\n\nJust keep your head up, and know that you're awesome, always.",
            "You are allowed to grieve. Take the time you need. Surround yourself with loved ones and friends - they will remind you that you have so much more to live for. \n\nGo out with friends, dance, meet people, have a good time. No one says it will be easy, but it does get better. I promise you this. You will find your person, and be so thankful that you had the chance to. As many have said, be glad this happened now rather than later. This gives you a chance to hit the \"reset\" button on your life. So get out there and do just that. Fake it until you make it. Eventually you wake up one morning wondering when you started to feel so good. And then once this happens, a woman will come to you that will give you the love you deserve. ",
            "You said that \"my life revolved around this woman for over a decade\". So now it is time for you to figure out who you are without her. You won't believe this, but in a way, I'm a little jealous. You are going to explore everything in the world because YOU want to do it. You are going to find out what makes you happy. I'm not discounting how awful it is, and sadly we've all been through horrible breakups. But there will be a day, I promise, that you will be happier than you've ever been. Even happier than you think you were with her.",
            "/r/survivinginfidelity",
            "Mate, you're still young and you now have a world of opportunity that's just opened up in front of you. This is gonna hurt for a little while but 6 months from now it isn't gonna feel anywhere near as bad, and a year from now you won't remember what the worst felt like. \n\nJust give it time and know that you genuinely, genuinely have some great times to look forward to meeting new women and experiencing new things with them. \n\nSource: going through a divorce after a ten year relationship, just got back into dating after a year of separation and it's GREAT. ",
            "Dude, Im so sorry this happened to you. Theres only so much people in here can tell you to do in order to move on.\n\nThis may take some time, and it may very well be something you don't TOTALLY get over.\n\nBe strong, be a good man, and hopefully everything will work out in the end. ",
            "I'm sorry this has happened to you but better now than after marriage, right?. I'll just echo the others in saying that staying busy with work, gym, hobbies, friends, and whatever it is that you enjoy will help you move on. This *will* pass. Just take each day as it comes, buddy.\n\nI hope you otherwise enjoyed your time in St.Lucia (My family is from there).\n\n",
            "You have to mourn the loss. Once that is done you WILL be able to move on.\n\nIt has been said by PP's.......the fact is better to know now then later. You have a good basis for what a GOOD relationship should and should not be.\n\nYou deserve someone who wants you. Who loves you. She was none of that. ",
            "I'm really sorry to hear your troubles man, I don't know the pain you're in but maybe my advice could help.\n\nBetter yourself, eat right, work out, get a hobby, and make yourself more open to do things. The past is something we can't change (even if we could we obviously have time travel laws, duh). Try to look at this as an opportunity for a new adventure. Go out and just talk to people, not to sleep with people unless you want to but to get your confidence back up. Maybe you'll meet some new awesome friends and hopefully more.\n\nEverything will get better with a positive attitude. I wish you luck fam. I toast tonight to you.",
            "Well. It's trite but delete her on Facebook and hit the gym to sweat out the hurt. \n\nIt's said a lot because it really does work. But after that, you fill up your time, and you do it by trying to make your life as rich and full as possible. You see friends, you make plans, you go exploring, you maybe learn a new skill or pick up a hobby, you maybe meet someone new and ease into dating, or maybe you give it up for a while... \n\nHopefully you learn that happiness really does come from within and learn to truly enjoy your own company, and learn you'll be perfectly fine single or in a relationship... \n\nAnd maybe, someday, you meet someone who doesn't cheat, is everything you want in a partner in crime, and you are loyal to each other, but know, deep down, you'll be fine if something goes south, and you build a life together without becoming too reliant upon the other always being there, and you're mostly happy. ",
            "I've been through a similar experience. I'm sorry man. I don't really have a whole lot of advice, I just wanted to share my support. What to you say to someone who's had their entire life stop. Just remember to eat. I know it sounds dumb, but it's important. I lost 10-15 pounds after my break-up, just because I was never hungry, so I didn't eat. Set an alarm if you have to. The road ahead is going to be hard. You'll be miserable for awhile, and sad for a long time after that. The good news is, there's hope on the other side. Humans are amazing if for nothing else than their resiliency. You *can* recover. Eventually. I did, even though at the time I thought my life was over, and that I'd never love again. For now, just take some time for yourself. Don't feel like you have to put on a happy face or impress anyone. Give yourself the opportunity to truly grieve for you loss. Recovery can come later. Trying to force it will just make you feel even worse. My thoughts are with you. Take care of yourself. Spend as much time in the company of others as possible. Hug.",
            "At the very least she had the respect to tell you. Things could have been a lot worse, 18 years.... Try your best to move on",
            "Oh, so sorry to hear this. \n\nChumpLady.com..not just for F, also M. Read the posts and stories. Lots of good advice. \n\nStay No Contact (NC) with her. To have carried on this deception for 10 years indicates some deep seated neurosis (IMO). You do not want to invest any more time into this person. \n\nShe needs to be permanently driven out of your life. \n\nStart taking care of yourself even though you don't feel like it. Being betrayed for me was like someone peeling my skin off with no pain killers. I hurt alot. Mine was after a 20+ year marriage, two kids...knowing each other for a total of 30 years. \n\nHis was and is just sex, and 'kibbles' but given all the unsavory things I know now, I want nothing to do with him. \n\nI can honestly say I am proud of my marriage and my behavior. I was true, and in it for the long haul. I have nothing to be ashamed of. \n\nHe has to deal with what he did. Our kids are okay now but were initially destroyed by what their father had done. \n\nSo you don't have kids - Yea! \n\nStrike her from your life and move on. Things will get better. \n\nTherapy can help so you can recognize the signs of this type of personal. Its a narcicist. Lots of good info out there on them. They basically ACT. They don't form intimate relationships because they can't. You need to recognize the different between proximity and intimacy. \n\nBest of luck to you. You deserve the best. Hugs. ",
            "Stay strong dude. Being heartbroken is just another part of life. I remember being in your place once. It took me quite some time to move on but I finally did. I moved on, and get married to the most wonderful woman I have ever met.",
            "Hey man, just know that the downs in life make the ups that much sweeter. I think most adults have been through something like this, although probably not as painful as your experience was.\n\nYou are probably feeling betrayed, and for good reason, because you were. I was once betrayed in a similar way, and felt terrible for about a week. What got me out of my funk was working out. It may not help you, but all the sudden I got addicted to improving myself, maybe because I thought that if I had been better that I wouldn't have been betrayed like I was. But whatever the reason, it did wonders for me.\n\nI began to regain my confidence, and soon the thought of my ex sort of just brought me contempt and disgust, whereas before I just thought she was the most wonderful person but I was really just looking through rose-tinted glasses. I started to become really productive and happy, and came to realize that I must not have actually been that happy while in a relationship.\n\nAbout a year later, I met another girl who I have been with for 3 years now. I know she is a good person and I have complete confidence that she would never betray me like that. I am much happier than I was before and I'm actually really glad that my ex betrayed me like she did or I wouldn't be in the situation I am now.\n\nI hope everything works out for you. I'm sorry you have to experience this, I just hope you will try to put your feelings into something productive for you rather than something negative like overuse of drugs or alcohol. My best advice is to find something productive, that you are good at and enjoy, and put your soul into that for now.",
            "You'll feel like this for awhile, but it will get better.  Best thing you could do is go complete no contact.  Block her, push her completely and totally out of your life.  It will hurt horribly now, but in the long run will help you heal faster.  Hit the gym, get in shape, work on you, spend time with friends and family, and thrive.  Throw yourself into work.  Start small.  Go for a walk around the block.  Force yourself to eat healthy.  Vent to your family.  It will be cathartic and help you heal.  ",
            "Work on yourself. Acknowledge what is your doing, and what us her doing. Don't blame yourself for the actions of others, or vice-versa.",
            "Knew him for 15 years. In a relationship for 7. Then, I found out about his girlfriend of 2 years. While I don't know details, it is highly likely she was not the first or only one.\n\nHow to move forward and where to go from here?\n\nTurn to your family and friends and let them support you. Allow yourself to grieve the relationship you thought you had and the future you thought you were planning. It's okay to feel like a zombie. It's okay to cry. Whatever you're feeling or not feeling is okay right now. \n\nTake some time to focus on you. What you need to process this might be different than someone else.\n\nTry not to stop living your life while you're at it. Get up, get out of the house. Even if you feel like you're just going through the motions right now. I found keeping busy provided much needed distraction.\n\nI do recommend changing your surroundings, even if that just means rearranging the furniture a bit. Personally, I cleaned out all of my closets, donated a bunch of old clothes, and rearranged the bedroom furniture. For me, moving on also meant deleting (or at least quarantining) old photos of us together. For the most part, I sanitized my life of as many reminders as possible of him. That may or may not be the right move for you, so take it for what it is.\n\nFor months afterward, I would face bouts of crying. At first randomly, then when specific reminders popped up, but then not at all. Time will fade the sting if you let it, but don't rush the process, either. I still find myself mentally lecturing him sometimes. What did I say when it happened? What could I say to him? I indulge for a few minutes (it used to be more...), but then make myself drop it. There's nothing left for us to say to each other. \n\nLimiting contact with her is important while you try to figure this all out. You may need to interact with each other in the process of separating out 10 years together, but keep it to a bare minimum. Time also gives perspective if you let it.\n\nI know it probably doesn't feel like it right now, but you can get through this and come out the other side stronger and wiser. ",
            "Hey. \n\nI know nothing anyone can do will immediately stop the pain, which would be pretty damn nice right about now. What happened really, really sucks and I'm so sorry this is happening to you. \n\nSome people have said to focus on you. This is absolutely the right and best answer. Ten years with someone is a long, long time. I'm very sorry for your loss, but this is a good thing. \n\nMourn the loss of your relationship, but also take this as an opportunity to explore you, to discover yourself. Focus on your hobbies, start new ones, go do things your ex hated, make yourself into the best possible version of yourself. \n\nShe'll be even more sorry she lost you when you're a pillar of fun and self empowerment. ",
            "Man. Fuck. Brotherhug for you.\n\nWhen I went through my thing years ago I ran a lot, and walked when I was too sad to run. Hit the gym a lot, too. It was just good to get out and direct that energy somewhere.\n\nOne minute, one hour, and one day at a time. It will get better. It's a process, but you will rise again.",
            "Sorry bro :(\n\nYou are young, give it time, you will heal.  That is all I have, time. ",
            "I'm not going to lie to you man it fucking sucks and it's really fucking hard. Your situation is similar to mine except I have a child with this girl. It has been about a year now and although I don't think about it on a daily basis anymore and can function pretty much normally, I am NOT the same person I used to be. It doesn't help that I still have to see this girl every week.\n\nHowever, you WILL move on. It will take a lot of time and it will fucking suck. I actually went into a mental ward for a week which did help. Try not to lose touch with your friends or hobbies. Get out of the house. Stay busy. And I know this is the hardest part but really try not to think about it and know it's not your fault.\n\nI just want to say also I am a 20 year old so it's not like I'm super experienced, but I've made some stupid decisions in my life already that have held me back and you just can't let them.",
            "Man, i cant even begin to tell you how bad this must hurt.  Just remember and be glad it came.out before you married her.  Please PM me as soon as possible.  ",
            "Brother.  You need to sit through it and process all of it.  It sucks, and it's a hard route, but it's the only one where you come out okay.  Get some Frank Turner albums, put on some headphones, and just limp through this until you're not limping anymore.\n\n",
            "Life flows through horrific beauty and unspeakable pain. This is not the worst way possible you could have been screwed over. You will see that after some time passes. As other posters said, she was honest at least at that point, imagine this coming out after more years, a marriage, maybe when you're really sick later in life. You are free from all that. Take your time to heal- physical, artistic, and mind/body practices are very useful tools for times like these.",
            "You are 22.  This is going to hurt for a while, but you have a whole life ahead of you.\n\nIt *will* be ok.  Eventually.",
            "Get some dating under your belt. It sounds like you have been with this girl for most of your adult life and this was bound to happen. Young people dont seem to understand the gravity of FOREVER. In a few months after you have cleared your thoughts things may be different between the two of you. Maybe not but you will have created some new memories with different people to help ground your emotions. Life is long. Regret not what you have done only what you haven't. ",
            "I'm so sorry this happened to you. I don't know how to help you but I know exactly what you're going through. Time heals all wounds, is something I learned during my difficult time.",
            "I guess I would have other advice if you were only together a few years but you have been together your whole adult life.  Your relationship didn't fall apart slowly where you could see it.\n\nIn your case I think you should seek a professional counselor.\nOn your own and if you two think of getting back together then go to a counselor together.",
            "First, don't beat yourself up for how strongly you are reacting. The person she was to you was ripped away from you just as abruptly as if she'd died, and is gone forever. It's okay to take the time to grieve her. But pay attention to the grieving process and when it's done, be ready to move on and start that process by being glad she was honest and told you before it became much more difficult (and expensive) to separate yourselves from one another.",
            "you don't.",
            "Man I am so sorry you experienced this, you seem like a real genuine person too.  I'd buy you a beer if you were in NY.  It does get better over time, however the unfortunate part is time doesn't speed along when you need it most.  When my SO of 7 years broke up with me, I didn't do jack shit for 3 months.  Hell I even forced myself to sleep during the day so time would pass by.  Fortunately I am glad I didn't resolve to drugs or alcohol so my first and foremost suggestion is please don't succumb to drugs or alcohol.  Yes go out with your friends, have a drink two, get high, whatever, but please don't not fall down the hole of addiction, you're far better than that.  Wish I had a remote that could speed up time, I'd definitely use it for you but in a way sometimes we need to experience this, to truly learn about ourselves and life as it builds our character.  It just hurts when the person you loved most is the one to cause the most pain.  It will get better, you will get through this, we're all here for you. \n\nOn a side note, does anyone else feel like justice should be done to people in similar situations as OP??  Like if there was a secret seal team 6 that went after the cheaters, liars, and betrayers, putting them through waterboarding, whipping, truly punish those that deserve it!  If anyone wants to start a kickstarter campaign for this by all means go for it, I'll throw in $5.  OP NEEDS JUSTICE!!  THIS IS SPARTAAAA ARRRGHH!! ",
            "It feels like you'll never feel better when you're in it, but you will. Though I didn't believe anybody who told me that when I was in it. ",
            "I'd dated my fiancée for nearly eight years when, after I moved across the country for her new job and used a large part of my savings toward a condo, she abruptly broke up with me. The condo didn't have functional plumbing yet (it had been winterized to prevent pipes bursting if it wasn't sold during winter). I was beside myself with sorrow and grief, away from my family and friends. Not a fun chapter of my life. You get there with time. You come to terms with what's happened and how you choose to view this person you once loved, likely still do on some level. It all comes with time.\n\nI'm so sorry.\nPeople are cruel; far more, people are selfish.\n\nWhat helped most for me was volunteering, which forced me to socialize, and largely with the gender that my bitter heart wanted to make itself closed off to. I spent money on  myself, traveled a lot back and forth between my condo and my home town, eventually sold the condo and moved to what I still considered home. Unexpectedly, when I had no interest in dating but had begun to feel more like myself, I met my now-wife at a mutual friend's wedding (her best friend married mine). \n\nThe rest was history. You never know where new doors will open. Focus now upon tidying up your \"house.\" Best of luck to you, my brother. This too shall pass.",
            "You are mourning a profound loss. That means that your brain is trying to make sense of a world without your girlfriend in it.\n\nThis is a PHYSICAL process, the rerouting of neural pathways. It is exhausting.\n\nYou MUST give yourself time to grieve, to heal. You will not be able to just have two days of sadness, and then be all better.\n\nAllow yourself to readjust to this new reality you're living. It WILL take time and energy, but when your brain gets a good start on this rewiring process, you'll feel better, have more energy, be able to make decisions, and begin to enjoy life again.\n\nTL;dr- give yourself time to grieve. It's HARD.",
            "Good luck!! Don't get back with her, you can do better and there people out there who actually deserve your affection.",
            "There are approximately 1 billion females on the planet that are 5 years older or younger than you, so there are plenty of girls to choose from.",
            "I feel ya bro.  Was with a girl for 8 years and when I was getting ready to buy the ring and all, she tells me she's pregnant with this other dude's kid.  Best thing you can do is force yourself to get out and just be social.  Meeting new people will help the old ones fade away.  Well, may not be the best thing but, it worked for me.  ",
            "I found myself in a similar situation two years ago. I have no advice other than to stay strong. \n\nBest on you, man. ",
            "Pretty much the only thing I can count on to get me through a rough period is exercise. \n\nRun until you puke, lift until your arms tremble and use your anger to make you stronger. It will make you mentally tougher and is literally the best anti-depressant in the world.\n\nI have a friend who has been in prison for the last 9 years. When I found out about it I went on a binge drinking spree that could've killed anyone else not from Wisconsin. Lifting, running was the only thing I could do to not feel like shit.\n\nOver time you'll recover, a wound that deep will take some serious time though. Best of luck and use that anger in the gym, it's fuel if you know how to use it right.",
            "Keep your head up maybe being with her this long only left you open for the person you're supposed to meet.",
            "To be honest it's for the best.  You've been with her since you were 17, at that age you barely know yourself let alone someone else.  You haven't been able to go out into the world and find yourself on your own terms, it's always been with the other person.  Tying yourself down that early is emotionally stunting, sure some people make it and have long lasting relationships but waaay waaay more that settle down that young flame out in terrible ways.  Look at this as a chance to really find out who you are, and where you want to go in your life.  Then go find someone to spend that life with",
            "People like to tell their own stories in threads like this in hopes that it will make you feel better, or atleast not alone. You are truly not alone. I'll try to be short with my story: I was turned away from a sold out concert, only after ingesting a ton of \"magic\" mushrooms from a friend thinking we were getting in. (Yes, I went through a phase in college) My buddies and I were forced to come home about 4 hours early and I found my 5-year girlfriend (8+ year friend) on a date with another guy and followed them to his house, while tripping balls. Bad trip/relationship freakout/bad breakup ensued. It truly turned me DARK inside to know someone who loved me would do that to me. For atleast 16-24 months I'd feel the darkness approach, come over me, and recede each day. I can vouch, with every passing week/month it gets a little easier. Your body has coping mechanisms but its up to you to activate them sooner rather than later.\n\nTwo things I learned: One, when you feel \"the darkness\" immediately do physical activity for as long as possible. No, don't binge watch TV/play Xbox/drink/smoke/etc. Make it physically demanding, self help books call it \"grounding\" yourself. Running with loud trance music was my outlet. My goal was to be in physical pain, so I didn't feel my emotional/mental pain. It didn't matter the time of day, weather, etc. I ran. Each month my runs got longer, and by the thick of it I would run and reach a trancelike state, reaching 8-10 miles before stopping. It made me feel at one with myself, my situation,  my environment/city, etc. It also garnered a good bit of attention from the opposite sex. (Granted at this time, I was in college and lived in a college town) This helped the healing process greatly. \n\nSecond, from my experience, don't get back with her: We tried several times to get back together in coming years, only to ruin all my short term relationships and dating prospects... it only brought back all the old feelings. Our last attempt was after nearly 7 years of being apart...it literally took that long for me to even be sexually open with her again. We told ourselves \"we were just kids back then\" and \"I've never loved anyone like you\" Nope... didn't work, I ended up leaving her, and you know what she said as she gathered her things the last day? \"Fuck you anyways, I slept with someone the first few weeks we got back together!\" I just said \"I know\" and a few months later, I had a new girlfriend who is now my wife.",
            " Welcome to depression! You need to move on or it will become apart of you ",
            "Screwed over in the worst way? No, her marrying you, telling you, divorcing you, taking half your shit, and leaving you out to dry... that's the worst way. \n\nYou'll feel better with time. Just do the small things you enjoy doing. Take it easy for a while. Time heals all.",
            "Things aren't going to be OK for a long time. I went through much the same it will probably take you years to get over it and that's normal. First thing is damage control on finances. People often think oh we will end things amicably. I made that mistake it cost me a house and about 12k worth of tools/stuff + my dog and ended in a very nasty way. My ex did things I would have never thought her capable of. So regardless of how much you love her please for your own sake don't make the mistake I did and trust her. \n\n\nIf I could do it over again I would have waited until the ex was out working rounded up some friends and moved out all at once. Don't talk about it just make the decision and go. Change all of your passwords remove her from your finances including any life insurance policies she may currently be the beneficiary of. If you have a house, kids then you can talk about that stuff once she doesn't have your stuff or finances. \n\n\nA good friend recommended that I wait a month for every year I was with my ex before I started dating. Best advice ever, take it. Of course fool that I am I denied I even had any issues and got in a rebound relationship inside of 6 months. Bad idea don't do it it's not fair to the other person. You seem a lot more self aware then I was (you are actually acknowledgeing you aren't ok at this point and even that took me about a year. I'm an emotional dunce) so I doubt you'll probably have an easier time there.\n\n\nWork on your friendships or even build a social life if you don't have one. Focus on working out you'll physically feel better and its good for you+ will take up some of your free time. ",
            ">Anyway, I'm sorry this post is so incoherent. Any tips for someone on how best to move forward and where to go from here? Because I've got nothing, no ideas, no clue. I feel like a zombie.\n\nShit man. \n\nIt's gonna be hard for a while. But you'll get through it. \n\nCreate as much space between the two of you as quickly as possible. If you share a home, she should be the one to move out ultimately, but get out of there in the mean time while she figures her shit out. \n\nYour impulse might be to spend some time alone. You can indulge that for a little while, but distractions in the form of friends and family will be a big help. Get out of the house as much as you can when you feel the slightest bit up to it. \n\n10 years and you were ready to marry her means you will be incredibly confused about your feelings for a while. She obviously feels bad and it's likely she will try and reconnect. There will be opportunities to be intimate with her again. It's easy for me to tell you to cut off all contact and not let this happen; it's another thing when you're hurt and vulnerable to actually follow through. Just know that it won't make things any better, that it will prolong the grieving process. \n\nYou may feel the urge to reach out, send an email about how you feel about her. Write the email. Don't send it. \n\nGood luck buddy. ",
            "Coworker you say? Gee, I wonder what their company policy is regarding this and if HR has any idea...",
            "Whatever you do, don't answer when she calls.  It will be more difficult it the cut isn't clean.",
            "Hey brother. I know in this is hard. But all of this will pass. You should take some time off from work and go away for a while. Go and see another country. If possible drag your best friend with you, go to a bar in a place you have never been & get wasted. \nStaying home is going to make you hate the world. \nAlso don't try to fill the loneliness with other women. I know it's hard,not having a person next to you at night. You need time to heal and right now you need to figure out who you are as an adult. You have been with her for 10years and you probably don't or havnt done stuff that effected both of you. \nDon't drink at home. Drinking only helps if you are drinking with friends. Keep your mind sharp. The sharper your mind is, the father you will get over her. \nIf you need someone to talk to. Send me a pm. \nStay strong. \nAlso go for a drive. ",
            "This happened to me, minus the proposal.  Best advice is to just stay steadfast in your decision to leave her, do not trust that things will get better or that she will change, she won't and it will just shatter your trust in future relationships.  Become closer to your sister and best friend.  The next year is really going to suck.  But it will get better.  Use the time going forward to get in better shape, physically, mentally, and professionally.  Don't jump into another relationship as you'll only continually use this one as a benchmark for what the new one \"should\" be, and that is a recipe for disaster.  The last thing you need is more grief.  Find a female friend who you can do things with, someone who is completely outside of all your other social circles.  You're not going to expect what a blow this will be to your confidence.  You're going to find it difficult to want to experience new things with new people.  But those experiences are the cornerstone to moving forward independently.  You must embrace your newfound independence and relent your codependency to the past.",
            "Reengage and \"reinvent\" yourself. Over 10 years, chances are you became sort of defined by your relationship with her.\n\nYou need to double down on your hobbies, and probably seek out some new ones.\n\nForget her not by trying to ignore her, but by making yourself better and rebuilding yourself.",
            "Go get something off of craigslist for free and destroy it. Go get a free couch and rip that fucker to shreds, get a desk and take a sledge hammer to it. Go take your anger out on something in a fun and safe way instead of turning it inwards.",
            "Nothing helped me. But time moves and heals whether you want it to or not. ",
            "1) GET RID OF EVERYTHING IN YOUR LIFE THAT CAN/WILL REMIND YOU OF HER\n\n2) DON'T RETURN ANY CORRESPONDENCE / BLOCK HER\n\n3) HIT THE GYM, EAT HEALTHY AND DRINK LOTS OF WATER\n\n4) GO OUT WITH YOUR BOYS AND GET PLASTERED, BUT DON'T USE BOOZ AS A CRUTCH\n\n5) GET UNDER SOMEONE ELSE",
            "Damn dude, first of all, let yourself cry. Get it out. You might go thru some grievance and all of that is ok. Don't let your ego get in the way there. Time is the only thing that will make this better, although you will probably find short term relief in booze/cheap women. Eventually you'll be ready to get back on that horse. In the mean time, don't let the short term pain relief become a long term habit. Work on yourself. Read. In fact read the book The Power of Now by Eckhart Tolle, it has helped me a lot. I wish you the best friend. ",
            "Well, to be blunt the first few weeks are going to suck pretty hard. Once you make it over that hump you'll start to see the better things in life. Go out and grab a beer with some old friends and reminiscence on some old memories. Whatever you do; don't seclude yourself from the world. That's bad. \n\nMy now ex gf of 6 years cheated on me while I was on a business trip. We owned a home together so we were pretty serious. It sucks at first, but you realize there's more out there for you. \n\nWe've been broken up for 8 months now, and I just met a great woman that I've been talking too and I couldn't be happier at the moment. \n\nBest of luck. ",
            "It **will** be ok. Yes, you are hurting, and will be hurting tomorrow and the next day, but there will come a time, where you will wake-up and the hurt and anger will have dissipated.\n\nIn the meantime... learn another language, volunteer somewhere; try new things.",
            "Exercise, sleep, and good diet.  That's all I've got but it is important right now.",
            "One thing you should not do is rush into another relationship/engagement to fill the hole this leaves.\n\nI have a buddy who has been doing that for almost 10 years now. He was a couple of weeks from getting married before it broke off. Ever since, he's tried to fast track every relationship he's been involved in so he can get back to where he \"left off\". Obviously as a result, his relationships keep falling apart in short order.",
            "Holt shit.. My girlfriend just broke up with me, and I thought I have it hard..  I'm sorry for you man, I got no idea how to help, but you got my sympathy.",
            "Man, this was tough to read. I had a really sad song about the hurt people can cause playing as I read which didn't help. \n\nDude, getting over loss and breakups in general is really hard. Personally, I found it easiest to let go of a past relationship by unplugging and focusing on myself for awhile. The timeframe is different for everyone. It took me about 4-6 months before I started to feel like myself again. New hobbies, fitness, anything you can do to fill your time with productive activity is great. Let me know if you need some ideas on hobbies! You'll get through this, however hard it may be. ",
            ":( I can't imagine what you're going through... I know I couldn't go on knowing that she wasn't loyal... it would consume me so fucking much. Just keep going dude, the time will come when you're ready to meet a new woman. Try to occupy your time with a bunch of shit like a lot of people are saying here. Go to the gym and show her how stupid she was of betraying you. \n\nWe're all here, man. ",
            "A 6 pack is not going to cut it",
            "Better to get rid of a cheating girlfriend than divorcing a cheating wife.",
            "Hey man, \n\nJust know that everything you are feeling is totally normal...its okay to mourn the loss, cry, get angry etc etc...its no joke when you are the type of person you are....and it turns out your partner has betrayed all that. Its not just a loss of the relationship, the time, the investment etc...its the total loss of faith in a person..and just people in general.\n\nI wish there was something you could do to make the process go faster...but there is little.\n\nYou need to just let this happen...as you will need time to recover from loss and most esp the betrayal.\n\nThere are lots of things you can do...exercise, meditate, be with people who really care about you...and all that will help...eventually.\n\nBut honestly right now..you just need to go through this. Different people process this differently...whatever yours is..do it...be with yourself, be with friends..whatever.\n\nKnow this much...you are not alone, there are other people (men and women) who are like you and would never in their lives do something like what your woman did.\n\nIts not very comforting right now...but in time...it will help.\n\nReally sorry for your loss and for having to experience that type of betrayal with a woman and a relationship you had put so much of yourself into.\n\nYou will wonder if you did something wrong etc...etc...the truth people who do this...well its all about them and on them. We all exp attraction to others and its totally on us what we do with that.\n\nWe, who care, know that we are \"faithful\" not so much because of who your partner is...its because of who \"you\" are. Don't let this change that part of you.\n\nShe was your rock and your everything...now you're going to rediscover that \" you are the rock in your life\".\n\nTreat yourself how you would treat a close friend who went through this.\n\nYou'll get through this...not without scars...but you will get through it.\n\nAgain really sorry...was pretty heart breaking to experience in my own life..so i can really relate...and i wouldn't wish it on anyone.",
            "dude i can't even imagine this and im sure alot of people here are offering you support but know that im thinking of you.  Focus on your career/life right now and build it up.  Become great.",
            "It is true that at least she didn't say yes and you married her. The truth will always come out one way or the other. I wasted 6 years of my life with someone who was cheating on me pretty much from the get go. We had a kid a house and she decided to keep on living the lie. I finally opened my eyes and even though I know it was and still is hard for my kid to understand why his mom and I aren't together its for my own good and his. All that time I could have done a lot of things differently if I had known from the get go so I wouldn't be in the situations I'm in now. As some have mentioned some people won't fully recover from something like that and will in fact never trust again. I'm speaking for myself now, I now don't give a sh*t about jealousy and trust my current partner till proven otherwise. I know if she would ever do something like that to me I would get over it right away due to the fact that I learned how to just turn hurt into positive pain that helps me push threw the bumps in the road of life. OP needs to get out stay single enjoy life and be selfish and treat yourself to the fruits life has to offer till you find the 1 as people say or just a time passer to not feel lonely. Just keep your head up and find a way to turn that hurt that will consume you if you let it into something positive that will help you get stronger mentally. These things aren't easy to get over but as time goes on things get easier. Forgive your ex for she had the balls to tell you before you guys ended up getting married and had children then finding out. She was woman enough to tell you what she did and that says a lot about her. She at least had the heart to tell you OP. ",
            ">She doesn't love the guy, it was just sex and she had been trying to stop the affair \n\nBut does she love you? Oh I'm sorry she couldn't stop banging the guy, the paperwork must've not gone through! Don't fall for this line, please. At any given moment, she had the chance to put an end to it. She has the chance to put an end to it before it led to sex.\n\n>I love her so much but I've no intentions of getting back together\n\nIf this is how you feel, this is great news. It means you love yourself more than you love her, which is totally normal, healthy and already a huge step forward. Many people have to *work* towards reaching this step and you're already there.\n\n>She said she loved me too much to marry me knowing she'd done what she did.\n\nOkay, word of warning? These are dangerous words on her end. What she doesn't love is the guilt she's feeling. She's speaking about loving you despite her actions proving otherwise, do not fall for it. \n\nYou have awesome friends who care about you and a sister who, quite frankly, sounds fucking incredible and amazing. You have a support system. And hey man, it's okay to cry. Cry your eyes out. Get it out. Cry until you feel *pathetic* from crying. Don't bottle it in, don't hold it back, don't try to fight it - all of your feelings are valid and justified.\n\nIt will be hard to trust again, yes. This much is true. But it's not impossible and it doesn't have to be any time soon. Give yourself as much time as you possibly need, it's not a competition.\n\n\n*edit* If you choose to forgive her, I completely understand and wish you the best of luck. But seriously, do not buy any of the BS she's trying to sell you about how she was \"going to\" end it.  Going-to, Should've, Would've and Could've are to no longer be words you can accept from her if you plan on working it out. She had an affair, own it and get over it.",
            "I'm sorry to hear this. It does get better. Just concentrate on yourself - doing things you enjoy, that make you happy. You forget sometimes how much you sacrifice to be in a relationship. Especially with a shitty person.\n",
            "I had a similar experience, although not as long term as yours. I dated a girl for 3 years during and after university. Our families totally thought we were getting married. She fooled around on me and it totally crushed me. For a long time. But it made me more selfish in relationships, which was a good thing for me. It made me less naive about relationships as well. And in the end, I met someone even better, who I did marry and makes me so happy that I am thankful everyday that I'm her husband. So, yeah it's going to be painful as fuck for a while. But you move forward and live your life for you now. And you will totally meet other people that you will have great relationships with. \n\nAnd as others have pointed out, be thankful you found out before you were actually married. ",
            "I'm happy you have a good sister and friend to help you through this! ",
            "Go for a walk.  No, seriously.  See what parks/wilderness is near you and go for a walk somewhere you've never been before.  The exercise will do you some good, the visuals of a new locale will be stimulating, and the trail/course/whatever will present you with a distraction by forcing you to make small decisions (left or right? etc.).  Find new places to walk everyday.  Go places you've never been before and open yourself up to new possibilities.  But no matter what, the worst thing you can do is to stay home feeling sorry for yourself.  You WILL make it through this.  Try to remember that you're worthy or being loved.  (It sounds silly, but it helped me to say that out loud every morning until I started to believe it.)  Good luck, OP.",
            "Dude, I know you probably won't read this but I'm in a very similar situation right now. It's hard to describe to people just exactly what it feels like. I might not be able to help but I know misery loves company so if you ever need to talk just send me a message. \n\nIf nothing else, I understand what you're feeling because I have the same emptiness inside, the same \"haze\" in my head that makes you feel like a zombie. \n\nWe'll get through it though. ",
            "that black hole in your gut is natural. You close it by hanging out with your friends, getting out and doing things, and taking a brutally honest look at what you do next. It might help if you write about what you value and where you want life to go from here.",
            "It absolutely sucks.  You will have to rediscover yourself.  But at the end of the day you have been (unfortunately) fortunate to learn who she is before a marriage, and before children.  Your grieving process is allowed to be mental and not burdened with a legal process, and child support, and paternity tests and all sorts of other BS.\n\nThat said, it doesn't matter to you.  Your reality is your reality regardless of how other people's may be different.  Take care of the physical crap as soon as you can.  Move stuff out, move out, move her out, divide joint property, whatever you need to do.  That doesn't need to hang over your head.  You have been given an opportunity to re-invent yourself and your life if you so choose.  You also get to exit as the good guy.  Be careful of your actions and reactions.  Don't allow yourself to be anything other than the winner of this garbage.  Through no contact, and no antagonizing you will be able to reflect on this and be proud of yourself and your actions.  Think cArefully about anything that may compromise that.  You don't deserve to have guilt over a shitty partner.  Don't give yourself a reason.  Good luck.  You are unfortunately not alone.",
            "Well the good news is you are only 27 so you have you whole life ahead of you and plenty of time to find the right woman to spend the rest of you days with.  \n\nAt this point you are going to have to think of your ex as someone you had fun with but who ultimatly showed you she was not a good person.  Honestly who knows what she did during your years together.  You will never know, but you do know know she is capable of lying to your face for months.  \n\nYou are going to be sad and it will be hard for a while, you need to treat this as a death, because it really is one in a way.  A death of your innocents and a death of a relationship.  So morn for now but have hope you have your whole life ahead of you.  \n\nSpeaking as someone with experience, I know it doesn't feel like it but It will get better, you will feel like yourself again.  You will be able to look on this and not feel the intense pain you do now.  You will mostly just feel sorry for her.",
            "You were in love with who you thought she was. If she's seeing him for sex then you now know who she is.\n\nJoin a gym work out to clear your head and tire yourself out.\n\nGo completely dark on her and block everything. Phone, FB, etc.\n\nIt'll help you to move on faster. But you dodge a huge bullet here so be thankfull",
            "I'm really sorry to hear this... You probably won't even see this comment but just know that you were faithful and you were a good person. It's not your fault. Go seek counseling help if you need someone unbiased to talk to... I'm sorry..",
            "10 years to find out she really doesn't love you.",
            ">I cried my eyes out in the shower last night. I never cry, not even when my mom who I was extremely close to passed away, but I was sobbing like a child last night and honestly I would have loved if my mom had been there to tell me it'd be okay.\n\nCry it out for a bit. \nYou feel better for a little bit, anyway. \nYou got hit a lot harder than me and I'm still not over my thing, so I don't know what to say, but I get how you feel, a little bit. \n\nEat. Maintain yourself, or go through the motions. \nIf this had happened to your sister (or a little brother, if it makes it easier to imagine), what would you want them to do? Do that.\n\nTalk to the people in your life. Your sister and your best friend are there for you if you need them. Us random strangers online will hear you, out, talk to you. Whatever you need.",
            "So much depressed waiting... time heals all wounds. ",
            "something similar happened to me.    Your in the beginning stages of grief.  I lost my appetite for about 3 weeks,  lost at least ten pounds.   Eventually the anger will kick in, don't give into it.  Take those negative emotions and channel them into something constructive.   I started running and going to the gym, that combined with the lack of eating and I was quickly in amazing shape. ( this helps with your self esteem when your ready to start dating again. Exercise like running/swimming is amazing because you're moving around expending energy yet you get to zone out, and it gets you out of the house. \n\nWrite any feelings or anything you want to say to her.  The goal is to release what ever thoughts are trapped in your mind.   You can burn/delete the letters later you don't ever have to show them to her or anybody else.  which brings me to the next point.  \n\nNo contact... You will probably be lonely: but seeing her/ talking to her will not make you feel better.  You might start to rationalize and want to get back together with her.  Don't confuse forgiving her with being able to trust her and having a positive future with her.  Just stay away,   At this point you are still under her spell chemically, pheromones are real.   You are basically physically addicted her, the scent, the sound, the touch.  You need to quit cold turkey if you want to be able to move on.   get rid of anything that has her on it.   toss out/donate your bedding and get new stuff.  clean your place from top to bottom, throw out any photo's, delete pictures, get rid of it all.  You don't want that stuff lying around where you can see it and start to reminisce and remember all the fun times.  \n\nHang out with your friends, reconnect go out and have fun. They will have questions but don't trash talk her.  Just stick to the facts and keep it short.  \n\nYou need to adjust to taking care of yourself, there is no US any more.  Dont worry about her, or how she is doing.  You need to take care of yourself first and foremost. \n\nReflect, what can you learn from this?  How can you choose a better partner next time, and be better and spotting the BS earlier? \n\nHang out with other women platonically.   It will take time to truly move on and be ready to love/trust again,   probably around a month per year you were together.  Don't turn into a douche to all women, only that one hurt you.   Don't take your anger out on innocent bystanders.    \n\nPM me if you want to hear any more suggestions.         ",
            "Hard to admit but I've been the girl in that situation ( although not for that length of time & proposal ). Trust me ; it'll haunt her. Even if she changes / figures some tough stuff out about herself, she'll never have closure on something like that. However much it sucks now , you'll be in the greater position to walk away & essentially start over with a happy life knowing you did your best. I'm so sorry this happened to you! ",
            "How do you move on? \n\nYou do it one step at a time. And you allow yourself to feel the pain, learn to process that pain, and then as it slowly lessens, and fades, you move on with your life.\n\nAt least she had the decency to admit cheating so you could have the closure and move on.",
            "> She said she loved me too much to marry me knowing she'd done what she did.\n\nRead: She doesn't want to marry you and hasn't wanted to for a long time now.",
            "Honestly brother you should be praising the heavens/universe/whatever you believe in that this happened now and not after marriage; imagine how you feel now but amplified and dragging on. It's tough no one likes to feel betrayed but believe me you will one day look back on this and say thank God this happened before it got \"serious\". ",
            ">and she said she loves me so much, more than I'll ever understand\n\nNew rule: don't tell someone that you love them while admitting to cheating on them.\n\n",
            "Regardless of what you do, do yourself a favor and start eating. A few years ago when I went through a break up with my fiance I basically stopped eating too. I ended up in the hospital and had to have my gall bladder removed. They said that rapid weight loss can cause these kind of problems. I had lost about 30 pounds in a few weeks. It's been years since then and I still have digestive problems. Do yourself a favor and eat something, anything that you feel you can stomach even if it's just crackers. Don't cause permanent damage to your body by not eating.",
            "\"I love her so much but I've no intentions of getting back together\". Good for you! So glad to see a man with some balls on this subreddit.\n\nAs for healing, it just takes time. Go to the gym, do things that you did not do together to get your mind off her.\n\nGood luck - I feel for you.",
            "> he didn't want to marry me because she'd been sleeping with the co worker she said was 'just a friend' for around 3 months.\n\n\"JUST a friend\" prevails again. Honestly that's like the #1 tell that they are full of shit.\n\nMy man, you don't feel like it now but that was a really lucky day for you. I can also empathise, it's crazy situation you found yourself in - laying your entire future on the line, anticipating it to go ahead, and bam.\n\nThere's heaps of resources here on how to move on. The typical - gym, hobbies, new experiences - comes to mind and is proven to work. I'm sure you don't feel like going out now - post on here, with people (can message me if you want), other internet randoms. It'll help, but don't wallow here for too long, push yourself out.\n\nIt'll also take time, ten years is no small thing. Best of luck.",
            "The loss of a life is mourning for all the past time.\n\nThe loss of a long relationship is mourning for all the past times AND the future that will never be.\n\n\nIt's tough, it's just going to take a lot of time...  I know that sucks to hear, but it's the truth.  Rest assured though that it will get better.  Focus on yourself, your goals, your new freedom to be you in an uninhibited way.",
            "Talk to her.  \n  \nYou don't have to take her back, but you can if you want to. Affairs happen, but they don't always break the relationship. She chose to have an affair: that was her choice, but it's your choice what to do about it.  \n  \nEither way, talk to her. It will help you deal with this. If, at the end, you choose to stay broken up, that's fine, but trying to hold all this inside will burn for a long time.",
            "[deleted]",
            "Do you think the loss of your mother could be contributing to your pain over this loss? You say you were very close to her, but you didn't cry when she passed. No judgement, at all, we all grieve differently. Now, though, another woman you are very close to has been lost to you. I have no doubt the end of this relationship in itself is life-altering, and devastating. What if, though, your pain is heightened because you're grieving both losses simultaneously on some level? One compounding the other. That's a more difficult, more complicated pain. If you find yourself struggling to move on from the relationship, maybe it's not your grief over it alone that you need to address. Just food for thought for the future. Take care of yourself. Good luck. ",
            "Been there brother. Married her after six years. Married first by justice of the peace, then a wedding six months later in a church. A month before the wedding she started acting weird but didn't explain what was actually happening. On the honeymoon she told me that she met a guy a month before the wedding but she didn't want to be the one to call it off. That was a year and a half ago, things are still tough, but recovery is steady. I'm still confused, I know what I have to do, but my concious can't outcompete my subconscious. Don't give up bud good times are ahead.",
            "> She didn't want to marry me because she'd been sleeping with the co worker she said was 'just a friend' for around 3 months.\n\n>She said she rationalized it was just a thing that would pass but it's continued and she said she loves me so much, more than I'll ever understand, that I've helped her so much and she doesn't even know why she has done this. She said she loved me too much to marry me knowing she'd done what she did.\n\n> She doesn't love the guy, it was just sex and she had been trying to stop the affair but I proposed before that happened and she said she knew when I was kneeling that she couldn't marry me, not after everything I'd done for her, so she told me.\n\nUgh, just ugh.\n\nShe confessed because you put her on the spot. It's not just sex with the other guy. She thinks she has a shot with him and if she gets engaged to you it may scare the other guy off.\n\nHell, for all you know, she's told this other guy that she's single. She'd have to come up with a compelling story for why she suddenly had an engagement ring.\n\nLong story short, this is a positive for you. Point blank, you're better off. She outed the affair and now she's out of your life.\n\n.... for now. That's the problem, she's out of your life *for now*.\n\nLook for her to come sniffing around in six to eight months, once the new relationship shine wears off with her co-worker. It may even happen sooner if she tries to get the other guy to commit and he bails on her.\n\nStay strong. Stay positive, and make sure you cut **all** contact with her. If she shows up again in the next few years, it's because she's looking for her responsible, trustworthy chump to keep life stable for her until she finds her next Romeo.",
            "Your sister sounds like a great person, she have plans this Friday?",
            "Caution: I see some of you giving kudos to this tramp for fessing up. \n\nGoogle 'the pick me dance', a brilliant piece of mind fuckery where the cheater gets the 'chump' to up their game for more gifts, dinners, attention etc. \n\nCheaters are cancer. Cut them out, do the life chemo and move on Thankful you  dodged a bullet.",
            ">She said she loved me too much to marry me knowing she'd done what she did.\n\nThis is not true.\n\nShe doesn't love you anymore, and wants to continue with the other person.\n\nThis really sucks, man. Sorry you're going through this. If it helps, I experienced the same thing almost exactly a year ago. It gets better, but I won't lie, it will feel like there's a hole in your life for a long time.",
            "ten years?? I would have left her ass there immediately after she explained the cheating. ",
            "find out about this guy. Expose him\n",
            "Yeah, this is going to be condescending...  Did you guys talk about spending the rest of your lives together before you proposed and were you on the same page?\n\nAs mentioned here and elsewhere, a couple wanting to get married shouldn't be a surprise to either party.  The act of asking can be as much of a surprise as you'd like.",
            "Probably feels pretty rough, I'm sorry for that aspect man. But the reality is you dodged a huge bullet, marriage nowadays is a slavery contract for men. It also appears like you're the exact kind of guy that would get exploited since you a) got cheated on and b) didn't notice you were being cheated on. Move on, with the realization that you're now way better off and can learn from your mistake in the future. ",
            "I know I'll get shit for this but I'd Marry her any way. ",
            "Go to Vegas.  They sell coke at the strip clubs.  I went recently and was blown away (pun intended ) by how the strip clubs are way different than everywhere else.  The girls don't dance on poles..  they pretty much dance on your pole.  It's crazy.  You walk in and the next thing you know you have 2 girls on your lap and 2 pairs of tits in you face.  Made me forget about my wife REAL quick.  \n\nBest of luck!",
            "The act of infidelity is separate from the love you share. She's not lying when she says she loves you beyond comprehension. You're not weak if you forgive her.",
            "[deleted]",
            "I'd say ask r/sex & r/polyamory for their perspectives. Because most people here will just say \"break up\". When in actuality, she's human and just like you she's going through this life not really knowing up from down or left from right. Not saying what she did is excusable, but just think about it, you know? That's your best friend and she fucked up big time once in 10 years? Do you really want to lose your best friend over something that could be worked out if you guys had an honest conversation with each other? \n\nI do suggest that during this time, you take your own space to get your emotions sorted out and think things over and allow her the same and then you guys can come back and talk it out. I say just go on break for right now.",
            "tell her thank you, forgive her if she apologize (if you want) and move on.  I'm just rationalizing right now, but she saved you a lot of heartache in the future.      \nYou'll find someone out there who is a right fit for you and who will treasure you as you will treasure her.",
            "Do not seek the comfort of the relationship again.\n\nYou would regret marrying a woman that you spent ten years caring for only to find out that the violated the relationship by letting some dude from work hit it (multiple times).\n\nMove on.  Time will heal this breakup.",
            "There's no doubt that this sucks, but here's what you do... Celebrate! \n\nYou found out she was an asshole before you were married and built even more of a life with her. You can't change the past so don't dwell on it. Get out there and do whatever it is you want to do with someone new or with no one at all. Find your own happiness and make your life great. ",
            "hey man, this shit happens. You were with this girl since you were 12, so 10 years later you are both 22ish and you want to get married? If this girl is at all attractive these are her most prime hookup years. If she has been with only one guy than no shit she is tempted to explore. You cant expect a young girl to stay loyal during these years. That shit is delusional. \n\nSorry this happened to you. You have month and months of recovery ahead of you. But the good news is that if you are committed to actually getting over her, you will :) I mean it would be ludicrous to allow one girls to completely ruin your life. wouldn't it? You're a strong adult man, you will deal with it and move forward!\n\nThis should be a very valuable lesson for you mate. And if you learn from it it will make you a much more mature and strong man. Young girls who are attractive WILL cheat. Generally speaking it's very smart not to get too attached to them. Wait until they're in their late 20s or early 30s. That's when they want to settle down.\n\nI bet i'll get downvoted for this, but this is the god's honest truth.\n\nBONUS TIP: break all contact with her. delete her from everything. EVERYTHING. erase her from your existence. trust me here bro. And most of all, completely ignore her if she ever comes crawling back. Because she might, and you dont take back damaged goods. \n\nSOURCE: I am a 30 year old man who has been through this shit. take my advice bro. spare yourself the anguish.",
            "Dude you didn't cry when your mom passed away? That's seriously fucked up dude, especially since you will cry like a baby over a girl who cheats on you but *not you're own mom*? \n\nYou need to do some soul searching on your own and find out what makes you so emotionally distant and unavailable. Everyone should cry when their mom dies, I can't imagine what kind of ice demon you must be when it comes to emotion. ",
            "[removed]",
            "Try breaking something valuable of hers.",
            "Take painkillers like Tylenol. It helps. Seriously. ",
            "I don't know OP.  It's awful when someone just \"ghosts\" on you.  It's happened to me 3 times now.  What the hell am I doing wrong?",
            "Is she from St Lucia ",
            "[deleted]"
        ]
    }
]