[
    {
        "post_id": "abayxw",
        "author": "AggressiveImpact7",
        "title": "Husband and I are having our longest fight ever and I don't know what to do",
        "url": "https://www.reddit.com/r/relationships/comments/abayxw/husband_and_i_are_having_our_longest_fight_ever/",
        "score": 5888,
        "num_comments": 842,
        "created_utc": 1546288478.0,
        "selftext": "tl;dr My husband and I got into an argument and he left for almost 2 days.\n\nHusband is 36m, I'm 29 f. We've been together for over a decade. We have a 7 month old daughter.\n\nIn the past, we have normally resolved arguments by taking a few hours to cool off and discussing. However, this situation is different and I don't know what to do.\n\nWe flew back from his parent's house the day before yesterday. While we were picking up the bags, I leaned over and whispered to him that it's sexy to watch him lift the bags off the conveyor belt. Our daughter was asleep in the stroller when this happened, and I whispered quietly so she wouldn't have heard me even if she were awake. He snapped at me really loudly and said \"do NOT say those things in front of MY child.\" It was loud enough that people were staring and I was really embarrassed.\n\nThen we got home and I put the baby to bed and then he tried to initiate sex with me. I told him I wasn't in the mood after what happened at the airport, and he lost it and said I shouldn't put sex in his head by calling him sexy and then not have sex with him. I told him I would've be up for sex had he not snapped at me! He turned and left our house and I haven't seen him in almost two days. I tried calling him and just got a text back that said he wants space to cool off so he \"doesn't do something he'll regret.\" I told him to come home NOW as I've been alone with the baby for 2 days and it's New Years but he won't.\n\nShould I give him space or give him an ultimatum?\n\nEdit: Thank you all for the comments. A lot has happened since I posted this and the situation is being resolved. I'll post an update when I can. Happy and healthy new year to you all.",
        "permalink": "/r/relationships/comments/abayxw/husband_and_i_are_having_our_longest_fight_ever/",
        "comments": [
            "I'm sorry you're going through that. It seems like there's something going on that's deeper than what's being explained in the story. How he reacted was extremely inappropriate. Has he ever blown his cool like that before in public?",
            ">While we were picking up the bags, I leaned over and whispered to him that it's sexy to watch him lift the bags off the conveyor belt. Our daughter was asleep in the stroller when this happened, and I whispered quietly so she wouldn't have heard me even if she were awake. He snapped at me really loudly and said \"do NOT say those things in front of MY child.\"\n\n...she's seven months old. Is he aware she has absolutely no idea what either of you are even saying at this point, even if she HAD been awake?\n\n>He turned and left our house and I haven't seen him in almost two days. \n\nwtf? is he always volatile like this? this is fucked up, would he go to counseling?",
            "He thinks \"his\" 7mo child can understand what you said? Or that calling your husband sexy is somehow wrong even if you said it in front of YOUR (plural) 16-year-old child? \n\nAnd leaving for two days? Something major is up. This is COMPLETELY out of line of him. Can someone come and stay with you and the baby? (**Weird the baby hasn't been HIS for the last two days.**) Do you have a car of your own and access to money? That line about \"something I'd regret\" is chilling. ",
            "If this behavior is really out of the ordinary, I'd be scared. I'd be calling friends, family,  etc. to find out if he's staying with them. Then I'd be getting my affairs in order. If he's still gone by Wednesday with no communication with you or other friends/family I'd be calling him in as missing. Call in backup to help you with your baby. Even if he comes back, something is clearly not right. I'd proceed with caution. I don't think it's unreasonable to require counseling upon his return. ",
            "Wow, that's super out of line to leave your wife and infant daughter for two days to \"cool down.\"  Time for that kind of teen-aged drama and antics has come and gone.\n\nHave you asked him how long he plans on being gone?  Did he elaborate on what it is he may do that he might regret?  Has he indicated anything that might lead him to have this kind of a childish and irresponsible reaction (leaving your wife and infant for two days with no contact is very irresponsible)?\n\nMaybe because of my age and disposition in life, but I would tell him that at this point, before coming back he needs to answer these questions.  I'd personally want answers to those before letting anyone who had that kind of outburst around my child again.  Does \"doing something he might regret\" include violence or other abusive behaviors?  Cuz that sure seems like the implication?\n\nThat \"do something I might regret\" comment and angrily storming off for two days is not exactly the behavior of a mentally stable person.  Is he going through something he hasn't shared with you that he may need help with before being around you two again?",
            "“Something he’ll regret”? That sounds like a threat. Why on earth is he threatening his wife and the mother of his baby? Something is very wrong. ",
            "If I left my wife and one year old by themselves for two days over something like this she'd tell me to not bother coming back. ",
            "Could he be seeing someone else on the side? He’s been distant, went a long time without sex after you gave birth. He picked a fight after being away with you. If he wanted to see his side chick, blowing up at you over absolutely nothing (you were playfully flirting, his blowup was absolutely absurd) then storming off for a few days gives him the opportunity to see her. Just a thought, ",
            "Gotta ask the question, do your in laws approve of you? Have they been whispering poison in his ear on your trip there? Is your husband usually tense and snappish after interacting with his folks?",
            "Physically where is he?  Where did he sleep?\n\nIs there someone else or did something go wrong at the visit?",
            "I have been known to leave the house to cool down when I'm super-duper pissed off with my husband.  And that's like, four hours, tops.  I go out, I get a meal, read through a magazine or a book if my Kindle was in my bag, or I just walk around to let activity help me get under control.\n\nKnow what it take to get me there?  My husband seriously, super-duper fucking up.  Like something that's going to cost us thousands of dollars or he did/said something really insensitive and hurtful.  Not a silly whispered sexy comment in public, and then a refusal of sex.\n\n2 days is NOT cooling-down from intense anger.  2 days is he wants an escape from his life.  Either nothing shady is going on and he was just stressed out after the holidays for some reason (did something go down with his parents?), or as someone else posited, he has someone else.  So either he's got an inappropriate way of dealing with stress or he's getting ready to pack his bags.",
            "Badly executed excuse to see the other woman for new year? I hope this isn't the case OP. He sounds immature either way. ",
            "Two days? And that \"something he'll regret\" line? It is a counseling or divorce scenario because this is not something that should be how you function as a family. Better to find out now if he's able to be mature enough to recognize that this is a problem that needs solving before you're five years down the line & he's going out for a pack of cigarettes forever. ",
            "[deleted]",
            "[deleted]",
            "I have a strong feeling this relationship is abusive, and you don't have any frame of reference for a healthy relationship because you've been with him since you were a teenager. \n\nYou say he's never snapped at you in public. Well, has he done it privately? Is it like him to just leave and give the silent treatment? Has he made threats before, because that text sure read like one. Do you have any decision making ability in the relationship? Do you have a job? Friends you hang out without him once in a while? Does he typically help with the baby? \n\nMaybe you should take some online quizzes and read some resources about unhealthy relarionships, and see if anything rings true. If it does, individual counseling for you may be more helpful than couples counseling for now. Someone can help you establish how healthy your relationship is and what to do for yourself and your child if it's not. ",
            "Something else is happening here,  I would not be eager for him to come home.  Counseling would be mandatory. Sleeping separately until you know where he was and with whom as well.  If you and your child can go somewhere do so. Let him sweat it out. ",
            "This cannot be the first time you’ve witnessed something erratic (at minimum) on his part. \n\nAnd if it is, then yes, I agree that this is the tipping point and for a lifetime of THIS type of behavior. And/Or he picked a fight to get out of the house. \n\nIt escalated so bizarrely that I’d bet he’s cheating. I’ve seen this type of behavior before. \n\nI wouldn’t do anything at this point actually. I’d sit back, shut my mouth, and wait and see. No more calling. No more begging. No more ARGUING either. \n\nWait and see. \n\nHe’s either going to return and attempt to “return” to normal - at which point you’ll be able to have the divorce or counseling conversation. Or he’s going to never return, over something so petty that was technically his fault, that you’ll ALSO get your answer. \n\nOr the truth that’s being done in the dark is going to come to light. Again giving you instant clarity on what to “do”.\n\nWait and see. Because something is gonna pop soon I’d say. ",
            ">I tried calling him and just got a text back that said he wants space to cool off so he \"doesn't do something he'll regret.\"\n\nWhat EXACTLY is he alluding to???? Is he threatening violence to you???",
            "Have you checked his credit card and or debit card records? If you haven't, I would STRONGLY suggest that you go online and check what he has been spending and where he has been spending it. Look at his cell phone records to see who he has been calling/texting and how often. Take screenshots of all of the balances in all of your checking, savings, and investment accounts. It's possible that he's having a breakdown of some kind, but it's much more likely that he's cheating and getting ready for a breakup. Make sure you cover your bases to protect yourself and your child. You may also want to make a quick phone call to an attorney as soon as you can reach one.",
            "He just provoked a fight with you to give himself an excuse to vanish right before New Year's Eve. I'm sorry, but I think he's got a secret.",
            "Tell him to grow the fuck up. You shouldn't be having to deal with two babies. ",
            "stop calling him and start figuring out how on earth he could justify or whatever enough for you to actually let his sad behind live with you again.\n\nhe publicly humiliated you and then thought initiating sex was going to go over well?\n\nand then acted like you OWED him?\n\nand how he's just gone...for two days. no word, no nothing, just a thinly veiled threat that you'll regret further trying to contact *your own husband*...\n\nplease please please - tell me you're going to go hook yourself up with a counsellor *for yourself*, if nothing else. \n\nultimatums are risky bc you have to be completely prepared for it to not go the way you would hope it to and still go about your life even in the crap scenario you set out.\n\nme? i'd be inclined to give him space. like, a whooooooooooole lotta space. like, naw, you can talk to my divorce attorney level of space.",
            "He's abandoned you and your child for 2 days? I'd definitely be preparing for divorce, especially considering how it all went down. None of his behavior here is acceptable in any way.\n\n&#x200B;\n\nTry to find out what's really going on here, of course, but still be prepared for anything.",
            "If that was totally unlike him then you should get counseling right away. There is something serious running undercover in his head right now, you don't know what. An unusual stressor, something he won't or can't tell you, who knows. It could even be something medical.\n\nBy not letting you contact him he's also not thinking about \"his\" child. What would happen in an emergency? Can you at least make a pact to let each other know where you are? If he won't, then that says a lot.  Good luck to you.  \n\n",
            "He exploded at the first viable excuse to fight with you.\nHe has something on the side.",
            "Unfortunately like many of the other responses I believe your husband is cheating. What leads me to believe this is his language at the airport. “His child”. He has already made a separation in his mind between the two of you as if he is planning on leaving. When people separate and share custody of a child they get possessive. “My kid, my baby...”  His threat to me sounds like he is threatening to leave you. \n\nBased on my knowledge of cheating husbands mine also did the “I am very busy at work...I have to stay late...I am very stressed”. He also distanced himself from the relationship. I believed every word of it because I had no reason not to. I would be VERY concerned right now where in the hell he is. I can almost guarantee is with the person he is cheating on you with. \n\n",
            "Ah yes, the good old “never let our child know we actually like each other, it will scar them for life” 🙄",
            "He's either cheated, or just starting to cheat. No man I know would get upset at his wife for calling him sexy, and adding in you shouldn't talk like that in front of HIS child? Sounds like he's already lining up the 50% of what's his. I mean seriously, the kid is 7 months old does he think she's getting a visual of him being sexy? He's stressed, mad, and the only thing that could make it work was him disappearing for 2 days, something he's never done. Pressure from another woman to be with her for the holidays would make sense, it also would tell me she doesn't know exactly what's going on either. Text, call, message him on Facebook whatever, but tell him his ass better be home in 24 hrs or locks will be changed  stuff would be moved to storage or thrown out, and a petition of abandonment will be filed with  her courts. He's hiding something big, and you need to find out what it is... Fast. And be ready for your marriage to be over suddenly. Good luck. ",
            "“Doesn’t do something he’ll regret ” <- this is scary and he’s trying to threaten you into silence, this is beyond unacceptable behaviour. I think you need to think about what your future holds with a man like him and start thinking of all possible scenarios, please pick the one in which you and your child are safe and happy.",
            "Since having your baby have you had sex?\n\nWere there other marital problems other than this ——and by any chance is he worried about having another baby\n\nHim leaving you for 2 days is totally not acceptable and before he moves back in there needs to be some answers.  ",
            ">  He turned and left our house and I haven't seen him in almost two days. I tried calling him and just got a text back that said he wants space to cool off so he \"doesn't do something he'll regret.\"\n\nLet's ignore his ridiculous behavior at the airport and lack of apology, because it doesn't matter at this point.  THIS is the problem.  You had a disagreement, and he straight up disappeared.  For two days (so far).  You have no idea where he is, what he's doing, or when he'll be back, and he won't say.  He straight up abandoned you with a 7 month old for two days during the holidays.\n\nHell yes it's ultimatum time.  People need to be able to depend on their partner.  Honestly your disagreement is pretty minor, and he's acting like a spoiled child.  Worse, because a spoiled child is unlikely to disappear for two days.  If this is how he's going to act when you have a minor disagreement, it means that you honestly can't depend on him for ANYTHING when times are tough.  He'll just bail again.",
            "Does he have a history of drug use? Like do you think he's on a bender right now? Who do you think he would be staying with?",
            "He picked a fight and blamed you.  He did this because he needed an excuse to be away from you for a few days, and he needed you to be painted as the bad guy so that you're upset about that smokescreen instead of understanding that, in the days leading up to this fight, he made plans to be with someone else - and that's exactly where he is right now. He is with someone else. He's not \"cooling off\", he's hot and heavy with someone else. Right now.\n\n\n\n\nPlease see this for what it is. Don't let yourself be gaslit.",
            "I’ve been married 13 years. We have three young children. Life can get stressful as hell. We’ve argued, we’ve had minor blow ups at each other, we’ve gotten right pissed at each other, but we’ve never treated each other like that. \nI would never think of just storming out and disappearing for 20 min, let alone 2 days. Disappearing like that is not ok, that is abandonment. I would also never blow up at her in public like that even with a reason. \nIn my honest opinion from the details given it really sounds like something is going on with him that he’s hiding.  Blowing up at someone like that without reason is usually a sign of guilt or the stress of secrets eating away at a person. This doesn’t necessarily have to mean an affair, it could be something at work that he’s not wanting to share or is ashamed of. Either way he’s hiding something. ",
            "If he has never had a reaction like this, I would ask him to seriously consider having a medical check-up. Unexplained anger, especially prolonged anger, can be signs of a neurological issue. ",
            "Wow. So he’s so offended by a flirtatious whisper in front of his infant that he disappears from his infant’s and wife’s life for two days? \n\nThe guy was looking for any excuse for a fight. He’s got someone on the side. ",
            ">We've been together for over a decade.\n\n>#[26M, 19F]\n\nyikes",
            "Here's what I've gotten from this so far.\nHe's been distant lately you say, but you chalk it up to end of the year crap he has to deal with.\nThere is a recent MAJOR change to the relationship dynamic by having a child. \nHe got angry that you said he was sexy. (Hmmmm, that's really weird.)\nHe then initiated sex when he could probably tell you wouldn't be receptive due to you being publicly humiliated like that. He must have sensed your mood, and it was prickly, not inviting.\nA lot of people here are saying he's cheating and although that might not be an idea you would like to entertain it might be the correct one. He did everything to set up this fight just in time to spend New Year's with her. She didn't get much time at Christmas with him so he promised her time over New Year's to make up for it. Seriously, who needs this long to cool off? And he's never had to take days away after a fight before, right?\nHoney, if there's not a side piece he's on a drug/drinkging binge and either way...its splitsville for you two.",
            "What an irresponsible jerk. You don't owe him sex, just because you complimented him. That is idiotic to blow up about, makes no sense. Sounds like maybe something else is going on. Cheating? Where has he been for 2 days?",
            "He snapped at me really loudly and said \"do NOT say those things in front of MY child.\"\n\n&#x200B;\n\nWOW! I feel there is something else going on that you need to find out. Those little small compliments are one of many  ways to keep relationship strong and interesting. I'd expect him to respond with a \"thank you\" or a \"your more sexy\" kind of thing. I feel so bad for you in this situation. I wouldn't jump to the divorce question right away though, but I would question everything at this point. For him to leave you with a baby to take care of is irresponsible and unnecessary. Counselling is a good first step.\n\n&#x200B;\n\nI also want to add that men also suffer from PPD (Postpartum Depression).",
            "This is like, not even a disagreement though.  It's scary that he'd get so angry at you for refusing sex.   \n    \nIt's not so much a fight as him emotionally beating up on you to scare you out of standing up for yourself....  \n    \nWhich is about par for the course if you two got together as a teen and a predator. The only thing that doesn't fit is your claim that he has never acted like this in over a decade.  Are you so compliant that there's basically never disagreements?  Do you just bend on everything?",
            "Man, this guy is hiding something. Be it personality traits, problems at work, side chick. He's hiding something.",
            "I honestly hate seeing these kinds of stories. You seem like a wonderful woman and you deserve so much better than someone treating you like shit. That’s what he’s doing and there is no excuse for it. There are plenty of nice guys out there. Nice guys don’t do shit like this, and no body deserves this. ",
            "He may be seeing someone on the side. I mean you said you’ve been together for over a decade. I’m guessing you were between 17-19 when you started dating him which would’ve made him 24-26. He may be attracted to younger women. \n\nAlso, it is troubling that he said “MY daughter” not “OUR daughter” and as a previous commenter responded: “she hasn’t been his daughter for the last two days” because he hasn’t been home. \n\nSomething more is going on here...",
            "Just so you know, it’s healthy to show your affection for each other in front of your children, no matter how old they are. They might get annoyed when they are teenagers but that’s their problem. \n\nYou did absolutely nothing wrong. One irresponsible conjecture is that your husband has been cheating on you. ",
            "So you've been together since before he was 26 and your were 19? That's nice.\n\nJust don't give him the option of coming back and have some respect for yourself.",
            "He's abandoned you and your seven month old baby for two days and (IMO) threatened you with that comment about needing space to cool off so he \"doesn't do something he'll regret\". \n\nOP - this is so weird and dodgy. Who even does that over a single comment? Who needs more than two days to cool off? This is definitely \"divorce or counselling\" material.",
            "So you’ve been together since before you were nineteen and he was twenty-six? That math leapt out at me as a red flag immediately. You were still a developing and impressionable teenager and he was a fully-grown man from the get go. Oftentimes this power imbalance is abused.\n\nWhat he’s doing right now is called stonewalling, which is a form of emotional abuse. That line about having to physically leave to refrain from doing something he’ll regret is threatening and Not Okay.\n\nPlease seek domestic abuse resources.",
            "Personally, I’d let him be and see what he does. It would give me a better idea of what to do. If he does come back, I would tell him we need to have a conversation immediately. This would include discussion of the original incident as well as his abandonment of you and your child. If he refused to do that, then I’d be saying we should go to counseling. If he refused to do that, then maybe divorce. If he doesn’t come back? Maybe find my own counselor and a lawyer. \n\nI would avoid ultimatums. Usually they just make people want to rebel and they do something even more stupid. \n\n\nEdit: I wanted to also express that I’m sorry this happened to you, especially during the holidays. I’d imagine you’re feeling stressed, hurt, angry, and maybe scared. Let yourself feel what you feel. ",
            "You mean ex-husband right? What a creep. He 100% is punishing you for something he is doing.\n\nAlso... he is 36, you are 29, and you’ve been together for over a decade? So at the oldest, you got together at 25 and 18? Once a creep, always a creep.",
            "A lot of people are asking what's wrong in your marriage but it sounds like this a very new occurrence. Could something have happened at his family's house? Like he received horrible news and is struggling to deal with it and is acting out?(not excusable but a possible explanation)\n\nI'm so sorry he acted so childishly and it is best to separate finances, screen shot texts, document incidences, and see a divorce lawyer for a free consultation just to make sure you and your kiddo are safe \n\nI wish you and kiddo the best of luck and that things get better ",
            "I would worry about the comment of don't make me do something if regret. That sounds kind of threatening. 2 days is ridiculously long to abandon a wife and child. I would say don't let him back without counseling. ",
            "[deleted]",
            "This dear children, is what we call a warning sign... in addition to the age difference that started all this. Change the house locks, install security measures, tell both sets of parents what’s up, get a lawyer to discuss options and your personal safety, do not communicate with him. If he wants to act like an volatile narcissist, he can be treated as one. Be safe and put your and your child’s safety as a priority. (Also, it is likely that he created this fight because he’s cheating and was looking for an excuse... follow same advice as above.)",
            "The thing about it being HIS child sounds like a weird foreshadowing that he’s been thinking about leaving you",
            "So... It’s not okay to whisper sweet nothings in his ear because he’s afraid HIS child will hear but it’s okay for him to YELL, embarrass you, in public, in front of HIS sleeping child...  Did he wake HIS child when he yelled at you?! ",
            "This is terrible. Please keep us posted with how you are doing. ",
            "[deleted]",
            "Something is going on with your husband. This is not just about the comment at the airport. ",
            "That’s stupid, who would feel in the mood after getting humiliated like that ? I’ve been fighting with my guy for about 5 hours New Year’s Eve even after 12. It sucks:( I’m sorry you have to go thru even worse wondering where he is for so long. But that’s so not okay, you are definitely in the right here. It’s not like he was turned on after you said it because he snapped right after so I don’t see why it should later on.",
            "There must be something else going because his reaction is over the top! Ask him to at least tell you where he is and how he is doing. Maybe meet him at a coffee just to talk and see why he acts like that. ",
            "What the fuck? Is he always this horrifically unreasonable? If this is a sudden thing then maybe he should get checked for a brain tumour or some other health issue.\n\nHe is treating you like shit.",
            "He blew up at you over nothing and used it as an excuse to disappear for several days. Do you even know where he is? My first instinct is, he's cheating.",
            "> space to cool off so he \"doesn't do something he'll regret.\"\n\nThat is concerning. Has he exhibited any violent tendencies in the past? ",
            "Where the hell is he staying?\n\nPart of me feels like he's cheating and directing this at you because he feels guilty. It's call projecting and it's really common. \n\nI would absolutely say \"counseling or divorce\". You are too old for this bullshit. Draw the line in the sand, do it without apology, and do it with a straight face. Be prepared for a divorce, but it sounds like you're willing to work on things which is good too. Don't threaten divorce if you will cave and stay with this jerk.",
            "It’s funny to me how he doesn’t want you to say that “in front of his child” but he will leave that same child for 2 days. Sounds like there was some underlying issue going on with him and he decided to flip out, instead of discuss it. ",
            "that’s...wow. ok, so holiday stress + new baby + sexy whispers = running for 2 days -so far & a ‘danger’ warning?  my vote is also affair,  or some serious other stuff like [ imagining high-freak situation] he recently got into drugs, he was secretly fired, he’s gambling & lost everything- this is a major flip out over normal stress. \ni’d recommend hiring a detective to follow him, seriously, if it’s affordable. while communication seems to be lacking here, this is a huge red flag. ",
            "Anyone who says something similar to \"you shouldn't put sex in my head” is an asshole. Fuck this guy.",
            "He's been looking for an excuse to leave ever since you had a child. The outburst over something clearly stupid disguised as concern for his child and then the subsequent leaving of that child for two days says alot about how 'concerned' he is about that child. \n\nThe attempt to have sex was probably an attempt to compare you to his mistress before making a final decision on whether or not to actually leave. \n\nThe age of your child and the sudden change in his behavior tells me that the added responsibility of a child is too much for him to handle...so he probably mid-life crisised his way into an affair and now he's looking to leave get out. \n\nI know you didn't state that there was any evidence of an affair, but you need to start snooping to find out. Also, don't allow him to come home and don't ask him too. \"Something I'll regret\" is a very clear threat, and too many people are murdered by their spouses over a mistress for you to not at least be cautious about this and consider it a possibility, especially since he is acting out of character. Your first responsibility is your child, not your husband. He is a grown man. He will come back when he decides too. ",
            "He was looking for an excuse to fight and leave. Change the locks and say good riddance!! Ok well you may not actually be able to do that because legal stuff and blah blah blah... but damn. If he’s not cheating then there is something else very odd going on. ",
            "I've read through a lot of the comments and one thing I haven't seen is anybody mentioning Post Partum Depression. When my daughter was born, I also became distant and was really angry a lot. My wife mentioned it to me multiple times but it took a while to sink in that something was seriously wrong. \n\nI am in no way excusing his behaviour, but is it possible that he could be experiencing PPD? Men can get it and it usually presents as anger in men. \n\nJust a thought. Good luck in whatever you choose to do. This is not an easy situation and you have my sympathy. \n\nBTW, I'm also a Social Worker/Counselor. ",
            "Ultimatum. Leaving me alone with the baby as punishment is a deal breaker. You don't even know where he is. This is awful. I'm so sorry. I would tell him that you are allowed to say no to sex(I mean, what is there to cool off about?), and if he isn't home in an hour, to STAY GONE. ",
            "i think that fight is really about something else, why don't you try to figure out what the real issue is. \n\nor, if your fights are that explosive about non-issues, maybe it's time for a divorce. ",
            "wow-what an asshole.\n\nPersonally I would send one last text-\"you demeaned me and now you are sulking bc you think I owed you sex despite the way you treated me.  Thats not even remotely attractive. You owe me an apology.\"\n\nDont reach out again. Be cool until you get your apology. If he comes home and tries to pretend like nothing happened I would continue with the coolness-polite, flawless, but cool.",
            "He sounds charming!  \n\nI’d tell him to ship up or ship out. ",
            "Jesus, is there maybe a medical issue? Has he hit his head recently? Low testosterone? Not enough sleep? Chronic pain?\n\nRegardless, he was waaaaay out of line in DJ many ways.\n\nCouples' counseling should be considered. ",
            "Is he unaware that a 7 month old baby would have no idea what you were saying even if she was awake? This is just weird. I honestly recommend he get some counselling.",
            "First of all, your child is seven months old, it goes without saying they do not understand a sentence as complex as that, plus vocabulary and stuff. Second of all, please, do not let him treat you like that. I think this counts as domestic violence and you should be really careful. AND, because you mentioned sex, now you must do it with him? That's fucked up. And he threatens you with cheating?. Seems to me he's looking for a momentary way out. Do not give him any excuses. Think of your kid.",
            "He flipped out at you over nothing and then abandoned you with an infant for multiple days in a row. Giving him space is rewarding him for his hellacious behavior. I hope your ultimatum is 'therapy or divorce'. ",
            "To leave over sex isn't normal, especially not for two days with a 7 year old daughter he supposedly loves so much and on New year's. ",
            "Give him an ultimatum. You are married and have a child together. He doesn't just get to disappear for days on end. \nIt's one thing to get upset at one another and need a couple hours to cool off but it's another to leave for day on end without much communication because might \"do something he regrets\" .\nThat's fucking terrifying to me. \n\nSo you should give him an ultimatum. He needs to explain his behavior. ",
            "Leave him. He sounds horrible, borderline abusive! And its not like you were critical or something when he snapped at you, which I would be more likely to excuse as tired and stressed from the holidays, you were complimenting him! It sounds like he's looking for a fight as a way to control you and make you feel shitty!",
            "Why is no one talking about his reaction to being denied sex? Flipping out just because she denied him sex after \"putting it in his head\". This is a big red flag!",
            "Might be super late but I'm thinking he was really really desperate to get an excuse and be somewhere else on NYE. Secret bro party or cheating, idk",
            "I don't know what's going on with your marriage, but I highly doubt this has anything to do with how you spoke in front of \"his\" child. If he cared so much, he wouldn't up and leave the child (and you) for days at a time.\n\nI wouldn't rule out infidelity.\n\nWhatever it is, it needs to be addressed like yesterday.",
            "Honestly if you can access his credit card account I’d look and see if he’s managed to book a hotel. If not I’d look at maybe him being with another woman. I think your earlier question of “ counseling or divorce” is fair. I’d go one farther and while he’s gone pack some clothing for you and your child and find out if you can go stay with a friend or family member for a few days. This gives you somewhere safe to be once you pop the ultimatum to him, especially with his “doing something he’d regret” comment. Good luck and update us!",
            "He 'cares' enough for his child to make some ridiculous statement in an airport but still happy to abandon his family for days on end on a whim?\n\nI hope I'm wrong here but it seems like he had somewhere else he wanted to be and needed an excuse to leave to be there. ",
            "I think he's been looking for a good reason to break up and this is the best he could find. Or that he's decided to play mental instability to make you scared of his ass and force you to leave out of fear.\n\nMaybe he got a side chick and needed an excuse to spend the New Year with her, but it'd be super fucked up of his to put the side one over the main one. Having a side chick alone doesn't necessarily doom the relationship, but being OK with hurting the main one's feelings in favor of the side one does, because it indicates the main one isn't a #1 priority anymore like she should be.\n\nThese are all just suggestions, however. Confront him to ask if any of this is true. If at least one of these suggestions is, then I'm very sorry to say that, but your relationship has a close to 0% chance of survival. Unfortunately.\nIf none of that is true, I wish you best of luck in learning what's the real issue and getting your marriage fixed!",
            "I don't want to be alarmist here, but are you sure he is ok? Has NO ONE heard from him?",
            "If you have his bank log ins, you can check his credit/debit card transactions to figure out where he is. Then when he gets back, ASK HIM, see if he lies to you. \n\nIt sounds like he was picking a fight to make an excuse to leave, for whatever reason. Shows how much he cares about HIS child...",
            "It seems like there is something going on behind the scenes tbh, people who blow up for no reason like that usually do so because they're guilty or something similar in my opinion. Maybe he's hooked up with someone when he was home visiting parents and so you coming onto him has made him feel guilty and lash out at you?\n\nAlso don't know if it's just me but the whole 'you called me sexy one time today so now you owe me sex thing' is ridiculous. I know he didn't say that in as many words but it's certainly implied on the way he acted and thats a huge red flag for me.\n\nI think if I were in your situation I would invite him to have a calm sit down conversation with him and would set up the following rules\n 1) do not interrupt me when I'm trying to say my piece, \n2) do not raise your voice at me and\n 3) do not walk out again.\n\n And then I would bring up how and why I think his behaviour was inappropriate. How in the airport it was disrespectful of him to raise his voice so loudly in a public place and how it hurt my feelings that he seemed to have no regard for my feeling or embarrassment in that situation.\n\nI would then apologise about what I said, and would make sure that he knew that I didn't know he was so concerned about those kind of things been said in front of the baby, but that I had already checked that he/she was asleep and wouldn't hear, and said it quietly under my voice anyway. \n\nThen I would bring up how unfair it is that he didn't respect my wishes not to have sex and in fact inferred that I owed him sex after my comment at the airport because it turned him on. I would impress upon him that even if I had explicitly said at the airport that I wanted to have sex with him later that day, that does not mean that I owe him any sort of apology or sexual favours of any kind should the evening arrive and I not be in the mood anymore. And I would make sure he understood just how entitled his comment was regarding this subject. \n\nAnd then finally I would explain that walking away from your wife and 7 month baby is not okay, it's disrespectful and shows a real lack of judgement and empathy. And a real lack of care for your infant child. If a slightly inappropriate whisper and a refusal to have sex with him warrants abandonment then he has to really reorganise his priorities because what that says to me is that his pride, ego and sexual fulfilment are more important than his wife and babies happiness. I would also express that if he were to repeat that behaviour (of up and leaving) I would look into marriage councelling and maybe even divorce. \n\nI'm sorry I've dragged on so much but I hope this is helpful \n\n\n",
            "Something isn't right here. Feels like he was milking this situation so he could leave for 2days.\n\nId look into it a bit more. ",
            "I'm so sorry this happened to you. This is similar to something my ex used to do: flip out over some perceived (often fabricated) issue that was ALWAYS my fault and leave. My gut - as useful as that is to you - says there is something more going on here. I'll admit my first inclination was that he's cheating. In any case, you did NOTHING wrong from what you've related. \n\nI agree with the poster who said do not even suggest divorce until you have your ducks in a row - financially and otherwise. Frankly, if you're even considering it - talk to a lawyer, now. \n\nWhen he comes back - and he will - you're going to have to have a serious conversation about what happened. It's not even about the material part of the argument - it's about the leaving. That is a disproportionate response. He needs to have an explanation that  doesn't start with the phrase \"Well, YOU...\" and ought to begin with \"I'm so sorry...\"\n\nGood luck to you. ",
            "The key thing here is in that moment, he didn't see you as the mother of his child. \"do NOT say those things in front of MY child.\" He doesn't see you as an equal anymore.",
            "Leaving for days and sudden temper tantrums kind of seems like cocaine or something. \n\nYou can't just leave like that, nobody does that unless they're awful to begin with or on drugs. ",
            "I feel like there’s something else going on with him. If he’s never reacted like that then it has to be about something other than your comment. For him to flip out over your flirtatious comment in front of your baby who can’t even understand anyway is irrational. Personally, I think it’s good for kids to know their parents are into each other. But also how could he be surprised that you turned him down for sex after he put you down? And how could she only be HIS daughter and then take off for two days? I really hate when men do this, refusing to deal with emotional conflict and then shutting down. It’s so childish. \n\nMaybe he’s projecting guilt about something? Maybe it’s a Madonna whore complex? Whenever he comes back you have to put your foot down and say if you run away like that again, we’re done. Solve your damn problems like an adult.",
            "Not much you can till he returns.. I'd have been losing my mind and change the locks",
            "Big red flags. Nip this in the bud and give him an ultimatum, and include therapy for him IN the ultimatum. \n\nHe could be cheating though, just fyi. \n\nHis blow-up is crazy and absurd and just doesn't make sense. Weird. ",
            "There's an elephant in the room no one is bringing up. His reactions sound way overblown for the situations. I'd recommend counseling.",
            "Any new update??  You have us Reddit readers wondering....",
            "That's super inappropriate..\nHas he gotten more like that after marriage ?\nThis is a really immature response and manipulative .\nHe doesn't really care or he would be home he doesn't get what he expects or wants and acts like that huge red flag to be walking around with this .. if he always walks away to cool off he's not mature enough to have a kid let alone be in a relationship with you. \n\nSorry dude \nHuge red flag ",
            "Guy is a total idiot",
            "Honestly, it almost sounds like a psychotic break or something. Worried about what you said in front of an infant?\n\nStorming out of he house because you wouldn’t have sex with him and then staying no contact for 2 days?\n\nSomething sounds very wrong with him probably medical. This sounds like such a dramatic change in behavior that I wonder if he got a brain tumor or something or is he under a lot of stress? Has he been sleeping ok lately?",
            "Prepare yourself for a big fight when he'll be back \" because it will all be your fault\" and maybe he will accept your excuses!\nI'm afraid he's seeing someone else who asked to spend NYE with him.\nSo sorry for you ",
            "You've been with this man for, over a decade? You know him better than us strangers in the internet. Trust your gut, look out for yourself and your  little one.  I'm sorry this is happening to you on new year's, mama. PM me if you need to vent to someone who doesn't know you. Best 💕",
            "If he thinks he is coming home to a fight, he might find more excuses to remain away for longer.  And an ultimatum risks an even more irrational response from him.\n\nI suggest asking him to return home to be the father he needs to be.  Make this about being a responsible parent.  If that doesn’t help him see sense, perhaps there has been something on his mind and he is only now allowing it to intrude into your lives.\n\nHis emphasis of ‘my’ during his outburst is troubling.  I hope he sees reason and comes home.  His response at the airport was incredibly out of line, and the entire situation is his doing.  But blame won’t bring him home.  A long talk after his return might shed light on why this even happened.\n\nAs for the topic of divorce, don’t bring it up unless you have calmly considered the implications.  Once that idea is mentioned, it could grow into a reality.",
            "God forbid your kid learns what a healthy and loving relationship looks like. That's just such a weird thing to be upset about and I can't begin to think why he was so upset. I would definitely pick this as your hill to die on. ",
            "OP could he have someone else on the side?",
            "This is some Don Draper crap. Honestly the fact he is acting that way is very telling. I'd use this experience to analyze the relationship. ",
            "If this isn’t normal behavior, maybe consider setting up a doctors appointment for him. Abnormal behavior can be a symptom of a medical condition.",
            "I think you should check out /r/justnoso",
            "I’ll call my wife sexy in front of our future children. It’s good to know that your parents love each other.",
            "Wow. I’m sorry OP. I’m glad you refused him. What a jerk. ",
            "I'm sorry. This shit does not happen without other warning signs and/or if there isn't anything else going on.  Is there a history of trauma? Was he abused? Do you have any reason to suspect infidelity? ",
            "I’d say take the time to analyze his behaviour ever since you’ve been with him. Before you say “He’s never done anything like this before.” take the time to make sure it’s true by really taking the time to reconsider anything you may have brushed off or blamed on yourself in the past.\n\nIf you figure out that behaviour like his right now has happened on a lesser but still very hurtful scale, then you’re better off with someone who is more level-headed and rational towards the people he claims to truly love.\n\nIf this is absolutely a first-time thing, definitely take up marriage counselling. It may possibly just be stress affecting him and causing him a blowup, and counselling could let you guys talk to each other about why it happened.",
            "Check the bank statements, check his phone calls and texts. You’ll discover quickly if he is cheating. \n\nIf this is truly bizarre out of character behavior call and text him, let him know you are worried, but that he needs to show up immediately and deal with the situation. \n\nIf this is fitting an escalating profile of emotional abuse, then it’s counseling or out. Hard to believe that a relationship that started at 25/18 would have only just taken this turn now. ",
            "So, here's the thing, he's already done something that, if he's a good guy, he will regret. \nThis is abandonment. This is out of line marriage reaction to an otherwise normal marriage comment. \nMaybe something super serious is going on with him. Or maybe, when he snapped he was pissed off from the flight or whatever. Easily fixed by a simple \"shit honey sorry I snapped earlier. I was frustrated.\" Or even \"sorry I just meant I didn't want to be all sexy talk around the baby.\" Also, acceptable if you have a chat about it. \n\nBut this, disappearing and making a threat as he did - that's unfair and no doubt disappointing. Something he'll regret? Like what? Killing himself? Or killing you? Maybe beating you? Taking the baby and disappearing? I don't mean to scare you but he's clearly out of his mind, who knows what he's thinking. \n\nYou need to protect you and the baby. Go somewhere else. Don't text him where, just say when he's ready to explain himself you will answer the phone. \n\nThen, pick yourself a deadline. What's acceptable to you? A week? So, five more days. \n\nYou can hear him out - and still divorce him. \nYou can hear him out - and maybe go to counseling to resolve this. \n\nMy husband has bipolar and when he drank he turned into a complete asshole and would leave for a night or two. He was just horrible. I know all this and I told him that couldn't happen anymore. He could've flipped and left but he's chosen to work on it and give me a heads up when he needs to walk it off/drive away for a night. It's not ideal but it's what it takes for our marriage to survive. He knows my line. I know his. \n\nYour husband just pissed on every line you know and disappeared. Make a new line and go from there. \n\nSorry for the novel. \n",
            "I agree with everyone suggesting cheating. Maybe it’s just my bad experience with an ex distorting my judgement, but it sounds to me like he’s trying to gaslight you, by turning an innocuous comment you made at an airport into a reason to leave you. ",
            "Do something he would regret? Over what? And how fucking entitled is he to having sex with you? \n\nHow dare you don't just comply whenever he wants! Why aren't you still the compliant 19 year old he got together with? \n\nYou need to assert yourself.  Is it possible you're be coming more assertive now that you're reaching your 30s and he can't deal with that anymore ?",
            "What happens when your child gets older and he blows up at her?\n\nNext time is he going to leave for longer?\n\nIf he's bold enough to scream at you in public, is he bold enough to do worse in private?\n\nAre you willing to tolerate all of this regardless?",
            "Every time someone exploded for no good reason, usually it's because they try to pick a fight so they can feel less guilty about their own wrong doing. ",
            "I think the majority of people commenting are right. Something’s up. \n\nI hate to say this, I think most people who ask for advice on reddit are just in slighter bigger fights than they’re used to and come here for help but often get told the worst case scenario answers...I don’t think this is one of those times.\n\nHe’s been gone for two days? He hasn’t reached out to check in on his 7 month old? He’s threatening to do something “he’ll regret” like it’ll be your fault. It’s not adding up, it really does sound like he using this as an excuse. \n\nI sincerely hope we’re wrong.",
            "he thinks hes owed sex when you bring up sex and leave when he doesnt get it? id get the fuck out. sorry dude.",
            "I think your biggest red flags here are these:\n\n1: your husband accuses you basically of leading him on by flirting and then not having sex. Holy cow. \n\n2: him saying he's left before \"he does something he regrets\". What does that mean??? Nothing good. Nothing like the casual threat of violence to set your wife straight. \n\nThere are other big issues clearly, but look at just these two and think about whether they're something you'd put up with from another partner ",
            "Don't issue ultimatums. They won't get him to come home and could have the opposite effect.\n\nThere seem to be some underlying issues he is dealing with from the sound of his outburst.\n\nLeaving for two days seems like a huge overreaction to this, or any, disagreement and incredibly disrespectful to your marriage. \n\nHas he told you where he is even? Where he has been?\n\nHave you been concerned prior to this that he was cheating? (Rash anger, sexual expectations, absence for days could all point to him cheating especially if this is out of character for him.)\n\nHas he been quick to anger or left for days before? (Is this even out of character for him?)",
            "there is something more going on here than meets the eye. i dont think he wants to be married anymore. ",
            "If sounds like there are some underlying issues that probably need resolving I would suggest counselling first but seriously what kind of man walks out on his wife and baby for two days. That’s behaviour that I personally wouldn’t put up without a very good reason ",
            "So it’s not ok to say the word ‘sexy’ in front of ‘his’ child, but it’s totally fine for him to abandon you both for two whole days? \n\nYeah, no, sorry as everyone else has said there is something way bigger going in here. Leaving for two days over this is completely irrational and shows a complete lack of regard for both you and the baby.",
            "This doesn’t sound like a healthy relationship.",
            "This is extremely scary behaviour! I had a similar situation with a hostile ex, who emotionally abused me for a long time and threatened me with wanting to hit me etc. I wish I would have left the new year's eve we had a fight like that! It only got worse. I found Nd out later that he had narcissistic personality disorder..  plz take care!; ",
            "What kind of grown ass man leaves his wife and baby for 2 days over comment he didn't like..that's some major bullshit. He needs to be checked.",
            "If what you're sharing is all that happened,  there's definitely something else at play.  My guess is he is cheating on you",
            "I'd take this a red flag that he's a massive childish knobheads who I need to get the fuck away from!  However he seriously needs some therapy if you stay together.",
            "Honestly sounds like there is something underlying there for him to snap and leave for two days over something as small as that. It honestly sounds like he was looking for a reason to leave and he found it by blowing things out of proportion. By the way he spoke to you, he sounds like a toxic person. As a person who suffers from severe depression, call a family member or close friend. Take the baby and stay with them or have them stay with you, you need someone to help you with the baby and also with your emotions right now and give your man some space. You need time to calm down and think clearly as well. ",
            "Umm, wait you have been with this man for a decade? Sounds like a bit of a nutjob dude seriously needs to take a chill pill ",
            "I cannot believe there isn't rather more to have triggered the reaction. \n\nMy two daughters are now in their mid to late 20s, in long term relationships, living in their own homes with their partners and doing well in their chosen professions. \n\nI cannot think of any age when them witnessing my wife refering to me as sexy or indicating she wanted to be sexually intimate with me (or the reverse where I so indicated) was a problem.\n\nExposure from a young age to such healthy behaviour is a good thing. \n\nSo I'm curious to try to understand what else he is sensitive about. Did he not like public displays of affection for example? Does he only like intimacy in the bedroom? At bedtime? Is he a bit of a control freak? Was he very stressed when collecting the bags? Etc. ",
            "Well he's either cheating or is having some sort of emotional breakdown..  \nIs his job super stressful?\n\nHas there been any suspicious or eyebrow raising things happen to suggest he might be cheating?  \nLike suddenly \"doing overtime\", suddenly \"going to the gym\"  \n\n\nNo one that's normally placid in nature blows up like that for no reason...  \n",
            "Ultimatum because that’s complete BS!",
            "Getting upset and snapping was weird but leaving you for two days alone is unacceptable. ",
            "His reaction is always your answer.  It’s always there for you to see.  He’s got guilt all over himself.  He blows up cause he wants to fight but also guilty.  He initiates sex cause he knew you would say no.  He wanted to leave.  I think he’s cheating.  That’s what I think.  I also think he’s got some narcissistic tendencies mixed with a little bit of sociopath.",
            "Imo, there is something more going on than meets the eye. Have you ever suspected him of cheating?",
            "This is absurd behavior. This is change-the-locks and put 911 on speed dial if he shows up.\nHe ABANDONED you and your baby, and threatened you. He doesn't deserve to just waltz back in.\nYou'll need the advise of a lawyer, of course, but do Google abandonment of spouse.",
            "Some abusers don’t get abusive till they have children. Even if you’ve not experienced this before, is he particular about how he likes stuff? Does he dictate how things should run in your household? Are you in any way removed from your family and/or friends? These all might be little red flags to an abusive streak. \n\nEven if he is not, what he has done is abusive and shows a real lack of maturity. He has basically threatened you with violence in a really vague way, and is manipulating you by leaving you alone with the baby. He is making you feel unsafe and using that to control you. Not cool. \n\nI’d be worried about saying ‘counselling or divorce’ because of what he could possibly do to you if you bring up divorce. I think you should say that he needs to attend therapy of some sort, and if he refuses (and especially if his behaviour gets worse at the mention of it) quietly prepare to get away from him. I might be overthinking it, but it worries me. ",
            "Doing something he'll regret sounds like a threat. Take it seriously. \n\nHe built up this whole fight out of absolutely nothing and then disappeared for two days. All the comments about cheating have a basis in reality. I realised this was a strategy my abusive ex employed when he wanted to go fuck someone else only after I left the relationship and someone told me they spotted him with someone else while we were dating. I couldn't believe it at first, but then I could see the pieces of the puzzle more clearly. For him, it has the added bonus that it's a way of controlling your behaviour, of making you feel crazy and guilty and trying to \"fix\" yourself in order for it to not happen again. But it always does. \n\nDemanding sex!!!! Blaming you for \"getting sex into his head\"?! This. This is so sickly and wrong! He is not entitled to sex, I hope that much is clear. And to start a fight over what he feels you owe him in that moment? That is a flaming red flag! Say things stopped at this point and you went down your usual path of cool-down and discussion- in that moment I would have asked for couple therapy.\n\nAnd now reaching the point of his initial reaction- oh dear. Yelling at you in a public space over nothing?! a.your child was asleep. b. it's a seven months old baby who does not understand talking to that level, let alone sexy talk! c. You whispered in his ear! Did he refuse to have sex with you during the pregnancy out of fear of poking the baby as well??\n\nSay he really did believe it was out of line of you, despite all the above. First of all, screaming is never acceptable, more so in a public space. Secondly, he should have, could have addressed the issue with calm afterwards. He didn't. If he was so outraged by your comment, how did you get sex into his head? He can't act both outraged and turned on, on the flip of a coin, it doesn't make sense. Something needs to happen in-between the two instances for the transition to make sense.\n\nAnyway, I'd say, don't ask him to come home. Start making arrangements for yourself and the baby to be safe, in case he does further escalate, because he seems capable of it. Under normal circumstances, divorcing over a fight seems like an overreaction. These are not normal circumstances.",
            "Honey the ball is in your court right now. He bailed, even if only temporary. You do what you need to do to be at peace, and for you and your child to feel safe.\n\nYou deserve love. You deserve support. You deserve to be nurtured and respected. Remember that, and don't ever settle for anything less. For each man who denies those things, there is another out there ready to give them to you. It's important that both you and your husband recognize that.",
            "He needed an excuse to get mad at you so he could spend some time with someone else.... classic move! Sorry to say, hes probably cheating. ",
            "19F meets and dates 26M. Yeah he groomed you, even if he wasn’t aware of it himself. Sounds like he’s always been abusive and is evolving. Nothing that you are disclosing is normal in a relationship. Overreactions, absolutely yes. Disappearing for two days over being denied sex (due to one’s own actions)? Absolutely irrational. BIG RED FLAG. ",
            "Wow,so you compliment him and he snaps,makes me wonder if he's not hiding something from you and decided to use this moment as an opportunity as a catalyst for him wanting to leave you ",
            "At this point, I wouldn’t let him return home before he has some answers and explanations for this shitty behaviour. \n\nIf he wants to come home, he can meet you at a counsellor’s office and you can discuss it there. ",
            "Honey, this man sounds a lot like my ex-brother-in-law. His being super possessive of the baby (\"*my* baby\") is one of the things that drove me up a wall. He punched holes in the wall at one of their former residences. After some therapy, I could see why he did some of the things he did. But I'm so glad my sister finally got up the nerve to break it off. Unfortunately, there is a kid now, so our family will never be totally free of him. Even now, a year after the divorce proceedings have started, I am seeing something new I nbn how abusive he really was and how nasty of a person he is and always was.\n\nHoney, I hope that you can find out where he has been and why he reacted in such a manner. I'm only tell you about my ex-bil just in case you notice any of the same behaviors/attitudes in your husband that are seemingly coming from nowhere. Good luck!",
            "There’s a chance he wanted to get away from you and the child so he can be with himself. However that’s not fair for you. He needs to be responsible for what he’s put you through. Space to cool off and it’s been 48 hours? What a load of shit",
            "OP, don't you know that saying the S word near people = you owe them sex? \n\nSeriously though, it seems your husband may have some anger issues.even if he was super tired and cranky from the trip, he should have apologized for it all already. I think you need to really consider how to prevent this from every happening again, from the snapping in public to not being able to work through issues together.",
            "Maybe he has a brain tumor?",
            "Oh, I've got a gut feeling that's head having an affair.   When SOs bail like that over something final it's often bc they've got a backup to run to. Regardless, get your affairs in order.  Document everything you own, the time he had taken and not been in contact with your daughter. Take money or if the bank and hide it with family.  Protect yourself in case this goes tits up. ",
            "Sounds an awful like he is projecting on to her. The public freak out at the airport over a ‘sexy’  comment, and then trying to initiate sex when they got home, throwing a temper tantrum  when she said no & leaving for 2 days, knowing she’s alone with a 7 month old baby??  \n\nWhere is his concern for *their* daughter now? It’s very telling when people refer to their children as *mine*\n\nSounds like he’s hiding something himself.  This is bigger than just that one argument & hun abandoning you for two days.\n\nI would suggest couples counseling but something tells me he isn’t going to go for that. Wishing you luck OP - I’m so sorry you are going through this. ",
            "sounds suspiciously like he wanted an excuse to leave for a few days ",
            "Keep those texts. He has confirmed he abandoned you and the child and this will help you. He has also shown he may be a bit violent and out of control. \n\nText him again to ask when he is coming home, try to get confirmation of how long he's been MIA. ",
            "I have been married for 24 years.  We still fight sometimes but nothing serious.  If my wife were to call me sexy I would be as flattered as a teenage boy.  There is definatly an underlying cause for this blow up.  I was diagnosed with depression over 14 years ago.  I was being a terrible husband at the time.  I have worked with my Dr and he has successfully been treating me since.  Every few years I have a bad spell like what you described and head straight to the Dr. to change treatment or just talk. My beautiful wife has finally began to understand that the problem isn't her, but a treatable condition.  My heart never stops loving her even though my brain causes me to act like an asshole.  Depression is sometimes hard to see and hard to understand by family and friends, but it is very real.  It kills relationships and kills people and ruins those left behind.  Get to a trusted Dr with your husband.  Maybe it is not depression,  but if somebody with depression says hey that sounds just like me... it is time to help the one you love.\n\nGood luck ",
            "As a man myself I have heard if other guys purposely cause an argument so they have the excuse to go off and do something to other than be a decent husband. The timing of this makes me suspicious. Worth a consideration in my opinion ",
            "Is there any chance he was sexually abused as a kid? Or someone close to him was when he was younger? A lot of people are assuming cheating, which is could be, but exploring another issue here would be worth your time. Good luck. ",
            "Hey darling how are you doing this morning? Are you feeling any better? ",
            "I see that there is an update and it's \"being resolved,\" but there is literally no excuse for abandoning you and your child for two days with no contact. That's unforgivable. He had better spend alllllll of 2019 apologizing!",
            "Am I right to assume you started dating him when you were 18 and he was 25? At that age, that's a pretty big age difference. Often, when I see men looking for younger women, it's because they like to be in control. Maybe he controls the finances, \"takes care of you\" by making enough money that you don't have to work, maybe he doesn't like a lot of your friends, maybe he doesn't like it when you're independent. \n\n&#x200B;\n\nThe relationship he signed up for was likely where he was in charge. Having a baby makes a lot of people grow up fast. It's possible since the baby came, you've been more independent. He's trying to wrap his head around a wife who doesn't always bow to his knowledge and experience. My dad did a similar thing to my stepmom, so let's see if this story sounds familiar to you at all.\n\n&#x200B;\n\nMy dad met my stepmom, we'll call her Flower, when she was 17 as my new babysitter. Dad was 25, I was 9. Dad fell instantly in love. Flower had never lived outside of her parent's house, never even left her home state. Dad was a well-traveled anthropologist, and she was fascinated by his worldliness and knowledge.\n\n&#x200B;\n\nThey married just after she turned 18. Hardly knew each other a year, but they were so in love. After Flower moved in with us, she started to see how dad treated me when no one else was around. She didn't like it, and they sent me to my mother while they \"worked things out\". The next time I saw Flower, she was so tired. Once I was gone, the mental abuse slowly turned to her.\n\n&#x200B;\n\nPoor Flower had endured over 4 years of abuse. When we got to the house, I saw how crazy it really was. They'd had no luck having a child of their own, but still, dad wouldn't let her work. Every time she picked up a job, he would force her to quit for some imagined reason. Finally, she found a job online. She could work from home and dad wouldn't be able to find an excuse to make her stop. He didn't like the privacy that she had in her office, so he took the door off. She was only allowed to take naps in the living room with her head on the side of the couch that he could see. She wasn't allowed to go anywhere alone, she wasn't allowed to have friends.\n\n&#x200B;\n\nShe fought hard to be able to perform as a musician once or twice a month, but that was her only solace. When she was in her mid-twenties, Flower started to stand up for herself more, and finally threatened to leave. My father ran away and called her from a hotel. He said if she left, he would kill himself. Another attempt to re-establish control.\n\n&#x200B;\n\nWhen he figured out she was driving to her parent's house, he took the next flight to get ahead of her. Tried to ambush her, acting like it was a loving gesture. Thankfully, Flower escaped. My dad now has a habit of preying on younger, less experienced women. He's turning 50 soon and just finished going through a hard divorce with his 30-year-old wife.",
            "Disturbing to me how many of you recommend a divorce. The issue at hand is clearly about a lot more than this single incident. He sounds like he needs to talk to someone and work through his resentment.",
            "Postpartum depression can affect men as well. I’m not saying that’s what this is, but emotions are a wild thing. It could be something worth talking about and seeking help for.",
            "Abusive behavior. Would have clapped back with “what kind of tone did you just use? And YOUR daughter? Did you fucking give birth to her?” You can’t be afraid to make a scene if he started it. \n\nChange the locks and when he’s mad, “well you left for two days. And so much for ‘your’ child you left. Spent New Year’s Eve with another woman? Bye. *sips tea*”",
            "Did he bump his head at any time during the trip you just took? If this behavior is completely out of the blue and out a character, a concussion or other head injury can sometimes cause strange behavior and aggression. ",
            "I’m sorry you’re going through this. You should NEVER have to worry about your husband (or wife) saying they won’t see you so that they won’t do something they’ll regret, or that they will leave you alone with your baby for two days. That’s just plain weird and creepy. I don’t have any advice to offer, but I hope you and your daughter enjoy your New Year’s eve. ",
            "If this is full blown 180 degrees not in his character, maybe he's having a medical thing with his brain?",
            "Something else is going on with him, it's not about your comment or getting turned down for sex.    Doubtful it's mental illness, it's something else weighing on his mind, and it's probably not good.  ",
            "Being a parent is something new for both of you so its normal it brings new relationship challenges, and parents tend to be more tense and \"try harder\" with their firstborn . And airports tend to be pretty stressful so maybe thats why he was on edge?   But you are definitively on your right to not be in the mood for sex after that.  And  the holidays tend to be stressful and put people on weird moods.  Dissappearing is not normal, but if hea never been like thia maybe he feels ashamed of his reaction?\n\nBy \"not doing something he'll regret\" i hope he means \" i want to cool off so i can resolve this calmly and not fuck up more\" and is not actually trying to intimidate you or threaten you with whatever. You know him so you know more or less what he actually means. \n\nWhen talking to him about the issue, use non accusative communication. Express your feelingw using \"I\" statements, and if you can or see reason to it, try expressing your understanding of his reaction and approach the issue with forgiveness and an open heart. \n\n\nAlso remember that people on here tens to be fatalists (myself included), dont jump to conclusions until you get a hold of him, but open the lines of communication and ask if there might be something else that might have triggered his reaction.",
            "I would leave him a note - put the ball in his court .\n\n“I’ve witnessed some erratic behaviour that is so unlike you that it has left me very concerned.\nDue to your actions I can only assume that you are either;\nA) extremely stressed/aggravated about something in our relationship and felt the only way to deal with this problem was to leave for two days without any courtesy to me about whether you were dead / alive/ lying in a ditch\nB) I can’t help but wonder if you are possibly seeing someone on the side and crafted this argument to steal away .\n\nSo either we need counselling to help our communication or we need a divorce if you are emotionally and physically checked out of this relationship”\n\nThen leave it at that . Watch a person sweat when they know what your cards are and it’s all on them . \n\n",
            "Honestly, this screams affair to me. It's up to you what you want to do about it, but at the *very least*, I think you should get an STD test just to be safe. If you decide to stay with him (though I probably wouldn't), you should make him get one as well.",
            "I'm sorry but your husband is mentally ill. Good luck with that. ",
            "It seems to me it isn't anything you said or did. It is something else bothering him. Men internalize emotions. We don't outwardly like to express them. Women usually like opening up and talking things over, us men prefer to just bury it. We still have and feel emotions, we just deal with them differently. Most arguments couples have is the husband/boyfriend doesn't talk enough. Communication, or lack thereof is the biggest problem. We men keep things to ourselves and may open up to a guy friend, but we are sometimes to proud, or just don't want to be a burden, so we don't talk to our ladies about our problems. He is going through something, because if he doesn't normally fly off the handle like that, then something is eating him up inside. That is making him lash out.\n\nIt's not about what you did or said. His reaction to your whisper in front of your daughter, is the symptom of the problem, not the problem itself. He probably has something he is dealing with physically, mentally, emotionally, but he wants to figure it out in his head himself. If he has any guy friends, call them up and see if they can talk to him about it, maybe he'll open up to them. You are his wife. The love of his life. He doesn't want to admit he has a problem, because he doesn't want to appear weak to you. He wants you to always come to him, he doesn't want to come to you to fix a problem when he thinks he can do it by himself. I am a man, so I would know, because I have done the same.\n\nUnless you can find a way, to get him to talk to you about it. You know him better than anyone, you should know what it takes to get him to tell you what's bothering him. I will pray for you, and I really hope you both can work through it, just get him to talk",
            "What happened.   Post an update ",
            "Ultimatums are bad and rarely ever work, and if they do work it still causes major resentment in the other person. ",
            "There’s something else going on... if this is out of character, it’s a big leap for any argument. Did something happen on the trip that might have stressed him out?",
            "Try and spot the red flags. You are missing the clues here. ",
            "Did he ever get angry before? Sometimes when couples don’t fight at all, problems can build up to where something insignificant sets one person off way more than it should have. Having a seven month old can be pretty stressful. While he definitely overreacted (7-month olds don’t understand much of anything), maybe there’s other frustrations that have built up over time? ",
            "This argument appears to be connected to other issues your husband appears to be having. His response doesn’t appear to be a rational one (taking what you said at face value). Either way a deeper conversion needs to be had under the guidance of a license counselor. Being that he has been M.I.A for two days with no contact it can be one of two things, either he abandoned you or something has happened to him, either way it’s not good. If I were you I would first file a missing persons report THEN contact an attorney. If he shows up in the next 24hrs then counseling is a MUST while you discreetly retain a divorce attorney.  This is not normal (or acceptable) behavior on his part. I wish you the best. ",
            "You did say the baby is seven months old, right?  Rest assured, other than waking to the sound of your voice, that baby has no clue what any of your conversations mean at this point in her young life.  I don't want to be disrespectful but getting this angry over being denied sex over something so silly as being called \"sexy\" by his wife makes we wonder what else is going on.  You didn't deserve the embarrassment when you paid your husband a loving compliment, and you most certainly don't deserve to be punished for 2 days while he is doing what ever he is doing.  \n\nI'm with you, I would also demand he get his butt home. I think I would take it a bit farther and let him know your bottom line.  He can either come home and be a man, or pick up his suitcase and stay elsewhere until YOU are ready to allow him back in.  What he is doing is bullshit! "
        ]
    },
    {
        "post_id": "lrcym1",
        "author": "sisterissuethrowaway",
        "title": "(5 year update) Me [44 M] with my sister [50 F], 44 years duration, got a painful message from her regarding my professional behavior as a substitute k-12 teacher and don't know how to respond (long)",
        "url": "https://www.reddit.com/r/relationships/comments/lrcym1/5_year_update_me_44_m_with_my_sister_50_f_44/",
        "score": 5886,
        "num_comments": 250,
        "created_utc": 1614173534.0,
        "selftext": "The front page r/askreddit thread inspired me to follow up here. [Here's my original post from five years ago](https://www.reddit.com/r/relationships/comments/3fnzui/me_35_m_with_my_sister_42_f_siblings_for_35_years/).\n\nThe discussion was really helpful, and at one point I had my therapist read that thread. Thanks to everyone who chimed in. \n\nSince that post, I have not been in contact with my sister, except for incidentally at a few family events, where we had minimal interaction. My other family is conflicted, but they seem to understand that neither of us wants to be in each others' lives any more, despite them wanting us both in theirs.\n\nI've worked on this issue specifically in therapy, which has helped me develop some insight into those messages. Next year I will be as old as my sister was when she wrote me those abusive messages (there were a few followup messages I didn't include in the original post.)\n\nI don't regret cutting her out. I do regret having had a toxic person for a sibling. Looking back I recognized that her over the top email was part of a few lifelong behavioral patterns. I realized that basically, despite our biological similarities and having been raised in the same household, we are simply not compatible people.\n\nI hope one day she will develop her own insight, recognize her abusive behavior patterns, and reach out to try to repair or reestablish a relationship with me. But I'm not holding my breath for this to happen, and I'm not interested in reaching out to ask her if she'll consider trying to improve things. Not having her in my life in the years since has actually improved the quality of my life: there's been a lot of unnecessary drama and hard feelings that I'd been used to having to handle that I simply don't with her gone.\n\nAt this point I anticipate only seeing her at a few more funerals. Would have been nice to have a good relationship with a sibling, but I do not have that with her and I don't believe I ever will.\n\n**tl;dr**: Cut abusive person out and life has improved\n\nEDIT: I am humbled by your responses. Your support has moved me to grateful tears. Your perspectives, today and years ago, have really helped me to power through a pretty difficult experience. Thank you very much.",
        "permalink": "/r/relationships/comments/lrcym1/5_year_update_me_44_m_with_my_sister_50_f_44/",
        "comments": [
            "Gosh...I never saw the first post at the time but her email was savage...I’m so sorry Op, that was one of the unkindest, most malicious things I’ve ever read. Wow.",
            "Would love to know what’s happened in 5 years. Did you overcome your depression? Did you continue teaching or working in law?",
            "Did you ever get any feedback from the school you were subbing at? If they had you every day it seems like they actually liked you! Did you stay in town, or move back to the other state to be a lawyer? Would love more life updates.\n\nGood for you for cutting out your sister. That letter was just dripping with animosity.\n\nEdit: typo",
            "Man that letter was such immature high school bullshit. \n\nShe disliked you, the Jenny woman was defensive about you fixing her assignment, and the two of them were jealous. The sister just relishes using Jenny’s petty complaints as fuel to attack you, and dressed it up as concern to make it more delicious to her and give her deniability with the family.\n\nWhat a piece of shit.\n\nI’m glad everyone chimed in to say as much, and you’ve had such success in the years since. Good for you, you’ve earned all your happiness.",
            "I just read the original email and my heart hurts. Anyone who says “they don’t have a mean bone in their body” is a total jerk and so is the person they’re referring to, but wow did it ever get worse than that. That email is so out of line and hateful over second hand GOSSIP reported over happy hour. Probably mostly exaggerated and made up. I’m so glad you’re happy and you cut that person out. She is NOT your friend and certainly not someone you should devote even a moments thought. \n\nI’m adopted, so the whole “blood” thing has never had an impact on me. I love my family dearly because they’re incredible, loving, kind people. They are my family not because theyre in my bloodline, but because we treat eachother with love and respect. Don’t ever feel guilty for walking away from blood. You deserve to be loved and happy. There was nothing loving about that horrible message.",
            "[deleted]",
            "I read your original post, and I’m going to school to become a teacher. I sub as well. I always leave notes for the teachers about the day. It’s customary. I’m sorry you have a toxic sibling. It’s really disheartening when that happens. But her behavior isn’t about you, it’s about her. Best of luck to you.",
            "Was there any truth to the content of sister's email or did she exaggerate things \"Jenny\" said?",
            "Another lawyer here, what stood out to me in the email was the bit about saying how intellectually smart is getting you nowhere. And how good social skills, good interpersonal skills are so much more important. \n\n\nI’m not going to comment on the validity of this, I wanted to say, her original wording REEKED of her having waited a long time to tell you off and specifically, to let you know  you weren’t hot shit just for being so smart (and smarter than her). She really tore into you and with VENOM.\n\nI’m sorry you had to deal with such a bitter and jealous sister. Happy to hear you are doing well.",
            "I had to go no contact with my parents for some of the reasons you labelled here. The patterns of abuse took me 20 years to realize, but since I have gone no contact with them, I have also had a decrease in both drama, and having to brace myself to snide remarks and disrespect at every turn. My quality of life has increased so much since cutting them out, and I am glad to see that yours has improved since making this decision. I'm still getting used to my Wife's family being so accepting and  helpful. It has taken me 5 years to grow even a bit comfortable with their help and company, as I keep expecting them to turn on a dime and lash out at me. It is posts like this that help me realize that I too made the correct decision, even if there is pangs of guilt at times. I'm happy for you!",
            "This is a pretty popular post, so I don't know if you'll have the time to respond. I just have a couple of questions. \n\n\\- Did you talk to the school about Jenny? Obviously, the mean letter that your sister wrote would have been too personal. However, did you address some of it, and say something like, \"Since I'm being gossiped about and not valued, I'll sub elsewhere\"? \n\n\\- And this is a question that you've probably asked yourself throughout the years: Why does your sister hate you and your late-father so much? Is she jealous of your education? Does she just hate men in general? Was she Ms. Cool Cheerleader and hated being associated with an uncool brother (if you were uncool in school)? \n\nI'm glad that you're doing better. Thanks for sharing your posts to the Reddit community.",
            "I didn't get to see your original post when it was posted, but reading through it I had a burning question -- how is your relationship with your other sister?  What does she think of this?  Your older sister implicated her in the email by saying it was her that pushed her to tell you all those things.  Is your other sister aware of this fact?  Have you shown her that email?\n\nAlso, very happy you are doing better after cutting her out of your life.  Lots of people who tell me they have issues with family members are always hesitant to do so and it continues to cause years and years of pain for them to not cut them out.",
            "Teaching is such a hard profession, but the best teachers are ones who teach with passion and teach from the heart. Thank you for caring. Best wishes on where life’s journey takes you.",
            "I just read your previous post and the message your sister sent you was sheer twaddle. Rather than speak to you directly as problems arose, the other teachers left the trouble you supposedly caused to pile up, by extension letting their pupils fall further behind and endure your pedagogic terror for longer? And then the first and only time you hear about it is from your sister who just so happens to be friends with one of the teachers? Did your sister expect you to believe this?\n\nShe cooked up an elaborate lie to cut you as deeply as possible. No wonder you've been better off without her!\n\nMinor complaint: I think you made a typo between this post and last because the ages don't add up. The post you made five years ago has you and your sister at ages 35 and 42 respectively, but 44 and 50 now.\n\nEDIT: It looks like you've already addressed the age issue. Fair enough.",
            "Just read your email for the first time. I can't imagine how horrible you felt after. Nothing constructive is written, all accusations and opinions to try and demoralise you. I hope you not only cut her out but brought it up with your boss. There is a reason why they called you back everyday and leaving notes is a way of showing you did what you thought was best and no teacher unless they were completely up their own ass would think otherwise. I hope you're still teaching kids every day and give them the tools to grow up and not become your sister.",
            "OP, your sister’s balls took my breath away. She was basically acting in a HR role that wasn’t hers, and, I suspect, at least 90% lies.\n\nSo glad the update was a good one!",
            "I read your old post and that was such a vile email. After reading reading it's nice to see you no longer talk to her.\n\n Someone once advised me to never accept painful criticism if the source doesn't have my best interest at heart. Idk who might need this advice but I'll leave it here just in case.",
            "I am curious too. Did anything your sister said have merit or was she just trying to read you down?",
            "Did you ever get to have a conversation with “Jenny” or the other teachers at her school that supposedly talked behind your back?\n\nI guess it’s better to have just moved on but I’m curious if that email changed how you interacted with your full-time colleagues at that particular school.",
            "I also have an older sister that sent me a nasty email.  At the time it was devastating.  I made very clear boundaries with her (basically: be nice to me or don’t speak to me) and she flipped out.\n\nI have found so few people to talk to about this problem. Most people say “but she doesn’t mean these horrible things she says” or “she’s family, just forgive and forget”. \n\nUnfortunately my sister has  this pattern of hurtful behavior.   She doesn’t believe that I have feelings or can be hurt?  I dunno.  But it sounds like your sister is very similar.  I have also cut my sister almost completely out of my life and things have improved so much.  It’s still painful, but not as bad as before I realized that I did my best, and everything else is on her.\n\nI totally commiserate with you and understand where you are coming from!  Thank you for sharing your story.  It’s so nice for me to know that I am not the only person with this issue.  (Sometimes it does feel like I personally failed in some way because my sister is a jerk to me every time she sees me).",
            "Hey, I read both posts, and 1st off, some people you have to love at a distance. She's abusive and she's family, but it doesn't mean its your responsibility to repair that relationship.\n\nOne thing I'm more concerned about: How did things go once you returned to teaching? I hope her email didn't discourage you from trying to do something that meant a lot to you.",
            "Kudos on you for wanting healing, getting it and not holding on to that garbage that spewed from the mouth of liars and that email. \n\nYou had to make some major lifestyle changes in order to get back to you so make sure you celebrate yourself. Your update actually makes me want to celebrate  for you 🎉😊💞",
            "After reading the email she sent you it seems that she oozes jealousy of you. I also find it funny that her friend who she said was “nice” was calling you unprofessional while literally talking about you to your family and not the people who could resolve these issues. Let’s just say assholes attract other assholes and you’re sister is one for sure.",
            "I remember your post from 5 years ago! It stood out to me because at the time I was a substitute teacher and now I'm full-time. You sounded like a great sub, which is really hard to find. I'm glad your law practice is doing well. Wishing you the best.",
            "Wow, that email was so hurtful and abusive I felt personally attacked just reading it. I haven’t read any of the comments in this thread yet, but I’m truly happy about your growth and personal success. Maybe one day your sister won’t be so evil and hopefully Jenny has eaten her words a dozen times over.",
            "That is honestly one of the nastiest messages i've ever read, its truly seething with hatred. I don't know why she despises you so but i'm glad she's no longer in your life. I hope you're doing better these days and i'm glad to read you're working through things in therapy, always a great step to take!",
            "I had not read your previous post till today, but although I don't have siblings I did have a \"best friend\" who was like that all the way through college. She actually used to provide notes of everything I did wrong when we were out in public, said I needed \"training,\" and generally just made me feel like there was something wrong with me that everybody but me could see. She finally did something so nasty that I stopped being her friend, and a few years after spoke to her for just a few minutes during which time she told me that I had a friend of her sister's in my class and that all the students hated me and that I clearly hadn't \"improved\" at all since college. I haven't spoken to her since. I have no idea why it was so important to her to make me feel like shit 100% of the time and whenever possible, but she can do that to someone else now. I'm so sorry you've had to go through this with a relative. :(",
            "I would have forwarded the email to Jenny and asked if there was any truth to it.   \"Just so I would know what areas I should be working on\".\n\nIf most of the email was BS (which seemed clear) then it would be fun to watch what happened.",
            "Your sister sounds like a hateful, miserable, spiteful cretin. She is most definitely not enjoying her time alive if that's the amount of bile she can spew at her own family. Disgusting creature. She should be ashamed of herself, if she has the emotional capacity required to feel shame. Pff. Glad you're ok now.",
            "My brother and I don't get along, but that email shook me. I would never send something like that to him. You did the right thing cutting her out and I'm glad to hear how well things are going for you ❤️",
            "Like many other people, I'm so shocked at the content of your sister's email.\n\nShe must be a really unhappy person to have to write that. So much meanness under the disguise of \"this is for your own good\".\n\nReminds me of my MIL who tells the most horrible things and then say : \"it hurts because it's true\". No meanness doesn't need to be true to hurt.\n\nI'm so glad you're doing better.\n\nThe best revenge is living a happy, drama-free life.",
            "Jesus.  After reading that original post I feel like calling my own therapist,  Your sister may lack credentials, but she has a Ph.D. tearing others down.  Glad you are thriving.",
            "Firstly, I am glad that despite it being bitter sweet to have to cut her out of your life (Bitter: She was your older sister, and family is supposed to mean something good - Sweet: You rid your immediate life of a toxic abuser), you're progressing and thriving forward.\n\nSecondly, I missed that first post but by Cthulhu what an insane, nasty, outrageous, unprofessional, hateful thing for her to send. All I can say if there was ONE word in her email that was correct, you would simply not be being hired as a sub teacher, let alone getting positive feedback at all from the kids or the schools.\n\nIt sounds to me like Jenny praised you to her, and this drove her insane with anger and jealousy, so she wrote that poison pen letter to you and made up a bunch of school-yard bully garbage because she KNEW you cared and would take criticism to heart. She picked every word carefully to be as nasty and hurtful as possible, striking at every good thing you did with care to make you feel as bad as possible. None of it sounds like any kind of legitimate criticism, it all reeks of hyperbole, jealousy & vengeance. \n\nIn fact, she's one of the top nasty people I've ever seen. She puts my ex-in-laws to shame, and they sent me a card when my mum died that read \"We're sorry to hear your mother passed away. And even sorrier you will never see her again in heaven because you will be burning in hell.\"\n\nI'm so glad you have been able to let her hateful nastygram go into the trash where it belongs. And I'm sorry you're related to her, thank goodness you're nothing like her. Keep filling your life with love & respect, you deserve it.",
            "I'm sure Jenny is a Qanon now",
            "I would love to know how the teaching (sub) job went. Are you back to teaching lawyers and judges? Is your depression better?",
            "Glad you cut that hitch out your life",
            "I'm glad it's all worked out. Honestly, if you were as disliked as your sister said then you simply wouldn't keep getting work!",
            "Glad you got that awful person out of your life!  Uhm . . . you've aged 9 years in 5 years!!!  I think you should see someone about that.  Just kidding of course (your stated ages don't match the 5 year span, but I'm sure that's for obfuscation).",
            "But....what happened with the job and Jenny and the other teachers? Was what your sister said true or just bs to poke at you?",
            "If there is a silver lining, even though it was a shitty situation it made you cut a toxic person out of your life, better your professional connections, and find success. I hope you are able to see that and be proud of yourself! There is nothing like showing a person who tried to knock you down that you are thriving.",
            "I didn’t get to read your post 5 years ago but wanted to tell you I’m so sorry you had to deal with that. I had to cut my family off but I did it a little younger. You will have good years ahead of you don’t get pulled in again. Best of luck.",
            "Did you ever speak to Jenny about her conversation with your sister?\n\nI'm glad things are all working out for you now.",
            "I am sorry you dealt with this. I have a very similar situation with a sister of mine. We have had many tiffs over the years but she always lashes out to an extreme and the last one she did I finally told myself enough and blocked her. I will not deal with her again. Like you I will most likely just see her at future funerals or force family events.",
            "You did the right thing. I have nothing more to add, except to praise you for your decisiveness.",
            "Tbh I would have gone to the principle directly and asked about complaints and how to improve if they had been confused I would have laid out the letter and name of the teacher and make sure they know I want to learn what I did wrong. Why? If Jenny was a thorough arse that's how you shoot her down. Then you can tell the school Ou would rather not sub anymore. \nIf it was a lie it would have backfired proper on the sister and deservedly so.",
            "Yeah you don't need that toxicity in your life. Me and my brother(26)&(22) are not compatible in the least. I don't where it went wrong but it never got better. And it doesn't seem like it ever will. Don't continue to fret over it. Go to therapy and live your life for the betterment of you. She doesn't need to be apart of your life as she isn't important and isn't what makes you YOU.",
            "Im SO GLAD you are free from her! She cant harm you if you dont let her. Dont ever listen to anyone who might tell you to try and have a relationship with this bitter, hateful person. You rose above, and you are awesome.",
            "I just read your original post for the first time and that email, wow...it was a punch in the gut.  I can't imagine what you must have been feeling after reading that flaming pile of garbage.  I'm glad you've been able to heal and move forward.",
            "I just read your previous post, yikes. Sounds like you did the right thing by ending ties with someone who has no respect for you and verbally abuses you. At the end of the day, she has to live with how horrible she is. Society likes to tell us that we need to love and be close with our family members, but it isn't as simple as that. Some of us can't sacrifice our lives to be abused at the hands of family members. Take care and good luck!",
            "Honestly it sounds like your sister is just jealous that you moved away and made something of yourself and all she ever had is a few kids.",
            "Thank you for the update and congrats.\n\nI am one of those people who does not have a relationship with their sibling. I've seen him a handful of times' in 25 years and we do not communicate. We are simply not compatible people and do not add value to each others day to day.",
            "I'm glad things have seemed to work out for you. After reading the original post, it seems like maybe your sister's friend was a lazy and incompetent teacher, the kind who does the bare minimum with no critical thought whatsoever. The question about sharp objects is a good example of this because, to me, I'd be inclined to agree with you and I would not pay it any mind. Even if I didn't originally catch it and someone else pointed it out, it wouldn't bother me because it's not about me personally. However, if I was lazy and incompetent with no critical thinking skills, and only looked at what the answer key said was the correct answer, then I'd have to go back and give credit to students whose answers I (incorrectly) marked as wrong. \n\n If there were serious deficiencies in your performance, you would not have been asked to come back to a school or your actual supervisors would have notified you of any problems. This person sounds like she just said that because having a teacher who actually tries makes her incompetence stark by contrast. \n\nI teach college students, and while this is a completely different demographic and experience, the types of people who tend to do best are those who are not afraid to appear imperfect, accept (constructive) criticism, and don't take things personally. Those that do terribly are those that like to feel like they have all the answers, are inflexible, unwilling to change and are immune to suggestion. Jenny seems like the latter, which makes me feel bad for her students because they are being intellectually handicapped by being forced into a classroom with her. \n\nI'm assuming, of course, that this is something Jenny actually said and not a bunch of nonsense your sister made up to be petty and evil.",
            "Good for you to get away from your sister. She is not good for you to be around. Such a bully. I honestly think the friend was wrong & unprofessional to talk to your sister like that. Your sister would have been in her ear for years about you so she would have had a bias to begin with. I would have contacted the school to discuss her behaviour. If she didn't discuss any supposed issues with the school so it could be addressed by them, she should not have done it via your sister that you don't get on with. You could have had a open and useful discussion with the school about your teaching skills and any changes that may have been necessary. At the very least the friend could be talked to by the school about dealing with issues and conflict through appropriate channels. She is a bully too and shouldn't treat others this way",
            "I am the oldest of four siblings. My sister closet in age to me passed last year from ALS. We were four very distinct from each other personalities. I have always felt closest to my youngest sister as I feel that we have more similarities than differences. That leaves my brother, and boy do I have some stories about him, and I've simply felt all of my life that he's just as asshole. I really don't like to be in the same room with him. So I do understand that not all siblings get along. And for context, I'm the oldest male.",
            "Kind of curious; Did you ever talk to Jenny about what your sister wrote? I know you said in another comment that you had gotten feedback from other teachers that basically invalidated what your sister said but I’m curious if you found of if Jenny even said anything to your sister at all and she was making it up.",
            "Yea what a psycho. Seems like she was totally projecting her small town ideas onto you and is jealous of your smarts and brain. Good for you on your success. \"The best revenge is success",
            "Same with my brother, he's a bit of an asshole, we get along cordially. But not close by any means. \n\n> realized that basically, despite our biological similarities and having been raised in the same household, we are simply not compatible people.",
            "How were you 35 in the first post, but 44 in the 2nd post if its only been 5 years? Something doesn't add up.",
            "Just adding to the pile of people curious about how much of that email was a truthful representation of what Jenny said. Is she as toxic as your sister or did that email fabricate the entire story from thin air?",
            "Thank you for writing this and following up. I, too am the youngest of 3 kids and have experienced something very, very similar. I've also cut the toxic siblings out, and although it's been hard, it has been helpful overall. Great work on your own self-care. Big hugs.",
            "I'm another person with toxic siblings and I just want to applaud you for working hard for yourself. You and I seem similar in that we want to ensure that we are in no way \"in the wrong\" and improving behavior from there....but that leaves an open door for toxic people like your oldest sister and my siblings. It's hard to walk away and go no/low contact, but it is important for mental health. \n\nI am proud of you for knowing your true self and working relentlessly to persevere despite attempts to throw you off track. Kudos to you!",
            "I'm so proud of you. I felt crushed reading your sisters original email. The intention in there to hurt you deliberately was horrendous. You've come a long way since then because of YOU. Well done you,  you deserve this great life you are making for yourself.",
            "I'm glad things have gone well since cutting her out. I cut out an abusive sibling a few years ago and people are constantly telling me I'll regret it / Siblings are allowed to be shitty with no consequences because blood. It's nice to see someone else who doesn't regret it.",
            "Its beautiful that you shared this. Thank you for a window into your world, it seems like you are doing your best against big battles and i think that is magical",
            "Again. LOVE these “many years later” updates. 🥂",
            "You rock OP! I’m proud of you. From someone on the outside, with no dog in the race, I can tell you that your sister is vile, jealous and you simply deserve so much better.",
            "Huge congratulations to you!",
            "Omg. I read your original post. I just have to say, that was all crap. I'd kill for a sub like you! No school calls you back every day if you aren't amazing. Follow your gut, she is full of it. I'm sorry you went through that, but I'm really glad you are taking time away from her. I think that sounds healthy for you.",
            "This story is DISTURBING. Teaching is a matter of the heart and to be viciously torn down like that....I don't know who could do something like that. I'm trying to imagine a situation where I could possibly be that distributed by the work of a sub. when I am not there, the sub teaches a lesson and when I get back I move on. Many subs do not follow the lesson plan I left and I've never cared. They're there do be the teacher for the day, not to advance my curriculum. \n\nIt sounds like you've made a great recovery and done wonderful things. My heart is with you.",
            "Look not to sound like a misogynist but your sister is a bit of a c*** mate.\n\nWhat type of human being relishes in the suffering and down trotting of their sibling?\n\nLike fr you seem like such a nice chap and hope you are doing well.",
            "Wow! I have to be completely honest, I clicked your link with a poor attitude thinking you were likely boo hooing over nonsense. I apologize because I was WRONG! What your sister sent you was terrible, absolutely terrible. It actually saddened me to read it. You do not deserve such toxicity in your life and I am glad that you have come to realize that as well. You keep being you and take her words for what they are, pure ad utter trash!",
            "What you said about your sister really resonated with me about my toxic brother and his wife. It really described my relationship or lack there of, very eloquently. I wish you all the best. Thanks for updating.",
            "Am I the only one who thinks it's weird that OP didn't really address any introspection whatsoever - focused entirely on her sister being a bad person - and everyone is just fine with that? \n\nYes the critical email was over-the-top, but it seemed like there might be some stuff worth addressing in there?",
            "How, in 5 years’ time, has this person’s age increased by 9 years and his sister 7 years?",
            "What thread inspired this?",
            "if she genuinely cared about you, she could've just said \"hey brother, jenny complained about your substitution. i suggest being mindful you don't change the teacher's established lessons or grading scheme.\" that's really all that needed to be said. \n\nyou were constantly called back to the school, that's proof you were doing more right than wrong.\n\nhappy to see that you're doing better in your personal and career life.",
            "I also would like an update",
            "Isn’t Jenny the one who meets men in hotels for kisses and to touch penises?",
            "So wait, you cut her out, so I guess the email she sent wasn't true then? Did your sister make everything up or was Jenny just as mean as her and did she actually say all those things? Did you confront anyone and if you did, what did they say?",
            "Wait. Did you get teaching feedback?",
            "I (69f) also went NC ten years ago with a sister. Basically told her unless she went to therapy with me, I couldn’t see her anymore. \n\nShe declined.",
            "Did you ever talk to Jenny or the school about what was said in the email? I’m really proud of you for not long that terrible email stop you from returning. I dont think i could have done it, but you proved your sister very wrong and didn’t let her break you. So proud of you OP",
            "It was funny to read how teaching who get paid to communicate information let it build to such a degree without even telling you to your face. I can understand where they're were coming from but seriously all they had to do was coordinate a little better",
            "Wow that was a really shitty email she sent you. I was a bit confused tho, did you ever confront the teacher? I'm kinda shocked it came from a sibling tbh. Glad you cut her out, no one needs that shit",
            "Sis was a C u n t sorry. Deserved a bop on the nose. That was an awful lot to be able to reel off just like that hm? Considering it came from other people you'd think she'd not be able to remember all that eh?\n\n\"I don't like you, am jealous, you piss me off\" would have sufficed.\n\nI'm really glad she's not allowed anywhere near you anymore and I'm not at all surprised you're doing so much better. Sis was a bully and no doubt has done that to many people.\n\n\"other people think\" usually means no one except me thinks.\n\nSo happy you're happier now",
            "I'm really sorry you had top go through all that and I'm really happy you found your way to healing. \n\nI read this awhile back and I think it's great advice, \n\nLet's get out of this habit of telling people well:\"that's still your mom. That's still your dad. That's still your brother. That's still your sister\".\n\nToxic is toxic whether it's family or not. \n\nYou're allowed to walk away from people who constantly hurt you. You're allowed to walk away from people who've abused you. You're allowed to walk away from people who don't love you. You're allowed to create boundaries. You're allowed to choose your breaking point. \n\nStop encouraging people to deal with toxicity and drama.\n\n(Lessons taught by LIFE)\n\nHope it helps! Sending your way positive vibes, best wishes, blessings, prayers and a huge virtual hug.",
            "This hit the nail on a bit of advise a good friend had said to me. “Cutting toxic family out is one of the most difficult and painful things you will experience but it can be one of the most, bitter-sweet, rewarding things that can happen to you.” Your work speaks for itself",
            "Sounds like one or two of my sisters. I am really sorry that you have this experience as well. Always remember that \"family doesn't end with blood\". You can make your own, with people who will actually care about you and that you want to spend time with. \nBest of luck to you!",
            "How did you go from 35 to 44 in 5 years?",
            "Good to know that you are well\nBut did you not tell us , what did you do next? Did you talk to her? Did you talk to Jenny? What happend?",
            "I’m so confused about how you aged 9 years",
            "Never saw the original thread but duck those people. Being supportive would include helping you develop as a teacher, not being mad for knowing scissors are sharp.",
            "that original post was infuriating. i've been a position where i had to organize subs for a few private schools and if anyone complained about a sub like that they would not be called back unless absolutely necessary until I had time to retrain them and observe their progress. After that I would be called in to observe the classes they're subbing and give feedback. There would be a meeting with teachers about constructive criticism and communication with subs.   \n\n\nteachers are always thankful for subs. It's really hard to get time off to do normal shit like go to the bank. \n\n&#x200B;\n\nsorry you had to go through that but glad you are doing better. I know after getting messed up feedback teaching becomes so much more stressful with all those eyes on you and wondering what might be said behind your back. that being said it's easy to tell if elementary students like you because they tell you.",
            "Did you ever talk to \"Jenny\" or anyone else at the school following the message from your sister?\nI just came back from reading your old post and wondered what parts about her message held any grain of truth.",
            "Wow I just read the message your 'sister' sent you in the original post. Absolutely unbelievable! I'm genuinely happy for you that you've cut her out of your life. Good riddance I say! I don't know you but I wish you all the best :)",
            "Wow man, I just read that email in your older thread and it made me feel so fucking bad even though it wasn't even about me. That is one of the most hateful things I've read. The absence of any anger, the calculated way the email was written to hurt you... wow man. I am so sorry you had to go through that. What the fuck is wrong with your sister, I am so happy you are nothing like her",
            "Glad you are feeling better without your sister in your life but can you share any progress you made in your academic career? Did you continue teaching?",
            "Seeing the original post for the first time and, damn... brutal. But honestly, all I could think was about how they said you needed to be a \"professional role model\", and yet these teachers were talking about you behind your back, making up names, laughing/mocking your notes... kinda seems like bullying to me, and thats harmful to impressionable young kids if they were to ever overhear things. The teachers are the ones who need to grow up and be better role models.",
            "Glad to hear you're doing good man. I have an older brother who's very similar in terms of abusive behavior (and we were best friends when we were little, until our parents divorced and I was stuck living with my dad until the age of 14, so it makes it feel more personal tbh). I just do my best to ignore him and have little to no interaction with him. If one day he reaches out for forgiveness, I'd probably try to rebuild that relationship with him. I hope your sister does one day reach out for forgiveness. Best of luck, u/sisterissuethrowaway !",
            "I have a similar sounding sister, I think she could be jealous of me, but she is also very critical and arrogant of others in general and always acted like I was deliberately annoying her by existing. I’ve never rubbed anything in her face, she was always the confident charismatic one at family events, I was a quiet bookish figure in the corner.\n\nWhen I cut her off I thought look, this person doesn’t even like me, let alone love me. I’ve had enough of being shouted at and criticized. \n\nI feel some regret at what will never be but mainly I feel a huge amount of peace.",
            "And people say this sub sucks. Smh",
            "went thru the 1st post. I will keep it short. your sister was crazy to send you that. the Jenny is probably doing the same course outlines as 5 years ago. schools indoctrinate the youth, and you cant actually help a kid by being a \"good\" teacher. most of the stuff taught , is lies. besides math, gym, maybe ela, most stuff is based off lies or pseudo science. You're lucky to have found another job. learning the law is much more useful. Anyhow ,those people are psycho paths , trying to making you feel like shit, embarrassed, confused, who knows. You were just trying hard. but dude, the outlines are outlines. teachers are all actually fn idiots, no brains. just repeating what they were taught and brain washed with.\nTry to fix the relationship with your sister. But maybe try approaching her. maybe put it to her like this. The teachers of that school and Jenny don't need to come between you and her. Well, quite clearly Jenny is her best friend.... and she is either jealous of teachers or Feels that her own job is inadequate and her own accomplishments are bare. this is such a big topic actually and I can go on forever. but I want to affirm to you you made a great choice becoming law guy. and ditching school. and you are a good dude for trying to help the community and starting with the kids in school. but understand this, schools are dead zones and they're poisoning kids minds with lies anyways. and the teachers are depressed, ill, unhealthy people themselves teaching them, and either the kids don't even wanna learn chz they're brain dead from their Shit diet, their own depressions,  and more, or they just Aren't interested in the stuff being taught because its all bologna. or baloney. affirm to yourself you tried and succeeded. But whatever those teachers said , or whatever Your sister said Jenny said those teachers said, doesn't GO. its all baloney. those depressed ass teachers 5 years ago are where now. still brainwashed themselves, reiterating bullshit to new kids,who still don't care. hhahaha and its actually scary our youth and our children are being poisoned in the mind , indoctrinated, at public schools, because they are sent there, BECAUZE us parents or the parents of these kids can't teach their own. Don't ever feel bad because you \"failed\" in a \"field\" that itself is corrupt and sick. Still, i would recommend trying to fix  the relationship if you're really considering fixing things with your sister,even if you want her to approach you. she won't approach you, women don't approach men after a fight, no not even your sister. so ,you say you're open to her Coming to you and apologizing, NOPE. NOT HAPPENING . but my friend that is your sister, so its actually UP to  YOU to fix it. If she is stubborn let her go tho. \nI got a notification for this feed and felt I had to tap in. stuff like this pisses me off.\n\nTruthtrekker @IG",
            "There is absolutely no reason someone should send another person comments as malicious as that email, it’s not constructive criticism - it just makes the receiver feel like they should give up on everything. I’m glad that you’re continuing to be a rockstar, screw the haters.",
            "i've never heard of someone as miserable as your sister"
        ]
    },
    {
        "post_id": "9xlpzb",
        "author": "throwawaqy3376",
        "title": "[UPDATE] How can I [19f] talk to him [20m] about our sex life?",
        "url": "https://www.reddit.com/r/relationships/comments/9xlpzb/update_how_can_i_19f_talk_to_him_20m_about_our/",
        "score": 5856,
        "num_comments": 189,
        "created_utc": 1542371137.0,
        "selftext": " \n\nAlthough my [original post](https://www.reddit.com/r/relationships/comments/6ddj8r/how_can_i_19f_talk_to_him_20f_about_our_sex_life/) didn't get much attention, it's been about a year and a half and I thought I'd give an update. \n\nWe broke up. In my original, I stated that our relationship was otherwise 'fine', but I see now that I had been deluding myself. My boyfriend never treated me right, and used me more like a mother (did all cleaning, cooking and organising... yes, I made his doctor's appointments). One of the few times he could bring himself to have sex with me, my period started unexpectedly (*really* unexpectedly, as my implant meant I hadn't bled in two years!!) and he continued to bring up how 'disgusted' by me he was for months afterwards and used it as a reason that he couldn't have sex with me.\n\nSo what was the real reason for the abstinence? He was cheating, of course! Found that out after he got stupid drunk at my mother's house, puked everywhere (I cleaned it up) and I tucked him in bed and put his phone on charge... which made the screen light up, and there was a text from her. I got the hell out of dodge and moved in with one of my best friends and his girlfriend.\n\nNow, I'm happy to report that after some dark months of dealing with my first real, painful break-up, my life has been moving in an upward trajectory! I found a much better job, my social life isn't confined to the friends of my partner who hate me, and I have a boyfriend of 9 months who never lets me doubt that he loves me. Guys, he can cook and clean and I don't have to call his doctor or mobile provider. I am so happy. Please, if you feel like you aren't being loved and respected in your relationship, GET OUT OF THERE!! I guarantee someone out there will treat you like a human being!! Thank you to the few who commented, it made me feel better about a shitty situation at the time.\n\nOh, and my current squeeze never lets me go more than a few days without some lovin', so that got better too ;)\n\n**TL;DR** he cheated and it sucked, but not really because he was an awful partner in hindsight. new man much better and my life is more fulfilled :)",
        "permalink": "/r/relationships/comments/9xlpzb/update_how_can_i_19f_talk_to_him_20m_about_our/",
        "comments": [
            "I'm very happy for you. You learned an important lesson earlier in life than a lot of women I know. Congratulations on not wasting more time on an unfulfilling relationship. I think very often all you need to do to be happier is lose the dead weight and make space for the good stuff.  \nKeep on keeping on :)",
            ">Please, if you feel like you aren't being loved and respected in your relationship, GET OUT OF THERE!! I guarantee someone out there will treat you like a human being!!\n\nA thousand times YES!!!!!!!!!!!!!!! God I am so glad you got out of that bullshit relationship. Congratulations!",
            "[deleted]",
            "It’s awesome to see some positive news for a change, \n\nHope your man keeps up the good work, you ladies deserve the world. \n\n",
            "So glad you saw the light and found a good PARTNER! Yay! It's lovely when you can face the world as a team. So happy for you!",
            "The best thing you did was break up with him ! I'm happy you moved on and that you are happy ! Take care of yourself and never stay with somebody just because .",
            "This is so pure! I'm so happy for you, and glad you got over him! \n\nAlso, no man should be disgusted by your period, it's natural. I also have the implant, and it's made my cycle CRAZY! But it's not a barrier for my intimacy with my partner. I'm glad you found someone new, who sounds like he really loves you! \n\nYou go girl!!!!!",
            "I've never understood this weird mentality of making a women feel bad about her period. It's a little blood? So what? Men who are grossed out by that need to grow up\n",
            "so glad to hear you’re doing well and ditched the asshole, you deserve better!",
            "Glad it all worked out! Also I love \"squeeze\" for a partner, it's so underused.",
            "I’m so glad everything worked out and that you’re happy now! This was a very positive update and I wish you all the best in the future ☺️",
            "Very happy to hear things have worked out well for you! Wishing you all the best for the future as well. :)",
            "I am happy that you could handle your previous situation well. And moved on with your life. Hope that your current relationship keeps going.\nNow i need to find someone...",
            "As someone going through an unexpected breakup currently, I can relate to the whole process of realizing things weren't as great as you thought they were. This post is giving me hope that I will end up being okay in the end, no matter how much everything sucks right now. ",
            "This happened to me at 19 which was almost 20 years ago. My boyfriend  always seemed angry with me and he cheated a lot. He was a bad person to the core, inside and out. He used drugs and pawned my class ring. He took advantage of who used to be my best friend while she was drunk. Ran off with an ex girlfriend one night to God knows where. He claimed to be visiting his sick grandma at the hospital. This ex started showing up at his house randomly with me there.  She was obviously angry at my continued presence. I’m sure he told her he would dump me. \n\nThis guy was mean to his dog and cat which I took with me upon conclusion of the relationship. I was so gullible and naive. I remember finding a girls sock in his bed and shrugged it off. I wanted to believe he cared for me. Karma got him. Apparently he was screwing an underage girl a couple doors down and was convicted of statutory rape. He is now a registered sex offender and still an all out looser. \n\nI soon began dating a guy he worked with after he was arrested. He told me everything he knew and I felt sick. He sincerely seemed protective of me then and even when I was still with looser. I kept thinking of that sock I found. He showed up at my house with flowers one day and we attended his court date together hand in hand. Looser saw us and I felt a twisted satisfaction seeing him stare angrily, shackled and unable to do a damned thing. My new guy took the dog and I kept his cat. I took other items to help recoup all my losses from his place with the help of another nice guy who was an acquaintance of his but on my side. I  didn’t stay with the new guy but he did treat me well. I remember running into looser’s grandma at the store and she chastised me for abandoning her grandson saying he wanted me to visit! Ha! No ma’am. I went on to get an advanced degree, a good job and my own everything. I’m now engaged to another awesome guy. \n\nSo yes. Listen to your gut. I never felt any grief for him after all that. It was like a bad dream I woke up from. I just regret ever crossing his path. He sent me a friend request on fb a few years back. Ohh no. Absolutely not. \n\nSorry so long but this is the first time I ever wrote about this. ",
            "Glad everything worked out, it's great to hear some good news so early in the morning",
            "Thanks for the update and for sharing your experience. I’m so sorry that he was cheating and you had to go through that hurt. Glad things worked out for you! ",
            "Thank you so much I needed this, I was just in a very bad relationship and trying to let go is hard this has definitely given me hope though. ",
            "So often people will come in here and be like \"my boyfriend doex x but our relationship other than this is perfect so please don't tell me to just dump him\" and it always gets me because like, you knew we were going to tell you to dump them. You knew that, because deep down you know that other people wouldn't put up with what you're putting up with, and for some reason you believe that you should. What is that reason? Low self-esteem. And then usually the issue they post is a pretty big red flag for other issues that they are ignoring, much like in yours.\n\nIt's never just about the issue they post about, it's about the issue that's causing the issue they post about; their partner doesn't ever do the dishes? It isn't about the dishes, it's about the partner not caring enough to do the dishes etc\n\nNo one believes in dumping someone over unwashed dishes. We believe in dumping someone for being disrespectful",
            "Oh my god he sounds horrible, good for you and congrats on the new partner!",
            "Great update! \n\nMore importantly, good advice for others ",
            "This post makes me really afraid because your original post reminds me of my current situation. Boyfriend claims to have no sex drive because he’s depressed and never gives me attention.",
            "As a guy I’m disgusted by your first boyfriend. So glad you found a real man. ",
            "Thank you for the update!  Glad you were able to leave his cheating ass behind.",
            "Good for you! Good luck!",
            "Yay!!!! I’m so happy that you’re so happy now! You deserved it, and found better! Ayayyaay",
            "Congratulations on making better choices for yourself! I wish you all the best!",
            "the whole \"periods are disgusting\" mantra really pisses me off. My last girlfriend freaked out and started crying the first couple times we slept together while she was on her period, because she had been conditioned by other assholes she had been with previously about how \"gross\" it is. Eventually she got past it with my continual assurances that it isn't an issue for me what so ever. \n\nIt is just so disappointing that this seems to happen to so many women. These guys need to grow up.",
            "Almost the exact same thing happened to me! You go girl",
            "I'm really happy for you OP. I admire your confidence and ability to walk away immediately when finding out about being cheated on. I wish I had your strength when I was your age. It took me years of strengthening through life experiences to get to where you are. I'm 33 now and have been with my man for 9+ years and if he cheated, I would be gone just as fast as I could possibly get away. I know I deserve what I give in a relationship. I'm happy to have learned that and you sound like you feel the same. Blessings OP.",
            "Having sex, being loved, and making more money? Uh girl you living life ",
            "Last time I came home drunk I was told not to wake my wife up and sleep on the couch lol. Don't remember the last time I was tucked in and all my phone charging is done manually. \n\nYou're a keeper, im glad you're out of there there's a guy out there who will appreciate all you do.",
            "I will never understand why women stay with such losers...",
            "I’m so happy you were able to make that decision for yourself, and now look where you are! ",
            "It’s good to read good news! Best wishes in your new relationship and everything else! ",
            "YES, GIRL, GIT IT!\n\nSo happy for you. It’s kind of weird how we don’t realize when we’re being treated badly... sometimes it happens so gradually, other times we just really want to be in a loving relationship that we ignore all the signs. I went through my break up and haven’t yet found my next partner, BUT I’ve been hanging out with this one guy who is very different than my previous partner, and it’s cra-zy! Like, “oh what, why did I even put up with that shit?”\n\nNow I’m more vigilant of myself and the ones I date. Trying not to make the same mistake again!",
            "I'm so happy for you that you got out of it!! All those dark months led to prince charming.\n\nAnd thanks for making sure other people know they can get better than their toxic relationships too!",
            "Wow this feels like a story of my life last year(including previous story)! Now I'm where you are now?! Hello are you me?\n\nGlad to hear you're doing great! ",
            "It sounds like that last relationship was a bit codependent. Good job for getting tfu.",
            "I'm so glad you got out of that relationship. If your needs aren't being met despite trying to talk to your partner about it and encouraging change, a solution, and compromise, then *leave.* Life is too short. I'm happy you found that out at a young age.",
            "This is so inspiring, thank you for sharing ",
            "GOOD. Good, good, good.",
            "Had this exact same thing happen to me and guess what! He was a cheat!  Things are so much better and I found the love of my life now and I’m so much happier xx",
            "So happy for you! I just got out of a very similar situation and am now with the most wonderful person I can imagine. It still blows my mind when he does the small things like scrape ice from my car or cook me dinner or deal with the dog all without asking or telling but just because he loves me. The addition of dynamite sex has been nice too :P Glad you learned what a nice relationship can be, took me a bit to figure that one out",
            "Yasss live your life!! X",
            "I'm so happy for you!\n\nI'm sorry you had to deal with that first urchin, but it just makes the new guy shine even brighter by comparison.",
            "Great news and thank you for the update. Wishing you happiness and realize you now know your worth. ",
            "So happy for you girl!!",
            "Omg I'm so happy you arent with him. People who treat their partners that horrible dont deserve a relationship with a caring person like you!",
            "Congrats!! I just got out of the same situation where I was a sole provider of the household and does everything for her, taking her everywhere she needs, handle all her legal adult stuff that she should be doing it herself. She does nothing but play video games all day and I caught her cheating sending detailed erotic messages to some guy she plays online game with. After we broke up, she hooked up with him a day after. It took me a month to get her out of my apartment and have her name off of my lease.",
            "This is a great update. Yours is exactly the update that I want to point people to when they post here about their crappy partners and relationships and say \"see, it will suck briefly but it will get so much better, and then you will wonder what took you so long!\"",
            ">One of the few times he could bring himself to have sex with me, my period started unexpectedly ... and he continued to bring up how 'disgusted' by me he was for months afterwards and used it as a reason that he couldn't have sex with me.\n\nYou were dating a boy. I don't find blood sexy, but to be disgusted?\n\nHe knows where babies come from, right?\n\n",
            "Motherfucker. Good riddance, take some time to heal and get back on the horse. Just not the same horse, pick a nicer one.",
            "Real men run red lights.\n\nSeriously OP, good for you. I've been a bastard and a dog in my life and have turned it around to be a real, genuine partner in my current relationship (and in my life in general), and know what you were going through. I've been on the shitty side of your situation, and didn't deserve the love I was given. Your new man sounds like he treats you how you should be treated, and I wish you the best of luck.",
            "Yay! Love this update. Good for you for being in a good and loving place now! ",
            "[deleted]",
            "I soooo really needed to see your post now!!\n\n&#x200B;\n\nThanks a lot!",
            "he sounds like shit toast and you upgraded to a better you AND a cheeseburger",
            "You moved in with his girlfriend? Did she dump him too?",
            "I’m so happy for you!! Congrats!!",
            "I’m happy for you!!! God bless!",
            "All that you did for him and this is what you got. Go figure",
            "I am so glad to read a real life story with happy ending. Kudos to OP.",
            "I'm glad you got rid of your very unwanted man-baby.",
            "[removed]",
            "9 months is a bit fast to love someone. Don't get in too deep too fast.",
            "Damn, this really made me feel like shit :( \n\nMy boyfriend has been constantly rejecting me and making excuses for six months. I feel so ugly and stupid. \n\nI always feel like it’s my fault. Like there’s no way he’d be turning me down this much if he was actually attracted to me. The thought of him cheating on me makes me want to walk in front of a train.",
            "This is the update we all hope for. \n\nIt should be the outcome for innumerable posts here.\n\nCongrats!",
            "I'm glad you've moved on from the slime bag. Onward and upwards :) ",
            "Thanks for the update.  Many times, there are suspicions that someone is getting sex from somewhere else, but we can't ever really conclude that if the OP doesn't mention these suspicions or signs of evidence.\n\nSo it's interesting that the result of his lowered sexual interest turns out to be that he was getting the sex from somewhere else.\n\n",
            "So happy for you. I'm glad you have the self respect to walk away from a relationship like that. \n",
            "I'm so glad you learned early on that you had to get out and find someone who treats you right!!!",
            "See for me my wife always gets mad when I try to take over or help with parts of the chores around the house(she’s OCD), so that means I can never do anything the “right way”. This makes me feel like I’m being “babied” sometimes. And in regards to the sex part... my wife has almost no labito, and we have gone with almost 2 months at some points without sex and it kills me. Since I have a very high sex drive.\n\nI’ve come to the point where I want to ask my wife if I can just sleep with other women... because no matter what I do I can’t do anything. And she tells me “try this or maybe this”(things that I have tried in the past mind you) and still nothing. I can’t cheat on her because I know if she cheated on me it would be devastating, so I can’t do it at all, although in my darkest times have thought of it when some women actually show interest in me. Idk it’s all fought I guess.",
            "Thanks for sharing. Good to hear that you were able to find someone who appreciates you. Your post is encouraging, as my last gf cheated and was a real jerk. I’ve since struggled to imagine myself finding someone who will respect me, but your story gives me hope for myself. I’m sure eventually I’ll look back on everything and laugh at how ridiculous those times were, as I’m sure you do whenever your remember that ex-be. Always happy to hear when good people are able to overcome something like that and find real happiness. ",
            "Anyone in that \"need a change\" category OP speaks of? I know how to cook and love to assist in yoga sessions :)",
            "For the record girls, men have a biological imperative to ejaculate multiple times a week. We all as a group, prefer to get that release through sex if it’s available. So if a man is turning you down, 1) he’s cheating or 2) the sex is bad. Those are the only 2 reasons a man rejects sex. Now, number 1 is obvious. He’s getting the need met so he doesn’t need it. But number 2? That can be because you’re bad or because he’s insecure about his own abilities. Different roads to the sex being bad, but ultimately the same result. ",
            "Wtf is this crap? Sex life?? Your friggin 20 year olds, go work at a restaurant or something sheesh.. the world IS coming to an end !"
        ]
    },
    {
        "post_id": "bww1d5",
        "author": "Iheartyoutoo",
        "title": "[Update] I [38F] think my marriage to my husband [42M] is over. I need help.",
        "url": "https://www.reddit.com/r/relationships/comments/bww1d5/update_i_38f_think_my_marriage_to_my_husband_42m/",
        "score": 5851,
        "num_comments": 191,
        "created_utc": 1559692966.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/92333u/i_38f_think_my_marriage_to_my_husband_42m_is_over/)\n\nWhile my original post didn't get a ton of feedback, I thought I'd update. \n\nAbout a month after I posted, I asked him for a separation. He agreed. I moved out and I've got my own place now. I thought maybe moving out would be the wake up call that was needed to save the marriage, but it wasn't. However, it turned out to be the best thing for all of us. \n\nWe share custody of our children, and they transitioned to public school and are doing very, very well. \n\nI'm doing pretty well, too. It's been hard - and there have been a lot of ups and downs, but it's been worth it. We're all so much happier now, and my ex and I are working really well together to co-parent our kids and we're even friends. We'll always be there for each other, but we're better off apart. \n\nNot the happy ending that I was hoping for, but a happy ending nonetheless.\n\nTL;DR: We split up, things are good now.",
        "permalink": "/r/relationships/comments/bww1d5/update_i_38f_think_my_marriage_to_my_husband_42m/",
        "comments": [
            "Good for you. Happy endings are when people are happy, not necessarily staying together.\n\nEdit- Thanks for the gold anonymous benefactor!",
            "Speaking as a child of divorce:\nHappy single parents are better parents together than miserable married ones. I'm glad it turned out that the difficult choice was the right one for your family. Best of luck.",
            "sometimes what you hope for isn’t always the best case scenario. i’m glad you’re doing well and i’m glad that it ended up all okay.",
            "After reading your original post, I'm proud to hear that you made your stand and stood your ground. Many don't. Here's to you and to the world of possibilities you've opened up for yourself. Well done, ma'am. Well done.",
            "Emotional abuse is definitely a thing. Someone who loves you should never be threatened by newfound confidence and empowerment. You’ve gotten through the hardest part, and now you can continue to do what has lifted you up recently, with no backlash from home. You are so strong!",
            "Did you finish nursing school?",
            "I read your previous post before commenting. I'm sorry things didn't pan out as you hoped. But I'm glad that you and him both are at a better place emotionally now. He refused counselling and didn't want you to be able to fend for yourself. Major ego issues.\n\nYou saved your kids from resenting their father fully. My folks tear into each other over the most minor of things. My mother has given up so much for us and he never appreciated it. We're all grown. They are still together. We talk to him and have a relationship. But we all on some level resent how he treats our mother. We all hope we never end up with people like him or become him. \n\nI wish you strength, inner peace, and happiness to brighten your days. You are an amazing person like my mother you sacrificed and did what was best. I hope he gets help for how he views things and works on himself at least for the sake of his own mental health if not anything else.",
            "this is almost my exact situation. divorced, but still see my ex regulsrly and co parent just fine. We both go to their sporting events, and we even sometimes all go out for pizza together and stuff like that, but she has her own place and I have my own place. works out pretty well so far .\nAlso, we are close to the same age and both have kids with 50 50 custody. if you ever want to just chat, let me know:)",
            "Keep your head up. You mentioned you're still Kinda friends which I think is a good thing. You've made a lot of improvements to your life as you said in your first post. I hope you can continue to do so.\n\nIt's gonna be hard, but you know that already, but take your time and your life will shape for the better. Keep improving yourself.\n\nThanks for updating your post! I wish you the best for you and your life!",
            "I hope things continue to transition smoothly for your family. My ex changed when he got involved with his current wife. Fingers crossed that isn’t an issue for you. 💛",
            "I’m sorry, but I’m happy for you non the less. \n\nSometimes people come into our lives to teach us things... it can be super hard to know what that lesson is, i hope your happiness continues to blossom",
            "I read your original post and OP I am so glad that you separated and that you're happy now.\n\nEmotional abuse is hard to live through so it's heartening to know you're good and going strong.",
            "I am glad that you are taking this well. Wish you the best luck!",
            "Just went back to read your first post...  Hard to fathom that he couldn't handle something so common as a wife who works/is active.  How can he rationalize such a nasty trait?",
            "At least you and your former husband are still friends. I can't really say anything to console you, but I really don't think it's necessary. It sounds like you've been doing a lot better since it happened, and I'm happy that you're doing better since the initial breakup.",
            "Me and my ex are about in the same boat. I like to think that my actual divorce process was probably the most boring divorce ever, but boring is good. We are probably better now than we ever have been... just good friends making sure the kids always come first. \n\nAll this said, it took a long time (2 years) to get to this point... from absolutely hating each other and being at our lowest, to being sad when the divorce was finalized. I'm sure we'll have our ups and downs as we raise our children together but separate. I never wanted to be divorced, but at this point it's the best thing for everybody. Glad to hear theres others out there like us!",
            "In your first post you sounded so sad and dejected, I like the tone of this one much more! So happy for you that you got out when you did and are better for it <3 \nAlso, as a kid of divorced parents I can tell you I bet the kids are grateful too (or they will be in the future depending on how old they are)",
            "Weird how in your last post you said he was afraid you won't need him anymore (regarding your independence) and that behavior was exactly what pushed you into not needing him anymore. \n\nI'm glad you're happy now! I hope things stay good for you.",
            "[deleted]",
            "I'm glad that you are happy! You made the right decision, he was not being the person he should have been and was borderline abusive. Have a great life!",
            "[deleted]",
            "I am sorry about your marriage. I recently went thru the same. My husband has quickly moved on and found another place to live with another woman.   I feel heartbroken but there is nothing I can do. I hope you do not have the regrets I have. \n\n\nI am not trying to impose on your post...what is tl;dr??  I have seen this several times and I am usually good at figuring things like this out. This gets me tho.",
            "Good luck with everything! It feels rough now but it will get better. Praying for you, internet stranger. ♥️",
            "I'm sorry this happened. I hope everything will be better for your family from now on. It's hard, I'm not going to lie, but I hope everyone will be happy and healthy.\n\nAlso, congratulations on standing up for yourself. I don't know you, but I'm proud of you. Seems like you enjoyed your recent study and work. Wishing the best for you.",
            "I love this!! Sounds like my story. My children, my ex and I are all MUCH happier now that we are separate and co-parenting! There have been a lot of ups and downs but we have kept custody and child support out of the courts and even all spend time with together as a family (new significant others included!) on special occasions. Good luck to you all and way to go for taking the leap of faith!",
            "Yeah, I learned a long time ago that just because you love someone, does not mean you should be together. Sometimes your both just better off. My ex and I have a kid together and are great friends; it just didn't work out, and that's ok.",
            "As someone who wishes my parents had divorced when I was younger as they obviously weren't happy (and mine is not a lonely camp), you made the absolute right choice and it's the happiest ending for your kids. Now they'll grow up understanding that it's okay to advocate for a healthy relationship rather than seeing two parents who don't work and thinking that's normal.",
            "Good for you! And I have to say, it's also the best thing you can to for kids, split early and be happy with each others.\n\n(Forgive my bad english :p)",
            "I decided I’d comment even though I’ll get downvoted a ton.\n\nSomeone made a comment that it isn’t the 1980’s anymore (or 60’s) and they’re very right. Times are quite different. However, that doesn’t mean there are plenty of relationships, women, and men that don’t operate like those times. Some people might say that’s so wrong or sexist etc. but there are plenty of people who were happy back then and plenty of people who are happy living like that now.\n\nSounds to me that your husband spent his whole life with you one way and was very happy and content that way. Seems you were not. He probably didn’t really accept that and wanted things to go back to how they were. After or by the time of the separation I’m sure he realized that you were not going to change back. I’m sure he loves you still but as you both seem to realize the lifestyles you want are incompatible. It’s unfortunate but that’s life sometimes.\n\nSorry you had to go through all that but best of luck and well wishes to both you and your ex. You never know, maybe you’ll both meet someone new or maybe as you approach retirement age you’ll find each other again. Love lives in the least expected places sometimes.",
            "It’s sounds like it was hard but you’ve ended up in a better place. I hope you can live your dreams and find happiness whether that is alone or with another partner. Your kids will be better to see you both getting along separately rather than fighting together.",
            "Wish more stories ended like this. Not so much the separation part, but the lack of nastiness/bitterness. So happy it's working out for you all.",
            "This is a happy ending. \n\nYour kids are much better off in a world where their parents aren’t trapped in a life with people they resent. \n\nCongrats and good luck!",
            "Sometimes I think if my DH and I split up we'd be better off than we are together. I love him, but I don't think we make each other as happy as we could, and I don't think he's interested in trying to make any changes. I'm really proud of you for doing what you needed to do.",
            "Good for you. I'm sorry that it wasn't what you wanted, but it seems like it'll be better for you long term. Best of luck",
            "I think I remember you. \nI'm so happy for you. \nFor whatever reason people break up. I know I have, twice, but I'm 20 years older than you. \nThat said, I beg you to take a year off to work on you. Even though you are happier now, four seasons of discovery and self-belief.\nHere's what I had to learn: I had to unlearn EVERYTHING I believed before. I literally had to re-think and re learn my own set of values, which have become different than before. \nThe book, The Four Agreements, by don Miguel Ruiz, was awesome. \nGod speed.",
            "Sorry you went through all that, I just finished nursing school a couple of weeks ago and definitely understand the stress involved",
            "Lucky you. A loving drama-free break up is such a sign of maturity. Sadly, I don't think my bf of 10 years will react well when the time comes but I'm afraid it's unavoidable.",
            "When my parents split my tennis teacher said to me that it’s better to come from a broken home than be in one. I truly believe this. I’m glad you are all doing well!!",
            "Happy for you, OP! Takes a lot of courage to move out. Keep living everyday",
            "I've recently broken up from my boyfriend, we share a nearly-2 year old. We get on so much better now, we laugh, we enjoy time together and we parent really nice. Issues we had before have really worked out and part of me think we should try again as things are so nice! But there is no sexual spark so we wont. It was a hard decision, that was right thing to do for all 3 of us. \n\nI'm so pleased that it's working so well for you too, and your family. Without happiness then there can't be a sustainable relationship.",
            "I just read your original post and I think you did the right thing. \nFrom one nurse to another, being in a relationship with a nurse is hard. It will wreck you mentally and physically in ways that most people don't, and can't, understand. You need someone that you'll be able to come home to who will let you vent and support you not to mention the shift work and you not being there to cook dinner every night.",
            "This gives me hope. I'm going through a similar situation with my wife, we just don't have kids. I'll be moving out by the end of the month. Your post has reminded me that everything will get better, with or without her. I'm glad to hear things are working out for you.",
            "Damn must suck having a divorce after 16 years sorry you have to go through this.",
            "Good for you gal, sometimes as mothers we put our happiness aside for the people we love and that's not a bad thing but when a partner doesn't appreciate the sacrifices we make as mothers a separation is inevitable as long as the little ones don't get traumatised then all is well",
            "I'm glad things are better and this is a reminder to all of us that sometimes the unthinkable (ending a marriage/leaving a job) really has become the only option.",
            "Just read your original post along with the update.  You are an inspiration.  Thank you for sharing.",
            "Wow.. had you stated you kept the house I’d be wondering if you’re my currently estranged wife with all the similarities.  \n\nSplitting is hard to do.  Be sure to remember to let yourself grieve the loss of your relationship.  Also, lean on your support system (not your kids, please) when you need help.  If you don’t have one Reddit kinda works or you can DM me yelling and cursing all you want.",
            "Thanks for the update. Your husband should have embraced the changes you were making and held on. Any kind of intense degree is going to be time consuming but you'll also make some important connections. He gave up. This wasn't on you.",
            "When I saw the title of your post, I thought to myself, omg this is me too. I read your original post and just wanted to come here and tell you that I am so happy that you have found happiness and was able to find the strength to change the relationship to stop the abuse and pain. I am currently in the same boat and like you, I love my husband very much and though splitting up is completely devastating and heartbreaking, it is going to be really good for both of us in the long run. It's hard to let go of someone you love so deeply and have shared so much of yourself with. Kudos to you and thank you for sharing your story. I have been debating sharing mine here because I too need help and sometimes getting outside perspective can be soooo beneficial. I have been in therapy for some time but honestly, hearing from other people has been really helpful and this platform is kind of amazing at that. It's just rally hard for me to talk about, I am still processing. Good luck with everything!",
            "Thanks for sharing! I've been brought up by happily separated parents and 30 years in I can say their relationship is more stable than many of my friends' parents. I think it's more important to show your children you can make smart choices for yourself, have some agency in your own life and how to communicate about things when it comes to parenting without still being married.",
            "I am so happy that you were able to handle things well. The most important thing is your children and their parents dont need to be together, but providing that positive model of mature coparenting is so wonderful. \n\nIt’s hard as hell. But both your lives will be better for it. As well as your kids: I have many many friends that are scarred from not their parents divorce, but the constant fighting and tension in their home. A peaceful divorce helps them see that while you two didn’t work out they are still the highest priority to both of you.\n\nBest of luck through the healing process.",
            "Thank you for this update, it gives me hope for myself trying to move on my own again.",
            "Reading your original post, I feel like I'm your ex-husband. I worked from home and was miserable because I got no social interactions and my wife would be the only person I talk to. Then she got a job and she is always very social so she does happy hour and other things. Sometimes she'd come home after one or two drinks and I can smell the alcohol and I am just so resentful, and then she drunkenly wants to make out or cuddle and I just hate it. Our sex life took a dive and we started fighting a lot over little things. While I trust her, it's my loneliness that I had a hard time justifying - why be married if your spouse isn't even going to be with you most of the time - and when I bring it up she'd call me controlling.\n\nWe're seeing couples therapy but I feel like we're so far apart now that it might be hard to work things out. Her happiness is when she is doing things and socializing, and my happiness is sometimes doing nothing at all. I'm certainly not as social nor as active as she is. I used to be more active but decided to spend that extra time on developing my career so we don't hang out as much now.",
            "Don't forget that you are entitled to 50% of the marital assets. Just because you moved out doesn't mean you're SOL on the house.",
            "[deleted]",
            "Just be aware of the emotional rollercoaster, and the intense feelings of jealousy you'll feel when he gets his first girlfriend post divorce that you have zero idea where it came from or why you feel it. Try not to let it affect your co-parenting relationship, and at all costs, DO NOT FIGHT WITH HIM IN FRONT OF THE CHILDREN.\n\nJust speaking from experience. I thought I was way over him. I called it off. I moved out. I had a new boyfriend shortly after. I thought I was soooooo past him. I really, honestly, would have never taken him back and still won't. But man, when he got with his now fiance, I flipped out, out of nowhere. I got mad at my family for not divorcing him along with me. I looked for everything wrong with her that I could find online and used it against him. I kept our child away so long as he was going to have her around. I went back on my promise not to take our issues to court and instead handle our shit like mature adults. It didn't happen. I ended up getting his custody revoked. He didn't see our child for 2 years because of ME. Our child saw us call each other horrible degrading names, cursing, yelling... it was bad. \n\nI'm not saying *you will do this*, but I learned in family court orientation that it's very common and natural to be on an emotional rollercoaster for some time. All these feelings will come bubbling up to the surface that you didn't think you still had. It finally was making sense, the emotions I was feeling for no good reason. I didn't miss the frustration of being with him, I didn't miss the sexual or emotional aspect of our relationship, or the physical aspect, I didn't miss *him*. But I did miss the fun times we had and realized the new boyfriend wasn't as funny as him or as outgoing and sociable. I missed the shows we would watch together, the rituals we created together, the interests we shared, our friends, the places we would frequent, the activities we were involved in... I missed my old life because it was all I had known for so many years, and the new guy was new and different and nothing like my ex. I missed memories, not the person. So when I learned he finally moved on for himself, all those things I was missing the most, made me jealous to think another woman was getting all of my happy memories. I still don't know what came over me because today we're all really close and best friends. All water under the bridge, as she put it. Nothing about them or their life together makes me feel jealousy today. I'm no longer angry or resentful. We don't fight, or yell, or call each other disgusting names. It just happened like it did, and I don't know why, but I was warned in orientation about it. They just didn't teach us how to deal with it or what to do about it. \n\nI wish I could have been guided on how to handle the feelings. I have a lot of regrets. I could have and should have done better. I nearly made our child forget who dad was in 2 years time. Time they won't ever get back with each other. I should have given us some space, some time to forget or some time to heal, and had my mom deal with meditating pick up and drop off. I shouldn't have gotten so furious when he couldn't pick up our child for the weekend. Instead, I should have just cherished that extra time spent with my child and offered one of my weekends in exchange. I should have allowed myself the time and space to process him having a new girlfriend and understood that no one is perfect and we all have a past. There is so much I wish I had done. \n\nIf it happens, not trying to say it absolutely will, but if it does, remember my words and take a deep breath for yourself and a step back and figure out what is going to be best for your children first and foremost. If you have to remove yourself from his presence, do it, do it until you're ok again. I wish someone would have told me this.",
            "You took a very bold step in going this route,  even though it didnt work out exactly the way you planned.  You now know you can be happy on you're own and you deserve to be happy!!! Congrats OP.",
            "[deleted]",
            "I'm sorry he wasn't able to help the save the marriage, but you did the best thing. Over time, your children would have absorbed very unhealthy ideas about marriage and negative ways of talking to you.  Best of luck.",
            "My situation is unlike yours, but I too have come to the realization that my marriage is coming to an end.  \n\nWe have been together over 13 yrs.  But things happen and people’s priorities change.  The hardest part is that I still love him and I’m certain he still loves me.  He just loves himself more.  And that’s okay I guess.  Maybe that’s where I messed up.  I haven’t loved myself.  \n\nIt’s the single hardest thing I’ve been through, and I don’t wish it on anyone. \n\nI’m glad things are working out better for you.",
            "After reading the original post, I suspected that this might be the best solution. I think that when you went back to school and he had to deal with all the housework maybe his male ego was too prideful to accept it. Now that you are just co-parents at least you can build your life without having to be a primary caregiver. Nursing is a difficult career due to the hours and you deserve a safe place to rest.",
            "I'm glad you got out of it in a bit of a positive way, I'm especially glad for the kids, cause they're just innocent bystanders.",
            "Often people try to force themselves to stay together. Things often get ugly and they end up hating one another. Happy to know that didn’t happen hear! 🙂",
            "If you're really done, you jumped the gun too quickly in my opinion. If you're still interested saving your marriage, I'd like to make a few observations.\n\nFirst, volunteering isn't necessary. When you saw things going downhill, that should have been an easy thing to drop. Between work, school, and homeschooling, you already had way more than the equivalent of a full time job. \n\nSecondly, nursing school is notoriously hard. Your school friends who had free time to hang out probably didn't have families or had more support than you.\n\nThird, if your schedule was packed and it took a toll on your marriage, I believe you could have cut back more somewhere. \n\nIt seems great now since you have freedom to do what you want, you have the promise of a career that you assume you'll love, and you're free from being treated badly. \n\nHowever, the grass always seems greener on the other side... \n\nSounds like your husband had a rough patch and you bailed because you wanted your freedom. And when you had your issues that lasted many years, he stuck by you. \n\nI'm just a stranger on the internet but I think your marriage is still worth fighting for even if it is from far away. \n\nYou gained stability with his support and he gained a successful business with you handling the home front. \n\nHopefully he will understand where he went wrong and try to make things right because you two seem like a good team.",
            "[removed]",
            "[removed]",
            "Change is hard. In your first post reading it seems as if he was having a hard time handling the change. Men sometimes see themself as the  \"the bread winners\". So to see their need of being the \"man\" of the house not really a priority then it can be hard to handle for some.  It also seems as if there was some jealousy because you had a social life  now, and per your thread, he seems to not have one as developed as you. I hope you were making time for him as well. That will duel a lot of the jealousy. You make time for them but don't make time for him. And vise versa. We all learn after the fact that marriage is give and take and no matter how great the couple is it is work. Especially with kids involved. Sounds like you guys are where you need to be for now though. Kids see more than we think when things are sour. Congrats on your nursing btw.",
            "Can't put a finger on it, but it doesn't seem like you were being completely honest in the original post, but that was a long while ago and things have changed a lot since then. So I guess that doesn't matter much now... I hope you have stable work once you're out of school and the loans run out; that may or may not be a difficult transition, depending on how you spend your time now...",
            "I read your original post, and I’m happy to hear that you have found a happy ending. I don’t mean to be rude, but why didn’t you discuss the possibility of you pursuing a career one day before you guys got married? It just seems to me to be such a common occurrence in this day and age that you would have at least touched upon this prior to committing to each other.",
            "Marriage is overrated it's as simple as that",
            "What part of \"till death do us part\" did you not understand?",
            "[removed]",
            "When you decided to separate actually you tried on the divorce like a new clothes. And I assure you if you hadn't success in it you beggin you spouse live together. And further making your husband live unbearable.\n I glad for your husband, now he can be happy and don't see your long face every day.",
            "[removed]",
            "[removed]",
            "Can you at least try to fix your marriage, u have kids ? Why not do it for them."
        ]
    },
    {
        "post_id": "2oi4im",
        "author": "Enort",
        "title": "[UPDATE 2] I [22M] suspect something between my girlfriend [22F] and my friend [21M]. We all live together. Am I imagining things?",
        "url": "https://www.reddit.com/r/relationships/comments/2oi4im/update_2_i_22m_suspect_something_between_my/",
        "score": 5835,
        "num_comments": 592,
        "created_utc": 1417909818.0,
        "selftext": "[Original](http://www.reddit.com/r/relationships/comments/2nsy91/i_22m_suspect_something_between_my_girlfriend_22f/)\n\n[Update 1](http://www.reddit.com/r/relationships/comments/2o0l1n/update_i_22m_suspect_something_between_my/)\n\nYou wonderful motherfuckers. Between the comments to both posts and my inbox I have an immense collection of personalized pep talks, which I am referring to whenever I feel down (admittedly, a lot these days). I got advice/stories from all sorts of people - married, single, old, young... Wow. I never thought the internet would bring me this level of support. I just want you guys to know that by just typing up some comments you have made a very real difference in someone's life. Gotta say it feels a little strange receiving 6 reddit gold and making it to /r/bestof just for sharing the worst day of my life, haha. \n\nI got a lot of messages urging me to join redpill. This experience has soured my view of **Alexis.** Not women in general.\n\nI got some messages saying I write too well and this is obviously made up. I have two words for you: I wish. \n\nA clarification on the last update: I wasn't clear about what I see when I walked in. They weren't literally fucking, they were just sitting on the couch with a deer-in-headlights look that was incredibly incriminating and they both went quiet. It was just obviously not a \"hey, guess who dropped by\" situation.\n\nAnyways, onto the update. I've been extremely busy with the semester ending and I took the majority's advice to bury my head in work. I've spent a lot of time at the library because Alexis never goes there.\n\nIn the process of posting the last update I realized how dumb it was that I hadn't contacted Derek and Brooke with my side. I screen-shotted the text from the cool neighbor, Will. (Side note: all names have been changed except Mark because fuck you Mark). Within the minute Derek was blowing up my phone with calls and texts that made it very apparent he didn't know anything. At the same time Alexis was sending texts begging me to meet up with her. I was feeling miserable and sent back a single text to Derek saying I wasn't feeling up to talking, then put my phone away for the night. In the morning I got a text saying to meet him at my favorite restaurant for dinner and drinks on him, assuring me that no one would be there \"not even Brooke.\" I haven't had any appetite since everything went down, but the offer meant a lot and I really did want to see him so I decided to go after classes. \n\nI got to the restaurant first and I had my heart in my throat worrying that Alexis would somehow be there, but she wasn't. Derek came up to me and gave me a big hug and opened with \"Dude, what the fuck.\" So here's where shit gets a bit crazy and dramatic. A lot of you suggested that Brooke might side with Alexis or had been covering up for her the whole time. I wasn't so sure, because while she is closer to Alexis, her and I have been friends for a bit longer. According to Derek, as soon as he told Brooke she was absolutely furious.  In his words: \"I sort of wanted to bitch Alexis out but Brooke took care of that... and then some.\" Remember how I said Alexis came from a conservative small town? Her parents had NO idea that we were living together and she constantly stressed that they couldn't know or they'd cut her off financially. They liked me enough to be polite, but they were constantly worried a relationship would distract her from school and didn't want her getting pregnant or whatever.  Derek said that Brooke demanded Alexis pack her things and find a new place or she'd call up her parents and tell them everything.  Derek told me that later that night Alexis was sitting in the living room hugging a sweater I'd left behind and wailing at the top of her lungs that her life was over when Brooke yelled from her bedroom \"Well maybe you shouldn't have fucked Mark then.\" Imagining that moment was kind of funny.  Brooke's always been a very no-nonsense girl with a hot temper, but I definitely didn't expect this. It was extremely touching that she took the cheating that seriously.  During that dinner all my fears that I'd lost my friends were completely washed away and I was able to choke down a few pieces of sushi.  \n\nWhen we left dinner, Derek promised to let me know when Alexis was gone so I could move back in.  I declined his offer, because 1) Even if she does move out everything in that apartment reminds me of her including Derek and Brooke 2) Alexis and Mark probably fucked in my room, so I really don't want to sleep in it 3) In the current emotional state I'm in I don't want to be third-wheeling a happy couple, even though I'm sure they'd be considerate.  He understood my points but said to let him know if I changed my mind, because Brooke and Alexis' friendship seems to be pretty over. \n\nThis week has been pretty uneventful, but I keep having to dodge Alexis. Luckily, I'm in an undergraduate program that only has 60 students so we have a lot of our classes together. I asked two friends to keep an eye out for her after giving them a sparknotes of the story, and started showing up to class at the last minute.  As far as I know, she only waited outside of one of my classes. I got a text saying \"Bitch has been spotted in front of (classroom). Waterworks in progress. Proceed with caution.\"  I ended up skipping the class, because I didn't know if she was going to leave and I really didn't want to risk it. \n\nLater that night she sent me a really long Facebook message explaining everything from the beginning and it sort of made me sick to read, I contemplating not reading it but once I opened it I just had to.  She said that he'd been flirty with her in the halls (as I mentioned before, he would say inappropriate shit to both girls) and she tried to be friendly back, but it must have come off as flirting because he kissed her mid-sentence one day.  She said she felt guilty that she \"led him on\" and that guilt prevented her from shooting him down in future advances because she felt like it was her fault it happened and she has trouble saying no (???)  She said they'd only slept together 3 times and she hated it, he had pushed her into it (\"not rape, but..idk I never said yes either\") and she was going to end it during the conversation I walked in on.  She said she understood if I needed some time and some space but that she'd do absolutely anything to \"make it right\" and would spend the rest of her life making it up to me by:\n\n* Treating me like a king, I'd never have to cook, clean or do my laundry again\n\n* Give me full access to her phone and passwords.  She even suggested we install Life360 (an app that allows you to track someone's location through their phone) so I would know where she is at all times.\n\n* Cut off all contact with Mark and all her male friends (just for good measure, I guess?) \n\n* Makeup sex whenever I wanted\n\nYeah, that sounds like a healthy relationship - right? I didn't answer.  I kind of wanted to keep her on Facebook and watch the shit show unfold (she was posting dramatic statuses and song lyrics about mistakes, forgiveness and some from \"our song\") but I know how I am, I don't want to compulsively check her page or go through old photos. So I blocked her. Derek sent me a text a few hours later saying \"She's crying and screaming about you blocking her LOL\" \n\nIn happier news, the family I'm staying with is fantastic. I felt a little guilty about taking up their space, electricity, etc. so I offered to put down rent and pay for some bills (I am unemployed but my family gives me a decent allowance for rent and food) but they declined. The dad said \"First month's free. If you need more time here then we'll talk about it.\" and winked. My friend was telling me that they have hosted his and his sister's troubled friends so it wasn't a big deal. Still, I'm unbelievably grateful. \n\nAs for Will, (awesome neighbor) I called him to thank him for everything. I wasn't up to inviting him for dinner just yet, but I will. He apologized profusely. He says he can't stand Mark, not just for what he did with Alexis but various other things that I won't go into. He told me that Mark has been unusually quiet the past few days and told another one of the guys that he had gotten dumped. Whatever. I don't want to think about it. \n\nSo that's really all I have for you guys. I'm still going to be friends with Derek and Brooke but I'm going to limit my contact with them because they remind me of Alexis so much. I sent Brooke a message thanking her for kicking Alexis out and she said she'd do it regardless of whether or not I move back in. She's going to give me a heads up on when Alexis is gone so I can get the rest of my things. In the mean time I'm spending a lot of time studying, applying to grad schools, and hanging out with the guy I'm living with.  Earlier this week I posted onto my university's Facebook group searching for roommates for next semester and I already have a few replies. I'm going to wait until after finals to tell my parents about the situation because my mom asks a million questions about everything and I'm not in the mood to answer them. \n\nAgain, thank you thank you thank you for all the messages. I didn't not expect this level of attention and while it has made me a bit paranoid someone will recognize the story from the details - fuck it I needed the support. \n\nI fucking love you guys. \n\n---   \n**TL;DR**: Brooke is kicking Alexis out and Derek is still my buddy. I'm doing okay given the circumstances, and I'll hopefully be finding a new apartment next month. ",
        "permalink": "/r/relationships/comments/2oi4im/update_2_i_22m_suspect_something_between_my/",
        "comments": [
            "Good for you dude! However, don't cut your friends out because they remind you of that bitch. You're going to remember her anyway. If anything you should see Derek and Brooke more. They have your back dude, and everybody needs more people like that in their life. Hey, and way to not be a pussy and take her back. You're the man, and I hope mark meets a mean dude in a dark alley next time he fucks somebody's gf. ",
            "Brooke is officially my homegirl.\n\n\nOh, and once the pain is less fresh, stick with Derek, Brooke, and Will. They have proven themselves to be some solid friends.",
            "I'm really glad to see the update. And I was much cheered by reading about Brooke verbally beating up on Alexis and kicking her out. :)",
            "[deleted]",
            "> I'm still going to be friends with Derek and Brooke but I'm going to limit my contact with them because they remind me of Alexis so much\n\nDude, times like these you really find out who your friends are. These are your friends. Take it from somebody who's made a lot of friends and lost a lot too, when you find good friends you should never let them go lightly. \n\nIt might hurt at first, but in time this will be just another anecdote you bring out on Reddit when someone gets cheated on. Don't lose good friends over this cheating whore's actions. Otherwise she fucks you up more than she deserves. ",
            "[deleted]",
            "\"Bitch has been spotted in front of (classroom). Waterworks in progress. Proceed with caution.\"\n\nMan, whatever friend sent this sounds like a keeper.  I laughed pretty hard at this line.\n\nBTW OP, I know it does not help right now AT ALL, but you will get through this.  Everyone's been through at least one awful, shitty breakup in life, and most everyone heals eventually.  Just give it time.",
            "> \"I got a lot of messages urging me to join redpill. This experience has soured my view of Alexis. Not women in general.\"\n\nLol, way to inadvertently slam /r/theredpill\n\nEDIT: WOAH GOLD. WHAT DO I DO!? I'll JUST BASK IN THE AU.",
            "[deleted]",
            "I just came here to say Fuck you mark",
            "She is fucking despicable. You know, if she had just said \"yes, I cheated, I did horrible things to you and I am sorry\" fine, that's still bad, and she's still a cuntbag, but she had the fucking nerve to insinuate Mark raped her THREE FUCKING TIMES and she's just so docile and weak she couldn't say no!!Brafuckingvo.\n\nOP, your ex is TRULY priceless. What's next, fake pregnancy?",
            ">Derek sent me a text a few hours later saying \"She's crying and screaming about you blocking her LOL\"\n\nI almost feel bad about how hard I laughed at this. Almost.",
            "Keep your friends...they shouldn't remind you of her they should remind you of how much they have your back.  And thank you for not joining Redpill.  Redpill theory would say Alexis would have moved \"up\" but it sounds like she was just a bitch who fucked a real loser.  Hang in there!",
            "You can always make new memories with brooke and derek that wont remind you of alexis.  They are the kind of people you need in your life they know what youre going through and they can be a shoulder to cry on.  Dont lose contact with them as friends because your ex hurt you.  Anyways im glad youre doing good and staying strong.  But please dont go to the redpill those guys are all assholes.",
            "What the fuck is up with the redpillers using this sub to stalk potential new recruits? This isn't even the first post in the last few hours where someone with girl problems updating mentioned them PMing him (to avoid being called out for the creeps they are presumably, but they're totally not a cult they promise). \n\nFeels like there should be some sort of warning about their pming trick for people or something. I'd hate to see people who were unaware of what they are getting sucked in. ",
            "Man everyone doing what people should do. OP you may have a shitty ex but damn your support network is amazing. ",
            "I think you should move back in with your friends Brook and Derrek. I know that the place will still remind you of her, but you'll have great friends there helping. They will go out of their way, especially since you told him. Don't let her win. Living with another woman, one that not only feels for you but also supports you, will be a good thing. She will be able to get other girlfriends of hers to come over and spend casual time with you and them. You'll feel good, you'll might never forget about that girl, I say girl not woman because she's still an immature little girl, but staying around friends instead of random people will be better. Pain is just weakness leaving the body. Don't run away, stay and grow stronger. As time goes by, it will get easier and you'll be amazed what good friends by your side can do.",
            "I was waiting for this update for so long, Thanks for updating it and I'm glad everything seems to be going okay for you now. Please keep us/me updated on what happens next",
            "{{{Enort}}} Just sorry.\n\nWanna know something weird? You dropping her could possibly be the best thing that ever happened to Alexis. If she addresses her clear boundary and integrity issues over the next 2 or 3 years, this could literally change her life. Because, if it had not been you, it might have been her husband and 3 kids. Yeah, let that soak in.\n\nAnd hurray for Real Friends!",
            "I'm old enough to be your dad. So I've been around the block in this game, and I've spent about a third of my life on tour in the Rock world. You can imagine some of the shit I've seen and lived through, and you still wouldn't even come close to the reality.\n\nThese stories are nothing new to me. For years I have seen them play out in the worst ways. But for some reason yours got deep under my skin. I've thought about it a lot. Tuesday of last week I was driving home from the grocery store and all of a sudden you and your story just popped into my head, and I wondered how you were holding-up, if you were alone in all this, and if I'd ever know what ultimately happened for you in the end. It just fucking hurt to think about what you were going through, and I thought to myself: \"If she walked in front of my car right now, I'd run her ass over, go back and tie her to the bumper and drag her down the street.\" (Yes... Extreme some might say. But hey, I'm sick. I need help.)\n\nThere's really nothing other than time that's ever going to make this any better. It's going to be a long painful process, and in the years to come, when you least expect it, it's going to pop into your head out of nowhere and give you a little kick to the gut. That's just what being a good and truly loving person sometimes gets you in life. (It' still better than being one of the Mark or Alexis' of the world.)\n\nI've got no advice for you. Unfortunately, it's all on you. People can be there for you, but in the end, when you are laying in bed in the dark at the end of the day, it's just you and your thoughts, and no one can protect or help you in that moment. Sleep will for a long time will be your only respite from the waking nightmare you're going through. I can only promise you that those moments will come less often, and their severity fade.\n\nAnd I hope she gets eaten by a bear.",
            "Don't go to redpill. It is filled with failures who blame their lack of success with women on women themselves. The real problem is that the users are cowardly and pathetic.",
            "> She said she understood if I needed some time and some space but that she'd do absolutely anything to \"make it right\" \n\nI had a girlfriend in college who said something similar.  I gave her the benefit of the doubt and reluctantly gave her a second chance.  Three days into it, she got bitchy and asked how long was I going to be mad at her, and tried to turn it around back on me.  I realized she was only remorseful about it initially because I almost broke up with her, but thought she could just go back to her way once I forgave her.\n\nFrom then on, I have had a strict zero tolerance policy on cheating.  I'm not jealous at all, and have never had a problem with girlfriends having guy friends, but if I find out they've been cheating on me, I tell them they've made their choice and I move on.",
            "Listen, if you are ever tempted to cut Alexis a break because you feel sorry for her, remember this... you are doing her a bigger favor by teaching her this lesson: You Cannot Talk (or Cry) Your Way Out of Everything.\n\nThis young lady NEEDS to learn this. She needs to learn that she can LOSE. That mistakes have consequences, that regret is real and her pretty face and sorry tears and lengthy excuses will not undo what is done.\n\nShe can learn from this and be a better person. So don't feel like you're being cruel to her. You actually aren't.",
            "[deleted]",
            "\"I got a lot of messages urging me to join redpill. This experience has soured my view of Alexis. Not women in general.\" \nTHIS",
            "Her 'reasoning' is such BS. Dear lord. She can go cry to Mark (Oh hai Mark! You suck) and deal with the fact SHE CHOSE to do that. She cared about MARK'S FEELINGS more than YOUR RELATIONSHIP.\n\nFuck that. Don't fuck her. Keep friends with Derek and Brooke, they're awesome.",
            "I've been following this from the first post and I'd just like to say you've handled it all wonderfully. I know you were wanting to yell and shout as soon as you saw them on the couch but I think it's been in your benefit that you've shown her no emotion.\n\n I think you'll do just fine moving past this and you know now that your instinct is good but don't let it damage your trust in the future. Not all women are going to be like her (sneaking around etc) try to remember that. My friend dated a man who had been cheated on previously and he projected all of his doubt on her when she was not doing anything to lose his trust. ",
            "I was trying to think what I would say if I found myself in your shoes having run into her on the street or something. I think it would be:\n\n\"I don't think you're an irredeemable person, or a rotten person; and you may really regret what happened. But you have broken this relationship beyond repair - it's suffered catastrophic failure. So I'm going to sell it for scrap and get a new one. I'm asking you now to find the decency to not contact me again at all, for any reason. ",
            "I think this is the funniest part, who the fuck does she think she's kidding?\n\n\"She said they'd only slept together 3 times\"",
            "Anyone who tells you to join Redpill because of infidelity is like a dude who tells you to join the KKK because you got mugged by a black guy. Actually, I take that back. The KKK won't destroy your potential for a decent future relationship.",
            "Great update. Sounds like you have some great friends OP.\n\n\nAlso please please don't let people convince you to join the redpill.",
            "Thanks for updating us op. You did the right thing by going no contact with her. You have great friends and sound like a wonderful young man.\n>I got a lot of messages urging me to join redpill. This experience has soured my view of Alexis. Not women in general.\n\nGood on you for knowing that everyone is not a jerk and putting the blame on the individual where it belongs.  \n  Stay strong and keep up the good work in school.",
            "Man, you are my absolute hero!  You have handled this PERFECTLY!  I am so glad to hear that your friends stood up for you and kicked her to the curb.  She does not deserve an answer from you other than silence.  I don't understand how she can just let that guy Mark kiss her and then have sex with her, yet say she just didn't say no...  Oh, and the part about she was going to break up with him that day???  Didn't you hear a bunch of tickling and giggling?  Yeah, that totally sounds like they were breaking up!\n\nConcentrate on school and keep up the good work!  Stay NC and let her wallow in her grief for a while.  Make sure to stay friends with your ex roommates and the guy next door.  It sounds like they are really a class act!  I was so thrilled that Brooke took her to task.  She sounds like a real winner.\n\nYou, my friend, ROCK!",
            "Bout as good as an update as you could hope for, given the situation. :)\n\nThis isn't something that is going go away over night, but it sounds like you've got a good support group of friends to fall back on. It's really awesome that they're not putting up with her BS excuses and kicking her out. Good job blocking her too. I agree, more or less being her parent and tracking her movements every where isn't a healthy relationship, and dangling sexual favors in front of you is an act penance shows her true character. \n\nGood luck!",
            "Yeah, fuck you, Mark. ",
            "Hey thank you for the updates. I wanted to say keep in touch with Derek and Brooke they sound like really good friends that you should stay close with. Also your friend and his family letting you stay are AWESOME. I had a friend and his family let me stay in their house when I was going through some tough times. That guy is now my best friend and his family is my second family. Anyone that nice to help you when they don't have to and not ask for anything in return are people you need to stay close to. You have greats friends so return the favor with keeping a great friendship with them.",
            ">She has trouble saying no (???)  She said they'd only slept together 3 times and she hated it, he had pushed her into it (\"not rape, but..idk I never said yes either\")\n\nThat's the exact same shit my ex said. Fuck outta here with that bullshit. I'm glad that you threw yourself into your schoolwork that's exactly what you should do.\n\n\"Move forward. This never happened. It will shock you much it never happened.\"",
            "> She said they'd only slept together 3 times and she hated it, he had pushed her into it (\"not rape, but..idk I never said yes either\") and she was going to end it during the conversation I walked in on.\n\nThis sounds like the biggest load of shit. No one in a relationship sleeps with someone else 3 times if they \"hated it\". Not a fucking chance. It's not like eating broccoli or going to the dentist.",
            ">I got a lot of messages urging me to join redpill.\n\nThis makes me laugh. \"Oh, you had a shitty experience? Come be bitter about women with us.\" I like your response to it, OP, as it the response most people should make when confronted with what TRP believes in.\n\nAlso it's the second time in the past two days a redditor posting to /r/relationships has said they've been inboxed messages about TRP.",
            "As a woman: Alexis really fucked up. She had maybe the best thing going with a guy and that's hard to find. I've been cheated on in my youth and was not even remotely this composed in the aftermath. \n\nAlso I'm glad you didn't get sucked into some red pill nonsense. It seems like your ex has a lot to figure out in life but that is IN NO WAY a reflection on you; Or women as a whole. You are pretty young and I think you're going to be fine.",
            "I just want to say something in reference to your reasons for not moving back in after Alexis is gone.\n\nI used to live with my two best friends who were dating each other while I was single. With really good friends like that, you'll never be a third wheel. You'll be part of a tri-pod. It can sometimes feel like a three way relationship, just where only two of the people are sleeping with each other. Despite the fact tht they remind you of Alexis, they are also in the best position to give you the support you need to move on. I wouldn't distance myself from them if I were you. I think being close to and spending lots of time with them would really help you in the long run. My best friends that were a couple helped get me through some of the hardest parts of my life. That friendship is a wonderful, powerful tool you have, and I would encourage you to use it.\n\nWhether or not that means moving back in is more of a judgement call. If it were me, I would. The companionship you get living with your best friends is invaluable. I know the place reminds you of Alexis right now, but that's just a time thing. Before you know it you'll have new memories, and that won't be the case anymore. Maybe get a new bed if it icks you out/reminds you of bad times. But your associations with the place itself would change quicker than you think.\n\nOther than that, I just want to say how awesome you've handled all this. You sound like a very mature and intelligent guy, and I know when you move past all this you will be very happy and have a great life. Good luck to you.",
            ">I got a lot of messages urging me to join redpill. This experience has soured my view of Alexis. Not women in general.\n\ngood for you!, dont let one person allow you to resent an entire gender.",
            "The fact that Mark lost his girlfriend, makes me think it's way more than 3 times. ",
            "Man, two updates in one day saying \"WTF Red Pill\"?\n\nWe love you too, ha!",
            "[deleted]",
            "Good for you! You are doing everything right and you are going to be fine.\n\nI wanted to explain to you about what you said about Alexis having trouble saying no... Not to defend her position, but explain. I used to be like that. Some women who are of the peacemaker personality type have a hard time learning to assert their own feelings and desires when they are contradictory to what is expected of them. They find it easier to take whatever unpleasantness might result than to say no. Furthermore a lot of women (particularly in conservative areas/families, as you mentioned) get taught not to rock the boat, to be complacent and agreeable, to go along with things. Conflict is very upsetting to people like this and they are very susceptible to coercion as a result (if they go along with it, the conflict goes away). Think about it... You would never have guessed that she would so this. It is way out of character. And yet she did. It wasn't what she wanted but she felt powerless to assert her own will.\n\nThis does not mean you should give her a pass. It means she is not emotionally equipped to be in sexual situations. It means she needs to get her shit together ASAP and before she gets involved with anybody else on any level. Chances are she is doing lots of things that she does not want to do, then rationalizing it, and it is going to fuck her up royale. That will screw up your self esteem. I know. Everybody should have the courage and voice to say no. \n\nAnyway, this is not your problem anymore, but I thought you might like the insight.",
            "It hurts. But you will be fine. \n\nAnd no reason to limit contact with the few people that were there for you. Why let her take that from you too?",
            "A little tip: Don't move back into Brook and Dereks place if you don't feel like you should.\n\n**BUT: Don't stop contacting them, talk to them man, don't just dump them cause of a shitty chick, stay friends with them, they treat you well**\n\nJust my two cents.\n\nAlso if not them, if Will kicks out Mark, try to move in with Will?",
            "Typical response from cheater. Will 'do anything' for you. 1 month later they think you should be over it by then and will do everything in their power to say 'im not a cheater anymore and you should be over it, so lets uninstall all these tracking apps and take away our open passwords, and you can start doing your own laundry again'.",
            "I know it might sound mean, but everytime you're feeling down, just remind yourself that Alexis is feeling even more down. You still have your awesome friends Derek and Brooke, a supportive family, a house to live in with your friend and his welcoming parents, and you are studying hard for school. I know it sounds cliché, but it will get better, you'll move forward and hopefully find yourself an amazing girl, who is worth your trust. Meanwhile, Alexis is feeling like a piece of shit, she lost you and her best friends, she got kicked out the house, and is lost in life. Good luck and good job handling this situation perfectly!\n\n*Bro hug*",
            "Good on ya for not letting this experience turn you into a bitter misogynist, and not joining the likes of TheRedPill.",
            ">She said they'd only slept together 3 times and she hated it\n\nHated it so much she did it three times and would hang out with him in private.  \n\nNo, what she hates is that she got caught, and you, OP, did everything right.  Now she's feeling the burn, the shame, and she doesn't like it one bit.\n\nGood for you, OP.  Keep focusing on you.  Best revenge is to meet other women, have awesome sex, and live a great life...without her.",
            "Thank you for rejecting the Red Pill!  You're a good dude",
            "... now I kinda want to know the kind of antics scumbag Mark has also done according to Will.  Because: entertainment purposes.",
            "You have a great attitude. Keep on, bro. ",
            "I like Alexis's explanation about how the sex happened: like Mark accidentally tripped and his penis went into her vagina, you know, by accident. Good for you, getting your life together. You've made all the right moves.",
            "DUDE\n\nbunk with WILL, he sounds like a real stand up guy. ",
            "Will seems unhappy about his living situation. Maybe he can take Alexis' spot?",
            "I urge anyone even remotely suspicious of their S/O (within reason, dont go inventing wild ideas on a mere hunch) to investigate. I've had this happen 3 times in 15 years",
            "Know what I did when my last girlfriend dumped me?  I took the next girl to all of my ex's favorite makeout spots.  I had the same problems as you, everything reminding me of her, but it really helped to create new, better memories.  ",
            "You're fucking awesome. Glad you're doing better. Update us again in a few months. :)",
            "So I Would like to apologize for my post that thought Brooke and Derek may have known. They are clearly solid friends with nothing but your best interests at heart, as others have said don't allow these people to slip away, true friends are more precious than gold and rarer than unicorns. it's clear that you are person people love and respect but thats still no reason to throw away great people just to disassociate. ",
            "she couldn't say no not once, not twice, but three times.\n\nbravo for dumping her ass",
            "I have been following this story for some reason the entire time it has been going on. Something similar happened to me, and I think that's why I was so into it.\n\nA good analogy I used to tell her when she was in the phase of \"I'll do anything to have you back, what can I do **to fix this**.\" is a common analogy called the broken plate:\n\n*Go into your kitchen and get a plate. Now, throw that plate on the ground. Did it break? Yes? Now, tell that plate how sorry you are and how you will never do it again. Did the plate go back together the way it was before you broke it?*\n\nAlso, please don't forget about Derek and Brooke. They were incredibly good friends and would be great to keep by your side. Once the memories and feelings of hurt fade, please try to get back into contact with them.",
            "Revel in the fact that she feels shittier than you do man. She fucked up everything. Her wonderful boyfriend, her best friends and flat mates, her living situation. Nobody likes her. If for once people thought of the consequences of the \"what happens if all goes to shit?\"-situation before giving in to their petty greed.",
            "Don't you love the whole \"I'm sorry take me back\" and the fact that she completely shoved all blame to Mark in the same email not taking any responsibility.  Stay strong man you have your whole life ahead of you.  In 20 years you will barely even remember her.",
            "i'm not sure what makes all these people so qualified to give relationship advice lol",
            "> I'm still going to be friends with Derek and Brooke but I'm going to limit my contact with them because they remind me of Alexis so much.\n\nDon't limit your contact with these awesome people. They don't like her just as much as you. Don't push your friends away because of her.",
            "Good for you, I'm glad that you wouldn't turn to the red pill. \n\nI'm sorry man, I wish you all the best.",
            "So to be a devil's advocate here, a lot of people are congratulating you and how you handled this. This is good and all. I am just curious about how your ex will eventually handle this. She is paying a high price for cheating, losing her BF, and all of her friends, and getting kicked out. Also she is basically being blackmailed into leaving the house based on her poor choices.\n\nAll is fair in love and war, but her mental state might not be the best and being suicidal might be something on her list of stuff to do. People are saying she will learn from her mistakes or it will teach her a lesson. And I really don't know if it can without help from someone.\n\nI would hate for this to end like attempted or succeed in a suicide. No clue how to handle it but yes. Just something to keep in mind. Maybe have someone she knows ask her if she having suicidal thoughts or give her a suicide hotline to talk to just in case. If your university has some sort of on call psychologist or life counselor, I know some do, you probably should through a third party give her access to it.\n\nAlso all of her makeup techniques are pretty unhealthy basically ingratiating herself to you, which could never really sustain a relationship longer than it needs too until she starts resenting you for having so much control over her. So that should be addressed by someone as well.\n\nedited: more directed advice",
            "I don't know anyone that is surrounded by as many legitimately good people as you are. There are half a dozen people in this story that are total bro status. \n\nCherish those friendships. You don't get a lot of those. You're going to be just fine with those people around you. ",
            "Wow I can't believe she tried to rationalize her cheating with that \"not rape but I didn't say yes\" line. That should really be eye opening to the lengths some people will go to in order to not seem like the person in the wrong.",
            "These hoes ain't loyal ",
            "Glad things worked out man. Keep your head up and best of luck with your endeavors. ",
            "Everything ended so well. Good for you man its nice to have friends that have yoir back. This post also gave me a justice boner.",
            "Good on you, OP. \n\nYou'll find someone worth your efforts and time.",
            "Great to hear man, glad you have remained strong despite her trying to make up things with you. Seriously, she did not respect you enough as a person to deserve you. \n\nHowever, don't try to distance yourself from your friends. They are the reason why things have gone so well, make them happy. Seriously. They probably want you back with them so consider it. If not then make sure you keep in contact with them. They treated you better than you ever imagined. ",
            "> I didn't answer. \n\nYesssss.  Oh man that is so hard to do but I'm so happy you did it.  Nothing can ever make the situation right, of course, but that is the most effective payback you can get (without crossing the line into being an asshole and using her or something).  Someone you love (or \"love\") just vanishing and refusing to speak to you, so insanely aggravating.\n\nI'm so sorry you had to go through this but in the aftermath you did every single thing right.  You know how rare that is for this sub?  Kudos, bro.",
            "Man, I don't even know you but I'm super proud of your response and really glad that things turned out as well as they could, given your situation. Way to go. ",
            "Well done OP! You handled this whole situation like a champ.\n\nShe got what she deserved (what a bitch) and you had the self respect to stay strong and not give in to her attempts to get you back.\n\nI wish you the best of luck with your finals, and for your future relationships :)\n\nHi-Fives!",
            "I know its a sucky situation, but you're approaching it with some immaturity. You need to have a real conversation with the ex and let her know you're done. Ignoring her doesn't do anything. There's no reason not to continue to live in that apartment. You're screwing over your friends who have now lost two tenants, not just one. So the fuck what they fucked in your bed? Change the sheets, no harm done. Man up, play the game he who cares the least, forget your ex exists and go find another girl.",
            "I'm glad you're ok, your friends are really wonderful and loyal to you, don't push them back. Good luck with everything! :)",
            "I'm happy everything is working out for you, man. The thing about pain; it's temporary. Especially since you last her go. Things will only look up from here. Best of luck to you. I'd buy you a beer if I was in your area. Good luck in school and congrats. ",
            "Nice job OP I smiled several times during this post and am glad things are on the up... and your friends are amazing,  hang onto those ones!!!",
            "I've been in a similar spot.\n\nCut and dry man, its a black and white situation.  Stick to your guns, it gets old for a bit, but it gets easier the longer you go",
            "I know what it's like to have to cut someone you thought you could spend a very long time with out of your life. Don't ever look back, but understand you've learned a lesson in trust, but that doesn't mean you should forget how to.\n\nKeep on keepin' on, brother.",
            "As others have said, don't cut your (old?) roommates out my hey seem like good people and will be there when you're ready. \n",
            "Derek and Brooke are good friends, don't cut them out, if anything make sure you keep rtm around. ",
            "You're handling this much, much better than I ever could. You're the shit dude. Stay strong.",
            "Glad to see this story has a happy ending (though not for your ex).  Here's hoping she learns something from this and changes her ways.",
            "Dang man.  That sucks.  I had something like that happen to me, and reading your story still makes me feel sick like back then.  Leave her for good, my mistake was believing her bullshit to change, but it never did and I went through it another 4-fing times.  Gave me a complete mental breakdown in the middle of grad school.  You will find a better partner.",
            "> (Side note: all names have been changed except Mark because fuck you Mark)  \n\nThis made me grin. Glad you still have a sense of humour in such a shit time of your life. ",
            "I'm late, but I got cheated on and it's great to hear your friends stuck up for you like that. Hope your finals and grad apps go well man!!! I'm procrastinating on my grad apps currently actually. Good luck and keep moving forward. You seem like a cool, reasonable dude. ",
            "Awesome of you for not falling for her bullshit \"I didn't want it, I can change\".  Good work.\n\nAlso Derek/Brooke rule and you should hang out with them all the time.",
            "Congrats, man. A lot of the times I see stuff like this, the person who got cheated on is pretty much ruined. I'm really happy for you that you didn't let that happen.\n\nYou just gotta continue being strong about it. You've got two good friends it would seem, and maybe a new one. May take a while, but you'll eventually get back into a comfortable rhythm, I'm counting on it.\n\nWish you all the luck and good thoughts in the world, man. Keep on keepin' on. ",
            "I'm so happy to hear how well you're doing! If it were me in that situation I wouldn't even be able to get out of bed let alone go to class, I hope everything turns in your favor!!:) ",
            ">Yeah, that sounds like a healthy relationship - right? I didn't answer.\n\nOh, thank god!",
            "Tell her Rolling Stone might buy that story.",
            "First off I find the strength you are able to bring forth in this situation inspirational. But I felt the need to chime in based on the need you feel to distant yourself from Brooke and Derek based on the association they have with Alexis. \n\nI totally get it. But something you should consider is the less time you spend with them going forward, the stronger the association will remain. You can break this association, by forming new, better, memories with them. These people sounds like absolutely outstanding friends, and relationships like that don't grow on trees. What may be difficult at first would be worth it in the long run, don't turn down the potential life-long friends due to a blip of un-comfortability you may experience in the grand scheme of things. \n\n",
            "You sound like an awesome guy who keeps really awesome company. Glad you aren't thinking about taking her back. Glad you've established a good safety net like this around you. I'm sure it's hard to recover and move on, but if you're feeling down on yourself, just imagine how much harder this would be without that family to take you in, and without friends who look out for you. You're doing great! \n\n",
            "My ass may have a ring from the toilet seat forever. I read every word of every post. I've been there done that and have a beautiful wife with three kids now. Little brother, I love you. You will get through this and be better for it. As fucked as that sounds. ",
            "When I was reading your explanation of her Facebook message, I just laughed to myself saying, \"What a bitch!\"  From what I can tell, you're coping really well, which is a nice thing to see.  It also looks like your life will be heading upwards!  From my experience, doing better than your best is the best way to 1up a bitch.",
            "Like everyone else is saying. After some time, you should still hang out with Derek and Brooke. \n\nIt makes me happy to hear about all the people who have your back. ",
            "Derek and Brooke stuck by you when you needed it and looked out for you. They two are friends you need in your life.\n\nSit down with them and talk it out. Tell them straight, staying in the apartment reminds you too much of Alexis and that there's no way in hell you're sleeping in the same bed where the other two decided to screw in.\n\nHowever them reminding you of Alexis, I think it's something that you'll have to get over. And limiting contact with them after everything that happened is not fair on them, especially considering how much they did to help you out. Even more so considering at first you thought Alexis may have been shagging your room-mate.",
            "This Mark shitstain just slimes his way into your relationship, ruins everything, and slimes his way out with no ill affects?  Other then getting \"maybe dumped\"?\n\nThat's straight up bullshit.  Someone needs to beat the shit out of him.  He deliberetely goes after a girl he KNOWS has a girlfriend (next door, no less) and pursues her.  She's obv. weak and easy prey for a puke like him.  She was in the wrong yes, but its guys like this that ruin shit.  Temptation is a bitch.\n\nIf reddit didn't have a policy, i'd be happy to see this Mark asshole outed after proving this whole story is true.  God damn i'm sitting here angry as fuck.  FUCK",
            ">  She said she understood if I needed some time and some space but that she'd do absolutely anything to \"make it right\" and **would spend the rest of her life making it up to me**\n\nheh...sure\n\n",
            "Damn dude. I've been reading all of your posts and this one kind of makes me happy.  Keep up the positive way you're thinking and going. Im really sorry this happened but everything happens for a reason. She obviously wasn't worth your time or space. You'll find someone so much more amazing, you deserve it. ",
            "Alexis sounds like a little girl and Brooke is quite quality material. Good that you are not bitter about all women. Best wishes for your future, at least you can thank her for the work motivation.",
            "This was extremely satisfying.\n\nShe was breaking things off with him during the convo you walked in on? Bullshit. That's hilarious. She's an idiot.",
            "Just wanted to say it sounds like you have an amazing support network of people around you - we should all be so lucky when we come upon hard times. \n\nKeep your head up and focus on what's important and, I'll echo the sentiment I've seen here a lot, really work hard and make an extra effort to keep people like Derek and Brooke in your life - you'll be infinitely better for it...but c'mon after everything that's happened, you don't need us to tell you that.\n\nGood luck bro, take solace in the feeling of vindication knowing you'll be the one coming out on top, even if it doesn't always feel that way.",
            "One small comment, don't write the friends off.  They stood by you when they didn't have to.  That's something you won't see much in life.  Just think on it.  Best of luck bud!",
            "> \"First month's free. If you need more time here then we'll talk about it.\" and winked.\n\nIt's not gay if you say no homo afterwards.",
            "I know this has been said already, but I just wanna reinforce, Brooke and Derek are the kind of people you want in your corner at all times.  If you think they were helpful now, imagine how much better you're gonna feel around that kind of positive energy at different parts of the grieving process and how much easier it will make it for you.  They wanna help man, let them help.\n\nI'm glad you're getting the incredible support you deserve, bro.",
            "Will should move in with Brooke and Derek.",
            "OP, you're the fucking man. I just read your whole story and you handled this beautifully. It's not easy now, but it will get better! Keep your head up dude, and be the young 22 stud you are.  ",
            "EYYYYYYYYYYYYYYYYYYY",
            "Derek and Brooke obviously value your friendship.  Take some time away from them, but don't cut them out or distance yourself long-term.  They sound like stand-up, true-weather friends, and those kinds of people are not a dime a dozen.\n\nIf you run into Will, please make sure you thank him again and tell him he did the right thing.  Even though he absolutely made the right choice, I'm sure he feels guilty for \"causing drama\" and it would be good to put his mind at ease.  If he's ever in a similar situation, he won't hesitate to be a bro.\n\nI hope that you find the right girl for you and she treats you like a king from the get-go.  There are so many better women out there who will be faithful and loving partners.  When you're ready, don't be afraid to trust again.",
            "Derek and Will are complete BROS. Don't forget dude, all of us on here are rooting for you just as much as D&W. ",
            "Derek and Brooke (dat loyalty from Brooke tho) are fucking legends, live on through them my man. \n\nFuck Alexis that slut.",
            "I feel for you man, when I see things like this I just want to be the one that confronts the douchebag Mark and beat his ass.",
            "rofl @ OP being educated + writing well = fake story. sorry that happened to you, bro. it sucks right now but you're working through all of this like a BOSS and its been encouraging to see how level-headed you are. good luck with everything and I hope you have an awesome future. FUCK MARK!\n\nAlso - I'd consider myself very lucky being able to detach from a lazy, lying, cheating piece of garbage relatively easily. you're CLEARLY too good for her and I feel like you wouldve broken up with her at some point down the road bc you're everything shes not - awesome. ",
            "Alexis is a skanky name anyway. Never trust a bitch named Alexis.",
            "If a dude bangs your woman, you **MUST** bang him to assert dominance, else you'll look weak. ",
            "[removed]",
            "[removed]",
            "Any woman that reads this comment, please explain why women try to rationalize their actions in such bat shit crazy ways. \n\nFine example from this guys fucking nut job of a Gf. \n\n> She said that he'd been flirty with her in the halls (as I mentioned before, he would say inappropriate shit to both girls) and she tried to be friendly back, but it must have come off as flirting because he kissed her mid-sentence one day. She said she felt guilty that she \"led him on\" and that guilt prevented her from shooting him down in future advances because she felt like it was her fault it happened and she has trouble saying no (???) She said they'd only slept together 3 times and she hated it, he had pushed her into it. \n\n\nWHAT...THE...FUCK...ARE...YOU...TALKING...ABOUT...\n\nThis right here is the biggest pile of shit and I'm kinda glad this dude got cheated on cause this girl sounds like a nightmare from what he has shared. \n\nAdditionally,  my point on this would be, his girl is too scared to say, right there and then, \"Mark seemed more attractive and appealing to me than you did, and I as a high quality female, deserve better, and am going to act on my selfish impulses\"\n\nThats why you have had many people point you in the direction of the red pill my friend. \n\nBecause, realistically you cannot blame Mark for taking advantage when the pussy was handed to him. Im sure he didnt intentionally wake up and say, today ima go fuck up more relationships by only hitting on girls with boyfriends. Even if he did hit on her, what kinda fucking bitch gives in so easily. \n\nSo, forget Mark, because your girl was the ONLY one with a commitment to you in this instance, and she betrayed that once a dude seeming more appealing to her came along. ",
            "Stay strong man.",
            "Seriously best of luck to you! It's hard for now, but when the moment finally comes you'll realize why it never worked out. Throw yourself into school! ",
            "Fantastic news (relatively speaking). You seem to have a great group of friends and support network. Things will get better and definitly never contact Alexis again.",
            "- found out you have good friends\n\n- dodged a huge bullet\n\nYou'll come out this stronger and a better person.",
            "I'm so glad you updated us. I was just thinking about how this all turned out earlier today. It seems like you've handled the situation really well. I think blocking Alexis was the best idea, it'll hopefully stop you from torturing yourself. She's not worth it.\n\nAnd just think, next year you'll be in graduate school and not have to worry about being tied down. A whole new chapter is starting for you. That's something to be excited about. Good luck with your exams and applications!",
            "Glad to see the update OP. Good luck on getting into grad school ",
            "I'm so unbelievably proud of you even though I don't know you. You're handling everything better than I'm handling my recent breakup, and I'm 27! High fives to you and your awesome friends. ",
            "Broooooo Broooooo \n\nGlad things are shaping up with you fast. You seem level headed and I'm proud of you, tho I'm some dude you've never met. \n\nI think Mark is realizing what he has done to a relationship hence his quietness and Alexis needs to realize that this relationship is over and lemme tell you, the BEST revenge is happiness and success \n\nGod speed!! ",
            "I love you too",
            "Your friends are amazing and you've definitely kept your cool!  I've gone through two relationships being cheated on and you're handling it fantastically!",
            "I wish I had friends like yours",
            "I feel bad for you, man, but this story of justice is a fucking masterpiece.",
            "This couldn't have turned out better for you. You found out you had awesome friends and you realized that girl is totally insane. Congratulations! Friends like that are hard to find. You're a lucky guy",
            "Fuck yeah dude! Seems like it worked out for as best it could and with finals and school you kept your head level.\n\nGlad your true friends stood by you.",
            "I'm very happy for you. Like others have suggested, don't cut out your friends. They're your support network,  and they seem like good people. Keep them around and I'd say befriend Will further. It is hard to find people like that these days.\n\n\nI'm sorry, but I find it comedic (pathetic, too) that she tries to BS you with her \"feeling bad\" for leading him on continuously and allowing advances and only sleeping with him 3 times. Wow. Fantastic. How hard is it to say, \"Sorry, but I have a boyfriend. No thanks.\" When telling someone no it doesn't have to be rude, even though he seems like a douche.\n\n\nYou deserve better than that, as oh-so enticing her offer seems (it actually doesn't sound too bad, but not good enough for what she did). You seem like a good guy.\n\n\nBest of luck.",
            "I'm so glad this worked out for you. Stay strong, you've done the right thing from the get go. All the best pal, I hope not to hear you going through relationships problems for a long time, decent guy like you doesn't deserve it.\n\nAlso Brooke and Derek? Keep in touch, they're the kind of friends you don't want to distance yourself from. I wish I could have that same kind of friendship with just one person.\n\nAnyway chin up and good luck with your studies! ",
            "God, I can't stand cheaters.\n\nYou have awesome friends, good luck with everything mate.",
            "Well you lost a bad girlfriend, and in the process realized that you had sooo many great, loving friends around you. I'd say you came out of this alright.\n\nHaving said that, it makes sense that you're hurting hard from it. Just because you've felt the loyalty and love from others doesn't always mean you can avoid the hurt. So don't feel too bad if you're hurting for a while. Time and good friends will help that, and it sounds like you have both.\n\nAs much as it would be nice to see your ex's life tailspin into oblivion, you should keep her blocked and keep any mention of her out of your life. Again, despite all she did to you, you loved the person you thought she was once. Talking to her and checking up on her will only remind you of that. \n\nI couldn't be happier that you've got so many supportive friends though. Hang in there man!",
            "Man, I just want to hang out with you OP, buy you a beer and invite you to hang out with my friends. You seem like a cool dude with a good head on your shoulders. ",
            "> \"Well maybe you shouldn't have fucked Mark then.\"\n\n> \"First month's free. If you need more time here then we'll talk about it.\" and winked. \n\nYou are surrounded by good people, barring Alexis & Mark (obviously). As you said fuck you Mark.\n\nEdit - \n\n>  I'm still going to be friends with Derek and Brooke but I'm going to limit my contact with them because they remind me of Alexis so much.\n\nThis part made me sad. Perfectly good friendships damaged cause of her selfish actions.",
            "Three times. How does the saying go? Guys overreport, girls underreport? ",
            "I'm so happy to hear about the progress. You did the right thing, but dont shut Brooke and Derek out as a housing option just in case. Beers are on me if you ever need a friend. ",
            "This is the best written, most human thing I have read on Reddit. Man, I love you too (from across the interwebs). Karma is definitely something Alexis has met now. Obviously, Im sorry for everything that happened to you, but youre clearly an incredible guy and things are already looking up.\n\nKeep it up man. Youve kept your head up through all this and it speaks volumes of your character. You may not forget this girl, but shes not going to forget this either. Youve probably stopped her from cheating ever again. Keep kicking ass. Dont forget the friends that had your back through all this. Lastly, I hope you meet the girl you deserve when youre back on your feet.",
            "As everyone has already said, keep your friendship with Brooke and Derek. If not, It'll be worse in the long run, because that feeling that keeps you from coming back to their place won't wash out easily, and you'll end up walking away from them since everytime you see them again you'll relate it to Alexis. \n\n\nAbout the room issue, I'd recommend you to use the month of rent that you are saving right now to buy a new bed/mattress and new bed clothing. I know is not the perfect solution, but every bit helps.",
            "It's almost worth speaking with her once more time just to ask how Mark managed to convince her \"3 times\" to sleep with him based merely on her inability to be rude.",
            "You should really embrace Brooke and Derek. I have pushed friends away before, and the only thing that comes from that is regret. These people responses on the best possible fashion. I understand that reminds you of the ex, but they are so much more than that and you still make new memories with them... without her.",
            "*slow clap* good on you for sticking to your convictions, you have some good friends. ",
            "Thank you for keeping us updated. Really sorry about what you went through, but I have the feeling you will come out of it a stronger dude. ",
            "You know what my ex cheated on me with a Mark, so yeah, fuck you Mark!",
            "Best of luck, bro. Handling it like a champ.",
            "I'm so sorry you're going through this. You seem like a really great guy and way too good for her. Keep your head up. As they say, it'll get greater later! \n\nI don't comment very often, but your post was very eye opening to me. (I have a personality disorder that makes it difficult to understand the impact my choices have on other people.) I'm not cheating on my (lesbian) girlfriend, but a couple years ago something happened while we were separated. She's had a hard time dealing with it since and now I better understand how that must have felt. \n\nSorry for the long comment. I know this makes me sound like a bad person. I just wanted you to know that you really helped me by sharing this. \n",
            "Well done, I applaud you for what you have done. If I were you I would have gone vindictive and made it my life mission to ruin her life by telling her parents everything she had done. You have great self-restraint and that is just awesome. \n\nI don't understand people who think they can just \"make it up\" by doing this and that. The fact is she cheated on you and lost your trust. How can washing your laundry and cooking for you for the rest of your life equal to that? She is literally putting a 'price' on your trust and to go as far as using sex as a mechanism to get a second chance, that is just laughable. \n\nI assume she never even told you about the 'kiss' she had with him prior to the facebook messages. Who does that??? Even after the fact you just pretend like that was OK?  How can anyone think like that?",
            "Dude, you are handling this so well!  Don't crack.  Stay strong and be the mature one.  \n\nGood luck!",
            "I'm so sorry this has happened to you. I know in a few months you're going to be so glad to be free of that mess and grateful that you weren't married or owning a house together. You deserve a loyal and honest woman, who will treat your relationship with respect. There are women out there like that, but for now, just enjoy uni and focus on self love!",
            "Hey man, thanks for the update! I was scrolling through reddit and saw this and was really happy you made an update because I was really curious what had happened!",
            "I'm very curious and would like to see the message she sent to you on Facebook. Any chance you could copy/paste it and just censor things as you see fit? It's a long shot, but I had to ask.",
            "Man this was some intense shit, I'm sorry bro. But if you could give us just one last update in a week or so, it'd be good to know how you've been coping. ",
            "I'm proud how you've handled it!! not giving in to her need for you now is commendable. It's so hard to find out about a cheating SO, but the way you did it she feels way worse than you. Great success",
            "Really really happy for you man! Keep going, life is full of surprises. Who knows, maybe in a month you'll meet someone else. Keep your head up and everything is going to be fine.",
            "Dude, good on you. You are handling this very sensibly. Keep your head and heart focused on yourself and your future. This is a time to be selfish. Be thankful for the AMAZING friends and family and strangers that have helped you get through this shitstorm. I know it sucks, but keep your nose to the grindstone and stay surrounded by the good people in your life. Not sure where you're located, but if you're ever up for a drink with a random stranger, hit me up.",
            "Good for you dude. Dont talk to \"alexis\" as long as you live",
            "I just came here to throw you some positive vibes. I've been thru some similar shit recently. \n\nBe proud of yourself for trusting your instincts. They don't lie. Pussy can make a man unsure of his own instincts at times. \n\nNow onto the revenge - being successful and enjoying yourself. Exes hate that. Be proud that your heart is in the right place and you're not a shitmeister. Some people are just fucked up morally and emotionally and there is no fixing them. Stay powerful my friend. ",
            "I hope you realize how amazing your friends are. Please don't take them for granted or shut them out for too long.",
            "Have you considered asking Will if he'd be interested in finding a place? He seems to be a solid upstanding kind of dude, and I can't imagine he enjoys living with that douchebag anymore. At the very least, it couldn't hurt to ask.",
            "You might want to ask your friends to not give you updates about what your ex is up to, such as her crying over you. While it may be funny in the meantime, you really need full no contact.",
            "A skeezy guy and a girl from a conservative small town are a bad combination. I think she learned a huge lesson at a great price. Keep getting back out there and keep adding to your circle of quality friends.",
            "I'm glad things are on the upswing for you now. They won't immediately get better, there's gonna be peaks and valleys for a while but you came out on the other side of this in much better shape than most people do. I was cheated on as well by my first girlfriend, reading your story brought back a lot of familiar and unpleasant feelings. But your heart is kinda like a Saiyan: every time it gets the shit kicked out of it, it heals up and is stronger than before. So you've got that to look forward to.",
            "I'm glad you haven't lost your friends! Keep in touch with the cool neighbor!",
            "You may never read this, but I'm so sorry about your plight. It sounds like you are already on the road to recovery and are handling this situation like a champ. Life has its ups and downs and I feel for you that this past month has definitely not been one of your ups, but you sound like the kind of guy that will make it out of this alive. Keep your head up, we're all rooting for you!",
            ">\"Bitch has been spotted in front of (classroom). Waterworks in progress. Proceed with caution.\"\n\nI couldn't stop laughing after that. Good on you, I'm glad your situation was handled and turned out the way it was.",
            "Sounds like you didn't fall for it, but the claims that:\n\n>She said they'd only slept together 3 times and she hated it, he had pushed her into it (\"not rape, but..idk I never said yes either\") and she was going to end it during the conversation I walked in on.\n\nIs classic cheater playbook.  She was minimizing the affair.  She was also deflecting the blame onto Mark, as if she was an unwilling automaton.\n\nI wouldn't be surprised if she was also trickle truthing (i.e. they had far more interactions, but is telling you a minimal amount she think you may believe and still reconcile).\n\nJust stay away from her, man.",
            "always got to have a test for your friends / people you know at some point. up to you whether or not they pass it.",
            "Its ok my man, I got cheated on a few months ago. Worst thing was, she left me for a guy who is over 60, we're both in our early 20's. Daddy issues",
            "I can see you are doing well trying to put this whole ugly mess behind you. When you finally tell your parents after finals try not to get dragged back down into it. You said your mom likes to ask a million questions and that they really liked her but don't let it consume any more of your life when you have to dredge that shit up for your folks. ",
            ">Side note: all names have been changed except Mark because fuck you Mark\n\nFuck you, Mark!! Hahahaha! I concur.",
            "Man I feel for you, but you are not the first person to find his girl porking another dude. Having been there myself a few times all I can really say is grow some balls and move on. Don't be petty by enjoying her misfortunes either, wish her well and move on, turn the page and look forward. Be the big person, you'll be better off for it. ",
            "Is this girl *for real*?\n\nGlad to hear you've had positive responses from the support and that your friends have your back!  \n\n\n>Remember how I said Alexis came from a conservative small town? Her parents had NO idea that we were living together and she constantly stressed that they couldn't know or they'd cut her off financially. They liked me enough to be polite, but they were constantly worried a relationship would distract her from school and didn't want her getting pregnant or whatever.  \n\n\nThere is a little, *sick* part of me hopes that this is inadvertent real-world foreshadowing.  \nHer excuse was just that she \"couldn't say no\" to fucking this ass-hat, Mark (*yeah*! Fuck you, Mark!), while keeping your full relationship under cover for *financial reasons?*  \nThe hell, lady??",
            "Don't think that all of us know it all are douchbags :P .but now to serious matter . I am tell you this as someone who was broken up by someone who just moved onto another guy the next day(someone I was worried about would cause our breaks up but I trusted my former girlfriend with that she felt she would never date him because he was too similar to her) and I think that you deserve more than Alexis and a better girl. About you calling yourself paronoid just remember to always be a little on the lookout but don't automatically assume. So be aware but not always worrying because of this. This girl is not most girls. You are a wonderful guy and here is a man hug ",
            "Read this message and honestly dude, I hope you know you're never alone if you need to talk. This hit me in my heart (my last relationship I thought my now ex cheated on me but i was never sure and never asked her about it), and I just want to thank you for sharing what you've been through because you seem like a genuine person. You skipped the first step that I was through after my relationship ended which was anger, which shows that you're a better person than I because anger was my first feeling. Stay strong bro,  you've got friends here if you need to talk",
            "Yeah, limiting time with the friends who just trounced one of their good friends for your sake sounds like a bad mistake on your part (of course she deserved it, and they know it, haha). Reward them for their kick-assiness, don't punish them for it. They obviously care about you a lot, and that includes enjoying spending time with you. I don't blame you for not wanting to be in that apartment anymore, but why look for new people if you have two of the most awesome friends in the world who'd probably be happy to room with you elsewhere? And maybe bro-of-the-year next door, too? Haha, just postulating.\n\nBut definitely don't limit time spent with your friends so much. Time  spent with them WITHOUT Alexis will shortly replace the time spent WITH her. It's worth it to keep amazing friends.\n\nI'm sorry this happened to you. It's amazing how trust can be abused so badly like this. I'm so sorry.",
            "I feel for you. You just lost someone important and your life is upside-down.\n\nI feel for her. She made a dumb mistake and now she is paying for it and realizing what she lost.\n\nThe relationship is broken and over. Ideally you would be able to put some sort of coda on this, but she's not in any mindset for that. I wish peace of mind and the best of luck for you both -- but I hope you find it a little sooner.",
            "Damn bro. I think you totally owe Will a beer or two, cause you know, kind strangers are hard to come by!",
            "A damn perfect ending. It's no wonder they think this is made up, but I want to believe. And so I shall.\n\nCongratulations, friend. Derek is also a great pal, so I hope you don't blame him for anything. I'm prone to being oblivious, and I wouldn't have even picked up on the hints that you elaborated on in the original post.",
            "This update is pretty stale by now but I just wanted to say that Alexis sounds like a spoiled little girl who usually gets her way by crying way through life when she fucks up. I've dealt with girls like this and they can be infuriating with their fucked logic and reasoning. Just know that your ex is an irrational human being that deserves what she got and you're better off.",
            "Brooke and Dereck sound like the real deal. Don't dump them because of the bitch. Random shit is going to hurt your heart for now. Hang on to friends though. These are good friends and one day you mught be able to do them a solid. \n\nChin up man, good luck with the exams and that, it will hurt but you'll get there.",
            "Worth the read. Good on you. ",
            ">he had pushed her into it (\"not rape, but..idk I never said yes either\") and she was going to end it during the conversation I walked in on.\n\nFuck off! Mark might be an asshole and a cunt but he's not a rapist. Trying to spin this in to some made up \"I didn't want to\" is absolutely horrific. \n\nAs for the rest of it - you are the man. I will toast the nearest drink in your honour, which this morning is only tea but whatever.",
            "I don't know how much it means from a random internet stranger...but I'm proud of you.",
            "Fuck, this is nice dude! I hope you know that you are in a much better place with her gone! It was even more obvious after reading what she offered you :/ btw, if you can handle it, you really should consider moving back in with your friends, they sound like really great friends, and it would be a shame if you drift apart :) Good luck dude, and remember, you reeeally dodged a bullet.",
            "You have awesome (for lack of a better term) friends, don't lose them for her, she's not worth it. Try to do stuff with them, so that you don't associate them with Alexis anymore, tell them how you feel. and don't forget that you also owe them some because of the piece of mind they provided right now. Also try to do some physical activities, just running is fine. You need to evacuate. Stay hydrated, not drinking enough water is one of the easiest way to be sleepy and think of the bad stuff.",
            "You are a hero, honestly blown away not only by how you handle it and yourself, but that you still make time to see your friends and focus on school.\n\nSeriously so much respect. I could learn a lot from you ",
            "You need a good cry man.  ",
            "Hello mate.\nIt was very interesting to read your story. As everybody say as time passes it hurts less. And here's no reason no to believe in these words. I hope you'll still be friends with Brooke and Derek and I believe I know how you feel now but I'll strongly recommend you not to reject any possibility to come back to your apartmens. It seems that your room will remind you about your ex and her cheating but you'll never forget what she have done and I think its easier to change bed linen than home, right? But meeting new people is really refreshing.\n\nSorry for obvious words and my poor english. Wish you all good!\n",
            "Don't fall for the \"do anything to make it work\" bullshit. Period. Cheated on in august of '13 and was told the same shit. She did what she said for a while, then I allowed it to fall back into the same spot. Less than a year later (July 2nd), she broke up with me because she wanted to fuck other people. Just. Don't. Bother.",
            "Man, stay strong! I just had to re-read everything to be up to date. And as I read I realized she did the trickle truth. \"We didn't do anything - We only slept three times - I didn't want to\". So more stuff might come out further down the road. Hopefully she'll just dig her grave even deeper.\n\n\nBut anyways, mostly wanted to say - You'll probably have feelings for her, it's abrupt going from a relationship to nothing that fast. But bear in mind that you are doing the right thing! It's gonna be hard but it's worth it! \n\nIgnore her and move on.\n\nBest of luck in life, and if ever in Sweden - drinks are on me!",
            "I love you too, bro! You'll get through this.\n\nPost another update one day, pls?",
            "You have such good friends.  Please don't limit your contact with them... you need to start making memories with them the don't involve alexis. Otherwise you'll never be able to hang out with them and the bitch will have won.  ",
            "Don't cut your true friends out...that's how you show strength....gotta say man...you dodged a huge bullet...clearly you will come out stronger  ",
            "The person with less emotions invested in the relationship is the one with the power.  Believe it or not, you have the power. Use it by walking away. Don't be mean; just break all contact and don't be there (block on all social media, etc).\n\nShe screwed up.\n\nShe didn't value your relationship. \n\nShe gets to feel like shit.\n\n",
            "All I really have to say man is that Brooke was way more of a bro than you expected. Don't cut them off I think. They had your back and while it is a hard reminder they were there for you. They deserve to know they made the right decision. They don't want to lose you.",
            "Once someone steps outside of a relationship for sex, statistically, they'll do it again. So, she sounds repentant and you shouldn't be mean, but decide if you want to be with someone knowing about that looming eventuality. ",
            ">She said that he'd been flirty with her in the halls and she tried to be friendly back, but it must have come off as flirting because he kissed her mid-sentence one day. She said she felt guilty that she \"led him on\" and that guilt prevented her from shooting him down in future advances because she felt like it was her fault it happened and she has trouble saying no (???) She said they'd only slept together 3 times and she hated it, he had pushed her into it (\"not rape, but..idk I never said yes either\") and she was going to end it during the conversation I walked in on. \n\nThis right here is the sign of not accepting her responsibility for her actions.  \n\nThis right here tells you that she has no real remorse. \n\nThis right here tells you that you did absolutely the right thing.\n\nYou seem to have your shit together, have a bunch of good loyal friends, and a good support system to help you get past this in due time.\n\nGood luck and kick ass at school.  Mission in life always come first.",
            "*She said they'd only slept together 3 times*\n\nThis line will probably cut through you like a knife every time you think about it for years. Use your amazing support system when you're feeling down, it's something not a lot of people have the luxury of having.\n\nAnd I agree with everyone, as soon as you're up to it, hang out with Brooke and Derek more. It may be awkward or bad at first, but they sound like amazing people. You could have gotten cheated on, and then had your friends take her side, which would have been almost as bad as the cheating made you feel. Instead, they are completely on your side and will help take away a lot of the pain. ",
            "This message my be late but just wanted to say you handled everything in a mature manner. Jedi status! Up vote. ",
            "Looks like karma ran over Alexis, makes sense, bitches get along really well. I'm happy for you! Now just move on with your life. \nP.S: Don't cut out your friends just because they remind you of Alexis. Instead, remind them as someone who were there for you regardless. Clearly they're people you want to have in your life. ",
            "Dude! Don't know if it has been said already, but you and Will should totally be roomies!",
            "Just a heads up. If you get back with that girl, you're fucking retarded. I hope you stay strong. ",
            "You're an inspiration, man. I know what it's like to be in your situation and the way you handled it has given me a new perspective on everything.\n\nI wish you all the best, man. Your Reddit bros will always be with you lol.\n\nGive us one more update so that we know you're all good :)\nTake care.",
            "Hey, OP your story was pretty inspiring. You're really lucky to have such great friends who have your back. Although we are strangers to each other, I am really proud of you. Even though you went through some real tough shit, it's amazing how you are using this oppurtunity to better your life. One day you will look back on this moment and be grateful of how you handled it, and the people that were by your side when it happened. I wish you the best in your undergraduate program and the rest of your schooling. Good luck with everything bro.",
            "I just read all of this and I'm really happy and glad with the way that you handled it.  It seems a very mature way to handle what's going on and it's something I'm not sure I would have thought of to do.  But I'm very very happy for you that you were able to get to the bottom of it and be able to sort everything out.\n\nI wish you the best of luck in finding an apartment, getting into the grad school that you want, and just being able to get on with your life.  Alexis is the past and everything else is going to be fantastic.  What would the good moments be without the contrasting shitty moments?\n\nBest of luck to you, my friend.  ",
            "Next time she's outside of one of your classes, just keep giving her the finger as you walk by without even making eye contact. ",
            "Well that was a roller coaster of emotion. Stay strong, buddy! You have some great support. ",
            "Honestly, all I want to do right now is give you a good bro hug! Good for you. And please don't lose contact with those friends. You're going to be thinking of Alexis anyway. Hang out with them more, maybe. But hey, it's your call. All the best for whatever you're doing!",
            "Ok, dude...again, really sorry for you. Thanks for the updates. Everything you're doing is good. Not reading messages doesn't make it better. You're just constantly going to ask you what they contained. Blocking is the best move now, she clings. Her \"promises\" are desperation acts and you're smart enough to realize that...thankfully. Many dudes and gals aren't...  \n   \nThere is just ONE thing I recommend now...DO NOT limit your contact to your friends. They were there for you when you needed them and they seem to be real friends. It's not fair towards them to not keep them as normal friends now...they may remind you of her, but contact with friends is the best cure...trust me on that one...good friends will listen to you, cheer you up and be understanding. All I have to add. Cheers, mate!",
            "DONT FORGET DERAK AND BROOKE THEY ARE SOME GOOD FRIENDS!!! KEEPERS!!",
            "I just noticed that your first update has become the single highest upvoted post in this sub, so you can at least take some solice in that. ",
            "Get laid. You'll feel better ",
            "You will come back stronger and wiser after all of these. I'm glad you're surrounded by good people. I wish you all the best man. ",
            "Take the advice OP!! I just finished reading all 3 posts and you had me in an emotional rollercoaster!!!!! Seriously I'm really happy for how it ended and I love how emotionally strong you are. \n\nShe cheated on you and that happened, you can't do anything about it. So like the other users said, make new memories with Derek and Brooke, it'll be worth it in the end. They have proven themselves to be great REAL friends. If anything you can still move in with them, I am sure they might be struggling with the rent now that it's split 2 ways. \n\nThat brings me to my next point. Derek and Brooke still kicked her out knowing it was gonna make rent harder and even knowing you might not wanna go back. They still went through with it and even though rent is only split in half they still give you the support. Specially if they haven't even mentioned the rent to you, they're real friends and you should be happy to have them, don't let what alexxis did blind you to them.\n\nI'm really happy for you OP, I was cheated on, but sadly my story didn't end as good as yours did. But it's stories like yours that make me wanna keep meeting people and know that there's still good loyal people out there. You just lifted me up from the memories of my ex. \n\nI hope you read this and Thank you for sharing your story.",
            "i love the whole \"treating you like a king\" bit. yea that would last a month till she starts pulling the \"well when are you going to stop hanging this over my head\" and \"i've more than made up for bit\".\n\nalexis is a piece of shit. (i'm also no nonsense) brooke is awesome and i'm pretty sure it's because alexis hurt her friend. yes she's closer friends with alexis prior to this but she hurt a close friend regardless. that close friend being you. i've dropped a friend i've known since childhood because he tried to dick over a mutual college friend we had. \n\ni hope everything works out better for you. and you seem to be blessed with a great support group from friends and the family you're staying with. please keep up us updated with the positive stuff too.\n\nthe only piece of advice i'd have to give is i wouldn't rule out giving alexis a piece of your mind when youre calmer. i had an ex cheat on me and i just went on ignore mode but to this day i wish i could run into her and have a cathartic release of all the bullshit she tried to pull.\n\nanyway good luck again and props to you bro for handling it the way you are. also props to all the people that have supported you. ",
            "I didn't even need to read the original or first update stories to know that you are the better man here. I am sorry you are hurting and yes Reddit seems to be the place for support. Stay in contact with your best friends even though they remind you of Alexis, you'll always remember her, at least till you're 40....LOL\nKeep your ground, stay strong and don't jump into another relationship or become a playboy. That'll just fuck with your head worse.\nSo that's my 2 cents. :)",
            ">Side note: all names have been changed except Mark because fuck you Mark\n\nThis is how I know you're going to be OK.  My kind of guy.",
            "Like I said, there's no revenge sweeter than going no contact and just not giving them an inch.  All the pain you think you could inflict on them yourself, they do it for you.  And it's just the icing, because the main purpose is protecting yourself.  Bravo.",
            "So, I've been fallowing this saga since the beginning, and I just want to say: You're awesome!\n\nDespite the shit going on with your ex right now, you are one strong motherfucker, and you have some awesome friends.  I know seeing Brooke and Derek right now may be a bit painful, but don't push them away.  You need as many friends as possible, and (this may reflect poorly on my character, but...) if I was you, I would love having that direct line to Alexis just so I'd know how miserable she is because of her own stupid mistakes.  I'm not saying use your friends for this purpose, of course, but having been cheated on by all of my previous exes, having someone to talk shit about said exes has always helped the healing process.  Not to mention, your friends also feel betrayed by Alexis, and I'm sure they would love, love, *love* to have a bitch fest with you. It's petty, but, man, it really helps with the healing process.\n\nGood luck with exams and applying to grad school!  If anything, you are now free to really enjoy what the next few years have in store for you!",
            "\"only slept together 3 times\". Only? *Only*.\n\nYou only stuck another dude's dick in your orifices, a dude who is not your bf. Go to hell with your 'only'. Fuck that made me mad.",
            "This story hits home for me. I know how it feels to be in love and have it stolen from you all at once.  I wish you the best.  \n\n\nSorry.",
            "This makes me so fucking happy. ",
            "I survived my own \"Alexis\" 3 years ago.\n\nShe was so sweet and innocent and selfish and  poisonous, it makes me want to vomit. ",
            "Late to the party here, but you should try meditation dude. I know it sounds like a dumb suggestion, but it helps with depression, and absence of thought sounds like it'd do you some good right now. Good luck, and don't shut out your friends.",
            "sad doge face :(",
            "You go bro! I'm extremely sorry about the situation, but i'm happy things are gonna go uphill for you very soon! She's not worth the worrying anyway, hope all is well.\n",
            "First of im so sorry to her about this ( I know im a bit late) but could you maybe give us an update of how things are going know? Thanks",
            "I'm way late to the game, but it would be great if you updated at some time with any new developments.  Not being condescending at all, but for a 22 year old you handled this fantastically.  I wouldn't have done as well at 45.  Anyway stay strong.  If she was your wife I could understand reconciliation if you were up for it, but with a girlfriend forget it.  You would never be able to trust her again and that's no way to live.",
            "stay strong brother."
        ]
    }
]