[
    {
        "post_id": "3gh8e3",
        "author": "hw32",
        "title": "Me [33 M] widower I am scared to death about potential g/f (embarrassing update)",
        "url": "https://www.reddit.com/r/relationships/comments/3gh8e3/me_33_m_widower_i_am_scared_to_death_about/",
        "score": 2218,
        "num_comments": 138,
        "created_utc": 1439222841.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/3g6j8y/me_33_m_widower_i_am_scared_to_death_about/\n\nI wanted to thank everybody for the kind words in my first post.  Honestly it meant the world to me.  Trying to balance new feelings against the guilt of feeling like I'm betraying my wife is still a struggle but I am getting better at it.\n\nThe reason for this update is to let you know how Saturday's date went.  If I wasn't at the center of this I would probably find this funny but as it stands I am embarrassed (but I will admit looking back I still find it funny).\n\nStacey came over about mid day Saturday and we were going to watch a movie that both of us wanted to see that was on Netflix.  One of the posters in my first thread suggested that when I was sitting next to her on the couch that I should put my arm around her.  I thought this was a good idea and a way to just see where things go.\n\nFirst of all a giant thank you to the person who wrote that, can't remember the name right now, it was perfect.  As we were sitting on the couch she sat down right next to me.  I slipped my arm around her and she immediately laid her head on my shoulder.  We watched a little of the movie then she started to hold my hand.  I looked down at her and we started kissing.  Well one kiss led to another and things escalated from there.  Just before the big event was about to occur she asks me if I have any protection.  D'oh!!!!\n\nI then tell her I don't and this is when things went from playful to dead serious in a matter of seconds.  She ask's me what have I been using for protection.  I then explain that I haven't been using anything because this was the very first time I had been with someone in almost 4 1/2 years.  I guess she had no idea.  This then led to a me explaining she is the first girl I have even dated.  For whatever reason this made her tear up a little which freaked me out.  Believe me the last thing I wanted was to upset her and mind you I am sitting on my couch in only my underwear and very excited.  I start to apologize and tell her I'm sorry for upsetting her.  She tells me not to be silly and that she just got overcame with emotion because it made her feel very special and we hugged.  She of course is in her underwear as well so the hugging did not help my excitement any.  \n\nShe of course is finding this funny.  We both get dressed to go to the store as I then had to confess I've never worn a condom in my life.  My wife and I were just very very very lucky when we were kids.  I used to just pull out early which after I got older I realized how dumb that was.\n\nAnyway we go and she picks out a box and we head back home.  She kisses me as I am coming through the door and we start all over again.  She has figured out that there is a place on my neck that she can kiss that makes my hair stand on end on my arms and obviously make another part of me very excited.  We hit the couch again and this time the underwear comes off and I am ripping into the condom box and tear open the package and put the damn thing on and just as I'm about to enter her my door bell rings and we both realize that it is now 7 and my BIL & SIL are there to meet us to go out for dinner.  Yes this was pre planned and yes we both totally forgot.  \n\nI am about to scream out of frustration at this point but we both quickly put on our clothes and she is sitting on the couch laughing hysterically.  I go answer the door and they come in.  My BIL starts talking and my SIL sits down on a chair next to Stacey and they start talking, now mind you she is still giggling.  My BIL God love him is a great guy but totally oblivious to things sometimes (even when he was a kid he was like this) and he just talked the entire time to both of us.  I sat down next to Stacey and held her hand.  Then there came the moment I realize that there is a torn open box of condoms on the floor and an open condom wrapper on the footstool.  Before I could cover it up with a magazine my SIL notices it and the look of (I'm not sure what, horror maybe) on her face was something to see.  She then makes eye contact with me and we both turn three shades of red.  All the while my BIL is going on and on about something.  Stacey is again laughing hysterically.  We pile into their car and go off to dinner.  Stacey is taking great delight in tormenting me.  Every now and then she leans over and kisses my neck and start whispering things in my ear and honestly I'm about to lose it (hey its been a long long time).\n\nWe get to the restaurant and I have to go pee so I leave to go the bathroom only to find out that I am still wearing my condom.  The guy at the urinal next to me was traumatized for life.\n\nAnyway I don't think I was great dinner company as all I could think about was seeing Stacey without her clothes on.  I tried to pretend to care about conversation but not really sure I succeeded.  We then went and saw the new vacation movie and then they took us home.\n\nAfter they leave Stacey tells me that she is tired and is leaving to.  I am sure I looked like a beat puppy dog at this point and she starts laughing again telling me she is teasing me.  She walks over grabs the box off of the floor and takes my hand and leads me upstairs.\n\nWithout going into great detail let's just say I am glad I bought a box and not just one.  I woke up the next morning holding her in my arms and honestly nothing has felt this right in years.\n\nWe spent all day together on Sunday as well.  I just came out and asked her what she liked doing and much to my surprise she listed off several outdoor things, who knew?\n\nI am really starting to have very strong feelings for Stacey.  Honestly when we are apart now things don't seem right to me.\n\ntl:dr:  Arm around her during movie worked like a charm, things happen, SIL & I embarrass each other, night ended magically.",
        "permalink": "/r/relationships/comments/3gh8e3/me_33_m_widower_i_am_scared_to_death_about/",
        "comments": [
            "I laughed until I cried at the image of you at the urinal realizing you're still wearing the condom. If you two end up together long term, that story will keep you laughing for decades. ",
            "Thanks for the laugh. Seriously, I was cracking up. Stacey sounds like a total sweetheart. I'm very happy for you two. Enjoy the bangin'!",
            "> First of all a giant thank you to the person who wrote that, can't remember the name right now, it was perfect.\n\nHiii.\n\nThis update is my favorite thing on /r/relationships ever. ",
            ">We get to the restaurant and I have to go pee so I leave to go the bathroom only to find out that I am still wearing my condom. The guy at the urinal next to me was traumatized for life.\n\nIf for whatever reason there is a next time, you make direct eye contact with the guy and say \"Always be prepared, son.\"",
            "Made my fucking week. I am always scared for people who lose their SO, so much to get through to find love again. And truly, love is what you need when you lose someone! Luckily you weren't older and there weren't kids/other factors. \n\nI feel so bad for people whose children won't let them move on. On the other hand, I can see how it is for a kid losing a parent and having them \"replaced.\"\n\nSorry for the rant, but this story made me so damn happy. Good luck in the future!",
            "This one is like the /r/eyebleach of /r/relationships",
            "Great post OP.\n\n\nJust watch out for Stacey's mom",
            "That's awesome, Stacey sounds like an awesome girl.",
            "What a great update.  Good Luck",
            "Ahh, the good ol' Netflix & Chill... works every time.",
            "I've always wondered if men sneak peaks at each others' dongs at urinals. 26 years of mystery, finally solved. ",
            "So happy for you man, reading this update has been the highlight of my day. All the best.",
            "This is the sweetest story i have read in a long time. I hope you keep us further updated.",
            "Great story!",
            "Oh my god I'm giggling at you still having the condom on. That's adorably mortifying. \n\nI'm really happy for you. You can move on and still cherish memories of your wife. You deserve to be happy. And it sounds as though you make a good match. Best wishes to you both. I hope things continue to develop. ",
            "This is the most adorably wonderful thing I've read in a while. \n\nStacey may not be your next \"the one\", so don't be destroyed if she isn't, but she is a *good* one. No matter what happens, she sounds like an amazing person to rediscover this part of yourself with. \n\nAlso, this turn of events made me laugh. so. hard. It went perfectly, as only imperfect things can; I've never had a perfect day that didn't have any hilarious \"mistakes\", never had a perfect day that didn't have any supposed imperfections; those imperfections make things real and they are what makes remembrance take on a sudden rush in my memory when I look back. And I've had some perfect days. \n\nHave fun. (Sounds like you already are.)",
            "What a ride! There was emotion. There was humor. There was (shit tons) of sexual tension. 10/10, would see the movie. Honestly, best update I've ever read in here. \n\nSeriously, I'm happy for you, OP. Good luck.",
            ">We get to the restaurant and I have to go pee so I leave to go the bathroom only to find out that I am still wearing my condom. The guy at the urinal next to me was traumatized for life.\n\nIt just doesn't get any more awesome. You, sir, are awesome. Stacey's a lucky gal and it seems she knows this.\n\nThanks for the laughs and for being able to laugh at yourself.",
            "Awwww that was a nice update. Even after all the messed up. Best of luck to you. ",
            "This post is hilarious.",
            "Awesome update and you're a great writer. On behalf of Reddit, thank you for the formatting. \n\nI hope you have learned to stop feeling guilty, you deserve happiness. Some people love for a lifetime, and some people are lucky enough to love for two. ",
            "This was a goddamn adorable update. Posts like this make spending time in this sub worth it. \n\nBest of luck OP, hope everything goes well :)",
            "I was having the shittiest day until I read this. Favorite reddit post of all time.",
            "So cute. I love this.",
            "So happy for you!!  And what an awesome inside joke to share.  Sometimes those awkward moments are just what you need!",
            "Kudos! I'm sad I missed the original message so that I could be even happier for you having lived through the anticipation. Awesome post! ",
            "This post makes me happy.",
            "Widower here.  Good luck to you and her, because I think you've got something going, and I think it's awesome.",
            "Great story op!! very heart-warming :)",
            "Awww that was a great story. I'm so happy for you! :)",
            "That's a wonderful story and she is a *very* lucky girl.",
            "Eeep! This update made me giggle and smile. You might want to save this somewhere to access later in a personal file. I know if I were Stacey, I would love to read this story down the line if you become more serious and relive how adorably anxious and excited you were! Good luck to you both, I'm happy you're happy.",
            "This made me smile so much. :)",
            "I was so excited to see this update. I was hoping for an epic date story from reading the title, OP delivered. Congratulations on your relationship and best wishes!",
            "I love this update! I wish there were more happy updates like this! Wishing you lots of continued luck with Stacey!",
            "This is such a laugh out lod funny story, OP. I think you should sell the rights for the movie :D.",
            "This is my all time favorite update ... ever.",
            "I think this is my favorite ever update. ",
            "AHHH this is amazing!!! ",
            ":))",
            "That was an awesome update!  Have fun OP, you deserve it.",
            "Aaaaaw, you guys sound so sweet!",
            "whooohooo! I'm so happy for you. :-)",
            "Still laughing!\n\nGlad the date went well!",
            "So sweet!",
            "Someone's been cutting onions up in here. ",
            "Big points for her being so cool about everything. I read so many stories of people worried about similar situations or horror stories where girls just walk out. She handled everything absolutely perfectly, sounds like you two have a very bright future together!",
            "Omg. I got so lost in reading and commenting on the original post that I forgot it was linked through an update. This was awesome and hilarious to read! Good for you OP!!! I read this to my SO while cracking up and he just goes \"oh sure, it's always funny for girls!!!\" ahh what a good read. :)",
            "Thanks for your story!\n\nIt's funny and sweet, and tells so much about how great relationships (and great sex) can be when mixed with humor and open feelings",
            "I was right! You do got this!\n\nGood luck, op. Have fun with your new relationship.",
            "This may be one the best first date stories I've ever heard",
            "This was adorable and you have to keep updating!!",
            "Yehhh so happy for you. Best of luck OP.",
            "This was hilarious... Good luck OP, sounds like a good start! I just feel bad for your bathroom fellow, the poor guy.",
            "This made me laugh so much. Amazing. Beautiful. I'm so happy for you, hahaha!",
            "This will make a great 'first time' story to remember later in life. Sweet.",
            "Hilarious and awkward. The best kind of date.",
            "That was beautiful. Well done buddy!",
            "Awesome story! This is one of those things that becomes a life event memory that will always make the both of you smile. Priceless.",
            "Hahahaha I wish you the best of luck, /u/hw32 :)",
            "Great update! It sort of reminded of the \"40 year old virgin\" movie. Your story would make a great romantic comedy!",
            "What a great story for you two to look back on and laugh about. Stacy sounds lovely, I hope you guys have a wonderful, long relationship. :)",
            "Hahaha, I love hearing with the arm thing works for people. :) \n\nMy boyfriend did the \"yawn and reach\" thing on our first date lol. We immediately cuddled after and I still remember how quickly his heart was beating! 5 years later we're still together, so it must be a pretty good move. ;) ",
            "> traumatized for life\n\nDid you start to piss while still wearing it? ",
            "abcd...",
            "This was the best update ever. Thank you for sharing. I am so happy for you!!",
            "This is adorable. I'm sorry for your loss and I'm glad things are working out for you with this new girl. This is probably going to get buried but I still wanted to tell you how cute this story was. ",
            "This is the most charming story I've ever seen on Reddit. Congratulations and good luck!",
            "That is hilarious!!! Am super happy you both connect and obviously really enjoy each other. You deserve to feel happy and clearly Stacey does that.\n\nHave fun!",
            "This is the best thing I've read in a long time, and made me so happy. Thank you for sharing. It's weird because I met my ex husband at 16, and after 20 years we split up and I'm going to be new to the dating world myself. Eee, scary stuff. Your experience gives me real hope.\n\nMy name is Stacy too. That made this even more fun to read.",
            "I laughed, and then cried, and then laughed some more. OP you sound just wonderful, you deserve so much happiness and I sincerely hope this budding relationship with Stacey will be the first step towards a lifetime of happiness for you!! All the luck in the world to you friend.",
            "This is the greatest update of all time. Saved.",
            ":D\n\nThat was amazing! ",
            "Dude. So awesome. So happy for you.",
            ">I am really starting to have very strong feelings for Stacey.  Honestly when we are apart now things don't seem right to me.\n\nCareful here. You've only never been in love or single. As a love addict myself I can tell you these feelings can get confusing and complicated. Take things slow in the feelings dept and don't be surprised if she doesn't reciprocate immediately. You can't really be sure what you feelings are because you haven't dated enough to tell the difference between infatuation with a date and love.\n\nThat being said, it isn't uncommon or wrong to have feelings either. Just be aware that they may not be what you think they are. It could something teenagers have to deal with called puppy love, or it could be real. You don't have the experience with your own emotions in the dating world to be certain of either. \n\nAs someone who has this problem with every person I date (Yes, sadly that's a thing, but thankfully not for everyone), I suggest you let her set the pace for the relationship. But don't be afraid to tell her when its too fast either. It's a balancing act that most people deal with early, but without that background all I can say is good luck and you will figure it out. Especially once the first blush of the relationship wears off.\n\nHere's hoping it's a real second chance for you. Your wife would be happy you're able to live on.",
            "I honestly can't believe people think this is real. I just realized that most people on this sub know nothing about actual relationships.",
            "You should submit this to a director and have this made into a movie. This is such an amazing story and I feel like having such a story like this will make you two grow closer so much faster. ",
            "hey hey hey don't knock the pull out method. Worked great for me for 12 years. It worked so well I was starting to think my boys didnt swim. Then when we got married we stopped pulling out and if it happened we were ready. Well shit it happened right away. Had a 2 month old on our 1 year anniversary. So i have perfected the pull out. \n\nAnyway great story glad you are happy. I was teary eyed then I almost cried laughing when you left your condom on. Good stuff. Wish you the best.",
            "I think you might be Ben Stiller in a rom com.  But I can't be sure.",
            "noice.",
            "Glad you are getting on with your life, and it sounds like you picked a winner!\n\nOr did the winner pick you?",
            "Man this was hilarious. Good stuff. Sounds like things are going good.",
            "Awwww that's so nice. Good things do happen to good people!",
            "I don't think it's embarrassing, I think this is a great story! Glad everything worked out well for you.  ",
            "Dude that's not embarrassing that is awesome! You'll look back on it and laugh soon, I swear",
            "What an amazing story and it is great to see that your new partner was up to the task of helping you, even when it required a great deal of humor!",
            "Hangin' and bangin'. Way to get back out there Sport!",
            "Your happy ending put a smile on my face. Enjoy yourself. ",
            "This was so sweet and funny, it made my day to read it. Good luck to you, OP.",
            "Damn, she seems like a dope ass girl! Congrats",
            "reading this update made me so happy. I'm glad everything worked out so damn well! cheers buddy!",
            ">we were going to watch a movie that both of us wanted to see that was on Netflix. \n\nYou really are new to this!",
            "I love this!!\nI laughed real hard at the condom on in urinal...\nLove a happy ending...",
            "Oh my god, I laughed out loud harder at this than just about anything I've ever seen on reddit.  Amazing, man, and congratulations.",
            "This story is the cutest thing, I'm happy everything worked out",
            "This is... ADORABLE😍 I love it. Oh new love, there's no feeling like it!! Enjoy it you crazy kids",
            "Just as an FYI, \"pulling out\", if done correctly all the time, is 96% effective. Shocking, I know, because high school health class tells us it's a bad idea.. Mostly due to lack of protection against STDs. Comparatively, hormonal birth control is 99% effective, the male condom is 98% effective, and the female condom is 95% effective. You can check all these statistics on Planned Parenthood website. So, no, you weren't \"lucky\" before... You pulled out and that's why you didn't have any accidental pregnancies! Just thought I'd clear that up in case you were worried about being infertile or something.\n\nCongrats at your happy update :)",
            "youre a 33 year old father with the mentality of a 14 year old who just saw boobs. Didn't know you left the condom on till you were in the urinal? Embarassed you use condoms? at 33? This shits made up",
            "When tge want the D...you gotta give it to them. "
        ]
    },
    {
        "post_id": "9krg8z",
        "author": "northjace",
        "title": "[UPDATE] How do I [26M] tell someone I'm really into them without damaging an incredible friendship?",
        "url": "https://www.reddit.com/r/relationships/comments/9krg8z/update_how_do_i_26m_tell_someone_im_really_into/",
        "score": 2220,
        "num_comments": 105,
        "created_utc": 1538493086.0,
        "selftext": "Link to original post: https://www.reddit.com/r/relationships/comments/9im0x0/how_do_i_26m_tell_someone_im_really_into_them/?utm_source=reddit-android\n\nSo it's been about a week. I told her everything. I told her how much it was eating me up inside to tell her this. It could not have possibly gone any better. She feels the same way I did. Our friendship seems to have gotten so much stronger and no matter what I told her, she told me our friendship was solid. I thanked her for always being there for me when I was going through rough times as I did the same for her. She told me age does not matter to her at all, she is 20 as I just flat out asked her cause I really needed to know. No boyfriend. She told me she's always felt some kind of strong connection between us, a \"weird, but good weird connection\" her words. I asked her if it was possible she had a stronger than friendship feel towards me and she said yes and I couldn't be happier. At the same time, we decided to see where this goes and whether it becomes something we both want to pursue so time will only tell. I thank everyone for their kind advice. Thank you fellow redditors.\n\n**TL;DR - I told the girl I have a huge crush on that I do and she felt the same about me. We are currently deciding if we are going to pursue it further. Friendship grew stronger.**",
        "permalink": "/r/relationships/comments/9krg8z/update_how_do_i_26m_tell_someone_im_really_into/",
        "comments": [
            "This update made me smile. Hope it works out for you both :)",
            "Right on! I struggled with this for a couple of months and finally just asked my friend out yesterday.\n\nShe said yes :)",
            "Congratulations, glad it went well.\n\nSide question- you guys have video chatted before? There is always a chance of getting catfished in this situation, so I'm just asking if you've actually seen each other.\n\nUse this as positive reinforcement that it's okay to ask questions. If you want to build a *real* friendship, you need to know the other person. Asking personal questions is okay. Asking someone's age is not offensive. \"What's your favorite food\" or \"what do you like to do for fun\" is not prying, it's curiosity.",
            "[removed]",
            "\"she told me our friendship was solid\"... So you're friends.",
            "I know some of y'all are reading this post, feeling all warm and fuzzy inside and all encouraged to tell your best friend you like-like them. I'm just here to remind you:\n\nSOMETIMES IT DOESN'T GO WELL THOUGH. SOMETIMES IT GO REAL BAD.",
            "Based on the comments here I feel like no one read the original ",
            "If you want to remain friends, don't have SEXY TIME",
            "Congratulations. Wish the best for you my fellow human. \n\nI can tell you from experience, dating the friend you have a close friendship can be one of the best feelings ever, you'll be on cloud nine. But remember, like any relationship should it be persued, it will have its ups and downs and it may or may not work. If you dive in too deep and it falls apart, you have to be prepared to lose this friendship you worked so hard for. Its sad and a hard truth to accept but that's life. \n\nIf you both talk about it and agree to go forward, by all means do so but have that talk first. Everyone always says \"oh no that will never happen to us, we can make this work\" i said the same the thing. Some people can stay friends after if it doesn't work, others are not so fortunate. Myself it was unfortunate. I lost a friend of 15 years, a friendship that was close, strong. \n\nI don't regret the beautiful memories we created, but if I could go back and keep myself from asking her out, i would. I lost love, my girl, & my best friend. Life is unfair that way. It hurt, it hurt so much more than i thought it would. \n\nI'm not saying it won't work for you two, it sure as hell can. I don't say this to scare you or keep you from doing what you feel is right but to let you know that you have to be prepared to give it all up. \n\nJust a thought. Good luck OP",
            "Hey man I just wanted to let you know good job following your gut instinct. Hope it all pans out for you.\n\nA good friend of mine met his now wife (married two weeks ago) while playing Destiny. ",
            "I'm happy everything worked out for you OP! I met my husband on chatroulette, of all places, and we were also living on opposite ends of the country at the time. Don't let any of the naysayers take away your high right now! Anything is possible (:",
            "This isn't going to end well ",
            "* SO lucky, I went through this EXACT scenario and we decided to stay friends because that bond was amazingly strong. I am glad to hear what happen :D",
            "Hate to be too negative, but I think if she knew your age first, there’s a good chance she’s younger than she says she is, especially since she gave basically the youngest age someone your age could reasonably date.",
            ">She told me she's always felt some kind of strong connection between us, a \"weird, but good weird connection\" her words. \n\nTo be honest, when i hear this line, it makes me feel like this is going to be one of the best relationships ever.",
            "As someone 6 years older than their so,  whom I met in a video-game....  I'm happy for you :)",
            "Awe, I’m happy for you both!",
            "Yay! Good for you! I wish you two the best of love!\n\nI told my now-husband how I felt and he was afraid of ruining our friendship. A week later, we gave it a shot. That was 16 years ago, and we are very happily in love still. ",
            "> She told me age does not matter to her at all, she is 20 \n\nSix years is not much of an age distance, and it will be even less so as you age. My parents married at 20(f) & 25(m). They were married for over 30 years till death did they part. \n\nGood luck.",
            "Yay! These are rare, I hope you guys make it work! ",
            "Yay! These are rare, I hope you guys make it work! ",
            "Good realistic outcome. Good for you op!",
            "I feel like in our early 20s alot of relationship issues are more as if youre into one another. It's so formal, you express you're interest, decide if you two should progress and how to do so. Than once you're in your 30s, its more less formal. You ask them out on a date, and by the third date (sometimes first) you've already have an understanding if its worth investing more time in. ",
            "That turned out much better than I expected.",
            "Now pinch yourself lol",
            "How do you feel about long-distance relationships? That should always be important to consider in situations like this one.",
            "My best friend told me about his feelings for me a little over two years ago. He said he was worried about our friendship at first... now he’s my husband :) \n\nHappy for you, OP! I hope you guys give it a shot. 10/10 recommend dating your best friend",
            "Fuck yeah edit! I hope all goes well mate.",
            "I'm happy for you two. :)",
            "This was a great read after waking up, congratulations dude and good luck with the future ",
            "I met my SO playing DFFOO, a mobile game.  :D  I confessed to him too, and he took a while to answer, but we're together now.  I'm 7 years older than him, and we are meeting for the first time next week.  <3  I hope everything works out for you guys as well!",
            "I am really happy for you. I am in the same boat and I have strong feelings for someone I've been talking to for 3-4 months and I am scared to tell him again how much I like him and want to meet him face to face. I hope eventually I'll work up the courage and tell him how I feel. Reading this post gives me some hope. I hope it works out for you both :) ",
            "Fuck i got decline 2 weeks ago fuck all you guys that had a happy ending \nEdit /s",
            "[removed]",
            "I’m laughing at the “age difference” thing. It’s six years, and you’re both in your 20s. ",
            "Have you video chatted? Because you don't have anything until you do that. Automatically assume everyone online is a potential catfish until you see and speak to them through a live video chat. ",
            "just chuck her a cheeky mac mate ",
            "I don’t even need to go beyond the title to answer this one\n\nThere is no way\n\nUnfortunately that kind of emotional confession puts you in a different spot no matter who you are. If it’s a simple rejection, it can still take several months to roll over. If they say yes, you have to be prepared to either stick it out to the end, or break up at some point if not, most likely ending the friendship. That’s a big step and big deal, make it count"
        ]
    },
    {
        "post_id": "4u3902",
        "author": "goldtri",
        "title": "Updating on \"I'm [21F] having roommate problems because her [23F] boyfriend [23M] has a thing for me\"",
        "url": "https://www.reddit.com/r/relationships/comments/4u3902/updating_on_im_21f_having_roommate_problems/",
        "score": 2208,
        "num_comments": 227,
        "created_utc": 1469200625.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/4rg674/im_21f_having_roommate_problems_because_her_23f/\n\n\nI know not many people saw my other post but I wanted to update anyways. She took all of my food out of the kitchen and put it in my mini fridge which she unplugged and left shut in my bedroom so the whole fridge became a disgusting mouldy mess. She did that because she said she didn't want me in common areas of the apartment anymore if I couldn't dress appropriately (and I was just wearing normal shorts!) yet somehow she thinks it's perfectly fine to do coke with her friends off our kitchen island. She also wrecked my lululemon leggings with her nail file because they're apparently too provocative to be worn anywhere outside of the bedroom. She's insane. Her boyfriend broke up with her after that incident and I think it was for the best, he could do so much better. She went extra crazy after that and kept texting me that she knows I'm sleeping with him and that I asked him to break up with her.  \n\n\nSo I moved out. I really didn't want to because I loved my apartment but I didn't want to put up with her anymore and I found an even better apartment with friends I can actually live with. \n\n\nThanks for the advice with my first question, to be honest I was a bit surprised so many of the comments were blaming me but nothing I did made her happy anyways so whatever. \n\n\n**tl;dr**: I moved out because she is crazzzzyyy\n",
        "permalink": "/r/relationships/comments/4u3902/updating_on_im_21f_having_roommate_problems/",
        "comments": [
            "[removed]",
            "with regard to your leggings, lululemon will repair them at no extra charge 😄",
            "> She also wrecked my lululemon leggings with her nail file because they're apparently too provocative to be worn anywhere outside of the bedroom. \n\nI can translate this for you: \"you can't wear these because you are more attractive than I am\"",
            "I didn't read the original, but it's a damn good thing you moved out. The worst thing I can see besides having to find a new living space is that all of your food is gone! That's cold. Maybe you should fuck him just to spite her. I bet you'd both get enjoyment out of it. That's actually not a great idea at all. But hey, you're both single so you're allowed.",
            "Tears began at her destruction of your Lululemon leggings, I am so sorry for your loss! Congratulations on moving out ✨",
            "Good for you just sucks you had to move out. He really shouldn't have been coming over without her there and if she was so insecure then she shouldn't have him over, period. She sounds like someone you shouldn't live with anyways and hopefully you blocked her from all media.",
            "I didn't read your original back then, but good for you for just ditching this insanity. And I did click over to the original to skim it, and then I had to actually stop and read it when people started blaming you for \"inviting his crush.\" WTF relationships, this is why this sub gets a terrible reputation! I'm sorry that's the grand advice you got. ",
            "Crazy so bad that someone else stuck their dick in it and you caught the fallout.  Glad to hear that you got away.  ",
            "While it was obvious even in your last post that your roommate was insecure and out of line in controlling how you dressed, I think a lot of the comments \"blaming\" you were more or less reacting to the fact that you outright dismissed their suggestions to tell your roommate to stop bringing her boyfriend over if she had such an issue with him being around you. Rather than seeing it as a possible compromise between you and your roommate, you were unwilling to consider the idea because, in your own words: \"I don't mind him coming over because I do enjoy his company. So I'm not going to tell her he can't come over anymore.\"\n\nMost people in your situation would have told their roommate: \"Look this is my apartment. I will wear what I want in my space that I pay for. If you have an issue with that, stop bringing your boyfriend over here.  He doesn't pay rent, and therefore doesn't have the same rights as I do. You can't police my behavior in my own home, but you can stop inviting him over and allowing him to hang out, especially when you're not here.\" Instead, your response suggested you prioritized him/what he thought of you over your roommate and keeping the peace, which suggests you either *really* hate your roommate and don't want to compromise out of spite or secretly like the boyfriend's attention.  Since your roommate didn't seem nearly as bat-shit in your last post as she does in this one, people assumed your motivation was the latter of the two.\n\n ",
            "Haha, everyone was downvoting you in that other post and it turns out your roommate really is crazy.  Good riddance!",
            "After that display, I bet he didn't even have a crush on you.  He probably just made some kind of off hand comment like, \"Your roommate is kinda cute\" and she went absolutely nuclear with it.  I'm glad you got out of there!",
            ">Her boyfriend broke up with her after that incident **and I think it was for the best, he could do so much better.**\n\nlol",
            "I hope you left the fridge when you moved. ",
            "Whoa! She was crazy! Have fun in your nicer apartment with your friends.",
            "NOT YOUR LULULEMON LEGGINGS! THOSE COST SO MUCH!!",
            "That girl needs to seek mental evaluation.  She's a ticking tomb bomb at this rate.  Glad you got out though!  ",
            "Time to revenge fuck the ex bf",
            "\"So I moved out.\" I would hope so.",
            "Oh man, glad you got out of that. She sound like those typical crazy woman you see in tv drama. Well, who cares if people blame you, her craziness is her own, not yours, you are not to blame. Not trusting her own bf is one thing and doing all that crap to you, such toxic. She needs help. Mental help.",
            "Geez she sounds crazy, glad you made the move and found some decent people to live with.",
            "Omg this is what I read this sub for ",
            "I'm disappointed by this update. You should've knocked the bitch out and had her removed from the lease for destruction of personal property. ",
            "Nice try, Lululemon marketing intern.",
            "The comments blaming you, the ones in reply to the top comment, were really stupid and illogical. I'm surprised they got that high in the thread. ",
            "Yeah she was crazy and I'm glad your out of that sitch.    It sucks that you had to leave though but it was quicker and easier than force her out.  Yeah there was a few posters siding with her over you on the original which was wierd but overall you've learned that you shouldn't tolerate other people telling you how to dress in your own home.",
            "Am I a terrible person for wanting you to go on a date with the boyfriend, and send the ex-roommate pictures? Even if it's a fake date.\n\nI am a terrible person. I can answer that question myself. I'll head back to /r/pettyrevenge",
            "looking forward to the next update when you start banging her ex",
            "Good on you OP ! \n\nEff that girl, she's nuts. You don't deserve or need that stress. It's a great thing he broke up with her because then he would've been stuck with her craziness ! ",
            "Yea you did the right thing",
            "You can't argue with stupid.",
            "This sounds an awful lot like an experience I once had. \nFortunately, your story had a much more ideal ending, my experience ended in the former roommate making a huge pile of all of my stuff outside the townhouse and kicking me out with only a few hours notice (the property was owned by her parents).   Consider yourself very lucky. ",
            "This was my earlier response. For some reason it didn't show up,\n\nDress how you want. Be honest and assertive, but not aggressive when directly telling him to his face \"I hear you have a thing for me. I do not and will not ever have a thing for you. If this is too hard for you please don't come around. I like you as a person but that's it and that's all it will ever be,\"\n\nSome men and women may find this rude, but boys often don't get the hints. Dressing differently won't change anything.\n\nI know I learned the hard way that the only thing that works is to be direct, clear and leave no room for his wishful thinking.",
            "Glad you're out of the situation. Blaming you is puerile and immature.  \n\nDress how you want. Be who you are.\n\nBe honest and assertive, (but not aggressive) when telling him to his face, preferably in front of her \"I hear you have a thing for me. I do not and will not ever have a thing for you. If this is too hard for you to accept, please don't come around. I like you as a person but that's it and that's all it will ever be,\"\n\nI know I learned the hard way that the only thing that works is to be direct, clear and leave no room for his wishful thinking.",
            "Not to justify your ex roommates actions, but did you stop talking to her, at the time, boyfriend or did you continue to talk with roommate with a disregard to the feelings of crazy roommate?",
            "I bet her ex BF probably NEVER even had a thing for you to begin with and she was projecting it onto him and you.",
            "What! People were blaming you?! You did nothing wrong! Girls are crazy and you should be able to do whatever you want in your apartment and wear whatever you want! Good for you for moving out and being happy :) ",
            "So you gonna date the dude or what?",
            "Good for you. It was not your fault and you were not inviting anything. ",
            "Sorry you got blamed so much in the origibal post, love. This girl sounds bonkers. Asking you to stop wearing yoga pants (seriously?) and stop talking to her bf is one step away from Gullum hissing at you from a cave, crouching over the one ring. \n\nAs for people blaming you, some people still feel like women should be responsible for the sexual reaction of others and \"cover up\". It's dated and it's stupid and it's not something you should feel bad about. ",
            "The \"he could do so much better\" is a clue. You're going to date him, aren't you, OP?",
            "I would shank a bitch if she ruined my lulu. Ohmigod. That literally tore my heart out. ",
            ">She also wrecked my lululemon leggings with her nail file\n\nI gasped \n\ngood riddance ",
            "Holy shit, wrecking lulu's is no joke. That's like $100 for a pair of leggings. Probably best you left before she moved onto tossing your valuables out the windows..",
            "Holy fuck. I'm sorry.\n\nCocaine is a helluva drug",
            "Good riddance OP. In my heart, I really wish you did some damage to this crazy bitch, but then again, her shitty personality probably is doing the job pretty well.\n\nI wish you all the best on your next journey and roommate :) (if you get one?)",
            "So now that you've moved out, is it too late to date the ex boyfriend? Maybe just take him out for drinks and get some provocative instagrams.\n\nOn second thought, as satisfyingly brutal as that would be, you don't need a full blown stalker. Carry on carrying on.",
            ">I was a bit surprised so many of the comments were blaming me\n\nI still think your attitude was a bit non-committal to your roomies feelings, even if she was a crazy bitch. \n\nThe obvious solution (before shit when overboard) was to ask her to stop having him round until they'd sorted out their issues - not say \"I don't mind him coming round because we get on well\". It's just not a considerate response, even if your intentions are good. People err on the side of being considerate and compassionate of other people's feelings, and although it was definitely NOT your issue, for the sake of apartment-harmony, you should have been able to see (at that point) that taking the hit of not seeing/talking to her bf again was well worth having some kind of harmony restored in your living arrangements. \n\nNow of course, given what you've said in your update, it sounds like she was properly mental anyway, and there could well have been a plethora of things she did which led you to (presumably correctly) believe that it was all paranoia and therefore you decided not to humour her, but you never outlined that in your original post, so I still think it was fair for people to have criticised your initial response and post.\n\nAll that said, I'm glad you're in a better place now and away from that psycho!  ",
            "Tbh, you should tell the police about the coke. I mean, that shit's really bad.",
            "So are you seeing the ex-boyfriend or not...",
            "In case you didn't see, u/jussumman asked in your other thread \"now that you've moved out will you try something with the ex-bf or not worth it?\"",
            "Sorry, read both of your posts, and this is bullshit. I think you loved the attention and you know it, not condemning you, but face reality aye. That chick acted pretty irrationally, but you did nothing to deter it, just at least own that bit. Sad that you had to move out, but i think it's a joint effort and i'm sick of people feeding you what you wanna hear. If you're hot and you know it, it's a nice thing to own as well (source, SO) as i say, not condemning you, but please acknowledge that. ",
            "My roommate whom I had signed a year lease with, invited a wretched man to sublet from her for the three summer months. I would be living there full-time and she didn't ask my opinion, ever. \n\nHe ran a lot and when he was done he would lay out on the couch without his shirt and sweat all over my couch. The shower was unfortunately located through my bedroom, and he never washed his towels. His were stored inside the tub area and stunk up the entire shower like mold. I sprayed them with febreeze for my own sanity. The next day he'd put whip cream in my shampoo bottle!!! This was a 24 year old guy! He refueled to do his share of housework, which I found out especially when he moved out couple months and he'd been storing the garbage he \"took out\" in his closet!!! I left them in there and shut the door, pretending to be none the wiser when roommate moved in. \n\nMoral is, you escaped crazy and you should count your blessings!",
            "[removed]",
            "are you sleeping with him though?"
        ]
    },
    {
        "post_id": "2h46z9",
        "author": "throwaway691K",
        "title": "Update - My injured wife[27-f] of 3 years just told me[25-m] to start sleeping with other women. [NSFW]",
        "url": "https://www.reddit.com/r/relationships/comments/2h46z9/update_my_injured_wife27f_of_3_years_just_told/",
        "score": 2213,
        "num_comments": 211,
        "created_utc": 1411383704.0,
        "selftext": "[Original Post Here](http://www.reddit.com/r/relationships/comments/2g7rfe/my_injured_wife27f_of_3_years_just_told_me25m_to/)\n\nFirst off, let me thank all you guys for all your wishes and blessing and valuable advice. I may not have responded to each and every reply, yet I can assure that I read every single one, so thanks.\n\nThe biggest thing I took away from /r/relationships was that I need to balance her medical needs and her emotional needs. You guys were right. I was being more of a house-nurse than a husband. So, I needed to do something to fix that.\n\nYou people were right. She made the offer for me to sleep with other women because she was afraid that she’s not enough. So, when she talked about it again, I resorted to an old trick of mine. I act childish. You know when little kids don’t want to eat broccoli or asparagus and they just cross their hands and act petulant, well I, a 25 year old man, do that. And yes, it works. Why ? Because its a unique combination of persistence and comic effect. But in all seriousness, I first went to her and held her hand and told her a very sincere ‘I love you’ and that she’s the only one for me. She insisted once more and I switched to baby mode. I crossed my hands and put on a baby voice and I told her that I will not talk to her until she stops talking about this. She said with an incredulous chuckle, “Are you serious right now?”. I looked away from her, and let out a childish *hmph*. I stayed there like that for 2 hours. She went from talking seriously, to angry screaming, to laughing her ass of, to silence, until she finally said, “Sorry. I won’t bring it up again”. I smiled, kissed her, then ran off to the bathroom (those 2 hours were torture). This issue was resolved. But there were more problems.\n\nMany of you may not agree with me here, before I even thought of doing anything on the physical front, I had to check with her doctors. So I talked to the doctor who first took over her case. This guy is seriously the best doctor I have ever known. Even though he behaves professionally, he is so open and friendly that I felt no problem in talking about sex. I told him plain and simple that my wife was craving intimacy and that its affecting our marriage and her emotional health. He gave me an understanding smile and then said plain and clearly what he wanted to. He reminded me that he had told me when she was in the ICU after the accident that our marriage will go through a very tough phase. And that it will test every bit of our self control but we have to, if she is to make a full recovery.\n\nThen again he told me that he agreed that something needed to be done. He said that oral sex on either side is completely, completely forbidden. If I stimulate her, her pelvis might thrust. If she stimulates me, her neck will move excessively and as as result that might put pressure on her spine. 7 months is not enough, especially not with the damage dealt to the bones in her case. What he did say is that if she is lying down, she could probably use her hands a little. But the pivot should be her elbow and not her shoulder. So, that certainly opened up some possibilities for us. Other than that, the doctor warned me very seriously that we should not try anything stupid. She’ll have to live with the consequences forever.\n\nSo with this in mind, I headed home. She was reading a book, and I told her that I had talked to the doctors, and this is what they told me. She was beyond ecstatic. So, I immediately took her shirt off, got her off her bed and helped her to our excessively large futon. It has float cushions so it didn’t affect her posture. I lay down on my back, and she lay down on top of me with her back on my stomach. Using a few pillows we were able to fix her head pointing towards me. A small pillow below her hips and she was comfortable. This is the position that we were able to find that worked for us. Now we just lay like this and make out for hours on end as soon as I get home, and she is able to use her hands on me. This way there is no strain on her back nor her shoulders. We switch up left/right position to make sure her neck doesn’t stay bent one way for too long. Ever sine we started this, she has been extra cheerful and happy. We got back to the routine where we would have this sexting/dirty talk build up till I came home from work and though we don’t have sex right now, it still helps us to feel like we’re heading back to normalcy.\n\nA couple of times, while we were getting really into it, I started sucking on her breasts and started touching them. Now she has come from such stimulation before so I had to be careful as it might cause some sudden movement. So because I didn’t want her to come, I had to go slowly and she felt like it was torture and she ended up feeling more frustrated because I had to let go just as she reached the brink. So, we stopped that for now.\n\nThis is again a short term solution and I know that very soon she’ll want more, but I’m taking small steps at this point, in what I hope is the right direction. You people were right that I was trying to contain her. But please do understand the spirit that was done in. She’s my wife and I don’t want to see her hurt. I want to see her walk and jump again. I don’t want to see her in pain and I want all this to get over so that we can be back to normal. She keeps asking for more but instead of flat out saying No, I plead with her to wait for a little while. I ask it as a personal favour and she reluctantly obliges, which I’m thankful for. She’s getting better everyday and I feel like we’re at a better place in our relationship now.\n\nTo those of you who are in such a situation, here’s some advice : These are trying times. They’ll push and pull your bond to the limits and you will feel helpless at times, and you might want to shut yourself away from it all. The tunnel might seem too long and you might not see the light yet, but just believing that there is light at the end of it all helps a lot. You need to keep that special thing about your relationship alive. How we do it, you ask ? Every night, we read our marriage vows to each other. A month ago she had been in terrible pain and the doctors had done their work and left. I felt like shit because I couldn’t help her. The next day, for some reason she was extremely cranky and rude and I was frustrated. I went out of the room and slammed the door shut. I heard her crying inside and I felt terrible. I just wanted to run away from it all. Then my eye fell on the plaque that we got engraved with our vows. I picked it up and read them again and again. I realised why I had to stick through it all, why I had to wait for these 2 years, why I had to be stronger. It was simply because I loved her more than I loved myself.\n\n*In sickness and in health…*\n\nShe was asleep when I entered the room that evening. I sat next to her and started reading our vows out loud. When I looked up, she was smiling at me with tears in her eyes.\n\n**tl;dr** : Went to the doctor, found a middle ground, fixing stuff.\n",
        "permalink": "/r/relationships/comments/2h46z9/update_my_injured_wife27f_of_3_years_just_told/",
        "comments": [
            "> she was smiling at me with tears in her eyes.\n\nJust like me after reading this post then.\n\nYou sound like a great guy, keep doing what you do and it''ll work out!",
            "There better be a two years later update bucko",
            "This is a better update than I could have ever anticipated. You're a really,  really great guy Op and your wife matches that. So glad things are going well. Reading this made me really happy. \n\nAlso that doctor sounds amazing,  I'm sure many doctors wouldn't even entertain the conversation. Really need more doctors like him. ",
            "Now that's what I call a HAPPY ENDING! ;D",
            "This is a great update.\n\nI'm glad you two are working through this in a way that will make you stronger in the end.\n\nGood luck to you.",
            "THERE ARE TEARS IN MY EYES :')",
            "I just caught up with your posts.  My wife was seriously ill for seven years.  I feel your pain.  For two years, we didn't have any sex.  We joke now that it was my \"Monk\" period....\n\nI know this is really, really hard but from personal experience I can tell you this - if you stick with it, work through it and are faithful to her, you will have a partner for life and a great marriage.   I know.",
            "I have so much respect for you. You made me tear a bit knowing there are wonderful guys like you out there. She is so lucky to have you.",
            "You should look into some electric stimulation, she only needs her hand on the controls and she can give you all the pleasure you need. Or you can get a vibrating butt plug so she can surprise you now and then.\n\nJust something to think about. It can make for an excellent gift for her and you.",
            "Way to go Squire! Keep on being a good guy, the world would be much better with the level of the commitment you have. ",
            "As a woman who just shattered her femur, got a collapsed lung, lost more than half the blood in my body, and spent an inordinate amount of time in the ICU, I hope my SO behaves like half the man you are during my yearlong recovery. You're amazing. \n\n",
            "> I lay down on my back, and she lay down on top of me with her back on my stomach. Using a few pillows we were able to fix her head pointing towards me.\n\nI need that Wild Sketch guy to draw for me how this is possible without her head turning completely around.",
            "GOD I loved this whole story. This is why I believe in love and marriage. This right fucking here.",
            "This is absolutely beautiful and brought tears to my eyes. I wish you both the best of luck. ",
            "May the long time sun\n\nShine upon you,\n\nAll love surround you,\n\nAnd the pure light within you\n\nGuide your way on.\n\nGood luck and god speed.",
            "I'm so happy for you. I wish your wife an amazing recovery.",
            "No doubt you two will get through this.\n\n\nKudos to you both.",
            "I just teared up a bit reading this. You are wonderful. Best of luck to you and your wife, as well as a speedy recovery to her!",
            "so many tears at the end of this, i hope someday i find someone who loves me as much as you love your wife.",
            "Seriously that last paragraph before the tldr was a wallop to my heart and I teared up. That is something that your wife will remember for the rest of her life. \n\nPlease stay strong until the easier times ahead when she recovers. My best wishes to both of you",
            "Damn. This really hit me hard. Here I am in class trying not to tear up. This is absolutely beautiful and I wish y'all the best. \nIt'll definitely not get easier but I fully believe that you guys will power through this and make it out stronger than ever.\nAs cynical as I can be at times,  it's stories like this that instill hope in me that love like yours exists.  Thank you so much for sharing this ",
            "First time I've ever cried while some described they're sex life. Strange but inspiring. We're all pulling for you guys!",
            "You both sound awesome. Thanks for the update. Glad things are better. Stay at it. You two will get through this. ",
            "You are one incredible husband. And your wife sounds amazing too. Much love and hope to you guys. ",
            "I'm glad you have a special technique for shutting her down when she's trying to bring up a subject you don't like. Cut that shit out and talk to her like a normal person.",
            "Much respect to you and for your decision ! Good luck to the both of you and Update us when she's all better OP! ",
            "I'm so glad your update is good news.  It's great that you guys have found some creative solutions to help alleviate the frustration of your situation.  This is an awesome update and I hope things continue to improve.\n\nBest wishes.",
            "that was beautiful dude, the best of luck for you and your wife with recovery.",
            "awesome post bro. I am proud to know that men are wired this way. you and your wife will be happy together for a long time. i wish you the best.",
            "You are an amazing partner and husband. Thank you so much for the update! My best wishes with her healing.",
            "You two are a wonderful couple you are an awesome husband. I am sure you will go the distance. \n\nKeep doing what you're doing and you'll be okay xxx",
            "Hooray! I'm happy for both of you!",
            "i hope i can be in a relationship as loving as this one day. :') lol",
            ":')",
            "Good luck and I wish you the best!\nDon't get discouraged!! ",
            "Great update!! So refreshing through the usual crap that we get on /r/relationships. Best of luck to you both in the future!",
            "I hope one day I have a loving relationship like you two one day, you worked through it all and found the best possible solution for the situation. I admire that.",
            "I loved the end. It always sucks when you read about people that can't take their marriage anymore and people post comments about leaving them even though they made a promise to stay like if it's no big deal.\r\rHey, people will do whatever they want and it's their right, but they shouldn't have made a promise then break it so nonchalant like. You're a great guy ",
            "you da real MVP bro!",
            "I hope I'm half the husband you are one day. ",
            "Ok, so, apparently BDSM hasn't been brought up, but... Yeah.\n\nThe BDSM community has plenty of harnesses, restraints, and equipment you could use to physically restrain her from being able to move her body during sex.\n\nWith liberally applied therapeutic pillows and cushions, you could easily get a set up that would allow you to have sex without her body being physically able to hurt itself.\n\nYou could restrain her body to the extent where even an orgasm would be unable to move her waist, back, or neck.\n \nOf course, if it's the twitching muscles that are the reason you can't do it, then forget it, but if it's because she can't swivel her hips about, then it's worth looking into.",
            "much respect to you and the wife for being so transparent and finding something that works for both of you.\n\njust **please** listen to the doctor and *be careful* with not getting ahead of yourselves with putting her at risk of permanent injuries. ",
            "This makes me so happy, best wishes for your wife and hope that everything gets better for both of you.\n\nI wish to be loved  and respected the way that you do for your wife",
            "I'm so happy for you and so glad to read this update :)",
            "I have goosebumps all over my body, and Im known to be a heartless person most of the time. Keep being such a good person and I wish you two the best of luck!",
            "This update made me cry :')",
            "so many feels...",
            "Man, there must be some onion chopping ninjas in my room right now. ",
            ">She was asleep when I entered the room that evening. I sat next to her and started reading our vows out loud. When I looked up, she was smiling at me with tears in her eyes.\n\nGod dammit that's all I honestly read, and it's got tears coming out of my face",
            "Is someone cutting onions?\n\nYou're so sweet, OP. I hope my husband would do the same if I were ever injured like that. ",
            "I hope that I will, one day, have a relationship as strong and amazing as yours. I wish you both the best.",
            "You're amazing. ",
            "Good luck. \n\nI was in this exact position with my wife a few years ago.  She'd fallen from a horse and damaged all the sacroiliac joints, and all the L discs.  Although little obvious physical damage, constant severe pain and immobility was the biggest issue for us. It took us years and years to get back to anything approaching a normal sex life and we went through the \"you can sleep with other women\" thing too.  For some reason, where we live, we didn't get offered counseling for any of it so we had to tough it out.  We nearly didn't.\n\nSo, being someone that knows what it's like, I really do wish you all the best for the future.",
            "OP I'm crying tears of happiness for you and your wife! Keep on keeping on you guys.",
            "This is so touching. I am so happy there are people like you out there.",
            "You found the silver lining in the hardest struggle in your marriage. I  think you're younger than me but I look up to you for your devotion to your wife :)",
            "Thank you so very much for being a man of character, who thinks his vows are important, and is willing to persevere through difficult times.  You will never regret this, I promise.  \n\nOne day the shoe may be on the other front and your leadership and example of \"for better or for worse\" may end up being a balm to you too.  Thank you also for setting an incredible example for your whole family.  ",
            "You get the best husband the decade award. This post made me cry! Hugs to you and your wife. ",
            "I feel sorry for you man, not because of your situation I'm glad you guys found a pace that works for you two. I feel sorry for your future penis when your wife inevitably breaks it in half because of all the pent up sexual tension. ",
            "Someone needs to make a movie about this.",
            "[deleted]",
            "I'm sure there are not many in your situation so I felt compelled to post. I currently assist as a volunteer companion for a paraplegic of 8 years with skull fracture, scapula broken and T12 blown alone w/ several ribs. She was experiencing social isolation. We basically just watch cool movies, eat pizza, and show each other whatever is on the Internet. I've known her for 16yrs.  I assist her moving from place to place. Getting clothes, etc. shopping.\n\nRecently she has become very vocal about being horny and wanting to give BJs , and asked me several times. (Usually after drink or MJ) she also found that her sensory function in the abdomen has come back somewhat. I recently found out that an old married friend of hers comes over for oral. And their may be others.\n\nFirst of all she took quite a hit to the head, while she seem coherent she makes obvious cognitive mistakes. Second I can not imagine standing in the DA office explaining why I was feeding dick to someone I was supposed to be helping, and third I just don't want an STD. \n\nAdditionally I could not imagine how to have sex with so many broken parts, without injury, plus the fact that an accidental pregnancy would probably result in a stillborn because of all the meds. In addition she smokes (both) and drinks. I have been clean for years and recently fell off doing shots with her. (Worst hangover ever)\n\nSo I have been bailing on her, recently because I have been ill, but previously by having other commitments. I got a troublesome text saying she would give head to the first guy who brought her whiskey. Her request has put me in a tough position. I used to spend the night and we usually stay up all night. I'm not sure how to back off and not sure if I should because of her depression being alone. There you have it.",
            "Okay two things : \n\n1. REDDIT IS ROOTING FOR YOU GUYS!!\n\n2. I read this almost everyday!",
            "OP, you're an awesome person. ",
            "With this being the internet, most people have seen the pictures of the couple that went through so much together. I don't know their name, but they were school sweet heart, he joined the military, he was deployed, he lost all his limbs, she help him with his recovery, they got married. Is a wonderful story that everyone know, but I always asked myself how they went through all this. Is nice to see the magic, but the trick behind it is was make it so special.\n\nYou, OP, just showed me the trick behind the magic. Is hard, there are fights, tears, frustration and anger. But patient, love and communication can make anything happen. This is only the begining, but little steps one after another can go a long way.\n\nI wish you the best of luck to your wife in her recovery, and I offer you my respect. You're awesome.",
            "I may be a little late and you may never see this, but I hope you do. I've read everything you've posted about what you two are going through and I'm moved. It takes a lot of courage on your part to stick with it in the worst times of your relationship. You're both very strong individuals, and have inspired me to be a better man. I'm going through a divorce with a wonderful woman whom I met in high-school. The way things ended between us isn't fair for her, but we talked recently and it has been for the best. I've learned a lot from these past 10 months but what you're going through has put it in to perspective for me. There's a lot of things I need to improve on. What I need to learn, that you seem to have in abundance, is compassion. If I can be half the man you are, I think I'm doing alright. ",
            "I'm a grown ass 30 year old man and line about reading the plaque with the vows brought tears to my eyes! ",
            "[deleted]",
            "Youre a great husband :-)",
            "Thanks for being a great example for all of us other husbands. Lots of respect, friend.",
            "I'm so glad that you two are working things out! I'm so glad you both have such big hearts, and are willing to work to make each other happy.",
            "Your marriage will never be the same again but that isn't a bad thing. You need to let this accident help you grow together not apart.",
            "Glad to hear the good news. It may take longer than you hope to reach that normalcy, but with the pace you and your wife are taking, I have no doubts that you two will get there. I have to say the way you are handling all of this is incredible and inspiring. I'm 23 years old and if I ever end up in a similar situation, I would want to be able to handle it like you. Best of luck, you two can do it!",
            "What an inspiring read. So pleased for the pair of you. You sound like an awesome, dedicated husband and it's great to know there are some out there :)",
            "I believe in you two! :sniffle:",
            "This is a beautiful story!\n\nYou got a long way to go, but with a true companionship like that youll be fine!\n\n",
            "You are an amazing husband. If I ever get married I hope it's to someone as wonderful as you, because I didn't think your level of care and concern was even a possibility. Thank you for letting me see that people can and do treat others this well. I hope you and your wife make it through this without too much pain, because you are two very strong people who deserve a very happy life together.",
            "OP...you are everything a good partner should be. I wish you the best of luck!",
            "You're a good man. This made me tear up. ",
            "Wow, your story is amazing and it sounds like this is just the beginning. To make it this far you are clearly very strong and have an unbreakable bond with your wife. I wish you both all the best as you work through this difficult time. So inspiring, thank you for sharing.",
            "Great update, you're a wonderful guy OP.\n\nGood luck with the future to you and your wife.",
            "I'm late to this, but just have to say how great this was to read.  You sound like an amazing couple.  I have so much respect for you.  This gives me faith in marriage throughout all the stories of infidelity and divorce.  ",
            "You sound like a wonderful man! Cheers to you and your beautiful marriage.",
            "What a fantastic guy!  I'm sure you instinctively understood that when your wife said, \"go find some satisfaction elsewhere,\" that you and she would regret that forever. \nFor you to share this, and be open about it, though...\nWOW!  \nI wish you and your wife all the best, and I hope you and she have a wonderful life.  There is life after this, and I believe you know that.",
            "I think this guy deserves a gold. Made me tear up a little as well.",
            "I couldn't read the whole post, but got to the futon part. Good on you for letting your woman know that she's all you want. Based on the doctor's description of pelvic thrust and neck movement being potentially life-change-ingly bad, in all seriousness, is bondage a possibility? By restricting risky movement, could a new door to pleasure be opened to you and yours?",
            "Is there a way to keep her spine/hips from moving inadvertently if she comes?  Like some kind of body brace?  That way you can go down on her.  I can't imagine not getting off for 2+ years, especially with a previously 5x/week sex drive like you two had.",
            "You are fucking awesome. ",
            "25 year old \"tough guy\" here and I almost cried and instantly got goosebumps from those last three sentences.",
            "Now this is love in my eyes.",
            "I cried \"In sickness and in health....\", and the vows oh god I cried...",
            "T_T so happy.",
            "You're such a good husband. I would lose my mind if I weren't allowed to have sex for two years.",
            "You guys.. You guys are going to be alright.",
            "This is the best story I've read on here. I'm literally crying from how beautiful your love is. ",
            "This is so inspiring, but shows how it is worth it to work through things. That the tough journey is a life experience to be shared with your partner. That the right answer is not the easy and obvious one, but the one you have to work hard to find.\n\nGood luck!",
            "OP, your wife is lucky to have you. Here's to you both having a wonderful sex life again once she's all healed and healthy. ",
            "This is amazing. I could feel your love and care for her through your words. You are a patient and kind husband and she is very fortunate to have you.",
            "Hrmph. You're still acting like a child and being controlling over her and only doling out affection as you see fit. So she's not going to be permanently disfigured if you help her bodily move from one room to another, but putting your dick in her mouth or getting her aroused is going to fuck her up for life? Whatever.\r\rIf I treated my disabled husband this way he would never have married me. She apparently seems happy enough with your arrangement, but you are just as disrespectful of her autonomy as you were before. Good luck I guess.",
            "Every great woman deserves a man like you. ",
            "You can frame this however you'd like but choosing what is or is not \"best\" for her is wrong. It always has been. It always will be. The only correct course of action is to accept her wants and desires. That is it. Anything else is wrong-headed and, honestly, manipulative and abusive. Also, everyone patting you on the back for courageously standing by her and making decisions for her \"for her own good\"? Yeah, they're fucking idiots too. She's not a snowflake and you are not a hero. You are a married couple and you are not respecting her autonomy.",
            "[deleted]",
            "The option to enjoy sexual intimacy with other people is a wonderful thing. I have a chronic illness and I'm grateful that I'm extremely poly by nature. Despite having a high libido, I can't always handle having sex and I'm glad that my partners have other people in their life they can enjoy that with. And so do I. \n\nI can see opening your relationship as potentially being an incredibly positive thing that would take away a great deal of pressure, guilt, and stress from your wife, and likewise you, if you both could work through the underlying issues you have over it. \n\nYou played a fun game with her to convince her to not discuss this again, and personally I don't believe that was the healthiest choice for your longevity. I am quite happy that you have found some baby steps towards intimacy between the two of you.",
            "[removed]",
            "IDK why, but I get the impression from OP's writing style that he is of Indian decent.  "
        ]
    },
    {
        "post_id": "7qf4t6",
        "author": "queuetease",
        "title": "I [19f] found out that my boyfriend [21m] beat up my ex [18m] and I am so angry I'm shaking",
        "url": "https://www.reddit.com/r/relationships/comments/7qf4t6/i_19f_found_out_that_my_boyfriend_21m_beat_up_my/",
        "score": 2212,
        "num_comments": 340,
        "created_utc": 1515968408.0,
        "selftext": "I'm so enraged I don't know what to do. My ex has never done anything to my boyfriend at all. My boyfriend just doesn't like him because he used to date me. The reason my ex and I broke up is because he has a lot of issues to deal with that I just can't help him with. We didn't end on bad terms.\n\nI found out through my sister's boyfriend that my boyfriend just walked up to him and started beating the crap out of him and no one thought to help. I know my ex and I know that he isn't a fighter. He keeps to himself most of the time, he's never had to defend himself in his life and the thought of someone just beating on him for no reason pisses me off.\n\nWhen my boyfriend came to my house earlier, I went off on him! Now he's angry at me for \"defending\" my ex and is claiming that I don't love him. I don't know if I should break up with him or try and fix things. \n\nI need some advice. This is too much.\n\nTL;Dr boyfriend beat up my ex and is upset at me for \"defending\" him",
        "permalink": "/r/relationships/comments/7qf4t6/i_19f_found_out_that_my_boyfriend_21m_beat_up_my/",
        "comments": [
            "Break up with him and encourage your ex to call the cops.",
            "Hell yes you should break up with him. He violently assaulted someone who has done him no harm. Please get out before he decides you deserve to be beaten too. ",
            "You need to pack your bags and run. Things can only escalate if his violent behavior can be triggered by such a minor threat.",
            "Break up with this guy. I can’t believe you would consider trying to fix things with him. Anyone who would beat the crap out of someone else, unprovoked and simply because they used to date their current partner is a straight up bad person. You can’t fix him. \n\nBreak up with this terrible guy and go and see how your ex is holding up. If he wants to press charges against his attacker, support him in that.",
            "Your boyfriend *violently assaulted* someone with **no reason** other than the fact that he used to date you.\n\nBreak up - **not in person**, leave first and break up over message from a distance. Encourage your ex to file a police report.",
            "Yeah, you're in a lot of danger here.  I'm trying not to panic you while still conveying the severity of the situation.  Your BF just showed EXTREME jealousy and a willingness to beat someone without reason.\n\nYou know how your mind goes crazy when you break up with someone?  Like you just keep replaying old episodes in your head over and over.  Maybe you could have done *this* differently or *that.*  You just obsess and obsess and obsess.  When you break up with him over this, he's going to do that.  But with that extreme jealousy.  He'll jealously obsess over the situation until (in his mind) the only reason you are acting this way is because you're fucking your ex.  No, you've been cheating on him with your ex this entire time.  \n\nAnd when he does that, I don't see any limit on what he would or wouldn't do to you.  Including beating or killing you.  \n\nI'm a complete stranger, and this post probably has 0 fucking upvotes on reddit.  Despite that, please please please treat this situation with the seriousness it deserves.  There's a 99% chance I am wrong, but if there's even a 1% chance of me being right, you should proceed with extreme caution.  ",
            "Good god! Dump him yesterday!!!! And call the police!!!!! ",
            "Break up. Next time it could be you.",
            "He's gonna beat you too the second his warped perception of reality is \"my gf talked to another guy.\" RUN AWAY.",
            "Surely you mean ex boyfriend now? Wht would you still be dating this piece of garbage?",
            "Make sure that you keep yourself safe when breaking it off with the ex boyfriend. Hopefully you don't live together and have your lives too intertwined. Box his crap and have someone take it to him. If you don't have anything too valuable at his place just write it off. Along with him. This is completely unacceptable and I don't blame you one bit for dumping him. You're justified. Nothing to fix here. You can't fix something who denies being broken.",
            "This time it was your ex. Next time it could be you. Or your friend. Your family. Your child.\n\nFlee like the wind.",
            "This is the biggest red flag you can have besides a prior felony for domestic violence or something. You need to get out of this relationship as soon as possible for your own safety.",
            "You should file a police report.",
            "The only right thing to do is to end this relationship and help your ex press assault charges against him",
            "Dump him, he'll hit you next.",
            "> try and fix things\n\n\nWhat's to fix? Your boyfriend is the type of psycho that goes and attacks people on the steeet without being provoked whatsoever. \n\n\nThat's not something to fix, that's something to get away from. ",
            "break up with your scary, violent BF. That's *insane*.",
            "I don't know how many issues your ex had, but I *guarantee* that your current beau has more. ",
            "Dump this maniac immediately. RUN the hell away from this now. Do not look back.",
            "He's going to hit you. Guaranteed.",
            "Break up 🙅🏻 \n\nJealousy. \n\nViolent behavior. \n\nSnaps for no reason. \n\nAll signs of an abusive person. RUN FOR THE HILLS, GIRL!!!!! ",
            "Break up with him, this guy clearly has some serious goddamn anger issues. ",
            "Unreasonable jealousy to the point of physical assault.  He's upset that you have prior romantic connections.  He's violently assaulted that person.  He's angry that you object to the assault.  Your soon-to-be-ex-boyfriend is jealous, violent, and has issues that you are not a pure little princess grateful for his assaultive ways.  Today he beat up your ex.  Tomorrow, he will turn this anger on you.  Get out.",
            "Get thee gone girl. Nothing for you too fix since YOU aren't the problem. He is. Encourage you ex to file a report and see if your sister's boyfriend will give a witness statement. ",
            "Violent, unprovoked assault and battery? Uh, yes, break up with him because that is a massive red flag. I hope your ex decides to press charges against your crazy bf. ",
            "1. Tell whoever you live with that you will be breaking up with your boyfriend because he violently attacked someone without provocation and consequently he shouldn't be around your house at all.  Under no circumstances should the door be opened to him.\n2. If you can, contact your ex.  Inform him that you're breaking up with your current boyfriend and encourage him to report the assault.  *This is important*.  Toxic masculinity often makes guys think they shouldn't report getting beaten up because it makes them look weak; encouragement can really help get over that mental block.  And make no mistake, it's an unnecessary mental block because *your boyfriend is dangerous and needs to get his act together yesterday or not be with society until he can manage to do so*.\n3. Block your boyfriend everywhere (social-media-wise), then break up with your boyfriend via text.  Then block him on your phone.\n\nDo the above steps *in order*.  This guy is dangerous, and not taking appropriate safety precautions beforehand could leave everyone near you vulnerable.",
            "The fact that you're considering trying to fix things.... wow. This is why I subscribe to this sub.",
            "You want to potentially stay with him?  He beat somebody up FOR NO REASON.\n\nHow could you possibly even stay in the same room with him?",
            "Please, please break up with this guy. But also take precautions when breaking up with him. Leaving a violent person can be super dangerous, and many women have been physically attacked and even killed by partners they didn't believe would hurt them. Sending you positive energy to get through this rough time! ",
            "You dump his ass immediately. This is going to be a problem in the future. What happens when you have a friend who is a guy? Or just have a conversation with a guy?",
            "Your ex should press charges and you should go no contact with the current. He’s violent.",
            "I can't believe you'd even need to ask the question how you should handle a person who openly assaulted someone for no reason. He should be behind bars and if he's prone to act like that with people connected to you what is he capable of down the road?",
            "Break right up with him. He feels so entitled to you he's mad at your ex-boyfriends, and that is CRAZY. The fact he can't see what he did wrong is also a red flag.",
            "Then if he has a violent past then he’s a total jackass and he’ll get a taste of his own medicine sooner than later. ",
            ">I don't know if I should break up with him or try and fix things.\n\nIs this... a troll attempt? \n\nA guy, for no good reason whatsoever, decides to find someone and physically hurt them. \n\nAnd you're asking if you should stay with this person? How is this even a question?",
            "keep us updated with what happened sis :o",
            "Get out. Now.\n\n>Now he's angry at me for \"defending\" my ex and is claiming that I don't love him.\n\nThis is a huge red flag. \n\nI'm so sorry.",
            "Not only do you need to leave, you need to call the cops on your boyfriend. He violently assaulted someone for no reason. That's a crime. And you can never trust someone who resorts to this kind of violence like this.",
            "Yes, breakup.  Others have given you great advice there.  But I want to add, that someone being your ex is no reason for a current to dislike him, nor should anything you did with that ex before meeting your current matter simply because it was with an ex. ",
            "You should break up with him. Not only did he commit a criminal, violent act, he turned things around you when you called him on it. Not only has he showed you that he's controlling, jealous, and irrationally angry with a major impulse control problem, he's also showed you that he's going to dismiss your concerns when you bring up problems in the relationship. There's no way to fix that.",
            "Break up with him, Talk ex into pressing charges. That is absolutely uncalled for. He sounds very controlling",
            "Break up with this violent man and go no contact with him. He is dangerous.\n\nEncourage your ex to press charges if he hasn't already.",
            "This guy violently beat up somebody for the simply reason he is dating his current girlfriend. He is violent, shows lack of self control and is now blaming you for it. \n\nI mean...I don't understand how this is a question at all? ",
            "This screams, \"I have issues.\" Please get away from him. Encourage your ex call the police.",
            ">I don't know if I should break up with him or try and fix things.\n\nTry to fix things??? Uhhhh",
            "100% break up, but please make sure to do it in a public place or with a friend nearby in case he has the urge to get violent with you.",
            "Of course you should break up. He flat out committed assault and should be locked up, nevermind single. How is there even a discussion here? ",
            "You shouldn’t love him. I hope that you don’t. He is truly a bad and terrifying person. He is absolutely abusive and violent in general. He senselessly attacked a stranger for doing nothing wrong. Please run as far and fast as you can before he finds a reason to justify hitting you.",
            "what a psycho, get rid of him, Id be worried he will look for your ex and blame him for you leaving him and beat him up again",
            "He's extremely violent with no provocation. Run and never look back.",
            "Break up with him. He assaulted someone simply for existing and try to flip you being angry. If you stay in the relationship, it will become abusive in some form.",
            "Like your ex, your boyfriend has a lot of issues that you can't fix. Time to break up with him too.",
            "Send your Bf to jail please tell your ex to press charges. ",
            "Why would you try to fix things with someone that unstable? He beat up your ex with no reason. Your boyfriend is a dumpster fire. ",
            "Your boyfriend is an insecure shitty person who just assaulted somebody for no good reason, why is this even a question? ",
            "Men who use violence to solve problems use violence to solve problems. You need to get the fuck away from him before he sees you as a problem to be solved.",
            "He assaulted someone just because he didn't like that this person was your boyfriend in the past?\n\nThat is a scary amount of possessiveness. Never be alone with your ex again. ",
            "I'd you stay with your boyfriend you are condoning his actions. Dump him and help your ex press assault charges. ",
            "Not at all, but not everyone has self control like this guy clearly. ",
            "Get out of that relationship as soon as possible. Pack your bags, get far away from him, and tell him. ",
            "Break up not even a question about it. Next up he beats you up. No thanks.\n\nAdults don't get in fist fights.",
            "I honestly expected your ex to have been abusive toward you or still harassing you. But to assault someone for no reason other than he was your ex? No, that is a huge red flag. How long until he uses you as his punching bag for no reason? Get out while you can.",
            "Call the fucking cops, it's an assault",
            "The next person he could violently assault unprovoked could be you. I don't think I've seen a comment say otherwise, but again- get out! ",
            "Like others have alredy said, dump his ass and encourage your ex to call the police. ",
            "Thats assault at best. He just assaulted someone unprovoked. You want that? ",
            "It's not a too big step between beating up a dude unprovoked for something moronic, and beating you up when you \"displease\" him. \n\nBreak up.",
            "Of course you should break up with him. Jesus fucking H. AND you should encourage your ex to press charges. What a fucking psychopoath. Try and fix things. WTF is wrong with you? ",
            "RED FLAG. RED FLAG. RED FLAG",
            "Break up with him. He tries to justify beating him because \"he used to date you\". I mean, HOW DARE YOU have a past?! Please, get out of that relationship and help your old ex getting back on his feet or at least tell him that you are sorry for getting together with a psychopath.",
            "Every single comment has said it, but it never hurts to hear good advice be reinforced. \n\nThere is nothing to fix here. Leave, break up with him, and encourage your ex to call the cops.\n",
            "Break up and file a police report on his ass. This really shouldnt be tolerated. I dont just go around beating people because they dated my girlfriend at one point.",
            "You have made a very honorable, mature and correct conclusion about a very disgusting and immature action by your bf.  This type of bully behavior is something that needs to be dealt with swiftly and firmly.  \n \nProbably the wisest thing would be to tell him strongly what a pathetic human he is and to hit the door.",
            "Leave! Get out of that relationship immediately. ",
            "Run. This person is dangerous. :(",
            "Dump him. What is he going to do next? Punch your first grade crush in the face? Your (hopefully ex) boyfriend is a violet person. In fact, he's a criminal. He walked up to an innocent man and violently assaulted him for the mere fact that he used to date you. Also, tell your ex to file a police report. He should get punished for his disgusting actions.\n",
            "Beating someone on impulse and for the \"show\" of dominance is something that would do much harm in long run and tells the character of a person.... It's better to leave him before this relationship becomes abusive.",
            "I'm sorry what do you mean you \"don't know if [you] should break up with him or try and fix things\"? He physically assaulted someone because they used to date you. That's absolutely mental. He's trash, and if you stay with him you're basically condoning that behaviour (is he going to beat up every guy that looks at you a certain way?), and then what does that say about you? Run far far away. ",
            "The fact that you don't know what to do is deeply disturbing",
            "Run. \n\nLook into getting a restraining order against him.\n\nKeep yourself safe. Don't be alone near him. ",
            "There is nothing to fix here, because frankly your boyfriend (please let this be EX) is going to end up in prison sooner or later, most likely having killed someone over a really dumb thing.\n\nThis is a serious red flag that can be seen from outer space. Beating someone up for no reason is assault and it's criminal. Your ex needs to press charges and your dear-god-I-pray EX-boyfriend now needs to go to jail.\n\nHe WILL put his hands on you. He is unrepentant and feels justified, which shows a deep character flaw of when he is angry he is right regardless of the circumstances. Also he's not rational or sane, not even close.\n\nPlease tell this guy it's over, do it in public with other people, so if he decides to beat on you then you have backup, CALL THE COPS THE SECOND HE shows any violence towards you. And make sure you get the locks changed on your house before that if he's ever had access and wipe all electronics clean. Look up the domestic abuse hotline, talk to someone there about how to get this guy out of your life SAFELY.\n\nThen urge your ex to go to the cops and tell him you will also be a witness in the fact your boyfriend admits to doing this to him. Beating the shit out of someone, ambushing them even with no warning just because they used to date you? Yeah, no. This is a classic sign of someone who is abusive. \n\nI cannot emphasize to you enough how dangerous this type of person is. Treat him as such, end things safely, and don't look back.",
            "Someone who will do that \"for\" you is usually willing to do that TO you. Dump him now and don't look back.",
            "Break up with him ASAP. You are the next person getting beaten up. Get out now before you lose teeth. Make sure you do it in a public place with a quick and easy way to get to your parents house/somewhere safe. ",
            "My wife broke up with her boyfriend 3 weeks before we connected.  I was her friends for a while. When she broke up with him (bad relationship was getting worse) I had nothing to do with it. I gave her space but she made the move on me, the heart wants what it wants.  We got together. A few days later we went to a nigh club and she bumped into her ex. I wanted so badly to hurt him for the shit he put her through. But I didn't. He, being an asshole, figured I convinced her to leave him and come to me.  He wasn't as controlled as I was and blindsided me with a cheap shot to the face. Lucky for me he can't aim and broke his hand on the side of my head.  I don't fight, never have really needed to, but I can. I didn't hesitate and I hit him twice, first breaking his nose, second dislocating his jaw. Then I stopped and left to deal with a cut scalp. I didn't want to hurt him even after he abused my wife during their \"relationship\". I'm not a jealous man.  Your boyfriend tried to exert his dominance over your previous mate to show him that you are his now...  Last I checked you can't really own another human.  I'd leave this guy before he ends up in jail because he killed a guy that flirted with you. ",
            "You both got it wrong; you're not defending your ex, you're calling out a violent thug for being a violent thug.",
            "Break up with your boyfriend. He is not only violent, he is hugely jealous, possessive, and irrational.\n\nReach out to your ex and apologize profusely. Explain what happened and reiterate that you've broken up with your boyfriend and did not ask for or condone his actions. If your ex decides to press charges, let him know you'd be willing to testify or assist him in any other legal matters.\n\n",
            "We call that sign a “red flag”. \n\nGirl, dump his ass. NEXT. Get out of there!!!",
            "If he beat the shit out of a stranger for no reason then it's only a matter of time before he hits you. \n\nDon't break up with him alone, or be around him alone any more. Do everything in a very public place. ",
            "Your boyfriend has much worse issues than your exboyfriend. He is a grown man who should be earning a living not acting like a tough guy.",
            "youre dating an asshole and your mad at him for being an asshole?",
            " If your boy friend only know use fist to solve the problem,you had seen your future.",
            "When someone shows you who they are, believe them. Your BF is violent and beat up someone you used to date just because he can’t stand the idea of you being with someone else. That is extremely dangerous. Run fast and run far. ",
            "Uhh get the fuck away from this guy. He's jealous in a severely unhealthy way. This is only the beginning of something abusive.",
            "What a massively insecure asshole. And you’re questioning whether you should break up? Jfc ",
            "He beat the snot out of your ex for no reason. Guess who will be the person he will beat next? \nYes, OP, you. Do you want to be assaulted regularly for any shitty reason that will pop out of his delusional brain? Because there is damn high probability your relationship will be just as I described above. Do you want to end up in a hospital, seriously injured, or in a body bag? Mortuaries are full of women who tried to fix their violent bfs and husbands.\n\nThere is nothing to fix. Dump him, but do not tell him that to his face, because he will go apeshit and he might hurt you. Move out when he is not around. Encourage your ex to report the assault to the cops. If this moron tries to stalk or harass you do not hesitate to call the cops. ",
            "Serious question, how can you live with yourself even considering staying with him?   \n\n\n",
            "there’s a better chance of finding a cure for cancer then fixing ur bf ",
            "Jesus Christ. How is it even a question if you should break up with him or not. The answer is obvious...\n\nHow do you know your boyfriend would just suddenly snap and beat you up...?",
            "You should absolutly break up with him, this behaviour can't be excused. ",
            "Call the cops!! What do you mean try to fix things? He beat up a dude for no reason!! Are you kidding me?! You should have broken up with him the second you found out and gone to help your ex. You even said you didn't break up on bad terms",
            "I think there are 2 things going on here. Firstly, he's marking his territory by beating up a smaller and weaker 'adversary'. Secondly, he's testing your loyalty. This is a test that gets harder as the relationship progresses and it's a test you will eventually fail. Hes not afraid to use violence. I'd be considering my options...\n",
            "Ok. To sum all replies: break up with him, he's a violent jerk.",
            "I'm almost never the one shouting to break up but here I'm screaming it.  ",
            "Just imagine how he'd react when your (future) mutual child spills juice on the rug. ",
            "Girl, get out of there now. He’ll only get worse.",
            "Your boyfriend obviously has much more issues than your ex.\n\nI think you can apply logic to map out the best course of action. ",
            "If you're even considering staying with this guy you need to get into therapy. ",
            "Dump this shit bag. What your boyfriend did was commit a crime. I would tell your ex to file a police report and never speak to your boyfriend again. ",
            "Well thats a red flag",
            "You don't know if you should break up with your boyfriend who physically assaults people on a dime?\n\nWhere is your definite break-up line? Stabbing? Murder?",
            "Well I would suggest you start by going to the police and report him assaulting your ex. Tell your ex to report this as well. It is not normal nor acceptable that someone beats up someone else.\n\nAnd I would break up with someone who has shown to be violent. If jealousy / territoriality makes him use violence I wouldn't be surprised if later he'll show you the same courtesy.",
            "Dump him.  Now.  He is a violent person. ",
            "I'm sorry that you couldn't see the red flags. This person is violent and clearly has many issues. Please tell everyone your care about and make sure you make a safe exit",
            "Holy shit, what your (hopefully now ex) did is totally sick. Run and never look back. There's nothing to repair, he's a psycho!",
            "There shouldn't even be a thought in your mind about trying to \"work things out\"",
            "You boyfriend should be in jail first off, you also should break up with him because that is despicable.",
            "I'm glad you're upset, because that shows you have a good heart and you're a good person. Too many girls in that age range think jealousy is \"hot\" and means he \"loves\" you. Jealousy is such a turnoff, and it's dangerous. ",
            "personally, i'd break up with the guy. i have no tolerance or patience to put up with jealous, insecure gits who think violence is the answer for quelling their busted ass ego. you had a life before your current BF and he can not go around just randomly whopping the shit out of people from it. most especially when the past is doing nothing but simply existing in this world.",
            "When you dump him, explain that this isn't about your ex, it's about him being an adult who would attack ANYONE like that.\n\nAnd do it in a safe place so he doesn't hit you next. ",
            "Obviously you should break up with your boyfriend. This is a huge red flag. ",
            "Your (soon to be ex) boyfriend is possessive and dangerous. Leave now before he decides to start smacking you around too. It's only a matter of time.",
            "Block him on your phone and all social media. This guy is rotten to the core. ",
            "He is unstable, jealous and violent.  Is he going to go back to your childhood and beat up every boy you had an elementary school crush on?  Every boy who chased you around the playground but then chose you to be his gym partner?  \n\nIf he weren't abusive, he'd NEVER EVER make a conditional statement like \"well, if *really* you loved me, you'd [do something you don't want to do.]\"",
            "What you should do is encourage your ex to press charges and hopefully get some kind of retribution out of it. If you left your ex because he had issues that you couldn't help with, why is your current boyfriend any different? He's aggressive and violent to people he doesn't even know. Sounds like a real issue. Only by suffering the consequences of his actions does he have any hope to change.",
            "Um yeah, if he beat the shit out of him for no reason who is saying he wont do the same to you? He sounds like he has anger issues, gtfo there and tell your ex to call the cops.",
            "I feel like breaking up with him is the only right answer here. If you didn't and we were friends, I would seriously question your moral character for staying with him. ",
            "dump his sorry ass and report him to the police. make sure your ex is okay and just be a good friend to him. i imagine he’s feeling incredibly weak and is down on himself and he probably needs a friend. but the most important thing is getting out of this relationship because that is a *huge* red flag",
            "> My boyfriend just doesn't like him because he used to date me.\n\nThis alone is a major red flag. This isn't cute or romantic. This is not a weird \"quirk\". This is breathtaking levels of jealousy.\n\nThe fact that he acted on it and actually assaulted your ex? SECOND major red flag. \n\n> Now he's angry at me for \"defending\" my ex and is claiming that I don't love him.\n\nSo you've got irrational levels of jealousy, coupled with violence, and now this level of mental gymnastics. His justification is wildly manipulative, and his reasoning is warped.\n\nBreak up with him before he starts hitting you, and blaming you for it.",
            "What the hell? That was completely wrong on your boyfriend’s part. Please consider breaking up with him. Your ex didn’t deserve to be beat up at all, and your boyfriend shouldn’t be attacking innocent people. If he’s capable of being that violent to other people, I don’t want him to do that to you. ",
            "ffs, break up with him unless you like dating violent assholes who think they own you.",
            "Yes, you should break up with him. This is not normal behavior at all. If he can do this your your ex, imagine what he can do to you if you ever get into an argument? Your ex should report him for assault as well. You are young. Plenty of much better guys out there. ",
            "His behavior is unacceptable.\n\nHowever, if you want to find out why, ask him in a safe environment. Like you said, you went off on him. Although I understand, it does automatically put him in a defensive mode.",
            "Ever seen Fear with Marky Mark Wahlberg? Definitely leave that dude.",
            "Provided your ex didn't instigate the fight and it was an actual attack, I say dump the meathead by text and call the police to say you're concerned about potential reprisals from a violent and unstable man. They can advise you on getting a TRO. \n\nI also say assume the worst, tell your family and neighbors a dangerous man is potentially after you, install security lights, change locks, look into pepper spray, mace, even a handgun, and take other precautionary measures.\n\nAnd forget what some of these posters are saying - the police will get involved, will document what happened, and will reach out to both men. ",
            "Don't date guys who beat people up.  Geez.",
            "You're damn right, this is too much.  This is WAY outside of normal.  Abandon ship, girl.\n\n\"The reason my ex and I broke up is because he has a lot of issues to deal with that I just can't help him with.\"\n\nSounds like you've made the smart choice before!",
            "Leave your boyfriend. Now. One day it's likely you'll be the victim of his rage. This isn't something you need to discuss with him. Your BF is a zero.",
            "You should break up with him because he is violent and possessive and beat someone up for gross male pride and ownership reasons.",
            "He beat up somebody he didn’t know for a flimsy reason. What do you think happens when you piss him off? Break up and then watch your back for a while ",
            "You definitely need to leave this man what he did is unacceptable. I would get in touch with your ex and explain what happened.  Tell him to consider getting a protective order because it’s hard to tell what your ex will do if you leave.",
            "This is why we have jails.  Your boyfriend needs to be in one of them and for both your own good, and his, you should dump him.  He isn't emotionally prepared to have a relationship.  Hopefully he can get some therapy while in jail or at least learn some self control.\n\nHowever a completely unprovoked attack on another human being which is caused by an imagined slight/insecurity is exactly the kind of dangerous personality that ought not to be allowed to walk the streets free.\n\nYou should also encourage your ex to file charges.",
            "What the fuck? You need to leave him before he tries to hurt you. He is emotionally unstable, being with him shouldn't even be an option. \n\nGet your ex to press charges as well, behavior like that shouldn't be ignored or rewarded ",
            "This kind of behavior indicates he's rather unstable and emotionally immature. \n\nBreak up with him, encourage your ex to file charges, and do what you can to help make them stick. \n\n",
            "Break up. His reaction to inexplicable violence towards a stranger is “you don’t love me?” How about “I was completely wrong to do this and I owe you and him an apology. I think I need help.” That would be a “maybe we can stay together” reaction. \n\nSaying “you don’t love me” to that is a big warning flag. This man needs to do some deep soul searching. You’d be wise to let him do it on his own. ",
            ">no one thought to help\n\nThis angers me beyond reason. FFS",
            "One of my wife's exes didn't do anything bad to her by her standards, but I disagree with her assessment of certain things. His actions certainly shaped parts of her and molded her into the person she is now. Over the years I have increasingly became angry at him and wanted to beat him up. I haven't, but my point is maybe the current boyfriend sees something differently than you do. Maybe he feels the ex caused you harm.",
            "You are dating a crazy person. Leave now.",
            "Break up with him and probably file a restraining order.  If he's going to do something like that to an ex simply because they dated you at one point he is likely possessive to an extremely toxic level and will try to control your life more and more as the relationship develops.",
            "This one also has issues that you just can't help him with. The police would be more help for him than you ever will be. \n\nBreak up time. In public with your parents and plenty of witnesses.  Because you will be the next target of his fists. \n\nGet counseling so you don't keep picking guys who are'fixer-uppers'.  And take self defense classes because this guy is dangerously unstable. ",
            "Break up. Encourage your ex to file a police report. Inform some friends/family you can trust in case your crazy bf decides to swing at you, too. ",
            "Dump the animal you call boyfriend. ",
            "Dump that guy. Thats very alarming and immature behaviour OP. ",
            "I'm sorry but this doesn't feel like the whole story, people usually don't just go beat someone up with ZERO reason... now if he did, hell yeah break up with him, but it's kinda fucked if you're manipulating the story to make your bf seem completely insane just for random people to validate your desire to dump him.",
            "Your \"boyfriend\" is a criminal who assaulted a stranger.",
            "Break up and run. He sounds like the type of person who will murder you if you leave him later on. You see it on the news all the freaking time. Leave now!!!\n\nI just want to add that men are not usually violent like this. I've dated a good amount of men and only one of them ever threaten to beat up a guy who was flirting with me. He was on drugs. Every other guy wouldn't even think to start an altercation unless I was in danger. This dude is an absolute psycho.",
            "Your bf is incredibly insecure and has violent tendencies. Make a list of his pros and cons. ",
            "You are dating a monster, how is not breaking up with him even in question?",
            "Your BF uses violence to solve his problems. Your ex was the target this time someone else may be this target in the future.",
            "RUN away from this relationship as quickly as possible.\n\n\nDo not pass go, do not collect $200.",
            "Your boyfriend sounds like a wolf in sheep's clothing who has insecurity and jealousy issues. I'd stay away from him, he had no right doing that. ",
            "Chad beats KHV again, feels bad man.",
            "Don't continue dating a man who let's his jealousy issues control him to the point that he will harm an innocent person. He may even harm other people you love or you if he let's his feeling control his actions that way",
            "> I don't know if I should break up with him or try and fix things.\n\nI would seriously like to know why you would even consider staying with someone who walks up to an innocent person and starts fighting them.  Like, how does your brain work?\n\nThis is not rocket science.  ",
            "Your BF decided to go pick a fight and beat up on someone because he has anger issues... it doesn't matter who he did that to - that it happens to be an ex of yours is not relevant honestly.\n\n\nAs humans we sometimes act without thinking.  Even if that was the case here, when you \"checked\" him by calling out this crap, he still shows no remorse.\n\n\ntl:dr; Your \"BF\" doesn't sound like he's a stable dude.  Sounds like he has rage issues still, break up and then watch out for any signs of stalking",
            "Break up with him.  He's violent and it wouldn't surprise me if he turns on you sooner or later.  This is a HUGE red flag. ",
            "You already know you need to leave him. This is an easy one. ",
            "Only fix things with him if you like dating someone who's in jail, because that's where your bf should be for being a shithead.",
            "Should you break up with him? Why is that even a question? Based on what you said he’s a violent criminal. \n\nBreak up with him. Encourage your ex to tell the cops about the assault. And in the future try to keep your ex very much out of your life when you have a bf. Having to deal with exes/baggage can stir up some powerful emotions in some guys and some guys just don’t know how to handle those emotions. ",
            "You're boyfriend is a douche. break up with him.",
            "Holy shit, this is terrible. I personally would end the relationship over this. I cannot believe he then turned it on YOU! ",
            "Your boyfriend assaulted someone out of nowhere. He's dangerous and i wouldnt be able to trust him with my well-being or safety ever again.",
            "OMG break up with him! He's a violent maniac! And trust me, if he's randomly attacking and beating up anyone he sees who has dated you, he'll be beating up anyone he thinks you may be seeing behind his back (and he WILL be sure to see them, i.e. any man you have a conversation with of one word or more), and he'll probably go on to beat you. But even if he didn't do any of that stuff, what he did to your ex is completely crazy and unforgivable. Your ex should tell the police and have him arrested for assault and battery.",
            "You just learned that your boyfriend is capable of committing a violent assault on another human being. That signals mental instability and a serious lack of impulse control. Are you comfortable with knowing that? If you value your self-dignity, you shouldn't want to stay with someone like that, because you could be the next victim. The best thing that could happen to both of you is to break up with him and encourage your ex to talk to the police.",
            "Ah, now you have 2 exes.",
            "Hyper aggressive dude that can't handle he isn't your one and only forever and ever?  Doesn't sound good to me.",
            "Bf beat your ex shows that he is jealous and controlling. Leave him before he becomes your abuser too. ",
            "Wow. Break up with your bf. He sounds crazy and scary.",
            "Get away from your boyfriend.  No sane, mentally stable person beats people up for no reason, and him thinking you don't love him because he did some crazy shit confirms it.  \n\nHe's not gonna take the breakup well.  like for real, this is gonna be the crazy ex that you tell your kids about one day.",
            "What a loser. By that I mean your boyfriend, not your ex.",
            "thats truly fucked up",
            "Im literelly shakeing",
            "\"You're right, I don't love abusive mad dogs with ego-masculinity complexes.\"   \n\n/end-relationship",
            "Yeah beating up an ex is mentally unstable. I didn't beat up the person that my ex said she was raped by and was still talking to him behind my back. Did you give your ex any reason to show him that you're still attached to him.. were you talking to him? I'm not saying it is justifiable but some people have been brutally hurt and are just angry which makes them such people. \n\nMaybe you should ask him to go to a counselor and work on his anger before you both should consider talking again. It just depends on how much you love him.. and how you both deal with the underlying issues. If you cheated on with him I could understand why he did this. ",
            "LOL. Your boyfriend just assaulted a random person for no reason and you need advice on the relationship? Jesus christ some people.",
            "Break up with him and tell your ex to press charges. ",
            "Well, ... *did* your boyfriend beat up your ex ... and especially, was it a non-provoked attack?  Sounds like you heard about it pretty indirectly.  Did your boyfriend admit it to you?  What did he say?  How 'bout ask your ex what happened - cut through several layers of indirection and get (at least probably) much closer to the truth of what actually did/didn't happen.  How 'bout other independent credible witnesses - can you ask them what happened?\n\nSo ... presuming your boyfriend launched an unwarranted unprovoked physical attack against your ex (e.g. your ex didn't start physical fight with your boyfriend that your boyfriend \"finished\"), dump your boyfriend - immediately, hard, cold - cut him off and out of you're life.  You can simply tell him in no uncertain terms that what he did was totally unacceptable, and that (you saying to him about your relationship with your boyfriend) \"our relationship is done\".  And that's it.  Done, finito.  You *don't* want to end up in the situation where he's beating up you, or your kids or whomever, because he judged someone's behavior unacceptable or not to his liking, or because he was jealous, or whatever.  So, ... presuming you've confirmed or get confirmation that he launched unprovoked physical attack against your ex, dump your sorry \\*ss \"boyfriend\" immediately, and never look back.\n\nIf on the other hand, you want to line yourself up for becoming an abuse victim and that's your relationship objective, and you wish to help endorse and support general \\*ssholery, then by all means stay with the current boyfriend.  ;-)  Yeah, ... don't do that.\n\nP.S. - my sister spent over 20 years (and with 3 kids) in a highly abusive relationship to herself and her kids ... you do *not* want to be or end up like that (complex PTSD, numerous suicide attempts by one of the kids, ... friggin' major disaster).",
            "> I don't know if I should break up with him or try and fix things. \n\nAre you perhaps a little bit simple? Why do you even need to ask this, that's ridiculous, leave, leave yesterday, if you don't leave right now don't complain when he inevitably beats you up, this is your warning, a massive fucking siren that says \"this guy is scum\".",
            "The fact that you have to ask makes me think it was you with the issues, not your ex.",
            "(English is not my first language, sorry for the mistakes) \n\nI'm gonna be the devil's lawyer here but before breaking up with him, you should try to see what happened and why he has done that. I mean there's obviously no good reason to hit someone who didn't do anything to you, but maybe understanding why he thought he needed to do that might be interesting. \n\nI don't say you shouldn't break up with him (I think you should) but before try to make him understand that what he has done was not right and that maybe he should go and see a therapist. This guy probably has some sort of mental issue and definitely needs to see a therapist. If he's girlfriend tells him to go see a therapist he might do so. \n\nIf you just leave him he's gonna get more angry (thinking you cheated on him with your ex) and even if he doesn't do anything to you or your ex, he's gonna end up with another girl and might hit her or someone from her family/friends. So yeah, if you just break up with him without trying to help him (not being he's therapist but asking him to go to see one), you're just moving the problem (your bf's violence) to somebody else.",
            "And they say girls don't like bad boys. Riiiggghhttt. ",
            "Dump this looser. Or if youre in Cali, have your bf meet me and see how it feels to get his ass whooped! ",
            "[deleted]",
            "I would’ve confronted him more calmly in regards to why he did it before going off. The way it sounds is that there’s some holes in the story and me giving him the benefit of the doubt,i don’t believe he or anyone in their right mind would attack someone the way your bf attacked your ex just because he was there. I think it could be deeper than that. But if he tells you he literally beat the crap out of him just to do so then you’re absolutely entitled to be angry about that. I say have a sit down calm collected conversation about it and then with the information you receive go from there with things. ",
            "[deleted]",
            "What your BF did is not okay. It's good you went off on him. The only way he should even be allowed to stay in your life is if he publicly begs for forgiveness from your ex."
        ]
    }
]